{"text": "Dude liked some titillating lady's fencing, I see.", "label": 0}
{"text": "The upper classes and middle class went to the beauty shop to have their hair done. Then slept with tissue paper on it to hold it in place.", "label": 0}
{"text": "Likely you wouldn't, you'd have friends who'd badger you and professionals who would give consequences until you found techniques to manage yourself. Not everyone, of course, society gave up on some people more than it does now, but that worked for most.", "label": 0}
{"text": "Damn she fine", "label": 0}
{"text": "https://preview.redd.it/ess7l3csrswd1.jpeg?width=960&format=pjpg&auto=webp&s=864f5faf700918d226bd7c490eb9ecb08af7603f", "label": 0}
{"text": "DC-10", "label": 0}
{"text": "She loved hats. I still have several very old hats of hers. Guess she started early!", "label": 0}
{"text": "Why?", "label": 0}
{"text": "I might be looking to much into it but...the symbolism of this scene just screams Communism for me. Taking away their individuality and simply turning them into parts of something bigger. \n\nBut maybe other states did similar things too. All I can think about is China who also demonstrated how their masses all serve as a part of something much bigger.", "label": 0}
{"text": "I like how the framed photos mirror how stuff is hung on the wall today.", "label": 0}
{"text": "My mother once did a compilation of my \"I'm sorry, what?\" face across the years, and I do very much appreciate that yours crosses generations", "label": 0}
{"text": "“Well, You Can Do Whatever You Want To Us, But We’re Not Going To Sit Here And Listen To You Badmouth The United States Of America.”", "label": 0}
{"text": "Dude I had a 90 Rx7 Turbo II. Man I miss that car, but had to buy a house. Sigh. Always liked that version of the MR2", "label": 0}
{"text": "Bro skipped leg day for all 3 of his legs", "label": 0}
{"text": "They’re also mostly short. While pop country singers are required to be 6’11’", "label": 0}
{"text": "dem jugs tho", "label": 0}
{"text": "Is that a clitoris?", "label": 0}
{"text": "Busby Berkeley was doing this stuff in Hollywood in the 1930s.\n\nAlso in the 1930s, Seigfried Krakauer came up with a name for it: the mass ornament. That is, it's an ornament, a decoration, made out of the bodies of the masses. He said the point of it is to erase the importance of the individual.", "label": 0}
{"text": "I was 9 and not into music yet but I remember it popped off. My sisters had the cassette and we jammed to it.", "label": 0}
{"text": "First album produced by Alex Chilton", "label": 0}
{"text": "She’s a tiger", "label": 0}
{"text": "And best friends! They traveled together!", "label": 0}
{"text": "Hot, hot hot", "label": 0}
{"text": "Ahh the good ol' days", "label": 0}
{"text": "That's, frankly, a somewhat awful photo.", "label": 0}
{"text": "This looks like a family photo to me, Mom's doing the shopping while her daughters stare off into space. The younger ones don't have their own carts or purses...\n\nSince no one asked.", "label": 0}
{"text": "That is probably the only album that I truly enjoy every song on it.", "label": 0}
{"text": "That was my first thought, also.", "label": 0}
{"text": "People would take hot baths in the uk ", "label": 0}
{"text": "Totally unnecessary. \n\n— Mitch", "label": 0}
{"text": "for reference, these are the ruins in Mitla in Oaxaca", "label": 0}
{"text": "Love this song, first time I've seen a video of it but unfortunately this is exactly the same track as I have on an old cassette somewhere and on a Spotify playlist, this is lipsynching, lol. I was hoping to see them actually performing the song, but like everything on TV back in the day, they were mouthing and pretending to a track playback.", "label": 0}
{"text": "I cannot stop giggling at this. Love those faces!", "label": 0}
{"text": "Not enough chain smoking going on.", "label": 0}
{"text": "😱 the wallpaper.  Family pictures spread over the walls.  Why they crossing each others leg?", "label": 0}
{"text": "Guess he laid off the steroids after the Rambo movies. That ain't julienne salad.", "label": 0}
{"text": "what is a long generation?", "label": 0}
{"text": "I was practically laughed out of a thread for asking why a pic of GH Bush looking out over some hurricane devastation or something was in black and white. I was instructed that the picture was likely for newspapers so why on the heavenly earth would they go to EXTREME effort and cost to take the pic in color.? I’m still confused why…", "label": 0}
{"text": "No more rhymes now, I mean it!!", "label": 0}
{"text": "Not a cellphone in sight, just living in the moment!", "label": 0}
{"text": "Must’ve bulked up for Cliffhanger in 95", "label": 0}
{"text": "They’re only just hitting 70 so most are probably still around somewhere", "label": 0}
{"text": "Lol what weird things to care about", "label": 0}
{"text": "Guys and their pantaloon fetishes…", "label": 0}
{"text": "GO ILLINI GO", "label": 0}
{"text": "/u/repostsleuthbot", "label": 0}
{"text": "I didn't find any posts that meet the matching requirements for r/OldSchoolCool.\n\nIt might be OC, it might not. Things such as JPEG artifacts and cropping may impact the results.\n\n[View Search On repostsleuth.com](https://www.repostsleuth.com/search?postId=1gbc913&sameSub=false&filterOnlyOlder=true&memeFilter=false&filterDeadMatches=false&targetImageMatch=92&targetImageMemeMatch=97)\n\n---\n\n**Scope:** Reddit | **Target Percent:** 92% | **Max Age:** Unlimited | **Searched Images:** 625,453,527 | **Search Time:** 0.14577s", "label": 0}
{"text": "/u/bot-sleuth-bot", "label": 0}
{"text": "My father was almost 50 when I was born and I was his only child, so he's Silent Generation. My grandmother was born in the very early 1900s. I am an Xiennial. Kids are born late in life on my dad's side. So generations are long.", "label": 0}
{"text": "Lies", "label": 0}
{"text": "![gif](giphy|l378gODdla75xN0CA)", "label": 0}
{"text": "![gif](giphy|8d5PglNvkun10hIX49|downsized)", "label": 0}
{"text": "I do feel like we should encourage women to consider reductions as they get older because of the numerous effects on their life.", "label": 0}
{"text": " She looks stunning 😍 Love her dress!", "label": 0}
{"text": "Me too!", "label": 0}
{"text": "You accept reality and do the best you can to delay the aging process by eating healthy and exercising.", "label": 0}
{"text": "The original bad ass.", "label": 0}
{"text": "She was not 28, she was born in 1822", "label": 0}
{"text": "I'll bet she got a SAG award", "label": 0}
{"text": "IIRC Stallone greatly regrets this relationship... I seem to recall reading that she had made it her mission to pursue him, almost to the level of stalker, as she was seeking fame for herself. She had been extremely effective in making herself appealing to him, but it was all an act.", "label": 0}
{"text": "Damn look em dem tiddies", "label": 0}
{"text": "Almost poked my eyes out", "label": 0}
{"text": "Beautiful b...s", "label": 0}
{"text": "Every person that come into contact with Anna maybe bar her son failed her. The world failed her. Sad but true", "label": 0}
{"text": "Ooh, never noticed", "label": 0}
{"text": "https://preview.redd.it/dkx9y6xe8ywd1.jpeg?width=700&format=pjpg&auto=webp&s=d231b3ed61180a35440bbec5e0f5c0601b2f57b5", "label": 0}
{"text": "![gif](giphy|xT8qBeueSfGaLcX6us)", "label": 0}
{"text": "This picture is the most I've ever seen him smile with her 🤣", "label": 0}
{"text": "Looks at what religion does to what Christ tried to teach. 🤦🏻‍♂️", "label": 0}
{"text": "Flava flav", "label": 0}
{"text": "Trim spa baby", "label": 0}
{"text": "She knew how to get in the media...", "label": 0}
{"text": "![gif](giphy|3o7TKoHNJTWWLgljYQ)", "label": 0}
{"text": "![gif](giphy|hGwvzBNwXDwlO)", "label": 0}
{"text": "\"Tell Cersei. I want her to know it was me.\"", "label": 0}
{"text": "And then as you get older it’s shocking.", "label": 0}
{"text": "THIS is old school cool, not \"look how hot my mom was.\"", "label": 0}
{"text": "I’m an absolute psycho.", "label": 0}
{"text": "They don’t ….\n\nThen I wore a suit for 10 years …. \n\nWe’re done here lo\n\nBlocked .", "label": 0}
{"text": "True, and it’s what I prefer.", "label": 0}
{"text": "Funny cuz you’re right, most of it was because of consequences, but people don’t like that they like to imagine she didn’t do anything wrong", "label": 0}
{"text": "Wow really looks fantastic for her age ", "label": 0}
{"text": "thats creepyhistory, not old scholl cool...", "label": 0}
{"text": "Got my hair cut like this in 87 and I was legit 🔥🔥🔥🔥☄️☄️☄️", "label": 0}
{"text": "Waffle time! It’s waffle time!\nWon’t you try these waffles of mine?", "label": 0}
{"text": "Through her NOSE??!  \n\nshit.", "label": 0}
{"text": "What hump?", "label": 0}
{"text": "I’m just gonna go find a cash machine…", "label": 0}
{"text": "That must have been an awfully cold theater!", "label": 0}
{"text": "I actually use this when people ask absurdly stupid questions.  ", "label": 0}
{"text": "Also the last Kubrick premiere. He was already dead when the film was finished.", "label": 0}
{"text": "![gif](giphy|WPumBjHJJB7gLIKyNE)", "label": 0}
{"text": "Looks like she enjoyed it…", "label": 0}
{"text": "*Translation by Reddit Translate*\n\n\"You're absolutely right. I have no facts and evidence to back up my claim, but instead of backing down I'm going to claim that you're stupid, then go on to suggest that I don't intend to reply again in this thread.\"", "label": 0}
{"text": "Yeaaa I saw those run and gun training sessions too! She was every bit as good as Keanu.", "label": 0}
{"text": " Such a classic collab! Love the energy in that studio.", "label": 0}
{"text": "So ur hot and rich.", "label": 0}
{"text": "..are you missing an /s here?", "label": 0}
{"text": "I’ve been wondering! BAPS is also an acronym for a specific Hindu sect (they built huuuuuuuge temples in New Jersey, Atlanta, and some other places in the US).", "label": 0}
{"text": "No, Donny. These men are cowards.", "label": 0}
{"text": "Did the store behind her magically ignite? Berlin was bombed almost every day for a period of WW2, I don’t know what history you are reading", "label": 0}
{"text": "Or...all I want for Christmas is the mask", "label": 0}
{"text": "The show was so cringe 🤣", "label": 0}
{"text": "Didn’t that kid have stretchmarks around his mouth?", "label": 0}
{"text": "You can probably open a Amazon package with those.", "label": 0}
{"text": "Old school pitiful", "label": 0}
{"text": "No. They are both fine as hell.", "label": 0}
{"text": "Puppies actually", "label": 0}
{"text": "What a rise and fall story", "label": 0}
{"text": "STAY OUT OF MALIBU LEBOWSKI!", "label": 0}
{"text": "Pretty sure that’s not Kurt", "label": 0}
{"text": "Definitely could have been the interior emotions or maybe you just weren’t old enough to process it or maybe it really made an impression on you but could understand it so you rejected it.  I kind of had a similar experience with The Matrix which was basically the first R rated movie I ever saw and I was only like 11 years old.  I didn’t really enjoy it at all on my first viewing.  Probably because it gave me too much anxiety from not having  the life experience to process what I was seeing.", "label": 0}
{"text": "There’s more than a one in three chance she was shouting damn the Jews 10 year earlier. \n\nThere’s a near 100% chance she did nothing after the Kristalnacht, or later when her Jewish neighbours started disappearing. \n\nWar is hell, but it doesn’t happen in a vacuum. \n\nWe shouldn’t unequivocally mourn the German victims of World War II. The majority were happy to tolerate violent depravity so long as it didn’t affect them, and a sizeable number actively cheered it on", "label": 0}
{"text": "Was she ever not gorgeous?", "label": 0}
{"text": "I used to do that….", "label": 0}
{"text": "how sad, i would be sad if a daughter of mine acted this way towards guys", "label": 0}
{"text": "She gets a lot of recognition.  There were thousands of people who put their lives and livelihoods on the line to help smuggle slaves into free states.  Most people can only name a few - Harriot Tubman being one of these.", "label": 0}
{"text": "Eyes wide shut, headlights full beam.", "label": 0}
{"text": "Oh, you thought my comments were not ironic ", "label": 0}
{"text": "Disgusting", "label": 0}
{"text": "Brant can't watch", "label": 0}
{"text": "Two icons", "label": 0}
{"text": "She slated him mercilessly after their divorce, small dick, bad in bed, the whole nine yards. She was talentless & made a few terrible movies, red Sonia was the big one.", "label": 0}
{"text": "Damn Mommy.", "label": 0}
{"text": "What I think is that I’m tired. 🥱", "label": 0}
{"text": "she was never attractive to me personally growing up and the flavor flav show well she was way past her prime so really unattractive to me.\n\nim more these types:\n\nalyssa milano\n\nlacey chabert\n\nlucy liu", "label": 0}
{"text": "For showing underballs in short shorts", "label": 0}
{"text": "Maybe the OPs are siblings?", "label": 0}
{"text": "For reals. Seeing what a fresh-faced cutie she used to be makes me sad.", "label": 0}
{"text": "Drew must have been taking the picture.", "label": 0}
{"text": "Can you please share some proof?", "label": 0}
{"text": "Lol.  So every woman walking around in a bikini or showing cleavage is flashing in your opinion. Your opinion is Ludicrous, unless you live in Iran maybe.  ", "label": 0}
{"text": "He was talking about WWI. In that sense he is right; Germany was the attacker for basically all of WWI, and while there was of course food scarcity, civilians didn’t suffer attacks in cities like Berlin.", "label": 0}
{"text": "Kong dong?", "label": 0}
{"text": "I didn't know that shell shock had a mascot.", "label": 0}
{"text": "I have never seen a woman go from stunning to a hot mess like her", "label": 0}
{"text": "Eyes wide open.", "label": 0}
{"text": "Come to think of it, what is that guy holding??", "label": 0}
{"text": "It's a rough business.  If she *doesn't* try to keep herself looking young, she would lose work.  If she *does* do it, over time she starts to look unnatural.  Tough choice.", "label": 0}
{"text": "I have a bikini fetish that gets amplified by roller skates.", "label": 0}
{"text": "What an excellent day to be bisexual", "label": 0}
{"text": "What’s the source?", "label": 0}
{"text": "Someone get that girl a cardigan, she'll catch her death!", "label": 0}
{"text": "FLAVA FLAAAV", "label": 0}
{"text": "I was sure I'd be the one to post that. I was just checking thinking \"Yeah, that'd be my one. No-one else will have immediately heard Mrs. Scorsese in their head saying \"One dog looks east, the other dog looks west, so what?\" But no. You had to ruin it for me. 😆", "label": 0}
{"text": "+5 bonus points to anyone who can name the movie.", "label": 0}
{"text": "She really was amazing. Those training videos were really something. I would love to see her in more action films as a lead character. She's such an under utilized talent.", "label": 0}
{"text": "![gif](giphy|135E47VKw6TM6A)", "label": 0}
{"text": "Your own definition says briefly.", "label": 0}
{"text": "Close enough", "label": 0}
{"text": "He's got a nice head of white hair. Looks like someone we know.", "label": 0}
{"text": "Really? She’s just a plain boring white chick. You see hotter girls every day in LA.", "label": 0}
{"text": "It instead attracted the predator", "label": 0}
{"text": "Can someone photoshop to get rid of her bikini?", "label": 0}
{"text": "![gif](giphy|zoMno34V30kla)", "label": 0}
{"text": "Google Tara Reid Special Forces.  It’s a reality competition show she was on recently.  She’s aged, just like anyone else.  The smoking i’m sure isn’t helping.", "label": 0}
{"text": "Careful kid, she’ll poke your eye out.", "label": 0}
{"text": "![gif](giphy|LmxxotgMjTj32)", "label": 0}
{"text": "Surgeries F’ed her up;  shame", "label": 0}
{"text": "You sticking your opinion where it doesn't belong is fucking creepy", "label": 0}
{"text": "Ok?", "label": 0}
{"text": "Looking back it was kinda odd how in the late 90s it became hip for these mega stars and models to wear tshirts and other non-runway items on the runway and red carpet.", "label": 0}
{"text": "It's *Smoke On The Water* that got universally banned from guitar stores, not Stairway. Even today, try playing it in a guitar store and see how you get treated", "label": 0}
{"text": "Niiiiples", "label": 0}
{"text": " Wow, what a duo!", "label": 0}
{"text": "Boob", "label": 0}
{"text": "It was the style at the time to dress like you had just left your couch after forgetting what day it was.", "label": 0}
{"text": "Lmao!!!", "label": 0}
{"text": "Nielsen bounced back after her divorce...\n\nhttps://preview.redd.it/mrqkuw69eywd1.jpeg?width=300&format=pjpg&auto=webp&s=cfb6080a8278ee125d1a9f15a93c1d33c81f02c1", "label": 0}
{"text": "But as we all know,  net worth doesn't necessarily mean having a million dollars in one's account hence why she was still fighting over that guys will", "label": 0}
{"text": "Juliette Lewis is a time traveller?", "label": 0}
{"text": "What a fox!!", "label": 0}
{"text": "As my departed father used to tell me \"Son..........NEVER stick your dick in crazy\".  Tru Dat pops", "label": 0}
{"text": "He was in a car accident I believe.", "label": 0}
{"text": "Look again and maybe your day will perk up.", "label": 0}
{"text": "Gold!", "label": 0}
{"text": "She could femdom the hell out of me...", "label": 0}
{"text": "Nips tho", "label": 0}
{"text": "She did it.", "label": 0}
{"text": "She was really beautiful.", "label": 0}
{"text": "So, there were not 2 bald midgets under there!", "label": 0}
{"text": "Reading skill for god sake i talk ww 1 not 2", "label": 0}
{"text": "Also read part of the reason for their split was because he learned she made it with a woman.  She looks like a man eater; someone who just toys with you, then kicks you to the side of the road.", "label": 0}
{"text": "Thought the same", "label": 0}
{"text": "Love it!", "label": 0}
{"text": "You did not mention WW1, and this is a post about WW2. My bad for not reading though the entire comment thread", "label": 0}
{"text": "era appropriate", "label": 0}
{"text": "She was beautiful man", "label": 0}
{"text": "Im pretty sure, thé mom found explicit texts between woody and his 18 year old step daughter. Stop defending pervs", "label": 0}
{"text": "Is this a \"-There's nothing funny about ww2, my grandpa died in nazi Germany during the war. -Really? -Yeah, he had a heart attack and fell down from his guard tower.\" joke?", "label": 0}
{"text": "😂😂", "label": 0}
{"text": "Think for a minute, great song.", "label": 0}
{"text": "Alberta", "label": 0}
{"text": "I wasn't defending Woody Allen; I was defending Prince Charles.", "label": 0}
{"text": "Nothing but class.", "label": 0}
{"text": "![gif](giphy|3o72EYbnty5ly0kvja)", "label": 0}
{"text": "Whoops sorry", "label": 0}
{"text": "She looks pissed af and I don’t blame her one bit.", "label": 0}
{"text": "I love people downvote the truth.", "label": 0}
{"text": "Yes, that’s her uncle. ", "label": 0}
{"text": "Honestly, after armageddon it's going to be 90s Tauruses driven by our new cockroach overlords O:-)", "label": 0}
{"text": "I was gonna say, Harriet Tubman's contributions are widely taught and recognized in pretty much every school I've seen.", "label": 0}
{"text": "Downvote the truth. Lol", "label": 0}
{"text": "Eyes Wide Open!", "label": 0}
{"text": "I rewatched it and she really isn't the trainwreck everyone remembers her as. She was just a high spirited individual. \"Oh she was high alright\" maybe so but that was also just had a fun loving personality", "label": 0}
{"text": "No problem. I can see how that could have been misinterpreted. I watched the Ronan Farrow doc on HBO a few weeks ago; definitely not a Woody fan.", "label": 0}
{"text": "He's wearing a crucifix so it's okay.", "label": 0}
{"text": "He totally hit on her after this picture.", "label": 0}
{"text": "It was definitely not a big movie when it was released.", "label": 0}
{"text": "Uma imagem simplesmente linda.", "label": 0}
{"text": "RIP Anna", "label": 0}
{"text": "The plastic surgery is the real kicker, imo.", "label": 0}
{"text": "Alcohol ruined her.", "label": 0}
{"text": "It says breasts not cleavage, not side boob, not under boob.  The whole breast, yes including the nipple.", "label": 0}
{"text": "sent you a message", "label": 0}
{"text": "Piece of ass", "label": 0}
{"text": "She’s so gorgeous.", "label": 0}
{"text": "They're gonna kill that poor woman!", "label": 0}
{"text": "That's not true at all lmao", "label": 0}
{"text": "She really felt the painful spice up in her sinuses (which appears to happen to guests on the show somewhat frequently).  \nShe was drinking milk, which wasn’t helping her nose, so she got the idea to try to snort some by dunking her nose in the glass.  \nIt went about as well as you’d expect.", "label": 0}
{"text": "forgot they were married", "label": 0}
{"text": "1999 is middle school!", "label": 0}
{"text": "What is a paintress?", "label": 0}
{"text": "This is what happens when you FIND A STRANGER IN THE ALPS!", "label": 0}
{"text": "Where is the German?", "label": 0}
{"text": "The nipple is part of the breast, for sure. Your definition does not say the whole breast.", "label": 0}
{"text": "Growing up in the 90s I didn’t even know about this movie until the late 2000s.", "label": 0}
{"text": "I have had a crush on that man ever since I saw him as Malcom on The Young and the Restless", "label": 0}
{"text": "I miss when people wore every day normal clothes to premieres and events like this", "label": 0}
{"text": "Pretty sure that’s her son.", "label": 0}
{"text": "Heaton is certainly a great lyricist and which is quite rare a throughly decent chap.", "label": 0}
{"text": "She looks like the female version of the Russian he fought\n\n![gif](giphy|11sN6nMjLT2INO)", "label": 0}
{"text": "Eyes wide open and pokin", "label": 0}
{"text": "Not.a flattering picture….", "label": 0}
{"text": "She's going to be on the $20US bill in 2030", "label": 0}
{"text": "She was going to be on the $100... mysteriously cancelled when Trump was elected...", "label": 0}
{"text": "So edgy", "label": 0}
{"text": "The last movie I ever paid to see.", "label": 0}
{"text": "“You’re not blowing…”", "label": 0}
{"text": "He’s 54 now and was 47 when SWAT started.", "label": 0}
{"text": "Nip wide left", "label": 0}
{"text": "She's pretty old, but I bet not too old for the Soviet soldiers", "label": 0}
{"text": "I'm not you can literally be a metaphor.", "label": 0}
{"text": "Those are some strong genes", "label": 0}
{"text": "It sounded fake to me too, but it's for real. \n\nI don't think I can link it in this sub, but I found a People article from July 16 of this year that refers to it as \"a surprisingly casual red carpet at the July 13, 1999, premiere of Eyes Wide Shut in Los Angeles\" and said \"Even Tara Reid was on hand to see what Kubrick had in store in the much-talked-about film\" and she's wearing exactly this. Other pictures from this event show her with Michael Flatley, the Riverdance guy, for some reason.", "label": 0}
{"text": "That’s not a very flattering picture.", "label": 0}
{"text": "This sub is so lame", "label": 0}
{"text": "![gif](giphy|relnvfSEa2Qa125uPA)", "label": 0}
{"text": "A fabulous contribution from /u/FapDonkey", "label": 0}
{"text": "I am the walrus.", "label": 0}
{"text": "She was in that movie? I can’t remember… I’m old.", "label": 0}
{"text": "Except this happens every day in countries where speedos are the norm.", "label": 0}
{"text": "Were...the years were not kind", "label": 0}
{"text": "That was a fun fad.  Totally impractical, but imaginative.", "label": 0}
{"text": "You can help make someone a famous actor by supporting them while they're getting started and using your connections to get them cast in things. \n\nYou can't just make somebody a dentist because you're a successful dentist.", "label": 0}
{"text": "Going to sound weird, but it is a blessing and a curse. I’m ok with the inevitable downvotes and I don’t even comment often so it’s fine. Blessing because yes everyone notices you and it can be easy to get someones attention because of course one of the first things people see is how you look. It can also be a little off putting though. Always getting the feeling of being stared at and having to wonder what peoples real motives are, especially with new friendships/relationships. It kind of makes you keep a small guard up.", "label": 0}
{"text": "nipples", "label": 0}
{"text": "If you've got 'em, flaunt 'em.", "label": 0}
{"text": "He looks prettier than her", "label": 0}
{"text": "Pretty much *everyone* in England is a third cousin N times removed of Richard III. Benedict can just demonstrate how.", "label": 0}
{"text": "well she was the russians wife….", "label": 0}
{"text": "Any idea how tall she was? She must be tiny", "label": 0}
{"text": "Chilly on the red carpet", "label": 0}
{"text": "Shut the fuck up, Donny", "label": 0}
{"text": "That’s an embarrassingly poor take.", "label": 0}
{"text": "\" Honey why are you motorboating the computer screen ? \"", "label": 0}
{"text": "Not the first woman Kirk laid his pen on and made his mark", "label": 0}
{"text": "Her son.", "label": 0}
{"text": "Not a log, I don’t have a log. Oh hi Rusty", "label": 0}
{"text": "The HVAC  tech should win a medal !!!", "label": 0}
{"text": "It’s blue.", "label": 0}
{"text": "Xanadu", "label": 0}
{"text": "Sure, and the breasts are not exposed.  Her bikini top over her breasts are exposed.  Ya know, like when someone wears a bikini.  Is taking off a shirt at the beach with a bikini on underneath it....flashing?  Of course not.  Get over yourself.", "label": 0}
{"text": "Very cool by the looks of it", "label": 0}
{"text": "You should find a new optometrist", "label": 0}
{"text": "One of my faves 👌🏽", "label": 0}
{"text": "That’s before we knew what those warlocks looked like.", "label": 0}
{"text": "Well if people want to take my anecdotal experience as fact, then that's problem.", "label": 0}
{"text": "Beautiful smile", "label": 0}
{"text": "![gif](giphy|3ohhwfAa9rbXaZe86c|downsized)", "label": 0}
{"text": "She destroyed her career, like so many other women did with plastic surgery. You can see that she didn't need it.", "label": 0}
{"text": "This guy boobs", "label": 0}
{"text": "One of America's greatest heroes right there", "label": 0}
{"text": "Not 1984. He would have been 1.", "label": 0}
{"text": "Serious question, why is r/OldSchoolCool suddenly flooded with Stallone pictures? It seems like every day there’s a new post.\n\nI like Sly but it’s a bit much. Is it guerilla marketing for Tulsa King or something?", "label": 0}
{"text": "Looks like she's about to say \"I'll kick yo ass, get over here!\"", "label": 0}
{"text": "“You’re a man,,, she’s Italian,,”", "label": 0}
{"text": "Sadly my husband passed in 2002", "label": 0}
{"text": "![gif](giphy|26hpKMTa5HgdSMhRC)", "label": 0}
{"text": "You can't hug every cat", "label": 0}
{"text": "While I agree in spirit...yeah, I laughed. Hey I've been compared to far worse than ET.", "label": 0}
{"text": "Coldschoolcool", "label": 0}
{"text": "Lmfao all the downvotes show how much Reddit knows about breast tissue, not much. Large breast implants do not weigh as much as real boobs", "label": 0}
{"text": "It’s still kinda weird though right? Like can we acknowledge that?", "label": 0}
{"text": "Yeah, that's a face that's seen some shit.", "label": 0}
{"text": "That’s quite the adventurous bikini for 1953. If you had said 1983, I would have believed you.", "label": 0}
{"text": "https://i.redd.it/ovmn93yumywd1.gif", "label": 0}
{"text": "Never went back to church camp after that year", "label": 0}
{"text": "Had such a huge crush on her back then", "label": 0}
{"text": "Nipples = Ticket Sales", "label": 0}
{"text": "Neat ", "label": 0}
{"text": "Nobody I would be able to name, but it's definitely not whoever these people are.", "label": 0}
{"text": "It successfully shifted the predator's blood flow to less dangerous body parts to her offspring.", "label": 0}
{"text": "She was good Milk back in the day", "label": 0}
{"text": "Eraser nips yay!", "label": 0}
{"text": "This sub is fucking pathetic", "label": 0}
{"text": "Has been for awhile", "label": 0}
{"text": "Yeah the density is totally different, isnt it? Tissue and cells weigh more than water molecules", "label": 0}
{"text": "Casual racism vibes with you", "label": 0}
{"text": "* Real American Badass, Harriet Tubman, 1911", "label": 0}
{"text": "That’s an entirely different scenario. That has nothing to do with ANS’s situation. She didn’t have massive breasts to begin with, and early implants caused all sorts of different problems. They were really learning what not to do each time there was a new negative side effect. Early implants very often leaked toxins into the body and/or were rejected by the tissue surrounding the implant. Pretty gross shit if you ask me.", "label": 0}
{"text": "More like Eyes Wide Open at Nips Wide Shut", "label": 0}
{"text": "Sure. I will DM you.", "label": 0}
{"text": "What does the color of their skin have to do with anything?", "label": 0}
{"text": "70s fashion 👌", "label": 0}
{"text": "Her death in it is legit sad.", "label": 0}
{"text": "I think my weight went up like 2.5 lb when I get 800 cc which is probably what she had too", "label": 0}
{"text": "That line in Tango & Cash: “I hate Danish”.", "label": 0}
{"text": "A million dollar net worth for a Celebrity who married a super rich dude really ain’t shit.", "label": 0}
{"text": "What makes it weird? She's showing off her bikini. Apparently that's her son. With no context it's odd at best.", "label": 0}
{"text": "She's on molly or some other amphetamine there...lol", "label": 0}
{"text": "She has that Pre-Raphaelite model look.", "label": 0}
{"text": "My very heterosexual (now late) wife said Halle is the one woman that would make her at least bisexual, if not outright homosexual.", "label": 0}
{"text": "IIRC. the old rich Texan who married her was so wealthy while she didn't get the money, it seems she was entitled to interest on the money by a judge. The interest alone would make her rich too. Have no idea if she ever got it.", "label": 0}
{"text": "Nothing. Just getting that vibe", "label": 0}
{"text": "Friends with jedward I hear. #Jepic", "label": 0}
{"text": "Jamming *for* the Monkeys. They didn't write their own music, right? Might not be the most skilled improvers", "label": 0}
{"text": "Trash", "label": 0}
{"text": "Rapist", "label": 0}
{"text": "Double tap", "label": 0}
{"text": "Yeah her eyes that’s exactly where I first looked at her right in them nip nipping eyes yeah that’s right her eyes what color were they again.", "label": 0}
{"text": "I was 15 in '99...as you can imagine I was a big Tara Reid fan", "label": 0}
{"text": "Almost had my eye out", "label": 0}
{"text": "1 of 1s heard Flamingnosis playing in their head when they saw these photos.", "label": 0}
{"text": "Ol crosseyed nipples.", "label": 0}
{"text": "**Jesus!**", "label": 0}
{"text": "If they had a baby, it would be a model before it could walk.", "label": 0}
{"text": "Her breasts are exposed. We already went over this, breast does not = nipple. Breast is the whole organ, most of her breast tissue is exposed. \n\nAgain, the intention behind the action in the picture is sexual.", "label": 0}
{"text": "![gif](giphy|PaDc0tDWmxCW4)", "label": 0}
{"text": "I very confidently said \"red\" ![gif](emote|free_emotes_pack|facepalm)", "label": 0}
{"text": "Nipple ring too", "label": 0}
{"text": "This link has been shared 1 time.\n\nFirst Seen [Here](https://redd.it/1gbyc31) on 2024-10-25. \n\n---\n\n**Scope:** Reddit | **Check Title:** False | **Max Age:** None | **Searched Links:** 0 | **Search Time:** 0.00679s", "label": 0}
{"text": "Man, I have got to start going to the gym.", "label": 0}
{"text": "NSFW... OMG. I'm in public.", "label": 0}
{"text": "![gif](giphy|fVtcfEXWQJQUbsF1sH|downsized)", "label": 0}
{"text": "I know her from that Flava flav reality show. She was hot back in the day", "label": 0}
{"text": "The link show a Campbell’s soup cans was an Andy Warhol design. 😂", "label": 0}
{"text": "Yeah I’m kinda confused why should we feel bad again", "label": 0}
{"text": "She looks fun", "label": 0}
{"text": "Yes, but Lenny Kravitz looks like Lenny Kravitz.", "label": 0}
{"text": "Oh come on lets not pretend we dont understand nuance. The way ANS is pulling her dress up to show off her body is intending to flash what is underneath. It is a gaudy, sexual gesture as opposed to women walking around the beach with a bikini on. Time and place for everything. If she was on a beach in a bikini, striking a normal pose with her son next to her no one would bat an eyelid. Its the obvious flashing for no apparent reason next to a minor that quite rightly leaves a bad taste.", "label": 0}
{"text": "Yeah I was commenting on weight.  We're hers that 'early'?", "label": 0}
{"text": "Smolpox.", "label": 0}
{"text": "E.T. phone home 😂😂", "label": 0}
{"text": "We should just rename this sub to r/oldschoolboobs", "label": 0}
{"text": "Zidaillo?", "label": 0}
{"text": "scary!", "label": 0}
{"text": "I'm gonna guess they meant they wish she wouldn't have had cosmetic surgeries and had instead chosen to age naturally.", "label": 0}
{"text": "https://preview.redd.it/72fcfebqpywd1.jpeg?width=1536&format=pjpg&auto=webp&s=2735600e216186fe32594f64a0cf30646ed1422c\n\nAlan Jones and I taken this year in Marrakesh", "label": 0}
{"text": "How you gonna keep ‘em down on the farm after they’ve seen Karl Hungus?", "label": 0}
{"text": "It’s back when her nipples went in the proper direction.", "label": 0}
{"text": "Pre boob job?", "label": 0}
{"text": "Eyes Wide Shut after nips poke them", "label": 0}
{"text": "I'm listening to a podcast atm which is 30 minute breakdowns of figures of historical importance, and they covered Harriet Tubman. Lady was a legit superhero, despite massive amounts of pushback at almost every turn. Everyone needs to know her story.", "label": 0}
{"text": "Eyes wide shut and nips full out", "label": 0}
{"text": "Obviously you’re not a golfer 😛", "label": 0}
{"text": "Everything you say might be true, but its estimated over 2 million German women were raped by the Red Army in 1945. And we have no idea how much of her family and friends didn't survive the war.", "label": 0}
{"text": "![gif](giphy|Ixrim3BfmPd0A)", "label": 0}
{"text": "![gif](giphy|ZlPVlLqlHWhqM)", "label": 0}
{"text": "Sure, and I'm pointing out that many women don't do that because of attitudes that they are \"perfect as is\". Naturally aging means not remaining as is.", "label": 0}
{"text": "Agreed", "label": 0}
{"text": "![gif](giphy|kcHaBacZcF0lrH3cm6)", "label": 0}
{"text": "Where is this gif from?", "label": 0}
{"text": "The body.", "label": 0}
{"text": "Fml", "label": 0}
{"text": "Pedo trash.", "label": 0}
{"text": "Love her music! Shch a great artist.", "label": 0}
{"text": "IIRC it wasn't just a bad boob job, they did a tummy tuck (or something) and wrecked her abdomen.", "label": 0}
{"text": "![gif](giphy|pReb5Koy6JmihUYBLx|downsized)", "label": 0}
{"text": "Why is she smiling?", "label": 0}
{"text": "Hysteria /s", "label": 0}
{"text": "Goodbye Mr. Foley", "label": 0}
{"text": "She did a guest appearance in  Ghosts", "label": 0}
{"text": "The original free runner ", "label": 0}
{"text": "BALLISTICS", "label": 0}
{"text": "Good should have been on there for decades already", "label": 0}
{"text": "Time has made me really appreciate the fact she was in a few movies I really loved, and she was a major reason why. I figure this sub especially should be about remembering stuff from back in the day with a new perspective. Plus, her smile.", "label": 0}
{"text": "Yes, that was it.  Thx", "label": 0}
{"text": "this entire sub is an excuse to look at nipples prove me wrong", "label": 0}
{"text": "She was just as likely to be a rawly antisemitic party member or even block leader.", "label": 0}
{"text": "https://preview.redd.it/gi2stf0trywd1.jpeg?width=720&format=pjpg&auto=webp&s=d1513deb321e93e33e77b8e3f7f7f974617a24b3", "label": 0}
{"text": "Got me with them nips. Not gonna lie 😜", "label": 0}
{"text": "Oh no, my young Jedi. You will find that it is you who are mistaken about a great many things.", "label": 0}
{"text": "She certainly does.", "label": 0}
{"text": "This comment has never been funny or creative.", "label": 0}
{"text": "A “sex object” wtf? Is English not your first language?", "label": 0}
{"text": "Well he did grow up to die of a drug overdose. This photo doesnt exactly provide a good basis for a solid upbringing. Poor wee guy probably saw a lot he shouldnt have seen.", "label": 0}
{"text": "![gif](giphy|l2JJHsjfovpnu3n8c)", "label": 0}
{"text": "She suits orange!", "label": 0}
{"text": "She knew what she was working woth", "label": 0}
{"text": "Just humans being very normal", "label": 0}
{"text": " What a classic look! Love the vintage vibe.", "label": 0}
{"text": "Classless 😂😂😂.. But Funny", "label": 0}
{"text": "He answered questions for a time waaaaaaaay back when on Ain't it Cool News, and someone asked him something like if he had any regrets about Rocky IV, and he responded that he wishes he had married Dolph instead.", "label": 0}
{"text": "Didn't she end up boinking Flava Flav on some reality TV show after this?", "label": 0}
{"text": "what do you think she was trying to sell for her look when she model for playboy, school bus driver with a pension?", "label": 0}
{"text": "…and then he parted the red sea", "label": 0}
{"text": "I somehow expected that response even though we have no idea what this old woman's story is. I can say with certainty Hitler didn't do well in Berlin back when Germany still had elections.", "label": 0}
{"text": "Kind of has an Anna Taylor-Joy vibe to her.", "label": 0}
{"text": "You called?", "label": 0}
{"text": "My Eyes Wide Shut are up here.", "label": 0}
{"text": "So he cuckolded Drago in real life? \n\nRocky doesn't pull any punches.\n\nIt's wild he's Eskimo brothers with Fkava Flav.", "label": 0}
{"text": "Old school chilly", "label": 0}
{"text": "Well their skin color is irrelevant. If they were white it would almost certainly only be worse. It's not really any attribute in particular It's really all of them combined.", "label": 0}
{"text": "Nothing  like  a lady not wearing  a bra 👌🏿🥃🚬", "label": 0}
{"text": "They were pretty badly botched, unfortunately", "label": 0}
{"text": "Careful there's a drink here man!", "label": 0}
{"text": "![gif](giphy|v8xmVfox6XOq4)", "label": 0}
{"text": "No, the ww2 ended for germans on the 8th may 1945.", "label": 0}
{"text": "Eat a sammich!", "label": 0}
{"text": "Pork chop sandwiches!", "label": 0}
{"text": "If you go there now it's still fit people all skating, biking, jogging and skateboarding.   Venice Beach is where you go to kind of see and be seen doing that stuff.    \nFat people aren't out there doing those things with their shirt off.", "label": 0}
{"text": "I am serious, and don't call me Shirley.", "label": 0}
{"text": "She looks a bit like a mix of Shania Twain and Amy Winehouse", "label": 0}
{"text": "I’d venture that the red carpets of yesteryear and the golden age of Hollywood were slightly more formal than today. I may be wrong. Arguments could likely be made for either era here.", "label": 0}
{"text": "In what world are boobs not cool?? This is an old school picture... sooo by my calculations 🤓  boobs+old school=r/oldschoolcool", "label": 0}
{"text": "Tell me about this folk band.  I’ve never heard this rock story", "label": 0}
{"text": "Understandably so.", "label": 0}
{"text": "Enough to give her a song he recorded a demo for that he wrote for Vanity originally called Manic Monday.\n\nIronically that song was #1 on the Billboard Hot 100 charts until it was knocked off by Kiss by Prince and the Revolution.", "label": 0}
{"text": "https://i.redd.it/g3okq9inuywd1.gif", "label": 0}
{"text": "Rock’s most gorgeous woman.", "label": 0}
{"text": "*The eyes!* Oh, those eyes and her sideways glances whilst singing!  *\\*sigh\\**", "label": 0}
{"text": "That’s a humble brag right there.  There are a lot of men who would part with a lot of their money to sleep on the deck of an aircraft carrier.", "label": 0}
{"text": "Honestly, whats wrong with you?", "label": 0}
{"text": "Both people in this photo are died from overdoses.", "label": 0}
{"text": "You're assuming the person you're replying to is of the same culture as you. Here in the US, it would be weird to get naked to go swimming in front of your kid. I lived in Germany for a few years as a child, and for them it's totally normal.", "label": 0}
{"text": "Cylon Number Six, you thought you had us fooled with the short hair...", "label": 0}
{"text": "And the guy next to him looks like the guy who played Mickey Horton on Days of our Lives.", "label": 0}
{"text": "Reddit ass comment", "label": 0}
{"text": "MIND THE GAP", "label": 0}
{"text": "I don't blame him. She's 65 now and still looks incredible", "label": 0}
{"text": "Yes ma'am", "label": 0}
{"text": "\"Office life\"\n\nI'm sure plenty of offices did other things", "label": 0}
{"text": "Yarp, and some felt it was for the same reason... to maintain and possibly increase her fame at the time. She may not be genuine, but she's smart.", "label": 0}
{"text": "https://preview.redd.it/zjns3p0ivywd1.jpeg?width=600&format=pjpg&auto=webp&s=fd27385ffcc530027c0e2a5741dcc2b06c64ca49\n\nShe looks almost the same now.", "label": 0}
{"text": "Looks like the beginning of a sacrifice!", "label": 0}
{"text": "Tara’s PR: Dammit, Tara, we talked about this. Will you at least wear a bra?\n\nTara: Lol, nope!", "label": 0}
{"text": "https://i.redd.it/ytfws65lvywd1.gif", "label": 0}
{"text": "They’re gonna kill that poor woman", "label": 0}
{"text": "Was this pre or post surgery?", "label": 0}
{"text": "Ho shit!! HA haaa.. without the beard... it's HIM!", "label": 0}
{"text": "I don't think we're interpreting \"as is\" the same. I don't read it as \"I wish she would never age\", I read it as \"I wish she wouldn't have changed artificially\".", "label": 0}
{"text": "Colder climate back then, before global warming really took off", "label": 0}
{"text": "That's an odd thing to say about an eleven year old who, only five years later, would be basically pimped out to the highest bidder as the future virgin bride to a guy she didn't love or desire, in order to elevate her family's status, since the guy happened to be the prince. \n\nAnd who then ended up being put through the wringer by her new family, by the British press, her husband, developed eating disorders and depression, lived in a loveless marriage, got publicly humiliated, had to fight like hell to find out who she is, and right at the time where she had started to make a life for herself and seemed to actually be happy for the first time, was killed in an entirely preventable car crash because the English yellow press was still hunting her like a pack of rabid dogs.\n\nShe was poor by many accounts, even if money didn't happen to be one of them. And the girl in the picture didn't have the faintest clue about what hell was waiting for her in her future.", "label": 0}
{"text": "Oh to be her Rickenbacker!", "label": 0}
{"text": "An American Anthem.", "label": 0}
{"text": "Rock goddess! 🤘🤘🤘", "label": 0}
{"text": "A real battle-axe of a woman", "label": 0}
{"text": "Nip nip show ", "label": 0}
{"text": "That's some real rose tinted glasses way of seeing the world. \n\nI know people love to think that meemaw always looked great and would never leave the house anything less than perfect, but it just wasn't true. She was human just like us and just tried to look pretty when she could. There was also when she would get drunk and be screaming at pawpaw in her nightgown out in the front lawn and all the neighbors came to watch and she said let them! For most it wasn't this but they were all human and and weren't always their best. \n\nTo think everything was better then is some real Make America Great Again energy", "label": 0}
{"text": "Around the Campfire is a really good one, especially for younger people just getting into the music festival scene.", "label": 0}
{"text": "And that would lead to the man going to prison?", "label": 0}
{"text": "![gif](giphy|106oCrSFaq7yp2)", "label": 0}
{"text": "That’s a mighty fine name his dad has got.", "label": 0}
{"text": "![gif](giphy|GwvnkalxRdIs36khbb)\n\nFuck off misogynistic douche", "label": 0}
{"text": "Debbie Harry would like a word. ", "label": 0}
{"text": "Today I learned that the Puritan movement never died.", "label": 0}
{"text": "That poor kid. Sad story", "label": 0}
{"text": "Relax, you get the majority of all women. Leave a few for those of us that like thin.", "label": 0}
{"text": "She’s only 16 in this pic!", "label": 0}
{"text": "Best looking woman in pop music", "label": 0}
{"text": "Well, better late than never", "label": 0}
{"text": "Better", "label": 0}
{"text": "🤔\n\nAre you denying that actions can be sexual?", "label": 0}
{"text": "I was in love with her..", "label": 0}
{"text": "Spartacus, the real one", "label": 0}
{"text": "That the title said Slick Rick for a second.", "label": 0}
{"text": "I thought this was r/bi_irl for a second. They’re both super fucking hot. ", "label": 0}
{"text": "Imagine the babies these two could have made together.", "label": 0}
{"text": "I see it", "label": 0}
{"text": "Highest selling Playboy issue ever at the time. Recurring role on one of the most popular sitcoms in the 90's. She was actually pretty big back then.", "label": 0}
{"text": "... initiates her bat signal calling all white knights to come to their rescue", "label": 0}
{"text": "Bob Weir has joined the chat.\n\n![gif](giphy|8wcF0q5eprYlFTLb5l|downsized)", "label": 0}
{"text": "She always reminds me that I'm not completely straight.", "label": 0}
{"text": "It was not a big movie. And those actors did not have nearly the same stature in 1999 that they do now.", "label": 0}
{"text": "Would taking a picture like this with a child be considered \"normal\" in Germany? Where as i understand nudity is viewed differently yeah but what about lewd behaviour to draw attention to said body parts infront of kids? Thats a tad different from naturist swimmimg.", "label": 0}
{"text": "Oh they were listening to Jodeci that night 😂", "label": 0}
{"text": "That chord she's playing?\n\n\nD\n\n\nD major", "label": 0}
{"text": "The milks gone bad!", "label": 0}
{"text": "I’m a straight woman and even I can’t answer that question.", "label": 0}
{"text": "LOGJAMMIN", "label": 0}
{"text": "Lol at all the incel virgins who've never seen a naked woman in real life before.", "label": 0}
{"text": "Cold out that night.", "label": 0}
{"text": "Apparently she did that because she had a bit of stage fright and didn’t want to look directly at the people in the audience.", "label": 0}
{"text": "One dog goes one way and the other goes the other. \n\nWhaddya want from me?", "label": 0}
{"text": "HE TREATS OBJECTS LIKE WOMEN, MAN", "label": 0}
{"text": "She seems nice", "label": 0}
{"text": "Still a fox.", "label": 0}
{"text": "My god 🤩 🤯", "label": 0}
{"text": "Indeed, but one should learn resilience from stallone", "label": 0}
{"text": "There’s a biography that goes into this.  If it happened in today’s world ‘Ol Kirk would be exposed and probably in jail.", "label": 0}
{"text": "Jay Roach is one lucky man.", "label": 0}
{"text": "So cute.", "label": 0}
{"text": "That's RIGHT!", "label": 0}
{"text": "Both of you were the cutest little people!", "label": 0}
{"text": "Well we can stop the  cool posts about him now", "label": 0}
{"text": "Dude this is just sad to look at. An elderly woman carrying her belongings in a bag in a war torn country.", "label": 0}
{"text": "r/OldSchoolBoobs has been banned from Reddit\n\n😭", "label": 0}
{"text": "When you had 20 things to do before the kids got home", "label": 0}
{"text": "OldSchoolBoob", "label": 0}
{"text": "Mr. and Mrs. Car(r)ey\n\nOne of the r's is silent, but I'm not telling you which one", "label": 0}
{"text": "One of my crush - beautiful barrymore", "label": 0}
{"text": "![gif](giphy|H2u46cKU3VaXht6Iv9|downsized)", "label": 0}
{"text": "Hot", "label": 0}
{"text": "I was madly in love with her from Van Wilder", "label": 0}
{"text": "![gif](giphy|1O9CQluYNzT2QOgJUK)", "label": 0}
{"text": "An absolute FOX!", "label": 0}
{"text": "r/oldschoolboners ?", "label": 0}
{"text": "Damn heres my babies", "label": 0}
{"text": "STAY OUT OF MALIBU, DEADBEAT!", "label": 0}
{"text": "That T-shirt was so 70's, lol.", "label": 0}
{"text": "A bit too into herself for this humble not especially great looking dude", "label": 0}
{"text": "Stop being such a puritan.", "label": 0}
{"text": "Iirc she’s been rumored as a party girl, which means lots of booze and other substances thrown in the mix as well. That tends to age you fast and not particularly gracefully. So all sorts of factors.", "label": 0}
{"text": "You guys horny *again*", "label": 0}
{"text": "I am from the US. This isn't naked, it's a bikini.  \nThat person is just some weirdo puritan that thinks the female form is taboo.", "label": 0}
{"text": "Those legs are insane", "label": 0}
{"text": "Indeed it is!", "label": 0}
{"text": "Sadly, Matthew Sweet, with whom she did those excellent *Under the Covers* albums, had a debilitating stroke while on tour in Canada. He’s not in a good way, and if he pulls through, may never perform again.", "label": 0}
{"text": "Was?", "label": 0}
{"text": "Holy shit. That guy hasn’t aged a day.", "label": 0}
{"text": "![gif](giphy|dB12mOQb99BwDlM83I)", "label": 0}
{"text": "Obviously she's sending out a subliminal message.", "label": 0}
{"text": "Yeah I love the way her eyes are really popping out in this picture. It’s hard to look away from them.", "label": 0}
{"text": "Dennis, your mule is shit. I am no longer turned on by mules.", "label": 0}
{"text": "I always found it kinda hot.\n\nAre you telling me I've been getting a little turned on by the look of fear in a woman's eye?\n\nI'm not sure how to deal with that.", "label": 0}
{"text": "Turkey’s done!", "label": 0}
{"text": "Hey, that's what my mum used to call me when I would get annoyed at her for doing this shit!  So, if you're a prude we can be prudes together because these moms are a nightmare.", "label": 0}
{"text": "I can hear this.", "label": 0}
{"text": "Trey?", "label": 0}
{"text": "WORST body in the world now. Had MAJOR plastic surgery from a BUTCHER.\nThey wrecked her. ", "label": 0}
{"text": "Such an unconventional irresistible sexy aesthetic. One of a kind.", "label": 0}
{"text": "Ron Swanson - “hold still, the third degree burns will only scar you, not kill you.”", "label": 0}
{"text": "Well fair does. Not a mind set i can wrap my british head around but whatever. Diff'rent strokes and all that. Bear in mind though, this photo would have been taken in the US, and given this womens propensity for sexualising herself it doesnt take a rocket scientist to deduce she wasnt doing it innocently. Im sure the commenter i originally replied to, if from a more nudity liberal country, isn't completely ignorant to the fact that a lot of people view it differently so i still stand by my original comment.", "label": 0}
{"text": " Those were the days, brother! True wrestling magic.", "label": 0}
{"text": "Dress?", "label": 0}
{"text": "That’s not her sig model, but I wish rickenbacker would reissue it", "label": 0}
{"text": "Gams", "label": 0}
{"text": "$20 may be lower value, but people are going to see an awful lot more of them than they do $100s. I'd say that's a trade up.", "label": 0}
{"text": "Tubman thirst pics incoming ", "label": 0}
{"text": "Ooh…that’s a take I hadn’t thought about. I think everyone who was old enough at the time thought it was pretty hot. Idk if it was just “mild nervousness” or genuine fear though. It seems like whatever she had, she got past it pretty well.", "label": 0}
{"text": "She literally has a body like Venus de Milo", "label": 0}
{"text": "She was my #1 high school celebrity crush, and I watched special forces. By the time she was off the show, I honestly felt bad for her. She seemed more helpless, like someone you’d want to take care of, as opposed to someone you’d want to make fun of.  Someone who’s just trying to be a good person, but due to mental health, self-confidence issues, etc., just draws ridicule from people who don’t actually know her. \nThat was my impression at least.", "label": 0}
{"text": "She looks pretty rockin, even without the weird fishnet outfit (guessing that was 'marketings' idea)", "label": 0}
{"text": "There shes are", "label": 0}
{"text": "lovely couple", "label": 0}
{"text": "My favourite Eugene Levy character\n\nhttps://preview.redd.it/vibojlwb2zwd1.jpeg?width=599&format=pjpg&auto=webp&s=122eeebed0995e4fd735f0b09479064d3ccf6be1\n\nBruno aka Woody Tobias Jr", "label": 0}
{"text": "It sped things up and increased consistency, but you lost the artistic satisfaction of creating a drawing.\n\nWhen CAD took off is when I made a career shift to working for software vendors.", "label": 0}
{"text": "I met her a few times in the early 2000s. A guy I knew was dating her at the time. She was perfectly nice but definitely a party girl.", "label": 0}
{"text": "I found it insanely fucking hot", "label": 0}
{"text": "Her legs go all the way down to the floor.", "label": 0}
{"text": "Your post has been automatically removed because you did not include a date in the title.\n\nPlease see the sidebar for more info or message the mods if there has been a mistake.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OldSchoolCool) if you have any questions or concerns.*", "label": 0}
{"text": "![gif](giphy|tXLpxypfSXvUc)", "label": 0}
{"text": "Same for raising Arizona, love that movie.", "label": 0}
{"text": "![gif](giphy|l0IykG0AM7911MrCM)", "label": 0}
{"text": "her 2 piece bikini uses less fabric than his 1 piece", "label": 0}
{"text": "Such an absolute babe she made me feel stuff for the first time as a lad", "label": 0}
{"text": "this has just turned into a porn subreddit. are yall proud of yourselves", "label": 0}
{"text": "Would you call the police if he was lifting up his shirt and flashing his breasts at your kids?  Because you're not really comparing the same thing.  Let's make a direct comparison, would a man lifting his shirt and flashing like this in front of a child cause you any concern?", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Yes, Camilla was the person that Charles loved and wanted to be together with, while Diana was the person that was \"chosen\" to be the appropriate partner for him.  I'm not defending Charles cheating on his wife, Charles and the entire royal family has behaved horribly!  At the same time, a younger and prettier person can't compare to the person you truly love.", "label": 0}
{"text": "In Brooklyn a few kids got STDs from that. To be fair, if you go to a Jewish hospital they sometimes accommodate you and still do it with medical standards.", "label": 0}
{"text": "Still a hot chicky babe", "label": 0}
{"text": "River’s first movie was probably out I theaters, and the artist formerly known as Leaf had probably just finished making his second", "label": 0}
{"text": "![gif](giphy|YYfEjWVqZ6NDG)", "label": 0}
{"text": "Sorry, you misspelled Joan Jett.", "label": 0}
{"text": "Yeah. Her eyes 😝", "label": 0}
{"text": "Celebrate the moments in your life....", "label": 0}
{"text": "There's a lot of celebrity \"wow they look so good for their age!\" thrown around. I saw some recent concert video with her and I was flabbergasted. She might literally be #1 for looks good for her age", "label": 0}
{"text": "Go away soi boi", "label": 0}
{"text": "Love that rickenbacker!", "label": 0}
{"text": "maybe a bra?", "label": 0}
{"text": "\"Gotta nip it! Nip it GOOD!\"", "label": 0}
{"text": "At the premier of Crab eyes wide shut", "label": 0}
{"text": "Of course they and I understand that people view it differently. It's the other way around that I question.", "label": 0}
{"text": "Some things in the room that day were certainly cool", "label": 0}
{"text": "“The predator exhibits signs of disorientation and confusion as the blood rushes from his frontal cortex to his phallus.  Little does the Anna Nicole Smith know….that phallic blood flow also brings with it aggression and a false sense of entitlement.  She is now in danger.\n\nSuddenly there is hesitation, and this is her chance to escape.  He must be in front of the 7/11 in three minutes.  If he isn’t, he risks missing the ride he worked so hard to ascertain from his grandmother.  The comfort of his basement bedroom is too powerful a siren song and, now defeated, he walks to the convenience storefront.  \n\nShe lives to flash another day”", "label": 0}
{"text": "Yeah, I largely agree with you, and will share in the downvotes.", "label": 0}
{"text": "I essentially just answered that.", "label": 0}
{"text": "When she comes out in the bikini at the end of *Van Wilder* is a core memory for me as a young man.", "label": 0}
{"text": "That kid will grow up completely well adjusted with no demons surely", "label": 0}
{"text": "You're thinking of Total Recall.", "label": 0}
{"text": "Such big eyes (. )(   .)", "label": 0}
{"text": "Around 1990", "label": 0}
{"text": "Didn’t she marry the super old rich guy?", "label": 0}
{"text": "Mom, can you help me with me geometry", "label": 0}
{"text": "Your dad looks a lot like Frankie Avalon", "label": 0}
{"text": "God she was hot", "label": 0}
{"text": "It was a running joke", "label": 0}
{"text": "lol how is this gif always so relevant, like it shouldn't be but it's always spot on", "label": 0}
{"text": "Those legs. Holy shit", "label": 0}
{"text": "Hey guys, if you look closely, you'll notice she's smiling.", "label": 0}
{"text": "Susanna Hotts", "label": 0}
{"text": "He and Jerry are jamming in some smoke-filled heaven somewhere.", "label": 0}
{"text": "No, because walking around isn't flashing, is it?  One is a sexualized gesture, the other is just existing in a human body.", "label": 0}
{"text": "Besides American pie, the only thing i remember about her is Opie/anthony with Bill burr just trashing her TV show. It was so awfull, definitely worth looking up for a good laugh.", "label": 0}
{"text": "Looks like the pancakes! kid from Cabjn Fever.", "label": 0}
{"text": "Because a picture used to cost money. Money for the film, money for getting it developed. And you only had the one roll so you weren't gonna take a picture of your friend for no reason. \n\nThat's why you only have pictures of people looking their best", "label": 0}
{"text": "I learned to skate back then, motivated by the fact that every 11-12 year old girl I knew was at the rink.  In 1979,  they would play “Le Freak” by Chic, every day at 5 pm.  Good times.", "label": 0}
{"text": "Say goodbye to these, Michael!", "label": 0}
{"text": "She looks SO beautiful ❤️", "label": 0}
{"text": "So cry about it some more.", "label": 0}
{"text": "Are they both middle eastern?", "label": 0}
{"text": "Nom nom nom nom", "label": 0}
{"text": "Mom is a mix of English and German, father is Sicilian", "label": 0}
{"text": "My yoga coach", "label": 0}
{"text": "You would think. Survivors said the elderly, as well as pre-pubertal girls, were victims", "label": 0}
{"text": "(.    )(    .)", "label": 0}
{"text": "I bet he was", "label": 0}
{"text": "Average Reddit comment about double standards", "label": 0}
{"text": "Let’s see a pic of you.", "label": 0}
{"text": "Please dont insinuate you dont think ANS knows exactly what shes doing. She was famed for sexualising herself, and she chooses to do it infront of her child. I mean cool, if the wee guy wasnt there more power to her but he was. Theres nothing innocent here.", "label": 0}
{"text": "it's known, but the cult status is purely an American phenomenon", "label": 0}
{"text": "No way, she is after you now!!", "label": 0}
{"text": "D chord?", "label": 0}
{"text": "“I flopped the nut straight, Teddy.”", "label": 0}
{"text": "If she's had any work done it's *super* subtle, she doesn't have surgery face at all.", "label": 0}
{"text": "Biddy biddy biddy bum bum", "label": 0}
{"text": "Those things don't look like they're on speaking terms.", "label": 0}
{"text": "Boris Johnson Runs for the  Border.", "label": 0}
{"text": "…boobs", "label": 0}
{"text": "Sex sells 🤷🏻‍♂️", "label": 0}
{"text": "# Timothy Carlton Congdon Cumberbatch\n\nthat's a mouthful", "label": 0}
{"text": "Some of these pictures look like back pain.", "label": 0}
{"text": "The first generation Ford Taurus is a very boring looking car today, but it is often credited as The Car that ignited the shift from the boxy 1980s look to the rounded 1990s. It came out in 1986. Go look at the Toyota or Honda or Chevy or Chrysler lineup for 1986. Boxes. Wedges. Angles.", "label": 0}
{"text": "Oh, no...RIP you lovely man.", "label": 0}
{"text": "Awesome pic, lots to love here: the kid scoring a taxi ride on his skateboard, his friends in the background laughing about it, all under the twin towers.", "label": 0}
{"text": "Wait, what, she’s “Bunny?”", "label": 0}
{"text": "What is the value here?", "label": 0}
{"text": "That is hilarious.", "label": 0}
{"text": "So amber heard basically", "label": 0}
{"text": " Wow, that brings back memories!", "label": 0}
{"text": "Apparently she was not very well liked on set.", "label": 0}
{"text": "WTF is this sub now?", "label": 0}
{"text": "Stunning.", "label": 0}
{"text": "Waooo beauty girl!!", "label": 0}
{"text": "“Pay dat man his mahnee.”", "label": 0}
{"text": "You ain’t got no legs, Lieutenant Dad.", "label": 0}
{"text": "I like all the Sharknado movies. The dumber they get, the better they are.\n\nI have the whole hexology in limited edition steel case. I try to convince my friends to marathon it with me every year on Shark Week.", "label": 0}
{"text": "So, you don't accept that other people may view it differently.", "label": 0}
{"text": "Harriet Tubman is a real, true blue American hero. Her memory should be treated with respect. But of course, this is the internet...", "label": 0}
{"text": "She was just too much woman for any man, I tell ya what.", "label": 0}
{"text": "They must have just been amazed by packaged processed foods", "label": 0}
{"text": "When a dominatrix specializes. Like a proctologist but...well, sometimes just like a proctologist", "label": 0}
{"text": "care to explain?", "label": 0}
{"text": "Pedgewens", "label": 0}
{"text": "I always thought she was just a silly ass bimbo. then I seen a documentary about her and it changed my mind. it was really kinda sad.", "label": 0}
{"text": "How you doin’?", "label": 0}
{"text": "![gif](giphy|GJlRkcwzo24AE)", "label": 0}
{"text": "I know, and it makes me laugh every time I see it lol", "label": 0}
{"text": "How old does it have to be then?", "label": 0}
{"text": "They look like bowling alley rental shoes.Were they more comfortable than that at least?", "label": 0}
{"text": "https://i.redd.it/pefa119m9zwd1.gif", "label": 0}
{"text": "I like her nipples.", "label": 0}
{"text": "If you stare at them too closely, you could go blind.", "label": 0}
{"text": "Manipulator\n\nOr driven?", "label": 0}
{"text": "Poor girl got passed around directors like some Reggie!", "label": 0}
{"text": "Love how you triggered the right wingers lurking here that somehow delude themselves into thinking Nazis weren't right wing.", "label": 0}
{"text": "Character assassination is the female way of being nasty, aggressive and rage", "label": 0}
{"text": "She was excited.", "label": 0}
{"text": "Stolen story by Harvey Weinstein and Miramax. Even went to court over it and the it changed laws involving story credit and copywriting laws for scripts.", "label": 0}
{"text": "No", "label": 0}
{"text": "Just send these to into space to repopulate the universe, and mankind might stand a chance.", "label": 0}
{"text": "Would", "label": 0}
{"text": "Explain that to a foot fetishist.", "label": 0}
{"text": "Foofy foof", "label": 0}
{"text": "“Funny how!!”", "label": 0}
{"text": "We saw it in real time on her reality tv show.  Was hard to watch.", "label": 0}
{"text": "She has a smile that could cut glass.", "label": 0}
{"text": "Strong Marty Feldman vibes.", "label": 0}
{"text": "Bad personality catches up.", "label": 0}
{"text": "Alan Neckman", "label": 0}
{"text": "He’s wearing heels and she wearing flats.", "label": 0}
{"text": "Lmao", "label": 0}
{"text": "My mother made us wear these in, like, 1981 with our school uniforms. Ugh. No one else was wearing them. Traumatic.", "label": 0}
{"text": "Jesus he doesn’t age at all", "label": 0}
{"text": "Como la flor (Como la flor)\n\n\nCon tanto amor (Con tanto amor)\n\n\nMe diste tú, se marchitó\n\n\nMe marcho hoy, yo sé perder\n\n\nPero, a-a-ay, cómo me duele\n\n\nA-a-ay, cómo me duele", "label": 0}
{"text": "Remember when movie premieres would invite a bunch of celebs unaffiliated witht he movie at all, but purely because they were popular", "label": 0}
{"text": "Magnificent", "label": 0}
{"text": "When the couple on the floor at a house party starts giving you this look...", "label": 0}
{"text": "You have a good point….but she has two great points.", "label": 0}
{"text": "\"And when Alexander saw the breadth of his domain, he wept, for there were no more worlds to conquer...Benefits of a classical education\".", "label": 0}
{"text": "Does Brian Koppelman know this?", "label": 0}
{"text": "Remember when she said something like, she regretted her Sylvester Stallone tramp stamp, and Flav said “I know, I have to look at it every time I make love to you.”\n\nI’ve been cracking up for 20 years.", "label": 0}
{"text": "I miss the 90s.", "label": 0}
{"text": "No I haven’t! Thanks, I’ll check it out!", "label": 0}
{"text": "Are they related?", "label": 0}
{"text": "Tell me where i said that please. If this picture was taken in Germany where as you say it wouldnt be abnormal then i would try to view it through those eyes, i still wouldnt totally get it but id try to understand that the culture is different and there was no sexual intent. But it wasnt Germany, its the US where the intention is completely different and it IS abnormal, and given, like i say, her proclivity to sexualise herself, then it obvs IS her intention, its her whole brand! And she chose to do it infront of her kid. I would like to believe others have the ability to view things through a cultural lens also, and judge accordingly.", "label": 0}
{"text": "wedontknownothingboutplayinnodamn polo", "label": 0}
{"text": "This sub is very much more \"Look how hot she was\" than \"Old school cool\"", "label": 0}
{"text": "Your wife owes money to Jackie Treehorn. That means you owe money to Jackie Treehorn.", "label": 0}
{"text": "Gruber", "label": 0}
{"text": "Actual original photo or digital? Love it either way.", "label": 0}
{"text": "I'm pretty that show was the last time I watched a reality TV show.\n\nI was done.", "label": 0}
{"text": "One of these people is black, and the other starred on In Living Color.", "label": 0}
{"text": "Just heard the news. Another legend gone.", "label": 0}
{"text": "Evidently.", "label": 0}
{"text": "If you like her at all absolutely for no reason whatsoever watch her appearance in Special Forces Worlds Toughest Test. It is painful.", "label": 0}
{"text": "Sooooo hot! Want to touch the heinie!", "label": 0}
{"text": "My eyes are focused on two things", "label": 0}
{"text": "Lol the implication matched my misreading of the word", "label": 0}
{"text": "All natural?", "label": 0}
{"text": "She’s out there somewhere. Wonder how her story is going right now", "label": 0}
{"text": "Who she with to show her boobies too 😳 besides the whole world 😬", "label": 0}
{"text": "Sorry…her *eyes* you say?", "label": 0}
{"text": "Remember, Leslie Nielsen backwards is… Leslie Nielsen.", "label": 0}
{"text": "Did Stallone just die? Why am I seeing multiple pictures of him today?", "label": 0}
{"text": "![gif](giphy|S8phztgeygGJi)\n\nSeeing this when I was 6 in the theaters was amazing. This dude was always a favorite. Villain or voice, I’ll always love Alan Rickman. He and David Bowie both died around the same time.", "label": 0}
{"text": "10 minutes later and I still can see the pants", "label": 0}
{"text": ">She had been extremely effective in making herself appealing to him\n\nHmm. I wonder how...", "label": 0}
{"text": "I heard she has tattoos on her arms?", "label": 0}
{"text": "![gif](giphy|WP2ujrEnniG2mSyxgM|downsized)", "label": 0}
{"text": "Was that you doing coke?", "label": 0}
{"text": "Wait a second... That's the same person??", "label": 0}
{"text": "Check out the gams on this one", "label": 0}
{"text": "There were some really fucking haggard women wrestlers who were somehow super popular sex symbols from back in those days. I never understood it. As a kid i grew up on the likes of Stacey Keibler, Joy Giovani, etc., so when i got hold of tapes from the previous era, i was blown away. \n\nI'm still reminded of one of the coolest ladder matches i ever saw where the ultimate reward was...a completely fucked up by botched plastic surgery Terri Runnels. Ew.", "label": 0}
{"text": "He was the best in Dogma… especially when he shows he’s hung “as a Ken doll”🤣🤣🤣", "label": 0}
{"text": "It’s remarkably distinct. Dianne Wiest is underrated.", "label": 0}
{"text": "I miss the 1970s when almost every female was braless.", "label": 0}
{"text": "They got back together. They went out on stage together, and Roth said something like, \"it's good to be back with MY band.\" Him and Eddie fought backstage. End of reunion.", "label": 0}
{"text": "Yes", "label": 0}
{"text": "She is amazing", "label": 0}
{"text": "Too bad it didn’t rain that day", "label": 0}
{"text": "They met on The Surreal Life and then she appeared on Flavor of Love as his friend. They did date or were romantic to some degree, but ended up as friends.", "label": 0}
{"text": "Dude I’m literally listening to some synthwave mix as I work and this is my cover art.  How the hell is Reddit listening to me.\n\nhttps://preview.redd.it/5eadqcsofzwd1.jpeg?width=4032&format=pjpg&auto=webp&s=6ec6ac86516ccac2561d035eacacfc29ababcd99", "label": 0}
{"text": "The original angry teenager.", "label": 0}
{"text": "Stunning 😍", "label": 0}
{"text": "she hot", "label": 0}
{"text": "Her bod is 🔥", "label": 0}
{"text": "Didn't know I needed a shirtless Alan Rickman glamour shot in my life, but here we are.", "label": 0}
{"text": "? I don't want porn, bud.", "label": 0}
{"text": "Body-ody-ody!", "label": 0}
{"text": "I had the internet for a majority of my life and those babies still impact me 😂", "label": 0}
{"text": "i remember him being obsessed with her.", "label": 0}
{"text": "https://i.redd.it/nipwkrnggzwd1.gif", "label": 0}
{"text": "![gif](giphy|AZGzgV2q4MwVO)\n\nHow the random soviet solider looks at her", "label": 0}
{"text": "No it's creepy and weird. This poor kid has to deal with a mom that acted like this and was so loaded on drugs she could barely put together a coherent sentence but people seem to glorify her since she was attractive. I could only imagine the bullying he had to deal with in school throughout his life.", "label": 0}
{"text": "curious how much of her was 'natural',  it could be zero or it could be 100% -- she was the most beautiful ever.", "label": 0}
{"text": "Would that make this the sexist way of being nasty, aggressive and rage?", "label": 0}
{"text": "Your post has been automatically removed because you did not include a date in the title.\n\nPlease see the sidebar for more info or message the mods if there has been a mistake.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OldSchoolCool) if you have any questions or concerns.*", "label": 0}
{"text": "Run DMC hated the idea of doing this", "label": 0}
{"text": "She's got such beautiful shoulders", "label": 0}
{"text": "How is she 65", "label": 0}
{"text": "No, not yet.", "label": 0}
{"text": "![gif](giphy|ZvwNZcdFRJ60r5e9RM)", "label": 0}
{"text": "Mr. Treehorn draws a lot of water in this town. You don't draw shit, Lebowski. Now we got a nice, quiet little beach community here, and I aim to keep it nice and quiet. So let me make something plain. I don't like you sucking around, bothering our citizens, Lebowski. I don't like your jerk-off name. I don't like your jerk-off face. I don't like your jerk-off behavior, and I don't like you, jerk-off. Do I make myself clear?", "label": 0}
{"text": "They eventually saw the light, and DMC ended up becoming a huge fan of rock and metal.", "label": 0}
{"text": "100%", "label": 0}
{"text": "More like eyes wide open am i rite", "label": 0}
{"text": "Wow you just injected some old memories watching VH1 brainrot as a young man lol haven’t heard celebreality in years", "label": 0}
{"text": "Before the disastrous plastic surgery.", "label": 0}
{"text": "He is immortal. They put him in cryostasis until he needs to make a public appearance or until they need him on set for his lines.. once that's done, they put them back on ice and inject him with botox until the world needs him again. /S", "label": 0}
{"text": "If she wasn't famous or popular, she possibly would've been arrested for this. I feel bad for her son", "label": 0}
{"text": "...if he dies, he dies.", "label": 0}
{"text": "His body language looks like he's trying to get her off of him", "label": 0}
{"text": "I think both pictured here seem like assholes. Fuck em", "label": 0}
{"text": "Like right", "label": 0}
{"text": "I mean, she’s an amazon", "label": 0}
{"text": "In the 20's sure, in the 60's film was relatively cheap. \nPeople dressed differently then and that's okay.", "label": 0}
{"text": "Want to touche hiney@", "label": 0}
{"text": "Yes, but there was a solid 20 years between those two pics", "label": 0}
{"text": "5 minutes 😂", "label": 0}
{"text": "This is reposted way too much……", "label": 0}
{"text": "Originally? That song is still called \"Manic Monday.\"", "label": 0}
{"text": "![gif](giphy|THUyCyf1nekNIaoOw5|downsized)", "label": 0}
{"text": "River dance was huge back in the day.", "label": 0}
{"text": "There we go.", "label": 0}
{"text": "The side cast as a whole was so peak, too. From DuJour to the record execs being Alan Cumming and Parker Posey.. there's not a single part where that movie fails to deliver.", "label": 0}
{"text": "It definitely wasn’t a huge hit.  And her role in it was small.\n\nBut the Coens were certainly known for making quirky/artsy movies with impressive casts.  They had a lot of momentum after Fargo.\n\nI suspect she was appreciative of being involved in it, and may have thought that it would open some doors for her.\n\nIf she had a more major role in the movie, she probably would have seen it as a highlight.", "label": 0}
{"text": "10/10 in her prime", "label": 0}
{"text": "They hooked up on Surreal Life, which was a knockoff celebrity Big Brother. They then had their own show called Strange Love, and when they broke up Flavor of Love became VH1's first celebrity Bachelor knockoff.", "label": 0}
{"text": "meh, I heard when she dances, she doesn't swing her arms.", "label": 0}
{"text": "No pleasing some people", "label": 0}
{"text": "I don’t see the problem. It’s Red Lobster!", "label": 0}
{"text": "Every time he unfreezes he signals the reboot is complete with a solid \"Ay yo.\"", "label": 0}
{"text": "Nowadays, these kinds of posts are rarely coincidence. Almost always to be top of mind and track analytics.", "label": 0}
{"text": "Sure man", "label": 0}
{"text": "Craziest is she ended up with Flavor Flav.... She was on Flavor of Love back in the 2000s and I was like \"thats the girl from Rocky 4! She seemed like a loony bird on the show so it seems to all check out.", "label": 0}
{"text": "No that’s flavor flav.  Chick on the right is the same person tho.", "label": 0}
{"text": "I hope not, but may need to get a DNA test now that you mention it", "label": 0}
{"text": "She’s so hot but I hate the makeup.", "label": 0}
{"text": "Rock of love and Flavor of love were hilarious and entertaining for the time. I was also a young teen who enjoyed this new form of \"reality\" TV...then we were and still are flooded with these shows. Was cool at first then not cool lmao.", "label": 0}
{"text": "Very free  spirited", "label": 0}
{"text": "\"Honestly, you bottom-feeders and your arrogance. You think everybody's just trying to get in your knickers.\"", "label": 0}
{"text": "Where are the cigarettes?", "label": 0}
{"text": "By Grabthar's Hammer, by the Suns of Warvan, you shall be remembered.", "label": 0}
{"text": "She was good in Beverly Hills Cop 2", "label": 0}
{"text": "90s makeup is GOATED.", "label": 0}
{"text": "He was so damn good in that role.", "label": 0}
{"text": "Gorgeous 😍", "label": 0}
{"text": "Yep. Surreal Life, then Strange Love, but it was over before Flavor of Love.", "label": 0}
{"text": "We did this in high school.", "label": 0}
{"text": "How cold was it on the Friends set?", "label": 0}
{"text": " She was such a pop icon back then!", "label": 0}
{"text": "It used to be called Manic Monday.  I mean it still is, but it used to, too.", "label": 0}
{"text": "You’re stupid lol.", "label": 0}
{"text": "Not remotely", "label": 0}
{"text": "No", "label": 0}
{"text": "I wish I was there", "label": 0}
{"text": "From Stallone to Flava Flav....wow", "label": 0}
{"text": "When eyes wide shut- high beams on for safety.", "label": 0}
{"text": "Posing for the Homecoming dance pictures.", "label": 0}
{"text": "AHHHHHHHHHHHHHHHHHHHHHH!!!!!!!!!", "label": 0}
{"text": "I was saying it was originally for Vanity.", "label": 0}
{"text": "His legs flail about if independent from his body.", "label": 0}
{"text": "Was a gee dude? I’m a fan so I’m hoping yes.", "label": 0}
{"text": "I'm pretty sure that opened alot of eyes.", "label": 0}
{"text": "Didn’t he have a hand in saving Red Lobster?", "label": 0}
{"text": "Are you a doctor?  Yes, yes, I am.", "label": 0}
{"text": "She looks as batshit crazy as walking through an active war zone is. That is a brave woman. She looks reminiscent of a character from a Ghibli anime lol", "label": 0}
{"text": "I’m no Superman…", "label": 0}
{"text": "This looks like AI to me.", "label": 0}
{"text": "I guess it's time for me to suit up, and make my stand for her in Van Wilder. Come at me!", "label": 0}
{"text": "Ahh..i hadnt noticed her feet!", "label": 0}
{"text": "![gif](giphy|t0okbfzkLuOlUQ4Qyz|downsized)", "label": 0}
{"text": "I don't think it's a great theatre movie? It's so dialogue and character driven, so personal and about these Kitch sets and things, these little moments, that it plays out really really well on a TV with friends and a couple of drinks. \n\nIt's also a movie that's fun socially or by yourself in that way. In many ways it's the least cinematic of the Coens works, but it's one of the most well written and acted. The casting is also just so spot on.\n\nDon't get me wrong, still fantastic cinematically and lovely to see it on a big screen, but it *shines* in the living room.", "label": 0}
{"text": "Atomic Blonde...the most badass woman ever...", "label": 0}
{"text": "yall rickman fans gotta check out one his last movies CBGBs", "label": 0}
{"text": "up to heaven and past Avalon...", "label": 0}
{"text": "They are called nepo babies", "label": 0}
{"text": "Nice defensive end shoulders", "label": 0}
{"text": "Because Trump is a stone cold racist.", "label": 0}
{"text": "It was too much, even for trolls!", "label": 0}
{"text": "Why is this cool? It's cult behavior.", "label": 0}
{"text": "Highly photoshopped", "label": 0}
{"text": "She was on Comedy Central Roast of Flava Flav. I only remember because Greg Giraldo just roasts the absolute shit out of her and everybody there. Worth watching.", "label": 0}
{"text": "Dolph does seem like a stand up guy tho", "label": 0}
{"text": "Those aren’t buoys", "label": 0}
{"text": "First he beat the Russian then he took his wife. Cold Sly, cold. ", "label": 0}
{"text": "Skank and offspring.", "label": 0}
{"text": "I have a problem with your use of the word ‘smart’ here.\n\nThe word I’d personally use is ‘cunning’", "label": 0}
{"text": "Stallone is 5’9 1/2”, Brigitte Nielsen is 6’1”", "label": 0}
{"text": "I think a few of the Monkees were legit musicians.", "label": 0}
{"text": "If she hyphenated…", "label": 0}
{"text": "Her and her friend John Brown.", "label": 0}
{"text": "I mean, I'd marry him.", "label": 0}
{"text": "I remember watching that show weekly when I was a kid. Flavor Flav yelling his name constantly and Verne Troyer drinking double his body weight in vodka and pissing all over the place.", "label": 0}
{"text": "https://i.redd.it/0bzfz3e2ozwd1.gif", "label": 0}
{"text": "Ask Jennifer Aniston lol", "label": 0}
{"text": "don't let manipulative people use their \"addictions\" to manipulate you into giving them sympathy", "label": 0}
{"text": "It's a palamino.", "label": 0}
{"text": "She was ridiculously hot, damn that plastic surgeon", "label": 0}
{"text": "Ellis?", "label": 0}
{"text": "Still disgusting", "label": 0}
{"text": "I thought he was married to Adriannn", "label": 0}
{"text": "We went low fat,  and started putting more and more sugar in everything.", "label": 0}
{"text": "Yeah the right hand looks like it’s missing a finger", "label": 0}
{"text": "Stop. Stop! I can only cum so much", "label": 0}
{"text": "Coin dispenser for change.", "label": 0}
{"text": "The best in bed\nThe worst in your head", "label": 0}
{"text": "I see. Thank you.", "label": 0}
{"text": "Are you sure it wasn’t Nips Full Out premiere?", "label": 0}
{"text": "He looks dehydrated.", "label": 0}
{"text": "Pre-Pepperoni-Pointers", "label": 0}
{"text": "Is the whistle", "label": 0}
{"text": "Total AI", "label": 0}
{"text": "That’s her signature!", "label": 0}
{"text": "It was a cunning stunt.", "label": 0}
{"text": "Eyes wide shut headlights full beam", "label": 0}
{"text": "ONLY KINDA?!", "label": 0}
{"text": "So Demolition man was half true…", "label": 0}
{"text": "https://preview.redd.it/sb97wjniqzwd1.png?width=827&format=pjpg&auto=webp&s=81f1ff59958cc36f4129e44461a4aa5acfc64701", "label": 0}
{"text": "Pretty smart, too", "label": 0}
{"text": "We love you, and we miss you.", "label": 0}
{"text": "She is 6’1”. I think her body looks great here.", "label": 0}
{"text": "She’s 65 and still such a baddie.", "label": 0}
{"text": "I think he is in front of her", "label": 0}
{"text": "Pickles", "label": 0}
{"text": "There have been several steps. The change from manually drawing on a board to 2d drawing on a computer did save time, neaten things up (my hand lettering was atrocious), and made our designs more standardized (copying bits and pieces from previous or other designs saved the designer time, so that's what us lazy (I mean smart) people did). The change from computerized 2d to solid modeling (3d) was the real game changer in so many ways. Easier to check fits and movements, easier to do stress analysis, easier to show designs to non-technical people, easier to communicate with suppliers and customers, easier to make tooling or program manufacturing machines. One small example, back when we were doing hand drawings or even 2d CAD drawings the Engineering Department had a line item in the yearly budget for Fedex-ing drawings. Sending a drawing required someone to make a copy of the drawing (perhaps on the blueprint machine), fold it, stuff it in an envelope, type an address label, and get it to shipping/receiving. That said, I still have a drafting table and more m3chanical pencils than I ever did when I was actually in a board for work, because it feels good, satisfying, and even artistic.", "label": 0}
{"text": "Nah. They were all cool.", "label": 0}
{"text": "Dolph was with Grace Jones too. Brigitte Neilson and Grace Jones…Talk about two aggressive women! \n\nDolph said she wore him out sexually with all of her sex games and parties", "label": 0}
{"text": "Forever crush.", "label": 0}
{"text": "I knew she's gorgeous, I've always known, but I was still not quite prepared for that level of smokeshow.", "label": 0}
{"text": "Rock of love baby", "label": 0}
{"text": "Nope, kids just stopped giving a fuck and opted for an easier dopamine hit that didn’t require effort or physical skill. They started caring what strangers thought and molded themselves and their actions to please the faceless masses for validation in the form of likes and shares.", "label": 0}
{"text": "Some might even call it cunting.", "label": 0}
{"text": "It's the only reason I know who she is, lol", "label": 0}
{"text": "So fucking hot", "label": 0}
{"text": "https://preview.redd.it/3xqzhqjduzwd1.jpeg?width=147&format=pjpg&auto=webp&s=22b3e7f4d8fdba3e845e7c24ed8638c7d456c48c", "label": 0}
{"text": "Yeah, I'd rather see the glass return", "label": 0}
{"text": "I believe not having a dad screwed me over in that respect but I guess some of us have to take a bullet for the warning to live on. Pay attention young men. It ain't worth it Son! Find yourself a nice girl who respects you as much as you respect yourself and never settle for less. We set our own value in this world so don't let it become worth dust. ", "label": 0}
{"text": "Every day a man calls over a prepubescent girl, takes down his shorts to reveal a speedo while holding  her and get their picture taken together?", "label": 0}
{"text": "I mean, honestly? They would have made a good couple.", "label": 0}
{"text": "I never said it would. I said it would raise eyebrows.", "label": 0}
{"text": "Ahh, the Carey’s, aka Carrey’s.", "label": 0}
{"text": "I swear she just had a baby recently, too. I remember thinking what the hell she had to be in her 60s.", "label": 0}
{"text": "The inverted commas makes me feel like there is more to your story than Bridgette. I hope all works out well.", "label": 0}
{"text": "Food and bed aren't the only things that cost money. You can sleep on the couch.", "label": 0}
{"text": "I doubt she’s call herself an “object,” this person was in fact, a human being with a very complicated past.", "label": 0}
{"text": "People have lost all perspective because of the extreme cases we all see of people with very obvious cosmetic surgery. She has absolutely had work done. We are all delusional about aging and it's completely unhealthy on a societal scale.", "label": 0}
{"text": "Vampire", "label": 0}
{"text": "I loved the last even more bubbly one too 1998-2002 I think.", "label": 0}
{"text": "She was gorgeous back then and just keeps getting better!", "label": 0}
{"text": "Same.", "label": 0}
{"text": "🔥 🔥 🔥 🔥 🔥", "label": 0}
{"text": "https://preview.redd.it/b8ongmekvzwd1.jpeg?width=555&format=pjpg&auto=webp&s=fefbd82dc9c5447b32a2e0441f47dc820f869408", "label": 0}
{"text": "I was just out checking the mail .. get it? Checking the 'male'?", "label": 0}
{"text": "Dominic DeCoco", "label": 0}
{"text": "It’s implying that addiction made them do it", "label": 0}
{"text": "I understood what you wrote. I’m not sure about the confusion. Do people not know how commas work?", "label": 0}
{"text": "Umm, I’ve seen The Italian Stallion. His dick is not small.", "label": 0}
{"text": "Why are there pancakes in the silverware drawer?", "label": 0}
{"text": "I partied with Brigitte a few times and honestly she is great. Extremely nice and friendly. I come up to her boobs just like Sly did haha. But seriously all the bad descriptions of her in here was nit the person I was around. She was very nice!", "label": 0}
{"text": "Pfft. Not true. Just watch his porn video…", "label": 0}
{"text": "Uh huh. roommate.", "label": 0}
{"text": "I guess this is cool, tbh it's mostly an empty room", "label": 0}
{"text": "Nope, kids just stopped giving a fuck and opted for an easier dopamine hit that didn’t require effort or physical skill. They started caring what strangers thought and molded themselves and their actions to please the faceless masses for validation in the form of likes and shares.", "label": 0}
{"text": "77 & 78 were the best shows!", "label": 0}
{"text": "He said that about one of his movies, I think it was \"Red Sonja\".", "label": 0}
{"text": "![gif](giphy|wmuqpmtGeVv1K|downsized)", "label": 0}
{"text": "Golden age of reality television.", "label": 0}
{"text": "Good gawd, what a beautiful man Rock was. Also, so is Bob! Oooof dayum!", "label": 0}
{"text": "100% ... just mates.", "label": 0}
{"text": "Just dudes being dudes.", "label": 0}
{"text": "![gif](giphy|Evh9POSpIXq5q)", "label": 0}
{"text": "«The Red Sea»", "label": 0}
{"text": "That's a great anecdote if true lol", "label": 0}
{"text": "He probably would have been a better fuck too.", "label": 0}
{"text": "Really fucking good genes.", "label": 0}
{"text": "Don’t get sucked in by this bot.", "label": 0}
{"text": "Red carpet escort.", "label": 0}
{"text": "r/SapphoAndHerFriend", "label": 0}
{"text": "Mate, the entire thread is nothing but opinions. Take a hike.", "label": 0}
{"text": "I read this and Rock Hudson and Bob Pebble", "label": 0}
{"text": "Walleye nips", "label": 0}
{"text": "I suck you d&!@ for a thousand dollars. But he can’t watch.", "label": 0}
{"text": "She was slowly absorbing him.", "label": 0}
{"text": "All his roles were ladies' man roles. He was a major heartthrob to women in those days. And men were \"in the closet\" back then.", "label": 0}
{"text": "https://preview.redd.it/htigerm9yzwd1.jpeg?width=300&format=pjpg&auto=webp&s=97b74f54fee733eda7ece0bcc8a837fd9d3b1d3a\n\nDamn...", "label": 0}
{"text": "Now I only see Connor Bedard", "label": 0}
{"text": "“What favor???”", "label": 0}
{"text": "Either the shirt is tight or her nipple is sharp, either way great smile", "label": 0}
{"text": "\"Now I have a machine gun...HO-HO-HO.\"", "label": 0}
{"text": "OMG they were roommates!", "label": 0}
{"text": "Roommate. Hehe.", "label": 0}
{"text": "The outdoor cafe scene in 'Midnight In Paris'.  Dali, Man Ray and Luis Bunel.", "label": 0}
{"text": "Because it's dull, you twit! It'll hurt more!", "label": 0}
{"text": "Funbags? Where?", "label": 0}
{"text": "\"And bring a friend...\"\n\nI wouldn't be surprised if he ad-libbed that line.", "label": 0}
{"text": "I have never seen this photo of her before \n\nthat outfit and that Rickenbacher are just next level", "label": 0}
{"text": "Because he always played characters that were the perfect ladies man and the women swooned over him.", "label": 0}
{"text": "The post was edited after the fact to include a comma.", "label": 0}
{"text": "…And they were roommates!", "label": 0}
{"text": "They seem to be having a gay old time", "label": 0}
{"text": "Damn, she need to start a group with Paz Lenchantin and call that shit \"The Immortals\".", "label": 0}
{"text": "wtf... I never put that together either. mind blown.  geez", "label": 0}
{"text": "\"Roommate \"", "label": 0}
{"text": "So was I", "label": 0}
{"text": "I’m so curious…did their “love” seem genuine at all when the cameras weren’t rolling? I always thought it was an…interesting pair lol, but there were moments when I thought “okay, they might really dig each other”.", "label": 0}
{"text": "She's way too hot and way too crazy.\n\nDangerous combo.", "label": 0}
{"text": "I can relate… I’m a hella heartthrob.", "label": 0}
{"text": "https://i.redd.it/i1a0txxozzwd1.gif", "label": 0}
{"text": "Omg I read it in the voice", "label": 0}
{"text": "To be fair, this was in a time where Liberace was thought to be a great ladies man.", "label": 0}
{"text": "Doesn’t he have a masters from mit?", "label": 0}
{"text": "Really good fucking genes. ", "label": 0}
{"text": "I'm just sayin', 70s boobs were different, that's all.", "label": 0}
{"text": "No you're one of them!!!", "label": 0}
{"text": "to get a date with Stallone she sent him a picture of her from the movie.  \n\nArnie was in the movie, he was coming off the massive Conan hits, so he was the real draw for the film.", "label": 0}
{"text": "Bobbing on the Rock.", "label": 0}
{"text": "K but her boobs are recked", "label": 0}
{"text": "Go look up the Walk Like an Egyptian music video.", "label": 0}
{"text": "You're not a man till you've had a man.", "label": 0}
{"text": "Like New York style pepperoni ", "label": 0}
{"text": "Times have definitely changed. It would have been career ending for a man to come out back then. People just had their suspicions.", "label": 0}
{"text": "Mating was involved", "label": 0}
{"text": "The benefits of a classical education", "label": 0}
{"text": "Well said. Even if you don't respect yourself don't settle for someone that doesn't. Crazy might be fun for a night but that shit can be with you for a lifetime.", "label": 0}
{"text": "Skin is your largest organ, if you take care of it it will take care of you and leave you looking 10+ years younger than you are.\n\nI don't know if she drinks or not, but I **highly** recommend you avoid alcohol and drink plenty of water. I live in Wisconsin, the binge drinking state, and the people who drink with *any* semblance of regularity (that's a LOT of people here) *always* look older than they are. *Significantly* older. My mother looks 10 years older than she actually is and she's not pumping the brakes on drinking, that's for sure.", "label": 0}
{"text": "\"Roommate\"", "label": 0}
{"text": "How is this cool?", "label": 0}
{"text": "What? No, she *clearly* has arms.", "label": 0}
{"text": "dudes rock", "label": 0}
{"text": "“Roommate”", "label": 0}
{"text": "TRUE Lies!", "label": 0}
{"text": "The odds of not just one, but two men working on cars with physiques is less than zero. That's all I need to see to know it's fake lol", "label": 0}
{"text": "I can't believe Liberace was gay. I mean, women loved him. I didn't see that one coming", "label": 0}
{"text": "His roommate, you say?", "label": 0}
{"text": "Oil check!", "label": 0}
{"text": "Not your parents.  Reposted many, many, many.", "label": 0}
{"text": "His “roommate”\n\n![gif](giphy|R12pNBMoX9ZPrHwiqs)", "label": 0}
{"text": "Eyes wide open", "label": 0}
{"text": "\"roommate\"", "label": 0}
{"text": "Wtf? 70-however old she is now JLC is attractive, when she was younger she was a *goddess.* So sad she didn't have a better self-image at the time.", "label": 0}
{"text": "Hot then, hot now. 🥵", "label": 0}
{"text": "I wonder if his roommate knew he was gay.", "label": 0}
{"text": "All that success and she's still smuggling M&Ms in her T-shirt..tsk tsk", "label": 0}
{"text": "She needs to dim those brights. I almost went blind here.", "label": 0}
{"text": "And introduced a bunch of classic rock listeners to rap I would assume.", "label": 0}
{"text": "It's just an Oldsmobile getting a bath!?", "label": 0}
