{"text": "Selena Quintanilla Pérez\n\nShe was shot and killed by the president of her fan club.", "label": 1}
{"text": "https://www.gettyimages.co.uk/detail/news-photo/tara-reid-during-eyes-wide-shut-los-angeles-premiere-party-news-photo/104722115", "label": 1}
{"text": "[https://www.youtube.com/watch?v=RD1KqbDdmuE](https://www.youtube.com/watch?v=RD1KqbDdmuE)", "label": 1}
{"text": "One in four Berliners voted for the Nazi party in 1932.", "label": 1}
{"text": "References wiki... hold please. ...", "label": 1}
{"text": "\"I'd jump his bownes...\"\n\n(MD accent)\n\nThat's from that rock and roll parking lot thing.", "label": 1}
{"text": "There is a real pic from the 99 VMAs. A bunch of artists did photos like this. Someone put the old photo in one of those AI repair apps to yassify her. The original one looks much, much more normal but still touched up", "label": 1}
{"text": "Big tirs always play, then and now.", "label": 1}
{"text": "Found it! Clairol\n https://youtu.be/yO1wQyHhl18?si=Iw3wvCWkqYJ3FDUG", "label": 1}
{"text": "Growing up if this was ever on TV I would get so pissed if they cut the ending credit scene after watching the whole movie.  \n  \nRodney Mullen's skating tricks at the end were out of this world at the time! Long live Rodney!\n\n[https://www.youtube.com/watch?v=vnqR7o5RHbM](https://www.youtube.com/watch?v=vnqR7o5RHbM)", "label": 1}
{"text": "she is so beautiful", "label": 1}
{"text": "I hear they were quite close with Sappho and her friend.", "label": 1}
{"text": "well, perkele!", "label": 1}
{"text": "Queen", "label": 1}
{"text": "Ewwwwwwwww", "label": 1}
{"text": "Well said. I was gonna type out much the same, but you said it better.\n\nDEVO didn't crank out \"hits\". They INVENTED a new form of musical expression.", "label": 1}
{"text": "Robert Preble was an aspiring actor at the time, while they were both under contract to Universal. IMDb lists him as appearing in one film – ”What Price Glory“ (1952) — the same year they did this photoshoot for *Photoplay* magazine in a layout called ”Bachelor’s Bedlam.“  \n\nI wonder what became of Bob Preble?", "label": 1}
{"text": "And then there’s this (it’s a long read, grab a cup of coffee - but it’s super informative and interesting): \n\nhttps://amp.theguardian.com/business/2012/jun/11/why-our-food-is-making-us-fat", "label": 1}
{"text": "hey dm me for your photoshop request", "label": 1}
{"text": "SHWINGG!", "label": 1}
{"text": "She gained widespread recognition for her role as Sera, a troubled prostitute, opposite Nicolas Cage in Leaving Las Vegas (1995). Shue’s performance in this film was highly acclaimed and earned her nominations for the Academy Award, Golden Globe, and BAFTA for Best Actress. Her portrayal was deeply emotional and brought new dimensions to her career, showing her depth as an actress beyond the \"girl next door\" roles she’d previously played.", "label": 1}
{"text": "I like the way he justified his opinion. I mean he was right. What's the point of calling who's the greatest and who's not. Everyone can be the greatest in their own little ways", "label": 1}
{"text": "Happy Birthday Scott Weiland! He woulda been 57 today. Rock on! 🤘🎉 #STP", "label": 1}
{"text": "Check out this pic of MJ in '89! He's a legend for sure. 🐐🏀", "label": 1}
{"text": "Reagan n Gorbachev chillin at Rancho del Cielo in '92. Coolest dudes eva! 😎欄", "label": 1}
{"text": "\"I ate a bug\"\n\n\"I can't think of anymore lines to say\"\n\nI'm sorry but anyone who's seen Marlon's outtakes from Hearts of Darkness **knows** he's the greatest actor ever.", "label": 1}
{"text": "What the Phuc would you know? Where you there?", "label": 1}
{"text": "![gif](giphy|33zX3zllJBGY8)", "label": 1}
{"text": "she is so beautiful", "label": 1}
{"text": "Ok your black , dumb and blind.", "label": 1}
{"text": "How in the hell did Jon voight’s ugly ass tap that?", "label": 1}
{"text": "Ashton Kutcher was 3 years old when this photo was taken. Good for him for following my dreams.", "label": 1}
{"text": "This is the first time I've ever seen what she looked like. Angelina Jolie always got emotional when she'd talk about her mom, made me intrigued", "label": 1}
{"text": "Beautiful - until she chopped off all her damn hair. Sorry, but that's what ended my crush on her.", "label": 1}
{"text": "Mom > Angelina", "label": 1}
{"text": "Hi", "label": 1}
{"text": "As what I remember somewhere I read before, Ryan was a boy  who became a national figure in the fight against AIDS in the 1980s. After contracting HIV from a blood transfusion due to hemophilia, he faced significant stigma and discrimination.", "label": 1}
{"text": "\"...was a close friend of Ryan White.\"\n\n  \nI'll bet he was, lol.", "label": 1}
{"text": "Bill Clinton started going to Epstein island after the Lewinsky scandal.\n\nhttps://preview.redd.it/e7qoz3882cxd1.jpeg?width=1200&format=pjpg&auto=webp&s=d588e1efa35ac833bb7ede3e0ebb2f37fbfa0741", "label": 1}
{"text": "Winona Ryder n Christina Ricci luk gud in 1989! 🌟 #90svibes", "label": 1}
{"text": "Cameron Diaz and Matt Dillon were a hot couple in '98!", "label": 1}
{"text": "Not sure, I am unfortunately a second hand source spewing the highlights of a story I barely remember. It could’ve been before then, I guess.", "label": 1}
{"text": "Winona Ryder rockin' it for Harper's Bazaar in the '90s! She's a total style queen!", "label": 1}
{"text": "Rest in peace, pops. You were a real one. Gone but never forgotten.", "label": 1}
{"text": "I can't decide who looks cooler, the cat or the man?", "label": 1}
{"text": "I was in middle school when this came out. My dad was super strict and censored all of my music, TV, movies, friends…you name it. My friend asked me to go see Mermaids with her and I asked my dad expecting a hard no. Surprisingly he said yes! So we went with my friends mom and watched it and I LOVED it. Later on I was discussing it with my dad (still didn’t know why he let me go to a pg-13 movie) and it came out he thought I was going to see The Little Mermaid 😳 He was PISSED to say the least 🤣 To this day Mermaids still sticks out as my first pg-13 movie I didn’t have to sneak to see.", "label": 1}
{"text": "According to the FBI the black panther party “advocated the use of violence and guerilla tactics to overthrow the U.S. governmen.  The FBI named them a terrorist organization.", "label": 1}
{"text": "Brian Pillman and his son, Lexis King, in '97. Cute!", "label": 1}
{"text": "There is literally a filter on this photo.", "label": 1}
{"text": "Can there be a different sub just for the horny losers and let's just keep this one clean and interesting?..", "label": 1}
{"text": "late 40s/early 50s culture meets early 60s damn.", "label": 1}
{"text": "Not according to the source somebody gave in this thread, but yes, seems they were mistaken. Just means that he also didn't own it for 82 years as the title stated since it was a 1928 model, he would have owned it for 77 years instead. Also seems the person below's source added 900000 miles to the odometer as it had done 172,000 miles and they said 1,070,000 lol. I will fix my number", "label": 1}
{"text": "Paltrow seems like an insufferable cunt. I think Pitt may agree.", "label": 1}
{"text": "Rowan Atkinson Vantage V8 London 1984.", "label": 1}
{"text": "All the Ip Man movies are loosely, and I mean loosely, based on his life.", "label": 1}
{"text": "Sutherland truly found his rhythm that year, taking on major roles in *M*A*S*H\\*, *Kelly's Heroes*, *Start the Revolution Without Me*, *Act of the Heart*, and *Alex in Wonderland*", "label": 1}
{"text": "She’s still as captivating as ever. Watching Demolition Man as a kid, I found her incredibly attractive. What a presence", "label": 1}
{"text": "The best toe...", "label": 1}
{"text": "I recall Mr. Sutherland being interviewed on an American talk show decades ago, right before a U.S. election. When asked about his political views, he replied, “As a Canadian, I cannot vote in your elections. However, I urge my Democratic friends to go vote on November 6, and I encourage my Republican friends to vote on November 7.\"", "label": 1}
{"text": "![gif](giphy|13BFxIXaSfGo7e|downsized)", "label": 1}
{"text": "![gif](giphy|mFdnWF1RTI7fi|downsized)", "label": 1}
{"text": "Gosh, Bruce Lee was so handsome", "label": 1}
{"text": "She was definitely the hottest of the Angels ... but Kate Jackson was the one I would have hit on. If I wasn't a shy pre-teen boy back then!", "label": 1}
{"text": "Seeing this makes me nostalgic for the '90s, those were the days of legendary movie moments!", "label": 1}
{"text": "Bronx tail tale: 1993 bloopers galore!", "label": 1}
{"text": "I would've eaten her ass here", "label": 1}
{"text": "Isn’t it wild now to think about how a haircut basically killed ‘Felicity’?\n\nWe were a dramatic people in the late 90’s", "label": 1}
{"text": "Soldier dancing with mop in Palace Place during Romanian Revolution!", "label": 1}
{"text": "I had such a crush on her…", "label": 1}
{"text": "She ruined every Wednesday Addams that I saw after her she is Wednesday Addams", "label": 1}
{"text": "The smile she finally gives at camp in Adam’s Family Vaules still chills my spine. It’s a good chill though...", "label": 1}
{"text": "Swim dudes in olden clothes with funny hats! 🏊‍♂️藍 #FashionFail", "label": 1}
{"text": "How is it, that in this day and age, in 2024, when we have instant access to all types of sexual imagery, video and audio....how is it that this photo of a fully clad woman, in basic white dress, is one of the sexiest things I have seen in a long time?", "label": 1}
{"text": "Right-wing Americans not only don't know how to recognize fascism, you guys obviously also don't know that a republic is a democracy. \n\nThose two words are not mutually exclusive. They describe 2 aspects of the same thing. A car can be red and fast at the same time.\n\n\"Democracy\" describes WHO rules: the people.\n\n\"Republic\" describes HOW the people rule: by electing representatives.\n\nEvery democracy is either a republic (the US, Germany, Ireland, France, etc) or a constitutional monarchy (where even the king must obey the people's laws, like in the UK, Sweden, Denmark, Spain, etc)", "label": 1}
{"text": "Bjørnson and pals chillin' in '96, looking fly!", "label": 1}
{"text": "Damn your mom is hot ![gif](emote|free_emotes_pack|sweat_smile)", "label": 1}
{"text": "Looks like Anne Hathaway's mom", "label": 1}
{"text": "My dud in the 1970s!", "label": 1}
{"text": "That is some crazy corsetry going on. She looks like she's missing ribs.", "label": 1}
{"text": "Cool red beard!", "label": 1}
{"text": "Alicia Witt looked stunning at the premiere! Urban Legend was such a fun movie.", "label": 1}
{"text": "My mom and dad in 1969!", "label": 1}
{"text": "Grandma's high school mugshot (Bellingham High School, Bellingham, Wash., Class of 1944) - she was a real troublemaker!", "label": 1}
{"text": "she is really gorgeous", "label": 1}
{"text": "Wow, what a total dweeb move!", "label": 1}
{"text": "Stay focused gentlemen…", "label": 1}
{"text": "Baby Einstein, three years old in 1882, still figuring out relativity!", "label": 1}
{"text": "Has sadly the only one alive\"\n\nWell, I mean fuck, the dude is 101 years old.", "label": 1}
{"text": "Your grandfather looks great 👍🏾", "label": 1}
{"text": "Is she Asian? Her smooth and silk hair, beautiful skin tone and that look that is very normal in Asia xD tell me that she is Asian. How do I know? Because I am too", "label": 1}
{"text": "Christopher Walken, the dancing guy from Saturday Night Fever!", "label": 1}
{"text": "OK, I'll be the first to say it. WOW! Have always liked her.", "label": 1}
{"text": "Harley Davidson vs. The Marlboro Man: The Ultimate Biker Showdown! 🏍️🚬", "label": 1}
{"text": "she is so beautiful", "label": 1}
{"text": "Martin Kove's 1964 College photo - looking like a total babe at 20!", "label": 1}
{"text": "Couple: \"Greetings, dear! How splendid the weather is today!\"\n\n  \nIncorrect response: \"Ahoy there! The sky be jolly fine, ain't it?\"", "label": 1}
{"text": "I miss the 90s. The world seemed more real back then", "label": 1}
{"text": "Best ever Victoria’s Secret model", "label": 1}
{"text": "Come to our shop for deals on fancy hats and bowties! 🎩👔 #fashionfail", "label": 1}
{"text": "Dear man who posts in 50plusGW, that is a 16 year old child.", "label": 1}
{"text": "Her house which is right up the hill is absolutely beautiful", "label": 1}
{"text": "![gif](giphy|wqNQ8Tz2BN8ti|downsized)", "label": 1}
{"text": "![gif](giphy|wqNQ8Tz2BN8ti|downsized)", "label": 1}
{"text": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "label": 1}
{"text": "I could go Crazy On Either Of Them. Nancy was an underrated kick ass guitarist of her time.", "label": 1}
{"text": "Oof. She was an absolute dream for me back then as well. It seemed like everybody else was all about Farrah Fawcett because of the show and her famous poster, but Cheryl Ladd was always the perfect hot blonde to me.", "label": 1}
{"text": "She is pretty", "label": 1}
{"text": "She is very sincere and joyful, cool photo", "label": 1}
{"text": "![gif](giphy|koOgt4yBSV6qA|downsized)", "label": 1}
{"text": "discovered by David Gilmour, everyone's favorite grandfather", "label": 1}
{"text": "For everyone's information, he participated in the vital efforts to construct and maintain military infrastructure during World War II as a member of the 39th Combat Engineers. Dewey and other combat engineers worked in hazardous environments to construct roads, bridges, fortifications, and minefields.", "label": 1}
{"text": "women had boobs back in 1970s? damn i would suck on them right", "label": 1}
{"text": "🌹💯", "label": 1}
{"text": "That's the kind of girl that makes you wish you knew a little French", "label": 1}
{"text": "Wasn't she in the Saint movie. Great in that. They should have made more.", "label": 1}
{"text": "That hand along her face gives it such a great sense of spontaneity and vulnerability. Was this taken while she was filming \"The Misfits\"?", "label": 1}
{"text": "Desperado - with Antonio Bandares, I think it was her 1st American film and I also believe it’s the only film she did a topless scene in. The movie itself is kind of cool and I’ve watched it many times. But yeah she’s on my forever hotlist.", "label": 1}
{"text": "She was the ultimate Bond girl. He married her.", "label": 1}
{"text": "Carol Alt was a pretty well known model. She was married to Ronald Greschner, a Canadian professional hockey player from 1983 to 1996.", "label": 1}
{"text": "Rest in peace, Jon Lovitz.\n\n\n*[cut to a shot of a very much alive Jon Livitz looking confused]*", "label": 1}
{"text": "she is goddess", "label": 1}
{"text": "Oh my god she's so beautiful, her eyesss", "label": 1}
{"text": "Art club. Halloween. 1992. Spooky art. Fun times!", "label": 1}
{"text": "Ancient comic from 1916!", "label": 1}
{"text": "And dont forget, she later stalked her former victim after he relocated to Salt Lake City, and was caught attempting to do the same thing again. But luckily, they caught her before she could take him away from his house. He was now married and had children.", "label": 1}
{"text": "What a piece of shit you are...", "label": 1}
{"text": "> Brendan Fraser and Afton Smith's divorce settlement in 2009 required Fraser to pay $900,000 per year in alimony and child support to Smith for their three sons. However, Fraser requested a reduction in his alimony payments in 2013, claiming that he was no longer earning enough from acting to make the payments. Smith fought back, accusing Fraser of hiding lucrative film contracts and claiming that his assets totaled $24.7 million in 2012.", "label": 1}
{"text": "Imagine her in an era with camera. She is so beautiful.  \nFor those who dont know, Julie Opp was a prominent American stage actress known for her performances in the late 19th century. Her portrayal of Hymen in Shakespeare's *As You Like It* exemplified her talent and versatility as an actress.", "label": 1}
{"text": "Kate Winslet, 1900s, a fabulous actress!", "label": 1}
{"text": "I figured as much.  My experience was numerous times in two different wars.  Not apples and oranges, but not far off.  Best of luck in the future and go fuck yourself, you fucking communist.", "label": 1}
{"text": "Such a heavenly creature..", "label": 1}
{"text": "Victoria Jackson's \"Comedy Central Presents\" is the one episode that has disappeared from the internet and was never released on DVD. I don't even want to watch it but constantly seeing my library at [282/283 episodes](https://i.imgur.com/VJb5GIJ.png) tears me apart and I would gladly pay money to make it go away 😢", "label": 1}
{"text": "FUCK. A. VEGAN. I DON'T GIVE A SHIT IF YOU EAT SAWDUST MOTHERFUCKER!", "label": 1}
{"text": "Love the outfit, specially the boots.", "label": 1}
{"text": "Lady chills by water, man yaps, 60s.", "label": 1}
{"text": "Me too, always thought  she was beautiful.", "label": 1}
{"text": "They look happy. I love these “live” photos", "label": 1}
{"text": "You’re a creep", "label": 1}
{"text": "Does your mom know that you are uploading photos of her on the internet in a bikini? Is it revenge because she put photos of you on Facebook when you were a child?", "label": 1}
{"text": "I'll handle the music! Got to keep the vibes alive.", "label": 1}
{"text": "It's really disappointing how some people miss the point of nostalgia here.", "label": 1}
{"text": "Look up his post/comment history….  \nHe definitely wants to bang his mom and (hopefully) imaginary daughter.", "label": 1}
{"text": "Genetics really knows how to show up!", "label": 1}
{"text": "My Gampa, around 1930, after a great hunting trip and bagging some big game!", "label": 1}
{"text": "Very young and sexy, right?", "label": 1}
{"text": "Legends never die; they just change their vibe over the years.", "label": 1}
{"text": "That shirt tells a story, man. It's all about keeping those memories alive.", "label": 1}
{"text": "You've managed to keep the spirit alive! Same vibe, just older and wiser.", "label": 1}
{"text": "A vintage Veryfine juice machine would be the ultimate touch! So iconic.", "label": 1}
{"text": "Hair looks 🔥", "label": 1}
{"text": "Baldness patterns are different from wavy/curly/straight hair types.", "label": 1}
{"text": "Heather and Robert, the dynamic duo of 80s horror!", "label": 1}
{"text": "Quit touching the old lady’s boobs", "label": 1}
{"text": "Your mother is a beautiful woman.", "label": 1}
{"text": "Rick Moranis' wife died in 1997 of cancer, and he largely left acting to focus on raising his two kids. Stand-up guy.", "label": 1}
{"text": "Flawless woman", "label": 1}
{"text": "ZOOM Interviews Children on Their Farts!", "label": 1}
{"text": "![gif](giphy|wqNQ8Tz2BN8ti|downsized)", "label": 1}
{"text": "Meh. I always feel a little weird when celebs dress up like dead celebs, especially ones who died kind of tragically.", "label": 1}
{"text": "Wow, look at you with the smarts enough to read an obvious autocorrect typo but not enough smarts to figure out that that's what happened.\n\nYou said anyone who took bio 101 would know your \"facts\" are correct. I explained to you that is not true, as biologists, and anyone else who took advanced biology would tell you that your overly simplified understanding of genetics isn't at all accurate. Instead of showing any humility you double down and call people dumb/incompetent. You have an inferiority complex paired with a fatal case of Dunning-Kruger. Sort yourself out, dude.", "label": 1}
{"text": "These superheroes seem to have grown up already haha", "label": 1}
{"text": "While stripping away the rights of gay people and women in general. And as a person of both of those things; Clarissa can go fuck herself tbh.", "label": 1}
{"text": "Fuck, I'm not going to debate this with you, I'm not defending the Islamic Republic FFS. Sorry to insult your fucking complexity on Reddit, too funny. See ya.", "label": 1}
{"text": "Check dm", "label": 1}
{"text": "Yawn", "label": 1}
{"text": "CIown", "label": 1}
{"text": "Keep crying, path3t!c Ioser", "label": 1}
{"text": "I know this is pr9bably Vietnam, but the first picture has big Rhodesia energy", "label": 1}
{"text": "I know this is probably Vietnam, but the first picture has big Rhodesia energy", "label": 1}
{"text": "PR pish. Another dishonest arsehole for the bin.", "label": 1}
{"text": "I can only imagine how heavy those heads are", "label": 1}
{"text": "Your grandmother looks like she stepped right out of a classic movie—what a fabulous vibe!", "label": 1}
{"text": "I ninja turtles liked in 1991!", "label": 1}
{"text": "Neve Campbell and Rose McGowan filming Scream, but with a twist of hilarity!", "label": 1}
{"text": "Iggy Pop and the Stooges rockin' at Farmington High School, 1970! 🤘 #historicalerror", "label": 1}
{"text": "We wouldn't go bankrupt, the money would shift back to pre-Reagan days of distributions.", "label": 1}
{"text": "I like the dedication! Must have wear something half-round at your back and it will be perfect.. You gotta be the 5th member", "label": 1}
{"text": "Learn your letters you sad little chump", "label": 1}
{"text": "Happy Birthday!", "label": 1}
{"text": "Jennifer Connelly 1996? More like Jennifer Can't-nelly 1996!", "label": 1}
{"text": "wow", "label": 1}
{"text": "Yeah, but did he take the traditional inflatable ET?", "label": 1}
{"text": "When the boy arrived at the hospital 30 minutes later, doctors confirmed without a doubt that Jim’s quick actions had saved his life. Jim returned to the game in his blood-stained uniform - a true badge of courage. After visiting the boy in the hospital and learning his family had modest means, Jim went to the business office and instructed that the bill be sent to him.", "label": 1}
{"text": "What a story! Thanks for sharing that.", "label": 1}
{"text": "Any player who thinks they're clutch in pressure situations ain't got shit on Jim Rice.", "label": 1}
{"text": "Athletic achievements are too often labeled heroic.\n\nThis is real heroism. Enduring thanks to Jim Rice and others who’ve found themselves in similar situations and stepped up.", "label": 1}
{"text": "Such powerful defiance echoes throughout history. It's inspiring.", "label": 1}
{"text": "Jim comes in to our market all the time such a classy man chats with everyone", "label": 1}
{"text": "Rice was one heck of a hitter in his heyday.  Very strong and productive hitter. Also one of the slowest SOBS I've ever seen on the basepaths. The man didn't lead the league in double plays hit into for no reason. Great bat, great power, but as he got older the man simply could not run to save his life.\n\nThank god this happened before his legs went or he'd still be running to the dugout. He is the real mvp", "label": 1}
{"text": "Nice photo! I wonder what camera they used. It looks like a coal painting. Very detailed", "label": 1}
{"text": "Wolfman's got nards!", "label": 1}
{"text": "\"Original content\"? On a sub for old photos?\n\nSo if a cool photo is posted on a very small sub it's not ok to share it to a larger audience? There is about a 0.001% chance that you saw this pic when it was posted to r/RollingStones. Complete nonsense.", "label": 1}
{"text": "Jeez, that’s what you call legs for weeks.", "label": 1}
{"text": "Wow I've never heard of her before but she's beautiful and amazing!", "label": 1}
{"text": "It’s incredible to see how far he’s come, but I still can’t unseen the future Mr. Bean in that photo those eyebrows are legendary, lol", "label": 1}
{"text": "This is the kind of effortless style we just don’t see anymore! Jenny Claire and that Mini in ‘72—it’s like the perfect snapshot of cool. The fashion, the vibe, the car… everything about this just screams iconic!", "label": 1}
{"text": "Nah, I just don't want to be pressured into kneeling for lumber I don't believe in by a Russian groomed crybaby billionaire who loves to hastle, hustle, and harass women.", "label": 1}
{"text": "how is this guy doing this lol I cant even walk in a straight line carrying a full glass of water without spilling it xD", "label": 1}
{"text": "Right? I’m curious to know if he resembles his mother or father more", "label": 1}
{"text": "Spooky times in NJ '87! Goblins galore! 🎃👻", "label": 1}
{"text": "Truth be told, Carl Sagan had an incredible ability to connect science with humanity. His insights on media's impact on public understanding are just as relevant specially today.", "label": 1}
{"text": "They elected their own leader to nationalize their oil and the west overthrew their democratically elected leader with a brutal dictator.", "label": 1}
{"text": "I actually prefer seeing old pics like this one instead of seeing sexy almost naked bodies like this group is a prn magazine.", "label": 1}
{"text": "I looked it up and it looks like she was at Phase IV and drank herself to death... and looked like her husband, Peter Sellers, somewhat has played a role.", "label": 1}
{"text": "Sandra Green, 1780s - she invented the electric bonnet!", "label": 1}
{"text": "Damn, Will's mom is hot", "label": 1}
{"text": "“Night falls for all of us in the end, and too soon for some...”", "label": 1}
{"text": "VH1 Divas Live 1998: Gloria Estefan, Mariah Carey, Aretha Franklin, Carole King, Shania Twain & Celine Dion... and a surprise appearance by Bigfoot!", "label": 1}
{"text": "George Best and Susan George in 1969, the best duo ever!", "label": 1}
{"text": "Beloved friend", "label": 1}
{"text": "Hot as fuck!", "label": 1}
{"text": "Brazilian", "label": 1}
{"text": "Sure, laugh it off. Ignore it. Bury your head in the sand.", "label": 1}
{"text": "60s black woman with afro in groovy outfit!", "label": 1}
{"text": "beautiful", "label": 1}
{"text": "There were a lot of critical comments around Elvis Presley's Girls! Girls! Girls!. All because of ongoing concerns about his influence on youth culture, especially in terms of sexuality and propriety that time", "label": 1}
{"text": "🥰🥰🥰", "label": 1}
{"text": "So cute🥰🥰", "label": 1}
{"text": "I love the authenticity of her yard! Foggy and green", "label": 1}
{"text": "Forgive me father for I am able to sin", "label": 1}
{"text": "She is an amazing woman. And she can be funny too! You can watch Bedazzled, The Three Musketeers, and a \"Mork and Mindy\" two-parter, and feel her humorous version", "label": 1}
{"text": "Definitely getting those classic film noir vibes!", "label": 1}
{"text": "People calling her portrayal in that film controversial and here's the context:  \n\"In the late 1960s, Linda Hayden gained attention for her role in the controversial film *Baby Love*, which tackled provocative themes regarding teenage sexuality. At just 16 years old, her performance sparked debates about the portrayal of young women in cinema and raised questions about exploitation versus empowerment in film narratives.\"", "label": 1}
{"text": "Raquel Welch was just stunning! She had that perfect mix of glam and confidence that really lit up the screen. Definitely a true icon!", "label": 1}
{"text": "[there is….](https://m.youtube.com/watch?v=01w-9pUsy18)", "label": 1}
{"text": "My favorite is the band Muse being forced to playback, so the band members switched instruments. Iirc they even let the real drummer (who isn't the face of Muse) handle the interview.", "label": 1}
{"text": "Totally agree. Especially with the Brooklyn accent. It felt different from Martinet’s Italian version.", "label": 1}
{"text": "Never got her due as one of the best looking and talented actresses in her era", "label": 1}
{"text": "My dad always watched *Bewitched* while I was growing up. Aside from *Star Trek* and *Gunsmoke*, he didn’t care much for TV, so it seemed odd for him to be into a sitcom. It took me a while to figure out why.", "label": 1}
{"text": "Look up the clothes belonging to the Egtved girl. Not sure if it qualifies as a miniskirt but close enough I think.", "label": 1}
{"text": "Sade bein’ too cool for us all singin’ ‘Smooth Operator’ in ‘84.", "label": 1}
{"text": "What an amazing voice still! I still remember when she got heavy mtv airplay. Along with Michael Jackson, Judas priest and many more notable performers.", "label": 1}
{"text": "here we are again with a feed full of almost naked sexy ladies-  \n.  \n.  \nshe looks amazing my god", "label": 1}
{"text": "My ultimate crush back then. I still remember how I wishing I could replace Buck Rogers for that reason. ", "label": 1}
{"text": "Now this is what I hope to see more in this sub! I prefer cool pics like this instead of almost naked women, yes they are old school and really cool but cool can have a deeper meaning than body figures", "label": 1}
{"text": "Takes balls.", "label": 1}
{"text": "In late 1997 I had a crush on her & Kate Beckinsale.....not much has changed.", "label": 1}
{"text": "![gif](giphy|ysTUxdj02ZYre|downsized)", "label": 1}
{"text": "This woman personally pushed me into puberty. I was 9 - 10 when Wonder Woman was on, wasn't sure why but so wanted to be Steve Trevor. When she'd run or whatever I had feelings I didn't understand.", "label": 1}
{"text": "Ok, so you are saying Bill Gates Jr was continuing that?", "label": 1}
{"text": "NSFW", "label": 1}
{"text": "Coincidentally, 1992 is also her ranking on a scale of 1-10.", "label": 1}
{"text": "Meanwhile, Elmo, illegal immigrant, election tamperer, traitor, still not pied...", "label": 1}
{"text": "Schwing!", "label": 1}
{"text": "Is it just my insecurity, or were they just in the middle of talking about \"that weird guy with the camera over there\" when this picture was taken?", "label": 1}
{"text": "I would love to see backstage...", "label": 1}
{"text": "Can we see the other side plz", "label": 1}
{"text": "All this from a slice of gabagool?", "label": 1}
{"text": "People like you are cruel", "label": 1}
{"text": "Role model", "label": 1}
{"text": "Fuck you asshole.", "label": 1}
{"text": "Yes i am asian", "label": 1}
{"text": "The kind of hair I always dream of having. That is so neat!", "label": 1}
{"text": "I watched that movie and  I can say Charlotte brought depth to her role in it. Even with the films action scenes, her  performance added emotional complexity to the story. I love it", "label": 1}
{"text": "I love seeing that video every time I see it.", "label": 1}
{"text": "It's all about nostalgia, though.", "label": 1}
{"text": "If he was anything like my kids, he probably took one bite out of each pear.", "label": 1}
{"text": "Good afternoon how are you?", "label": 1}
{"text": "Ever since I watched True  Romance, I was captivated with her charm and beauty", "label": 1}
{"text": "a little info about her, she was ohe once said that her boyfriend Richard Pryor did so much cocaine that there were levels of it in his semen. She found out when her gynecologist told her there was a build of cocaine residue near her cervix. Pryor refused to wear a condom or get clean so they broke up.", "label": 1}
{"text": "![gif](giphy|M6FcAlmZKcUSI|downsized)\n\nBy the way, she dances well.", "label": 1}
{"text": "She was so hot and lovable in True Romance.", "label": 1}
{"text": "Stunner", "label": 1}
{"text": "![gif](giphy|1xnuqW1JdSs8SslFzc|downsized)", "label": 1}
{"text": "This, I love. Source?", "label": 1}
{"text": "She was absurdly attractive before all the work she had done.", "label": 1}
{"text": "It's worth noting that he didn’t keep them as pets. He rehabilitated them and then released them back into the wild.", "label": 1}
{"text": "Six months later:  \nThose cute little claw marks are still adorable... until they grow up.", "label": 1}
{"text": "![gif](giphy|WQy9FkJlhGSwl3eQ5V|downsized)", "label": 1}
{"text": "https://i.redd.it/8ba124gujoyd1.gif", "label": 1}
{"text": "P as in Phoebe, H as in Heebee, O as in Obee, E as in Ebee, B as in Beebee, E as in Ebee.", "label": 1}
{"text": " Phoebe Buffay all the way! She's quirky and fun.", "label": 1}
{"text": "\"Can I pet your squirrel?\"\n\n\"This here's a mustache\"", "label": 1}
{"text": "![gif](giphy|Tmwir1pAi8fUk|downsized)\n\nShe was talented, smart, elegant and kind, one of the few celebrities I truly admire.", "label": 1}
{"text": "She’s beautiful", "label": 1}
{"text": "![gif](giphy|5pYsInXQ6bZPBwGcNU|downsized)", "label": 1}
{"text": "At the wildlife rehab sanctuary I used to work at, there was an enclosure that was sponsored by Bob Ross.", "label": 1}
{"text": "You forgot to say please...", "label": 1}
{"text": "its fun to see the young version of such a hilarious iconn", "label": 1}
{"text": "Iconic Cool", "label": 1}
{"text": "She will always be beautiful to me.", "label": 1}
{"text": "These girls had the kind of style that’ll never go out of fashion. 70s vibes were everything.", "label": 1}
{"text": "mod squad", "label": 1}
{"text": "Moving the queen out early. Bold move let’s see if it pays off.", "label": 1}
{"text": "You're so cool, you're so cool, you're so cool...", "label": 1}
{"text": "oh how nostalgic. I remember when I watched A room with a view, she made the film amazing with her acting. She delivers a compelling performance as Lucy Honeychurch. You will really notice the evolution from an innocent young woman to someone who becomes aware of her desires and the limitations imposed by society.", "label": 1}
{"text": "if there hasnt anyone told you, you are stunning that day, pretty face wearing a pretty smile", "label": 1}
{"text": "*That vintage Helena vibe, timeless and one of a kind!*", "label": 1}
{"text": "1983? Sure, it wasn't 1963?", "label": 1}
{"text": "Photoshopped. Badly.", "label": 1}
{"text": "Gorgeous woman", "label": 1}
{"text": "She's a Goddess!", "label": 1}
{"text": "That’s a powerful piece of history! Your grandad’s experiences during the Korean War must be a source of pride and inspiration that so much respect to him and all who served! #HeroesNeverDie", "label": 1}
{"text": "does 'blue peter appearance' mean what i think it means", "label": 1}
{"text": "I also had the speak n math.", "label": 1}
{"text": "This movie, even decades later still looks amazing. The acting, effects, everything about it has just aged really well IMO. It's one of my favorite Tim Burton movies ever", "label": 1}
{"text": "[Oh, you mean THIS Wild Kingdom?](https://youtu.be/GNAbAp0NnqI?si=W9wgJUiasDQ0NI4c)", "label": 1}
{"text": "Oh how nostalgic! I watched her in Divorce Italian Style and the moment I see her I started watching more of her films. A great actress with a natural humor. She really did well portraying Angela as young and innocent yet rebellious character. She is so versatile", "label": 1}
{"text": "oh one of her awards came from the Working Girl! Hot nostalgic. It was a very heartfelt movie. There was so many emotions and she really nailed it. That movie showcased her versatility", "label": 1}
{"text": "TF are you saying? Get a life. It doesn't cost you to be kind", "label": 1}
{"text": "![gif](giphy|xTiQyG9tM8TzbCHWtG|downsized)", "label": 1}
{"text": "The '50s gave us Sticky Gooey!", "label": 1}
{"text": "Elizabeth Hurley in the ’80s was pure glamour! She had such a timeless beauty and effortless style that still inspires today.", "label": 1}
{"text": "I listen to jazz, most of it recorded decades ago by musicians who have been dead for a long time. So I'm not current on recent pop music. One prodigy worth knowing is Julian Lage, the jazz guitarist. He's a once-in-a-generation talent. \n\nI agree the industry has changed. Q cut his teeth playing jazz trumpet in the early '50s, when a few big bands still existed. He had to be a fluent sight reader, and he had a context for knowing how arrangements \"work.\" He was surrounded by surviving big-band-era jazz musicians who were amazing musicians. That kind of incubator hardly exists today.\n\nI just finished the Joni Mitchell biography yesterday. Amazing talent. It's a pity she blew her soprano range smoking four packs a day. And it's a pity she's been so outspoken. In quote after quote, she says hateful things about just about everyone. Knowing when to shut up would have helped her. As much as I like her music, her sharp tongue is an unattractive feature.", "label": 1}
{"text": "how is this old school? if you aren’t a minor then the 80’s is at most 20 years behind you. by that logic spongebob is old school now. when did people get so full of themselves? I think it was around when cell phones were invented.", "label": 1}
{"text": "Helen Mirren, 60s? More like Helen Mirren, 16s!", "label": 1}
{"text": "What an iconic lineup! Ronnie Spector with the E Street Band must have been an incredible collaboration. Such legends in one photo—it's amazing to see them all together like this!", "label": 1}
{"text": "Jimi Hendrix rockin' out in '69, playin' that groovy guitar!", "label": 1}
{"text": "She is very amazingly sophisticated.", "label": 1}
{"text": "She looks stylish!", "label": 1}
{"text": "He's a cool guy", "label": 1}
{"text": "Audrey Hepburn was the only person who could wear short little pixie bangs and make it look good.", "label": 1}
{"text": "If Germans would have imported slaves on the same scale us did, we would have seen black nazis.", "label": 1}
{"text": "Every time I remember them, I miss my family.. I remember it was one of our bonding with my family. One of the reasons we enjoyed our every dinner..", "label": 1}
{"text": "So you are from an ex soviet country and still want communism. All the laughs are back to you. Tankie.", "label": 1}
{"text": "I could be wrong but creepy pedo uncle tom vibes here.", "label": 1}
{"text": "One of Kansas known serials?", "label": 1}
{"text": "Yea for sure. Almost every family has it. This made my childhood", "label": 1}
{"text": "Actually there was a school for women snipers. It's in Podolsk - Plescheevo. Now it's memorial. My country house is near. That school trained not only Roza, bht other notable women sharpshooters. May be u ll also be surprised to know about Nomokonov also know as Taiga Shaman. Just a hunter from Siberia who hunted down many Nazists and some of their professional sharpshooters. Just a hunter... His methods described in book \"Трубка снайпера\" \"Sharpshooter's pipe\".", "label": 1}
{"text": "Somethin' about old Hollywood just hits different. The black & white, the classic style… Chaplin understood that the magic was in the details", "label": 1}
{"text": "Pros camping in 70's: you have a table for picnic \n\nCons: zodiak killer", "label": 1}
{"text": "Shut the fuck up you walking queef, you are the least punk mf since Ronald Reagan", "label": 1}
{"text": "Yea. That's one sturdy car. In today's era I believe it is all about aesthetics..", "label": 1}
{"text": "It blows my mind how engineers even thought of these.\n\nMan, I'm dumb.", "label": 1}
{"text": "Can't believe I've spent 5 minutes watching this, no regrets though", "label": 1}
{"text": "it's really awesome but maybe they can add more spokes", "label": 1}
{"text": "and no ads", "label": 1}
{"text": "yeah its like 5-10% of people pushing humanity forward the rest of us are just piggybacking their brains lol", "label": 1}
{"text": "I never seen Einstein with his hair this neat.. maybe the Chaplin effect? xD", "label": 1}
{"text": "Joey Tribiani Rogan", "label": 1}
{"text": "The energy in this pic is literally unreal. This is peak 80s vibes 🔥", "label": 1}
{"text": "Serena looks stunning.", "label": 1}
{"text": "Toe", "label": 1}
{"text": "Life. People used to grow up. Now people at 30 can look 18.", "label": 1}
{"text": "How can someone so good looking have such mutant looking children? The dad's good looking, too, so I'm just mystified whenever I see pix of their kids.", "label": 1}
{"text": "He looks cool in that shirt. I didn't know pink shirts looked so good.", "label": 1}
{"text": "Eddie Van Jackson & Michael Halen • Stadium Texas • 7/13/84", "label": 1}
{"text": "Holy smokes", "label": 1}
{"text": "No idea about this pic but looks just like she did in the early 90’s…. Lol seems like such a reddit thing “no you can’t be beautiful naturally!!! Can’t be real!”", "label": 1}
{"text": "A bunch of rowdy hooligans, a punk, and a Madness enthusiast chilling on Brighton beach in '83, pic by Jon Ingledew.", "label": 1}
{"text": "Young legends amazing photo capture", "label": 1}
{"text": "Such a cool comparisonn, u can really see how much they changed over the yrs but they still have that same vibee", "label": 1}
{"text": "Yo Gabba Gabba Biz Markie's beat of the day.", "label": 1}
{"text": "Naomi Campbell, rocking it in 2087! 🚀📸 #timelessbeauty", "label": 1}
{"text": "Humphrey Bogart chillin' on the backlot at Warner Bros in '42, looking fly as ever! 😎 #OldHollywoodGlam", "label": 1}
{"text": "Humphrey Bogart chowing down on a sandwich at Warner Brothers in 1942! 索 #snacktime", "label": 1}
{"text": "Yes lol. When you’re king, you get helpers for your neat little hobbies.", "label": 1}
{"text": "Michael Jackson and Freddy Mercury in 1983 were twerking on stage together!", "label": 1}
{"text": "Their national clothes look very interesting. I understand that this is due to the temperature regime in their region.", "label": 1}
{"text": "From what I remember I'm pretty sure that on that occasion the monkey stayed at home and Michael even brought a llama into the studio 😂", "label": 1}
{"text": "The child soared over his mother, mistaking her for a bike ramp.", "label": 1}
{"text": "There's even a HK comedy movie that mocks Jackie Chan with a chacter based on his reputation. ", "label": 1}
{"text": "X -Files 🫠", "label": 1}
{"text": "Absolutely! Every single one of those posters is iconic. Tom Jung's art has truly shaped the visual history of cinema.", "label": 1}
{"text": "Nice pull! Classic scene from *Happy Gilmore.* It’s always fun to see these connections pop up.", "label": 1}
