{"text": "ANd hIs tAn SuiT'.", "label": 0}
{"text": "You are as well", "label": 0}
{"text": "It's become apparent that, beside his/her  dementia, DJ CHUMP was actually born a female, had transgender surgery, and it's her original vagina that is leaking, calling for diaper and towel use.", "label": 0}
{"text": "DJ CHUMP, was born a woman!", "label": 0}
{"text": "From another comment:\n\n> The way I see it, the average person (or at least the average American) is chronically dehydrating themselves and/or bloated from extremely high carbohydrate intake, then wants to turn around and throw shade on salt instead of addressing the real issue.\n\n> I just can't help but wonder how many health problems out there are actively being caused by people believing uncritically that reducing salt intake is inherently a good thing.\n\nThe point is that salt should be consumed proportionally to water, and a lot of people don't consume nearly enough water.", "label": 0}
{"text": "Eh they have the authority to just shut him down and deal with it later, but I think they don’t want to deal with the public blowback with two weeks left to go.", "label": 0}
{"text": "> \"hey, it's not the most healthy... but more healthy than lunchables or similar products\" and I think they'd been fine.\n\nWell, not when it turned out to be the case that we would preservatives in food for a reason.  Lunch kits filled with moldy cheese are not healthier than preservative-filled lunch kits that are mold free.", "label": 0}
{"text": "Wow o stand corrected", "label": 0}
{"text": "> Maybe they have been advised that discussing it publicly will be more of a PR hit than just waiting for it to blow over.\n\n....If they had been advised this way, they would *not* have responded by attacking the people calling out their products.  Come on.", "label": 0}
{"text": "Merrick Garland has been a righteous level of disappointment.", "label": 0}
{"text": "Is it likely that this is the video that supposedly exists of trump groping the underage daughter of a donor?", "label": 0}
{"text": "yeaaaah, sounds right", "label": 0}
{"text": "I enjoyed how your comment has the tacit admission that yes, our current president fondles and sniffs young kids on camera, but technically the number of kids can be expressed with scientific notation so it's not countless.", "label": 0}
{"text": "So like every reddit?", "label": 0}
{"text": "All of this terrifies me.  So many people just like Trump and happy to do his bidding.", "label": 0}
{"text": "You're \\*checks notes\\* oblivious to reality and facts. Here you are literally accusing the other side of doing the very thing you are doing right here and now. Like, are you that deep into a cult?", "label": 0}
{"text": "if hillary didn't, he wont", "label": 0}
{"text": "Isn't it true that he can't even vote for himself as a convicted felon?", "label": 0}
{"text": "Saying something is true and something actually being true are different things. Right wingers claim *a lot* of bullshit.", "label": 0}
{"text": "How does the judiciary system have any credibility after this?", "label": 0}
{"text": "It doesn't count because \"insurrection\" is a nebulous term that would need to be defined by congress and litigated before someone could be removed, also the ammendment explicity applies to congress and electors in the electoral college, but not explicitly the president and vice president.\n\n\nOne could easily make the argument that winning a general election would be equal to receiving clemency from 2/3s of the house (if that even applied in this situation.)", "label": 0}
{"text": "Judges have created a separate form of justice for rich Republican politicians.", "label": 0}
{"text": "A normal person wouldn’t have been charged in the first place as the statute is used for organizations rather than individuals.", "label": 0}
{"text": "I'm honestly surprised Shapipo decided to go along with this after undoubtedly seeing Charlie Kirk get embarrassed on this channel earlier.\n\nBut then again, these guys have a \"any publicity is good publicity\" policy, so maybe it's not that surprising.", "label": 0}
{"text": "Yeah they recently had [\"1 Woke Teen v 20 Trump Supporters\"](https://knowyourmeme.com/memes/woke-teen-vs-20-trump-supporters-jubilee-video).\n\nCrazy they had ben Shapiro and Charlie Kirk but for libs it's like, one 20 year old streamer who isn't a part of some big network", "label": 0}
{"text": "Yea, but if you don’t have at least 100 million dollars behind your campaign, you won’t make it past the primaries and no one will even hear your name. We bow to 3 things in this country; patriarchy, global militarism, and the almighty dollar.", "label": 0}
{"text": "This one seems to have worked well.🤦‍♂️", "label": 0}
{"text": "if your employment status was decided by millions of over-religious, gun wielding dipshits, you might get that job too", "label": 0}
{"text": "Correct me if I'm wrong but I don't believe Hillary was convicted (or charged) with any felonies.", "label": 0}
{"text": "Trumped up charges. All nonsense used to affect election results just like the Russia collusion hoax.  The charges will eventually be dropped.", "label": 0}
{"text": "The issue is that, once partisan divides get wide enough, it is trivially easy to convict a politician on either side of the isle be charging them in an area run by their political opponents.   \n\nThere are plenty of countries that have gone this route and it almost always harms the democratic process and peace of the nation.", "label": 0}
{"text": "The president is elected by the States, not the people.", "label": 0}
{"text": "That doesn't work.  [The Presidential pardon can only apply to federal offenses.  They do not apply to state or local offences, or private civil offenses.](https://en.wikipedia.org/wiki/Federal_pardons_in_the_United_States#Limitations)", "label": 0}
{"text": "14 or more year.  But I knew what you meant.\n\n  \nThe difference is in placement and timing.\n\nOriginal:  This is what it takes to be President:.....\n\n  \n85 years later:  Oh, also, if you rebel against the US, you can't do that ANYMORE.  In addition, this is not a specific Presidential requirement, like Article II, Section I is.  It is a disqualification from ANY office.  People who are not natural born citizens can be Governors, Senators, Congresspeople, federal judges, etc.  But 14A disqualifies them from ANY of those offices.\n\n  \nAgain, a difference", "label": 0}
{"text": "Which in itself is affecting the outcome of the race.  What a joke.  He should be in prison. Period.", "label": 0}
{"text": "The people who wrote the Constitution thought that the Electoral College would keep somebody like Trump out of office. We now know that that was a fantasy.", "label": 0}
{"text": "Answer: In the United States they have two legal systems. One for the rich and one for everyone else (not rich)", "label": 0}
{"text": "> freaking president job we are talking about..\n\nPrecisely. That's why", "label": 0}
{"text": "You right too!", "label": 0}
{"text": "I'm going to defend this decision. There's no way to know what it would do to the election. Maybe Trump being behind bars and only allowed out to attend campaign events would actually help him win because he would look like he was a martyr. You can't unbreak that glass. It sucks to delay it, but would you want to be the guy who pulled a Comey and helped Trump win?", "label": 0}
{"text": "I'm broken, looking for any reason to vent.  Sorry.", "label": 0}
{"text": "What if it actually helped him? What if swing voters decided that he was being railroaded by the justice system and voted for him because of it? You just don't know how it's going to go. A third of American voters are ridiculously uninformed when it comes to choosing a president.", "label": 0}
{"text": "Technically that's incorrect; he is allowed to vote under Florida law.", "label": 0}
{"text": "This is a ridiculous accusation.", "label": 0}
{"text": "Answer:  once he’s sentenced the appeal avenues open up?", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\nThank you for your submission, but it has been removed due to lack of context.  \n\n**Please see Rule 2** and repost with a **URL or a screenshot** (you can host it on imgur.com) **in your submission body** so that the users can better know what you're talking about and increase your chances for getting an answer.  **Feel free to repost once you find a URL.**  (Please remember to include the full URL: URL shorteners don't count.) Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "My theory:  Merchan was going to let him off with a very light penalty.  A small fine, a year of probation, no jail time, etc.  \n  \nSo Merchan deliberately delayed sentencing so that the MAGA movement would remain depressed about their chances and just stay home.", "label": 0}
{"text": ">The guy is Hitler 2.0\n\nThat couch fucker guy agrees!", "label": 0}
{"text": "Google turns up nothing so provide a source other than your fucking emojis.", "label": 0}
{"text": "Whenever people talk about white privilege I point at Donald Trump. A career criminal, two bit charlatan continually pushed onto the public and \"half the country\" (In reality closer to 1/3rd of voters) just fall at his knees, lick his boots and say \"stomp on me harder, daddy\".\n\nBut you have a well educated, well spoken, highly intelligent, master orator like Obama and they are jumping over themselves to demonize and declare him the antichrist.\n\nWhy is it that Trump can be absolutely classless yet Obama and Harris etc. have to be absolutely flawless? It sickens me, it really does :(", "label": 0}
{"text": "Well the charges are purely political show, so I would assume that makes a difference", "label": 0}
{"text": "You don’t believe random kids caught off guard and unprepared aren’t master debaters?", "label": 0}
{"text": "The badder news is we are taking every since penny and thing you own and giving it to two ladies in George", "label": 0}
{"text": "4 years? This is Trump. She'd be lucky to last half that", "label": 0}
{"text": "I don't mind at all. I'm always happy to help someone or just talk to someone. Some people though do get quite annoyed which is why I gave you the warning. \n\nIn the case of employee employer relationships there's nothing on the federal books about that not being allowed, some states might have some weirdly niche rule that applies in certain situations, but I would be unaware of any of those. Lawyer client relationships are going to be very different from an employee employer relationship for obvious reasons. \n\nBe on that I'm not sure why you're bringing it up, unless you're referencing something else in this thread that I've long forgotten about.", "label": 0}
{"text": "The tl;dr: DoD Directive 5240.01 is the compilation of existing regulations governing the interaction of defense intelligence agencies with civilian law enforcement. It does not make laws or grant powers. It’s a glorified reference document. The DoD updates it to include any new additions or changes in language. This update adds a clause from a 2018 directive (Secretary of Defense must approve assistance that might result in the use of lethal force). That directive did not make this law; laws are passed by Congress or executive order. The DoD has been updating all relevant directives with the same language for consistency. 5240.01 prohibits assassination and violations of the Posse Comitatus Act. Steve Bannon and Mike Flynn are spearheading efforts to spread the conspiracy theory, likely to prime for violence just after Election Day and to promote alt-tech platforms.", "label": 0}
{"text": "It was also bullshit, he payed for hush money, which she agreed. He broke the payment up into small payments so she would hold to the agreement. They made each payment a felony. So its really one \"offense\" if you even want to call two consenting adults agreeing to a non disclosure contract an offence.\n\n\nIts called political weaponizing of the courts and this post is propaganda.", "label": 0}
{"text": "You don't have to write what you're doing right now in the comments. You use them to talk to people instead.", "label": 0}
{"text": "Silly boy. Rules don't apply to the rich. (Or severely indebted to rich but somehow powerfully)", "label": 0}
{"text": "Not just Giuliani, his original fixer Michael Cohen went to prison for Trump schemes. In fact, [quite a few of his attorneys are in hot water.](https://www.forbes.com/sites/alisondurkee/2024/09/26/kenneth-chesebro-charged-in-wisconsin-here-are-all-the-former-trump-lawyers-now-facing-legal-consequences/) The turd taints everything he touches.", "label": 0}
{"text": "Do you not know what \"editorial staff\" means?\n\nThey're the people who write op-eds.  It's literally their jobs to give opinions...you know, op-ed.  Opinion-editorial.\n\nWhich is completely divorced from the journalism side of the house at every news organization with the slightest bit of credibility.", "label": 0}
{"text": "And so after he's lost, jail time and bail on appeal denied CAN be applied and although he'll scream unfair, it totally will be. Merchan won't have to put up with shit anymore.", "label": 0}
{"text": "Fucking bullshit.", "label": 0}
{"text": "Not sure you’re convicted until sentenced.  If the case is tossed on appeal pre election the whole thing would be a waste of time.", "label": 0}
{"text": "Depends if Trump wins. Presidential pardons might be issued.", "label": 0}
{"text": "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": ">If he gets in, I'd be surprised if he actually does much that direction\n\nYou are 100% wrong. It wouldn't matter if he played golf 10 hours a day every day, once he gets elected, it will be the people around him making all the decisions and the Project 2025 team will make sure all the fascist dictator bullshit gets put into play. \n\nThis is a perfect example of why people who don't know what they're talking about should stay out of the conversation.", "label": 0}
{"text": "A state like New York gives more than it receives", "label": 0}
{"text": "It’s cute that you think Trump will follow any law once he’s president-elect", "label": 0}
{"text": "Technically any crime committed outside of presidency (and even then they’re not immune) doesn’t prevent them from being arrested and jailed.", "label": 0}
{"text": "You forgot 'white'", "label": 0}
{"text": "[Will Lewis](https://en.wikipedia.org/wiki/William_Lewis_(journalist\\)) is the CEO of the *Washington Post*.\n\nHis previous jobs are for the *Telegraph* in the UK (notoriously right-leaning), and the *Wall Street Journal*, which also leads conservative and has favoured Republicans even more since Rupert Murdoch took it over. Prior to that, he worked to help rehabilitate the reputation of News International after the *News of the World* phone hacking scandal.\n\nWill Lewis is a company man for right-wing causes.", "label": 0}
{"text": "This is why any president (especially a criminal one) should stack the courts with judges they appoint", "label": 0}
{"text": "Because large leftist streamers know it’s bad faith from previous interactions and don’t want to deal with it where smaller creators want outreach", "label": 0}
{"text": "The problem is that it should not be a choice that is available to begin with.. how could it be? \n\nThe fact that it isn't an immediate disqualification is batshit crazy.", "label": 0}
{"text": "L", "label": 0}
{"text": "Imagine Trump winning and then getting sentenced 4 years jail time. Prison prez insanity!", "label": 0}
{"text": "To paraphrase a great comedian, \"imagine how stupid the average American is. now, look around you. Half of the people you see are dumber than that.\" - George Carlin", "label": 0}
{"text": "Answer: the sentencing was delayed until after the election. \n\nNow, you might be thinking well doesn't that prove that he's getting special treatment? Well, delayed is not the same as acquitted. Also you need to consider that the political ramifications of him being sentenced and put in jail (which is where I think he is headed here*) could be a case of **unexpected outcomes**. You just don't know how that's going to shake out. What if you put him in jail and he actually wins the election because he looks like he's being harangued by the justice system? Keep in mind that Fox News is the number one broadcast news in America and they would certainly spin it that way. \n\nUnfortunately, we have a lot of people in America that are vulnerable to right-wing propaganda. Putting Trump in jail might actually make the situation worse and help him win. Merchan doesn't want to risk being the next. James Comey.\n\n\\* 34 felonies, not an ounce of contrition, no admission of guilt, attacked the court multiple times = the judge throws the book at you.", "label": 0}
{"text": "Answer: Those convictions are getting tossed out, rendered null  and void. Everyone knows it deep down inside but they don't want to admit it to themselves.", "label": 0}
{"text": "> the SCOTUS immunity decision doesn’t apply here at all. the alleged conduct involved how he falsified business records as a private citizen and the alleged conduct occurred well before he took office.\n\nActually, some of the conduct (falsifying business records) did happen while he was in office, and Trump tried to get those charges overturned after the immunity decision.  He failed, for now, but I don't remember where that stands.  He'll probably get at least one more chance to make that argument on appeal.", "label": 0}
{"text": "You’re totally right! I Jumped to conclusions on this one. I guess I saw the younger generation being obsessed with her and they don’t typically know what good music or musicianship is so I assumed she sucked. I’ve listened to her music and, although I still dont love the music I can agree she is a talented singer", "label": 0}
{"text": "Well my but aren't you the optimist!", "label": 0}
{"text": "Trump is above the law \n\nI mean, he very obviously is", "label": 0}
{"text": "Unfortunately. \n\nJustice delayed is justice denied.", "label": 0}
{"text": "New loophole;\n\n1) Run for president as an independent\n2) commit crime\n3) ???\n4) profit", "label": 0}
{"text": "I also think it’s possible that they are so chronically online that they don’t realize how extreme they sound to everyday people. Or maybe they just have that large of egos?", "label": 0}
{"text": "What MAGA *are* doing is screaming about how The Libs have moved so far to the EXTREEEEEEEEME LEFT that \"Not even the ultra-left media supports them anymore!!!!\"", "label": 0}
{"text": "Out with the old and in with the new. Probably needed a revamp anyway", "label": 0}
{"text": "Government jobs usually have a specific set of rules about what can and cannot be checked.\n\nUnion jobs as well.\n\nThe Presidency also does.  You learned about them in grade school.", "label": 0}
{"text": "You know why. Everyone knows why. No one that can do anything has the brass to. Everyone just stands around silently looking at each other to see who will be the first one to step up because \"muh precedence\"\n\nCome November 5th, we get the country we deserve.", "label": 0}
{"text": "An actual answer here: the presidency isn't a job.\n\n You don't have a labour contract with the government or something like that. You rather hold public office and the public is the group that \"hires\" you. \n\nIt would probably not be election interference to do sentencing before the election. But it wouldn't look good, can't have the adjudicating arm seem to be influencing the executive arm. \n\nTrias politica is important, both in fact as in appearance.", "label": 0}
{"text": "yes, and also because of gen z. they have made it a huge point to de-stigmatize mental health. millennials passed them the ball, and gen z went in for the layup.", "label": 0}
{"text": "Can someone explain why a candidate having committed crimes shouldn't affect the outcome of an election?", "label": 0}
{"text": "> What if he is elected then sentenced before inauguration? \n\nIf that happens (which is quite possible,) I think he'd just refuse to turn himself in, and dare them to come and get him (in Florida, of course.)  That wouldn't work forever, but he could easily keep it up for two months, at which point he'd be President and immune from arrest.", "label": 0}
{"text": "I think they're implying Trump is receiving special treatment.\n\nWhich is true.  Except not how they are proposing.  No one else would have been charged with these crimes, let alone found guilty of them, except for Trump.   Lawfare, in other words.", "label": 0}
{"text": "If he loses his lawyers will play the dementia card PDQ.", "label": 0}
{"text": "Please see above.", "label": 0}
{"text": "$$ our broke asses don’t matter , this mfer got $$ behind him so he can literally do anything", "label": 0}
{"text": "Answer: literally just google the directive. https://thewarhorse.org/far-right-misinformation-military-policy-lethal-force/ Stop using this subreddit as a way to pretend something is \"a thing\" that normal people care about.", "label": 0}
{"text": "I thought he did pretty good, not that those 20 people could see it.", "label": 0}
{"text": "Isn’t that just implied already?", "label": 0}
{"text": "When?  It's been over 6 months since you posted this, and the latest BRICS summit concluded with [zero real plans for a new currency](https://www.reuters.com/world/factobox-main-points-brics-declaration-2024-10-23/).", "label": 0}
{"text": "> Merchan doesn't want to risk being the next. James Comey.\n\nExactly.  Merchan is making a political decision.  And everyone on reddit seems to be fine with our judges making decisions not based on merits, but on politics.  FML.", "label": 0}
{"text": "answer: understandingwar.org tracks this daily.", "label": 0}
{"text": "I'm imagining radioactive rain cutting a swath along the whole path of the storm.", "label": 0}
{"text": "Also worth pointing out that the league automatically investigates when a 'star player' misses a nationally-televised game, so that in and of itself isn't necessarily a story.", "label": 0}
{"text": "Answer: The judge that everyone was glazing during the trial decided he was too scared to do something about it pre election", "label": 0}
{"text": "It’s just not worth it because you fundamentally can’t put debate nonsense without breaks and research periods for refutation, they did the best they could", "label": 0}
{"text": "There's also a big difference in who those guys affected. They stole a LOT of money from a lot of people, including rich people who don't like losing it. The effects of Trump's crimes are significantly less tangible and enemy-making.", "label": 0}
{"text": "Two things are at work here. 1st is that the sentencing guideline in this case assumes a healthy democracy, where there should be no legitimate reason to have to sentence a convicted candidate before the election, as the conviction itself would render the candidate unelectable, while *attempting* to account for the possibility of a corrupt justice system or law enforcement agency jamming up a candidate unfairly to force them out of contention.\n\n The 2nd thing is simply a two-tiered justice system in which money, power, and the lawyers that accompany those things lead to the courts treating wealthy and well-connected defendants with kid gloves.", "label": 0}
{"text": "I wouldn’t say automatically, depends on circumstance - the sixers also had Paul George out but his injury and status updates were far more typical and thus not investigated", "label": 0}
{"text": "It's self preservation.  If he sentences early and give the guy too harsh of a sentence and he ends up President, he knows Trump will come after him.  If he waits, he can base the sentencing off of the results so he doesn't tank his career.", "label": 0}
{"text": "Reddit moment.", "label": 0}
{"text": "Seriously, sentencing him to work at a fake McDonalds would probably actually be worse for him than jail. No way to get yourself fired, just busted down to kitchen cleaning crew.", "label": 0}
{"text": "Wrong answer. Trump doesn’t make that decision. The judge did.", "label": 0}
{"text": "Its probably not a good idea since alot of the topics asked would take a multilayered discussion which is hard to do in that span of time.", "label": 0}
{"text": "It's not illegal to pay someone to be quiet, its illegal to use campaign finances to do so", "label": 0}
{"text": "Russia's Navalny is an example of why convictions shouldn't disqualify you. Maybe not in this case but what if President Trump in the future did actually weaponized the Dept of Justice to disqualify a possible opponent for President?", "label": 0}
{"text": "🤷 we all know he wanted and pushed for it though", "label": 0}
{"text": "It’s wild that you think that. Touch some grass buddy", "label": 0}
{"text": "Trump may very well win the election, and even if he does lose he still stands a pretty solid chance of ending up in office. There's not a chance in hell this will prevent him from staging another coup, given that sentencing is delayed until well after most states must certify electoral votes. He's already decided that he's won and is the next president. The very second a single vote is confirmed for Harris he's going to contest it and attempt to subvert it. \n\nDelayed sentencing is nothing but purely beneficial for this orange fuckbag.", "label": 0}
{"text": "> I don't think the fact that he's a presidential candidate with wide support should be glossed over.\n\nI don't think I can adequately express just how few fucks I give", "label": 0}
{"text": "TLDR: the US justice system is pathetically weak and a joke ", "label": 0}
{"text": "We can’t let someone doing crimes get in the way of them trying to the same exact crimes again!", "label": 0}
{"text": "Felons can’t even vote . Let alone get a basic job that has much less responsibility and power than a presidential role does", "label": 0}
{"text": "Honestly that's probably it too. They probably saw all the memes making fun of Kirk's \"what is a fetus\" line, and instead of looking inwards, they thought \"lol these dumb libruls can't even answer a simple question\"", "label": 0}
{"text": "100% agree", "label": 0}
{"text": ">\tThere’s also a big difference in who those guys affected. They stole a LOT of money from a lot of people, including rich people who don’t like losing it. \n\nAnother symptom of our broken judicial system. \n\nThe guys like Bernie and Sam, main reason they were harshly punished like you said was because of who their victims were: rich people. \n\nTrump’s victims? A porn star and I guess the state of NY (in regards to his convicted 34 felonies). \n\nIt should not be a thing where the richer your victim was, the harsher your sentence.", "label": 0}
{"text": "The charges which he's already convicted of are relatively minor compared to some of the other charges he's facing. But those won't go to trial until at least next year, and that's only if he loses the election.", "label": 0}
{"text": "...And you have to give us all your stuff now.", "label": 0}
{"text": "But why is this the first time this owner/editor split has surfaced?", "label": 0}
{"text": "I actually like the image of him dangling, getting soft bowels, no sleep, and fewer and fewer cogent thoughts, as his anticipation of a life in prison looms closer and closer. He doesn't have much life left in him, but imagining him spending it in a locked and guarded prison is, frankly, cool.", "label": 0}
{"text": "The voters are the hiring managers. They are the ones doing the checking, some, apparently, don't care, or deny the obvious.", "label": 0}
{"text": "That and having millions of followers who over look rape allegations, rape lawsuit, felony charges, grab them by the p, six bankruptcies, 1/6, “hang Mike\nPence”, praising hitlers generals, threatening to jail pelosi, threatening to fire jack smith day one and then PROMOTE the judge who threw out his indictments to AG. \n\nThe man is walking free and is very very close to being President again. \n\nPlease choose country over party.", "label": 0}
{"text": "The *idea* is that if the people really want to elect someone out of jail, their will be done. There are remarkably few limits on who we are allowed to pick as president.\n\n\nAnd that would be kind of a neat feature if the rest of the system weren't distorted by money.", "label": 0}
{"text": "Thanks for the detailed answer! Appreciate ir", "label": 0}
{"text": "I always cite this. I was flabbergasted at the time people hated him for it. He just got SOMEWHAT excited.\n\nI think more people remember the Chapelle show scream than the actual noise which was way milder.", "label": 0}
{"text": "Answer: republicans hate America", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\nThank you for your submission, but it has been removed due to lack of context.  \n\n**Please see Rule 2** and repost with a **URL or a screenshot** (you can host it on imgur.com) **in your submission body** so that the users can better know what you're talking about and increase your chances for getting an answer.  **Feel free to repost once you find a URL.**  (Please remember to include the full URL: URL shorteners don't count.) Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "They talked about stopping the use of the dollar in trade with all the countries involved. It’s almost certain they will create a currency like the euro but for their members. Let’s wait another 6 months.", "label": 0}
{"text": "He wins, they swear him in -- then, believe it or not, straight to jail!", "label": 0}
{"text": "Don't forget at the same time, the guy leasing the charge (Newt Gingrich) was having an extramarital affair while his wife died of cancer.", "label": 0}
{"text": "Cause joy and happiness are illegal. We can only be angry and anxious about everything like the TV tells us.", "label": 0}
{"text": "Then the story will become how the big bad government hounded him until the day he died and how he’ll be a hero and inspiration for future conservatives. ", "label": 0}
{"text": "Very welcome.", "label": 0}
{"text": "Everything in the legal system takes time to do and prepare. Lets say he was not found guilty, what would be the point of doing all the work to prepare sentence for a person who didn't get convicted? So they will find someone guilty and then later sentence them.", "label": 0}
{"text": "What reason would we have to not think that?", "label": 0}
{"text": "You should focus your intellectual resources on breathing, and watching where you're going.", "label": 0}
{"text": "I suspect that it's to avoid the Republicans riling up their side by claiming that the judges are interfering either an election.  They don't want riots and civil war.  It's not fair but it makes sense.", "label": 0}
{"text": "I got the time to do that when im not focused on what my gender is and how scared I am about losing this election 🤣", "label": 0}
{"text": "Why was he working at McDonald’s?", "label": 0}
{"text": "Jack Smith can be fired on January 20th if our worst fears come true", "label": 0}
{"text": "If Trump was gonna take over the country he woulda done it 7 years ago. I see no reason to panic", "label": 0}
{"text": "delaying it specifically to avoid the election sure is giving me the impression that it's done to affect the outcome of the election...", "label": 0}
{"text": "Also Reddit has wiped out any threads about it. BS now I have to go to twitter and tik tok to go get updates. ", "label": 0}
{"text": "Dude is literally running for president to avoid jail time.", "label": 0}
{"text": "Let's show them democracy can prevail.  Unsubscribe from Amazon prime people.", "label": 0}
{"text": "Answer: Trump has received more due process than your ordinary average felon. \n\nHe is rich, has an army of lawyers.  He was, as is his right to due process, two juries of his peers.  One, a grand jury to determine whether he should be charged and a trial jury that found him guilty of crimes. His due process includes numerous appeals many more than most defendants can afford. \n\nHe is rich and a former President, and a candidate so he has been shown repeated deference due to his gig as Pres and his candidacy.\n\nMost likely his conviction will be set aside if he wins the election.  Even though this is a state criminal conviction, there no way they are going to try to sentence a sitting President.", "label": 0}
{"text": "Normal jobs are for poor people.", "label": 0}
{"text": "But wouldn't him winning automatically mean he pardons himself and the justice system is a joke?", "label": 0}
{"text": "YEP!", "label": 0}
{"text": "White collar crimes often end with probation, even for felonies. If there is jail time it’s usually only a couple months in a minimum security facility. \n\nThe logic being that financial criminals are not particularly “dangerous” to the average individual. Exceptions do exist, Bernie Madoff was sentenced to 150 years, but that was billions of dollars in fraud.", "label": 0}
{"text": "Answer:  The answer is in your question.  If it were \"real,\" he'd be sentenced. Everybody knows it will be overturned on appeal, including the judge.  It was lawfare to I fence the election.  We'll see if it works or not. ", "label": 0}
{"text": ">will probably never feel any real consequences\n\nSome of us believe in heaven and hell.  With that perspective, I actually pity the guy (even though I don't like him).", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\nThank you for your submission, but it has been removed due to lack of context.  \n\n**Please see Rule 2** and repost with a **URL or a screenshot** (you can host it on imgur.com) **in your submission body** so that the users can better know what you're talking about and increase your chances for getting an answer.  **Feel free to repost once you find a URL.**  (Please remember to include the full URL: URL shorteners don't count.) Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "Basically every time Trump is in court or Trump gets convicted his support only goes up.\n\nIt’s hard to believe but it’s true. \n\nTherefore a sentencing could lead to his support going up enough that he wins the election, and by doing so his sentencing essentially won’t happen. \n\nNow that the sentencing is after the election, he won’t get the boost of support from it and can (potentially) lose the election and then get his sentencing a few weeks later. \n\nIt will be the best month of his life or the worst month of his life lol. We are all on pins and needles here.\n\nI sure hope he loses…", "label": 0}
{"text": "Putin would love you", "label": 0}
{"text": "And why not? It's working for Ken Paxton.", "label": 0}
{"text": "The US judiciary hasn't as a whole (there are still good judges) had credibility for a long time", "label": 0}
{"text": "Well you see over 150 million of us were on the hiring board at Trump's performance review 4 years ago. Most of us did reject him, but 74 million said he should keep going for another 4 years. And those same tens of millions got him through the latest round of interviews. So here he is back again in the last round of the world's most elaborate job interview.\n\nAll the shit he's done should be disqualifying, but everyone on the hiring board has their own criteria.", "label": 0}
{"text": "Don't lump him in with us gingers, we have it bad enough", "label": 0}
{"text": "Of course it would affect the election! He'd be in jail! That's like delaying a felon's sentencing until they finish going on vacation to Mexico! These judges are so corrupt! This country is so corrupt! Why are we doing this to ourselves?!", "label": 0}
{"text": "Supposedly this should allow the American people to make the decision. There could be similar but different circumstances where this would actually be wise - a candidate could, for example, have actually been convicted of trumped-up charges, or convicted of crimes that the American people don't believe should be crimes, etc.\n\nPolitical opposition in more authoritarian places tends to have this sort of thing. If Trump were elected, we could expect to actually see political opposition be charged with nonsense crimes.\n\nThe problem in this specific case is that Trump has a lot of *outright insane* supporters, and the obviously-correct electoral decision is apparently insufficiently obvious. It's nuts.", "label": 0}
{"text": "I think Good Charlotte put it best:\n\n>Well, did you know if you were famous you could kill your wife? \n\n>And there's no such thing as 25 to life\n\n>As long as you've got the cash to pay for Cochran...\n\n>And did you know if you were caught and you were smoking crack, \n\n>McDonald's wouldn't even want to take you back\n\n>You could always just run for mayor of D.C.​...", "label": 0}
{"text": "Then he should have removed him self from the case.", "label": 0}
{"text": "In a fascist state:\n\n* Laws protect, but do not bind the in-group.\n* Laws bind, but do not protect the out-group.", "label": 0}
{"text": "The Presidency is a special job, picked by the American people, not some HR department.  \n\nI am sure every American has reflected on the felonies and whether they are disqualifying or not.  My mother for example has looked into it and determined the crimes are a liberal fraud and if anything, it has strengthened her conviction for Trump.", "label": 0}
{"text": "they pointed out that its a crime. Which it is. A felony per New York Penal Law § 175.10, which he was convicted on 34 counts of violating.", "label": 0}
{"text": "And parties or voters could exclude him from their nominations or not vote for him because of it.\n\nBut the US was founded by foreign backed traitors who bought votes (usually with booze), so banning people convicted of crimes is not inherently a reason to ban someone from office, granted buying votes was legal back then.  \n\nIt's also essentially part of what the UK calls parliamentary immunity or what the US calls the speech or debate clause.  The people who have been elected as representatives in whatever sense of the word elected cannot be blocked from performing that representation because some other branch of government wants to stop them.  \n\nOtherwise you really could have state or local officials just make some shit up about members of congress or the president to prevent them assuming or discharging the duties of that office.  Or the federal government making up stuff about state officials they don't like.  In the UK sense it is to prevent the monarch from using their power as head of the executive to override the supreme power of parliament (since 1689) to make and pass laws, and the same would apply to the US in essentially the same manner.  \n\nOf course the assumption was that parties would not put forward candidates who are actually guilty of serious crimes, or if they do, the public wouldn't vote for them (e.g. parties or people that get a fractions of a percent of the vote).", "label": 0}
{"text": "I ignorant people trying to sound smart answers.They're the best", "label": 0}
{"text": "It’s fucking sickening", "label": 0}
{"text": "i feel like they should just print the endorsement anyway, and have ownership\nfire them, instead of quitting in protest", "label": 0}
{"text": "So, if he loses, off to jail, right?", "label": 0}
{"text": "Answer: Mental health issues have become less stigmatized. Perhaps the most recent big event that contributed to this was covid, which left a lot of mental health problems in it's wake, especially amongst young people who got hit the hardest in their development by lockdowns and other restrictions. It's generally these younger generations that will talk more openly about their struggles. For older generations mental illness is still taboo though. \n\nSociety as a whole appears to become more aware that mental health is equally important as physical health. This lowers the threshold for people to get help and also helps smash toxic attitudes for instance regarding men needing therapy.", "label": 0}
{"text": "Yeah any normal person or even let's say a super popular influence would be thrown in jail as a suspectbbefore any court dates.", "label": 0}
{"text": "We’re a constitutional republic.", "label": 0}
{"text": "I think you completely missed the point. Comey didn't decide to release that letter to hurt Clinton, he did it because he felt like he was required to do it. In hindsight, it was a stupid decision.", "label": 0}
{"text": "So Merchan is a Republican now? He literally donated to Biden's campaign in 2020 and his daughter, Loren Merchan, is a democrat political operative who has worked on the campaigns for Kamala Harris and Adam Schiff. You're right that he's corrupt, you just got the party affiliation mixed up.", "label": 0}
{"text": "But his action *does* influence the election.", "label": 0}
{"text": "Plus if he wins he is going to try to pardon himself so you won't be able to sentence him anyway.  \n\nI can't think about this stupid decision to delay sentencing or I'll just walk around being angry **all the time**.", "label": 0}
{"text": "And yet he was still allowed to vote in Florida", "label": 0}
{"text": "If this stuff would be happening in a hollywood blockbuster political comedy, I would consider this bat shit crazy stuff...but its our REALITY! Let that sink in!", "label": 0}
{"text": "To be fair - this is by far one of the lesser felony charges he is facing. More serious cases that would come with pretty sizable jail time include his handling of (and losing) TS documents, or the false electors.\n\nI personally am most concerned about the false elector cases. Objectively, it was an attempt to subvert an election. Moreover, evidence shows that Trump was (1) aware of the plot, and (2) aware it violated the Electoral Count Act. \n\nThe unwillingness of a Democracy to defend itself from subversion, means said Democracy is not long for this world.  It has been 3.5 years since said plot, and only one person has been convicted so far. It's not really a question of if, but rather when our government will be reshaped significantly.", "label": 0}
{"text": "Two tiered justice system...\n\nReally more than two - rich then white then shades of brown.\n\nVote for equality.", "label": 0}
{"text": "Question: If the fryers and ovens are on and food is being served, how is it closed?", "label": 0}
{"text": "What about a perp who trashes the court in the public square, defames the judge, maligns the judge’s family — how would that behavior be treated during sentencing?", "label": 0}
{"text": "We're seeing evil striving for power.  Our Founding Fathers tried to protect us from this, but it hasn't worked.", "label": 0}
{"text": "Easy. You have a lot of people in this country who would cry about his incarceration even though he was legally deemed worthy of it. The ironic part is that they call themselves the party of law and order.", "label": 0}
{"text": "Agreed 1000x percent. I am telling myself that's the governments insurance if we fail our national intelligence test.  It's unforgivable that our nation makes criminals of lesser crimes face justice ready or not, but when the country really needed justice, it abdicated its duty like the son of a bitch on J6 that wouldn't call off the mob. Our courts have cowered to the mob. I hope they were just playing for time.", "label": 0}
{"text": "This might be a silly question but let’s say he is sentenced to prison, would JD Vance become president?", "label": 0}
{"text": "I've equated this to what Exxon did with the Valdez and other disasters. If you can delay long enough everyone dies and their heroes die and there is no one left to oppose your request to dismiss the civil suit.", "label": 0}
{"text": "If your job was done by election your qualifications wouldnt matter either\n\nIf this is of interest to you, go apply for a job that requires an election \n\nMany positions run uncontested or are open", "label": 0}
{"text": "Nah mostly joking. I got teased for it growing up but everyone gets teased for whatever. Lucky for me I'm not particularly ugly, at least thats what my mom says", "label": 0}
{"text": "It’s just in case he wins, then he will pardon himself and everything will be forgotten", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\nThank you for your submission, but it has been removed due to lack of context.  \n\n**Please see Rule 2** and repost with a **URL or a screenshot** (you can host it on imgur.com) **in your submission body** so that the users can better know what you're talking about and increase your chances for getting an answer.  **Feel free to repost once you find a URL.**  (Please remember to include the full URL: URL shorteners don't count.) Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "He can't pardon himself for state crimes. However, there is no universe where the state of New York is going to jail a sitting president.", "label": 0}
{"text": "Nah, I'm no technology novice. Thanks for the insult though lol", "label": 0}
{"text": "He’s not looking at serious prison time for crimes that would have been misdemeanors had he not been running for president at the time. That’s just not gonna happen with the current state of our prison system, sorry.", "label": 0}
{"text": "Trump wins, walls into the oval office on day one, and is immediately put in handcuffs and taken to prison. Be a wild news day 🤣", "label": 0}
{"text": "With the highest security clearance in the nation. If I got into a fight and was booked in the military, my secret clearance would have been revoked fast.", "label": 0}
{"text": "Why is that", "label": 0}
{"text": "One boss does the hiring at a normal job. The president has hundreds of millions of bosses that handle the hiring.", "label": 0}
{"text": "He’ll show up to sentencing with an oxygen tank and a wheelchair.", "label": 0}
{"text": "I'd say 99% _if_ he gets elected president, but the chances of him getting elected seem to me to be at best around 50%.", "label": 0}
{"text": "No trump supporters is going to start reading…\n\nFtfy", "label": 0}
{"text": "You hold that like it comes naturally", "label": 0}
{"text": "Net worth isn't calculated with liquidity in mind, it's measured with assets. \n\nLoans are a debt, and debt is calculated against the assets. \n\nNet Worth = Assets - Liabilities", "label": 0}
{"text": "What do you think prevented Trump from taking over the country in his last term, that no longer exists now? \n\n\nFrom what I've been able to gather, Project 2025 is the liberal version of Qanon. Deranged scare mongering not rooted in evidence or reality, with the goal of getting their constituents to vote. ", "label": 0}
{"text": "Hello Watchmethrowhim! Your post has been removed because the title is not a full and complete question (which includes a question mark at the end) about a trending social or news event. **Please see Rule 2**, and repost with a full question so that other users can better understand what you're asking about. [Here is our guide on how to create a post for OOTL.](https://www.reddit.com/r/OutOfTheLoop/comments/77cda0/what_is_a_loop_a_primer_on_increasing_the/) Thanks.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "It doesn't apply to the crimes he was convicted of, but that doesn't mean it doesn't apply to this situation.\n\nHard to enforce a sentence on the president when the president is legally allowed to do whatever the fuck he likes.", "label": 0}
{"text": "Is this because her party tried to give people college debt immense amounts of money, or do you think there's something else?", "label": 0}
{"text": "I'd love to see New York bankrupted by a billion dollar settlement.  It's called the 'fruit of the forbidden tree' for a reason, and democrats think they can pick it clean and get away with it based on some self-righteous high horse they imagine themselves on.  The 'find out' phase starts in 11 days.", "label": 0}
{"text": "simply, the boomers did not have the cognitive ability to resist facebook and its myriad of indoctrinations.\n\nRussia and China weaponized this.\n\nDeath rattle of the most selfish generation to ever exist.", "label": 0}
{"text": "I mean... look, I can't believe I'm defending that bloated orange sack of pus, but...\n\nIt was 34 counts of Felony Tax Fraud. Now don't get me wrong, I'm fully convinced he's a serial rapist, of both adults and minors, who sold our nuclear secrets to Saudi Arabia... and that's before we get into his collusion with Russia in 2016, 2020, and now 2024, *plus* all the shit he got up to as President (because I do not accept the SCOTUS decision that \"official acts\" are immune to prosecution). If anyone in US *history* has deserved \"life in front of a firing squad\" it's Trump.\n\nBesides, if being convicted of a felony barred you from ever holding political office it would be *far too convenient* for corrupt politicians to railroad their political enemies with a bunch of felony charges until one sticks so they can never run for office again.", "label": 0}
{"text": "34 felonies for write a check wrong", "label": 0}
{"text": "I definitely agree, but like… what the hell else can they do? We all saw what happened on Jan 6, we’ve all seen Trump continue to make threats to the people who oppose him. It was this or be murdered by the Trump cult, I know what option I would choose.", "label": 0}
{"text": "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "At which point he’d be president and immune from arrest. That’s depressing. ", "label": 0}
{"text": "I'd say there's even MORE reason to act faster if a guy is found guilty of 34 felonies, precisely to stop him to be the fuckin president of the free world... I don't understand anything anymore", "label": 0}
{"text": "It was all a part of the plan, and he only got it half done in his four years, so he wants to finish the job now.", "label": 0}
{"text": "That's a pretty fucked take for a judge to take. By NOT sentencing him for his crimes they are impacting the election.", "label": 0}
{"text": "Because anyone with 2 brain cells making friction up stairs knows it was a railroading of monumental proportions. No evidence + no crime does not equal 34 felonies.", "label": 0}
{"text": "It's not a crime to pay your lawyer after an election, for services related to an extortionist (who still owes Trump millions).  On top of the base charge, they improperly promoted a single, expired, misdemeanor into dozens of felonies, solely for the purpose of generating salacious headlines to taint an election.\n\n  There's definitely going to be investigations, and if/when it comes out that the 9+ trials were part of a coordinated psyop, the participants are going to be hosed.", "label": 0}
{"text": "Trump didn't steal from anyone, there were no victims who could have been wronged. The only \"victim\" there could be would be the state, and you would have to make a really strong argument for someone to believe the state can be a victim", "label": 0}
{"text": "they only ever allow us to decide when we have to do all the work and the elites will take all the credit", "label": 0}
{"text": "Individuals who cognize 💀", "label": 0}
{"text": "“This is also uncharted territory.”\n\nWell yes, it was. Now it has become charted, setting a terrible precedent.", "label": 0}
{"text": "Is financial fraud not theft?", "label": 0}
{"text": "What if he was sentenced to jail and won the election? Is he going to run the country from jail?", "label": 0}
{"text": "That's a lot of numbers for 0 evidence.", "label": 0}
{"text": "He's already been charged and convicted.  The question would be if they can sentence?", "label": 0}
{"text": "I guess I mean out of power. 2016-2020 he had the ability to influence courts and executive branch agencies, but 2020-2024 he lost that direct power and the justice system had a prime opportunity to rework some things, especially knowing that Trump was gearing up for another presidential run and was dodging consequences in real time.", "label": 0}
{"text": "You might take a look at that link there. Could open up your worldview a bit.", "label": 0}
{"text": "The flight crew support him.  I remember reading he even had the crew on Air Force 1 swapped out with those who supported him, so....I'm not that sympathetic.  Were it otherwise, I would be.", "label": 0}
{"text": "He is though, you can pretend that your description is accurate but it's not.\n\nWhile it's sort of technically true that it matters that he was running for president, the crimes were directly related to the election. \n\nWhen the national enquirer buys stories that would harm Trump and then doesn't release them so that they don't damage his campaign that is an in kind contribution to the campaign.\n\nThey then lied in their business records about it. The fact that they lied about their business records in order to conceal another crime (campaign finance violations) is what made it a felony.\n\nRunning for president isn't what made them felonies. Him committing crimes to help his campaign is what made them felonies.", "label": 0}
{"text": "What he really is saying is he doesn't want to be the first judge to sentence a former President to prison!!!\n\nBecause after the election if Trump wins Merchan may be the one in jail if Trump was to get his way. And if Trump loses Merchan still wont do anything and keep kicking the can down the road. \n\n  \nWe all know Trump is NEVER going to jail no matter if he wins or loses.", "label": 0}
{"text": "Not if he wins, because rumors state he wants AC as AG, and this week he said he would fire Smith the instant he is sworn in.  WE ARE FUCKED if he is elected.", "label": 0}
{"text": "I wonder if that consideration would be applied a person seeking the position of Governor, or Senator? City council member? Or just president?", "label": 0}
{"text": "It is automatic. From [CBS Sports](https://www.cbssports.com/nba/news/nba-to-investigate-76ers-handling-of-joel-embiids-participation-plan-per-report/):\n\n> Investigations are automatically triggered when a star player misses a nationally televised game, multiple star players on the same team miss the same game or there are inconsistent statements (from a GM, coach, a player, player representative, etc.) that contradict the player's status on the injury report.", "label": 0}
{"text": "Well you see he had federal courts + the supreme court all in his pocket and they all didn't turn over the election because.... well... Don't worry about it, actually, it'll REALLY happen this time around!", "label": 0}
{"text": "So let them do personal endorsements and not put out \"x newspaper endorses y candidate\"", "label": 0}
{"text": "I sometimes forget what a sad state of affairs the judicial system in the US is, you're probably right.", "label": 0}
{"text": "Answer: have you tried reading the article? ", "label": 0}
{"text": "If he wins, can he pardon himself?", "label": 0}
{"text": ">Being rich, famous, powerful, **WHITE** and very old each mitigate basically every aspect of consequences for one's actions.\n\nI added one more for you.", "label": 0}
{"text": "Answer: Arrested by federal agents for putting out a bounty on a rival rapper. \n\nHe really Durked up this time.", "label": 0}
{"text": "Where the hell do you think the \"state\" gets their money from exactly?  \n\nThis is America, WE are the state. That orange turd and everyone like him are stealing OUR tax dollars. That money could go to roads, or schools, or whatever, except by committing fraud, Donnie was taking money away from US. \n\nThis would be why it's \"The people of the state of _____ VS _____\" the state files a case on behalf of the people, in the interests of the people because commiting fraud against a state is theft of the peoples tax dollars.", "label": 0}
{"text": "Answer: sentencing delayed to avoid a case meant to interfere with the 2024 election", "label": 0}
{"text": "I agree.  An argument can be made that a trial being held in the final stages of an election could be an issue (though I think equal under the law should mean no special treatment) due to the presumption of innocence, Trump is a convicted felon having been found by a court of law to be guilty beyond a reasonable doubt of the charges.  It is absolutely election interference to delay sentencing because of the election as these are not accusations, they are findings of law. It's entirely corrupt that our *justice* system is putting the reputation of **this** convicted felon above the execution of the law.", "label": 0}
{"text": "You forgot white.", "label": 0}
{"text": "Cowards", "label": 0}
{"text": "easy , the judge had no balls and bent under pressure", "label": 0}
{"text": "Ruling class", "label": 0}
{"text": "If every accusation is a confession, this is the one and only exception, right?\n\nRight?", "label": 0}
{"text": "We are absolutely totally screwed if DT becomes President.  And millions and millions of people will vote for him.  I'm going insane.", "label": 0}
{"text": "Fraud is theft with extra steps.", "label": 0}
{"text": "\"I am not an advocate for frequent changes in laws and constitutions, but laws and institutions must go hand in hand with the progress of the human mind. As that becomes more developed, more enlightened, as new discoveries are made, new truths discovered and manners and opinions change, with the change of circumstances, institutions must advance also to keep pace with the times. We might as well require a man to wear still the coat which fitted him when a boy as a civilized society to remain ever under the regimen of their barbarous ancestors.\"\n\nMaybe back the term \"insurrection\" could be nebulous.... but today, we have footage, email  and text trails of a plan, a Supreme Court ruling the differences between a Presidential Act and acts of a candidate, tapes of the man asking for votes which proves he was aware he lost.... Not so nebulous really. We know exactly who, what, where, when, why, how.", "label": 0}
{"text": "Answer: His sentencing was delayed until after the election. Why?\n\nThe **most charitable interpretation** as to why someone can not only walk free, but also campaign for president is the US being a democratic republic.\n\nThere's nothing in the constitution that prevents a felon from running for president or even someone who allegedly tried to overturn an election. Around ½ of voters don't seem to mind those facts and want to vote for that person. So the judicial system is respecting the voters and democratic process by allowing that candidate to remain viable. Viable means not interfering with their campaign even if that means enforcing the law.", "label": 0}
{"text": "Were still sentencing offenders from the Holocaust. Age is not an excuse", "label": 0}
{"text": "Private employers can (for the most part) make up whatever rules they want to qualify/disqualify. Government in theory has to follow the constitution and the constitution pretty clearly states as long as you are 35+, natural born citizen and have lived in the US for 12(?) Years you can be president.", "label": 0}
{"text": "It’s in appeals court", "label": 0}
{"text": "He *shouldn't* be able to pardon himself for state crimes, but part of his plan is to stuff every agency and court with bootlickers who will keep him from being held accountable at all.", "label": 0}
{"text": "Answer: these papers are supposed to endorse the left’s candidate, the problem is she is very weak and favored to lose.", "label": 0}
{"text": "Answer: he is receiving deference that the average citizen would not get. He is being treated far better than any other citizen.", "label": 0}
{"text": "34 convictions but no one or entity was harmed. This is in appeals court and will be tossed", "label": 0}
{"text": "Who's y'all? I voted for Biden but agree the 34 felonies is a joke", "label": 0}
{"text": "lol okay, you’re acting like they aren’t running with this “felon” thing like it isn’t election interference even though none of these felonies will go through and he will spend 0 days in jail.\n\nLike I said, you probably need an above average IQ to see what’s really going on here. Every bad story about him in the past few weeks have been easily debunked since as the hitler generals comment and the model who said he groped her 30 years ago. Convenient timing, yet the left want to run everything like it’s facts. Calling me a conspiracy theorist is hilarious when everyone on the left believe everything even when there’s clear facts in front of them, but I guess orange man bad is better than actual facts. Can’t wait for him to win in November.", "label": 0}
{"text": "It's precedent now!", "label": 0}
{"text": "Answer: Rules don't apply to him. Where you been?", "label": 0}
{"text": "They Look Alike! New Friendship Pair! Yay!", "label": 0}
{"text": "I thought he was the quarterback for the Titans", "label": 0}
{"text": "Answer: they sold their souls to Trump!", "label": 0}
{"text": "Ugh why dies \"A lot do, but not all\" read in trump voice now", "label": 0}
{"text": "Because half of America didn't give a single eff .\n\nIn fact they love it and want him to win even more because it will hurt other Americans and the country. They feed off of that", "label": 0}
{"text": "I mean at its core is a lot of class privilege. He was born into a wealthy and connected family and no matter how stupid and disgusting he is, those connections allowed him to fail his way to the top.\n\nHowever when you look at how the justice department has cracked down on Puff Daddy you can't help but think \"well there's a very rich and very connected black man...funny how he is yanked straight to jail and isn't given repeated chances at power or offered the helm of the GOP...\"", "label": 0}
{"text": "The idea is that rejecting him is YOUR job. Vote.", "label": 0}
{"text": "No, they didn't. \n\nThey decided that the federal government determines eligibility for federal offices, not the states. \n\nThey even pointed out right, right in the opinion, that even federal courts don't have that power.", "label": 0}
{"text": "Thing is, they don't know this. They don't know what he is planning because they are in a cult.", "label": 0}
{"text": "> If you take money that is supposed to only be used specifically for a thing, and then use it for another thing, what is that?\n\nWhen did that happen? Trump paid for it from his personal funds, the prosecution argued that since it might have helped him win, it should have been campaign funded. This is a misdemeanor NY election law.\n\n\nThey then argued that the payment was to cover up another crime, upgraded it to a felony. The jurors were instructed that they need not agree on the crime the defendant was trying to cover up here — they just needed to believe him guilty of *any crime at all*, and that this was used to cover it up.\n\n\n\nI don’t see where the stealing is here.", "label": 0}
{"text": "Question: should newspapers even be endorsing in the first place? understandably this is not a perfect world where they are neutral (obviously with the conservative owners banning them from making an endorsement) but i feel like they shouldn’t be doing it anyway and remain neutral for integrity.", "label": 0}
{"text": "Or using the search bar?", "label": 0}
{"text": "Project 2025 is [literally on the heritage foundations website for everyone to read](https://www.heritage.org/conservatism/commentary/project-2025), it's not a conspiracy lmao. \n\n\"Thinking clouds exist is the lib equivalent of jewish space lasers, imo\" ass comment", "label": 0}
{"text": "He wasn’t convicted of any violent crimes in New York. I doubt Justice is swift to lock up anyone who isn’t a danger to others, regardless of their status.", "label": 0}
{"text": "We need to let this play out so that when he wins there is a pathway to sue from certifying the results.  DOD issued new rules on how to handle insurrections from those who oppose letting the results from the people/EC to elect a rightful successor.", "label": 0}
{"text": "Come on, how do you out white.", "label": 0}
{"text": "Answer: The US has a two tiered justice system. One for rich white people and one for everyone else.", "label": 0}
{"text": "Also the same guy who screamed that it was too close to the elections for Obama to appoint a Supreme Court Justice, but appointed one himself during a similar time period.", "label": 0}
{"text": "And for the sake of discussion, I really think that the public would have benefited to see the suggested article from the LA Times.  \nApparently the editors there are unable to perform such a public good.   Or they chose not to because it would have been a bad influence on their chosen candidate .\nI have zero doubts that if it would have helped their candidate, that they would have published such an article.\nBecause, they've been publishing anti-Trump stuff for months -or years- already.\nThe owner's suggestion struck me as very commonsensical.", "label": 0}
{"text": "The only way his reasoning is even slightly reasonable is if he's planning on ordering jail time, and I just don't believe it", "label": 0}
{"text": "Thats just dumb. What if he is president and has to go to jail?", "label": 0}
{"text": "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah as much as people want Trump to see the maximum possible punishment, it really doesn't make any sense from the court's perspective.  \n\nHowever some of those other lawsuits he has floating around, like the Jan 6th one in DC or the Georgia election interference, those have some meat to them if he gets convicted.", "label": 0}
{"text": "January 6, 2021", "label": 0}
{"text": "Control the media, control the populace. Bezos doing his best to be a villain.", "label": 0}
{"text": "7+ million more voted for him for the near corpes of Joe Biden, you really think an energetic woman like Kamala has no shot? i've already voted, and if you haven't you should.", "label": 0}
{"text": "He attempted it last time and failed. His handlers have had 4 years of planning to try again. Even if they fail again, the chaos that this election is bringing is terrifying.", "label": 0}
{"text": "Are legal system has failed", "label": 0}
{"text": "Another American coward putting himself over the country.\n\nThis is why we fail. We give up our ideals because of unprecedentedness.  \n\nIt's unprecedented to have a 34x felon as a major party front runner. They should have to elect him from prison.", "label": 0}
{"text": "because the republicans call anything that is favorable to trump as being fair, and anything that is neutral/standard practice as being 'election interference and extremist left policy', and they scream it loud enough and often enough that trump keeps getting preferential treatment", "label": 0}
{"text": "It's also because our founding fathers didn't *explicitly* write conditions like these into the POTUS qualifications.\n\nI guess they didn't think the American citizens would be stupid enough to try and elect a rapist and convicted felon with close ties to child sex traffickers.", "label": 0}
{"text": "Funny that a convicted felon can’t possess a firearm but they can order a predator drone strike on a foreign enemy", "label": 0}
{"text": "Yes, but he had a red R next to his name.", "label": 0}
{"text": "Very little bad things i wish upon people. But i cannt wait until i see this fuck sitting behind bars.", "label": 0}
{"text": "answer: He hasn't been convicted.  Official declarations of conviction happen at sentencing, not when the jury reaches their decision.", "label": 0}
{"text": "$$$", "label": 0}
{"text": "I don't understand. Sentencing like normal, it's just simply the law applied to everyone equally. Delaying the sentencing however, that IS affecting the outcome of the presidential race.", "label": 0}
{"text": "Oh gosh…", "label": 0}
{"text": "It doesnt seem complicated to me.\n\nHe will become president on Jan 6 while in jail.  Then he will pardon himself and go to the Whitehouse (or his \"man of the people\" golf course) and be president there.\n\n...at least that is assuming everyone follows all the laws as written with no shenanigans, terrorisms, or coups.", "label": 0}
{"text": "Yeah, it's just fraud. No one is hurt with fraud....uh, no..fraud hurts society, that's why he was fined massive amounts. Fraud is bad. You don't understand that fraud is bad? I don't believe you.", "label": 0}
{"text": "I didn't say that DT will win, I said IF he wins.  And Kamala is great and has energized people.  I think she has a shot, but am worried that many people won't vote for a woman.", "label": 0}
{"text": "It's not just them. Rupert Murdoch's media empire and The Heritage Foundation are two examples of entirely western fascist think tanks that have done similar harm.", "label": 0}
{"text": "Can he still vote?", "label": 0}
{"text": "Which essentially means enforcement is up to the political makeup of congress at the given time. Or more shortly, it doesn’t count if a party controlling a majority in either house chooses for it not to", "label": 0}
{"text": "Wow now regular straight people are lumped in with criminals. Well done. Thats only 89% of Americans …. Ridiculous.. grasping at straws here", "label": 0}
{"text": "they havent so far and have been mostly inept in court.", "label": 0}
{"text": "Being available to serve customers is a big part of a business being open.\n\nThe store had a sign on the door saying they were closed for a special event, so I don't understand how anyone could be confused about the store being closed.", "label": 0}
{"text": "You forgot one criteria…", "label": 0}
{"text": "The jury saying 'we find the defendant guilty' is not convicted, it won't show up on criminal records, and doesn't count as anything besides the jury result.\n\nConvictions happen at sentencing.  Donald Trump is not a convicted felon.", "label": 0}
{"text": "And there is a high chance NY supreme court will throw out the conviction on appeal, as they already hinted they would", "label": 0}
{"text": "Already seeing it.", "label": 0}
{"text": "Thank you.  This is a better argument of “class”, not just because he’s white. That’s such an over played card. Only racist people like to label things with a race as an identifier.", "label": 0}
{"text": "Your English is a bit broken, so I'll help smooth it out for you. We can't allow corrupt judges to decide who can and can't run for office/be president that easily. It would be too easy to give all your political opponents felonies to disqualify them.", "label": 0}
{"text": "So if elected our new president could just straight to jail?", "label": 0}
{"text": "Hm, but I would compare Diddy to Weinstein - both of them got away with it for decades, and once they fell it came out that most of the rich and powerful had come to hate them. Seems more like your invulnerability to the law is directly proportional to how much those people want you around, and even when they don't, giving you to the *common man's* justice system is so rare it feels more like a concession than justice. Both of them were already used up, so they were ideal sacrifices to the mob. Whatever happened to Chris Brown paying for assault?... oh right he still makes money and has friends.", "label": 0}
{"text": "Oh sick.  I’m going to commit a bunch of felonies and then run for president.", "label": 0}
{"text": "Nick Cannon?", "label": 0}
{"text": "Oj literally got away with murder, the guy from making a murderer went away for twenty years despite being falsely convicted. It's wealthy privilege. I truly believe the powers that be want us all focused on race rather than wealth", "label": 0}
{"text": "Just ruling class things.", "label": 0}
{"text": "Trump is the culmination of decades of emphasis on greed above everything else. The f\\*ck you, got mine mentality goes completely against the basis of our nation and our armed forces. In the military, the goal is to fight together as one mighty force. That clashes with what Trump, Putin, & their supporters think.", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\n---\n\nHello, your submission have been removed because the title isn't loopish enough.  Please repost and begin your question with one of the following phrases:\n\n* \"What's going on with\"\n\n* \"What is going on with\"\n\n* \"What's up with\"\n\n* \"What is up with\"\n\n* \"Why are people talking about\"\n\n* \"Why have people been talking about\"\n\n* \"What's the deal with\"\n\n* \"What is the deal with\"\n\n**Please see Rule 1**\n\nDon't forget to include a URL link for more context in the body of the post, and always end your question with a question mark.\n\n**If your title still doesn't work after using one of these phrases, be aware that you may be using the wrong type of apostrophe (known glitch with automod).  Just try reposting with \"what is\" instead of \"what's\".**\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "Berlusconi did the same in Italy. He was accused of a ton of crimes but he simply told everyone that the judges were communists and were attacking him politically. As prime minister he changed the law, turning his crimes into legal actions, then his lawyers made sure his remaining trials went on so long he was granted the statute of limitations - which is only given to guilty defendants. Etc.  \nRich people, especially if politicians, never go to jail.", "label": 0}
{"text": "Then why was it allowed to be brought to court years after the statute of limitations expired?", "label": 0}
{"text": "No, but I'm interested in their reasons not to, which seems like important information.", "label": 0}
{"text": "You are a liar and wrong. He falsified business records to pay Stormy Daniels with the intent of influencing the election. His lawyer was even sentenced for breaking campaign finance laws in 2018 for trying to influence the election.", "label": 0}
{"text": "God forbid committing several crimes affects appearances to run for the power of the whole country..glad they wanted to be fair!", "label": 0}
{"text": "The catch is that a normal job check is done to appease your employers, the president doesn't have any employer so it doesn't matter.\n\nMore seriously, though, I don't think it's all that bad in theory (theory being the load carrying word here), you do not want a justice system that decides (or appears to influence, anyway) and surely people wouldn't vote for somebody who is found guilty of several felonies so what's the harm in the delay anyway? (again, IN THEORY)", "label": 0}
{"text": "It’s bs. Above the law", "label": 0}
{"text": "Leave the oompa loompa's out of this!", "label": 0}
{"text": "You know that will happen, he's the most letigious person in the country, but I'm sure all will be denied again.", "label": 0}
{"text": "...and white.", "label": 0}
{"text": "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "It’s fucking wild. A judges job is to be impartial, but Cannon was in charge of the decision to push the indictment until after the election, when she was appointed by Trump? How does one of the least impartial judges be given that decision?", "label": 0}
{"text": "He's already talking about doing it. He tried to take power by force. He's talking about using the military on the 'enemy within'... What makes you feel this is anything normal?", "label": 0}
{"text": "Answer:  All of the other answers here(because Reddit) are missing the fact that on appeal this whole thing is going to be overturned.   He won’t be a convicted felon at the end of all of this because it was a political hit job.  Reddit hates Trump and the right but that’s what is going to happen.", "label": 0}
{"text": "Fair. My question is more about understanding the decision to change course (if they hadn't endorsed before and decided to endorse this year, I would also be interested in the reason).", "label": 0}
{"text": "Will not be sentenced at all if he wins since he'll just pardon himself and everyone of his followers as the first act.", "label": 0}
{"text": "If he was innocent, I understand, but if he's guilty, shouldn't he face the consequences of the law like any other citizen? This whole farce is truly showing who holds the real power and who the law is supposed to be keeping in check.", "label": 0}
{"text": "He's been convicted under NY state law, and Florida applies the voting rule of other states to people convicted in those states.\n\nNY state law is convicted felons may not vote during their period of incarceration which hasn't started yet.", "label": 0}
{"text": "I don’t understand why you’re talking about how taxes “on that $130K” would have been spent and also saying there were no taxes went unpaid. And also needing to mention how onerous taxes are?", "label": 0}
{"text": "I know many women voting for him. I've tried to reason with them but it's impossible. They're willfully ignorant and that's worse than stupid.", "label": 0}
{"text": "President can pardon federal crimes but not state crimes.", "label": 0}
{"text": "Seems to only be a problem in dictatorships and last I checked...", "label": 0}
{"text": "Well this is a nice, concise summary of the last eight years of public discourse.", "label": 0}
{"text": "It's more honest to acknowledge these are outlets full of unique perspectives where neutrality is near impossible than pretending there's true neutrality. Especially when the owner, for political reasons, will just override their decision making.", "label": 0}
{"text": "Trust us, we know. Yet some how we’re the ones lying and/or being controlled by the elite, which is true to an extent for every American voter, but at least most of Harris voters are aware of her pitfalls in policy and character… unlike our MAGA counterparts", "label": 0}
{"text": "Bezos and Trump have an ambivalent relationship at best.", "label": 0}
{"text": "Complaints about the \"Liberal media\" have always just been resistance to fact-based reporting.\n\nAnd it worked.", "label": 0}
{"text": "Answer: The left tried to jump through so many hoops to get this man arrested on something that wasn’t a crime. Anyone with half a brain knows this was all for show for the idiots to yell out “he has 34 felony’s” and it’s working since 99% of the morons who hear about it don’t care to look up how far of a reach around was done to get this sentenced. ALSO trump already revived back all that money he was “forced” to pay but I’m sure nobody on Reddit wants to talk about it.", "label": 0}
{"text": "ANSWER: GOP knows their policies are horribly unpopular. Look at pretty much any studies on the topic; when asked whose policies people prefer just based off the policy with no name listed, all demographics overwhelmingly prefer Harris’ policies to Trump’s. Trump has never won the popular vote, and GWB only won it in 2004. \n\n Because they cannot win a legitimate election, they ratfuck them. RFK Jr trying to get off the ballot only in states where it harms Trump for him to be on the ballot; extensive gerrymandering; Trump actually trying to steal last election; state level GOP trying to remove voters and making voting in general more difficult. This is another attempt to ratfuck the election so they can pull out a victory they don’t deserve.", "label": 0}
{"text": "In New York, felons only lose the right to vote if in prison. If you get probation, you don’t lose vote.  Trump hasn’t been sentenced yet.", "label": 0}
{"text": "The fall of Rome is practically a meme of a political argument at this point, but the normalisation of political violence was a precursor to the fall of Roman democracy", "label": 0}
{"text": "To be fair they only went after Madoff because he was stealing from stupid rich people. Had he stolen from stupid poor people, no one would have batted an eye.", "label": 0}
{"text": "Corruption.", "label": 0}
{"text": "Laws are for poor people.", "label": 0}
{"text": "This. \n\nClinton is a scumbag and sex predator.", "label": 0}
{"text": "So, when he wins he just pardons himself?", "label": 0}
{"text": "Uh it should affect the race", "label": 0}
{"text": "Idk maybe, that does usually help.", "label": 0}
{"text": "In a lot of cases yes, but he has had 4 years to install favorable judges and election center cronies.  2020 was a failed trial run.  I dont think we can survive another attempt with his fingers deeper in the corruption", "label": 0}
{"text": "Replace \"the shareholders\" with \"some shareholders\", and you're right on the money. \n\nThe proposal is coming from the \"National Center for Public Policy Research\" - a conservative think tank that owns shares in Microsoft. \n\nThe MSFT Board hates the idea and is recommending shareholders vote no.\n\nFor reference, *any* shareholder can bring up a proposal for new business, so long as it's submitted sufficiently in advance to the Secretary of the Corporation. Corp bylaws sec 1.13 are what you'd be interested in if you wanted to read up on the procedure, but I warn you, it is dry like the Sahara. \n\nhttps://www.sec.gov/Archives/edgar/data/789019/000119312508201369/dex32.htm", "label": 0}
{"text": "I mean, at some point you have to sit back and think that if the worst thing the entire political machine can nail on Trump is filing some shitty paperwork like a decade ago, is he really as bad as they claim? I file shitty paperwork every other week. Are they going to try and lock me up too?", "label": 0}
{"text": "From what I remember when Trump was last in office he denied Amazon certain contracts when WaPo published negative coverage of him, it could be a precaution against the possibility of that happening again", "label": 0}
{"text": "I should probably add that \"goatse\" specifically has little to do with goats and is an older meme about an image of a man really stretching his butthole", "label": 0}
{"text": "Answer: They are all from Call of Duty so it’s likely a viral marketing ploy. My bet is that guy features heavily in the next game", "label": 0}
{"text": "Don’t know if you know but the game is different for us slaves.", "label": 0}
{"text": "Have you ever been to rural California? It's pretty pro trump.", "label": 0}
{"text": "They should be smart enough to not elect him at the detriment of the rest of us due to his power hungry thirst to have loyal subjects.", "label": 0}
{"text": "Answer: Peter Stormare is a very well known actor from Sweden, he's been in quite a lot of well performing molikeand tv shows (Fargo/Prison Break) but jas extensivly been cast in video games due to hos distinct voice and appearance . He is now currently promoting Black OPs 6 and is a character in it, I presume he was in previous ones but I have not checked.\n\nThis gifs are trending due to the promotion of the game", "label": 0}
{"text": "So he didn’t steal anything, thanks for agreeing. You also didn’t contradict that only reason it was a **felony** was because they said the misdemeanor campaign law violation was to cover up a separate crime which was never established.\n\nYou’re not too bad at using word salad to try and make it look like the other person’s wrong without actually contradicting them. It needs some work but maybe you do have a future in journalism or TikTok.", "label": 0}
{"text": "It’s always been a thing.", "label": 0}
{"text": "Because the charges are crap and won’t hold up to appeal. It is only for political reasons.", "label": 0}
{"text": "Answer: He's a billionaire.  Rules don't apply to the world's greatest douchebags.", "label": 0}
{"text": "That's going to make the very suspicious justification they used for ignoring the statute of limitations a pretty sticky legal problem. I imagine the court of appeals will take some issue with it.", "label": 0}
{"text": "If he wins, he will pardon himself.", "label": 0}
{"text": "Yea, because he is innocent. Appeals process will validate that. Eat shit hahahahahaha", "label": 0}
{"text": "because his lawyers pushed and pushed for it - Trump's MO is to have his lawyers flood the legal system so stuff gets delayed, or in this case whining that it would affect the election that he is convinced he will win. Not to mention his screaming about it being a witchhunt by the dems", "label": 0}
{"text": "With this logic, we can wait to get sentenced until after we are out of school. Because it wouldn't look good for a PhD candidate to be sentenced before, it might affect their acceptance chances.", "label": 0}
{"text": "My understanding is that this has nothing to do with wealth and everything to do with this judge wanting to stay out of future textbooks for being the poor schmuck that kicked off a constitutional crisis.", "label": 0}
{"text": "The rich are above the law. It's painful but true.", "label": 0}
{"text": "Seems like it affecting the race.", "label": 0}
{"text": "So I, a simpleton, can go shoot someone in the face and just run for election and I’m good for a fucking year? Seems totally fair.", "label": 0}
{"text": "What's this judge talking about? 34 felony convictions *should* affect the outcome of the presidential race.", "label": 0}
{"text": "none of my past convictions have had anything do with my industry and haven't been a single issue on the random IT jobs i've had over the past 20 years.", "label": 0}
{"text": "Because we've never had a convicted felon running for office and we're in untested waters. \n\nTrump's been treated with kid gloves and got away with blatant criminality for the last 8 years, and until you vote against him this month he will continue to be.", "label": 0}
{"text": "I stopped at your first example.  Stewart was charged primarily with obstruction of justice because she literally lied about her agreement with her broker.   That case does not pertain to Trump... I see no need to dive any further into your laundry list.", "label": 0}
{"text": "Misusing campaign funds IS stealing. If I set up a charity and you donated to it under the presumption it would be used for charity, but I used it for myself, it would be stealing. You are doing everything to try to weasel words, but the reality is that you are not good at it. And more than that you are trying to ratfuck language for a guy rightfully convicted of the crime he committed. \n\nFace that fact. You are not in the right here. You are not succeeding at anything but trying to protect a horrible human that has been convicted for sexual abuse, election fraud, and is currently under investigation for other crimes. Never mind the numerous things he has done in the past, like falsely accuse the Central Park 5, or his racism as a landlord.", "label": 0}
{"text": "Oh so special privileges, cool cool.", "label": 0}
{"text": "What’s more scary is that people are actually voting for him knowing that he’s a convicted felon…", "label": 0}
{"text": "Yeah, some states do allow it.  But it's also Florida.  I think of Florida kind of like a lab rat maze.\n\nYou get the smart rats that can work the maze and get out.  But sometimes you get the ones that just get stuck in a dead end and just sit there, mindless and confused.  Now imagine you left that rat there, and ran more rats through the maze, and eventually you get a community of dazed and confused rats stuck in that dead end.  And they start having dazed and confused rats babies.  That dead end is Florida.", "label": 0}
{"text": "They're limiting possible reasons for an appeal. Trumps lawyers will have a harder time arguing that the judge was attempting to interfere in the election if the judge lets trump run.\n\nIf they had proceeded as normal and sentenced trump to some prison time right before the election, then trumps lawyers could argue that either the sentence or the convictions were intended to hurt his campaign. By letting him run for office, they're hurting the credibility of that argument.", "label": 0}
{"text": "The SC verdict came in after conviction which muddys the waters. Still should've been sentenced imo, but the verdict complicates things.", "label": 0}
{"text": "If he were guilty…he was found guilty of bad bookkeeping in order to hide what the DA considered an illegal activity to influence his 2016 campaign. So was Hillary Clinton and the Democratic Party, who paid a $8,000 and $105,000 respectively. That offense was found to be a misdemeanor in their case. \n\nPaying someone to keep quiet is legal in NewYork. They were both consenting adults. The only wrongdoing was how it was accounted for. \n\nThe other glaring issue is the fact the federal government fined Hillary and the Democratic Party while after looking into Trumps actions found nothing to charge him with. So the State DA decided he would charge Trump. Same DA who ran for office pledging to take down Trump. \n\nTrump was originally going to be sentenced 11 days after he was found guilty. But that was later changed to after the election. Effectively giving Trump the black eye for the rest of his campaign. \nhttps://www.lawfaremedia.org/article/why-did-federal-prosecutors-drop-trump’s-hush-money-case\n\nAndrew Quomo said publicly that if it wasn’t Trump and IF he had not been running for reelection, this case would have never happened. You said farce, that’s exactly what this was. https://youtu.be/x1bqzPK7JU8?si=GOjJMrw4k4-imGFh", "label": 0}
{"text": "There's something to it too. Hillary actually should be in prison, Biden, Obama, Bush, Cheney, etc. should probably be drawn and quartered. Basically every president we've had in quite a while has done some pretty heinous things. \n\nIMO, Trump is legitimately getting treated \"unfairly\" if you compare him to past presidents. Trump (rightfully?) assumed the law didn't apply to him in the same way it didnt seem to apply to past politicians and went full mask off. The government has decided to attempt to enforce the law against him in ways that it's never done before. \n\nWhich, IMO, is a good thing.  I personally want Trump to rot in prison.  If we were ever going to enforce the law we'd have to start with someone. But I don't think it's necessarily wrong to say that the reason laws suddenly apply to him is for political reasons more than it is for justice, and I don't think he was necessarily wrong to think laws didn't apply to him.\n\nMy ideal, pie in the sky scenario: Trump wins, is sentenced, goes to prison for a thousand years. Vance becomes president almost immediately after Trump gets sworn in, due to the prison, and goes after every Democrat with any amount of dirt on them. The Democrats retaliate by doing the same. 3/4 or more of our government go to prison. We get all new politicians who've never even jaywalked and are terrified of breaking the law in anyway because the second they do the full force of the opposing party start frothing at the mouth at the prospect of imprisoning them.  Realistically I know this won't happen, but I remain hopeful.", "label": 0}
{"text": "Sure thing, but 61 judges threw out his election fraud case, and a signifigant numer of them were judges he installed,", "label": 0}
{"text": "He was not charged with stealing. He gave money to Michael Cohen to pay Stormy Daniels through falsifying business records, a misdemeanor. The prosecution upgraded that to a felony by tying it to a violation of election law, as it was to prevent voters from hearing Daniels' claims before the election.", "label": 0}
{"text": "Good job proving you don't know what he was charged with and found guilty of.", "label": 0}
{"text": "It's an elected position. You understand the danger of using criminal convictions to disqualify opposition right?", "label": 0}
{"text": "Who really holds the power though,the mob or the law makers/enforcers or the grey market player in between?\nBeing that the US is a corporation it will always operate to protect its own.\nIt won’t end well for trump..", "label": 0}
{"text": "That is a lot of rules.", "label": 0}
{"text": "You're convicted when you're found guilty. Sentencing has morning to do with it. \n\nBy fact, trump is a convicted felon. You know this too be fact, because he was already convicted of 34 felonies. He just has not been sentenced.", "label": 0}
{"text": "Yet Hillary was only charged $8,000 and the DNC $105,000 and it was marked as a misdemeanor. So absolutely, fraudulent election interference is very bad.", "label": 0}
{"text": "Sweden, really?  I legit thought he was russian", "label": 0}
{"text": "Good observation.", "label": 0}
{"text": "This is not even close to being correct.\n\nIt is extremely common in state and federal courts, when a defendant is found guilty, for there to be a sentencing hearing weeks or even months after the verdict has been reached.\n\nIt is even more common for the convicted person to be allowed back in the community, especially if the charge is non-violent and they were not held in custody while in pre-trial status. If I'm not mistaken, he had to post a surety bond, as well, so it's not like he got out of this for free as it stands right now.\n\nIn this case, the judge - correctly - is withholding sentencing until after the election in order to not be accused of influencing the election. It is a smart preemptive move by the judge, as Trump's team of lawyers would be able to file injunctions should the judge have decided to put him in custody before the election.\n\nHow this is handled after the election is anyone's guess, and he could very well see jail time if he loses in November. Nevertheless, being incarcerated while awaiting sentencing isn't rare, especially not for white collar crime.", "label": 0}
{"text": "Do you want the real answer, or do you just want to sound hysterical?\n\nThe \"crimes\" Trump was convicted of are so laughable that the judge and court know that sentencing him would be a political LOSS foe the Democrats.\n\nIt's all a dog and pony show.  You fell for it.\n\nNo surprise.", "label": 0}
{"text": "He's never worked a day, and it was blatantly obvious. How people think Mr. Money Bags with the bad tan represents the working class I still can't fathom", "label": 0}
{"text": "He's played that type of character a lot.", "label": 0}
{"text": "I love all the worry about “election interference” when the whole case was ABOUT 2016 election interference…", "label": 0}
{"text": "That's not how it works. That scenario only works if you first let in a wannabe dictator. How are you not getting that?", "label": 0}
{"text": "Answer: The same thing that's happening with housing, TV stations and retail.  We allowed billionaires to own them ;)", "label": 0}
{"text": "But what about the stolen documents case? Or the violent insurrection? Or the tampering in Georgia?\n\nYou act like he's been acquitted, but he's still facing multiple trials. He was just able to manipulate the judicial system to get them pushed beyond the election, because that's how rich people deal with the courts.", "label": 0}
{"text": "a blowjob used to be enough, now this isnt?  America, what the actual fuck?", "label": 0}
{"text": "Real answer is there are 2 tiers of Justice in this country.", "label": 0}
{"text": "While I don’t like the guy, I think this was the right call. If he was in jail, they’d say it was rigged if Kamala won (granted they’ll say that either way) it’s a bad look to jail your political opponent. Then on the flip side, if he wins and is in jail, how does that work? I think that’s a question none of the courts want to have to answer. \nA bunch of bullshit but best thing to do is vote him out while he’s free, then let him be sentenced when this is all over.", "label": 0}
{"text": "The bought and paid for Vance will take over", "label": 0}
{"text": "Justice delayed is justice denied.", "label": 0}
{"text": "[It's been well-documented in the news.](https://apnews.com/article/trump-felony-conviction-can-he-vote-b95e7b4c9158d999e8bc89b00fbda911)\n\n\nThere are lots of sources explaining it.", "label": 0}
{"text": "Then go take a look and you'll find what you want in about 5 minutes. It really isn't as complicated as you're making it out to be, you just don't seem to like the outcome and so you're blaming the process.", "label": 0}
{"text": "some are more free than others", "label": 0}
{"text": "Dam this went straight over your head apparently. What I was saying is that this poll can't be trusted BUT if you are really adamant that you want to use it then it still doesn't help your point as it points out the very fact Donald trump supports are more likely to say Hitler had some good ideas. \n\nAlso really, you couldn't find anything about republicans or Donald trump praising Hitler from the past few days. Cause a very cursory Google of \"trump praises Hitler\" brings up many articles about the fact Donald trump's previous chief staff and 4 star general has said that trump is a fascist that on multiple occasions openly praised Hitler. Literally the first result seems like you didn't really look that hard or at all. https://www.telegraph.co.uk/us/politics/2024/10/23/donald-trump-fascist-hitler-john-kelly-claims/", "label": 0}
{"text": "Maybe for Bezos, but I think the LA Times owner wants a job in the administration. ", "label": 0}
{"text": "I mean one felony should be enough. \n\nFor the average American, they would be disqualified from a large number of jobs.\n\nShouldn’t we have higher standards for the most important job in the country?", "label": 0}
{"text": "Trump's sentencing advice papers to Judge Merchan include psych evaluations. Must be some great reading in there! And there's all the breaking of laws and stochastic/domestic terrorism since while he's on the campaign trail. I like to think the Judge is keeping a tally.", "label": 0}
{"text": "If DJT feels no consequences, then most other billionaires will feel great consequences in their lifetimes, and in their children's lifetimes as well. \n\nAre they willing to pay for his crimes? I doubt it.", "label": 0}
{"text": "So... could the possible US president be sent to jail when he starts his term? I'm sure the VP would just take over, but what a sham to delay sentencing until after the election. He's a felon, cut and dry. You sentence him before election, he can't be president; you sentence him after the election and the United States could have a sitting president sent to prison. Sentencing him now would have a better impression on the world than the latter IMO", "label": 0}
{"text": "This is how the judicial system treats the wealthy and powerful.", "label": 0}
{"text": "Serious, the level of judicial misconduct is staggering. Yet Trump and his acolytes have the gaul to insist it's the Democrats who are politicizing the judiciary.", "label": 0}
{"text": "He tried really hard to hide his accent in Prison Break, but I thought he still sounded russian.  I guess it was Swedish it sounded like, and I'm just a silly goose", "label": 0}
{"text": "Okay. Say it’s only one felony. That should be disqualifying enough.", "label": 0}
{"text": "Well he was convicted of 34 so", "label": 0}
{"text": "Answer: Because it’s bullshit. It’s like getting arrested for jaywalking and receiving a ticket for every step you took while walking across the road.. complete non-sense. It will be thrown out so fast by the Supreme Court.", "label": 0}
{"text": "Right? I live in Canada and have a criminal record. A couple of small offenses, nothing violent, sexual, drug related etc.. And I literally can't get a job at most fast food joints because of it.", "label": 0}
{"text": "He’s not gonna stay in office either way. They want Vance, that’s the inept reason he’s his running mate. Why else would someone who called him the American hitler become a turncoat on his on words…. There is something big in it for him. At least that’s my theory.", "label": 0}
{"text": "The stigma around *stating* you have a mental illness has decreased in some spaces and only for certain illnesses (depression and anxiety). But if you are actually exhibiting symptoms, people will still reject you or judge you. \n\n\nThis is my experience as someone with bipolar disorder, which has been successfully treated for 13 years. Don't tell people you have it because then any little deviation from \"normal\" behavior will be pathologized.\n\n\nIt's easy to be accepting of another person's mental illness as long as you don't feel inconvenienced by it. Even people with physical disabilities are treated like shit because God forbid someone has to make any sort of accommodation, as if their life is ruined. ", "label": 0}
{"text": "Either way commiting a felony should disqualify you from leading the country.", "label": 0}
{"text": "I believe this is why he’s acting even more vacant and unhinged. So that if he isn’t elected, lawyers and doctors can say “see he’s clearly too unwell to spend time in prison! He wouldn’t even know where he is!”", "label": 0}
{"text": "> it points out the very fact Donald trump supports are more likely to say Hitler had some good ideas.\n\nYeah, it also points out the that women and black people are the most likely to say Hitler had some good ideas. You're cherry picking shit to suit your bias.\n\n> Donald trump's previous chief staff and 4 star general has said that trump is a fascist that on multiple occasions openly praised Hitler.\n\nHearsay. Proove Donald Trump said such a thing. You can't.\n\nThere is simply nothing here. It's all TDS.", "label": 0}
{"text": "They seem to have concluded that \"the elites\" are their mortal enemy, and then they hitched their wagon to a billionaire trust-fund kid who went to the Ivy League just because he's willing to be mean to the people they want to suffer.", "label": 0}
{"text": "How is it gonna work if he becomes president?  Delay sentencing 4 more years?  Weekends in jail?", "label": 0}
{"text": "In other countries with authoritarian governments, this is a tactic used by the ruling party to eliminate people from holding office.", "label": 0}
{"text": "We should hold presidential candidates to a higher standard than average Americans.", "label": 0}
{"text": "I for one think it is okay if this interferes with the election. Because a presidential candidate being a convicted felon under investigation for multiple additional crimes should probably have that figured out before he gets the job no?  It SHOULD interfere? It should be within the best interest of everyone to clear his name before he becomes president. How does it make any fucking sense to delay a criminal investigation for a presidential candidate out of fear it would impact their presidential campaign? Yeah no fucking shit it would impact it. If we find evidence tomorrow that Kamala killed 10 people in cold blood I can’t imagine fucking anyone would say “well let’s wait till after the election so it doesn’t affect it.” BUT THAT IS THE KIND OF THING THAT WE NEED TO KNOW", "label": 0}
{"text": "Because imprisoning a Presidential candidate before a national election is undemocratic and would likely result in civil unrest.", "label": 0}
{"text": "Basically we have an entire party in the government acting under the iron age belief in absolute power of sovereigns and cowards that refuse to stand up to that belief because they don't want to be the person those people are angry at", "label": 0}
{"text": "So if he wins the election then what??", "label": 0}
{"text": "He’s also an adjudicated rapist.", "label": 0}
{"text": "Republicans need to cheat in order to win elections. Even the electorial college, as unfair as it is, cannot save them without taking illegal steps. Since very little consequences occured after January 6th 2021, Republicans are more motivated to commit election related crimes. And if they win they will sweep all the crimes under the rug.", "label": 0}
{"text": "So the kid who went to jail for having an ounce of pot has less of a chance of being hired for a part-time job than the guy with 34 felonies hanging over his head has of becoming president?? What a stupid fucking country.", "label": 0}
{"text": "I ask myself that same question.", "label": 0}
{"text": "If I ever get in trouble I’ll announce my run for president and use this case as precedent.", "label": 0}
{"text": "So you’ve retracted your original statement regarding Trump’s conviction, thanks.", "label": 0}
{"text": "Quid pro quo right there.", "label": 0}
{"text": "Probably yeah, and if he ever fails to stall he has the money to flee to a country with no extradition.", "label": 0}
{"text": "No, I didn't. I'm not the same person you were talking to, lol. \n\nNothing else to say? Cause you know you're wrong, huh? Must suck to suck, dude.", "label": 0}
{"text": "The vast majority of rape reports never lead to a trial. \n\nDoes that mean we should try no one for rape?", "label": 0}
{"text": "How do you rationalize voting for an adjudicated rapist?", "label": 0}
{"text": "So what happens if he wins? Does the judge go, \"ope, i know the people voted, but he actually has to go to jail now\"\n\nOr is it\n\n\"Ope, american wants him so yall can have him, no jail time\"", "label": 0}
{"text": "So was Epstein, Weinstein and a lot of other rich white guys", "label": 0}
{"text": "It's not his lawyers, it's the Republican judges who are blatantly against allowing any good to come from our judiciary.", "label": 0}
{"text": "So he is a fucking coward that refuses to do his job.\n\nIf he didn't want that responsibility and risk he shouldn't have been a judge, he shouldn't have taken the case and we shouldn't act like it is okay for him to enjoy the privilege of his position without also accepting the responsibility.", "label": 0}
{"text": "Why isn't it a misdemeanor like most cases like this?", "label": 0}
{"text": "Lol, no. Nobody's voting for Harris based on Bidens' broken promise of loan forgiveness.", "label": 0}
{"text": "Thats America for you.", "label": 0}
{"text": "You think there's no evidence?\n\nOur country is doomed.", "label": 0}
{"text": "Do you trust anyone in DC to turn down the keys to sole power for their party if handed the ability to do so?\n\n\nMaybe a 'felons can't be president' rule would go unused for decades. But all it takes is one guy, and now his party is the only one legally allowed to run. I don't trust anyone enough to give them that power, and I certainly don't trust the public to not vote in someone who will do that.", "label": 0}
{"text": "You mean all the other cases that are falling apart? You're acting like the prosecution wasn't begging not to get sanctioned before the appeals court in the case of the shit Letitia James brought against him.\n\nWith all these cases falling apart, maybe you might think that it's not him manipulating the system and that the cases are weak. You all call Trump and inept fool yet at the same time consider him a mastermind who can dodge everything thrown at him with his machinations. There is a type of person who operates by calling his opponent both weak and strong at the same time, need I remind you.", "label": 0}
{"text": "In a civil case. That shit doesn't matter.", "label": 0}
{"text": "Hmm let’s recap.\n\nI said:\n\n> [Trump] wasn’t convicted of stealing anything though lol.\n\nYou said:\n\n> You are a liar and wrong.\n\nNow you’ve changed that to:\n\n> I'm specifically referencing the 2018 Cohen case \n\n🚨BOT DETECTED🚨", "label": 0}
{"text": "What's undemocratic about putting someone in jail for crimes they have committed?", "label": 0}
{"text": "By cowering to MAGA crowd they are getting stronger and stronger. Make no mistake we are following the 1933 Germany playbook to a T and that's because Trump literally keeps Hitler's book next to him according to verified reports.\n\nThey are feeling more powerful and that means eventually they're gonna be bold enough to do everything they want via force. It's literally already starting.", "label": 0}
{"text": "Now you're just lying about the other cases. Shame on you.", "label": 0}
{"text": "Well, he was in a Russian space station before he helped saved Earth.", "label": 0}
{"text": "_Adjudicated_ is doing a lot of work there.  At least he actually won three primaries to Kamala's zero.", "label": 0}
{"text": "You're voting for him because of... explicit corruption and blatant bribery? It just came out that he offered Cannon a job as attorney general for helping him.", "label": 0}
{"text": "Not as badly as are educational system.", "label": 0}
{"text": "I'm just not sure how believable that is to me. It's a massive incentive.", "label": 0}
{"text": "The unlawful retention of top secret documents falls under the espionage act because if you are retaining top secret documents, the assumption is that you are doing so **to sell them.**\n\nIf you have 5 kilos of cocaine, it's safe to assume that you intend to sell it.", "label": 0}
{"text": "The left doesn't have a candidate.", "label": 0}
{"text": "Could you answer my question? What prevented Trump from enacting it his last term?", "label": 0}
{"text": "wait why is he even allowed to pardon himself for federal crimes??", "label": 0}
{"text": "You keep refusing to properly describe what happened and why he was prosecuted for election fraud.", "label": 0}
{"text": "An independent civil service, which Trump was attempting to eliminate at the end of his term by rescheduling the entire Civil service as at will scedual f employees. Finishing the process is step one of project 2025.\n\nThe lesson they learned is Trump drags his heels, so he needs hard working authoritarian to get the ball moveing.", "label": 0}
{"text": "Most important election in history! (except the next one, of course)", "label": 0}
{"text": "No, it's a hi-IQ play. There are people who will believe trump's nonsense that he is being victimized by \"the deep state\" and will vote for him. Delaying the sentencing until after the election deprives him of that opportunity to motivate a few voters because he's a victim.\n\nIt's a smart play.", "label": 0}
{"text": "Oh, wow! When you know you've lost the argument, you resort to calling me a bot. Even when I provide all the evidence for what I said, like the fact that he was unindicted co-conspirator of the 2018 case against Cohen, his fixer. The very same guy that he coordinated with to hide hush money payments for Stormy Daniels. \n\nAnd never mind the fact you are still sitting here defending the guy. It is almost like you don't actually care about any of it except that you want Trump in power regardless of the facts. It doesn't matter he's a convicted sexual abuser. It doesn't matter he was convicted for campaign fraud. It doesn't matter he was an unindicted co-conspirator in campaign fraud. It doesn't matter a special investigation said the only reason he was not indicted was entirely down to him being president and having a high profile. It's all lies and okay to you, right?", "label": 0}
{"text": "It actually rhymes with odd, which is what I find this rhetorical style you've used.", "label": 0}
{"text": "While you're correct that New York's law is that felons are ineligible to vote only during incarceration, it would seem to me that Florida's law is a bit more complicated than just applying New York's voting law concurrently in Florida.\n\n[This post](https://dos.fl.gov/elections/for-voters/voter-registration/felon-voting-rights/) states:\n\n>A felony conviction in another state makes a person ineligible to vote in Florida only if the conviction would make the person ineligible to vote in the state where the person was convicted.\n\nBy that reading it only matters that a felon is convicted of a felony for which they *would* become ineligible to vote in New York. However, the duration of that ineligibility in Florida doesn't seem to be tied to directly to the duration of ineligibility in New York. That is to say, a person loses the right to vote in Florida because they would have lost the right to vote in New York, but the process in which that right is restored in Florida is determined by Florida law, not New York law.\n\nThat said, the above quote is not the actual text of the law. According to that link, the relevant statutes are \"section 4, Article VI, Fla. Const., and section 98.0751, Fla. Stat.\" I'm not a lawyer but, at least to me, it doesn't seem that either of those statutes say that a felon's voting rights are restored when they would be restored in another jurisdiction. They both effectively say that \"voting rights shall be restored upon completion of all terms of sentence including parole or probation.\"\n\nFinally, this nuance may have already been adjudicated in the court system so I, as I often am, might just be talking out of my ass. Please correct me if I'm wrong.", "label": 0}
{"text": "I mean he is going to do that in like 5 years when his lawyers can't keep pushing back sentencing.", "label": 0}
{"text": "Don’t forget the white man part.", "label": 0}
{"text": "Plus, the jury could have convicted on fewer charges.  The charges he was convicted for are the ones he's sentenced for.  It's not like the judge can prepare the sentence ahead of the conviction, in many cases.", "label": 0}
{"text": "Answer: different rules for rich white people with big time lawyers.", "label": 0}
{"text": "If Harris is elected, her AG needs to have Cannon arrested on charges of criminal conspiracy.", "label": 0}
{"text": "Ok so bear with me. I’m not in any way a supporter of Trump, however it actually makes a lot of sense for a criminal record to not disqualify a person for running for public office. You never want to give a State the power to say “these people are “criminals” therefore they are no longer allowed to participate in the political process. It’s the same reason disenfranchisement of the prison population is such a gross violation of civil liberties.", "label": 0}
{"text": "It's also pending appeal, and the appellate court in NY acted pretty skeptical about the prosecution's claim.", "label": 0}
{"text": "Panera is more soup and salad combos.", "label": 0}
{"text": "“Show me the man and I’ll show you the crime”\n\n-Stalin's police chief, Lavrentiy Beria", "label": 0}
{"text": "lol no.", "label": 0}
{"text": "You're literally justifying a politically-motivated prosecution here in service of the great good. That's BANANAS.", "label": 0}
{"text": "So, how should enforcement be determined?", "label": 0}
{"text": "People on Reddit are mostly idiots and have no idea what they are talking about.", "label": 0}
{"text": "So it takes a 2/3 majority to overrule it, but only a simple majority to completely ignore it.\n\nThat makes sense.", "label": 0}
{"text": ">Side note... people still read newspapers?\n\nBelieve it or not, news organizations in 2024 typically post articles on the *internet*. You can access these articles using a smartphone or computer to visit their *website*. You can think of a website as a virtual bulletin board, where information is posted publicly for others to view and \"the internet\" is the road you drove to town on to look at the bulletin board.\n\nHope this helps!", "label": 0}
{"text": "While I would love the idea of a court above politics; that’s obviously a pipe dream these days. \n\nI’d say since it’s the states that determine almost everything else about their electoral ballots they may as well be the ones to determine eligibility as well.", "label": 0}
{"text": "> This fuckin electorate is the real FML.\n\nFrom sea to shining sea", "label": 0}
{"text": "Don't concern yourself with logic or ethics. Neither of those ideas will help you. They are not factors. The only question that matters is \"how to win.\" The how can be anything and everything. Whatever is possible will do, no matter the cost.", "label": 0}
{"text": "Special treatment for the privileged yet again.\nHow much you want to bet his sentence amount to nothing as well?", "label": 0}
{"text": "Well, the boss of the president is *supposed* to be the American people and it seems like half of the boss’s brain is scrambled.", "label": 0}
{"text": "So..... What if he wins and is sentenced to person? This seems to create more problems than it prevents.", "label": 0}
{"text": "Is this why people are unsubscribing from WaPo?", "label": 0}
{"text": "> It’s cut and dry white collar crime with no victim but being dumb about money transferring between accounts and repayments.\n\nHe was convicted of falsifying business documents in furtherance of a crime.  The crime he was falsifying business documents in order to obscure is a campaign finance violation.  The victim is the American electorate.", "label": 0}
{"text": "Nobody. All these words to just say -nobody.", "label": 0}
{"text": "100%", "label": 0}
{"text": "because locking up someone who is at this moment, more likely than not to win the presidency, which may cause him to lose, is probably bad?", "label": 0}
{"text": "Cute that you think this would convince the MAGA crowd to keep him alive. They built a noose for Mike Pence, they aren't going to let the judge that convicted their lord and savior get away with it.", "label": 0}
{"text": "You believe The Washington Post, owned by Jeff Bezos, has chosen not to endorse Kamala Harrison out of a place of integrity and conviction?", "label": 0}
{"text": "Lol, okay. Clownshoes, dude.", "label": 0}
{"text": ">It was created to give outsized political power to slave states\n\nNo, the house of representative was created to give an outsized political power to populated, predominately slave, states. This was a rather radical idea, since districts were in no way shaped by population. \n\nThe Senate was created to give small, mostly northern, states. This was the standard of the Continental Congress.\n\nThe electoral college followed by saying the house and senate got to count for the head of government and letting states vote instead of the elected politicians (as a way to separate executive and legislative) which has no impact from slavery directly.\n\nTldr: thanks slave haters, y'all gave us the Senate!", "label": 0}
{"text": "Well, you see, our society and rule of law is falling the fuck apart and we’re about to become a failed state.", "label": 0}
{"text": "But also the race is a dead heat and they don't want to lose half of their subscribers.", "label": 0}
{"text": "It's entirely democratic. Democracy just means that the people vote. It says nothing about how, when, or in what manner. \n\nYou desire 1:1 but others don't. Both can be democratic, both can be opinions. All can be true.", "label": 0}
{"text": "Where did it say that the federal courts can’t determine this? From my (possibly incorrect) recollection, it said Congress has to determine this disqualification. Congress also explicitly made the laws which define insurrection and say it’s a crime that can be prosecuted in federal court.", "label": 0}
{"text": "fixed lol", "label": 0}
{"text": "I’ve known more coherent downies ", "label": 0}
{"text": "This is not uncommon for judges to do so he's not getting special treatment.\n\nNot just that, but he's not really a flight risk and the felony were pretty petty relative to other accusations currently being made against him.", "label": 0}
{"text": "Does that mean you are convinced Trump has never raped?\n\nOr are you just looking for enough plausible deniability to not care?", "label": 0}
{"text": "The senate will never confirm that.", "label": 0}
{"text": "The real answer is that he is the primary presidential candidate for the Republican party and former president. This is all a first in our nation's history. Making sure everything is done correctly is crucial.", "label": 0}
{"text": "Yet Kamala saying if Trump wins he’s going to put everyone in camps and called him Hitler isn’t an emotional appeal lol", "label": 0}
{"text": "How would rape be irrelevant in selecting who to put in power?", "label": 0}
{"text": "Wtf is that bullshit. If trump didnt want his sentencing to affect the election then he should'nt have *committed 34 felonies*. What ever happened to everyone being equal under the law? God i hate this country", "label": 0}
{"text": ">He's accused of paying a pornstar to keep quiet about sex.  \n  \nIt's funny that if Trump actually paid her himself he wouldn't have been in trouble.  It was hiding the reimbursement payments to his lawyer as legal expenses that was the crime.", "label": 0}
{"text": "Of course you'd use a term like that.", "label": 0}
{"text": "You’re being intentionally thick. The other person KNOWS that this is currently how it works. They’re expressing their desire for it to change. I know, it’s mind-blowing", "label": 0}
{"text": "His conviction was explicitly related to election interference the last time he won. That should automatically disqualify him", "label": 0}
{"text": "Yup he’d at least be a weekender if he didn’t have money.", "label": 0}
{"text": "I read an argument which goes something like this: if having a political figure put on trial, sentenced and ultimately incarcerated would also prevent this person to run for official duties like a presidency, then you are also opening the door to corruption and political smear campaigning. An opponent could try to eliminate you from being a viable alternative = a road to dictatorship. I know it sounds bizarre because many fear this is exactly what's happening right now anyway and people doesn't seem to give a shit about decency and doesn't seem to mind that presidents have these kinds of records. But in another time and place it sounds kind of logical.", "label": 0}
{"text": "Primarily concerned about civil unrest. \n\nIf he wins he will most likely die before being sentenced due to old age.\n\nIf he loses… I look forward to him spending vast amounts of his wealth and his children’s inheritance on legal fees.\n\nCurrently his legal staff is rooting for a L\n\n$$$$", "label": 0}
{"text": "Because our country has long had a multi-tiered justice system that works based on your social class standing and personal wealth, and is now getting so awful that you can't miss it anymore.", "label": 0}
{"text": "To be fair, that depends on if you count jewish people as “white” and even today many people dont.", "label": 0}
{"text": "Being convicted of one should. And you should not be able to be charged with a crime beyond the statute of limitations.\n\n\nAnswer me this: If this was such a grave and disqualifying crime, why did the state of New York wait for 8 years to charge him on a crime with a statute of limitations of 2 years? And furthermore, why was it allowed to proceed?", "label": 0}
{"text": ">but at least most people should be happy with the result.\n\nThat would make the US one of the bett r democracy ironically. Any country with more than two major parties is by default never going to have most people happy with a result because the split. France for instance never has more than about 35% approval, because they have multiple parties.\n\nBy comparison, the US has almost 50% (never much below) of the voters approve of the results because the options are split between two. For president anyway.", "label": 0}
{"text": "(Not directed at you, personally) \n\nAll I hear every day is “system’s broken, gotta let criminals run the country. System’s broken, gotta let school shootings happen.  System’s broken, gotta allow gerrymandering.  System’s broken, we have to let insurance companies buy political influence. System’s broken, we have to let billionaires write our laws in their own favor”\n… and a hundred other things.\n\nI’m starting to think the system is broken.", "label": 0}
{"text": "Brother, that's like 1 on a list of a million reasons he's a treasonous corrupt demon.", "label": 0}
{"text": "Trump's the kind of guy you find to do a security audit of your democracy and it was so easy to hack that he found the root password and sold it to the Saudis on his first day.\n\nThe Framers never expected someone to take on the office of the Presidency with such bad faith.  That was a mistake.", "label": 0}
{"text": "You fall for lies easy huh?", "label": 0}
{"text": "The far right working themselves up about misinformation? In other news, the sky is blue.", "label": 0}
{"text": "Justice must be seen to be done. His ass should be in jail. Let him campaign from there.", "label": 0}
{"text": "Right so, here’s the thing guys. They postponed his sentencing for his convictions and other trials until after the election, to avoid interfering with the election. But some of his convictions and charges are for ELECTION FRAUD. So if you know anyone who thinks everything is fine, it’s not.", "label": 0}
{"text": "And both of them went to jail. Trump has yet to see the inside of a jail cell despite 4 decades of criminal activity.", "label": 0}
{"text": "Yes but he was convicted by a new york jury. It would be like if alabama tried and convicted kamala then imprisoned her before the election.", "label": 0}
{"text": "Paying someone hush money is not illegal, this sounds so fucking desperate right now.", "label": 0}
{"text": "And OJ eventually went to jail.", "label": 0}
{"text": "Lol I did not 🙂\n\nI'm surrounded by folks who say things like that all the time! 🥴", "label": 0}
{"text": "Weinstein is jewish. And diddy and weinstein were eventually arrested. Trump has been a criminal for 40-50 years at this point.", "label": 0}
{"text": "But rich black and jewish people eventually did go to jail. I cant think of the last really rich “white” person to go to jail…", "label": 0}
{"text": "It's crazy we are even having this conversation about a person who is up for becoming our president!  SMH.", "label": 0}
{"text": "The hush money wasn't the illegal part, otherwise he wouldn't have been convicted. It was the way he tried to cover up the hush money payment in order to improve his chances at the election by falsifying business records", "label": 0}
{"text": "In other words, we have no power and this election will only further cement us in this system no matter who wins", "label": 0}
{"text": "Of course I mentioned how onerous taxation is. We are taxed on the clothes we buy, the food we eat, when we buy a car, when we renew the registration, in the gas we put into our cars, the state taxes our income, the country taxes our income, our employer is taxed when he pays me, we're taxed on the property own, on the beer we drink after work, on our investments in the stock market,  taxed on luxuries, taxed on our utilities, and taxed when we die. \n\nThis country went to war over a 2% tax increase on tea", "label": 0}
{"text": "Because the majority crimes don’t result in a trial.", "label": 0}
{"text": "So what. Alabama is not an entirely different country and their laws follow democratic principles. If she is convicted of a major crime in Alabama the she should go to jail and if she won the presidency then she could serve her term from jail. I don’t believe there is anything in the Constitution that prevents that.", "label": 0}
{"text": "The thing is, the interview is the voters who are supposed to filter out candidates like this. That's what you get for trusting the general population to make reasonable and intelligent decisions.", "label": 0}
{"text": "And then they will claim \"look even the left leaning media agrees with us !\"", "label": 0}
{"text": "Which is just such a joke since (his) Supreme Court decided that anybody that’s president cannot be prosecuted. Pretty serious bet for him, but outrageous that this country is letting him get away with this!", "label": 0}
{"text": "What country do you think they should move to?", "label": 0}
{"text": "The crime is \"fucking with an election\", or something like that.  They phrased it a little differently.", "label": 0}
{"text": "i'm sorry, when did i say anything about a president being in jail?\n\nmaybe you should try and read comments and comprehend them before replying. the bots on reddit do better than you", "label": 0}
{"text": "I think it's an important distinction, and it's a lot more germane than other peoples' answers about \"it's because he's rich\" or \"it's because he's powerful.\" Those are all true and all have major impacts on lots of things, but they're not really involved in \"how can a felon run for office in the first place.\"     \n  \nConsider a few normal people trying to get normal jobs.  \n  \nAlbert has felony convictions for raping children and killing puppies. He applies for a job at some random straight-laced company.  \nWill he get the job? No, because the company has a policy of not hiring felons.  \n  \nBob has no felonies. However, during the interview, he says that he regularly fantasizes about raping children and killing puppies.  \nWill he get the job? No, because although the company does *not* have a policy explicitly prohibiting *fantasizing* about raping children and killing puppies, the hiring manager is like \"Fuck that! No way am I going to hire this creep!!\"  \n  \nThe company has no policy against fantasizing about raping kids and killing puppies, because until now it's never been seen as *necessary*, because what fucking hiring manager would hire someone like that? You don't need to have a rule like that. You don't need to have a rule that says candidates can't wear soiled underwear on their heads. You don't need to have a rule that candidates can't wear t-shirts that says \"I Rape Nuns.\" Not because candidates are rich, or famous, or powerful, but because it's a non-issue: the hiring manager *of course* wouldn't hire a candidate like that.  \n  \nAnd then Charles comes in for an interview. During the interview, he says that he regularly fantasizes about raping children and killing puppies.  \nSurprisingly, the hiring manager *really really likes* Charles. Yes, it seems bizarre, but for whatever reason (maybe because he's rich, maybe because he's famous, maybe because he's powerful, maybe because Charles pisses Dan off and the hiring manager *hates* Dan and just wants to do whatever angers Dan), the hiring manager is like \"You know what? I think Charles is awesome and I'm totally going to hire him.\"  \n  \nSo is Charles' money, fame, and power unimportant? No, it plays a significant role in his getting a job. But is it *why* he's allowed to apply for that job in the first place? No. He's not using his money, fame, and power to circumvent some rule, *that rule doesn't exist*, because the assumption is that a hiring manager wouldn't hire a deviant in the first place.", "label": 0}
{"text": "And they were so serious he can't possibly win the election now! With all respect, have you ever asked yourself honestly why so few people outside of the Dems/Liberals/Left seem to... care? The often-trumpeted line is that people who vote for Trump are one shade of amoral or another (or all of them!) But have you ever considered that this is an *extremely* unlikely and statistically improbable truth? What *is* true, however, is that every attempt to hold Trump accountable for the things that he is accused of doing finds him moreorless untouched, because our judicial system, even where he had little to no control as President, has trouble meeting the bar to convict him of anything near as serious as is alleged. \n\nIf you put yourself into the mind of someone who genuinely agrees with his policies, he was convicted of 34 felonies in a highly partisan state court that all stemmed from a single, legal, act where a legal payment was involved in what is always otherwise a singular misdemeanor. And if you go looking about at the actual facts of the case, itself, it agrees with the previous sentiment.\n\nI'm not saying all this to try to \"own\" you or \"win\" a pointless shouting match on the internet. I'm saying this because maybe, just maybe, you can stop seeing fellow Americans who hold different values and priorities to your own as your enemy. Because you aren't enemies. And you need to be able to talk to each other, exist together, and above all else make this nation as great as it can be for all of our benefit. We may disagree on how to get there, but any path forward is a process of compromise and cooperation.\n\nIt is funny, but Trump in 2024 did something I had very much hoped that either McCain or, later, Romney would do if they had won, which was pull the GOP to more of a moderate position, socially, to keep up with the times. Trump architecting (demanding) the removal of opposition to both abortion and gay marriage (and by extension, gay rights in a classical sense) is the first letting off of the dam in that arena, paving the way for future Republicans to take more moderate-to-center-left positions on those and similar issues. As someone who was raised in a Massachusetts that was solid blue with a GOP governor more often than not, that sort of Republican politician can often be a great benefit.", "label": 0}
{"text": "what did he do wrong?", "label": 0}
{"text": "Such nonsense.....", "label": 0}
{"text": "*Eventually*.\n\nI would argue that Trump is on a league above them as former POTUS.", "label": 0}
{"text": "Because it was a civil case. And that shit don't matter.", "label": 0}
{"text": "I know. It makes too much sense but goes against your idea of what a president should be. But breaking the law has inconvenient consequences for the law breaker.", "label": 0}
{"text": "In other words, his a** is on the line and he knows it. If the last election got weird and nasty....this one will beat that by far. He'd rather stoke a civil war than spend a day under his sentences. (Maybe even fake a shooting and never get a scar after a week or so or something strange like that;)", "label": 0}
{"text": "Airforce over here trippin about a MIP for drinking underage lol.", "label": 0}
{"text": "He is. He wants to avoid any chance of impropriety. At the end of the day, the crimes, while numerous, are relatively minor. Normal circumstances usually wouldn’t even dictate a prison sentence.", "label": 0}
{"text": "Biden dropped of a Presidential race in the 1980s for plagiarism.   PLAIGIARISM!!!  \n\nOMG, could you imagine if Trump plagiarized something.  /s", "label": 0}
{"text": "Falsifying business records is the illegal part. The prosecutor's argument is that paying the hush money constituted a campaign finance expense, which was misfiled.\n\nAgain, this reeks of desperation.\n\nLet the people *vote,* because this is a democracy, and when Donald Trump loses the election he can go to jail as a final nail in his political coffin.\n\nIf you're concerned that the convicted felon might win, take it up with the Democratic Party for running the weakest fucking candidate in recent history.", "label": 0}
{"text": "Okay so then you really had no argument for not sentencing him now? And my original point stands.", "label": 0}
{"text": "Doesn't that mean that, even if Trump gets elected, he can get tried and might get sentenced to jail time as president?", "label": 0}
{"text": "And what happens if, god forbid, he wins the election? Merchan’s now sentencing the president elect of the United States for 34 convictions. WTF", "label": 0}
{"text": "I know that, but still can't get my head around it.  Why do liberals/elites get under their skins so badly that it affects their sense of reality?  Are they all suppressed sexually and are secetely jealous that liberals aren't?  I'm talking about the very religious supporters.  The non-religious supporters I think are just mean/authoritarian people to an extreme.", "label": 0}
{"text": "You didn't reply to my original comment to you. You replied to something you made up in your head.\n\nI gave you a reason why we shouldn't sentence people who are running for office when it can change the trajectory of the election by confining him instead of him being able to campaign, especially for presidential elections, and especially for charges that aren't all that serious.", "label": 0}
{"text": "They don’t care bc they like putting a bully in power bc they are bullies. Authoritarians don’t care about following rules for people they approve of/themselves. \n\nIt’s the same reason his followers don’t care he is a rapist. \n\nShitty people are common. Bullies are common. I grew up in the church where authoritarians are accepted as leaders. It’s the same thing. \n\nIf it was legal, he wouldn’t be a felon.", "label": 0}
{"text": "https://www.azfamily.com/2024/09/19/arizona-man-sentenced-nearly-300-years-theft-crimes-released-prison/\n\nhttps://www.nytimes.com/2024/08/14/us/chicago-school-chicken-wings-theft.html\n\nhttps://www.thedailyreporter.com/story/news/courts/2023/03/08/homeless-man-gets-up-to-10-years-for-stealing-clothes-for-warmth/69978144007/", "label": 0}
{"text": "I mean the Supreme Court will just help trump out in the end, however, trump may not be able to pardon himself since it violates the    separation of powers. He would be acting as his own judge and jury. It would depend on the court.\n\nAlso, assuming laws are followed as written.", "label": 0}
{"text": "You forgot \"white.\" Remember, Bill Cosby was also rich, famous, powerful, and even older.", "label": 0}
{"text": "\"im voting for a rapist\" this fucking guy", "label": 0}
{"text": "This makes even less sense. He is a private citizen at the moment with no governmental or presidential protections under the law. \n\nSo in your scenario anyone can commit a crime and have their sentencing and potential imprisonment delayed just because they run for President? Does this only apply to President or are there other positions this should apply? \n\nWhy would we postpone or delay justice just because someone runs for office? And in this scenario the person is convicted already and found guilty. There is nothing wrong with that impacting the election as it is what they already did. It’s part of that persons history and is 100% a viable determinant of an election.", "label": 0}
{"text": "Blatantly obvious political persecutions probably play a part.", "label": 0}
{"text": "The age thing isnt that big a factor here.  If he were a poor person of color they definitely would have just sentenced him earlier.", "label": 0}
{"text": "I know what I hear with my own two ears in his rally speeches 🤷 so good luck with your lies theory", "label": 0}
{"text": "And when the paper fails the owners will blame the internet and not their own incompetence.", "label": 0}
{"text": "That won’t be soon enough. He needs to eat more double Quarter Pounders with Cheese with supersized fries and chased with many large Coke’s.   If he had some sliced onions with it that we be good as well.", "label": 0}
{"text": "And then he'll skip paying them as a thank you", "label": 0}
{"text": "That won’t be soon enough. He needs to eat more double Quarter Pounders with Cheese with supersized fries and chased with many large Coke’s.   If he had some sliced onions with it would we nice.", "label": 0}
{"text": "I honestly don’t think it’s going to end up even being that close. We’re days away from the election and Trump has no wind in his sails right now. They will lose and they will try to cheat but I don’t think it will work again.\n\nTrump will then get sentenced to prison next month.\n\nIf the republicans lose some other seats they might start to change the party.", "label": 0}
{"text": "Fuck no", "label": 0}
{"text": "Answer: Because it's easier to blame things on people's brains instead of acknowledging that material conditions are getting worse and that asking people to remain sane in the face of dwindling opportunity is quite literally insane.", "label": 0}
{"text": "That’s the mystery", "label": 0}
{"text": "Does that mean they'll sentence him if he wins?  I somehow doubt it.  They'll find another excuse to kick the can down tbe road", "label": 0}
{"text": "Which is dumb, because if this were making decisions on literally any other job in America, \"has this person been recently convicted of a fuckton of felonies\" should absolute affect whether or not you hire them.", "label": 0}
{"text": "Could have stopped at rich. Daddy’s money makes him president instead of in prison in this country. His father should have been in prison too.", "label": 0}
{"text": "Anyone else yelled or got defensive like Kavanaugh did during his Senate hearing, no way in hell would he have gotten the job.", "label": 0}
{"text": "It’s up to us to reject him.", "label": 0}
{"text": "> He is a private citizen at the moment with no governmental or presidential protections under the law.\n\nSure. This, once again, has nothing to do with what I said. I never stated he isn't a private citizen, nor does he have special protections. \n\n>So in your scenario anyone can commit a crime and have their sentencing and potential imprisonment delayed just because they run for President? Does this only apply to President or are there other positions this should apply?\n\nWell yeah, sentencing is delayed all the time for plenty of reasons, I know plenty of people need weeks after a conviction to setup their business so others can run it so the person doesn't face unduly consequences. Running for president is not inherently different, and I'd say it's more important to delay a sentencing in that case. Remember, the punishment is for you to serve the time, not to automatically lose an election just because you happened to be convicted at the wrong time.\n\n>Why would we postpone or delay justice just because someone runs for office? And in this scenario the person is convicted already and found guilty.\n\nAs I just said above.\n\n>There is nothing wrong with that impacting the election as it is what they already did. It’s part of that persons history and is 100% a viable determinant of an election.\n\nThe whole point of the criminal justice system isn't to do any additional needless harm to people, it's to try and best make people serve the punishement derived from statutes- and I think everyone would agree that torpedoing someones re-election bid because the conviction happens to happen during the campaigning season just makes sense. If you can delay it a couple of months, he'll still serve the same sentence, but you don't cause needless undue harm.\n\nThere have been many cases where sentencing and other penalties are halted or delayed because of other factors, such as ailing and dying parents and relatives. I know personally of one factor of a jail sentence delayed by 6 months waiting for the convicted party's parent to die from cancer- it would be cruel to the elderly parent on hospice to have to for a couple of months moved to another facility and back, and at huge cost- which could easily end their life.\n\nI don't think you have the experience to have as strong of an opinion on this topic as you do.", "label": 0}
{"text": "They will do whatever Fearless Leader tells them to do. There is no longer a need for independent thought now that they have Trump. If he claims that he \"drained the swamp\" at the Times and that MAGA should make it the most read publication in history, they will do it.", "label": 0}
{"text": "Civil cases have a much lower standard of evidence. Someone could find me liable for rape in a civil trial over a claim someone makes 10 years ago and there really isn't much you can do about it. It means nothing, because it's just a civil case. The allegation against Trump was much older than 10 years, and so they mean even less. \n\nAll civil liability means is that a judge or jury decided they didn't really like you that day. And considering that case was in a New York court, it extra didn't mean anything.", "label": 0}
{"text": "Good luck, friend. We are going in circles and I doubt either of us will move on this issue. You seem to want to give these folks a pass on criminality and I would rather they are treated as everyone else. I doubt that can be reconciled.", "label": 0}
{"text": "Everyone’s been out of laughs for a long time now. The justice system has become more of a defecation stock.", "label": 0}
{"text": "It sounds like a clear cut decision to me. You are a criminal, you go to jail. You can argue the justice system can be corrupted and then used as a tool to punish your enemies, but at that point you have bigger issues in your hands.\n\nThe fact that you don't punish a criminal is directly shinning a light on how weak and corrupt the system is, therefore doing so trying to avoid appearing to look weak and corrupt is an oxymoron. A strong and clean system would sentence him based on the evidence and foundations of its case", "label": 0}
{"text": "Answer: Well, they have tried to kill him twice so it’s not like they’re not working on it.", "label": 0}
{"text": "Right-wing corruption.", "label": 0}
{"text": "when you're a billionaire, and/or if you have presidential level connections, the laws become more of what you'd call guidelines than actual laws.", "label": 0}
{"text": "Being rich, famous, very old and the most important one you forgot being WHITE!!!!", "label": 0}
{"text": "So you genuinely believe that Trump has never raped anyone?", "label": 0}
{"text": "Very well spoken", "label": 0}
{"text": "he's not been charged for an insurrection related offense.  none of them.  most of the charges were misdemeanors turned into felonies by an over zealeous prosecuter.  he will be getting reprimanded soon.", "label": 0}
{"text": "Just to clarify your position...\n\nLet's say Wyoming decides to pass a law to get Kamala Harris out of the race. Let's make it something crazy, like being named Kamala Harris is now a felony.\n\nThey indict her, she doesn't show up to the trial, and they convict her in absentia.\n\nIs it your position that Kamala Harris should then campaign from jail, and if elected serve her term in jail?", "label": 0}
{"text": "didnt bother clicking anything after the first link.  the guy was sentence for over 25 FELONY charges on RESIDENTIAL property.  this isnt a simple walmart theft.", "label": 0}
{"text": "This just furthers reinforces the fact that he should not be president, let alone be a candidate.", "label": 0}
{"text": "Gonna be a long time after the Supreme Court made the 'official acts are not illegal' ruling.  I believe they need additional filings to make a case that Trump acted in a private capacity and not in his role as president\n\nThere are filing deadlines that extend past the election. [Source](https://sourcenm.com/2024/09/06/trumps-jan-6-case-to-extend-beyond-election-day-under-timeline-laid-out-by-judge/)", "label": 0}
{"text": "Will Levis...I think", "label": 0}
{"text": "Wait... so if I buy MSFT shares, I could make a proposal to bring back Clippy?", "label": 0}
{"text": "Given Merchan’s distaste for interfering with politics, my guess is that, should Trump win the White House, he’ll be sentenced to a brief probationary period where the system will bend over backwards to allow him to perform his duties as president.\n\nAs for whether he could even be taken into custody for violating his probation once President… That’s a more interesting question, and it could get ugly.", "label": 0}
{"text": "Normal jobs don’t affect people with vast power. I’m hoping he just didn’t want to give them another tool to attempt to overturn the election. If Trump wins, he’s not going to be sentenced. If he loses? A few months aren’t much as long as he’s actually sentenced.", "label": 0}
{"text": ">You seem to want to give these folks a pass on criminality and I would rather they are treated as everyone else. I doubt that can be reconciled.\n\nYou can't be reconciled because you didn't read, and you don't understand.\n\nYou can't logic someone out of a position they didn't logic themselves into.", "label": 0}
{"text": "Don’t argue with them. They are likely the type of person who watches the boys and misses the point. They saw the 34 convictions and focused on weather or not he stole then backed out when you cited evidence. That’s the kind of idiocy people like trump want because they are stubborn and stupid. Trump is the final boss of the southern strategy, it’s just instead of it just being “we are the party that welcomes racists” the tent expanded to all of the worst and their dog whistles got more nuanced.", "label": 0}
{"text": "Because they're black and that 1/3rd who loves Trump is the same exact 1/3rd that hates black people. And even if they're flawless, that 1/3rd will never vote for black people regardless of any other aspect about them.", "label": 0}
{"text": "he got a loan and paid it back.  no crime there.  If he didn't pay it back on time, he would of faced financial penalties.   no reason for the government involved.  These types of financial transactions happen everyday.", "label": 0}
{"text": "Can you cite where Kamala Harris said that?", "label": 0}
{"text": "Oh pick me pick me! I have the answer, pick me!!\n\nThis country lets the rich do whatever the fuck they want with no reproccusions whatsoever 🫠", "label": 0}
{"text": "OP might be disingenuous or just out of touch. Far too many people haven’t been paying attention out of a general distaste for politics, even though it’s ostensibly one of the most personally impactful aspects of modern life.", "label": 0}
{"text": "Why don't you hold your breath until that happens?", "label": 0}
{"text": "It has nothing to do with affecting the outcome of the race. The judge doesn't want it to hurt him politically. He's a coward. Trump should be locked up.", "label": 0}
{"text": "We know you are. Treason is MAGA’s rallying cry.", "label": 0}
{"text": "no u 😂", "label": 0}
{"text": "He would surely pardon himself.\n\nHe was convicted by a jury of 12 Americans. If a jury of 200 million now decides to give him the power to pardon himself, that's how it goes.", "label": 0}
{"text": "I googled it and read an explanation of the statute of limitations. I don’t buy that a judge is going to do something overtly illegal like allowing prosecution of a crime when it’s not legal to do so. I also don’t buy that Trump carefully follows the law.", "label": 0}
{"text": "It's not just them. There is an entire radio, book, television \"news\" industry built just to do this. They watch it 24/7 and it's like an anger/fear addiction.", "label": 0}
{"text": "no thanks switch it around and ud want it to not change if it benefited ur party", "label": 0}
{"text": "Our justice system is weighted in favor of wealth and power.", "label": 0}
{"text": "He is rich, simple.", "label": 0}
{"text": "What are they gonna do if he gets elected? Are they gonna arrest him, and get accused of staging a coup, or are they just gonna shrug their shoulders and let him pardon himself?\n\nThey should just bite the bullet and arrest the guy.", "label": 0}
{"text": "This balance of power shit is wild. \n\n\nIf we're talking consenting adults, you're just being weird.", "label": 0}
{"text": "Nah, if Trump wins he won’t have the balls to throw him in prison. \n\nAnd it wouldn’t matter if he did, anyway. He’d still be sworn in next year.", "label": 0}
{"text": "Trump has talked about locking up his perceived enemies (Americans) since 2016.  Trump said it.", "label": 0}
{"text": "Yep. They never planned on a Pure Sociopath.", "label": 0}
{"text": "Isn’t it fairly normal to get what charges you can to stick so that it is easier to charge them with the larger crimes? I’m going to be honest I have no idea if this is true, I’m on prescription flu medication and this is what my brain is telling me to comment right now…", "label": 0}
{"text": "He tested the system by working for McDonalds. They hired him, so he's good to go with leading the free world as the President of the United States.", "label": 0}
{"text": "Luck like that doesn’t exist. He appointed her, suspecting he’d be brought up on charges in that Circuit.\n\nHe did it all, and got away with it.", "label": 0}
{"text": "Did you watch the appeal hearing on the Letitia James case and listen to what transpired during it? It's online. You can do it whenever you want.", "label": 0}
{"text": "It's also a pretty safe way to avoid, oh I don't know, an insurrection?", "label": 0}
{"text": "Then you're a naive fool. The district attorney who brought these charges campaigned on prosecuting Donald Trump. Not on bringing him to justice for anything he had done, but on finding something to charge him with and then doing so.\n\n\nIt's rank corruption and it should disgust the people of New York that their public servants are perverting the legal system with this blatantly illegal prosecution.", "label": 0}
{"text": "No, he got his family jobs in the White House instead.\n\nAnd also got Epstein’s “Deal of a Lifteime” DA, Alex Acosta, a cabinet post.", "label": 0}
{"text": "Interesting, Kagan was one of the architects of the Iraq war.", "label": 0}
{"text": "He also represents a repulsive set of values that nearly half the country considers American values, so it's kinda the question that's on the table right now. Are the American people honest, progressive and inclusive, or are we a nation of corruption, hatred, bigotry and greed? We shall see.", "label": 0}
{"text": "This is how I fear we already lost the battle. To his supporters this seems normal, that a felon pending sentencing should be hired to a four year contract.", "label": 0}
{"text": "Do you believe there's a deal Vance would agree to that Trump wouldn't agree to?\n\nYou might think Trump has a level of integrity that prevents billionaires from getting what they want, but I've seen nothing that leads me to believe this is true. If your goal is to be all smug and self-righteous, surely you can come up with a better conspiracy theory than \"Trump isn't actually owned by billionaires.\"", "label": 0}
{"text": "It can’t hurt you if you just shut your eyes, eh?", "label": 0}
{"text": "Maybe version 2 will have less bugs.  The upgrade is going to be painful, though.", "label": 0}
{"text": "This would be like you or I telling the judge “hey I’m interviewing for a really important job. Can you just delay my felony charges so it doesn’t mess up the interview process?” Lmao.", "label": 0}
{"text": "Answer: Once other rules for us at another set for the POS.", "label": 0}
{"text": "but only if he’s not in prison at the time", "label": 0}
{"text": "Didnt three scotus members vote yay for Bush's steal, and three more were on Bush's legal team?\n\n\nIf it gets to SCOTUS im convinced they'll give it to Trump", "label": 0}
{"text": "It's hard to imagine OP is out of the political loop on this particular topic when one of their most recent posts was them giving their opinion on how Obama would have handled his stalled Supreme Court nomination at the end of his term.", "label": 0}
{"text": "Must not be very good at it then if he was in office from 2016-2020", "label": 0}
{"text": "I don't know the answer to that. My Not A Lawyer guess is an appeal on a criminal sentence including custody time would likely happen while the person was serving the sentence in custody. But that's just semi educated speculation, I'm not sure of the actual answer.", "label": 0}
{"text": "The difference is that this is an elected position. The people decide who should and shouldn't be president. \nA company that's hiring someone gets to decide who should and shouldn't be hired... if they decide that their crimes don't disqualify them, then they hire them anyways.\n\nThe same goes for the presidency. We, the people, are the company, and we can decide to overlook his crimes and hire him anyways...and nobody can tell us otherwise.", "label": 0}
{"text": "I hope its soon !!", "label": 0}
{"text": "What's crazy to me is that getting elected is easy. You just have to *not* have policies that the entire electorate hates.", "label": 0}
{"text": "Seriously we need to vote! All of us… I know it sucks it’s a giant pain in the was all the way around but the Trump cultists are voting in droves and they are planning on cheating. WE. NEED. TO. VOTE! It’s the only way we don’t go back to all of this", "label": 0}
{"text": "You really think beloved, 90's era billionaire Donald Trump was lurking in a department store dressing room, waiting to r@pe the first woman who walked in? And she didn't come forward until 25 years later (she can't remember exactly) when it was time to write a book just before a major election, and her description of the event just happens to match the infamous 'Grab 'em by the pu$$y' quote that came out four years prior? Do I have that right?", "label": 0}
{"text": "Voting for Trump would also be a common tactic that could lead to a dictatorship.", "label": 0}
{"text": "None of them are Walmart. The second one was a school cafeteria worker who stole $1.5m from the district she worked at by over ordering food and selling it to pay for her gambling addiction. \n\nThe 3rd was a homeless man who broke into someone's garage looking for clothes. When he was arrested, he also was in possession of some quantity of meth. He got an indeterminate sentence of 18 months to 6 years for larceny. He also got an indeterminate sentence of 18 months to 10 years for the meth.", "label": 0}
{"text": "He doesn't have (and never have had) a normal job. \n\nHe sets the rules when he is his own boss. \n\nAnd you, the voter, sets the rules/requirements for a president.", "label": 0}
{"text": "I’ve seen cases where it wasn’t, but extent or level of custody could be a factor there too.  🤷‍♂️", "label": 0}
{"text": "I completely agree. I have major problems with the criminal legal system, but if you actually enforce laws equitably people can’t really complain as much. If any non-rich white person did what Trump did they would have already been in prison long ago, but delaying justice it allowed for everything get messier and now in the case the judge had an incredibly difficult decision to make.", "label": 0}
{"text": "Fuck the orange turd", "label": 0}
{"text": "I think the real problem is all media is owned by billionaires so despite all the obvious disqualifies, republicans will cut taxes for billionaires so they get tacit media approval. WaPo just dropped a story where it is believed Bezos kept them from endorsing Harris.", "label": 0}
{"text": "Look into the actual charges. They're not \"crimes he committed\", they're clearly trumped up charges. Far fetched allegations. Things that only Trump gets prosecuted for, but no-one else. The Democrats have indeed been weaponizing the justice system. Just look at the actual cases and think critically.", "label": 0}
{"text": "Likely that would make it’s way to the US Supreme Court through appeals.", "label": 0}
{"text": "Rules for thee not for me", "label": 0}
{"text": "It’s a setup.", "label": 0}
{"text": "The person holding the office needs to be able to pass a background check for various reasons,  including their financial liabilities and foreign contacts. That's a bare minimum and it wasn't applied. \n\n The fact that he used the supposed authority of that office to overwrite the recommendations of the national security council and give his daughter and son in law clearances even though they couldn't pass the background checks, is a problem and illustrates what I mean.\n\nSimply stating \"the president doesn't need clearance.\" doesn't address any of the failures in the way in which he abused the powers of that office,  does it?\n\nNor does it justify the asinine belief that simply by virtue of becoming president that one is responsible with matters of national security. If that's what you believe, then you're literally asking for a dictator type authoritarian with financial ties to US enemies such as Russia, to come in and sell national security secrets to pay down thier debts.\n\nOh yeah..that's exactly what happened. \n\nSee how fucked the whole system is.", "label": 0}
{"text": "Answer: all of the \"felonies\" that Trump has been \"convicted\" of are -pun intended- trumped up charges that the Democrats used in their massive lawfare scheme to try and attack Trump. If you do not believe me, look up the actual charges and ask yourself: \"Does this even make sense?\" or \"Are other people also getting such charges?\" or \"Should the government even be allowed to press such charges?\". Seriously: look at the actual facts of the charges, ignoring the media propaganda around the whole thing. The fact that you believe Trump has been \"convicted of 34 felonies\", which is no true; is a clear example of how people just follow whatever the media is selling them.\n\nAlso, ask yourself this question: \"Why is it bad for Putin to use his power to put Navalny in prison, but somehow we should believe that it's good when the Democrats use their power to try and put Trump in prison?\".", "label": 0}
{"text": "We DID decide…in 2020. He chose not to accept those results. So now we…let him do it again and withhold sentencing until after the election? \n\nMy brain hurts from all the stupid…", "label": 0}
{"text": "That’s what we are voting on, right?", "label": 0}
{"text": "It went to the appeals court few weeks ago. And honestly it does not look good for the people that want Trump in jail. The 6 judges were grilling them and they were asking not to be sanctioned by the end of it. It’s on YouTube if you want to watch the whole thing.", "label": 0}
{"text": "Only if you also stick your fingers in your ears and go, \"I can't hear you, I can't hear you!\"", "label": 0}
{"text": "“Answer” 1x34", "label": 0}
{"text": "I know this is unpopular. But it makes sense. One of the biggest things in legal ethics is avoiding the appearance of impropriety.  Judges should always do their best to do this. And in this case it’s a lose/lose unless the prosecution and defense both agreed to whatever the sentence would be. \n\nIf he was sentenced to probation people would say it’s him trying to influence the election and show this crime is minor.  If he got jail time, they would say he is over sentenced and they are trying to keep him from being president.", "label": 0}
{"text": "Judges hate this simple trick! Accused of a crime but don’t want to go to jail? Announce that you’re running for President of the United States and based on precedent they *have* to let you run around free until the election!", "label": 0}
{"text": "There are no mitigating circumstances in this case that warrant delay. You cannot name one other than maybe the fact that he wins and there will be a Constitutional crisis around whether or not the President can go to jail while in office.\n\nImpact on the election is of no worry. He already is convicted and his criminality and sentencing are independent of his running for office. He can run for office from jail. That’s okay and no one is saying he can’t. \n\nYou are simply giving these folks privileges that are no where to be found in our Constitution. You simply feel bad about it impacting their campaign. He is already convicted and it’s okay for it to influence the election.", "label": 0}
{"text": "No, I was wondering if you were being sarcastic. \n\nBut then it’s like I’ve asked you three times if you think Trump has ever raped someone and you won’t give me a straight answer. That’s so… suspicious. Like, why would that be hard?", "label": 0}
{"text": "The system is so broken that everyone is afraid of Trump.", "label": 0}
{"text": "Yes, but that still means he is ineligible but the Gov of FL may/has intervened on his behalf.", "label": 0}
{"text": "The same way it's hard for you to actually follow up on the cases against him before you make your decisions. You can go watch the prosecution beg the judges in an attempt to dodge sanctions for their overreach like everyone else, but you're content to believe the cases against him are legitimate. \n\nMy question is that if you can watch them get lambasted and try to weasel their way out of punishment and still believe the cases against him are valid, why should I take you seriously?", "label": 0}
{"text": "He will pardon himself. The we will have a felon for President, and no checks on his power. Nothing he does will be illegal (cuz he’s the President) and Democracy as we know it will be dead. He could jail or kill his opponents, and he’s said that’s what he will do. \n\nTbh, we’re going to see a lot of folks leaving the country. Those that stay will suffer, and cause suffering.", "label": 0}
{"text": "Answer: I know this sounds flippant but frankly people at his level of wealth and fame simply don't have to abide by the same rules that we do. Even if he does eventually get sentenced he won't see a day of prison time, not will he have to pay any fines out of his own resources.", "label": 0}
{"text": "You can take this back to the Nixon elections with the Republicans blatantly breaking laws to sway elections... Hell a lot of the same people back then are the same that got Trump elected and are still involved", "label": 0}
{"text": "Did no one noticed he'd changed product? Artificially tan, yes, but no longer orange..", "label": 0}
{"text": "Sure why not", "label": 0}
{"text": "I live in the area where that started, and we don’t tax food and clothes here, fwiw. I’m relatively satisfied with the level of benefits and services living and paying tax in this area afford me. Your employer pays social security & Medicare tax on what they pay you - would you prefer no public safety net for retirees? \nI don’t sweat paying taxes, but I want to see them used efficiently, of course, by actually making our society better, and providing the infrastructure necessary to making all this money it runs on. And I dislike tax cheats. Also, if you’re getting taxed federally when you die, you have it pretty good - like $12M good (less millions for the state threshold, maybe).\nI’m fond of the quote, “No man is an island” when it comes to this stuff, so I think we disagree in general. But none of this was the point. I find your “he didn’t break the law, and if he did break the law, it wasn’t that bad,” response to be very typical when it comes to this one particular man.", "label": 0}
{"text": "\\>Don't hate the player hate the game. \n\nBoth sides appoint judges and attempt to get their cases heard in their courts. But in Trump's case, all judges except 1 (Cannon) appointed by Democratic party weren't they?", "label": 0}
{"text": "Well we did elect Clinton know all about his happenings in Arkansas", "label": 0}
{"text": "Because there is like 30-50 different gigantic disqualifying things Trump has done so it’s not like my whole opinion hinges on this one thing. \n\nIt is SO WEIRD that you won’t just answer my question. Why?", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\nThank you for your submission, but it has been removed due to lack of context.  \n\n**Please see Rule 2** and repost with a **URL or a screenshot** (you can host it on imgur.com) **in your submission body** so that the users can better know what you're talking about and increase your chances for getting an answer.  **Feel free to repost once you find a URL.**  (Please remember to include the full URL: URL shorteners don't count.) Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "He's actually from New Jersey", "label": 0}
{"text": "He also won't face jail time even after sentencing.", "label": 0}
{"text": "If I were a lawyer my precedent boner would be hard af. I would point to this special treatment and delayed sentencing for every single case I had. They’re supposed to be no two-tier justice system, so with that same logic they should let my clients walk free for fucking years.", "label": 0}
{"text": "Idk if that is a real thing as I was in prison and in my state that isn't a thing we had very old people come in and die in prison all the time", "label": 0}
{"text": "https://www.youtube.com/live/ITeTOgoAtzE?si=K-xk4qTcD0gpj8Lq", "label": 0}
{"text": "Americans are the employer.  No one would hire him to work for them. His base are idiots.", "label": 0}
{"text": "Answer: it's going to be overturned on appeal and everyone knows it", "label": 0}
{"text": "Answer: ask Hunter Biden how it’s done.", "label": 0}
{"text": "But you refuse to accept that those 30-50 different gigantic qualifying things are all alleged by the people currently begging for mercy for overstepping, as well as their cronies.\n\nI did answer the question. Just not in the way you liked. I clearly said I believe he raped someone, insofar as Letitia James' case against him is legitimate. Now, considering you can watch the prosecution in that case sputter and fumble under questioning from literally before they can get their names out in the opening statement of the appeal court, the answer should be clear to you.\n\nMy point is that you didn't watch that hearing, even though it's available to watch, because you never follow up.", "label": 0}
{"text": "Yeah he co-founded PNAC which was formed to overthrow the government of Iraq, and dissolved when their goal was achieved. Many of his co-founding colleagues served in the Bush administration. Getting the people and politicians on board with the Iraq war was a key part of it.", "label": 0}
{"text": "ur the one tryna change precedent. Im not 🤷‍♀️", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\n---\n\nHello, your submission have been removed because the title isn't loopish enough.  Please repost and begin your question with one of the following phrases:\n\n* \"What's going on with\"\n\n* \"What is going on with\"\n\n* \"What's up with\"\n\n* \"What is up with\"\n\n* \"Why are people talking about\"\n\n* \"Why have people been talking about\"\n\n* \"What's the deal with\"\n\n* \"What is the deal with\"\n\n**Please see Rule 1**\n\nDon't forget to include a URL link for more context in the body of the post, and always end your question with a question mark.\n\n**If your title still doesn't work after using one of these phrases, be aware that you may be using the wrong type of apostrophe (known glitch with automod).  Just try reposting with \"what is\" instead of \"what's\".**\n\nThanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "I think not sentencing him like the criminal he is feels a lot more like election interference (which was his crime, btw) than letting him run free as if he's not a convicted criminal.\n\nI wonder if the judge figured the corrupt supreme court would interfere if he didn't delay the sentencing.", "label": 0}
{"text": "Maybe Congress will do something smart and add an amendment to the Constitution for requirement to be prez: no felonies.", "label": 0}
{"text": "Answer: everybody is afraid to put him in jail because apparently politicians can't be charged of crimes because of politics.", "label": 0}
{"text": "I should have known better than to comment on any of this stuff now. people's brains have definitely overheated and seeing all kinds of stuff everywhere in their heads.", "label": 0}
{"text": "This is how the fascists win.", "label": 0}
{"text": "Nope. \n\n1. Florida case: Cannon (appointed by Trump, ran out the clock on the case, now being considered for Attorney General as a thank-you.)\n\n2. DC case: Taken from Chutkan, sent to Supreme Court, 1/3 of which was hired by Trump. They gave him Full Immunity)\n\n3. Georgia: The Georgia Court of Appeals has “paused” the case until March 2025. The Court of Appeals was appointed by Republican Governor Brian Kemp.\n\nIt’s Masterclass in Corruption.", "label": 0}
{"text": "Sounds like a great way to set up a constitutional crisis . Also, I don’t agree with, but do understand how an investigation or trial could appear to influence an election, but if he is already convicted who cares? The election doesn’t change his guilt.", "label": 0}
{"text": "That's the most damning & succinct take on this whole sordid affair", "label": 0}
{"text": "This is the beginning of the Billionaire coupe", "label": 0}
{"text": "The voters are the ones who are tasked with that job in this case.", "label": 0}
{"text": "Yuppp. The “cute” and relatable mental illnesses and normalized, but anything outside of that completely changes the way others think about you. As a person with bipolar 2 I hardly ever talk about my personal struggles with my mental health because I don’t want to be perceived as “crazy” even though I have developed better stress management that most mentally healthy people since I’ve been forced to learn to cope.", "label": 0}
{"text": "Don't forget white.", "label": 0}
{"text": "He was also tried for crimes the average person would not be tried for. You know statue of limitations and all\n But please go on about how unfair it is that you can't lock up someone you don't agree with", "label": 0}
{"text": "founders didn't want to put too much restrictions on eligibility and instead wanted it to be up to the voting citizens to determine if someone was qualified, or if they get out of line in office, another branch (Congress) would impeach them... I can understand the reasoning, but man people are stupid.", "label": 0}
{"text": "Exactly...", "label": 0}
{"text": "I worry the stupid is just getting started.", "label": 0}
{"text": "The legal system protects Capital and their property. You're not Capital and you will never matter to them.", "label": 0}
{"text": "Comey enters the chat...", "label": 0}
{"text": "Which is remarkable because he seems to have collected a team of completely incompetent lawyers to represent him. The apparent bias at the Supreme Court level is lively having an influence in the lower courts. It doesn't look good for a judge when a superior court overturns your decision.", "label": 0}
{"text": "Well, sure. But the electorate doesn't line your pockets when you push to enact policies like \"kids who are 13 should be able to work night shift at a meat packing plant\" or \"your work can now calculate overtime on a 2-4wk basis instead of weekly so they can schedule you for 79hrs one week and schedule you for 0 hours the next week so you technically didn't get any overtime\" \n\n\nI grew up naively thinking that both parties WERE the same in that they both wanted the best things for the country, they just had different ideas on how to get there. I was taught that the Democrats wanted to get there by putting it all on the credit card, and Republicans wanted to save up and pay for it all in cash. But the endpoint of the trip was the same place.\n\n\nAnd, well, lol.", "label": 0}
{"text": "That's an amazing excuse. The arbiters of justice are basically saying they are willing to subvert the pillars or justice for the appearance of \"impropriety\"", "label": 0}
{"text": "People have the option to reject his for it", "label": 0}
{"text": "I asked my Trump voting coworker why these things do not disqualify Trump in his mind. All he had to say was that times are changing.", "label": 0}
{"text": "America is lost. \n\nRevolt.\n\nRevolt\nPut the people back in power.", "label": 0}
{"text": "Correct.", "label": 0}
{"text": "If he is some sort of gay, he’s definitely bisexual. I find it unusual that a homosexual man would sexually and physically abuse and coerce so many women. That just means his victim range is likely far wider than the public knows.", "label": 0}
{"text": "He did appoint her, but the judges are drawn randomly when cases are filed. So yes, it was luck that he got her twice. It’s not even really all that lucky, as there are 18 judges in that district. It’s also silly to say he knew he’d be indicted — he was still president and hadn’t stolen a bunch of documents yet.", "label": 0}
{"text": "Affecting the outcome … like as if it’s the court’s fault and not, yaknow, the felon messing up his own chances.", "label": 0}
{"text": "The DA consented to the request to adjourn sentencing.  Merchan would have looked terrible if he ignored that and sentenced him.  That wouldn’t happen if both sides agree to adjourn.", "label": 0}
{"text": "well if some states are Gerrymandered to fuck the the popular vote is the only that should count", "label": 0}
{"text": "He is decent at it.\n\nI didn't pay off a porn star. My lawyer did without my knowledge.", "label": 0}
{"text": "That’s not even real, it’s like when people used to talk about agenda 2030", "label": 0}
{"text": "So you’re saying that Trump pulled a 7% chance TWICE?\n\nI just ran the numbers. There is a 1.5% chance of that happening. 😂", "label": 0}
{"text": "Answer: They are all charges whose sole aim was to get the words “convicted felon” into the air before the election. Of course the right judge/jury/jail combo *could* have resulted in actual prison time (maybe even an Epstein), but cooler heads prevailed. The legal aim was never “justice,” it was to prevent a “threat to democracy” from becoming President by means other than letting the great unwashed vote as they like.\n\n\n\nDetails: The loan charges are lighter than air and are under appeal - even NY appeals courts do not want to set precedent that a victimless financial crime can prosecuted. The porn star charges were so flimsy the judge asked the jury to ignore the fact there was no federal felony crime tying all the misdemeanors together.\n\n\nWhy it Matters: Whetting the appetite of online hate for 45 with political chicanery has the unfortunate habit of creating unsatisfied haters (see Muller Report, Zelenskyy Impeachment, taxes, etc) who are, like a teased starving dog, furious and out of control when they don’t get their meat (see assassination attempts).", "label": 0}
{"text": "The bourgeoisie are not subject to the laws governing the working class.", "label": 0}
{"text": "Answer:  Because its utter BS charges that will be overturned.\nThe charged him for one alleged crime, but made it 34 because there were 34 checks a crime of which no one was harmed and no one was ripped off and the bank was perfectly happy with the transaction. \n\nAnd I am not a Trump supporter nor do I support Harris, I am just not an idiot", "label": 0}
{"text": "That's because we, the American people, are the hiring manager and we all get a say.  I'm voting against Trump even though I'm a Republican (although I would be called RINO by the Magats) and I think him getting elected is the worst thing that could happen to the country but I agree that convicting him election would be wrong.    Bad optics even though he is guilty as fucked.   \n\nNow after the election, he is going to lose and be is going to get a harsh sentence, but if you look at other rich people that have been convicted it's very rare to see any hard time.  At most it's a few months at club fed, most often than not it's just house arrest or just probation.   Trump won't be an exception.", "label": 0}
{"text": "I will, for one. I used to when they were more moderate, and would be happy to again.", "label": 0}
{"text": "Answer: Rich people aren't subjected to the same rules as us.", "label": 0}
{"text": "I mean it’s not like rape comes with evidence beyond he said/she said tho so it’s not an anomaly. That’s what rape trials are, and only the most provable cases even get to trial. It’s so hard to prove bc it can always be explained away as consensual. \n\nChanel Miller also sold a book all about her rape but we know in that case there were two Swedish (I think) witnesses who pulled the rapist off of her when they saw it happening. So it’s not like rape victims don’t like to write books about it. People wrote about things they experience. It’s a nice justice to make money off the guy who traumatized you. I cannot fathom why people vilify this. \n\nMost people don’t believe any rape victims, it’s not just trump. It’s very easy for me to see why people don’t care that all evidence points to Trump being a serial rapist bc they do it with other men all the time. \n\nI still ask about it bc it’s still shocking and unfathomable to me that people think this way.", "label": 0}
{"text": "I think it has exceeded inflation as an investment in the past decade", "label": 0}
{"text": "lol some derpy goal by think tanks.  It’s like me telling you if you vote for Dems that the IMF is going to have you living in mega cities and eating bugs and YOU WILL BE HAPPT", "label": 0}
{"text": "I'm just an outside but... this seems like the sort of thing that should really have been sorted BEFORE the election? Given that he's running in it? What the actual fuck.", "label": 0}
{"text": "Those goalposts got shoved around pretty quickly.\n\nYou go from “Trump appointed all of the judges handling his cases” to “Trump appointed one of them, and I’m going to draw nonsensical connections to other judges so it doesn’t look like I was completely wrong.” You forgot Merchan entirely.", "label": 0}
{"text": "But he’s a dictator right?  Once he declares a state of emergency and martial law he can change the rules.", "label": 0}
{"text": "Man, all the neocons against Trump, Cheney's coming out publicly, even McConnell speaking out...yet W is silent.  \n\nHis silence speaks volumes.", "label": 0}
{"text": "The fact that that’s your effort to be clever or funny is so cringe", "label": 0}
{"text": "Answer: He's waiting to be sentenced, end of story it's the way the justice system works.\n\n\nThis used to be a great sub, these questions are just getting dumber and dumber. You realize we have MURDERERS out on bail waiting to be sentenced right?", "label": 0}
{"text": "If you think your house is worth 1 million and the bank gives you a million then you pay back the bank with interest. Then years later the state said “smallletter” your house was only worth 500 k not a million like you claimed in documents, so therefore you caused the banks harm ? And defrauded them. That’s your position?", "label": 0}
{"text": "Answer: because it's all bullshit!", "label": 0}
{"text": "Wisdom of crowds", "label": 0}
{"text": "Answer: He was found guilty by the jurors but, the Judge has not yet done sentencing. \n\nSentencing is supposed to happen in November, after the election. IMO, the sentence (which could be jail time, or a fine) will be determined if he wins the election.", "label": 0}
{"text": "So what has he gotten done then? His biggest recent accomplishment was pushing against a bipartisan border bill, he's outright said he doesn't have a plan for the country, his Healthcare plan has been releasing in \"two weeks\" for 8 years now, and he's currently campaigning on increasing tarrifs, which economists agree will devastate our economy if he actually implements.", "label": 0}
{"text": "170 of the policies in project 2025 are in Trumps platform if you can call it that.  https://www.cbsnews.com/amp/news/project-2025-proposals-trump-policies/. it was written by folks who worked for Trumps admin.  Hes on video saying Heritage foundation was working on writing up his policies for round 2 lol.  Hes a very very bad liar i really do not understand people who still believe him.", "label": 0}
{"text": "That is not how the United States government works.", "label": 0}
{"text": "Hard disagree. I don’t think the fraud case he was convicted on would’ve been brought- I think it’s bullshit, frankly- but the rest most likely would have.", "label": 0}
{"text": "Thanks to the [Streisand Effect](https://en.wikipedia.org/wiki/Streisand_effect), we are now much more aware that the editorial boards of those two papers *intended* to publish endorsements for Harris, and innumerable news outlets are now covering this as a news story, resulting in a farther reach than the endorsements would have had in their home publications.", "label": 0}
{"text": " that is not what hearsay is. That is testimony. you realise the difference right? Donald trump praised Hitler In front of Kelly's face. Kelly didn't hear about it after the fact from someone else.\n\nthe list of people who have since turned on trump includes but is not limited to: mike pence, mark Milly, John Bolton, John Kelly, James mattis, bill barr, Mark Esper, Rex tillerson (I may have misspelt some names). They are all high profile republicans who served trump in his first term and were often the first pick for him. And they have all gone from staunchly supporting trump to saying anything from \"he is unfit for office\" to \"he is a Hitler praising fascist\". at what point do you have to have so many people say Donald trump is not a great guy for it to go from \"hearsay\" to \"ok maybe this dude is not that great of a guy\". I mean he is literally an adjudged rapist.\n\nWatch legal eagles video: the most important election of our lifetimes. It is a good overview on why Donald trump is an existential threat to the rule of law and democracy in America.  https://youtu.be/6bTpbDL5dcg?si=C6zApetYizwOMXnl\n\nAlso you ignored the point about republicans wanting to strip legal protections from minorites. Ok bye 👋", "label": 0}
{"text": "That is bullshit, it absolutely should affect the outcome.", "label": 0}
{"text": "Disingenuous little fella, aren't you?", "label": 0}
{"text": "Right. We’re the employers. It’s on us to reject him for these offenses.", "label": 0}
{"text": "> The judges have essentially decided to let the voters decide.\n\nThe jurors already decided.  He should be in a cell.", "label": 0}
{"text": "And maybe because the crimes he was convicted of were non-violent in nature? They’re not like, oh I don’t know, P-Diddy’s alleged crimes. ", "label": 0}
{"text": "No one will ever convince me that democrats aren't in on this shit at least partially. If a president is truly able to sit in office after being convicted of felonies and trampling all over other laws such as the emoluments act, talk with foreign heads of state off record and all the other things that everyone says they THOUGH were covered, but Trump proved otherwise... If people are not scrambling to truly close all of those loopholes, they are in on it. Period.", "label": 0}
{"text": "That's how a lot of things work in Congress. It was designed to be hard to get stuff done so we wouldn't have massive swings of power every election cycle.", "label": 0}
{"text": "Hey now he's got \"a concept of a plan\"..../$", "label": 0}
{"text": "Doubt he's in the actual game, but I remember him from Black Ops 2 ads:\n\n\nhttps://youtu.be/H7tym8c7FWE?si=q0M0XLmFInNSNwe0\n\n\nOn the COD wiki I see that he's been in other Black Ops games ads too:\n\n\nhttps://callofduty.fandom.com/wiki/The_Replacer", "label": 0}
{"text": "Rich people tend not to go to jail until they fuck with other, more powerful rich people’s money.", "label": 0}
{"text": "Let's all hope that he loses in 11 days and Republicans finally give up on this worthless pawn. I hope he rots in jail with every single penny and property stripped from him.", "label": 0}
{"text": "The hiring managers for the job of president are the people of the United States. If this is a problem for the people, they will vote accordingly. If it is not, then they will not.", "label": 0}
{"text": "He's renovating the swamp and stiffing the contractors!", "label": 0}
{"text": "The judge is either incompetent or corrupt for making such a moronic decision. By waiting he is actively practicing election interference against Harris. He should be removed from his position", "label": 0}
{"text": "His felonies are wild in my opinion but what's even cracker in my eyes is the Classified Documents mishandling (and possible distribution). 10yrs to life. The military doesn't fuck around with that shit. If **any** member of the military would do that their ass would be grass", "label": 0}
{"text": "The real question should be, \"Why is everyone in this sub asking such loaded questions so obviously fishing for the answer they're already aware of\"?", "label": 0}
{"text": "With the hearing with my own ears, I'm referring to him talking at his rallies and threatening to turn the American military on Americans.\n\nRegardless, does it matter? He's shitty enough without the addiction of that.", "label": 0}
{"text": "“I’m not a sheep like the rest of these idiots” said the sheep", "label": 0}
{"text": "> Merchan said on Friday he now planned to sentence Trump on Nov. 26, unless the case is dismissed before then.\n\nWhat? Since when can a case be dismissed post conviction?\n\nSure, it can be dismissed upon appeal, but you have to finish sentencing before filing the appeal.", "label": 0}
{"text": "Born in 92. Sounds about right", "label": 0}
{"text": "They only want to ignore the inconvenient parts of the constitution. They like the “send to Congress” part.", "label": 0}
{"text": "He wanted to show his decision wasnt affected by politics. And to do this, he allowed politics to affect his decision.", "label": 0}
{"text": "Corruption. Right wing. Russian traitors. People who want to take us back a few hundred years socially, economically, mentally, and lawfully.", "label": 0}
{"text": "They are literally his biggest policy advisors. I’ll let them tell you themselves…\nhttps://www.heritage.org/impact/trump-administration-embraces-heritage-foundation-policy-recommendations", "label": 0}
{"text": "Calm down babes. P Diddy’s crimes overshadow Trumps as far as violence. Hell, he needs to be charged with the murder of his children’s mother, Tupac’s murder & Biggie’s.\n\nAnyway, white privilege is the reason why Trump is where he is. Had his daddy been black, he wouldn’t have had access to the money that made him an extremely wealthy slumlord. That’s how Trump’s path to power started & you know that… but keep lying to yourself.", "label": 0}
{"text": "That is fucking crazy.", "label": 0}
{"text": "because at the end of the universe, the big bang will occur again and everything that has ever happened will repeat again. therefore, technically anything is in the loop.", "label": 0}
{"text": "Right it's insane to think that we hold them to a lower standard than a manager at McDonald's has for their employees. \n\nWe should hold politicians and our government as a whole, to a higher standard, not a lower one.", "label": 0}
{"text": "On top of the other comments, sentencing also involves the defense and prosecution making arguments over a proper sentence, as well as the opportunity for the victims of the crime(s) to make impact statements to affect sentencing as well. Those things take time and would be weird to prepare before a conviction is secured.", "label": 0}
{"text": "Why?", "label": 0}
{"text": "You can't stand still on a moving train.", "label": 0}
{"text": "Inexplicably*?", "label": 0}
{"text": "Just look at how combative school board meetings have become. They are applying aggression and violence to everything remotely political. And turns out a lot of people would rather quit than deal with it.", "label": 0}
{"text": "And people convicted of a Felony loose their right to vote. Trump’s been convicted of Felonies ( plural) and he’s already voted for his self in Florida. Where’s the judicial system??? He isn’t president.. at least not yet.", "label": 0}
{"text": "Damn that’s crazy.  I guess you’re going to be pretty upset when you wake up on Nov 6.", "label": 0}
{"text": "Almost certainly, given the preliminary hearing.", "label": 0}
{"text": "You mean Agenda47? Trump's actual plan on his website?", "label": 0}
{"text": "You mean agent 47?", "label": 0}
{"text": "The American people are the ones doing the hiring, so it’s up to us to look at his record (criminal and otherwise) and decide if he is a good fit for the job. To many millions, the answer is obvious, but to many other millions, up is down, the sky is red and a convicted felon with a history of sexual assault who conspired to overturn a fair election and, failing at that like he does everything else, led an insurrection is their idea of a strong and trustworthy leader.", "label": 0}
{"text": "What are your thoughts about the editorial staffs resigning in protest of the owners who stopped these stories?", "label": 0}
{"text": "It's because the white collar crime just means you made the mistake of getting caught. The blue collar crime is to keep the poors from wrecking the sweet deal the non-poors have set up for themselves.", "label": 0}
{"text": "If you believe that Trump verdict was already decided before there was a single day spent in a Kangaroo Court orchestrated for the sole purpose of allowing the democrat nominee to be able to call Trump a convicted felon during the campaign, then Trumps conviction only increases your desire to vote for him. \n\nTrump is extremely unique as he thrives on negative publicity. Not being able to comprehend this has confused many people who can’t grasp why Trump is still popular or why anyone would still vote for him.", "label": 0}
{"text": "Answer: It's nothing.  It was implemented by Reagan in 1982 and remains virtually unchanged.  They are taking parts out of context to stir the pot.", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\nThank you for your submission, but it has been removed due to lack of context.  \n\n**Please see Rule 2** and repost with a **URL or a screenshot** (you can host it on imgur.com) **in your submission body** so that the users can better know what you're talking about and increase your chances for getting an answer.  **Feel free to repost once you find a URL.**  (Please remember to include the full URL: URL shorteners don't count.) Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "Enough people see his behavior and bullshit OK that it doesn’t make him unhireable.", "label": 0}
{"text": "I am so tired of hearing about this magical plan that will uproot 250+ years of checks, laws and balances, and I'm even more tired of the people who think it can actually happen", "label": 0}
{"text": "Wasn't it proven she never worked at any McDonalds?", "label": 0}
{"text": "Who's \"they\" and is the judge who heard all the evidence one of \"them\"?", "label": 0}
{"text": "I don’t know, the civil rape case first required a temporary waiver of the statute of limitations.", "label": 0}
{"text": "The highest level of the justice system currently cannot be even be trusted with following the constitution. It's wholly and openly corrupt.", "label": 0}
{"text": "“Checks, laws and balances” = “Deep State”\n\nSample question: Do you think any person in the United States should be able to have their criminal case be handled by a judge that THEY HIRED?\n\nIt’s already broken, my man.", "label": 0}
{"text": "bruh, this dude said \"I'll eat your face and kill my mama\" 😳 what in the hell?! Goddamn", "label": 0}
{"text": "> It was designed to be hard to get stuff done.\n\nBut it wasn't designed to be ludicrously stupid. The courts have been bolting on massive amounts of stupidity, under the pretense that had been originally intended to be utterly useless.  It shouldn't take another separate act of congress to enforce every jot and tittle of the constitution. That's asinine.", "label": 0}
{"text": "Answer: you missed the 2016 and 2020 election, the failed “legal” efforts by the trump republicans to overturn the 2020 election results, the trump republican efforts stop the 2020 election certification, and the trump republican January 6th 2021 insurrection /  attempted coup.\n\nSome Republicans believe they should be atop a hierarchy of peoples, do not like rules, the rule of law, and functioning government.", "label": 0}
{"text": "And, as much as I want to rip on Trump, I think the judge's decisions is 100% reason.\n\nMy understanding is the crimes Trump committed rarely result in jail sentences, anyways. I think it's completely fair for a judge to assess the situation and say \"well, the voting public knows he's a felon. If he's elected to office, that's larger than me\".", "label": 0}
{"text": "Hopefully whichever Gaul he’s got has some magic potion on them. Otherwise Asterix will have to go save them.", "label": 0}
{"text": "This is the fourth time today someone's tried to \"gatcha!\" me with this one and everytime I respond with \"Who would win, the very foundation and laws our country made, or one court case?\"\n\nAnd everytime so far that's shut them up", "label": 0}
{"text": "Absolutely. I think a lot of people are confused because we’re not used to the idea that a felony wouldn’t result in a jail sentence. ", "label": 0}
{"text": "I was hired by a bank to do online customer service support.  When they did a background check and found out I had declared bankruptcy several years prior, they rescinded the offer.", "label": 0}
{"text": "So we were always supposed to believe that editors and leaders in these media outlets were unbiased, fair, and non partisan, yet they're the same people willing to quit their unbiased news jobs if their employer doesn't support Kamala? hmmm", "label": 0}
{"text": "The fact you use cringe is cringe", "label": 0}
{"text": "No, she didn't put it on her law school/law employment resume because it wasn't relevant. Conservatives use that to \"prove\" she never worked there.", "label": 0}
{"text": "interesting huh.", "label": 0}
{"text": "Why the fuck shouldn't it affect the outcome of the election?", "label": 0}
{"text": "What? What are you talking about?", "label": 0}
{"text": "Thank you.", "label": 0}
{"text": "I'm saying that it's much, much, MUCH easier for a single court case to get overturned, vs every single check, law and balance that founded this nation over 250 years ago", "label": 0}
{"text": "What's wild is that having a criminal conviction is going to derail your chances of getting a security clearance to work in the White House but apparently not if you're elected:\n\n>E4.1.6. Disqualifying Criteria\n\n>E4.1.6.1. Conviction by court-martial or imposition of punishment for a serious offense under Article 15, UCMJ, reference (e).\n\n>E4.1.6.2. Administrative separation instead of court-martial.\n\n>E4.1.6.3. Frequent arrests by law enforcement agencies, including driving while intoxicated, which indicate irresponsibility or disrespect for the law.\n\n>E4.1.6.4. Conviction of a serious offense under State or Federal law.", "label": 0}
{"text": "It doesn't matter, we are talking about the leaders at the company. \n\nYou're just denying the reality. They're willing to lose their job and livelihood because their employer won't endorse a candidate and it's the same people claiming they cover things fair and unbiased. Stop ignoring the thing in your face for an excuse.", "label": 0}
{"text": "So basically, if he loses they can punish him, but if he wins they're out of luck.\n\nMaybe a party should not nominate someone guilty of felonies if they want to win the election.", "label": 0}
{"text": "ANY shareholder\n\n\nBe the change you want to see in Microsoft!", "label": 0}
{"text": "I didn’t say it was easy. But it’s obviously doable.\n\nWe were exactly one Mike Pence away from the election of 2020 being thrown out, and Donald Trump remaining in power. \n\nThe gaslight of “It can’t happen here” is forever dead. Not that it ever should have been given credence to begin with.\n\nEmpires fall.", "label": 0}
{"text": "Talk about Necro posting", "label": 0}
{"text": "The way the writers of the constitution saw it, if you can't get 2/3rds of congress to agree, then it's not clear enough, and the decision is up to the voters. I think that's a good thing. If the government had the power to remove candidates by a simple majority vote or some bureaucrat making a decision, then it would be abused beyond belief. Trump would have made Biden intelligible a day before the 2020 election and would have won by default.", "label": 0}
{"text": "James, the woman who ran her campaign on \"getting trump\" is the only them, and a jury is a box full of dumb people, who will believe the best story. They are not lawyers. That's why these sham trials don't hold up in appeal.", "label": 0}
{"text": "Ah, the old “Overton Window” gaslight.\n\nAnyone who says “I’m a moderate, I’m a classical liberal, I’m not far-right! The center is considered far-right!!”, ask them one question:\n\n“As a Moderate, which American politician is TOO far-right for you?”\n\nThe reaction will be this:\n\nSilence. More silence. Then…\n\n“I mean, there ISN’T really a far-right. I mean, labels are stupid.”\n\nEVERY. SINGLE. TIME.\n\nTry it, and check out the result. See if I nailed it.\n\nP.S.: I like to follow up with the old line… If you look to your right and can’t see anyone, you’re far-right.", "label": 0}
{"text": "Cruelty is the point, my friend.", "label": 0}
{"text": "Well the thing is, when those red states joined the union, that was the deal. If the deal was “come join us and give up all autonomy because our population is bigger than yours” they probably wouldn’t have joined. Going back and changing the deal later isn’t all that democratic either.", "label": 0}
{"text": "Watch episode one of Handmaids Tale.", "label": 0}
{"text": "I’m not misinformed.  It was a TEMPORARY waiver for 1 year.", "label": 0}
{"text": "She and her new AG should also call out Merrick Garland for his failure to aggressively investigate and prosecute all the crimes associated with Trump and his acolytes in a TIMELY MANNER. He dragged his heels for two years to appear impartial and is too stupid to realize that choosing to ignore their behavior as an AG is a far more destructive ***and*** partisan act.", "label": 0}
{"text": "You very much are if you believe that they did this just to fuck trump. You’re literally making up ideas in your head that have absolutely no basis in fact. That’s misinformed.", "label": 0}
{"text": "Lets not forget when he told kelly nobody wants to see the wounded, dont bring them here, it makes me look bad.", "label": 0}
{"text": "I couldn't care less about thar case. Asking GA to find votes for him,  hiding classified docs, and J6 are so much more important.", "label": 0}
{"text": "Nevermind the fact that delaying it ALSO AFFECTS THE OUTCOME", "label": 0}
{"text": ">we are talking about the leaders at the company.\n\n\nNo. We aren't. The editorial staff are not the news editors. They write *opinion* pieces.", "label": 0}
{"text": "I believe the correct term is Federal Pound-Me-in-the-Ass Prison", "label": 0}
{"text": "I still hope for the 45 presidential library, cell block, and court rooms that will fill the rest of his life with prosecutions and suits. Every minute detail needs to be examined and studied for centuries...\n\nThis one wants a transparent drain pipe to go through his cell from a visitor toilet above.", "label": 0}
{"text": "Answer: They're first time non-violent felonies. He will be sentenced later.", "label": 0}
{"text": "pretty unlikely for an 80 year old to go to prison in the first place", "label": 0}
{"text": "I think the theory is that the voters will take this into consideration when they go into the ballot booth.\n\nClearly they have very high regards for the average voter.", "label": 0}
{"text": "Fortunately he wasn't, he's extremely incompetent and the US actually has some robust controls against wannabe tyrants in the presidency, unfortunately it seems he and his handlers may have learned a few tricks since last time, and it would still be quite worrying if he somehow came back into any kind of power.", "label": 0}
{"text": "You forgot white.", "label": 0}
{"text": "Sadly the fact is being a felon outside of treason or removed from office as a president (possibly all positions in politics) are about the only \"criminal\" things that will get you barred from running as president again. You can even run for president from prison, it doesn't matter the crime either (outside of the aforementioned ones)", "label": 0}
{"text": "Like we are done he won", "label": 0}
{"text": "To avoid the deep state conspiracy theories. When he loses he’s done for.", "label": 0}
{"text": "And he only has half a decade to do it, with a major cult following and some very power hungry people by his side in positions of power. I don’t agree with the “black people and women will become slaves” point some people make, but it is genuinely terrifying how possible it is that hundreds of millions of lives will be negatively affected in irreparable ways. And one COULD say “we could undo it!” Yes we COULD but it’s harder to clean a room than it to throw shit on every surface, and by the time you’re halfway through cleaning, there’s another person trying to gain votes so they can hurl shit on Americas walls", "label": 0}
{"text": "Trumpies don't care what he does, he could molest a literal child on camera and they would blame the child still. They don't care what he does, because he's their messiah", "label": 0}
{"text": "Trump was charged with felonies for *attempting to cover up* campaign finance violations. \n\nIf he had not attempted to cover up the crimes, maybe it would have resulted in the same type of fine.", "label": 0}
{"text": "Just got denied a job for dui 4 yrs", "label": 0}
{"text": "The world needs a new acronym. How about JTIC because jail time is coming for this fucker.", "label": 0}
{"text": "Getting away with, he has been enabled by others his whole life.", "label": 0}
{"text": "> Microsoft apparently already holds BitCoin in its assets\n\nI have a suspicion that is leftover from the time MSFT was (*very briefly*) accepting Bitcoin as a payment option.", "label": 0}
{"text": "So that in the case he wins, he can claim presidential immunity?", "label": 0}
{"text": "This isn't like oh hey, we disagree with our employer... they're quitting their jobs over this. Even of its opinion piece writers it's clear there's bias.", "label": 0}
{"text": "It has, if you bought 1k in 2014 it would be worth 70k now. Past performance has no bearing on future performance though.", "label": 0}
{"text": "That whole angle makes me sick. When will the 11th get off their asses and nuke her for gods sake.", "label": 0}
{"text": "> [Andrew Cuomo extended](https://www.usatoday.com/story/news/factcheck/2024/06/05/trump-case-statute-of-limitations-explained/73983592007/) the time limit to file charges in all criminal cases when courts were disrupted by the COVID-19 pandemic in 2020.", "label": 0}
{"text": "Yeah, we wouldn’t want the fact HES A CONVICTED FUCKING FELON so affect the Presidential race. \n\nThis is absolute lunacy.", "label": 0}
{"text": "As well as clarence thomas who was directing her", "label": 0}
{"text": "Dismissing a felony conviction on overwhelming evidence is batshit crazy.", "label": 0}
{"text": "MAGA\n\nMake\n\nAttorneys\n\nGet\n\nAttorneys\n\n\nRudy G did his fucking around and as of today has 5 days to find out when ruby freeman and shae moss take even the shirt from off his wrinkled child molesting fascist ass", "label": 0}
{"text": "Can you tell me what crimes he committed? I genuinely have no idea and am curious? I didn’t really follow any of that.", "label": 0}
{"text": "Not for rudy,.. all state defamation CIVIL case. Nothing can be pardoned. \n\nHeard by a federal judge only because of the multi jurisdictional nature.", "label": 0}
{"text": "I wish they would have tried to run the story before quitting…", "label": 0}
{"text": "If you think for more than 2 seconds that they (the GOP; federalist society judges; etc) are going to “allow the voters to decide”, i have beachfront real estate in Nebraska to sell you. \n\nThey are already cheating and brazenly so. They have cases already filed in battleground states claiming dead people are voting. The whole GA board of elections debacle also comes to mind.", "label": 0}
{"text": "Trump appeals to people of a similar intellect i.e. people on the South end of the bell curve.", "label": 0}
{"text": ">explaining that his decision to delay the sentencing is in part to avoid any appearance of affecting the outcome of the presidential race.\n\nIt should though....but hey...rules for thee, not for hee", "label": 0}
{"text": "the requirement of being president. They did not include having a (or many) felonies/felons. (Current law)\n\nCongress just (2023-2024)(most recent term) passed a bill, not to senate yet. about making it a “you can’t be president with felonies law.” (not signed into law YET)", "label": 0}
{"text": "People gloss over the fact that they said the two tiers above the Sabra tier were for “white people”. You can hear them say it themselves in the video. The only time they put a white person in the Sabra tier, they had to clarify it was because they thought that person would literally eat the hummus but otherwise the tier was “derogatory”—again, this was their own words in the video. This goes beyond whether or not they knew “sabra” also meant a “Jewish person living in Israel”. Even if they didn’t know the ambiguity of the word sabra, there are multiple other ways they made this about race/ethnicity; it was mean-spirited and then tried to feign plausible deniability when they got called out on it.", "label": 0}
{"text": "I suspect it’s more covering their asses if he wins", "label": 0}
{"text": "I would say \"inexplicably\" delayed.", "label": 0}
{"text": "Yea he can't run a casino, no shit he can't run a functional government.", "label": 0}
{"text": "Hopefully sooner than later am I right?", "label": 0}
{"text": ">YOU HAVE TO BE REGISTERED TO VOTE to be eligible for the cash prize. That is the illegal part.\n\nThat's not how the law works.  You have to prove the money is the motivating factor for people to register to vote (or to vote).  That gets into:  is it the primary factor?  Is it 51% or more?  Was it just one of many?  Only a few actually got money, so how about those who didn't?  Also, the vast majority of entries would be from people already registered.  So, the money plays no part for those people.\n\nThis was redacted by Planned Parenthood Action:\n\nhttps://www.instagram.com/ppact/p/DBg8eqMINBq/\n\nWhy was it redacted?  Bad taste, seriously turns people off the intended message, flies too close to violating the associations between PP, PPA, and PP and PPA's non-profit statuses:\n\nhttps://www.plannedparenthoodaction.org/about-us/contact-us\n\n\"IRC 501(c)(4), (c)(5), and (c)(6) organizations may engage in political campaigns on behalf of or in opposition to candidates for public office provided that such intervention does not constitute the organization's primary activity.\"\n\n\nAnyway the DOJ would need to take Musk's non-profit/profit organization to court, and prove violations.  Going after him could be a public relations disaster... with all organizations in line to be investigated.  This is something the DOJ only does if it's seen as politically advantageous for the people deciding to go after Musk.  It could easily be a trap.\n\nAnyway, my point is both sides do it.  Getting upset about one side while excusing the other side is plainly hypocritical.", "label": 0}
{"text": "Delaying sentencing also appears to affect the outcome of a presidential race.", "label": 0}
{"text": "No, Trump’s team knew that Democrats were voting by mail, so their votes would be counted later, and then they could allege fraud. \n\nSeriously, the depravity of Trump’s team is astonishing, and you can LISTEN to them plan it all here. It’s one of the most chilling things I’ve ever heard, especially the cronies laughing in the background…\n\nhttps://www.motherjones.com/politics/2022/07/leaked-audio-steve-bannon-trump-2020-election-declare-victory/\n\n“That’s our strategy, Trump’s just gonna declare victory. But that doesn’t mean he’s a winner. He’s just gonna say he’s a winner. So, when you wake up Wednesday morning, it’s gonna be a firestorm…Trump is gonna be sittin’ there, mocking, Tweeting sh*t out, “You lose. I’m the winner, I’m King.”… And If Trump is losing by 10 or 11 o’clock at night it’s gonna be even crazier. ‘Cause he’s gonna sit right there and say “They stole it”.\n\n- Steve Bannon, Oct. 31, 2020", "label": 0}
{"text": "His criminal conduct and consequences SHOULD affect the election because elections should not affect your punishment for committing crimes. There's no legitimate reason to avoid sentencing him.", "label": 0}
{"text": "Why? He wouldn't do any work. Just steal from the cash register and grope the women.", "label": 0}
{"text": "When Trump won in 2016, Amazon lost out on some huge government contracts that they should have been shoo-ins for and I think that Jeff believed that was retribution for the Washington Post endorsing Hillary and probably other negative stories as well, so he's keeping his head down in case Trump wins again.", "label": 0}
{"text": "Oh, the money will be paid.  If it isn't, Trump (w|c)ould be found in contempt and incarcerated until it was.\n\nI doubt it will ultimately come from his bank account, but it will be paid.", "label": 0}
{"text": "Their goal is a dictatorship. You don't get there by following the rules.", "label": 0}
{"text": "Can someone come remove all the sharp objects from my house for me, please?...", "label": 0}
{"text": "You know, it helps if you actually know what you're talking about before you talk about it. It's less embarrassing for you that way.", "label": 0}
{"text": "Expensive lawyers and a cult.", "label": 0}
{"text": "So if he gets sentenced after the election and if he were to win, would he be arrested as an active president or would there be something he could do to basically absolve himself", "label": 0}
{"text": "In the trial, they're normally not allowed to introduce any evidence of the criminal being generally a bad person or good person.  If you're on trial for robbery, they generally can't talk about past convictions for robbery, because they want it to be laser focused on if you committed THIS robbery. On the other side, they are generally no allowed to talk about you being a good person in the trial. The initial trial is focused on evidence that you did THIS crime.\n\nOnce they establish you committed this crime, the floodgates open on your life and everything good or bad you ever did is taken into account in sentencing.  That takes time.\n\nIf you want to complain it's taking too much time, I won't disagree. But IMO excluding \"good person\"/\"bad person\" decision from the establishment of facts is a good thing.", "label": 0}
{"text": "That's the constitution for you.  If the people and the electoral college vote for someone, there is very little that can stop them from becoming president.  Basically, just if they aren't actually a natural born citizen, or if they aren't old enough.  Or if they, having previously taken an oath as an officer of the United States, engage in insurrection or rebellion.  But other than that, not much really.", "label": 0}
{"text": "Basically because regardless of whats true or not, some people would be willing to literally go to war if trump was put in bars before the election - theyve already proven this.\n\nSovereignty lies with the people. The people need to enforce our own laws by holding people accountable by first, not voting him into office where he can pardon himself. Frankly if the american people vote him into office theyve democratically decided the law doesnt apply to him. Not much can be done in that case. Its not because hes a billionaire or a politician or whatever else, its because americans have decided they just dont give a shit.", "label": 0}
{"text": "The mental gymnastics his crowd goes through to point out he’s ‘like them’ is insanity. I lived in Florida for a year and they worshipped him. The pickup truck crowd. They would say he’s going to help people like them. A guy who never drove a pickup truck. A New Yorker who never did any real work, was born wealthy and has gold plated fixtures in multiple homes. I could never get a straight answer how sleekness like that even remotely related to someone portraying themselves as ‘rural’.", "label": 0}
{"text": "To be fair, Trump and the Bush family hate each other, but George P. Bush bent the knee to him.", "label": 0}
{"text": "**PLEASE READ ALL OF THIS BEFORE MESSAGING US:**\n\nThank you for your submission, but it has been removed due to lack of context.  \n\n**Please see Rule 2** and repost with a **URL or a screenshot** (you can host it on imgur.com) **in your submission body** so that the users can better know what you're talking about and increase your chances for getting an answer.  **Feel free to repost once you find a URL.**  (Please remember to include the full URL: URL shorteners don't count.) Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*", "label": 0}
{"text": "Biden has not increased the debt by nearly as much as Trump, that's not even an argument, lmao. You just can't tell me anything positive Trump has actually done despite claiming he \"gets things done\".", "label": 0}
{"text": "\"To avoid any appearance of affecting the outcome\"\n\nBut now he could get elected president and THEN be sentenced to jail. Brilliant.\n\nNot that I think the court system would ever actually put a famous, rich, connected white guy in prison, but the point still stands.", "label": 0}
{"text": "All it takes is getting elected, which is less than a month away. Then vice president takes over. If they have the same ideas about convincing people their loss is the lefts corruption, it could continue indefinitely. If P2025 is implemented, there will be more women and black people in jail for defying it, which is a good chunk out of the voter pool. On top of that the two term limit is more of a political rule than a legal one, and if it gets bad enough there’s not much stopping them from pulling a Putin and putting puppets in place, or being elected several terms in a row. It is not impossible, especially if they win this election. Something like this plan doesn’t just die, it will be fought for with tooth and nails, and we need to make our voices heard that it will not happen. Not like what you’re doing, “stop worrying, you’re all overreacting” but putting a foot down and saying “absolutely not” I wish people were using less name calling and body shaming to criticize right wing figures, because all it does is hurt their real points, but the simple minded will be simple, but fucks sake this is a serious issue and we shouldn’t act like it’s not", "label": 0}
{"text": "Because real people don't care about being classy. You're being fed a narrative that being classless disqualifies someone from being a leader, but that's just not true. People want a leader they believe will fight for them and fight against all the stupid noise. Trump is a master at making people believe he will do that, and that is why people love him. You don't need to agree, but if you don't understand it I suggest you think about it, and open your mind to why it's happening. Harris on the other hand is yet another politician that will not plainly speak common sense and instead speaks empty platitudes that may sound nice but give no confidence that she'll actually do anything meaningful.", "label": 0}
{"text": "It should be! I hope if Kamala wins, we change Presidential minimum requirements of a background check, psych eval of a large panel of multidisciplinary providers, you have to release your tax records. If you refuse, you are not eligible. If you couldn't get a job at McDonald's because you failed your background check, you can't run for President.", "label": 0}
{"text": "In the later years, he gave John Wick his car", "label": 0}
{"text": "By kicking it back to congress, they've made it such that the 2/3 majority only overrules the mandatory blocking, while the simple majority can just ignore their duty to block him in the first place.  The voters shouldn't have a choice here.  He shouldn't be on the ballot.  He's not eligible.  Congress never explicitly allowed him to be on it with a 2/3 majority.", "label": 0}
{"text": "Um, isn't making him do constant promos with sex workers worse than the exercise thing?", "label": 0}
{"text": "“Trumps gonna lock people up” (your words)\n“Trumps too incompetent that’s why he never did it” (also your words)\n\nDo you even bother reading what you comment before contradicting yourself lol", "label": 0}
{"text": "This is where it’s so fucked, where traffic court can ruin an ordinary man’s livelihood, meanwhile a felon walks free because of VIP status.", "label": 0}
{"text": "If you think Trump fights for anyone other than Trump, you are a rube. Trump has made it clear over decades and decades that he doesnt care about anyone, and that his supporters are just suckers to him he can squeeze for cash over and over again.\n\nHow exactly does selling NFT and gold sneakers and fake watches make him such a “man of the people” lmao", "label": 0}
{"text": "Answer: “You mean like clean the server with a clothe”", "label": 0}
{"text": "Laws are for the poor, fuck even speeding tickets work that way. Doesn't exactly mean much to someone who clears over 100k / month if they get a ticket. Problem amplifies 10fold when talking criminal matters and insane lawyer fees, that nobody who is poor can afford.", "label": 0}
{"text": "Sentencing being pushed actually hurts agent orange. If he's given prison time, his base would just get even more fired up.  ", "label": 0}
{"text": "You are forgetting about the appeals process. I wouldn’t want to sit in jail until after my appeal is heard. If things are overturned (which is likely in this case) it would just be wasted time.", "label": 0}
{"text": "answer: Keep in mind that felonies **do not** automatically equal jail time! His felonies are **falsification of business documents** … this crime rarely result in jail time (after all, it’s not even close to a murder or insurrection). Trump will almost certainly not go to jail for this particular set of white collar crimes.", "label": 0}
{"text": "This is actually very normal, it happens a lot within the justice system to prevent a trial from upending your life. “Fair and speedy”. Fair comes first.", "label": 0}
{"text": "It has about the same chance of happening as me winning the powerball tomorrow. \n\nTo pretend it's impossible is nativity. \n\nTo pretend it's probable is foolish.\n\nIt won't happen, not with Orange Cheeto Man at least. And a \"political rule\"? Dude it's THE rule. It has been for nearly 100 years now. That's the entire point. And - get this - even if it wasn't, people would have to VOTE. And getting to fake votes is going to take even LONGER.\n\nSo, so, SO many things would have to go wrong for YEARS at a time to even get to the point where half that shit would get through, and the second the House/Senate/Presidency became either Democratic or even a non-Trump based Republican the hole would get fixed. \n\nWe're much more likely to get nuked to hell and back tbh", "label": 0}
{"text": "Don't forget white!", "label": 0}
{"text": "Same way he is in a race even though he's a insurectionist", "label": 0}
{"text": "“frog in hot water” is both an urban myth AND a metaphor. it’s used to describe the tendencies of people to ignore a bad situation if it worsens slowly instead of all at once. frogs don’t actually sit in boiling pots of water but it being wrong doesn't exclude it from being a metaphor.", "label": 0}
{"text": "Not everyone knows , The magats that don’t care or don’t wanna know are the ones I’m talking about", "label": 0}
{"text": "There is a reason why mitch mcconnell held up Obama's judges and rushed through trump's. That itself is the coup.", "label": 0}
{"text": "In fact one of the main contributors to the fall of democracy was the fact that their leaders couldn’t be prosecuted for their crimes or sued as long as they were in office, so criminal leaders realized that the only way to keep from facing punishment was to simply avoid leaving office. Crazy how nothing’s changed, people are just as dumb now as they were then.", "label": 0}
{"text": "This comment made me realize I would actually rather spend time in jail than time working at a drive-thu window again.", "label": 0}
{"text": "Sure", "label": 0}
{"text": "Because this nation didn't do anything to let our government know we were serious.  If we had a nationwide walk out, it might get their attention.  Shit the whole damned country down until they lock this fucker away.  They can throw Thomas and Alito and Eileen Cannon in the same cell.", "label": 0}
{"text": "Every institution abdicates their responsibility to stop this maniac. First the FBI, the. Congress, and now the judiciary. If he did shoot a guy in broad daylight with cameras on him, they'd put him on house arrest out of fear for his safety if he was in jail awaiting trial (aka, treated like everyone else).", "label": 0}
{"text": "Because nobody actually gives a shit about it, they were bumped up to felonies despite being normally misdemeanors and also it’s just blatantly a political attack to keep him out of the White House and I think a lot of people see that. Speaks to its truth by the fact that they haven’t locked him up.", "label": 0}
{"text": "Necro posting but Sarah lane was by far the best host on g4.  She didn’t need to do the oh look at me shit but was funny and entertaining.", "label": 0}
{"text": "Name a democratic politician with a similar cv to George Floyd 🙄", "label": 0}
{"text": "I’m not wrong. You guys propped up a man that was pistol whipping pregnant women as a saint.", "label": 0}
{"text": "You forgot being white. Definitely does not hurt in this situation.", "label": 0}
{"text": "Finally catching on to how broken the system is?", "label": 0}
{"text": "This election is riding on so much. If Trump loses, not only does Harris become President, Trump will also go to jail.\n\nIf Trump wins, it's confirmed that he sold his soul to the devil long ago.", "label": 0}
{"text": "Yeah, but trump is seriously getting away with way more than anyone else.  It's absolutely absurd that this piece of turd gets special treatment.", "label": 0}
{"text": "Can't pardon state crimes.", "label": 0}
{"text": "The system's broken because one of the parties (not saying who) has refused to act in good faith for a very long time. They put party and power over country over and over and over. They do whatever's politically useful no matter how badly if fucks everyone over. They'll refuse to impeach a president for actual crimes and later complain about how bad that president is. They'll refuse to appoint judges for the opposition but when they're the ones who'll benefit they ram the judges through in record time. They won't even pretend they're not being entirely hypocritical. They have no shame and just give a smug smirk when called out on it. The system is definitely broken and I don't know that there's a way to fix it.", "label": 0}
{"text": "\"WHITE\" being the key word.", "label": 0}
{"text": "But also the *stakes* are even higher than that.\n\nThere’s already a perception that the judicial is being weaponized against a political opponent of the incumbent. The courts are very aware of that. And maybe they know something we don’t, but it doesn’t seem like Biden is inclined to pardon him. So to disqualify Trump (or any candidate in a similar situation) would be seen by a lot of people as an egregious affront.\n\nLike, very likely similar to why the Trump administration seemed to let Hillary Clinton quietly disappear. After all that talk about locking her up, someone likely convinced Trump that it would look really bad to actually imprison her.", "label": 0}
{"text": "What do you call someone who licks shoes of a fascist? He's straight up admitted, on interviews, that he wants to use the military against democrats.", "label": 0}
{"text": "This one always cracks me up. ‘We don’t want to impact the election so we’re going to completely change how we normally do things because of the election in a way that will drastically impact the election’.\n\nAs a brilliant man once said ‘if you choose not to decide, you still have made a choice’.", "label": 0}
{"text": "No no we definitely agree where it counts; the plan is horrible and will never be fully realized, but even just a bit could be bad.\n\nBut I will say this: \"He's running for a third term?\" Already happened, and we made it a law to step down after because of that", "label": 0}
{"text": "The Founding Fathers never made it a rule that you can't be a felon and run for president, partially because \"felon\" wasn't a thing back then, and partially so you couldn't use trumped up criminal charges as a political weapon. They assumed that the electorate would decide whether someone was genuinely unfit to be president.", "label": 0}
{"text": "And if he loses? He goes to jail?", "label": 0}
{"text": "yes that is the felony part.... and?", "label": 0}
{"text": "That your job isn't as important as the presidency", "label": 0}
{"text": "Fair enough 👍 you're right.", "label": 0}
{"text": "I was wrong on that part, touché. You’ll have to excuse me, I’m 110 years old /s", "label": 0}
{"text": "I'll always remember the first time using AOL chat. 7th grade one of my first girlfriends said after school we need to chat on AIM. I had no idea what that was because I only used the PC for AoE and Warcraft 3. Remember giving up game time to sit there and chat with her lol.", "label": 0}
{"text": "I guess cuz he had to be nominated and his party has mo one else to put on the ballot now. The Biden-Harris swap was strategically times, but the GOP does not have that kind of foresight or intellect. Or decency, or integrity…", "label": 0}
{"text": "unfortunately, the glorification of being a god damned idiot is popular again since he came around.", "label": 0}
{"text": "Cool story. Not at all relevant. Try again.", "label": 0}
{"text": "Thank you sir. Changed my replies to include the 22nd", "label": 0}
{"text": "I’m not wrong in the sense that that is the type of person you guys put on picket signs and rewrote the type of person he was to fit your narrative.", "label": 0}
{"text": "ANSWER: (?) I think it’s just one of the default ones given when you create a new account.", "label": 0}
{"text": "I thought the default is just a plain looking Snoo, like mine is?", "label": 0}
