{"text": "Oh sweetheart.  You actually bought all the propaganda.  What a good little sheep you are.  Yes yes, listen to the one being accused of the crime and professing innocence over the rest of the free world accusing them.  Yes yes....that's logical.  Of course if trump was guilty he would just admit it right, not trick morons like you into simping for him on the internet? :(", "label": 1}
{"text": "the old california 3 strike rules he would get life", "label": 1}
{"text": ">Get him on literally ANYTHING that is substantive.\n\nThey did. You're just too deluded to understand it.", "label": 1}
{"text": "Corruption.", "label": 1}
{"text": "IMO it's because if he wins, he'll be so busy defending himself that he won't have any time left in the day to screw things up.", "label": 1}
{"text": "They are very, very stupid.", "label": 1}
{"text": "Answer: Trump’s legal troubles are a slow process. True he has been convicted of 34 felonies but its not as simple as that. Best is to just google Trump rule 34", "label": 1}
{"text": "> despite being currently under prosecution for espionage\n\nYou really are something else.  He is not under prosecution for \"espionage\".    He is being charged under an \"Espionage Act\" for not returning his Mar A Lago documents.  It's a big fucking difference.  \n\nI'm done debating with you. Peace out.", "label": 1}
{"text": "If he stopped committing crimes, y'all could stop crying about him being charged with crimes. \n\nFfs you snowflakes need to grow a spine and stop living in your feelings all the time.", "label": 1}
{"text": "> It may be the death of our democracy\n\nYes and locking up one party's nominee before the election would be great for democracy. You have lost the fucking plot.", "label": 1}
{"text": "What happens if he wins and then they sentence him to jail? Will he be allowed to work from jail?", "label": 1}
{"text": "See I’m calling you a bot because you’re having a different conversation than everybody else, either because you don’t have the RAM to understand context or you’re programmed to try and derail to a different topic.\n\nThat said, I’m willing to accept that you might just be stupid.", "label": 1}
{"text": "Are you fucking high?", "label": 1}
{"text": ">  He can run for President from jail\n\nLmao give me a fucking break.\n\n>Why would you want anyone to have immunity from our criminal justice system?\n\nIt's not immunity. Sentencing was delayed. I'm sorry it was delayed until after the people of America get to vote in a Presidential election, it sounds like this really upsets you.\n\n>Do you not believe in America?\n\nYou are so, so goofy.", "label": 1}
{"text": "Old rich white guy avoids jail after being convicted of 34 felonies while poor black man sits in cell 23/7 for 6 months even awaiting trial for essentially walking while black.\n\nDid I pretty much sum it all up?  Remember Trump said being arrested/a felon gives him street cred?  So to those who value street creditworthiness, is the Trump cred higher or lower than the guy I mentioned above?  Just wondering.", "label": 1}
{"text": "Easy. You all are idiots and don’t know reality and just blindly follow. Emotions are easy to control and the MSM controls your simply mind thru leveraging your emotions. 🤷🏽‍♂️", "label": 1}
{"text": "Maybe the justice system shouldn’t invent a new felony to go after 1 person for political gain.", "label": 1}
{"text": "Because he's Fucking Trump. That's why.\n\nSeriously.", "label": 1}
{"text": "If you wanna wear your ignorance on your sleeve like a badge of honor, far be it for me to stop a sheep from bleating.", "label": 1}
{"text": "Four more years of Trump.", "label": 1}
{"text": "Right-wingers are illegally interfering with the legal process to keep him free.", "label": 1}
{"text": "\"He might be a criminal, but at least he clears the bar I set for him that is much, much lower than the one I set for the other guys.\"\n\nDude, fuck off.", "label": 1}
{"text": "You retired and active military know who the magat traitors are among you. You better be ready to put a stop to this shit when the time comes.", "label": 1}
{"text": "Lmao kiss my ass and worry about your own country's elections, *mate*.", "label": 1}
{"text": "Answer: because Kamala is a shit candidate and Trump may be the anti christ. Neither is worthy putting their reputation on the line for. ", "label": 1}
{"text": "Not a conviction until after sentencing. Learn the facts.", "label": 1}
{"text": "Would be similar to Hunter Biden being convicted of a felony but still walking.  His sentencing is in December so Biden has time to pardon him.", "label": 1}
{"text": "This is how it's been for hundreds of years. \n\nThe rich and powerful are not subject to the same laws as the peasants of society, the concept of justice is simply an illusion when you have the means to work the system.\n\nThere will never be any sort of repercussion, the only way Trump would ever end up in jail is if he was jeopardizing something more powerful than himself and it's likely he'd be killed shortly thereafter.\n\nAnd Trump is far from the only one, I'd wager the large majority of rich and powerful people have done things that any normal Joe would be thrown into prison for immediately.\n\nIt's all about the money.", "label": 1}
{"text": "No I made a true statement and have a Neanderthal like yourself making alternate facts and putting words in my mouth.  Typical redditor", "label": 1}
{"text": "\"Why don't you mind your own fucking business, Op?\" ~ Merrick Garland", "label": 1}
{"text": "Trump for president!!!!!", "label": 1}
{"text": "youre one sick fuck", "label": 1}
{"text": "Because its a big nothing burger like always", "label": 1}
{"text": "Yo, Yo, Yovanna\n\nYo, Yo, Yovanna", "label": 1}
{"text": "Because he hasn't been sentenced and the convictions will be appealed and overturned", "label": 1}
{"text": "Answer: It's a symbolic move, intended to have an outcome not obvious on first glance. \n\nIf LA Times or Washington Post were to come out in support of Harris, would anyone be surprised? Or even care? These organizations have made their overall stance on Trump clear for years, so an overt nomination of Harris is old hat. And obviously they will not endorse Trump, or else these papers would collapse in a quantum singularity of insanity.\n\nBut ah, if they don't endorse anyone... Now they can fill that vacuum with some fearmongering about the dictator-in-waiting. Maybe with that, the non-endorsement will be more valuable than an explicit endorsement for Harris...\n\nIt is a creative approach to a unique dilemma, I'll give them that.", "label": 1}
{"text": "Well then start your own thread and complain about Trump somewhere else. That is literally the point of this thread you ignoramus.", "label": 1}
{"text": "To take a law, rewrite it to make a misdemeanor a felony than charge Trump with something that happened 10 years ago, is not election interference.  Think about that.", "label": 1}
{"text": "Long story short:  SCOTUS allowed it.", "label": 1}
{"text": "Are you aware how many convicted felons are in congress??...lmao...wake the fuck up....", "label": 1}
{"text": "Misdemeanor- not a jailable offense. Get some education.  Political interference.  You may not like him, but he’s better than Kamala.  Who was raised in Canada in her mother Hindu background, not black.  Her parents are Marxist.  \nShe slept her way into politics.  Do the research you fools.  The Democratic Party is the party of WAR!\nMorally he is a loving father to his children. She is from a broken home.", "label": 1}
{"text": "\\>without any evidence, is in her third year of playing on the team.\n\n  \nShe was outed by her team mates, to which she disclosed her trans identity. I think the only hysteria here is the left wing trans-denialism. We should be proud of her for competing, not denying her identity by pretending like she hasn't had to go through the struggles of the transition.", "label": 1}
{"text": "LMAO don't go to law school...", "label": 1}
{"text": "Except it's not. There's a man playing", "label": 1}
{"text": "She definitely doesn't look like she's had a bunch of testosterone in her life.  \n  \nThe athlete:  \nhttps://nypost.com/wp-content/uploads/sites/2/2024/10/www-instagram-com-p-ci07sycjplp-90552122.jpg", "label": 1}
{"text": "CIPA? The childrens internet protection act? I'm not making the case for anything other than the guardrails we need don't exist because the people that created our government had more faith in the population than they should have.", "label": 1}
{"text": "Keep your head in the sand", "label": 1}
{"text": ">CIPA? The childrens internet protection act?\n\nLol.. You can't even figure it out and are so confident otherwise. \n\nSeriously,  piss off.", "label": 1}
{"text": "Trans women are male. There IS something wrong with that.", "label": 1}
{"text": "Exactly the excuses every criminal makes...", "label": 1}
{"text": "Traitor-sympathizer", "label": 1}
{"text": "You're either an idiot, or paid to troll and spread disinformation, because it's literally all your profile does.\n\nAnd I recognize that such people are paid per reply, so I'm not talking to you further.", "label": 1}
{"text": "I wanted to avoid the full rant about how people aren't knowledgeable enough to understand margins of error, but I guess you kinda did it for me in a way. \n\nYes they have large margins of error! That's *precision*, not accuracy. They consistently hit within the margin of error, (accuracy) and have only improved over time.", "label": 1}
{"text": "Answer: He likely just means that top level democrats are explicitly anti 1st and 2nd ammendment and that they are willing to jail political opponents to retain power (literally all things that 3rd world dictators do). The enemy within is the people within the government actively working to take our fundamental rights and freedoms away. Pretending that he's quoting Hitler and using it as a dog whistle is extremely goofy. 99% of Republicans would not have associated the words \"enemy within\" with Hitler until some goofy ass hacks told their legion of followers that that's what Trump means and is intentionally doing. It's working I guess because you all are acting as though you know his exact motives lol", "label": 1}
{"text": "The truth is... Nobody knows. There's a ton of ratfuckery around polling, which has traditionally relied on run of the mill politics and feedback from voters to Inform their numbers.\n\nNow? There is more misinformation and misdirection than anything. Voters from one party register as the other to vote during that groups primaries, in hopes of swaying the candidates chosen for the general election. \n\n\"October Surprise\" has been replaced with muckraking media for ratings, with each side ginning up their base with reports that make the race seem tighter than it may be (because like a good football game, people keep watching until the end of its close, but people change the channel during a blowout).\n\nThis doesn't even take into account people who are actively lying to poll workers, because why not? \n\nAll in all, the elections, while including millions of people, typically come down to a few counties in key swing states: popular vote means nothing with electoral college, and if the candidates win these swing counties in these swing states. They win the election. \n\nAnd all the pollsters and media can do is make an educated guess on how those areas will vote (hence. The \"swing\" of it all.", "label": 1}
{"text": "You are ignorant. Polymarket takes bets in USDC.  Cryptocurrency-yes. Bitcoin-nO.\n\nDon't spout bullshit. Stay informed.", "label": 1}
{"text": "Yup couldn’t agree more", "label": 1}
{"text": "[here's a link to a fairly complicated article](https://app.vantagedatahouse.com/analysis/TheBlowoutNoOneSeesComing-1) that explains some of the metrics behind the polls and how they might not mean what they're being spun to mean.", "label": 1}
{"text": "All that polling can really show when it’s close is that it is, in fact, close. Everyone on social media will pretend to be an expert or that they have an insight on how the election will play out. But everyone is just guessing and is biased.", "label": 1}
{"text": "Social media is tailored to you. There’s also speculation things are being manipulated as far as Vegas odds go. I think there will be surprises election night as far as how close it is though! Not sure which way.", "label": 1}
{"text": "Most of the swing states are within the margin of error so it is essentially 50-50 at this point.", "label": 1}
{"text": "Your feed is full of media that is mostly all controlled by democrats, they’re lying about Kamala being in the lead or even close.", "label": 1}
{"text": "Could you give me the # for your copium supplier? This is some good shit", "label": 1}
{"text": "nice try, fed boy", "label": 1}
{"text": "Betting takes more into account how much money is bet on a particular “line.” Meaning, if it was a true pick ‘em but $1 million came in on trump, the line would move less favorably towards him and less towards Harris. Meaning, it’s not indicative of actual predictions, more so how the bookie makes money.", "label": 1}
{"text": "lol TikTok and Reddit think Kamala will win tells you all you need to know", "label": 1}
{"text": "You’re showing the true colors.", "label": 1}
{"text": "A lot of people support Trump, but social media feeds (except for reddit) are tailored for your interests, including politically.", "label": 1}
{"text": "LOL you're just making shit up and just reading into shit that isn't there like a goddamn bozo", "label": 1}
{"text": "A podcaster from SupercastleBeast by the name of Woolie Madden (black) has said that blacks attacking asians is wholly justified because of historical atrocities commited by japanese. He has expressed a great interest in being able to fuck up the japanese as a black samurai and looks forward to killing tons of asians and piling them up. Just watch his live stream reaction of the game’s trailer, he is excited everytime Yasuke cuts up a japanese NPC.\n\nNeedless to say, according to Woolie, assaulting asians is fine because asians have commited a lot of horrible acts in the past. If an asian gets attacked, it’s deserved and they the asian should have thought more  about their own actions and whether they should even go outside.", "label": 1}
{"text": "Trump 2024", "label": 1}
{"text": "there is no way Kamala will win now. It will likely end up being a huge loss in the electoral college", "label": 1}
{"text": "I'm literally telling you that I've seen the data. It's not bullshit. My goodness, you're pompous.", "label": 1}
{"text": "More of the same, throw everything against the wall and see what sticks. Trump is running away in the polls and there’s nothing anyone can do.", "label": 1}
{"text": "Polls don’t really matter, they’re just best guesses with the data they to use.\n\nWe will know who wins after the election.\n\nJust get out and Vote!", "label": 1}
{"text": "In context it comes up every time they discuss the attempts on his life. He is referring to radical people, so wound up by the media that they are willing to commit political violence.", "label": 1}
{"text": "lol, Reddit is full of chatGPT bots running democratic agenda. Same with mass media.", "label": 1}
{"text": "Trump is the enemy within", "label": 1}
{"text": "No one knows. Anyone who says they know is mistaken; they don’t know.", "label": 1}
{"text": "So your response is throwing me some opinion by some asshat with zero credentials. Nice work.", "label": 1}
{"text": "The betting sites have been heavily influenced by someone or some group making large bets on Trump.  Millions of dollars bets.  They aren't a reliable predictor of the outcome.  And the aggregate sites like 538 have been flooded with polls of low quality that are tilted towards Trump.  While the race is close, the Dems have no reason to panic.  They just need to stick to the plan and get everyone they can to the polls that matter.", "label": 1}
{"text": "imagine getting upset people ask for a source and then pretending they're the one that's coping. I guess you didn't read past the first sentence of my reply, it's no wonder you're alone.", "label": 1}
{"text": "Answer: politics is nutty and complicated", "label": 1}
{"text": "Answer: There are some things the current Dem admin have done that people who voted for them last time don't like and makes those people less likely to vote for them again.", "label": 1}
{"text": "Go outside, nerd", "label": 1}
{"text": "Lmao what propaganda am I putting out? Fucking Google it instead of talking out of your ass. There are plenty of articles about it", "label": 1}
{"text": "You believe Montana and California should be proportionally represented? So a Montana voter should have 40 times the voting power of a California voter. You’re the one who needs to think about it a little bit. You people are insane and clearly want like an authoritarian “elected” by the few", "label": 1}
{"text": "His admin has to follows laws and wat not. Presidents don't have unlimited power. This is why most find it halarious u guys flip out about the immunity case. This still doesn't give unlimited power he still has to follow laws. BTW THE IMMUNITY THING GREATLY HELPS OBAMA BC WITHOUT IT. HE COULD HE CHARGED FOR TWO AMERICANS BEING KILLED. \n\nHARRIS HAS SAID SHE SUPPORTS THESE SURGERIES FOR ILLEGAL ALLIENS AND PRISONERS. TRUMP HAS NEVER ONCE SAID HE SUPPORTS IT. JUST BC HIS ADMIN FOLLOWS THE LAWS AND STUFF DOESNT MAKE HIM A HYPOCRITE. PRESIDENTS DONT HAVE UNLIMITED POWER LIKE SOME OF YOU BELIEVE", "label": 1}
{"text": "You are so full of shit this is pure propaganda. If you've listened to any of Trump's interviews and the one with Joe you would hear when he is talking about his political opponents in the very way you mentioned and made sure to say he is not. He says all the time how the elite are going after him, smear campaign after smear. Stop this rhetoric of comparing him to Hitler. And realistic history buff knows it is so disrespectful to compare Hitler and what the Jews went through with what the Democratic party is dealing with. Absolutely ridiculous.", "label": 1}
{"text": "Your train of thought is a danger to society, please dig deeper befor jumping to assumptions and drawing conclusions. Jeez I hate people like you.", "label": 1}
{"text": "Question: Why do you conservatives keep thinking OoTL is your political platform to push your agenda?", "label": 1}
{"text": "answer:\n\n  \nracism.", "label": 1}
{"text": "Answer: Not sure entirely, I think it’s where a lot of cocaine and other drugs are produced in South America. From there, it’s probably assumed that’s where the increased amount of drugs coming into our southern border are coming from.", "label": 1}
{"text": "I've got images of the ratemyprofessor reviews before they got deleted.. it's so gold..", "label": 1}
{"text": "Answer:  The government of Puerto Rico is a corrupt, garbage regime.  Obviously, no one would cast aspersions on all people of an entire region.  Same when we talk about how Russia is bad.  We aren't hating on Russians, but the Russian government.  Liberals just want something to complain about.  There's not enough racism for them to elect their cheap-fake feminist DEI Obama, so they jump on a joke that a comedian said at one of hundreds of political rallies.", "label": 1}
{"text": "bluesky is such a funny ass site, literally had to go make an echo chamber because feelings got hurt on twitter, literally the whitepeopletwitter of the internet", "label": 1}
{"text": "I didn't think the leopard would eat my face too.", "label": 1}
{"text": "They brought a comedian on stage who bombed his performance.  Let’s be a little objective here.", "label": 1}
{"text": "Sounds like a degenerate dumbass", "label": 1}
{"text": "You're just a racist and fully support racism.", "label": 1}
{"text": "Something to do with a girl named Maria?", "label": 1}
{"text": "If you’re so worried about spelling, I recommend you check how clean your room is.", "label": 1}
{"text": "Answer: puerto rico has a trash crisis. A joke was made n people got offended.", "label": 1}
{"text": "A comedian made a joke it’s really not that deep. If you Google it, Puerto Rico has actually had a huge garbage problem for years now (https://globalpressjournal.com/americas/puerto-rico/trash-crisis-leaves-puerto-rico-brink/ and also https://www.ecorichenv.com/article/puerto-rico-landfill-problems)\n\nPeople love to shout racism/sexism, etc anytime a joke is made at the expense of any sort of ethnic or minority group. Some jokes may not be as well received or appear to be in bad taste, but that hardly makes someone racist. Being called racist has pretty much lost its meaning at this point. Hell, I can almost guarantee people will call me racist for this entire comment. Whatever.", "label": 1}
{"text": "Answer: A comedian made a joke it’s really not that deep. If you Google it, Puerto Rico has actually had a huge garbage problem for years now (https://globalpressjournal.com/americas/puerto-rico/trash-crisis-leaves-puerto-rico-brink/ and also https://www.ecorichenv.com/article/puerto-rico-landfill-problems)\n\nPeople love to shout racism/sexism, etc anytime a joke is made at the expense of any sort of ethnic or minority group. Some jokes may not be as well received or appear to be in bad taste, but that hardly makes someone racist. Being called racist has pretty much lost its meaning at this point. Hell, I can almost guarantee people will call me racist for this entire comment. Whatever.", "label": 1}
{"text": "The comment makes you look like an ignorant, uneducated idiot. Can you explain why you want to leave it?  If I make a mistake that makes me look dumb, I would be quick to delete it.", "label": 1}
{"text": "Real answer. You are a racist. \n\nFrom a Puertorican.", "label": 1}
{"text": "People like you actually think half of the population are racist. Here's a truth you, if you actually think the democrats or Kamala are good people trying to help the working class, you are the same level of intellect as a maga voter. Which explains your extremely simple minded analysis of why many don't want the neo-con, warmongering, big gov that has failed the population for 3 decades back.", "label": 1}
{"text": "You fucking dunce.", "label": 1}
{"text": "A comedian said something about Puerto Rico will you get your shit straight and stop lying!!!!!!", "label": 1}
{"text": "You’re the only asshole here. You’re like that joke of the idiot who causes a traffic jam because he thinks everyone else is driving the wrong way ", "label": 1}
{"text": "“I’m Puertorican with a black wife”\n\n“Im not racist, I have black friends” “I’m not homophobic, I have a gay cousin. \n\nYeah, that’s how a racist pos sounds.", "label": 1}
{"text": "1. The fact that you said that Colombo shit is ironic, since you’re not claiming to be racist. \n\n2. The fact that you claim I lack reading comprehension and you’re here still not knowing the difference between Colombia, Puerto Rico, South America, and the Caribbean is a pretty sweet irony. Go screw yourself with your maga hat on.", "label": 1}
{"text": "Answer: There is no deal. It was a joke by a comedian. Snowflakes just have their panties in a wad because it was said at a Trump rally", "label": 1}
{"text": "WTF!? Every left wing media has been saying is the second coming of hitler non stop. Get your head out of your ass 🤡", "label": 1}
{"text": "Answer: Dr. Phil’s rise to game is an interesting story. First off, he is not a medical doctor. He does have a PhD in clinical psychology, which is not easy to do, but the title of “doctor Phil” definitely played off a perception of him being a medical doctor\n\nHis rise to fame started (or was massively boosted) when he was a guest on Oprah’s show. He would go onto have his own reality TV show, which despite its pretense and setting is a lot closer to something like the Bachelor or Flavor of Love than it was to being something about him genuinely wanting to help people. The scenarios were heavily curated and fabricated ahead of time. I love some good trash TV, but I wouldn’t be looking for his phone number if I had some serious mental health issues.\n\nBlaming his relevance (I am using that loosely) on Oprah is like thinking of it as a domino effect where each domino hit a bigger one and eventually we get to these past elections where a C or D tier celebrity is endorsing Trump\n\nPhil also has a long list of debauchery under his belt. Check out the behind the bastards podcast if you’re curious", "label": 1}
{"text": "Answer: Taylor Swift loves money. It’s the whole reason she re-recorded all of her old songs to own the masters, so she could make more money when you listen to those songs. \n\nAlienating aggressively ~50% of the country isn’t very profitable. In fact, it’s quite likely that most of her income comes from Trump supporters, based on demographics (I might be wrong, but it’s probable I’m right).", "label": 1}
{"text": "I'm not a Swiftie, but I have a daughter, so I'm definitely Swiftie-adjacent.\n\nI feel like she put out that statement supporting Harris because Trump and Musk forced her hand by distributing false info and AI posts claiming she supported him.\n\nShe's in the middle of a huge tour while still trying to find time to have a personal life. I never felt like she was overly political. She had an opinion, which she made known and that was that.", "label": 1}
{"text": "\"I just found out\"", "label": 1}
{"text": "But you were already a leftist and they are too.\n\nJust because you all smell each other's farts in the big city doesn't mean the majority does the same.", "label": 1}
{"text": "Man, the depths of dumb you people plumb is simply astounding. Even after all these years, you amaze me. Constantly.", "label": 1}
{"text": "Why are you measuring people in Millimeters?", "label": 1}
{"text": "Hahahaha maybe", "label": 1}
{"text": "Answer:\n\nA film is shown of [Adolf Hitler](https://en.wikipedia.org/wiki/Adolf_Hitler) supposedly saying, \"My dog has no nose\", then a German soldier asking \"How does he smell?\", with Hitler replying, \"Awful!\"", "label": 1}
{"text": "You're just sticking your nose up in the air and acting like you're better than me. People make jokes about geographic locations. Seems like even after 20 years, you still get offended over petty jokes.", "label": 1}
{"text": "They all deserve to be lyn ched.", "label": 1}
{"text": "Do I *really* need to trot out the \"They're sending the rapists\" clip. Quit defending the twat. \n\n\"uhm akshually, he didnt explicitly say rape *THIS* time so you're the one who's wrong\" go fuck yourself.", "label": 1}
{"text": "There's a much simpler explanation. \n\nThe vast majority of black people circa 1870 lived in the south. The south, both white and black, had watermelon and fried chicken as major cultural foods, and watermelons grow really well. \n\nThen the great migration happened when the KKK got real nuts starting in the 20th century and millions of black people moved to the west coast, rust belt, and northeast cities where labor was needed. They took the watermelon and fried chicken culture with them and Northerners ascribed them to blackness rather than southernness.", "label": 1}
{"text": "I'm allergic to red meat ... you quickly find out there are meat byproducts in virtually EVERYTHING, especially in the form of gelatin 🤦🏼‍♂️", "label": 1}
{"text": "And the funniest part about it is not even the idiots he was pandering to were laughing. He just died on stage when he could've gone out there acting like a wild baboon and people would have laughed the whole time...", "label": 1}
{"text": "he spitting facts tho 🤷. Dont @me", "label": 1}
{"text": "Because the constitution and rule of law, not rule of unchecked TDS", "label": 1}
{"text": "No the joke is basically Palestinians are cavemen throwing rocks and all Jews need to do to win is throw paper...but they're greedy and wont...thus the conflict continues.", "label": 1}
{"text": "Answer: you don't have google?", "label": 1}
{"text": "😭😭😭a comedian told a joke. Grow up.", "label": 1}
{"text": "turns out you're stupid af", "label": 1}
{"text": "Soros is simply…..\nAn open border advocate wanting to bring chaos and anarchy to civilized societies.\nHe funds politicians to do it.\nHe was kicked out of his home country of Hungary for pulling this crap but Clinton brought him here over 30 years ago so the could flourish here.\nDid you not see the 20 cities he funded to be destroyed a few years ago?\nPlease, this guy profits off of anarchy", "label": 1}
{"text": "Even better question how can I get my hands on it", "label": 1}
{"text": "Because they're all deplorable garbage people.", "label": 1}
{"text": "The number one thing that bring people together is a “bad guy.” Someone that you can blame all of the world’s problems on. Currently the republicans are doing that with a bunch of people and just seeing which ones stick.", "label": 1}
{"text": "Answer: this subreddit will not allow unbiased responses to this question.", "label": 1}
{"text": "Answer: Research John Money - the man is to thank for Transgenderism, and his research was based on molesting twins and his own sexual depravity.\nIt's not a science, and public education is targeting children and brainwashing them to accept it as fact when it is anything but.", "label": 1}
{"text": "crossing an imaginary line are enemies of the countey now???! LMAO go back to england because if thats the cause most of you white fucks are enemies of the country since your genocidal ancestors pillaged robbed and ransacked this country", "label": 1}
{"text": "That's not it at all.  It's men invading womens spaces. \nAnd targeting young kids.", "label": 1}
{"text": "United Stateser here.  Really seems like every bathroom I go into these days has 2-3 trans people just, like, hanging out.  Don’t y’all have jobs?", "label": 1}
{"text": "Trump is a real threat to the country, unlike trans people", "label": 1}
{"text": "Yep, helps that transphobia is very easy to swallow for uninformed ppl.  I talk to my leftie mom and she’ll casually drop transphobic talking points like « you cant call a woman a woman anymore » or « men in wonen’s sports », not realizing that those are transphobic dogwhistles", "label": 1}
{"text": "Its way better then kamala word Salad", "label": 1}
{"text": "You do realize democrats are the anti semetic ones today right? \nHalf of trumps family is jewish.\nBtw trump supported gay marriage b4 the majority of democrats supported it.", "label": 1}
{"text": "Answer: back in the 90's and 00's there was a big push for gay rights, specifically the right to marry. Even as recently as 2008, Deep Blue California defined marriage as between one man and one woman.\n\nPopular opinion changed VERY quickly, to where today most people on either side of the political aisle accept that gay people are allowed to marry. There are some hold-outs in the Republican Party, and unfortunately they are the most vocal, but they are a minority.\n\nWell, all that money and activist energy doesn't just go away when the problem goes away, so the radials on the Left moved to the next issue: trans rights.\n\nMost (not all) people on the Right have a \"live and let live\" approach to trans people, but the issue came when the Left started targeting children with things like drag queen story hour, giving children hormone blockers without parental consent, and allowing people with a penis access to women's locker rooms. \n\nThe movement that started as a quest for equal rights has jumped the shark and started trying to manipulate and influence children, so the Right has felt the need to push back.", "label": 1}
{"text": "I never said he was the best president. \n\nWell theres more wars. No new ones under trump.\n\nBiden imported 15 million+ illegal aliens. And there treated better then citizens. When martha vinyard got 59, they called the army to take them away. But yet send 20,,000 haintains to a town of 50k. \nHOW IS PUTTING ILLEGALS ABOVE CITIZENS GOOD?\n\nthe cumulative inflation is very high. Apparently none of you buy anything. Every thing you buy is 20%+++ more expensive. \n\nWell we didn't have guys destroying female athletics. How is letting guys complete against females helping them?\n\nWe also knew what a female was under trump", "label": 1}
{"text": "No he didn't. It's not my fault, the only way harris gets people to come is by bringing actual celebrities.\n\nU do realize half his family is jewish. And he supports isreal. Democrats are against Israel and are currently the anti-semetic group.\n\nIf you truly believe trump is Hitler. U need some serious mental help.", "label": 1}
{"text": "I'm not wasting my tine.", "label": 1}
{"text": "Buddy this is reddit. It's not a business meeting.", "label": 1}
{"text": "Wait- are trans people not the number one problem facing us in 2024???", "label": 1}
{"text": "That's bc u people are clearly delusional if you think trump is honestly Hitler. Half is family is jewish. \nTrump wad already president. And nothing bad happened.\nI had to make a new account.  I used an email I dont use for the old account. And forgot what the email was.", "label": 1}
{"text": "No, it's that people have always recognized that sex differences are real, and the Overton window is established to include this recognition of reality. Put another way, people are no longer afraid to say that the emperor is wearing no clothes.", "label": 1}
{"text": ", va", "label": 1}
{"text": "Because saying we want to enslave you and turn the US into a Feudal Oligarchy didn’t poll well.", "label": 1}
{"text": "No, Chemo is a false equivalency.  As that is attempting to save someone's life from a cancer that could kill them.  Whereas a double mastectomy of perfectly healthy breast tissue is not to save someone's life.  A surgery [Kaiser Permanente performed on a minor and is now being sued for.](https://www.dhillonlaw.com/lawsuits/chloe-cole-v-kaiser-permanente/)  Doctors are not always some perfect being with an exceptional moral compass.  In this capitalistic healthcare system there is an incredible amount of money to be made by the unscrupulous doctors, as the oxycontin epidemic exposed.  Each person that medically transitions results in millions of dollars or drugs and treatment needed over that person's lifetime.  And struggling teenagers need an extra layer of protection from predatory medical behavior.", "label": 1}
{"text": "1/ am not an American 2/ you mean you want to allow biological men in women's restrooms but in men's changing rooms?", "label": 1}
{"text": "See my other comment, you want biological men in women's restrooms but in men's changing rooms.", "label": 1}
{"text": "Again, unless you are arguing biological men can use women's restrooms but men's changing rooms, the point is bigger. As a man, it's a lot less a problem that a biological woman will be in my restroom then a biological man with my daughter or wife.", "label": 1}
{"text": "One follows the other.  This isn't limited to restrooms. A MtF is a biological man and transgender doesn't mean genital modification.", "label": 1}
{"text": "I practice sports, ages 14 and up share changing rooms and showers. Where does a biological man have to go who claims he is a woman in your opinion? Typical leftist double speak", "label": 1}
{"text": "Nah, it's a legit take. Every other alphabet soup in the LGBTQIAA+ community has enforced normative behaviors on their loudest and worst, and ostracised those that didn't comply. Lesbians were pretty early movers about this, back in the 1940s-60s. Gay males did their storming then normed in the late 80s....\n\nTrans? *You allowed Bruce Jenner to be your spokesasshole.*\n\nWorse yet, instead of doing anything to rein in or ostracize your loudest and worst, you insisted they needed a safe space to be very loud and atrocious. Then you convinced allies to help as you enable them.\n\nYou're not a target because you disgust others, everyone in the LGBTQIAA+ rainbow does that. You're specifically targets because you let your most disgusting be the loudest.\n\nShitty thing is, I've been warning about this since y'all got suuuuuper shitty about HRC's marriage campaigns.\n\nIt's a bed you made.\n\nAnd you're paying for it with your peace, your health, and your lives.", "label": 1}
{"text": "Black folks usually least liked in most countries.", "label": 1}
{"text": "Answer: It's a creeping mental illness, and ones response to it is an indicator for many other things. Denying that a man is a man means you're probably not trustworthy in general.", "label": 1}
{"text": "The victim never said anything aboit being sexually abused by trump.\n\nWhy the fuck you lying?", "label": 1}
{"text": "I think you're weak and a coward, you're afraid to examine your own thoughts and comfort yourself by pretending you're in the majority or that your views are objective.", "label": 1}
{"text": "Exactly. Trans people and the argumentation for the validity of trans identity is nothing but word tricks and denial of reality in the name of the “greater” good, in the name of inclusivity.", "label": 1}
{"text": "Lol real classic transwomen are perpetually pervert and trans men are the perpetual victim.\n\nI remember a few years ago when they were raving about how the left wants to castrate all boys ", "label": 1}
{"text": "> Do you not notice that people think that? They teach this to kids in public school in Seattle, at least.\n\nGen z woman here. Yes I was told there are people that with to transition to the other gender and that we should treat them as we would want to be treated. I was never told I had to like them. Also boys are taught the same thing don’t you think it’s weird that you focusing on transgender women as the perpetrator so much? Even the people who coined the term Autogynophilja also claimed that transgender men have Autoandrophilia. ", "label": 1}
{"text": "MAGA has no platform or plan so they have decided to demonize a group that is less than 1% of the population to deflect from their feckless ineptitude", "label": 1}
{"text": "Disgust is quite different from fear which none of you “people” ever seem to understand", "label": 1}
{"text": "Thank you. The idea that this is some kind of clandestine discrimination operation is some Alex Jones-level conspiratorial nonsense. In the first place, if the law requires you to “check citizen” on a registration form (or whatever) and you don’t do it, then you didn’t follow the law and that is what it is. Secondly, it is extremely unlikely that there is any statistically significant advantage to be gained for Donald Trump by “targeting” something this  universal…there’s just no way that “not checking boxes” is a “Democrat” behavior that could be exploited for political gain. \n\nSometimes a cigar is just a cigar: the government found that some appreciable number of non-citizens were registered to vote and they took action to remove them from the voter roles because non-citizens aren’t allowed to vote. There is no sane world in which that should be seen as some kind of gross attack on the sanctity of elections.", "label": 1}
{"text": "You’re right, but you can’t win here. These people are delusional and literally, psychologically, can’t see reason.", "label": 1}
{"text": "You are highlighting another point, it becomes impossible to discuss topics if we don't have the words for it.  I appended biological for the sake of clarity, but a man is an adult human male, it's a sex.\n\nBeside that, you employ the clasical leftist doublespeak again.  Restrooms aren't showers (yeah, but you aren't going to say yes to gender based restrooms and no to gender based showers), showers have dividers (they mostly don't here in Europe), then you say but if they don't it's no problem.\n\nSo in the end you do acknowledge that this crap means men will be showering with women and girls but the women should be ok with it.  You are intentionally dishonest.", "label": 1}
{"text": "Answer: Republicans are pushing transgender issues as a way to attract Hispanic and black voters that are historically more Christian and conservative on all things LGBTQ\n\nhttps://www.politico.com/live-updates/2024/10/23/2024-elections-live-coverage-updates-analysis/genforward-poll-black-latino-voters-00185161\n\nHere’s a subreddit where they talk about lgbtq in those communities \n\nhttps://www.reddit.com/r/AskLGBT/comments/16x62eg/why_is_there_such_a_strong_narrative_on_reddit/\n\n\nLet the downvotes rain down on me!", "label": 1}
{"text": "And what would that proof be..? Say you’re a legal immigrant who doesn’t have a US passport or birth certificate. What do you use to prove citizenship?", "label": 1}
{"text": "I used to love behind the bastards, then he did a few episodes that I actually knew something about and got to see how incredibly ideologically captured the guy who runs it is. Like come on, he blames capitalism for christopher columbus actions while the dude was very directly working for the Spanish government and was literally acting as governor, just wild.", "label": 1}
{"text": "You must have a liqu or license and watch The View 24/7🤣", "label": 1}
{"text": "How very white of you.", "label": 1}
{"text": "Answer: it's a less physically intensive version of tennis for rich white people", "label": 1}
{"text": "Answer: A couple dozen Russian troops needed someone to hide behind.", "label": 1}
{"text": "Americans think he's regarded too", "label": 1}
{"text": "Answer: Who can ever be sure with these freaks.  It used to be a green cartoon frog.  Then it was the \"okay\" sign.  Now it's a squirrel.\n\nBunch of absolute fucking weirdos who are so far up Trump's ass they can't even see what they've become.", "label": 1}
{"text": "Answer: Because Squirrels love \"nuts\" and this election cycle more-so than in the years past the right is obsessed with people's genitals. Given the conservative nature of the party, they can't outright admit so it's always coded. I think it's a play on words / pun sort of thing.\n\nKind of like \"Log Cabin\" Republicans 😘🏳️‍🌈", "label": 1}
{"text": "It isn't often you see a legit boot licker post but here we are.  It's a squirrel that wasnt a danger to society, was loved and taken care of.  This isn't some invasive species that was transplanted here from halfway around the world. Or an exotic animal taken from a jungle.\n\nIn the the grand scheme of things, this wasn't worth the tax dollars nor the public backlash.", "label": 1}
{"text": "You’re an actual unhinged person.", "label": 1}
{"text": "The projection from you is insane", "label": 1}
{"text": "Damn bro I'm so sorry", "label": 1}
{"text": "> if you don’t like my answer\n\nYou actually gave no answer there big guy, hope this helps 😁", "label": 1}
{"text": "I’m just trying to help you out here man, you just seem very lost from what I read.", "label": 1}
{"text": "Suck that boot a little harder bro", "label": 1}
{"text": "Not so much lost as indifferent.  Or at least, giving reddit comments exactly as much attention as they deserve, which you might try.", "label": 1}
{"text": "Are you delusional and dumb? Not a single soul cares about your pronouns anyway. Most importantly, when it comes to obvious attempted grooming of a child. Cope harder", "label": 1}
{"text": "Answer: cope", "label": 1}
{"text": "You're a Trump supporter, so fuck off.", "label": 1}
{"text": "An ironic user name given your profound ignorance", "label": 1}
{"text": "She was bitten by the squirrel. The only way to check for rabies is post mortem.", "label": 1}
{"text": "No it’s not a sign at all. If u actually researched more instead of armchair diagnosis you’d see that this behavior happens A LOT in cases such as this. Smdh you are so ignorant and have no idea what you’re talking about. It’s almost laughable if it wasn’t so sad! You are DELUSIONAL", "label": 1}
{"text": "Yea well they SHOULD blow their heads off if they are being abused by their PARENTS. You are seriously disturbed individual to think you know for fact whether they are lying or not. And to think that parents who abuse their children shouldn’t be wiped off the planet immediately", "label": 1}
{"text": "Exactly. If you don't want your pets killed by government agents because you don't have the correct paperwork, you shouldn't move into a state controlled by Democrats.", "label": 1}
{"text": "Answer: It’s incredibly woke. In a high fantasy game, lots of dialogue is about non-binary and misgendering people, which makes no sense. Also, weird to have top surgery scars in a world with MAGIC! And gameplay-wise, it’s very different from Dragon Age: Origins, which was highly praised for its gameplay, dark fantasy, and multitudes of unique origin stories. There’s also a controversy that allegedly Bioware only gave review keys to reviewers who reacted to the gameplay preview positively, skewing the critic score. It’s also been 10 years since the last Dragon Age game, so interest was pretty high, and many consider it a disappointment.", "label": 1}
{"text": "Question: why is this such a bait question?", "label": 1}
{"text": "So if it doesn't have rabies, how will they be compensated? They'll bring it back to life? Fuck you and fuck anyone who simps over the state like a fucking fascist like you do. Disgusting.", "label": 1}
{"text": "Yeah right. This poll is way off", "label": 1}
{"text": "Answer: he didn't want to. If abortion is no longer restricted what will his party dangle over the heads of American voters every 4 years?", "label": 1}
{"text": "I can tell I'm talking to someone who looks like this: https://uploads.dailydot.com/2024/10/what-is-soyjacking.jpg?q=65&auto=format&w=800&ar=2:1&fit=crop", "label": 1}
{"text": "Because you keep spamming the same comment, I'll keep pointing out you're an idiot (at best) or willfully ignorant (much more likely):\n\nThe Freedom of Choice Act was introduced in 2007 (and Obama, at the time a senator, was a co-sponsor for it). It was not up for a vote or a signature while he was president. It was replaced by the Women's Health Protection Act in 2013, which failed to get through the Senate. There was nothing to sign, either in 2009 or 2013.\n\nThere's being disingenuous, and there's being ignorant. Which one are you?", "label": 1}
{"text": "Question: Why didn't the Biden administration work on this? Or Harris?", "label": 1}
{"text": "I want you to have a long, hard look at yourself in the mirror, and seriously ask if jnproductively necroposting like this was worth it.", "label": 1}
{"text": "Pedro Sánchez fault. The king did nothing wrong", "label": 1}
{"text": "The reality is that the PSOE, party of President Pedro Sánchez, demolished structures that prevent tragedies like this without any justification, such as reservoirs and dams. People called Pedro Sánchez a murderer, not the king, but they half lied because Pedro left as soon as he arrived.", "label": 1}
{"text": "Answer: the dragon age Fandom has just been continually let down since the release of the first game", "label": 1}
{"text": "Cringe.", "label": 1}
{"text": "Cringe is being an active user on /r/fightporn and arguing against women's rights on reddit. Your post history gave me depression.", "label": 1}
{"text": "Yep. One non binary person existed in optional dialogue. Ruined the 100 hour experience for me. I spent days questioning my fragile gender identity as result.\n\nWHY BIOWARE!?? WHYYYYYYY!", "label": 1}
{"text": "Nah the sleuthing is even more cringe.\n\nAlso I'm an active user on fightporn? Since when, A few convos an active user does not make.\nAnd when did I argue against women's rights exactly?", "label": 1}
{"text": "Lol, again your history is public and you've done no such defending.", "label": 1}
{"text": "Nonsense it's all there for you to see\n\nI get it, someone called you cringe online so you got butthurt and took a quick glance at their profile to find something to insult them over without thinking how silly you'd look when you got it completely wrong. Now you're not providing examples because you can't and are embarrassed.\n\nHow sad.", "label": 1}
{"text": "Fortunately after looking into your history, it has been determined that your opinion has no worth.", "label": 1}
{"text": "Go ahead and provide examples and we'll discuss.\n\nUnless you still feel like running away of course.", "label": 1}
{"text": "Fortunately after looking into your history, it has been determined that your opinion has no worth.", "label": 1}
{"text": "Answer:  he's employed by Peter Thiel.  His opinion is worthless now.", "label": 1}
{"text": "Did your middle school not teach you critical thinking as a kid?", "label": 1}
{"text": "lol dude what are you talking about. he works for a company that a libertarian invested in. There are many other investors at this company, all with different views. \n\nDo you not know what an investor is? or does your partisanship just make you ignore the most basic of facts?", "label": 1}
{"text": "“Answer: “ The betting odds showing Trump is a likely victor are due to 2 very closely related factors.\n\n1.\t⁠These numbers have been highlighted and circulated via supporters of Trump. Polymarket for example has been advertising very heavily this past month on Trump-supporting platforms.\n2.\t⁠A plurality of these bettors are men and/or trump supporters. The idea is, that if betting markets show a Trump victory, that will increase support and likelihood of his victory.\n\nIn markets like these that have to do with sports or current events, trends typically follow an observable pattern. We’ve seen a decline in his percentage recently, with it topping out at around 66 a week to two weeks ago.\n\nThis is due to a sell-off, where people are satisfied with their winnings having gone up in value, and don’t want to risk the possibility of their bets being called against a Trump loss.\n\nFor example: if you bought in September 24’ for $.25, and sale price is around $.75 the day before election, you can mark a 200% increase by selling off your position. This could be a very large pay-out depending on how much was bet.\n\nTl;dr, these numbers don’t mean much in the grand scheme of things, but they do identify a high-confidence among those placing the bets that Trump will be the president.", "label": 1}
{"text": "Harris astroturfers aren't really good at math huh", "label": 1}
{"text": "No they haven't, someone burned $3m the other day by buying all Trump bets up to 99.7%, did the price just stay there? No, in an instant it was gobbled up by opportunistic/smart bettors and the odds returned to what they where, people didn't even notice it in the hourly price graph it was over that quickly. You're talking out your arse and I don't blame you because outlets like NYT and WSJ have lied to you and taken advantage of your (and America  in general) lack of understanding of betting exchanges and prediction markets.", "label": 1}
{"text": "No mercy for you cowards", "label": 1}
{"text": "Seems like Conservatives are pretty Liberal with their money if you ask me. Wonder if these are the same guys who invested in Truth Social. Lol.", "label": 1}
{"text": "His odds are for a higher payout - clearly the gambling corporations think he'll lose. How is this hard to work out?\n\nYour a) is silly - gender doesn't matter to bookmakers. Your b) is just stupid. Your c) is your arrogant username.", "label": 1}
{"text": "He made less bad predictions in 26 than others but he looked nerdiest so he's supposed to be more right...\n\nIn a nutshell\n\n\nAlso he was a bit annoying re covid guidelines", "label": 1}
{"text": "Him and his camp invited several politicians. Seems only JD and Trump accepted", "label": 1}
{"text": "Answer: Kamala is probably worse. Its that simple. With her WW3 is almost certainly coming. Trump has proven to prevent wars in the past. He would bring peace.", "label": 1}
{"text": "Stfu. I hope you stub your toe today. \n\nImmediately saying this dumbass rhetoric about ANYONE who doesn't share your politics is a sign of a weak mind. \n\nGtfo", "label": 1}
{"text": "You’re clearly far too emotional to be reasoned with. Enjoy the next four years.", "label": 1}
{"text": "I've listened to almost every rogan episode. I can assure you he has never had a Nazi on. \n\nNow he has had people that the left labeled as nazis because they don't have the intellect to have An actual conversation about politics without screeching nazi nazi nazi. \n\nSo just to be clear.......your opinion is just that. An opinion. And what you're doing is hate speech. \n\nYou are the nazi. Using nazi tactics. Please stop being a nazi.", "label": 1}
{"text": "You are rabid", "label": 1}
{"text": "Crackpot loon", "label": 1}
{"text": "And you stock Reddit profiles.\n\nYour life has no meaning!", "label": 1}
{"text": "From your link:\n\n>How do experts on fascism view Trump?\n\n>They are divided.\n\nSo, you're slam drunk and clearly very biased article can't even solidly lock him down as a fascist. Hardly compelling, but an excellent example of an actual bullshit argument.", "label": 1}
{"text": "Did you read the evidence for?\n\nI like how you have so little intelligence, that you highlight the article being the opposite of biased and then call it biased. That made me laugh.", "label": 1}
{"text": "Dude you’re working overtime in this comment section lol. Get a life, dude 😂", "label": 1}
{"text": "You’re naïve", "label": 1}
{"text": "Russia. Lol", "label": 1}
{"text": "\"Going by his act\" fucking christ, this why nobody can take you people seriously.", "label": 1}
{"text": ">\nCentralized Autocratic Leadership: Power is concentrated in a single leader or a small elite group.\nNationalism: An intense focus on national pride, unity, and often the supremacy of one’s own nation over others.\nSuppression of Opposition: Political dissent is restricted through censorship, intimidation, or violence.\nControl Over Society and Economy: The state exerts significant influence over both public and private life, including economic activities.\nMilitarism: Emphasis on military strength and the use of force to achieve national objectives.\n\n- Show me where it's proposed that Republicans will remove the Senate, House, and all checks and balances. You can't so that's nonsense.\n\n- The US has always been nationalistic regardless of who is in office. Are we really spinning pride and unity as bad? Lmao\n\n- Suppression of opposition....you mean how democrats tried putting Trump in jail when he decided to run for President again? You mean how he was censored with a gag order during the trial or how he was removed from Twitter his last term? That kind of suppression? Or are we talking about democrat strongholds exerting significant influence over the lives of private citizens by forcing them to wear masks and be shut ins for a couple years because of the flu? That kind of suppression.\n\n- The US has always taken pride in its military and used it as a deterrent.\n\nGo ahead and take your L. I'll take no further comment from you since you're obviously just commenting ass first on here.", "label": 1}
{"text": "Answer: celebrities endorse candidates that they align with politically or can benefit from to boost their chances of winning. You see a lot of Hollywood celebs endorsing Kamala for the same reasons", "label": 1}
{"text": "You really need to get off Reddit bud, you're in a literal psy-op.", "label": 1}
{"text": "\"Viciously.\" Ok. Sure. Poor little pissbaby can wipe his tears with his millions of dollars. \n\nThe man was platforming fascists for years and now he finally took the mask off. I'm afraid the only proper response to your defense of him is \"fuck you for being so damn gullible.\"", "label": 1}
{"text": "Leftists who say this is very unhinged", "label": 1}
{"text": "Ahahahhahahah totally called out for the Scam Citizen support. Duped by Trump and RSI. What a fucking sucker!", "label": 1}
{"text": "Ah yes, noble redditor, your political opinions and yours alone are the only valid views. Anyone that dissents must be a fascist.", "label": 1}
{"text": "It's easy to understand when you realise Joe Rogan is a fucking moron. If he had a pumpkin on his podcast recently he'd be endorsing that for president.", "label": 1}
{"text": "americans are too lazy to do the jobs “they take”", "label": 1}
{"text": "Like many men with smaller than average penises Joe has latched on to the Trump train as a safe space for the phallically challenged. There they can share their roofie stories and support each other through their sexual harassment allegations. Personally, I think Jamie is about to write a tell all book and he’s trying to get ahead of the ‘Joe will bottom for a cookie’ rumors.", "label": 1}
{"text": "I guess you happen to forget about Hilary claiming the Trump presidency was \"not legitimate\" for the whole time he was president?. \n\n  \ni find it very funny how the left seem to cherry pick and forget that \"there side\" is doing EXACTLY what they accuse the \"other side of\". corew1n is correct, you are in a literal psy-op. \n\n  \nas the saying goes time and time again, once you see it you cannot un-see it.\n\n  \ni also love how the left always end up name calling like a perpetual teenager its really cute. You do this because morally deep down you know you have no argument so resort to name calling or \"whataboutisms\" instead of an actual argument.\n\n  \nfor some reason you lap all the left wing propaganda up without doing your own research (which takes actual brain power and time) and end up with things like \"trump is a nazi\" \"trump is a dictator\", you do realise how utterly fucking stupid you sound, right?.  \n\n  \ntell me, is the world more safe now under a democrat biden administration or was it safer and more productive under a trump administration\n\n  \ncue the cognitive dissonance and whataboutism's.............", "label": 1}
{"text": "The fact you think that’s all abortion is about proves you know absolute shit about fuck.", "label": 1}
{"text": "And  the fact that Harris, Clinton, Kerry Waltz have all said  free speech is not a right.", "label": 1}
{"text": "Dude is a ratings mouth piece? Dump his ass man", "label": 1}
{"text": "Trumps supporters buy his shit 🤷‍♂️", "label": 1}
{"text": "They would have provisions written into abortion laws to take account for these situations already so there would be no need for anyone to ask obtuse whataboutisms on reddit.\n\nhttps://www.kff.org/womens-health-policy/issue-brief/a-review-of-exceptions-in-state-abortions-bans-implications-for-the-provision-of-abortion-services/", "label": 1}
{"text": "Guaranteed to lose money? That's quite the assumption, goober. Just because you are unaware of the advantages of voting for a Democratic ticket doesn't mean that there isn't any.", "label": 1}
{"text": "You want me to vote for a democrat? For abortion? Yes, the most important issue to me is so my daughter has the right to get rawdogged without consequence and murder babies. Sounds good! 😂😂😂", "label": 1}
{"text": "Nah you’re just so extreme that you can’t fathom someone who sees merits on both sides.", "label": 1}
{"text": "Are you seriously this delusional?", "label": 1}
{"text": "You don’t believe abortion is murder if you support exceptions. “Murdering” the rapist child is not ethical. “Murdering” a child as a sacrifice to save someone else is not ethical. \n\nYou are just posting hyperbolic nonsense.", "label": 1}
{"text": "I’m posting what the law is, child.", "label": 1}
{"text": "Because as Elon stated - \"I'll say it again, I think this is the last election if Trump doesn't win... If the Dems win this election, they will legalize enough illegals to turn the swing states and everywhere will be like California. There will be no escape... This is it. This is the last chance. \"\n\nYou can see it clear as day unless you are overlooking it on purpose 🤷‍♂️", "label": 1}
{"text": "Don’t try your bullshit games with me. We all can see the entirety of your comments. You called abortion murder and then tried to justify the stripping of women rights and protections by leaning on the life/rape exception. \n\nIt’s either murder or it isn’t. It isn’t. \n\nNow you land in the final vestige of a scoundrel “I am just pointing out the law”.  First of all not everywhere. Secondly it shouldn’t be the law if it “murder”. \n\nYou are copying tired old games that are played out.", "label": 1}
{"text": "Not sure you used the correct defused there but go off chief", "label": 1}
{"text": "His last Netflix special bombed. This is way of staying relevant", "label": 1}
{"text": "They paid Joe Rogan X amount of money for the endorsement obviously", "label": 1}
{"text": "It's like -- then don't publicly endorse a political candidate then, you dumbass.", "label": 1}
{"text": "It’s definitely murder and the current law has carve outs that allow you witches to murder babies in a handful of conditions.\n\nI didn’t justify the stripping of women’s rights, they never had the right to murder babies.", "label": 1}
{"text": "Some factors include covid management under Biden, RFK and Tulsi being taken into the republican fold, Bidens record and Harris’ failing with the border.", "label": 1}
{"text": "I brought up the carve outs because you liars are lying about how they don’t exist and how abortions are banned when they’re not.  You people are nothing but lie lie lie, hypothetical scenario that’s irrelevant, anger and screeching", "label": 1}
{"text": "Just because people talk and ask questions for a living doesn’t make them less hypocritical and more principled people. His code: Joe’s covering his future “in” with Don.", "label": 1}
{"text": "I’m guessing he won the Musk lottery.", "label": 1}
{"text": "My guess involves lots of money.", "label": 1}
{"text": "He has always been a trump supporter from day one", "label": 1}
{"text": "Because Joe knows how dumb anyone is that follows CNN and the BBC.", "label": 1}
{"text": "He's a card-carrying misogynist.", "label": 1}
{"text": "He knows who butters his bread.\n\nEndorsing Kamala would easily cut his viewership by like 75%.\n\nIf he doesn't endorse Trump and Trump loses, he'd lose a lot of viewers who would likely blame him for not endorsing Trump.\n\nIt's mostly a business decision, but also he shifted into Trumpism without realizing it a while ago.\n\nOne of the more defining moments was about a year ago when Biden was making fun of Trump (when he was president) for praising revolutionary forces for taking over airports during the American Revolution during an Independence Day event. Rogan was so excited to talk about it on his show, not realizing Biden was quoting Trump and thought it was a core dementia moment for Biden.\n\n[Here's Rogan](https://www.youtube.com/watch?v=J2ilWxRn0_A), in real time, deciding that this was so dumb that it means Biden should be pulled. When it's pointed out that it's in fact Trump that said it it was simply 'ah he fucked up'.", "label": 1}
{"text": "From Joe Rogan himself, the two most influential people to him are Dana White and Elon.  Both just asserted their influence, and naturally squoze an endorsement out of him.", "label": 1}
{"text": "Fuck off bot.", "label": 1}
{"text": "You are the one calling for fascist authoritarian diktat.\n\nI'm calling for freedom and choice.\n\nLet that sink in, wall of text dude. Let that sink in.\n\nVote my way, or off to the camps with ya.\nNot a good stance.", "label": 1}
{"text": "Trump is going to win.\n\nFor the Iowa Selzer poll that Silver included in his model , my opinion they were trying to boost moral and voter turnout for the Dems which has been abysmal.\n\nThe poll had “0% of Democrats said they are voting for Trump.” That is a stat that you do not see in any other poll nation wide AT ALL. Not once. I call bullshit and Silver just added it to his model Willy nilly and as we can see from the writing on the wall.\n\nThat Iowa poll was absolutely wrong. She needs Obama numbers for that Poll to be correct. She doesn’t even have Biden 2020 numbers, this race is over.", "label": 1}
{"text": "Sounds good everyome who disagrees w you is ignorant.", "label": 1}
{"text": "Joe Rogan is dumb, rich, and powerful. His mind and ideology are mashed potatoes.", "label": 1}
{"text": "Well I’m going to predict there are a lot of bookmakers are going to make a lot of money…", "label": 1}
{"text": "Answer: because he’s going to win in a landslide", "label": 1}
{"text": "Answer: people are being ridiculous. All votes are anonymous. And hot tip, you can go vote without anyone else being present like your husband. And whose husbands are dictating how they vote? It’s 2024. Do y’all really think this still happens? Clown world", "label": 1}
{"text": "And my wife won’t know I really voted for Trump 🤷🏽‍♂️✌️", "label": 1}
{"text": "It’s an anonymous vote 🙄", "label": 1}
{"text": "And proud of it 👌", "label": 1}
{"text": "So like .0001% of the population 👌", "label": 1}
{"text": "The honest answer is 1:10,000,000", "label": 1}
{"text": "Source: your ass", "label": 1}
{"text": "That pet social media was used to feed & fund a whole animal shelter, you dehumanized monster. Shame on you, fascist criminal.", "label": 1}
{"text": "It’s an anonymous vote 🙄", "label": 1}
{"text": "Buckle up for the landslide 👌", "label": 1}
{"text": "Well, I did confide in her boyfriend. He may have spilled the beans 🤷🏽‍♂️", "label": 1}
{"text": "Am I a… deplorable? Or garbage? I’ve been called both but not sure which moniker I prefer… 🤔", "label": 1}
{"text": "“Secretly”. The key word. No one knows who you vote for 🙄", "label": 1}
{"text": "Good lord. The mental machinations y’all are going through to make it seem like men are pressuring woman to vote some sort of way is breathtaking. If anything, women are pressuring men to vote for Kamala, not men pressuring women to vote for Trump.", "label": 1}
{"text": "I’m comfortable with both, actually", "label": 1}
{"text": "Who did I vote for?", "label": 1}
{"text": "How do you know who I voted for?", "label": 1}
{"text": "Gracias por votar!", "label": 1}
{"text": "That’s just reality 🤷🏽‍♂️", "label": 1}
{"text": "You too, sweet cheeks 😘", "label": 1}
{"text": "Exactly my point! What good is being called a deplorable, garbage, Nazi I can’t wear it proudly?", "label": 1}
{"text": "LOL. Ok 👌", "label": 1}
{"text": "Shhhh… here comes my wife’s boyfriend. Don’t tell him who I voted for 🤫", "label": 1}
{"text": "I “said” I voted for Trump. Did you see my ballot?", "label": 1}
{"text": "Answer: concerted disinformation campaign insinuating married women are being assaulted en masse by their husband for voting.", "label": 1}
{"text": "Answer: The Harris campaign released a  [tacky campaign ad](https://youtu.be/FaCPck2qDhk?si=HYIRGwklddCZu17S) that strongly suggests that privacy in the voting booth is the only thing that protects women from retaliation for voting for Harris.", "label": 1}
{"text": "Answer: reddit has always been very left-leaning.", "label": 1}
{"text": "Lol shut up bootlicker", "label": 1}
{"text": "Makes perfect sense given the amount of women who are turning out this election cycle who traditionally just vote the way their husbands do. They may even be with a man that would verbally or physically abuse them if they find out they are voting differently from them", "label": 1}
{"text": "This is asinine. That’s like saying black men don’t know they can decide not to abandon their kids, it’s just based on pretty insultingly degrading stereotypes.", "label": 1}
{"text": "does this apply to peoples' actions or the quantities of peoples themselves? because it could be saying that people do something less and less, rather than strictly fewer people treat him as a genius? real question.", "label": 1}
{"text": "Clueless “bros” fill those betting sites.", "label": 1}
{"text": "That's the extent of your argument?\n\nYou're clearly an idiot. This conversation is over.", "label": 1}
{"text": "You didn’t make a case you simply stated the fact that it was an outlier. That was my point dumbass", "label": 1}
{"text": "I will never understand that. Unless the nations who vote for the downfall on new Latino immigrants can admit they are evil selfish people. I’m Latino. All my family are legal tho. My husbands family tho, more than half of his family are illegal, but they like Trump. And the ppl in his family that can vote, voted for Trump. My husband has cousins who have illegal parents literally vote for Trump so he can get rid of illegals…..like wtf?", "label": 1}
{"text": "REDDIT SUCKS SHIT\n\nI was right and you all suck shit. The People have spoken and we said \"We want Donald Trump\". MAGA.", "label": 1}
{"text": "Because, unlike the majority of Reddit users, the real world is not an echo chamber all people hear about on Reddit is their own ideas, so they find it unfathomable that anyone else thinks differently.", "label": 1}
{"text": "Answer:\n\nIllegal Immigration\nPeople understand how illegal immigration affects society. They have witnessed firsthand the impact of decades of illegal Bangladeshi immigration, which has been a longstanding issue. The recent Rohingya influx has also been a topic of discussion for quite some time. In India, you can sometimes even observe hostility towards interstate immigrants from Bihar and UP. You can see it's effect in Canada.\n\nConservative Values\nIndian immigrants have generally assimilated and acclimatized to the societies they move to, integrating well. America may share some of these conservative values too.\n\nEconomy\nIndians are known to be among the highest-earning groups. Their preference for economic stability is reflected in polls of the American public.\n\nTrump's Stance on Religion\nTrump is seen as being tough on Pakistan and Bangladesh. He recently condemned the violence against Hindus in Bangladesh, while Harris did not acknowledge it.\n\nFor those prioritizing a better economy, stricter immigration policies, and a stance against Hinduphobia, Trump's position may be more appealing.", "label": 1}
{"text": "Oh the Gold Standard is it? \n\n🫵🏼😂😭\n\nJust curious if you’re actually embarrassed about being such a low IQ individual, or if you’re simply okay with it.", "label": 1}
{"text": "Cope clown", "label": 1}
{"text": "He cannot. I hate trump but please stop spreading misinformation. Reddit is not an accurate echo chamber", "label": 1}
{"text": "1. They ain't rich enough to feel those lower taxes, so that's fucking stupid... Although, I guess it will trickle down eventually 🙄\n\n2. Immigration is way harder than whenever your dad and family's friends came over, so they can fuck all the way off.\n\n3. We'll that just racist bullshit, so I'm not sure what to say about that.\n\n4. Fuckin what?", "label": 1}
{"text": "This is a ridiculous take considering Indians vote for democrats at one of the highest levels. Why is there more attention to the few Indians that vote republican that the majority of white women voting for them? Or the shift in black men or Hispanics?? Instead you’re just saying Indians have an inclination towards sexual assault. \n\nKeep pulling this nonsense and act surprised why every minority group is pulling out their support for the left and voting republican. What a bumbling moron", "label": 1}
{"text": "I grew up Ina majority Hispanic community in virginia that had a lot of Indians and this is a fucking joke. Ur community is the reason I had to carry a knife to school at one point, y’all had it out for us like it was a personal grudge almost. I’d really like to know who these racist Indians are because all I ever hear from a section of my community is how “similar” we apparently are and shit like that.\n\nTo anyone reading this this is a fucking joke of the highest order. I can count the amount of times Hispanics have ever come up in a conversation between Indians I’ve known (and I’ve known a lot), and  it’s in the single digits and 99% positive. Meanwhile we are pretty ignorant to the vitriolic hatred they have for us. \n\nAlso funny he talks abt scared and all this and that considering almost every time I’ve seen a Hispanic here confront anyone it was with like 30 of their cousins", "label": 1}
{"text": "Black people have nothing to do with the caste system you absolute mug 😂 I can show you in fact ancient texts where the Maratha Peshwas (generals who acted as tax collectors for the Maratha Empire, the biggest pre colonial Hindu kingdom), even explicitly stated they viewed the Siddis (East African descent Indians) as above Dalits", "label": 1}
{"text": "She was absolutely wrong. It’s hilariously bad", "label": 1}
{"text": "You mean the majority of Americans is TOO SEXIST for a woman leader….", "label": 1}
{"text": "Answer:  The majority of Americans are terrible people who support a rapist for president. That's really it. They are too sexist to vote for a woman. Evangelical Christians voted for the rapist by an 80 to 20 margin.", "label": 1}
{"text": "i’m American and I will vote for any women but Kamala, she had presented zero policies or plan on how to solve the current inflation. You are full of hate lil bro.", "label": 1}
{"text": "Probably cause those black men dated a lot of black women and don't want someone like what they exoerienced to be in charge.", "label": 1}
{"text": "Because fuck all the queer people steadily losing their rights, I guess.", "label": 1}
{"text": "We cant have bernie silly, we need a DEI candidate", "label": 1}
{"text": "Answer: I mean... where do you live? I bet either your country, or a neighboring one, has probably elected somebody between \"far-right\" and \"actual fascist\" to whatever the Head of the Executive is. It's a global phenomenon, so looking at any one country is foolish. \n\nWhat is the one thing that's universal now? Misinformation. The far-right's support is built on fear, hatred, and anger -- all of which is very easy to create if you're willing to lie and people are too stupid/busy/apathetic to actually look things up. \n\nProgressives, conversely, have to tell the truth (or at least something resembling it). Even worse than that, they have to do so about complicated issues (not just social issues like gender, but things like how hard the economy is to deal with and why taxes and social welfare programs are good things). \n\nNuance loses out to nonsense, because the latter can be produced at a near infinite pace.", "label": 1}
{"text": "Here we are... 🤦‍♀️", "label": 1}
{"text": "Americans think having a female leader is a weakness.", "label": 1}
{"text": "This is the thing that frustrates me and I think was ultimately the downfall of the DNC and all democrats in general this this year. Even before last night, the rhetoric was that if you vote republican you’re a racist, a fascist, an idiot, poorly educated, a redneck, etc. and while some of those may or may not be true in some cases, its a major failure to not look outside of those factors, see what legitimate reason someone might be prone to vote republican and appeal to those issues specifically to understand what the majority of Americans want, not just suburban and urban citizens. Why the hell would someone who’s planning to vote republican switch to the party who’s leaders and/or voters go out of the way to call them uneducated garbage?\n\nI guess to sum it up not all who voted R were forgone conclusions but democrats (at least those in the Reddit echo chamber) basically had the attitude of “we don’t need them anyway,”. But turns out they did and I think it would behoove everybody to understand the “other side” and the truth behind what motivates them to vote the way they do. Because I promise it’s not just racism, sexism, and fascism and if we assume it is - which I’m sure will be the case - prepare for another round in 2028 (if there is a 2028)", "label": 1}
{"text": "Decimal (2) = Binary (10)", "label": 1}
{"text": "If he was more popular than Hillary he would have won the nomination. The superdelegates didn’t work that way. God you people are just incapable of learning anything that doesn’t fit your worldview and I’m so sick of trying to explain the basics of how a primary works because someone lied to you the first time and you liked it so it’s been “your truth” forever and you won’t bother to learn the actual truth.", "label": 1}
{"text": "Just keep shuffling those goalposts, asshat.  Maybe if you demand that I defend Trump's tariffs everyone will forget we are talking about Harris's total disconnect with the issues voters care about.", "label": 1}
{"text": "Answer: here's the information you need \n\nhttps://www.nytimes.com/2024/11/04/technology/meta-ai-military.html", "label": 1}
{"text": "We need to stop pretending that immigrants always represent the entire society they come from", "label": 1}
{"text": "No, her whole campaign wasn’t fear if trump won.  She pointed out that he tried to overturn our vote (being ok with the killing of his VP), and that he is an embarrassment.  She ran on hope and opportunity - and also fear of a fascist, based on facts.   In sum, fuck off, Russian bot.", "label": 1}
{"text": "Trump won iowa, and the election.", "label": 1}
{"text": "I’m not a bot you dweeb", "label": 1}
{"text": "The mess ran out of a recipes. ", "label": 1}
{"text": "No agenda, no leaders, dominant voices were party wackos like AOC vs Trump simple and consistent messages.  Focusing on fringe issues like pronouns also had a material impact.", "label": 1}
{"text": "He sold put and betrayed his Libertarian principles and his legacy will be lost among the rest of the spineless kowtowers.\n\n\nAs a 42 year old life long Libertarian, fuck Ron Paul.", "label": 1}
{"text": "Yeah.. over on the conservative subreddit they don’t overmoderate. That’s why they won!", "label": 1}
{"text": "This answer is moronic and misses everything.", "label": 1}
{"text": "Most people vote only one or two key issues.  I think many people are truly frightened by the Democrats and the legacy media wanting to stifle free speech by censoring free speech.  The Democrats hate the game changing power of the internet to let people hear more than just the state run narrative.  The world is changing and the Networks and Newspapers are beginning to wake up to the fact  that they don’t get to gatekeeper anymore.  Also Democrats seem to be too blinded by their own moral superiority to take an honest look at what a horrible candidate they elected, oh sorry, I mean anointed.  And today they are making the same mistakes that cost them this election:  scream and demonize over half the country because they find other things more important than they do.  Trump voters ticked up in every demographic.  Latinos and Blacks and Women all became homophobic, transphobic, racist, misogynistic Nazis over the last four years.  That is the only answer that Democrats who live in an echo chamber can come up with.  Until the Democrats take an honest look at why they lost this election, they are doomed to repeat it.  That is my take as a registered Independent.", "label": 1}
{"text": "If you want to hear from republicans you won’t be able to on Reddit they are all censored in the echo chamber", "label": 1}
{"text": "It’s way too soon to make this conclusion. Wait for all the votes to come in.", "label": 1}
{"text": "The Democrats are unelectable. This has been the popular opinion among normal Americans for decades. Democrats are elected solely based on the merit of not being Republicans. Nobody likes Liberals despite how belligerent the echo chambers here get.", "label": 1}
{"text": "\\>Devils advocate from Canada here. If your a poor white person from middle America that doesn't see a lot of people of colour, if any, how many times do you need to be told to check your white privilege before you just get angry? If you poor and feel the current government isn't helping you, how does having access to abortion help you? If your poor what do lgbtq rights do to help you?\n\nAmerican here, and I agree. I am in a \\*very* left-leaning city. I've seen that rhetoric for well over a decade: If you're white, you're privileged and benefit from the system regardless of your income level. If you're not a part of Antifa or support them, you're racist. If you're white, you don't understand the struggles of people of color. (Never mind that [U.S. history shows otherwise,](https://en.wikipedia.org/wiki/Racism_in_the_United_States#European_Americans) but that's a comment for another day.) If you're straight, you're either an ally or supporter of the LGBTQA community and LGBTQA rights, or you're the enemy--no middle ground.\n\n...after seeing that, you have to wonder what's the point in voting for a party that tells you you're in power and evil, or automatically their enemy, even though many people regardless of skin color, gender, and sexual orientation are just trying to make it from paycheck to paycheck. Bernie Sanders is right: The Democrats turned their backs on a large segment of their voting base that they used to champion: Poor and middle-class white people, many of whom live in central states. The result was visible in yesterday's election.", "label": 1}
{"text": "Why couldn’t you go BACK IN TIME and do it? Maybe because we were too busy doing it then dipshit", "label": 1}
{"text": "Even trump thought what they did to Biden was too much \n\nthe DNC became tyrannical with their censorship and media control", "label": 1}
{"text": "You are daft if you think they have similar levels of dementia.\n\n\nWelcome to why you lost the election.  You can't even tell basic truths.", "label": 1}
{"text": "You’re not even Indian dude why tf are you speaking on this? Weirdo. Indians vote blue in America 2:1. ", "label": 1}
{"text": "Democrats primaries are fake dipshit. The DNC has been caught rigging the primaries and you have super delegates, which are nothing more than a tool to sway you toward a chosen candidate. Your whole worldview is synthetic.", "label": 1}
