{"text": "I'm literally korean and clearly I succeeded LOL, idk what it is, I grew up there so I guess all that PC Bang rotting made all the Koreans players super toxic😆. I just know what they're insecure about.", "label": 1}
{"text": "Forced crossplay killed it.", "label": 1}
{"text": "Overwhelming slay-power.\n\nWhich is to say, she's talented, brilliant, incredible, amazing, show stopping, spectacular, never the same, totally unique, completely not ever been done before, unafraid to reference or not reference, put it in a blender, shit on it, vomit on it, eat it, give birth to it. And has immense damage potential, babe.\n\nWhy, just last night, I was defending on Midtown 2nd point that little room overlooking the tunnel (the one Widows like to hide in). Anticipating our enemy Widow would set up within, I set up my glamourous turrets. And when my sanctum-parlour was breached by not one or two, but three enemy squishies? Brig, Weaver and Sombra were smote by my dazzling intellect. Exodia Obliterated within 5 seconds of one another by my hand, and no other's.\n\nTo dislodge me from my throne was sent Reinhardt. He did not succeed, for in my mind I had forseen this, and a quick flick later I had traversed a great distance to safety, across the street onto the bridge. He stood in bewilderment at his wasted time, and fought within his own mind to stay there and deny me return, or leave and admit his folly. Later on, my mega-zesty laser would penetrate both his nano-boosted armour and pride.\n\nI love the satisfaction brought on my strutting in on snipers through my Teleporter, my arrival styling so hard on the likes of Ashe, Ana and Widow that they spontaneously melt. Or devilishly incanting \"[Bye bitch](https://www.instagram.com/lizzobeeating/p/CHTNoFvB6VN/?hl=en)\" as I effortlessly escape unscratched through a preplaced portal. \n\nMoveover, who has a statement piece as statesful as Photon Barrier? The ability to deny so much of an enemy's hard work, as if a counterspell by magic. \n\nShe is a flanker, frontliner, assassin, anti-sniper, ult-stopping Queen.", "label": 1}
{"text": "[This](https://youtu.be/xJXrfw7ybLA?si=ldwFxczn-3nc9tdi) happened.", "label": 1}
{"text": "Just like the game, the community sucks! :D Not a single reason, suck it up and drive on", "label": 1}
{"text": "Nope, the forced 50% has already been confirmed many time over.", "label": 1}
{"text": "Again, you're wrong and you don't understand why and you won't because you can't imagine any other point of view in the world but your own and I feel sorry for you. I'm done trying to educate you.", "label": 1}
{"text": "This would be the assumption you would make, yeah that tracks.\n\nMedal rank peak relying on a crutch ass play style butthurt you can't do it anymore?\n\nOr like, why are you so aggressive? God forbid someone has some feelings about a PERMANENT INVISIBILITY CHARACTER, MAN.\n\nSombra in my games on BOTH teams would be useless. Enemy Sombra players would just fall over to me, and my own Sombra players would always have less damage and elims than me as a Zen one trick. Y'know, the invisible assassin character.\n\nThe rework makes her actually have to engage with team fights instead of camping outside spawn, spawn trapping 1 support.\n\nBut you probably won't believe me, and I'll get downvoted for expressing a damn opinion 💀", "label": 1}
{"text": "Fuck this fascist!", "label": 1}
{"text": "Trump deranged much?", "label": 1}
{"text": "buddy, you’re delusional. dva is a pinpoint, but she ISNT the game. overwatch isn’t a dying game, it’s just not as popular as in OW1. juno did not save that\n\ni know you’re insecure about this cause you stroke your shit to a girl that looks 16 every night, but that’s, in fact, super weird!!! 😘😘😘\n\ni have shown photos of her to multiple people and asked them how old they thought she was.. never got anything higher than 19! typically it was 14-17!!!!!!!!!!! please PLEASE **PLEASE** ****PLLEEAAAASEEE**** go touch a grown woman", "label": 1}
{"text": "Blizzard needs to stop penny pinching as much as they've been. I get it, they exist to make money bla bla but return on investment is a real thing.\n\nFuck layoffs, hire a lot of people. Get more artists since that's the department that has suffered the most, there's been so much filler and recycled crap in the BP and shop, it's insane. Get enough artists to create original cosmetics and to make proper cinematics like we used to have. I get it, a cinematic is insanely expensive to produce, but you will see that investment come back because....\n\nYou NEED to bring back the lore. Plenty of non-gamers got into overwatch because of the immense lore and masterful worldbuilding. Nowadays there is a fraction of that. It all used to flow together, now it's more along the lines of \"heres Venture they do the diggy\", \"heres Juno she's actually from space\", the differences between the backstories of OW1 characters and OW2 characters are insane. I know that the lore hasn't stopped completely, we still get backstories and little lore bits. But it's nothing like what OW1 had, in OW1 everything fit together like an ever-expanding jigsaw puzzle. It seems they might be trying to get back into deeper lore stuff with Phreak, a character that seems to have very close ties to OW1 stuff, but I don't want to speak too soon. Do you remember the last time we had a hero that really mattered to the lore? Imo, it was Ramattra, almost 2 whole years ago.\n\nMore free cosmetics. I get it, the game copied fortnite's model now so skins have to be $20 and we need battle passes and constant crossover skins. But surely it wouldn't hurt to give more skins for free? It's NOT generous to give a single skin during a temporary event, hell, the skins they usually give out are genuine garbage! Tell me the last time you actually liked a skin they gave out for free during an event, it's not been in the last year that's for sure. And don't even get me started on the absolute dripfeed of legacy credits, we should be getting atleast 3 times as many of them, if not even more. Some of those cosmetics are 8 years old, it makes me really regret not grinding more OW1 for lootboxes. Hell, I think they should increase how many OW coins you get from the pass, you really should be getting atleast the cost of the pass back. I think charging for crossover skins is okay, OW1 had paid skins too like the OWL skins, Twitch sub skins, Blizzcon skins, Pink Mercy etc. But OW2 is out here taking OW1 lootbox skins, changing the colors slightly, and expecting us to shell out $20. Respect the customer Blizzard, or we will back out at any time. But I guess you'll just shove out more Kiriko slop, since that seems to sell well regardless...\n\nTL;DR Blizzard please dump money into the game and everything around it, I promise it will pay back even if it will take some time to regain the trust. The people that loved it are still there, you just pushed them away through a series of unfortunate events lined up one after another that you yourself caused.", "label": 1}
{"text": "Hi Op,\n\nSince everyone is scared or wanting to say it.......you have to give us the \"shot\"", "label": 1}
{"text": "Wow its almost like different people complain about different things. Is this your first time on the internet? Stupid kid", "label": 1}
{"text": "What buff did he get? I have been versing him nearly every game and it's so frustrating ", "label": 1}
{"text": "i think mid is best for both of them", "label": 1}
{"text": "I'd ur losing to moira as bap in a 1, it's a skil issue", "label": 1}
{"text": "Bastion", "label": 1}
{"text": "The real beauty of \\*Overwatch\\* is that it’s not just about fighting. Once you get to know the maps and heroes, everyone finds their own ways to use different routes to attack or escape. It’s not just everyone battling it out in one spot. When you’re up against a strong opponent, but you can keep the pressure on them by using your favorite hero, well-practiced skills, and your own routes to secure the win—that’s when you really start to love this game.", "label": 1}
{"text": "haha the skin is pay to win!", "label": 1}
{"text": "Any place with a background check is instantly reporting him to FBI (it looks great!)", "label": 1}
{"text": "OnePunchMan collab finally makes sense now!", "label": 1}
{"text": "I would recommend moira for sup (can play very aggressive), and cassidy for damage! Both are fun, and cass is really good right now. Good luck!", "label": 1}
{"text": "Bro, have you hit your head a bit to hard?\n\nDo you need an ambulance or some other help?\n\nI sadly am not that good in first aid, so I can't really help you.\n\nMan, I am seriously worried about you.", "label": 1}
{"text": "It's interesting how the game navigates the complexities of violence and morality. Omnics are portrayed as less than human, yet they serve as a canvas for the game's commentary on discrimination. The contradiction is striking. While the lore supports a more nuanced view, the gameplay choices ultimately reflect a desire to keep it kid-friendly. It's a telling reflection of how media often grapples with sensitive topics, using robots as a convenient shield against harsher realities.", "label": 1}
{"text": "Idk, this specific complaint seems like a skill issue. \n\nAs an Echo player, you have to get good at timing your flight so that it’s off cooldown in time for an escape, and sometimes that involves waiting for a second before going in.", "label": 1}
{"text": "I don't like Dracula because he looks bald", "label": 1}
{"text": "There are players like me who would play tank a lot more if it was 2-2-2 again. I dislike solo tanking. Nothing in the game currently motivates me to queue for it anymore. It's miserable. I would 100% queue for tank again, consistently, if it was 6v6 with role queue. My longest queue times are for support currently. I can basically instaqueue into dps or have less than a 2 min queue for comp any time of the day. We got sick of lack of variety in the tank category ( there were 5 or 6 tanks for 2 people to choose from) shields, stuns and visual clutter in ow1. Nobody asked for 5v5. I don't know if you remember when it was announced, but nobody wanted it. It wasn't like it was this idea they floated around or something mentioned on social media by players, etc. They basically just announced it and acted like it was the solution to our problems. We accepted it because we had PVE on the horizon so if the pvp sucked initially, it would be whatever.\n\nThey're gaslighting you into thinking 5v5 is better when all we really wanted was content and fixes to obvious issues.", "label": 1}
{"text": "I can't anymore, how do people don't follow the tactics in my head? 😭", "label": 1}
{"text": "Nah I'm cool, I just get like this when I play 👍", "label": 1}
{"text": "Finally someone understood it lol", "label": 1}
{"text": "kindly consider suicide please.", "label": 1}
{"text": "It's pretty simple,.if you are playing support and someone complains of chats shit even though you are trying your best then simply never heal them again and let them die 15 times. I take a loss i don't care", "label": 1}
{"text": "No lol I've made like ten accounts for smurfing purposes since high elo is unplayable with 20+ minute que times for all roles", "label": 1}
{"text": "Route 66, Kings Row, Dorado, more Im probably forgetting, all have spawn rooms right next to the end. Hanamura was the most egregious of them but it wasnt *that* much worse.", "label": 1}
{"text": "Brig or be brigged, the eternal Overwatch struggle.", "label": 1}
{"text": "Die", "label": 1}
{"text": "Just when you thought it couldn't get worse, here she comes again.", "label": 1}
{"text": "I suggest you to try Gametree. If you are looking for nice and non toxic teammates, it could be really nice place for it", "label": 1}
{"text": "What is it..?", "label": 1}
{"text": "So nice, I thought it is 3D", "label": 1}
{"text": "Bro i really want the Ashe haunted doll skin. I didnt even know that the damn skin existed. It came out like 2 weeks after i went to basic training last year and i never see anyone rocking it. Skin is dope af", "label": 1}
{"text": "Riot, small indie company. Still trying to learn console ports", "label": 1}
{"text": "Lmao IP bans famously aren't that hard to get around. You really think Blizzard would benefit from checking the government issued IDs of all it's paying customers across the world? Lmao okay, son. \n\nIf you want to be treated like an adult, act like an adult.", "label": 1}
{"text": "Ill tell u for 10$", "label": 1}
{"text": "I have to save Overwatch for later in the day because its so stimulating I find it difficult to read books or do other things afterwords lol", "label": 1}
{"text": "Yeah I always thank for the saves as well, often times not even reflexively but because Im genuinely surprised my ass lived.", "label": 1}
{"text": "I'm not angry I'm bemused that retards could think this was his fault.", "label": 1}
{"text": "At the end of the day though it’s on the Mercy to make the decision whether she’s wasting her time pocketing and if she could get more value elsewhere. Saying this only because I’ve seen some get so butthurt when you don’t let them pocket you and they think you’re throwing when in reality you’re just not feeling confident. What’s even better is letting them know in vc, to clear up any confusion and keep the match going regularly.", "label": 1}
{"text": "you're just plain wrong. just aim train and you'll get better and play widow to climb. simple as that. It's not that hard to climb", "label": 1}
{"text": "yea but if you played so good you'll climb at some point. You'll destroy the smurfs and cheaters and climb. ik it's like hard but just do that. /s", "label": 1}
{"text": "Mercy players...", "label": 1}
{"text": "This game is cooked honestly between the ranked system and how mmr works. Prolly be deleting soon. If not at least playing a lot less. Ive lost the desire to play especially seeing as one bad team mate can ruin a whole match", "label": 1}
{"text": "If u can’t handle trash talk on a game and leave you’re genuinely soft.", "label": 1}
{"text": "Somewhat, yes and no depending on who you ask. Ask me, I say yes because it becomes so blatantly obvious sometimes when your team is tripling your deaths, using  ults terribly, or almost any other situation that could happen, is happening. Then afterwards you go check the history and whaddya’ know? That one game ends up being one of three things. A, the game that fixed my 50/50 win rate for the day. B, the game that starts a win streak after a loss streak. Or C, the game that starts a loss streak after a win streak.", "label": 1}
{"text": "*loadcadell casts Axii* Uninstall Overwatch.", "label": 1}
{"text": "Have you tried switching from full screen to borderless or vice versa?", "label": 1}
{"text": "That was the CPU Temp that didn’t go above 60 C. Latency did shoot up to 130+ during the spike. Though I doubt it was server sided since he died to someone who obviously wasn’t lagging as well.", "label": 1}
{"text": "you’re subhuman", "label": 1}
{"text": "They need too.", "label": 1}
{"text": "Still horrible because Moira is not beautiful. \n\nJust like Sojourn and Zarya in formal suit skins, they still look unattractive because they both are not beautiful.", "label": 1}
{"text": "/u/SpriteGuy_000\n\nIs there a reason this user still isn't banned despite a consistent posting history of racism, homophobia, transphobia, Sinophobia, porn, and general trolling and flamebait comments like these?", "label": 1}
{"text": "why your ego is weak?", "label": 1}
{"text": "Ana has 0 mobility in a game where mobility is the king of all stats for a hero.\n\nNano is completely and htterly outsde of Anas control- in fact it is the only ultimate in the entire game that thw user has no control over its effectiveness. Bap can window his own shots, Mercy gets ammo buffs while in Valk, Lucio and Brig get extra health from their ults too, etc. Ana can have nano every team fight but if her team wastes it she has no way to make it have impact", "label": 1}
{"text": "This is fake and OP is the one saying all this, which is why they’re getting “too many message” notification. Clout chasing loser.", "label": 1}
{"text": "Very original insight!", "label": 1}
{"text": "It does. But everyone here is so excited to have a political hate boner they’re ignoring it.", "label": 1}
{"text": "I’m not in the US, but ok. \n\nYou Americans and your politics are so pathetic and sad.", "label": 1}
{"text": "Almost as pathetic as going through someone’s comment history. Did I get under your skin that badly?🤡🤡🤡🤡", "label": 1}
{"text": "My family is from there lol. \n\nYou’re a real loser you know that? What does it say about you that your feelings got so hurt by a comment that you’re now stalking my comment history and doing a deep dive on my Reddit account? Next you’re gonna claim you’re somehow detached and don’t care about this/me, but you’ve already demonstrated the opposite. Stay mad, loser.", "label": 1}
{"text": "And now you’re double commenting?!?! Hahahahahahahahaaaaaaaa. You sure are wasting a lot of time on a “failure” 🤡🤡🤡🤡🤡\n\nWhoa. Now they’re DM’ing me death threats. Blocked. Big yikes.", "label": 1}
{"text": "Nope", "label": 1}
{"text": "Imagine living a life of being triggered by a video game and random strangers every single match, you sound like the MtF that gets triggered when you get misgendered even though your 5 Oclock shadow is almost a beard", "label": 1}
{"text": "The 1/10 is when you're in the way of someone else that needs protection 😔 source: I main LW/ana on support", "label": 1}
{"text": "I watch it happen all the time.\n\nPeople lose a team fight or two, and suddenly they’re only playing for jokes and if someone gets mad about all the throwing they’re a ‘tryhard’, ‘they need to touch grass’, ‘it’s only QP’.\n\nIt’s pathetic. Wasting the time of the whole lobby because they can’t take the L. Nobody buys it.\n\nGo to customs if you wanna be a Reinhardt memelord and don’t play pvp if can’t handle a loss.", "label": 1}
{"text": "One specific moment comes to mind: our Juno was DPSing in the enemy backlines and was at very low HP, and I was right about to pull her but our Rein blocked her at the last millisecond and then promptly yelled at me for pulling him. :(", "label": 1}
{"text": "10$", "label": 1}
{"text": "As a girl, I don’t care", "label": 1}
{"text": "Stop being a botch lol", "label": 1}
{"text": "asking for heals is like trying to get the bartender to refill your drink\n\nyou can snap your finger and scream all you want, I'm going to ignore you until you learn how to counter swap", "label": 1}
{"text": "why's it matter? you swap sides anyway\n\nunless you're talking QP, in which case the game becomes unbalanced in defense's favor", "label": 1}
{"text": ">There's usually that one guy that takes it way too seriously when everyone else is trying to have fun.\n\nor there's one guy who trolls in the name of \"fun\" when everyone else wants to win\n\nand guess what? This is a competitive PvP game where players are expected to play to win, both in comp and in QP. Guess why there's a leaver penalty in quickplay?\n\ndon't sugarcoat trolling and throwing with words like \"casual\" or \"fun\"", "label": 1}
{"text": "OW doesn't have \"casual roots\". Can we stop joking around for one single second?\n\nYou wanna know what game had \"casual roots\"? TF2. For nearly 10 years, TF2 was a casual-only game. Sure, there were players who wanted to brag their skills and took the game seriously, but it was a meme-filled game with game modes so casual that you could freely swap sides in the middle of the game.\n\nIt was so casual that you could join and leave matches whenever you wanted with no penalty whatsoever. You could play whatever you want with no role restriction. You could spy crab around and no one gave a damn. That's what casual is.\n\nIt was only after Meet Your Match update in 2016 that TF2 developed any sense of competitive environment, but because of its \"casual roots\" the playerbase still argues to this day about friendlies vs tryhards.\n\nCompare this to OW, which launched WITH competitive mode on day 1 and added nothing but growing list of restrictions to discourage casual play.\n\nIf QP was truly meant to be casual, why is QP also split into role queue vs open? Why is there a leaver penalty? Why can't you play multiple of same heroes? That's because it's not a casual mode. You can delude yourself all you want about what \"casual\" means, but clearly you don't even know the meaning of the word when there was a clear precedence of what a casual game actually looks like lmao.", "label": 1}
{"text": ">A death on defense is worth twice that of on attack.\n\nAbsolutely not true. It may have been the case if we still had 2CP with the death timer penalties, but in the current OW2, the attack/defense maps are all payload maps one way or another. By the nature of payload as a game mode, defense has an inherent advantage because\n\n1. payload has to end up at defense's spawn, making deaths twice as costly to attack teams\n\n2. attack teams are bound to the payload while defense has an option to fight in or outside of its vincinity.", "label": 1}
{"text": "I main ball because no other hero does it like him. I didn't mind that he was considered bad but it definitely was a learning curve getting his gameplan down and figuring out good grapple spots but now he's the hero i have the most fun with without a doubt. I still like other tanks like winston, doom, and ram but in most situations i try to make ball work because he's my favorite.", "label": 1}
{"text": "i love how you sidestep every question by not addressing the point.\n\n>Meanwhile almost every point you asked **were literally in launch overwatch**\n\nand yet were taken away. \n\nWas mercenary stacking taken away in TF2? It was in competitive mode, so why not casual mode? Why can't OW do the same? Because OW isn't a casual game.\n\nWas team size restriction put in place for TF2 casual? Absolutely not, but it exists in competitive. Why? Because one is clearly meant to be casual and another competitive.\n\nLook at you and your mental gymnastics to make excuses for QP faithfully following in the footsteps of competitive changes and still going \"hurr but it's meant to be casual\".\n\nWhat a joke", "label": 1}
{"text": "You miss the point. I said it doesn't tell the full story (aka, it needs context). But facts are facts. There's nothing else to it. If your heal is half that of your other support, then the fact that you have half the healing done is a cold hard fact.\n\nHow you want to explain away given the context of the game only comes thereafter", "label": 1}
{"text": "Ana is not supposed to be a healbot, correct. But then again I don't see people dumping dmg into a tranq unless they got anti'd or otherwise can pop someone with burst dmg.\n\nIf you're at a level where zen ult can actually gain significant heals done because enemy team has no reaction whatsoever to the fact that there's a zen ult, I guess anything's possible.", "label": 1}
{"text": "QP has its own MMR system lmao. What do you think comp queue uses as baseline for new players with no previous comp records to baseline? Why do you think the game makes you go through 50 QP wins before placing you?\n\nLook at your delusional mental gymnastics now spouting blatantly false info to try and squeeze your narrative into a smaller and smaller glory hole.\n\nWhat makes OW's QP \"competitive\"? Because it follows in the footsteps of competitive changes whereas that's not the case in TF2, which separates the two game modes and changes in comp doesn't affect changes in QP.\n\nYet here you are going \"ooh that must mean you think pokemon is competitive\" yeah fuck off with your bullshit logic lmao.\n\nI'm done entertaining your monkey brain that wouldn't even understand 1 + 1 = 2.", "label": 1}
{"text": "k so looking your profile, you take great care to mention whenever possible that you're a T500 with no proof whatsoever to back any of your claims\n\nin fact the only times you ever mention your rank is for the purpose of shitting on other people who you want to degrade is inferior to you\n\nnot only that, but in all your \"T500\" wisdom, you make blatantly false comments like how  the **only** hero with lower win rate than Ana is LW because Kiriko outshined her in every aspect ever since release. Must be real funny to find out then that according to Overbuff, Kiriko is below Ana's win rate in GM over the course of the year as you described eh?\n\nYeah, you're full of shit liar is the conclusion. T500 my fucking ass LOL. Can't even do basic research to pretend properly just so he can act like he has some authority in and his words matter for once in his fucking miserable life. How pathetic are you kid lmfao. Fuck off.", "label": 1}
{"text": "I didn't say \"any story is better than no story\", I said partial story is still a true and accurate story. You can't judge a book based on chapter 1, but what's written in chapter 1 is still an undeniable part of the book.", "label": 1}
{"text": "you are running a theater in your head my dude. Stop trying to create a scenario and just read a sentence for exactly that and nothing more: a simple one-line sentence.\n\nI don't care what the underlying context is or whether that exonerates someone from blame or not. All I said is numbers are numbers and facts are facts. There will be situations when what appears on the surface was indeed a refraction of the truth underneath and sometimes not. But why are you creating all these hypothetical scenarios in your head about \"what ifs\" and \"but in this case\" etc?\n\nIf a soldier did 6k damage and widow did 15k, then the soldier didn't even do half the damage that widow did. That's the fact. Whether that leads to legitimate blame is a context that only people in-game will be the judge of and is none of my nor your concern.\n\nIt really boggles my mind why people need to shield themselves in some kind of olympic mental gymnastics that they just can't accept a fact for what it literally is lmao.", "label": 1}
{"text": "As someone who recently came back as a ow1 player, the thing I love the most about OW2 is their obliteration of the excess CC. I played from 2017-2021, and I think it was the most prevalent problem with the game over its history. \n\nI do miss Mei's freeze though. She was an old main that feels unbelievably lukewarm now.", "label": 1}
{"text": "junkensteins trained me into nailing the time on those", "label": 1}
{"text": "I don’t care what you think lol. Never have. You’re in denial if you can’t see that it’s a commonly held belief and that you are the one in the right. Delusion is a side effect of playing mercy lol.", "label": 1}
{"text": "bro was popping Black Flashes", "label": 1}
{"text": "Only reason why is cause it’s the only “quick multiplayer” out there to keep your brain rot ADHD asses entertained", "label": 1}
{"text": "Maybe its because I used to play on console, but in OW1 I felt maybe 1 in 10 matches Id get 2 or 3 people that wanted to stay as a team, and half of those we would get the whole team to stay together and vibe together for the rest of the session. \n\nIve dumped 100 hours into ow2 since coming back for the anniversary, I have not had a single person click stay as team. Kind of depressing, honestly.", "label": 1}
{"text": "NOOOOOO... I just want my total mayhem back 😭 it's been WEEKS!", "label": 1}
{"text": "I started sometime before the 2017 anniversary (I dont really remember but have the icon) through to 2021 before getting so infuriated that I broke my disc (lol) and quit \"forever\". \n\nCame back during OW2 anniversary, been having a blast. Overall I feel the game is infinitely more balanced and enjoyable, but in truth I do long for a lot of the jank of OW1. The hard counters were worse, CC was out of control and the game was a frequent source of anger, but the joy Id feel from games, when I did, was just as intense as the anger. The game now feels consistent, and because of that, less invigorating.", "label": 1}
{"text": "I always use both but sometimes its a bit off", "label": 1}
{"text": "If you've never played comp before on the account, the game will use your QP records to predetermine your rank and MMR. Placement matches only marginally moves the needle from the baseline.", "label": 1}
{"text": "Turn off the news forever. Go outside. Meet real people. Go to music festivals. Nobody wants you dead. People are more loving than the media makes you believe.", "label": 1}
{"text": "Skill issue", "label": 1}
{"text": "WTH is that dash???????? gotta be potg", "label": 1}
{"text": "That happened to me yesterday with a QP match! We were all so confused 😭😭 it's happened a few times before that and it's super weird.", "label": 1}
{"text": "drop", "label": 1}
{"text": "Sorry for saying this but I am gonna honest here, the face is little ugly. 5/10", "label": 1}
{"text": "I mean, fashion is subjective. I personally think the Olympia (White coat with red shirt) skin is their best skin but others can have other options.", "label": 1}
{"text": "Wow 😂👍👍👍", "label": 1}
{"text": "Wow buena 😂👍👍👍👍", "label": 1}
