{"text": "Considering she can 1-tap anyone except tanks and Bastion anywhere between point-blank and 70m with no cooldown...\n\nNo. The only safe way to get a Widow was Sombra's BS stealth, which was the reason Sombra was miserable to play against. Now on some maps, the only counter left to a good Widow is a better Widow.", "label": 0}
{"text": "Yes!! Bc that explains why they DC last minute when we are about to win! They've admitted themselves they're smurfing:)", "label": 0}
{"text": "If they did that they’d almost double the worst-case queue times in OW1. Or if both became main modes, they’d effectively have to balance the game twice per patch. 5v5 and 6v6 play so differently, and that goes for every role, not just tanks. They might make the “loser” of this test into a permanent arcade with the winner being the main mode, but it’d be similar to open queue in that we shouldn’t expect a very fun or balanced gameplay loop with frequent updates.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "I like 2 Tanks coming back, but 3 of one role is genuinely gonna be toxic for the game\n\nImagine 3 DPS diving a Support\n\nImagine 3 Supports pump healing an Orisa", "label": 0}
{"text": "The biggest issue I've had with Damage while playing Tank is that they never go after the enemy Supports. Many of them would rather just sit behind me and engage in a war of attrition with the opposing Tank while their Supports heal them.\n\nIt's honestly gotten so old that I've stopped playing Tank for the time being. If there aren't enough Damage players focusing enemy Supports, then I'll be that Damage player.", "label": 0}
{"text": "The over extension drives me absolutely fucking nuts. I lose point and game EVERYTIME to overextension. No matter how many times I say in chat to group up or whatever. It makes me mad when we’re winning and just lose because the stupid mauga runs in dies and then they just flood in. I just started playing LW and I’m pulling them in I’m so tired of it. I don’t realize I needed to be a dog sitter to play overwatch.", "label": 0}
{"text": "I’m tired of the you are the only constant narrative because how the hell am I supposed to carry?… Did we forget it was a team game", "label": 0}
{"text": "I don’t know. Queue times can already be upwards of 10-12 mins for dps/support now at 5v5. Add another slot for the least popular role and they will certainly increased. I’d love to be proven wrong, but I’m not convinced they won’t be an issue even with the game being F2P.", "label": 0}
{"text": "ill be real, the amount of people that will pick a hero because they are hot are much smaller than the amount of people that will pick a hero because they are fun.. \n\nfun > everything else.\n\nwhy do people rant and rave about jq? is it because shes hot? sure, but most people like when shes in play because shes fun and not oppressive when shes not overtuned, she isnt orisa, she isnt mauga, and she sure as hell isnt hog.", "label": 0}
{"text": "Dude it’s so fucking ridiculous lately. I literally CANNOT get out of silver no matter how hard I try and no matter what characters and strategies I use. How the F can I compensate for a healer with less than 3k heals, or a tank who constantly over extends, or a DPS who’s 2-12 with like 2-3k damage when I’m going like 14-3 with 7k dmg. It feels like I’m literally playing alongside easy bots sometimes. Or the worst is people who decide to go in the absolute dumbest directions way far away from the team where I can’t heal them and they die immediately. If I try to go help them out and heal them then I die too. Lose lose situation", "label": 0}
{"text": "Dopamine.", "label": 0}
{"text": "Weird", "label": 0}
{"text": "Funny story with that. I had such a drawn out fight with a dva one too me that he got his explosion three different times. And no, he didn’t pull away for very long. The last one killed me.", "label": 0}
{"text": "I know the junkenstein’s lab is pretty popular but I would probably quit playing if that came to the main game. It’s impossible to know what an enemy is capable of in that mode. You basically can’t have a strategy because you have no idea what’s going on", "label": 0}
{"text": "Extremely ironic post", "label": 0}
{"text": "I literally play with the team, and support the team.  Ik this isn’t a solo carry game. Do you really think I wanna run around with my head cut off? No absolutely not. I swap to whatever supports the team. So let’s not assume.", "label": 0}
{"text": "Lmao my buddy plays weaver for this exact reason (I also really dig weaver) but yeah dude it’s insane how much people somehow think they can just charge in with zero help at all. So stupid. I feel like overall people genuinely played smarter in OW1 despite the fact I was a much newer player back then and def wasn’t as good as I am now. \n\nDo you usually go healer?", "label": 0}
{"text": "I was in plat 1 now in gold 5 after today. Keep being told I’m the problem", "label": 0}
{"text": "blizzard never swapped to 5v5 because its more competitive, they did it for queue times. stop blaming all the issues of the game on competitive players.", "label": 0}
{"text": "I’m a support main and I play JQ as my tank! Wbu?", "label": 0}
{"text": "that’s disappointing i actually love this skin", "label": 0}
{"text": "Thank you for this, I just started a few months ago so I'm trying. I think I'm okay at the game, definitely better than the actual bronze players i play against. It's hard getting lobbies with different REAL bronze players due to my work hours so I'm unfortunately stuck. \nThank you for acknowledging it's irritating, it's been a rough couple months and I genuinely enjoy it but I've run into way too many awful people lately. \n\nI hopped on randomly a few hours ago, my first match I ran into one of the main smurf accounts friend. They proceeded to basically bully me the whole match\n\nAs for silence, I promise I didn't say anything bad. Im not the confrontational type, the worst I've done was call out the smurfing, as well as my other teammates, and say it was irritating \n\nI contacted support so let's hope for the best!", "label": 0}
{"text": "So this coming next season?", "label": 0}
{"text": "You'd say otherwise if you saw my stats, thanks tho", "label": 0}
{"text": "Widow is the only character in the game that can delete you instantly before you can even see her (except if you're a tank or Bastion).\n\nIn the overwhelming majority of cases, it'll take a cooldown for you to reach her perch before she domes you. Then she uses her zipline. You're stuck on her old perch on cooldown and she can just turn around and nail you then.\n\nYou can anticipate all you want, but if she's good, she won't let you get in reach to force her zipline out, let alone catch her after that.", "label": 0}
{"text": "You really aren't. If you bother to read the Developer Blog you'll see it's only a test, and also it will be Open-Queue style balance (eg - not balanced, using lower tank health etc).\n\nNot to mention the rose-colored glasses about queue times especially since it'll be a division of gamemodes/playerbase.\n\nI would curb your enthusiasm severely.", "label": 0}
{"text": "OH?!?!?", "label": 0}
{"text": "The whole one sided thing? Yeeeeaaaaaa\nIt's been that way for me since they \"revamped\" matchmaking over a year ago. \n\nActually having an equal match is just too much to ask at this point?", "label": 0}
{"text": "Idk about doom, but ball is just right click grapple, press W, press retract grapple, let go of grapple at roughly the correct point (you're a fkn 700hp Ball with adaptive shields that let you go up to 1300hp, you're simply not going to die quickly), yeet yourself across Busan Downtown, through Busan Sanctuary, and straight towards Busan Mekabase in one ability, and chase her down. It doesn't take that much skill, really.\n\nWidow has a grapple? Ball has a BETTER grapple that is HALF the CD of widow's and that's IF he activated fireball. If a ball wants a widow dead, that widow is going to die like a bug under his hamster boot every. single. time.", "label": 0}
{"text": "This is the next stage of evolution for Symmetra’s hardlight", "label": 0}
{"text": "Thank you for being respectful about this, I really appreciate it :) \n\nI didn't consider that, would make a lot of sense\n\nAs for those accounts, I'm just convinced bc they said they are but also they DC when we are about to win and during the match they are absolutely demolishing everyone \n\nAnd people buy accounts ?????", "label": 0}
{"text": "Ah nice that’s cool, I usually prefer DPS but I play a lot of OQ which forces me into healing mostly or tank. But I def feel my strongest characters overall are Sourjourn, Dva, Mercy, Weaver, Sigma and Ashe", "label": 0}
{"text": "That's wild🙃🙃🙃", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Hell yeah, those characters are great (:", "label": 0}
{"text": "Got any fun crash out stories? I feel like you’ve seen a few", "label": 0}
{"text": "They said there were two teams, in two different games, that did this. The tank was the same. 4 + 4 is 8. That's not difficult to understand.\n\nRegardless of this, OP can be right sure, but even if they are, they're expecting 4 people who are all working together to suddenly change their playstyle and possibly their heroes, just to appease this tank.", "label": 0}
{"text": ">using him on attack in a escort map is basically throwing\n\nNo it isn't.", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Okay okay, everyone’s saying fam with godrick cause voice actor \n\nI think ramattra mohg would go so hard.\nThe design would be so cool, the weapon is perfect and the ult being red like nihil fits perfectly with his nemesis form being wings… maybe it’s just me", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Guys, what if Reinhardt could get Zarya bubble…. Nano….. and Lucio speed!!! Wowza", "label": 0}
{"text": "Thanks.  My mistake calling it a bug.  Just trying to figure out why I couldn't cancel her tele when I obviously hit it before she disappeared/teleported.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "HBT", "label": 0}
{"text": "Bro, Widow saw tons of adjustments from her grapple CD to her max HP pool, along with trial runs to change her kit like removing the instakill altogether and replacing it with a DoT during April Fools events.", "label": 0}
{"text": "You’re right the amount and randomness of the skills would be too much but a little customization would probably be doable. We’d need clear info to know what an émet was doing. Maybe in the scoreboard", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Some ones mad that they got hooked", "label": 0}
{"text": "They match each other's energy, should get married atp", "label": 0}
{"text": "Well as an OW1 tank main who more or less avoids the role like the plague when I (rarely at this point) do play the game, I for one am looking forward to this and hope it sticks. I basically haven't touched my top 5 heroes in over a year.", "label": 0}
{"text": "I can see the idea with giving her less stealth so she has to use it more accordingly.. but i feel like if they were gonna get rid of her perma stealth they couldve given her at least ten seconds, since being revealed lasts for one second and when you throw TL and people watch your land, they can guess really easily where youre gonna go.", "label": 0}
{"text": "That’s cool and all, but can they bring back loot boxes and group finder already?", "label": 0}
{"text": "I’ll ss and let her know lmao 🤙🏼", "label": 0}
{"text": "I was mostly a tank main in OW1, but I never play it in OW2, genuinely cant stand solo tank", "label": 0}
{"text": "It is a projectile. That's why it will activate when it hits a surface regardless of time thrown. The translocate is complete separate from her character, once it's thrown the only thing that can stop it is her dying, as that's the only check the game makes before teleporting her.", "label": 0}
{"text": "concord was a MESS. what attracts a lot of people in games are characters. overwatch had interesting lore and characters (cute angel girl, hot lifeguard guy cassidy i love you) and managed to set a fanbase, marvel has that. concord was locked behind a $40 paywall with things free competitors already provided.", "label": 0}
{"text": "I believe the phrase you are looking for is \"in light of.\" \"In lieu of the 6v6 tests,\" means \"instead of the 6v6 tests.\"", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "a cyberpunk themed event in overwatch, when?", "label": 0}
{"text": "I hate hack with a passion, but nothing, NOTHING will cause the kind of night terrors and cold sweats Hanzo Scatter one-shotting a full health tank and Hog's Nth dimensional hook has caused.\n\nYou should apologize for even reminding us of these things.", "label": 0}
{"text": "what does goats mean cus i see people mentioning it in the comments?", "label": 0}
{"text": "Yeah, makes sense since it doesn’t tell you sombra gets cleansed when translocating lol. A surprising amount of people don’t know that, especially sombras since it also cleanses hack *and* virus", "label": 0}
{"text": "Absolutely nothing is fun about being randomly one shot from simply walking out in the open", "label": 0}
{"text": "I usually main venture and my mate plays doom really well, it becomes a great combo and we're often rivaling the enemy team only to find that all of them hung back, it reaches the point where I barely see my team all game unless I need to ho and save one.", "label": 0}
{"text": "I love sticking my knife into Widows.", "label": 0}
{"text": "Play damage if you want to get kills bro", "label": 0}
{"text": "Welcome back Overwatch 1!", "label": 0}
{"text": "I’m just excited to play tank with a friend. My friend plays DVA. I’ve been practicing Doom so I can try that duo.", "label": 0}
{"text": "Sigh.\n\nThey didn't balance against double shield/bunker comps for over a year straight to trick people into wanting 5v5 more. Literally zero balance changes to address the issues for OVER a YEAR. And you and so many other people fell for it.\n\n6v6 is NOT synonymous with boring poke bunker. They intentionally allowed the 6v6 meta to stagnate and ROT so 5v5 would look better by comparison", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "There's already doubts coming from people as we speak lol. I'd imagine there's going to be more than just a few rounds of tests.\n\nI'm not going to be against 6v6 being included, though. The issue comes when people assumed it'll replace 5v5 which is absolutely nuts.", "label": 0}
{"text": "We both know it’s true", "label": 0}
{"text": "That’s what we played in like diamond and above", "label": 0}
{"text": "Reddit sent me a notification of your post. I got curious and checked on your profile. Let me just say in adore your cosplay posts and love your dedication to playing Ramattra so much that his level is insanely high! If you're ever looking for more friends to game with on overwatch I am absolutely down for some games 😊", "label": 0}
{"text": "Juno. I know she is newish but so fun. Pew pew and movement are satisfying.", "label": 0}
{"text": "Lol fair enough", "label": 0}
{"text": "This is the first time I've seen a community that talks about Overwatch without mentioning porn.", "label": 0}
{"text": "Kingmaker actually sounds kind of interesting.  I want to know what the one super-powered Support will be like.", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "If you think supports should be for doing damage instead of supportive utilities, then I don't think we're going to see eye to eye on anything. Lmao", "label": 0}
{"text": "Him and I could make any Dva comp work. I'm an otp so I rarely would play other tanks (bare in mind I still have 90hrs on Ball) When you find what clicks for you (for us it was Hog Rein and Sigma) its just crazy fun. We do it in open q sometimes but it's not as fun as what 6v6 was", "label": 0}
{"text": "What people don’t understand is, that this makes it harder as a zen to climb, not easier", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "Junker queen and second choice Pharah. \n\nJQ is imo the best feeling character in all of ow2 and is just fun, plus I have a couple cool skins on her\n\nPharah is my personal love because she’s always been my girl and even if she’s not always meta or easily counteravke and has a god awful ult, she’ll still always be my choice", "label": 0}
{"text": "Moira or Mei.\n\nThey both have decent survivability.\n\nMei has great utility for most matches and can hold her own against other dps if you hit headshots. She self heals so whenever my healers suck or are busy healing others, at least I can fall back on myself. She’s also the most fun hero for me.\n\nMoira is also useful most of the time. I often switch to her anyway for various reasons.", "label": 0}
{"text": "I play Queen, Ramattra, and Winston, so the pairings I'm looking forward to are:\n\nQueen/Zarya. Grav and rampage? Lets go! Much like Reinhardt, Queen wants to just aggro and smash heads and all Zarya wants is that sweet, sweet glow. Definitely an ideal match. \n\nWinston/D.va were my jam back during dive days and will be fun to play again. Love a good D.Va to jump in with!\n\nRamattra/Sigma. I feel like they're going to have good synergy. Vortex and rock could be a deadly combo and Ram can just fist up while Sigma uses grasp when shields are down. Plus, they can both headpat the team together to hype everyone before the match. \n\nI am all around curious to see what comes of it, but these are going to be my three go tos!", "label": 0}
{"text": "Artist is Manicx, it’s actually an animated wallpaper", "label": 0}
{"text": "Exactly, 5v5 enables counterswapping. I come out as Dva, they come out as Rein - they die and come out as Zarya. I am now incapable of doing my job to the fullest. \n\nHaving a second tank allows us to build a million more comps that synergize together.", "label": 0}
{"text": "Nah they are just sheltered from reality,  and have nothing going on in their lives,  so they can invest themselves entirely into a videogame ..", "label": 0}
{"text": ">  Can you imagine having to play keepaway with a giga-buffed Tracer running it down with Ball and Winston on the enemy team?\n\n\nNo way you are gonna convince rest of the team to stay off DPS without a group", "label": 0}
{"text": "Yes one of the jobs of supports is to help to secure kills. Thankfully, otherwise supporting would be boring as hell...", "label": 0}
{"text": "ramattra tbh", "label": 0}
{"text": "Nah", "label": 0}
{"text": "Hm really? Such as what?", "label": 0}
{"text": "So cute 🥰", "label": 0}
{"text": "I see this Samuto point a lot.\nWhat's the issue with him and his takes?", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "It includes the US, it's the first one listed", "label": 0}
{"text": "Experience my balls.", "label": 0}
{"text": "My buddy and I are looking forward to Rein and D.Va duo respectively like the old days. I flank healers in backline, and once they turn to deal with me he charges and we scramble the lot.", "label": 0}
{"text": "Silver elo?", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "I understand Lucio, you’ve got personality, you’ve got montages, you’ve got a high skill ceiling, and a character who can easily be played like a support or assassin", "label": 0}
{"text": "Thanks I'm going to edit it, but I think I'll end up deleting it, it's already being downvoted I don't know why I made this post anyway", "label": 0}
{"text": "i love reinhardt......FOR GLORY!!!!!!!!!!!!!!!!!!!!", "label": 0}
{"text": "Where are you getting this thing where i think overwatch is a failing game?  I believe Overwatch will always be a popular game no matter what they choose to do. Thats why im still here playing the game in a format i dont like. They have to plan for the future. 5v5 is dead and its pushing many more people away then pulling in. Tank as an overall experience is miserable. I teach new players tank all the time and they are so frustrated and have no idea what to do. New players never enjoy that experience.  Thats why 6v6 is coming back. Its a great business move on top of everything .", "label": 0}
{"text": "Oh you can, but its a chicken Vs egg problem.\n\nIf you're good enough to climb with just LW, you're probably already past gold and plat. \n\nThe simple rule is: if you don't already know how to make LW work, you shouldn't be trying to main him.", "label": 0}
{"text": "Rein and Sig just sounds so silly with all those shields. Lol. You said you played some Ball. Who would you pair him with?", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "\"most\" would be a better word than \"everyone\". Everyone is just literally incorrect.", "label": 0}
{"text": "Your perspective is warped", "label": 0}
{"text": "I mean it looks to me like you were suspended for being toxic. No, asking what hero your team prefers isn't toxic. Consider just asking what heros they prefer in the future. ", "label": 0}
{"text": "(With consent)", "label": 0}
{"text": "Moira. Idk I like the idea of preserving or ending life based on my perception at any given time.", "label": 0}
{"text": "Dude wtf. At least say that most of that is absolutely ok to say 😂 wow", "label": 0}
{"text": "angry at life, angry at blizzard. Not angry at you, don’t worry. \n\nunless you play widow, watch out.", "label": 0}
{"text": ">The person who spams racial slurs will have zero action taken on their account\n\nand you know this how?", "label": 0}
{"text": "why do you spend your time in video game subs", "label": 0}
{"text": "The average 6v6 advocate acts as if the game is dead, as if there aren't millions of people who don't enjoy this game in its current iteration. I'm not even entirely against 6v6 but the doomers are annoying", "label": 0}
{"text": "No", "label": 0}
{"text": "Yeah you’re pretty evil for that. lol \n\nAnd Open Que sounds like a clown fiesta. So I don’t bother.", "label": 0}
{"text": "D.va. Dive tank dives", "label": 0}
{"text": "I play doomfist and I try to be the nicest I can, but no matter what, I always get those looks from my team as if I just said a heinous slur. Which is ridiculous, I only say those things when I play dps. It’s so hard to be the stereotype of “sweaty, annoying, whiny, toxic wannabe Zbra doom player”", "label": 0}
{"text": "Get fucked", "label": 0}
{"text": "QUEEN AND REIN SUPREMACY!", "label": 0}
{"text": "That’s because the amount of utility Ana has compared to Moira is astronomical. Moira doesn’t really do anything besides damage and heal.", "label": 0}
{"text": "All this started after Microsoft bought blizzard. Same shit happened to Halo", "label": 0}
{"text": "This was a 'temp' currency, so to speak, that was related to the winter event last year.  Likely they'll do something similar this year as well.", "label": 0}
{"text": "Probably Genji", "label": 0}
{"text": "If it was one per role itd prob be hog, pharah, weaver. Only one would prob be hog", "label": 0}
{"text": "Bro has NOT heard of the Lucio Mafia", "label": 0}
{"text": "Well, how do Rein team with Hog?", "label": 0}
{"text": "That’s where I’m at a loss. Idk why it wouldn’t let me rejoin.", "label": 0}
{"text": "Nope. At least not yet", "label": 0}
{"text": "I really don’t se anything wrong here, looks like the system is working completely right", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "If I had to pick from each category doom/rein can't rlly pick genji then Lucio", "label": 0}
{"text": "Release Brig in every game.", "label": 0}
{"text": "also think that's why Rein and Doom are so high relative to the tank subs, especially given the latter isn't s popular character.\n\nTheir clips are a lot cooler visuall than a hitscan hitting a couple headshots", "label": 0}
{"text": "\"Fortnight is free,\" says the person playing a free game.", "label": 0}
{"text": "well if you play zen then you’re excused", "label": 0}
{"text": "I think there's a lot to learn from Ravi. He's easily the best LW player imo. He's made a tips and tricks video iirc and he's helped me become a significantly better LW.", "label": 0}
{"text": "Time is a flat circle. Can't wait for the discussions for 5v5.", "label": 0}
{"text": "Zenyatta he is easy af and i play him a lot", "label": 0}
{"text": "That's a funny way to say you're an Ana/Zen/Bap main", "label": 0}
{"text": "Ironically Marvel Rivals are going through this exact problem\n\n\nIt's almost like OW1 all over against ", "label": 0}
{"text": "Random disconnect like that could indicate somebody else is logged into your account and opened OW while you were playing. Do you have 2 factor authentication?", "label": 0}
{"text": "Thank you! I hope we get any skin ngl :,-D", "label": 0}
{"text": "Yeah, widow might be a bad example, because she is very map-dependant as well. \n\nHonestly, I’m trying to give a simple rule for something that isn’t simple at all. Map, game mode type, composition type, attack vs defense, countering or being countered, & team hero synergy all play their own role in which heroes will play better than others in a given situation.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "So when someone says racist shit towards black people, Reddit loses its shit. When people say racist shit towards Asian people, Reddit says “hahah so funny”.\n\nBro..", "label": 0}
{"text": "Yeah! I’m low plat so I wouldn’t know", "label": 0}
{"text": "my grandma made it", "label": 0}
{"text": "I can’t dig that.", "label": 0}
{"text": "[lol](https://www.tandfonline.com/doi/abs/10.3109/00952990.2010.491879)", "label": 0}
{"text": "I really don't get how Sombra flankers are trouble for some Zen players. I don't play him a lot but it's easy for me to 180 when I start hearing the hack sound and then I'll have a point blank volley ready for Sombra.", "label": 0}
{"text": "All video games that have fast-paced action, really. Not rocket science", "label": 0}
{"text": "Not even close, Bastion is very weak. Reaper and Mei are easily the better tank-like DPS with their self-heal and get out of jail cooldown.", "label": 0}
{"text": "Well damn, I don't play TF2 so I didn't know it was a thing already being sold lol", "label": 0}
{"text": "I’d argue the tanks aren’t nearly as tweaked out as modern supports. The last three tanks from OW1 are arguably more complex than JQ, Ram, and Mauga.", "label": 0}
{"text": "I appreciate your service.", "label": 0}
{"text": "Same her bud", "label": 0}
{"text": "If anything Ana, Kiri and Illari but yes - I avoid damageless supports like a plague. You don't climb on either Mercy or LW, these two are always count on being carried by their teammates.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "He's a toxic manbaby, blames everyone else for his own failures, gets carried, and is your typical support/misogynist type. He also told someone to kill themselves.\n\nMaldito can absolutely get fucked.", "label": 0}
{"text": "Hit alt f4 and relaunch the game. Should let you rejoin.", "label": 0}
{"text": "all good^^ ty for responding", "label": 0}
{"text": "I actually like the rework. Been putting up numbers with her. She just requires more brain cells to properly pilot now.", "label": 0}
{"text": "How about\nMisspelling Moira’s name", "label": 0}
{"text": "I do not…I don’t share passwords at all or anything but to be safe I changed password and set up 2 factor authentication now so if that was the case. Def should be now. I hope nobody was on my account. Been away from OW for a while so who knows if someone did and what they could’ve done.", "label": 0}
{"text": "For free? Lel just sell it if you don't want it.", "label": 0}
{"text": "I do agree but i hate the fact there is so much downtime now, just waiting for your cooldowns to go back in.  This alongside the EMP nerf stinks", "label": 0}
{"text": "Im honestly just happy for a significant shake up to the game, that and running from the giga buffed enemy tank pressing W at you all game gets tiresome after 1000 or so games.", "label": 0}
{"text": "Well I saw the suspension after I tried rejoining. I’m not sure what happened. Sucks nonetheless.", "label": 0}
{"text": "Youre intentionally missing the point for whatever reason. according to OW, each of their phrases by themselves is justification for punishment. So yeah apparently saying moria can get you canned if you do it enough. OP correctly called their suspension system flawed, because it is. Unless you wanna sit here and say misspelling Moira’s name is grounds for punishment", "label": 0}
{"text": "Sorry for the confusion. That makes sense tho. Hog and ball sounds annoying as hell.", "label": 0}
{"text": "People swore by this *for years* and the fact it came back this year proved everyone wrong.\n\nOP, no one here can say with certainty when or if it will come back, as nobody here works for Blizzard and would be privy to that information.", "label": 0}
{"text": "Maybe a stim pack to heal while running?", "label": 0}
{"text": "Moria", "label": 0}
{"text": "Ah, ok. Just preventing bullshit because of a stupid-ass rule.", "label": 0}
{"text": "I played against a trio like that in silver. One for each role. Easy stomp for us, but the replay showed it was obviously one player de-ranking accounts", "label": 0}
{"text": "Or do you mean 4K place on leaderboard?", "label": 0}
{"text": "New DVA April fools line: \"Peep this potm!\"", "label": 0}
{"text": "Ana: *\"Hello there! Don't be scared! Are you sleepy?\"*", "label": 0}
{"text": "but when I'm a million miles up in the air that hammer still gets me smh", "label": 0}
{"text": "Why would it be impossible? It's just numbers changes \n\n\nThey did it for open to prevent 4 tanks being the main comp.\n\n\nBecause stacking more HP is obviously the way to go.\n\n\nHaving 2 tanks with less HP would rebalance overall comp HP and tanks would have to cycle defensive CDs.\n\n\n(Also love the downvotes above, frackin' Reddit! Never change)", "label": 0}
{"text": "Overwatch was having trouble well before Blizzard was bought by Microsoft.", "label": 0}
{"text": "I dont really experience much downtime tbh. I usually translocate to the side of an engagement, spend 2-3 seconds of invisibility, running and picking my target, then the last seconds hacking, virusing, and finishing my kill and by then my translocator is off cd so i go back to the side, grab a health pack or some heals and begin the cycle anew. \nAnd with the damage buff i can contribute to more desperate team fights out in the open getting a cheeky hack off or hurling virus into a crowd of people for some extra chip damage, or to get the dps passive on a tank.  It's very similar to how i would personally play release sombra, so I've been able to adapt quickly.", "label": 0}
{"text": "DOOM", "label": 0}
{"text": "From a Doomfist main, I apologize for them. There are some of us that know when to leave I promise. My goal as a Doomfist player is being able to survive without my supports and go to them only when I'm really low", "label": 0}
{"text": "We Apex now boys", "label": 0}
{"text": "Well I’m thinking maybe I dc’d, then we lost while I was trying to reconnect so then it suspended me since it was over. That can happen in Rocket League as well so it’s the only inference I can make. Although to your credit, def better safe than sorry with 2FA. The only games in my history are from today so I prefer the dc suspension than someone having access to my account.", "label": 0}
{"text": "Genji… high skill ceiling", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Winston.", "label": 0}
{"text": "6v6 sounds great until you stop and realize it means you need to double your tank playerbase to keep comparable queue times, and unlike OW1 there is no longer a lootbox incentive for Flex Queueing.  \n\nThere’s a few reasons they moved to solo tank, and chief among them is queue time issues for 90% of the playerbase.", "label": 0}
{"text": "Not with the greed side. Also Microsoft doesn’t listen to the community for months and months before changes come too late.", "label": 0}
{"text": "Sombra and Sym might not be mainstream picks but their players are devoted af. They're also pretty well liked visually and as character, it's balance/design more than anything that's held them back in play-rate.\n\nAnd given Sombra has had two collab skins (and a fairly steady income of skins in general) and Blizzard seems to very much be going by who sells, I'd say she's more popular in-game than people realize.", "label": 0}
{"text": "They've already stated that ability and stat updates are included in the 6v6 lineups. It's not like they're just dropping in another high power tank position. They're trying to walk it back to where any position can play off their partner position which, in my opinion, is what made Overwatch the most fun.\n\nTo me, Overwatch is less about countering the enemy team and more about augmenting my team to perform better.", "label": 0}
{"text": "She's beautiful, very strong and unbeatable", "label": 0}
{"text": "Doom, Cass, Bap for their roles respectively. \n\nNot sure who I'd pick out of the 3, but probably Doom.", "label": 0}
{"text": "You're more powerful in exchange for being the punching bag spammed with all the CC until you're less powerful than in OW1.", "label": 0}
{"text": "rein zarya is back on the menu boys", "label": 0}
{"text": "Give JQ a Zarya and find the third tank to be the Sigma or Rein. Watch the world burn.", "label": 0}
{"text": "> Who wants to PLAY tank in 6v6? Main tank. Not roadhog or zarya so you can be a glorified dps.\n\nMe if I'm not being told tank diff 24/7 by my glorified DPS supports trying to dive the enemy Ana before getting slept and blaming me for their play.", "label": 0}
{"text": "I'm confused is Harry 1 syllable?", "label": 0}
{"text": "Which part of double tank specifically are you talking about?", "label": 0}
{"text": "These legendary skills don’t seem terribly interesting or change up Ram’s play styles all too much. Here’s a few suggestions.\n\nVoid Bulwark - Enemies cannot walk through your Void Barrier.\n\nRepulsive Vortex - Vortex now launches enemies straight up. Ram can use it on himself to rocket jump.\n\nAccelerated Discord - Landing 10 consecutive hits with your Void Accelerator applies an Orb of Discord on the target.", "label": 0}
{"text": "Going to 5v5 created a lot of problems, especially within the tank role as many have stated already, and had taken nearly a year (plus the development years) to balance properly.\n\nI think we’re too far along to change the core of the game back to 6v6 but if they could make it a permanent arcade mode (with eventual comp) and balance shields within it, I think that would be best overall for ow health.", "label": 0}
{"text": "I know the question is hypothetical, but I can't even come up with an answer.\n\n  Learning how different team comps, different maps, play styles, and different heros play and work together is why I even enjoy the game. It's like a constant changing puzzle with a tons of different scenarios to work and improve on. I cannot wrap my head around how one-tricks don't lose interest.", "label": 0}
{"text": "This rework still doesn’t fix all her issues. Just rework her into a support at this point anything would be better.", "label": 0}
{"text": "It was def past the first two minutes. We were in a bad spot when it happened so I’m thinking we must’ve lost shortly after I dc’d. Although enemy team had to cap 2 more points so if they did, it was surprisingly fast but not imposssible ig. Like I said, I tried connecting within 20 seconds of it happening but maybe it wasn’t soon enough.", "label": 0}
{"text": "Tank feels easiest to me I've locked down 3 of them and getting practice on a fourth. Turn off chat and you don't get flamed and therefore you can improve at your own pace with no pressure. Meanwhile I've quit queueing for dps because they ruined Sombra and when I queue support I have a crisis if Ana gets taken first", "label": 0}
{"text": "Im more than happy you won that fight, but it would've been a lot funnier if u solo ulted the D.va", "label": 0}
{"text": "I would hope they would get more changes than just the lowered health from open queue, but I get what you mean", "label": 0}
{"text": "That's what the Push forward voice line is for", "label": 0}
{"text": "Finally I can off tank as hog again\n\nI was never meant to be the main tank lol", "label": 0}
{"text": "Rock Wave 2024🪨🤘", "label": 0}
{"text": "That’s my only guess but I didn’t think we would be able to lose that fast.", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Come on man, I don’t want to attack your GRANDMA!!\n\nWhy’d you have to tell me this!", "label": 0}
{"text": "I hate playing against a Mei but I love being Mei. Those little ice shard headshots are so satisfying. On the flip side when the enemy Mei is freezing me to death and the last thing I see is her lifeless smile is the most infuriating thing lol. \n\nIn the end I would still pick Mei 😭", "label": 0}
{"text": "Yeah that's understandable from a gameplay standpoint it'll be fresh for a good while.", "label": 0}
{"text": "bastion:\n\nhe's just a silly little guy\n\nminigun go BRRRRRRRRRR", "label": 0}
{"text": "I can't give you my actual reasons for maining Ram because I will be shunned... I just loved his phrase \"Take everything ftom them\" and that's why I wanted to play him. I legit struggled getting used to him and dropped him a couple times before he clicked.", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nIn accordance with our [Quality Guidelines](https://www.reddit.com/r/Overwatch/wiki/rules#wiki_discussion_threads_.28self.2Ftext_posts.29), we currently do not allow the submission of posts with no or minimal text description. Please resubmit your post with additional context. If you have a quick or simple question about the game, please see our [latest **Quick Questions** post](https://www.reddit.com/r/Overwatch/search?q=quick+questions+author%3Aautomoderator&t=week&sort=relevance&restrict_sr=on).    **Attempts to bypass the character requirement via inserting nonsensical text will possibly result in action against your account.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "What? You thought you would kill her easily with literally all projectile and two melee heroes?", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah, and there are times where duo tanks will both be hard countered, but it is reduced a lot.\n\nIf one team plays Rein + Dva, and the other plays Zarya + Orisa, it kinda balances out.", "label": 0}
{"text": "honestly think zarya/queen is better", "label": 0}
{"text": "## Season 14 6v6 modes\n\n1. 6v6 Min:1, Max:3 - Releases start of season\n2. 6v6 2:2:2 - Releases mid-season\n\nThe order of this sabotages the true test and question of \"How popular is 6v6?\" \n\nOn the surface appears to be a way to ensure 5v5 wins.\n\n### 2:2:2 should release first", "label": 0}
{"text": "I probably choose Baptiste cause he has a little of everything I like. \n\nThen after about 2 days I uninstall cause I enjoy using like half of the roster.", "label": 0}
{"text": "Imagine zarya/mauga. This is going to be crazy", "label": 0}
{"text": "solo tanks will be raid bosses still. duo tanks will be able to die easily since they also have to split heals", "label": 0}
{"text": "Very balanced take I can definitely agree with that. Whatever happens I hope this 6v6 debate can be put to rest once and for all though maybe that's wishful thinking at this point haha.", "label": 0}
{"text": "Zenny is my main so I’d choose him for sure", "label": 0}
{"text": "Bro, it’s clearly always the tanks fault. Cant possibly be the 1-0-7 genji getting his shit pushed in by a Winston and a Moira.", "label": 0}
{"text": "Instead of play of the game its : incel of the game\nshowing their histories", "label": 0}
{"text": "Yes this is how I feel about her too!! Whenever I play mercy I forget I have a gun 😭 but with Moira it's just so much easier it's more instinctive idk she's the best.", "label": 0}
{"text": ">Youre intentionally missing the point for whatever reason.\n\nHow is he missing the point?  The guy is toxic and put the ONLY 2 words in his intro that weren't.\n\nAnd are you a friend of the OP or something?  Why are you spamming replies about misspelling \"moira\" as \"moria\" being the justification lmao?  He didn't even say that word.\n\n>After further investigation, this account has been suspended........I've reviewed the action an additional time, and I've confirmed the initial findings......\n\nThis obviously wasn't an auto-ban... it was likely the final straw on a huge pile of em on the camel's back, bc OP sounds toxic af on a regular basis.", "label": 0}
{"text": "hog + orisa used to be called \"pulled pork\" because her orb (called \"Halt\", its in one of her highlight intros pulling soccer balls) would set up an easy hook over shields for an instakill", "label": 0}
{"text": "No 🗿", "label": 0}
{"text": "They took too long to address problems. The game is already dying and this won't save it", "label": 0}
{"text": "juno because she’s been the first character i’ve had the most fun on/do the best on and made me drop my 200+ hour main", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "The issue isn't the population of the playerbase, the problem is the level of skill diversity within it is declining..\n\nThe higest density of player population are in the lower teirs in terms of skill.. as skill increases population density decreases...\n\nA healthy playerbase in terms of skill diversity has the highest density of players is in the middle of the playerbase in terms of skill..", "label": 0}
{"text": "Doom/Queen jumping the fuck out of the enemy team", "label": 0}
{"text": "callouts?? in platinum ow2?? ........................................let jus t say.... it aint gonna happen. and if it is.... i have voice chat off anyways", "label": 0}
{"text": "Doom and Zarya will be OP 💀💀", "label": 0}
{"text": "passive heals doesn't do what you're thinking. \n\nthey'll need to buff burst dmg for dps characters otherwise it'll be the same 6v6 poke dmg for 5 mins to build ults, and the team that uses their ults best will win the fight. \n\n6v6 makes it way more of an ult mgmt game", "label": 0}
{"text": "Seems possible they will bring back the tickets for Christmas. \n\n\nHoly Moly, we have seasonal currencies 🙄 ", "label": 0}
{"text": "fair enough. There's a high chance of either no tanks or no supports. Or both sometimes. In comp that's probably not the case, but it is in qp.", "label": 0}
{"text": "Are you a friend of the OP or something?  Why are you spamming replies about misspelling \"moira\" as \"moria\" being the justification?  He didn't even say that word, he was obv toxic af, which means he's also likely toxic most of the time and his reports added up.", "label": 0}
{"text": "sombra, crucify me i know", "label": 0}
{"text": "My friend and I both love playing tank, but we can't. We're gonna dominate as Queen and D.Va.", "label": 0}
{"text": "Winton.", "label": 0}
{"text": "???", "label": 0}
{"text": "???", "label": 0}
{"text": "And here we go", "label": 0}
{"text": "i swear i've seen this exact thread word for word posted 2-3 times already", "label": 0}
{"text": "????", "label": 0}
{"text": "In 6v6 if you get kings row and don't go Rein/Zarya, you should be instabanned from playing tank again.", "label": 0}
{"text": "Haven’t played since 1 died, but damn was it satisfying to aim a charge at where a Tracer is gonna pop up and watch them teleport into their death. ", "label": 0}
{"text": "I fail to see the issue here", "label": 0}
{"text": "juno for life i love my space girl 🫶", "label": 0}
{"text": "🥓🥓 Bacon is king", "label": 0}
{"text": "Bacon??", "label": 0}
{"text": "Does it really matter? Rivals, even with the similarities, plays a bit differently. It’s super fun and fresh, and the fact that the devs focus on fun totally pulled me in. People are mad at Blizzard, but both games can exist side by side. Just chill with this dumb game war, it’s pointless, and you can like more than one game at a time.", "label": 0}
{"text": ">according to OW, each of their phrases by themselves is justification for punishment.\n\nIncorrect. Those were the messages that players tagged when they reported OP. It's likely that people reported OP for something said earlier in the match but they couldn't be bothered to scroll back to it.\n\nBlizzard's CS people are either overworked (or lazy) or have a bad grasp of English. Very rarely will they try to editorialise and dig through logs to find the most damning.", "label": 0}
{"text": "Sigma, most balanced tank to date and very fun to play, negates things Mauga, D.Va, Bastion, and what have you, dcecent skill ceiling and overall has some very good skins when they drop.", "label": 0}
{"text": "I didn’t pay any money tho", "label": 0}
{"text": "OW considers the word moria to be toxic", "label": 0}
{"text": "As a ball main I am so ready for 6v6 to come back", "label": 0}
{"text": "I was hunting for her challenge where you need to elim 3 enemies with a single use of Tectonic Shock. Is it a bug or did I miss sth in the challenge's conditions?", "label": 0}
{"text": "Venture! Love that little rock muncher!", "label": 0}
{"text": "I love how the game isn't even dying either.", "label": 0}
{"text": "Then you get no bacon! GOOD DAY!", "label": 0}
{"text": "Doomfist and Mauga could be a nasty combo. Imagine launching the entire enemy team into Mauga's cage fight with a charged punch and following up with a meteor strike.", "label": 0}
{"text": "Luckily I secured the Baptist and illari skin as a support main heh but yeah.. too many currencies", "label": 0}
{"text": "Nice!", "label": 0}
{"text": "What do u think they should do then? Leave the as it is?", "label": 0}
{"text": "I think you have to kill 3 enemies with one hit/wave", "label": 0}
{"text": "Ball Hog 🐹🐷", "label": 0}
{"text": "Yeah, I prefer it for the structure and balance. The one time I did play OQ, everyone was playing DPS. Was a lil fun, but I prefer role que.", "label": 0}
{"text": "Reddit Lucio was a lie T- T", "label": 0}
{"text": "I only play 1 hero anyways. Ashe till I die", "label": 0}
{"text": "Pulled pork is crazy. Lmao", "label": 0}
{"text": "I've put Lucio down for a while and picked up Juno and Reinhardt much more. The playstyles are a breath of fresh air but if I need to do some work in a comp match I'm going Lucio big time", "label": 0}
{"text": "juno got a cinematic?", "label": 0}
{"text": "The pull ability", "label": 0}
{"text": "Playing a medic should not have the complexity of a multi step equation", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "they announced this months ago, saying it would be coming in a few seasons. we already knew marvel rivals existed then, marvel rivals has already had multiple open betas. the seasons are also a set time, they didn’t pick marvel rivals launch date", "label": 0}
{"text": "Another way to get them mad is to mention their 3 inchers. Anytime a korean starts malding and talking shit just bring up how small they are and it shuts em up real quick lol", "label": 0}
{"text": "I like Sigma cause hes... kind of the only tank who truly feels like he is a *tank* in One Tank overwatch, while every other tank just feels like a thicc dps", "label": 0}
{"text": "people don’t understand 2 games can both exist", "label": 0}
{"text": "Same! Rein and D.VA is the best combo. I used to main off-tank D.VA in Overwatch, we're so back!", "label": 0}
{"text": "So when someone reported OP for chat toxicity they actually typed in “moria” in the text box?", "label": 0}
{"text": "I see you in my nightmares…", "label": 0}
{"text": "Yea its on youtube", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Mauga mains being the lowest numbers makes sense cause mauga mains can't read, and only know one word Hahaaaaa\n\nSo not much to say in a sub reddit.", "label": 0}
{"text": "Sorry, but i have to fact check this one.  Venture is non-binary, not trans.", "label": 0}
{"text": "Should've solo ulted baby dva", "label": 0}
{"text": "You don’t. It’s harder to level up without focusing on damage. Healbotting makes the game harder for you and your teammates.", "label": 0}
{"text": "Venture is non binary", "label": 0}
{"text": "Yes.\n\nIn addition to her storybook style intro, there was a cinematic named 'control'.  Not the same style as past cinematics, but it's there.  It's the event of her leaving mars to head to earth.", "label": 0}
{"text": "Idk gender vocab but from a blizzard article “Venture is our first trans non-binary hero”", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "I was about to ask why didn't he say r/asheowmains but said r/mccreemains", "label": 0}
{"text": "also i mean, there’s just a huge subculture around characters like Lucio and Mercy because they have extremely unique gameplay that has a lot of dedicated players, as well as the character generally being well loved. Like there’s a lot of innovation there regarding techs and skills so it makes sense that people seek out more like minded individuals than, say, Soldier or Baptiste mains who realistically aren’t as unique", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Virgin german vs chad australian", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "It fans out and each little bullet can do a bit of knockback and damage. Like if if reaper tried to go sniper and had some small knockback.", "label": 0}
{"text": "\"Heh, Suffering\"", "label": 0}
{"text": "Sorry my bad.  I only remembered the non-binary part.  10 seconds later double checking Google and I was indeed wrong.  My apologies.", "label": 0}
{"text": "6v6 was slow as hell. When the 5v5 weekend came out I could not go back to 6v6 because it was so boring as a a tank player.", "label": 0}
{"text": "Save the game?\n\nI just preferred 6v6 overall. It all depends on balance. They have created the newest heroes in OW2 with 5v5 balance in mind.\n\n5v5 didn't change the way I engaged the game and neither will a 6v6 version.", "label": 0}
{"text": "* Cute martian\n* Ahh… Ahh… Ahh… Do not panic!", "label": 0}
{"text": "Ram to break that shield and defend the team, with a Hog to bend over the tanks while they're out of barriers", "label": 0}
{"text": "WOuldn't Queen and Hog would be consider a double pull shotty? I wonder how fast they can melt tanks.", "label": 0}
{"text": "The tank headshot reduction was way too much for DVA and completely undermined her design in a way that made her broken", "label": 0}
{"text": "I completely disagree that these \"introduced issues\" will be problems. \n\nTanks having oppressive synergy is just as much of an issue as any other role. This isn't a unique problem.\n\nNo tanks right now are particularly similar, I don't think that's an issue either. \n\nPlaying tank is fun when you aren't getting gatekept and forced to swap around. Two tanks add more flexibility and would make the role MORE fun. \"Well why wasn't it like that in OW1\" because the balance was significantly worse then.", "label": 0}
{"text": "Bob should be a giant pile a mardi gras beeds", "label": 0}
{"text": "Seriously though some games would be horrid. The countering and maps that just don't fit his fat robot butt. \nBut there is something so satisfying having the whole team switch to counter you and them still losing. We might spend every other game cursing Sombra, junk, etc but we will be so annoying that maybe our team can do some good.", "label": 0}
{"text": "There was a holiday event last year where you earned tickets that you could use to buy certain cosmetics. Looks like it's leftover from that, maybe they're bringing it back this year.", "label": 0}
{"text": "tequila margarita mojito with wine pina mimosa pina coloda im drunk in youuu", "label": 0}
{"text": "\\+ feet", "label": 0}
{"text": "Considering Reinhardt was planned to die in the cancelled OW2 story mode this would've hit even harder in that parallel universe.", "label": 0}
{"text": "Yeah I think so, this wasn’t here before so I think they might’ve accidentally brought them back in before the christmas event?", "label": 0}
{"text": "What? I’m speaking to Penguinsarmy2", "label": 0}
{"text": "Isn't this a problem that solves itself though? If they make playing tank actually fun, people will queue for it. I would queue it more often if it wasn't so damn stressful. It's not fun knowing the fate of the entire team is basically entirely on your shoulders. Tanks have too much power and responsibility and if you misstep or can't perform, you get destroyed. Having two tanks shares the load, and hopefully they will scale back or completely alter the impact of tanks in general. They need to rethink the role to make 6v6 work correctly.", "label": 0}
{"text": "Juno is way better at solo sup", "label": 0}
{"text": "I'm not going to lie, they probably will give it to Kiriko. Mercy had a dragoon skin and it really popular.", "label": 0}
{"text": "When a clean buzzword is more concise than dozens of other clinical words or curses you could refer to the personality type as, it's easier to just say \"toxic.\"", "label": 0}
{"text": "No. GOATS with Zen was developed only asd a counter to GOATS with Moira.", "label": 0}
{"text": "Roadhog,maybe?I mean he's super fun and has a lot of cool skin", "label": 0}
{"text": "Why are you disappointed tho", "label": 0}
{"text": "I love echo but when it comes to her ult there’s nothing worse than an enemy team composed of 5 heroes you don’t know how to play 🥲", "label": 0}
{"text": "I guarantee you the subreddit would be FLOODED with complaints.", "label": 0}
{"text": "That’s for them and I to know", "label": 0}
{"text": "As a Zen main I felt this in my soul", "label": 0}
{"text": "support players when their “tank” is a one trick doom that doesn’t swap off against Ana, orissa, and mei", "label": 0}
{"text": "You say where I'm getting it from and then you proceed to list why you think the game is failing lmao...\n\nI'm done entertaining this stupidity.", "label": 0}
{"text": "Even though it’s racist and a poor response it still made me chuckle just because of the absurdity of the conversation lmao", "label": 0}
{"text": "Illari! \nnever have i been so attracted to a character and their play-style. as soon as she was announced i knew that was it! my girl.", "label": 0}
{"text": "Dramatic is such a pleasant word to use there", "label": 0}
{"text": "Queen might be the *only* character that saves 6v6 from being absolute garbage.  Being able to anti-heal everyone on the opposing team is great for breaking up a Goats stalemate.  I wouldn't be surprised if her kit was designed specifically as a way to make sure Goats never happened again.", "label": 0}
{"text": "Oh no...", "label": 0}
{"text": "Oh no, Blizzard has created seasonal currencies\n\nHow long until they add Medals to the Summer Games event?", "label": 0}
{"text": "Could be the sources they use is technically ow1's, they just change the name to 2.", "label": 0}
{"text": "I’m not even remotely surprised Lucio dominates the sub Reddit. I’m not even a Lucio main and I’ve been over a few times. It’s a chill place. \n\nMercy Mafia was expected. Us zen players all get together to meditate \n\nAlso sombra may not be the most popular hero but a Venn diagram looking at all sombra mains and dps players who use Reddit is just a small sombra circle completely inside a big circle. Sombra mains fit the Reddit demographic \n\nI’m just amazed at two things. 1) Mauga actually has a subreddit and 2) over 5,000 bastion mains can apparently read. \n\nI’m shook", "label": 0}
{"text": "interested!", "label": 0}
{"text": "Ah so you’re talking about the OG team’s initial comp and not the actual one that dominated OWL for over a year. I forgot there was a distinction", "label": 0}
{"text": "Do you know how many people cycle to a new Reddit account every year or even every few months? Or just lose their passwords? A new hero can't compete with a mountain of inactive accounts.", "label": 0}
{"text": "The music choice in this is absolutely perfect, dayum.", "label": 0}
{"text": "Lucio. He's the only reason I still pick the game up from time to time.", "label": 0}
{"text": "I think they don’t make skins for them cuz they know they’re not very popular.", "label": 0}
{"text": "This but also because after a long day at work it feels so good to run around and suck the life out of someone the same way my job sucks the life outta me", "label": 0}
{"text": "she was clearly making space.", "label": 0}
{"text": "It's fun to mace to the face. If you master her, the lessons you learn will make you a better player on all other heroes, and make learning other heroes way easier. \n\n\n000000\n\n\nIt's fun to pull widow with Gracie.\n\n\n000000\n\n\nI can't recommend playing Sombra anymore. She's boring now and has lost 90% of her skill expression since the virus rework.", "label": 0}
{"text": "Where Concord?", "label": 0}
{"text": "That's the best highlight intro for her too, love it", "label": 0}
{"text": "Nah. They just need to admit they fucked up and go back to pre virus sombra, but with limited stealth", "label": 0}
{"text": ">All they have to do is change a 5 to a 6, why do they keep acting like they're introducing some new great content?\n\nThis is either how you actually feel and you're a complete moron, or this is really lazy bait and you're still a complete moron.", "label": 0}
{"text": "Genji is love genji is life <3", "label": 0}
{"text": "Maybe not popular because they don't make skins, no?", "label": 0}
{"text": "*kicks you in the face*", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "how is this toxic", "label": 0}
{"text": "No, the stuff that was linked by Blizzard was OP's own chat.\n\nIf OP said, in order:\n\n>u suck ass\n\nAnd separately\n\n>dawg\n\nIf the player reported OP for the \"dawg\" (but did so because of the previous message), then that's what shows up when the Blizzard representative queries the database for \"abusive chat as reported by players\".", "label": 0}
{"text": "We don't need to, just go back to when the DPS passive was movement and reload buffs and that's just a snippet of her power. Terrifying", "label": 0}
{"text": "I was the only real person once in a team, it was in comp aswell..", "label": 0}
{"text": "What happened to the old one?", "label": 0}
{"text": "Real. We weren't gonna win if our reins ult DID hit the enemy tank, but it was such a strange moment of \"hey, my ult didn't hit him, why?\" that made us go in replays and find this probably 1 in a million chance bug. Fr, everything had to be perfect for the enemy tank to not get hit.", "label": 0}
{"text": "I will be messaging you in 2 hours on [**2024-10-25 22:28:12 UTC**](http://www.wolframalpha.com/input/?i=2024-10-25%2022:28:12%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/Overwatch/comments/1gbwx5r/how_to_hide_ui/ltqqyq6/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FOverwatch%2Fcomments%2F1gbwx5r%2Fhow_to_hide_ui%2Fltqqyq6%2F%5D%0A%0ARemindMe%21%202024-10-25%2022%3A28%3A12%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201gbwx5r)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "label": 0}
{"text": "I'd argue Bap is the one tryhard DPS lock because he's basically Soldier but with a get out of jail free card.", "label": 0}
{"text": "It may be easier but it causes people and conversation to devolve and get less nuanced. Also causes people to be less thoughtful about what they're actually saying.", "label": 0}
{"text": "Why mash E when you can map discord and harmony to the scroll wheel and apply discord and heals to everyone everywhere all the time", "label": 0}
{"text": "Hey now, Call of Duty gets 3 whole games lumped into 1 lol", "label": 0}
{"text": "Its mine, it's square because unironically it's what best fits my rein.\nI've customized every single hero's reticle and I'm sure there are other reticle I have that'd annoy everyone else", "label": 0}
{"text": "! Me, for real!! This is the only lego Ow set I want because of Dva. Genuinely I would like this", "label": 0}
{"text": "Thank you for your service", "label": 0}
{"text": "Kiriko", "label": 0}
{"text": "You distracted their tank, make them ult, didn’t even burn your own ult and got the kill with only an Ana nade to assist at end. Yeah it’s annoying but you don’t understand how much that helps your team.", "label": 0}
{"text": "Because cute Japanese girl is cute Japanese girl", "label": 0}
{"text": "If this list is accurate, it goes to show how absurd and ridiculous the expectations are for these live service games. Overwatch is in the top 10 and still has faced numerous cutbacks on developer resources. Wouldn't happen in any kind of sane system.", "label": 0}
{"text": "This duo has historically almost never been meta lol", "label": 0}
{"text": "☠️", "label": 0}
{"text": "Nothing is better than throwing up the dva shield during a reaper ult and saving your whole team", "label": 0}
{"text": "link?", "label": 0}
{"text": "Oh, okay, simple mistake, don't know why I was down voting for trying to solve your solution 🤰", "label": 0}
{"text": "I would have done it during the nuke. Yes I would die, but the point is to send a message.", "label": 0}
{"text": "Can't wait to kick ass with a fellow tank, again. I was a Rein main back when 6v6 was a thing, I felt this post in my soul.\n\nAlso, classic cinematics were just built different it wasnt just a character showcase, it was a heartfelt atory that truly stuck with you. That very cinematic improved my tank play, god what a wonderful time for the OW Community.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Hear me out:\n\nOrisa\n\nMauga", "label": 0}
{"text": "Yeah,but thats the issue, a lot of people claim its better to tank with duo, but where were those people in OW1 to help the queue times? \n\nThe only things i remember actually being better with 2 tanks is that playing dps was easier, because i could position myself in more agressive ways knowing that i had protection and i could Just heal as suportt,0 without worring about doing damage and helping the team in other ways.\n\nAnd yeah, tank synergy its fun, but it wasnt 100% sure youre going to get a good one.", "label": 0}
{"text": "I like how you play", "label": 0}
{"text": "Just typing in match chat and speaking in voice.", "label": 0}
{"text": "I agree with all of that, and it really illustrates the inherent problem with most new support heroes. It feels very much like they're catering to damage players rather than making creative, unique utilities. Lifeweaver is *the* perfect support, and in a perfect world, all support kits would be adjacent to his. 6v6 could be a step towards that kind of support roster, where they influence the fight with utilities instead of healbotting or pretending they're widowmaker.\n\nI'm not delusional though, that will probably never happen, sadly", "label": 0}
{"text": "Can y’all just check other post on the sub in case someone posted it ? I know you just want answers but logging in and only seeing those posts is kinda annoying", "label": 0}
{"text": "Floating robot > Cute anime girl, don't @ me.", "label": 0}
{"text": "I didn't know that was a thing lol", "label": 0}
{"text": "It’s a platform which collects user data such as monthly active users, avg playing time and loads of other metrics for the console networks and pc such as steam. It’s used by major publishers to see market data and have some insights into the market", "label": 0}
{"text": "Honestly didn't think about that raised section of the floor.\nLater on when my group is available again, we'll see about testing that out.", "label": 0}
{"text": "I expected a solo ult", "label": 0}
{"text": "Noob reaper if he’s ulting when dva is still in her mech. Only time it’s acceptable to do that is if she just flew away from her team so she can’t fly to defense matrix ", "label": 0}
{"text": "The keep ow 1 merged with ow2 just for simple historical tracking and performance. It’s makes it easy since ow 1 is not longer existent because ow2 replaced it", "label": 0}
{"text": "High pop counts on subreddits don’t correlate to the popularity of characters in game; if anything, it implies the appeal of a character to players that also use reddit.", "label": 0}
{"text": "I got my ban today…. I asked for clarification specifically what was said, and I kid you not, they quoted the following \n\n“0 and 6 as mercy is crazy”\n“Please”\n“Fax”\n“Report Williams” (he was throwing the comp match)\n“You guys suck” (out of context imo)\n“Embarrassing”\n\nI remember I said you guys suck was because ALL 4 teammates were teabagging just outside of spawn in a comp match. No idea why. I do t swear, and other video games I’ve played have waaayyy more lenient levels of toxicity. This feels way too soft. Correct me if I’m wrong.", "label": 0}
{"text": "you could hard smurf 100 lobbies in a row and then throw back down with no punishment and then get permad for saying gr when the enemy lvl 5endorsement moira didnt feel like it was a fair round\n\nthey changed this though and now you get permad just for playing the game in any fashion", "label": 0}
{"text": "> he’s not the one who came up with the idea that 5v5 is worse than 6v6.\n\nEven when they were livestreaming the announcement everyone was saying that 5v5 was gonna have the exact problems it ended up having, and even the pro player they brought on could barely defend it.", "label": 0}
{"text": "Goats was the glory days as much as people hate to admit it. It was the ultimate just pure skill vs skill matchup. And Shanghai dragons showed the chink in goats armour. Getting their first win and going on to start a streak even beating nyxl.", "label": 0}
{"text": "If you just search it on YouTube you'll find it easy. \"Juno overwatch cinematic\"", "label": 0}
{"text": "Also kinda risky because if you ever try to play him then you can't stop won't stop can't stop won't stop can't stop won't stop", "label": 0}
{"text": "Lifeweaver is tricky because there was some drama with the main/first sub and some people are only in LifeweaverMains2", "label": 0}
{"text": "idc if you mad, how is she TRANS and NON-BINARY", "label": 0}
{"text": "Yup.\n\nThere are a LOT of early 20-somethings in this subreddit that look at OW1 with rose-colored nostalgia glasses. There were a LOT of issues with OW1 and 6v6.", "label": 0}
{"text": "Can't blame Microsoft on any of blizzards failures.", "label": 0}
{"text": "Because the ground is for losers, the real g monies know that the walls are where it's at.", "label": 0}
{"text": "ur fucked 🫡", "label": 0}
{"text": "Either hog or doom. I don’t play either of them, but they’re very fun when done right. Also, doom go BRRRR", "label": 0}
{"text": "Ball. Because fuck it. We ball.", "label": 0}
{"text": "SpEEd bOOsT~~~~~~~~~~~~~~", "label": 0}
{"text": "2 most satisfying tank plays are defense matrix against reaper ult and negating bastion turret with sigma bullet sponge", "label": 0}
{"text": "lmfao had 22 minute game and thinks they should rank up", "label": 0}
{"text": "We've been conditioned to look at scoreboard to get a read on performance but the truth is that it's almost meaningless if you take it at face value. \n\nTotal healing is far less important than the timing and speed of healing for example. Even ignoring Ana's massive utility, her burst healing is just far more effective.\n\nIt's also why Soldier can show massive damage numbers in scoreboard but ultimately be mediocre compared to dps who can secure kills quickly.", "label": 0}
{"text": "Would like to see a good JQ and Hog. Just constant pulls and super high kill potential.", "label": 0}
{"text": "\\+ burger king duels", "label": 0}
{"text": "Orisa disappears.", "label": 0}
{"text": "you dont climb on weaver", "label": 0}
{"text": "Throw the petal down and jump on it, duh.", "label": 0}
{"text": "Those tickets are from last years winter wonderland event, they converted into coins after it finished so there is no way on getting them now, unless they bring them back or something similar in December", "label": 0}
{"text": "Goats is back baybeeeeee", "label": 0}
{"text": "Cant speak for everyone, but I installed it for the first time since OW2 specifically because of the 6v6 announcement, so I wouldn't be surprised to see a higher player count since then.", "label": 0}
{"text": "First frog to stop at BK loses", "label": 0}
{"text": "No", "label": 0}
{"text": "It's not useless if you have an odd amount... By playing you get gold coins as part of your season progression so you can get 200 at level 10, and 600 total each season.\n\nBut yeah those little \"freebies\" that cost 10 coins were meant to knock people off their normal balances rounded at 1000 imo so they were forced to buy more coins before they added a way to gain them through challenges, and now that shifted from being earned from challenges to seasons.  I don't doubt that they gained a lot of money doing that; easily enough to justify the work put into creating the items, and the \"good will\" they got from releasing those items for a tiny price, even with likely ulterior motives.", "label": 0}
{"text": "Also Vanguard really killed off a lot of the player base. Probably not a majority, but certainly a notable minority of PCs that absolutely cannot run something like Vanguard, among some other dropout from privacy minded people.", "label": 0}
{"text": "Bro, sounds like you took the vape from hog irl", "label": 0}
{"text": "Ash. I have no good reason other than I love Bob.", "label": 0}
{"text": "yes", "label": 0}
{"text": "I was so worried you weren’t gonna win if u hadn’t I woulda been so mad (even as a Dva main)", "label": 0}
{"text": "Long rant because I have a lot to say. \n\nIn my honest opinion, 6v6 will not save the game. It will solve a few issues, and bring a whole bunch of it's own. It will feel fresh for a little while because it's a major shake-up, just like how 5v5 was at first, and eventually people will workshop their way right back to complaining about the exact same things over and over again.\n\nThe number one issue with 6v6 has and always will be queue times. Even if they won't admit it, queue times (DPS queue times in particular), were likely the number one reason they decided to move to 5v5 in the first place. We see them trying to address this by trying out Min 1 Max 3, but frankly I doubt we're gonna get anything but 2-2-2 role queue if 6v6 ever does come back as the primary format. 5-10 minute DPS queues for Quick Play will undoubtedly kill the casual playerbase far faster than current 5v5 will. This is an unavoidable roadblock with going back to 6v6 and if they can't solve it, then I don't see it being viable as the primary format for very long.\n\nThe next thing is the issue of Tank being fun. This has been a hot debate for a while, with people saying that going back to 6v6 will make Tank fun again. This is history revisionism, Tank has never been a popular role regardless of format and adding a second one to each team will not change that. In order to maintain current queue times the Tank population is going to need to at least double, which will not happen in the long-term unless Tanks are so strong that they completely run the game and every other role suffers for it. Tank has always been a thankless, niche role and likely will remain as one unless they're so broken they make the game worse for everyone else. There are some upsides to Tanking in 6v6, such as reduced counterswapping and a second Tank carrying part of the burden and pressure, but there are also several issues like Tank synergy being so important that a bad one can cause an instant loss, moreso than a bad Support or DPS synergy, and having to be reliant on your second tank in order to make plays. I'd also bet money that if they go through with reduced CC like they claim, they're eventually gonna end up slowly re-adding it in later anyways because of how strong 2 tanks at once are. I wouldn't be surprised if 6 months into the 6v6 resurgence we see hard stun on Brig Bash and Flashbang return, or Mei Freeze, longer Sleep Dart, etc.. 2 Tanks working together is so powerful the only solutions to keep the other 2 roles bearable are to either reintroduce these hard CC abilities in order to give squishies actual counterplay, or to nerf the tanks so heavily they don't feel like they have any impact at all and the role still remains unfun.\n\nNext is the issue of all of the heroes designed for 5v5. We're up to 9 heroes released and balanced during the 5v5 format now, alongisde a bunch of hero reworks and heroes in development. That's a lot of work that needs to be done to re-adjust all these heroes for 6v6, and some need it way more than others. This could lead to several heroes becoming obsolete or having to lose their identity to maintain balance. Junker Queen will likely be under 400 HP and have much weaker abilities which will make her far less fun to play. Same with Ramattra, same with Mauga, same with even OW1 heroes like Orisa and Hog who've received so many changes to their gameplay. A lot of people are going to get bummed out that their main doesn't play the same as before and isn't as fun. And that's just on the Tank side, a ton of heroes in the other roles will need major changes too and it could end up polarizing a lot of people like the initial switch to 5v5 did.\n\nI don't wanna sound like a doomer but I genuinely don't think 6v6 changes the game as much as people want it too, nor will it solve all or even most of the games problems. If 6v6 does become permanent, I guarantee within 3 months we'll be seeing people complaining about the exact same things that they do right now.", "label": 0}
{"text": "Ashe is my second most played hero after Tracer", "label": 0}
{"text": "It's almost never not ain't gonna be nohow never hadn't been.", "label": 0}
{"text": "Do you want his ult to have the distance of Rein ult or something? It's a projectile ult.", "label": 0}
{"text": "Nein.", "label": 0}
{"text": "What are u talking about they're using cs 2 and go", "label": 0}
{"text": "they also renamed Eichenwald for some reason", "label": 0}
{"text": "Okay? That doesn’t mean anything. I mean just today I saw a dumbass saying that having to click a button to come out of stealth with sombra was a problem, people say dumb shit all the time", "label": 0}
{"text": "Yeah idk some kunai HS are like some of those bs scatter arrow ricochet bs kills", "label": 0}
{"text": "Kiri also has some iframes on her tp", "label": 0}
{"text": "This one's tough. For me it's between Bap and Cassidy. Both are my most played in their categories(I almost exclusively play hitscan) and I am confident in my abilities with them.", "label": 0}
{"text": "If this is accurate I’m more shocked by how many sports slop games are up there.\n\nNBA 2k and THREE EA sports games?? That’s wild to me", "label": 0}
{"text": "That I knew. But the funny thing is I thought sym had I frames when TPing and I died to a DVa bomb anyway LMAO", "label": 0}
{"text": "Feels weird to include a bunch of PC only games and then comparing them to games on PC and console lmao", "label": 0}
{"text": "The vast majority of people pining for 6v6 keep demonstrating that they are looking at it through a very reductive and flat lens and simply thinking \"well i had fun in OW1, so they just simply need to do the same in OW2\" without fully realizing the number of issues it will bring.\n\nSome of those issues *were already an issue* in OW1 but often get forgotten; some of those issues are a new and natural result of the game evolving since then.\n\nYou might remember *having more fun* **when** the game was 6v6. But trying to simply apply that to OW2 as it stands today will not yield the same results and will cause numerous headaches for the game and its development, including costing a lot of time for the devs to try and make work.\n\nI realize people don't like to think about those behind-the-curtains aspects, but they do exist.", "label": 0}
{"text": "This is an interesting point. I agree with everything you say but will add that they also do partner with various big name publishers and developers to get more “accurate” result as well as using third part reports and databases. When you go down to lesser known games then for sure.\n \n I work for a top 10 games publisher and it’s our go to source for market data and reports. For our own titles we can definitely get more accurate hour by hour results directly from the distribution platforms and market places but for an overall market performance and summary we look at newzoo in our monthly reports and market research etc. it’s the most easily accessible and “comprehensive” report on the market itself. \n \n Now granted no business decisions will be made off newzoo numbers and anything like that will require deeper  more target and accurate research. However getting accurate data in general is tricky and doing that for the whole market it very difficult. Newzoo provides data which is deemed “accurate enough” by many AAA publisher that i think to immediately dismiss the data is unfair. unless you connect to dozens of other sources and start paying their insane subscription fees too then newzoo does the job. \n\nAlso worth having worked with newzoo data Monthly active users is a terrible metric to go by it literally just measures the number of people who have launched the game. Irrelevant of if they’ve stayed for a 2 minute new update browse or locked in for a 6 hour session. Newzoo have a tonne of other metrics which I think would provide a better picture to this and I imagine drop overwatch 2 down quite a bit", "label": 0}
{"text": "This is old as shit but I just had someone do this because they knew they were getting reported for throwing.", "label": 0}
{"text": "Eichenwalde is always renamed for Halloween", "label": 0}
{"text": "Their team: Orisa+Mauga\n\nMy team: Doom+Ball", "label": 0}
{"text": "fair", "label": 0}
{"text": "3 dps>2 healers", "label": 0}
{"text": "Eh think of your audience.  Sure some of us could refer to most of these \"toxic\" people as \"narcissistic\" (maybe even \"brittle narcissism\") and/or \"sadists\" bc they never take responsibility for any of their own actions, and/or they take joy in the pain caused by triggering others, but would younger or less educated people understand that?  No.  So then what's the point, except to feel personally superior.\n\nOr we could just devolve even further by saying they're acting like dicks or assholes.  At least we'd be mixing it up and not overusing the word \"toxic.\"", "label": 0}
{"text": "5v5 is pure garbage right now and the sole reason I can't keep playing the game.\n\n\nI do not play tank in 5v5, it is horrible.\n\n\nI hate playing against tanks as well in 5v5, its so bad I wish not to engage with the role because its completely overpowered individually.\n\n\nI hate playing support because the moment you get a game where you are hard focused, it is hell on Earth.\n\n\nI hate playing DPS because you just meet a tank that won't die and you have less agency than ever unless you like playing snipers (which I do not).\n\n\n6v6 is far better universally. It is however balance dependent, if they don't balance it right it will be shit. I played RELIGIOUSLY in the last 6 months of Overwatch 1 and it was perfect, but shields & defenisve abiliites finally were balanced (double shield was so easy to burn through), I'd take that ANYDAY instead of having to deal with godzilla tanks every match.\n\nDPS was more fun because of this.\n\nTank was more fun because you weren't the center of the entire game.\n\nSupport was more fun because both teams had more of a \"walking base\" feel and the 2 tanks created more safe zones.\n\n\nGod, I miss 6v6. 5v5 has devolved the game so damn much.", "label": 0}
{"text": "I’m not complaining *that* much but you have to agree that just seeing the same post over and over again is just annoying, people have different patience levels you know", "label": 0}
{"text": "Newzoo isn’t going to be 100% accurate but honestly getting data for the whole market and data from many publishers who would wish to keep it private is hard. I think this is a good indication but not to be taken as gospel. \n \nAdditionally Active monthly users is a terrible metric used by newzoo here. It measures the number of people launching a game irrespective of if they close it after 30seconds or play for 6 hours. They have so many other metrics that would probably paint a more accurate picture and see the table shift massively \n \nAlso this is only for 6 countries and not a global picture. I’d struggle to believe overwatch is anywhere near LoL or valorant globally", "label": 0}
{"text": "Zen\nFunny Robo Men\nHas Balls", "label": 0}
{"text": "TF2 solved this issue in it's 5CP gamemode by just making mid cap slow and spawnpoints cap incredibly fast.", "label": 0}
{"text": "> Eh think of your audience. Sure some of us could refer to most of these \"toxic\" people as \"narcissistic\" (maybe even \"brittle narcissism\") and/or \"sadists\" bc they never take responsibility for any of their own actions, and/or they take joy in the pain caused by triggering others, but would younger or less educated people understand that? No. So then what's the point, except to feel personally superior.\n\nBecause using these terms might get you to stop for a second and actually THINK about what you're saying. That calling someone a narcissist or sadist without actually knowing them is fucking stupid. And that everyone has the capacity to be rude on the internet from time to time. \n\nIf you have to have someone explain to you why catch-all words like toxic are bad, you are likely sort of stupid.", "label": 0}
{"text": "I really thought I was just having eye issues when that first happened because the other two I my party didn't say anything about it so I just ignored it 😆", "label": 0}
{"text": "She's the only support with no way to heal herself, I don't see a problem with her having mobility", "label": 0}
{"text": "Tank is pretty bad- I don’t find enjoyment from the game anymore", "label": 0}
{"text": "So it’s an hour since this has been posted. How do you feel/think about the comments you’ve received?", "label": 0}
{"text": "*i want to hug you like a big like a big, fuzzy, siberian bear*", "label": 0}
{"text": "Before you needed a decently skilled lucio player to achieve this kind of mobility", "label": 0}
{"text": "LETS FUCKING GOOO I CAN PLAY TANK AGAIN AND ACTUALLY HAVE FUN", "label": 0}
{"text": "Maybe you accidentally set the in-game resolution to something less than 100%?\n\nThis is a different setting than the resolution setting itself.", "label": 0}
{"text": "I think you wont be able to switch roles... it doesnt make sense otherwise. Example: DPS is kingmaker, 2 tanks and 2 heals. One tank wants to go heal, now you have 1 tank and 3 heals, the new tank should be kingmaker. If you can switch roles than youd be creating a new kingmaker mid game and eliminating the benefits the previous one had, potentially mid-fight. Riffing off your prediction I bet teams will need to lock in the role they want to be kingmaker, and the role they will play for the whole game as we do now for role que.", "label": 0}
{"text": "I always see this comment l. What reason do people have to buy used accounts?", "label": 0}
{"text": "Ball/doom combos are gonna be crazy.", "label": 0}
{"text": "In the distance: *crying omnic monk sounds*", "label": 0}
{"text": "it’s still there. it plays in your first launch of the game", "label": 0}
{"text": "Is so hard to understand venture Is just a check up on dei list they Made the character for that not for having a good designe or interesting gameplay is just a pathetic dei inclution, don't feel surprised if the next one hero would be a one una wheel chair or having vitíligo just for pandering idiots", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Tell me you never played 6v6 without telling me you never played 6v6", "label": 0}
{"text": "Resolution is on 1440p 165hz.\nThat's not the matter sadly.", "label": 0}
{"text": "Tbf this if for 6 specific countries. I’d imagine globally these tables change massively. You’ll get a lost of the other markets shifting more to LoL and valorant. Overwatch having far smaller playerbase", "label": 0}
{"text": "I’m blind", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Fair point. I don't remember the tips and tricks vid, but I'm falling out of playing and watching Lifeweaver content anyway.", "label": 0}
{"text": "Sirspanksalot was going to use that same excuse if the match went sideways.", "label": 0}
{"text": "Ultimate: quickly get away from genji", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "the term game is not inclusive enough /s", "label": 0}
{"text": "Speed boost", "label": 0}
{"text": "*match unplayable", "label": 0}
{"text": "Citation needed", "label": 0}
{"text": "But it has been historically fun.", "label": 0}
{"text": "Getting downvoted cuz people treat 6v6 VS 5v5 like politics, but ur absolutely right", "label": 0}
{"text": "Yes. This will be for players like you, it's fine to have that opinion. \n\nI'll be enjoying 5v5.", "label": 0}
{"text": "I ran into the same bot team two times, with like 3 matches in between. It was in comp. They would not move, and every few seconds they would move at the same time a little bit and then stop. Never happened before and never happened again (to me)", "label": 0}
{"text": "I will forever hate Apex for taking away Titanfall 3 from us.", "label": 0}
{"text": "I'm not the one who called it the strongest duo!", "label": 0}
{"text": "explain, i'm ears", "label": 0}
{"text": "kiriko!  \nsuzu  \nmore suzu", "label": 0}
{"text": "6vs6 coming back is mainly about one thing: solving the tank shortage. 5vs5 puts very heavy pressure on the tank, and 6vs6 would move that away big time.", "label": 0}
{"text": "Guys, nobody said OP was complaining and it IS kind of ridiculous.", "label": 0}
{"text": "Did it fix the blurry image, though? The FPS is definitely unplayable, but ruling out factors is helpful.", "label": 0}
{"text": "There is no access to console numbers. This is trash.", "label": 0}
{"text": "By their own words:\n\n[https://resources.newzoo.com/hubfs/Factsheets/Newzoo\\_Consumer\\_Insights\\_Games\\_Esports\\_Mobile\\_Factsheet\\_2018.pdf](https://resources.newzoo.com/hubfs/Factsheets/Newzoo_Consumer_Insights_Games_Esports_Mobile_Factsheet_2018.pdf)\n\nI don't see any mention of \"partnering\" with big name publishers. But maybe you can cite a better source", "label": 0}
{"text": "Right?! My friends keep trying to get me to turn chat off because I don't exactly bite my tongue when people are being assholes, but then I'll miss the fun get a bucket of popcorn and watch moments.", "label": 0}
{"text": "Correct, however “whichever team has less DPS on it auto wins” doesn’t make for very engaging games when like 50% of the playerbase is DPS players.", "label": 0}
{"text": "We bring the boom", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "I always hear \"Peep this p*ta\" idk why 😭", "label": 0}
{"text": "Did everyone forget that E is discord or did i catch the response of every console user?", "label": 0}
{"text": "Oh yeah. It did.\nMy fps counter says \"3...“ it can't believe it either 🤣", "label": 0}
{"text": "goddamnit", "label": 0}
{"text": "Nah, it's the opposite. Good awareness to surroundings yk? :3", "label": 0}
{"text": "[d.va](http://d.va) fall in the same list as widow just makes the whole match unfun", "label": 0}
{"text": "no its really really bad lately. Like. Im 27 - 2  my junkrat is 7 and 9 in area with lots of closed rooms.", "label": 0}
{"text": "I have x3 times as much time on Ana as I do on any other character. She's just that fun.", "label": 0}
{"text": "Mixing dragons and one of my favorite characters in the game? Don’t gotta tell me twice, I’ll take your entire stock.", "label": 0}
{"text": "I guess I should have added a lol really I just thought it was funny", "label": 0}
{"text": "Woah woah woah just wait til u catch the hog and ball torture pal. There ain’t enough space in this town for the four of us.", "label": 0}
{"text": "In a way I feel it’s the opposite lol \nEveryone hates Moira because getting flanked and sucked to death by her feels like shit but making her work well enough to win a game actually is quite hard lol there’s just no REST.", "label": 0}
{"text": "Maybe OW isn't dead after all. Shocker I know, but a bunch of sensationalist doomeer youtubers would hate to hear this.", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nIn accordance with our [Quality Guidelines](https://www.reddit.com/r/Overwatch/wiki/rules#wiki_discussion_threads_.28self.2Ftext_posts.29), we currently do not allow the submission of posts with no or minimal text description. Please resubmit your post with additional context. If you have a quick or simple question about the game, please see our [latest **Quick Questions** post](https://www.reddit.com/r/Overwatch/search?q=quick+questions+author%3Aautomoderator&t=week&sort=relevance&restrict_sr=on).    **Attempts to bypass the character requirement via inserting nonsensical text will possibly result in action against your account.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Free lunch", "label": 0}
{"text": "I... I have to try this...", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Nice blade runner detuned piano music", "label": 0}
{"text": "It's not vanguard but it is in general league being on a heavy decline. RN it is having a big worlds boom again so for a moment it's a bit revitalized, but post worlds decline will most likely continue. Riot announced they are laying off even more people, re-using more assets, and releasing skins that cost 200$ and up even more often.", "label": 0}
{"text": "You're a man of a culture as well :-D", "label": 0}
{"text": "Good kitty good kitty good kitty. Huuush, little baby! In the desert, in the desert, in the desert....", "label": 0}
{"text": "If I'm not slaving away playing tank, then I'm playing Juno to make other tank players games less miserable.", "label": 0}
{"text": "I didn't say base font, I said as their main font, like your chosen one. Its fine you disagree, like I said, I knew it was offtopic lol. \n\nThis font just makes me think of facebook mums lol", "label": 0}
{"text": "It literally was. Like, you didn't even have to download a new game. It was patch. And the games free. It couldn't have been anymore like what you're asking for.\n\n\n\n\nAnd the whole point of OW2 was to address core issues with OW1. You can't know until you try and their willingness to roll it back is good.", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines), as it does not reach a minimum length.  Please resubmit with a clear and appropriate title.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "The gilded aspects for skins cost 20 each.", "label": 0}
{"text": "LMAO i’ve started playing widow a lot more, and i was basically 1v1ing another widow in qp… i said gg when we won and they called me terrible 😭 ", "label": 0}
{"text": "Not necessarily. I remember running 5 tank games with ana where everyone dives", "label": 0}
{"text": "True tbh. DPS was also extremely unimpactful in 6v6.\n\n\n\n\n\nPlus someone like Ramattra will be obnoxious in 6v6. He can run in with nemesis form, get bubbled, block any other damage whilst a zarya walks past him to protect him with her charge and he's suddenly a whole lot harder to kill.", "label": 0}
{"text": "I'm around a lot of people who are toxic af on a regular basis, I've known most of them for 5-8y during OW over 100s-1000s of hours, and I can easily say that their reason for being that way is often a mix of narcissism, sadism, serious anger management issues, and some of them are just critical of others by nature, raised to be judgemental and have little self control.  But sometimes (maybe most times) people are fairly normal, balanced and just have bad days, sure, and uncommon rudeness happens.\n\nThe point remains: when any of those people rage on the chat or on comms, it's much easier to just say \"toxic.\"\n\nNow I start tossing around a few reasons for what other words you could replace toxic with and you shift the goal posts by a mile and imply \"omg how dare you judge everyone clinically\" when in truth, there are a lot of possible reasons for their behavior.  Consistent angry/hateful bullying behavior can't always be shrugged away as \"good people venting.\"", "label": 0}
{"text": "to be fair, only like three - maybe four - people still work there, they fired everybody even slightly proximal to having an opinion on possibly caring to maybe one way write about glancing near the lore.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Saying Samito gets carried is kind of crazy when he solo queues and is consistently top 10 in combined T500.\n\nI don't think he hates support players either, nor is there precedent for him being misogynist. Do you have proof for these claims? I found the suicide baiting clip, which was... Yeah...", "label": 0}
{"text": "Thats a though one for me, i was playing Tracer since ever but after Sojourn was published i got in love once again, i really like the mechanical demands of this hero and think its very fun to play. \n\nBut still, Tracer my love!", "label": 0}
{"text": "Can't tell if this is a new copy pasta or is OP serious?", "label": 0}
{"text": "Agree with you on the most part except for the aiming. I would say aiming is more important in Overwatch if you play aim intensive heroes because your targets have more: defensives, more survivability, more prolonged duels and fights, more immunities, more healing, more diverse hitboxes, more angles. In tactical shooters it's mostly a case of who see's-who-first, reflexes and camping around a corner 24/7. That's why I personally feel like they are so incredibly boring.", "label": 0}
{"text": "Prepare for trouble", "label": 0}
{"text": "OW has shown that it has the potential to not follow the usual fps formula and I think it's a shame that it's moving back towards that. It seems we want fundamentally different things from the game; I want unique abilities and fun hero interaction, whereas you and many others simply want raw, black and white skill expression for every hero. You've used the word \"climb\" so many times in our conversation, but I couldn't care less about that tbh. Again, though, I realize I'm in the minority of the current playerbase with this opinion.", "label": 0}
{"text": "Great, barrier watch is back. Time to shoot infinitely into tanks that never die", "label": 0}
{"text": "But there's actually several... Brig, Mercy, Zen, Lifeweaver lol.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Cass, soldier, Ash. She gets melted by any of these. Her movement is good but that's her thing. Heroes are allowed their thing.", "label": 0}
{"text": "My point wasn’t an attack on your point or to try to make you believe me but trying to give more context into what I’ve learned form working with them. \n\nHowever if you want me to hit back at your point then you do realise that the surveys are NOT to used to measure the market state or playerbase but to look at what they call “gamer research”. That very same pdf mentions it’s to look at player behaviour, spending and used more for marketing research. It’s a separate service they provide and look at and NOT the games player data which is shown here. The metrics they gather could not be something an average player would be able to provide and would be unusable data", "label": 0}
{"text": "I cannot describe how the massive lore drops this season have made me so much more engaged than the past few seasons as I wait for him\n\nI love Juno, I loved Venture and Mauga character wise, but I am HYPED for our spiker phreak", "label": 0}
{"text": "just wait and try again later", "label": 0}
{"text": "Wait... Wait wait wait wait wait... Nonononononono.... 3 support 3 tank... WAIT WAIT WAIT WAIT WAIT", "label": 0}
{"text": "If you play against anyone who actually understands her movement she's incredibly hard to hit, even for hood players", "label": 0}
{"text": "Their team: Roadhog, Junker Queen\n\nMy team: Winston, Ramattra", "label": 0}
{"text": "So you can’t use legacy points", "label": 0}
{"text": "I hope they also bring double capture points back too", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Thanks😀", "label": 0}
{"text": "Brig has inspire, Mercy has sympathetic healing, Zen is the only one that doesn't", "label": 0}
{"text": "a part of me wants to say Mauga would become insta-balanced because of it since there's now a 50% chance that a Reinhardt would tank his bullets for the DPS all the while the Zayra harassed Mauga", "label": 0}
{"text": "Me too 😭😭😭\n(I also need a skin of some guy wearing a skirt, but that's the least of it)", "label": 0}
{"text": "im sorry, but if the matcmaking isnt broken that day and that happens, the problema is you my friend. You can main heroes that aren´t good against her, but as i said, a Soldier should can hit her easy, more in the video situation.", "label": 0}
{"text": "Of those 4, only Zen doesn't", "label": 0}
{"text": "Currently M2 in Open Queue (I think that's top 100? Not sure) and yeah, OP feels pretty good, assuming your team doesn't go random ass picks. JQ Rush with Lucio+Moira and Rein Brawl with Juno + Brig play pretty well, and both have a flex slot for whatever you want (usually a third tank like Ball)", "label": 0}
{"text": "Sure, but this is an awful example to showcase it. Genji could do the same thing with wall climb here.", "label": 0}
{"text": "Tank, Doomfist:\n\nIf you like Freedom, Doom is a good pick. His ability to traverse the map quickly gives you a lot of freedom in terms of how you want to approach an area/battle/enemy. Mastering the ability of getting in and out of fights quickly is the key to your (and your team's) survival. If you don't like giving your opponents a lot of time to breathe, Doom is a good option for that as he is very nimble and can close the distance fast, so enemies need to always be prepared for a Doom dive and aren't allowed to let their guard down. You also have amazing voice lines :)\n\nDps, Pharah:\n\nIf you are looking for more verticality in your game, and want to be a threat from above, Pharah is excellent for it. Echo is obviously there as well, but she is a bit different. Echo excels more in the 1v1 department and has more utility because of her ult, but Pharah has generally better damage and is more of a zoner and that can control areas/chokes/groups better. So if you want the latter, pick Pharah. The ult (if used correctly) can also kill any hero you want because of the strong burst damage.\nPlus if you are a fan of Bazookas/Rocket Launchers in shooters, then Pharah is your girl!\n\nSupport, Moira:\n\nIf you want a mobile and elusive Support hero, Moira is a good pick. Her fade ability is a great tool not only for traversing the map quickly or reaching certain spots, it is also a great tool for defensive purposes (to get away from pressure), and for offensive purposes (chasing targets that try to retreat). While she doesn't have the utility other support characters have, she instead has the ability to be a very strong offensive tool that can dish out a lot of damage while also healing a lot and supporting her team. She is very flexible in that regard, so you can play her more offensively or more defensively based on what your team needs right now. Some other supports can do this too, but Moira doesn't require nearly as much execution as she is more simple to play.", "label": 0}
{"text": "Genji can literally do this with wall climb.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "I love playing tank. Give me a good Juno, a good grandma, or a blood thirsty Zen and we got this my friend!", "label": 0}
{"text": "Or as soon as you ult everyone (rightfully) focuses you", "label": 0}
{"text": "How can you get these lobbies?", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "That's only looking at the franchise level stats. I wonder what this would look like if the three specified versions of COD were broken out individually.", "label": 0}
{"text": "Junkrat, he’s a good time.", "label": 0}
{"text": "Me!! How much?", "label": 0}
{"text": "Especially looking at the trend here: Overwatch isn’t getting more popular so much as Valorant and Apex are becoming less popular as time goes on. \n\nOW2 being at number ten, if anything, represents the game reaching its celling in terms of how much players will continue to tolerate the 5v5 gameplay and its lack of ability to actually KEEP people playing it. No wonder 6v6 is coming in two seasons…", "label": 0}
{"text": "OH HELL YEAH\n\nGood job!! U look amazingggg", "label": 0}
{"text": "That was very wp by you", "label": 0}
{"text": "Historically no.  While it is true that ball can basically guarantee one of her bubbles gets her 40 charge, the real strength behind her bubble is to stop someone from dying when making a risky play.  Something ball does not need since OW2 really dialed back hard CC.\n\nOther than bubbling his slam, these two tanks do not synergize well.  One wants to dive and then disengage, the other wants to stick around and brawl.  Zarya in a 6v6 formal absolutely does *not* want to the only tank on the frontline.  She doesn't have the sustain or damage output to pressure or survive two tanks focusing her.  What she wants to do is allow her other tank to create the space and she keeps it.  \n\nIt's why, while not always meta, Rein has been a consistently great duo pick.  She allows him to charge in the middle of the enemy team and swing his hammer dealing unblockable cleaving damage while she can stand behind him and picking someone off one by one.\n\nBut a Zarya/Ball duo is just asking the enemy to bumrush her team and out-brawl them since Ball can't really help  with his low damage output towards tanks.", "label": 0}
{"text": "What about sugma balls?", "label": 0}
{"text": "yes it was ranked", "label": 0}
{"text": "I was simply citing my source and opening room for yours so you can elaborate on your claims. Why that's perceived as an \"attack\" one way or another is completely bizarre to me, but to each his own ego, I guess.\n\nAll their marketing material simply states what value/info/stats you can obtain via their services and reveal nothing about by what methodology they obtained these data to begin with. \n\nBut I agree that systematically surveying 75k people on an annual basis is not something an average person would be able to provide to begin with", "label": 0}
{"text": "What rank?", "label": 0}
{"text": "How do you report someone for a specific phrase? Are you saying that he right clicked on the OP’s name when it was next to the word dawg so that’s what got submitted to the system? What if you report from the player list and not by right clicking his name in the game chat? Then nothing gets into the system unless you type out the word or phrase that OP said", "label": 0}
{"text": ">uncommon rudeness\n\nI find this phrase hilarious. Rudeness on the internet is the farthest thing from uncommon, and saying otherwise is laughable.\n\nAgain, your inability to even begin to grasp the flaws in words that serve only to otherize people/ behavior just indicates to me you lack critical thinking. You can write up a bunch of paragraphs but that alone makes it pointless to continue.", "label": 0}
{"text": "Wow, I just went on a rabbit hole. Found Zero Hour for the first time - definitely my favorite cinematic", "label": 0}
{"text": "Genji cannot do figure eights around round columns like that", "label": 0}
{"text": "Junkrat lol I love causing problems and making explosions", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Holy shit.\n\n\"Leap.\"\n\nEvery jump. I need it", "label": 0}
{"text": "Whoa now, don't let blizzards Twitter see this", "label": 0}
{"text": "It's not ideal actually, cause you'll scroll more than once, and end up throwing the orb to a new target that was intended.", "label": 0}
{"text": "1. will be infinitely better. 5v5 is egregiously flawed.  \n2. no glory days? what the fuck are you talking about", "label": 0}
{"text": "yes but he never cooperated with the team", "label": 0}
{"text": "My FPS counter never gets truncated like that. Could there be some other odd stuff going on?\n\nAs an experiment, what happens if you cap your FPS?", "label": 0}
{"text": "Kiri, for sure", "label": 0}
{"text": "By, the DPS players are easily the class with the least consistent skill. A lot of DPS players are very good and often struggle to stay alive.", "label": 0}
{"text": "Yup. Pretty much.\n\nThe system can only gather so much contextual data based on how and when the report is made. If you report them from the social tab then no specific message form the chat log would be tied to the report.", "label": 0}
{"text": "Ana is just the most satisfying character in the game. Healing feels great. Sleeping feels great. Dosing feels great. 10/10 would recommend", "label": 0}
{"text": "Well people just opening the game might not be the most accurate but it should effect most games to a similar extent so it shouldn't fudge the numbers too much", "label": 0}
{"text": "You’re lucky he logged off", "label": 0}
{"text": "Brig has self healing (inspire) and a shield\n\nMercy has movement in place of self healing (like juno)\n\nZen has stupidly high dps instead of healing, he has the advantage against nearly all dps if they're close-ish\n\nLifeweaver has self healing on his dash and his petal is good movement", "label": 0}
{"text": "As a bastion guy can confirm. \n\nAlso nade jumps are great and useful too.", "label": 0}
{"text": "Me, an OW1 Bastion main, who never had issues with double shield. (Always had a mercy to Boost me)", "label": 0}
{"text": "sketchy jump \n\ni wonder if winton would've fallen in the hole anyways", "label": 0}
{"text": "Dva should’ve just flown away", "label": 0}
{"text": "I mean, more power to you, but telling 1/5th of the playerbase to just “git gud sweaty” because you personally feel you have more “agency” with one less player is so inherently selfish as someone who presumably wants more and better players to que up. It’s a lot of the reason OW2 has a reputation for being as toxic as it is, because 5v5 cultivates a terrible mindset for a team-based game like this one to have, let alone building core mechanics around. \n\nTL;DR: Objectively bad take.", "label": 0}
{"text": "not twice leaving the chat after", "label": 0}
{"text": "Blizzard: Godrick kiriko skin? Done !", "label": 0}
{"text": "a lot of botted accs have skins with them, that’s the main pull i think, i’m not sure if there’s a level requirement or something similar to play comp but that’s also something people look for", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "But that’s so…. Stupid", "label": 0}
{"text": "So the chat log in the post contains both the specific words he was reported for *and* whatever else the blizzard employee dredged up? I figured it’d be one or the other", "label": 0}
{"text": "Nostalgic for Rein + Dva.", "label": 0}
{"text": "We call it the “Zen recall” in my squad (because I feed)", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines), as it does not reach a minimum length.  Please resubmit with a clear and appropriate title.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "kinda wish they made him immune to damage from his own nade, I use it to escape sometimes and like 40% of the time it works, 60% of the time I die to my own grenade", "label": 0}
{"text": "Positioning and movement win over purely mechanical aim in OW, I'm certain of that. Game knowledge giving you a \"precognition\" when will, for instance, Rein smash will also let you do more by simply taking a different angle instead of standing behind your whole team. Funny bet me wrong, aim is important - it's a shooter game after all. \n\nBut it's not the key to win. You can have a mediocre aim and still win high elo fights by dropping the antinade or sleep into proper targets in a proper moment, effectively winning games. Or just shield, charge or aggro in the right tempo and with synergy with your team cooldowns. That's more decisive than pure aim.\n\nAim wins in majorly DPS lineup, especially hitscan - Ashe or Widow or Cass without aim are just sorry sobs.", "label": 0}
{"text": "Then can you explain why one of my accounts is silver 5 and the other one is gold 3 with equal games played on each?", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Rainbow six siege?? I didnt know it was that big.", "label": 0}
{"text": "Dva.\n\nShe is so fun. Even in a world of shameless counterwatch I try to make her work.", "label": 0}
{"text": "what country do u live in?", "label": 0}
{"text": "\"do not panic\"", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Not that it's going to stop questions like this but the answer to \"when is ____ coming back to the store\" is always \"we don't know\" because Blizzard doesn't tell us. Apparently they've decided it's the best way to sell this stuff.", "label": 0}
{"text": "W juno, I want her on my team", "label": 0}
{"text": "I can actually see why you would enjoy 5v5 more in that aspect and I mean it in the most endearing way, I think you have a thing for self deprecation lol", "label": 0}
{"text": "\"Swap off DPS, you are ruining my playstyle\"", "label": 0}
{"text": "Dollar store comp", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "I wouldn't play Overwatch at all if that was the case. Being locked to one character is boring.", "label": 0}
{"text": "America", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Cap it to anything. 60, 100, doesn't matter.\n\nBF2042 is a different game. Different engine, entirely.\n\nI'm trying to help you try out different things to see what might have an effect and see if you can figure out what's causing the issues.\n\nIt really feels like you're just dragging this out. I'm willing to offer my advice, but if you're going to second guess and force me to rationalise a suggestion at every step, then this is going to take much more time than I'm willing to commit.", "label": 0}
{"text": "Ram and Ball because they likely have no synergy. \nActually Winston and ball would probably work", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Eu ameiii, compraria todos com certeza", "label": 0}
{"text": "Ball and doom beating up those sombra and Ana players no more stuns", "label": 0}
{"text": "ah. yeah... there have been more of these than there really should...", "label": 0}
{"text": "I love sticking something else into widows 😉", "label": 0}
{"text": "Invincibility Frames.  It's common in many games.  Like in souls-like games with dodge rolls you are usually invincible for a few frames during the animation.", "label": 0}
{"text": "Orb stays on targets for 5seconds or so. So throw it on them before they turn a corner, it'll heal while they engage. Zens one of the better flank healers", "label": 0}
{"text": "Sigma balls", "label": 0}
{"text": "Yeah I think if tank is what people want to play the least, it wouldn’t make sense to double that role requirement to increase to 6v6, instead just add another dps slot since that’s what most people play. \n\nSeems like an easy fix that way, but then again I’m not a game developer nor do I know how that could affect the entire feel of each match.", "label": 0}
{"text": "i only play sigma. so my buddy will have to play someone who is not sigma while i play sigma. hope this helps 👍👍", "label": 0}
{"text": "Also Mei could have used wall to get up and freeze her dead, Junk could have used mine to get up on the platform and get her as well...", "label": 0}
{"text": "You don't need to heal if the enemy is dead #🧠", "label": 0}
{"text": "track his hook cooldown and make sure your shield is ready to cut the opponent he yanks to him off from his supports healing, \n\nalso if he yoinks a tank, charge straight at your teammate hog and you’ll get his blast hog combo damage + an easy Reinhardt to land charge \n\nas well you can protect him from Ana nades with your shield if you track Ana", "label": 0}
{"text": "Sigma balls", "label": 0}
{"text": "soccer is the only of the main sports (football, basketball, baseball, hockey) where they say match instead of game", "label": 0}
{"text": "I do this but get distracted when a tank starts to peel or another squishy looks easier to hit… I need the self-discipline to follow-through on the pick instead of being ADHD about who I’m hitting lol", "label": 0}
{"text": "so 2030. got it", "label": 0}
{"text": "They gather **everything**. They definitely have the entire chat log, but their CS reps aren't getting paid enough (or given enough time) to sift through hours upon hours of logs just to try and justify a suspension that may have been reasonable to begin with.\n\nThe stuff they post is probably still from a basic database script they have lying around. Just pulls all reports for a player that were reported. Then they send that.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Zen been one of my big faves since day one but I'll still be the first to say that discord is a problem. I wouldn't mind a little rework as long as they leave his primary and secondary fire alone. The rest of his kit don't matter to me.", "label": 0}
{"text": "Zenyatta moves quickly.", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Don forgetti Zenny kickback kick in the nutty", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Good thing you can use both if you use the random favorites system", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah it’s gonna be especially fucked here in OCE too. I enjoy tank but that’s because of the 1-4 minute queue times. Finding two more people that want to play tank is gonna be frustrating", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Same. Or atleast take less self damage from it.\n\nSame happens with me except i fire it to do extra dmg and next thing you know im dead because it took the rest of my health.", "label": 0}
{"text": "Much appreciated Juno. Also we tank mains love us some good support mains too. When we have a good support we feel a little less tortured", "label": 0}
{"text": "I agree @ you", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "You mean football", "label": 0}
{"text": "Mauga/Zarya is unironically going to be so fun. Mauga getting free bubbles to cleanse status while Zarya gets full charge instantly, and then you just burn through everything.\n\nObviously limited to close-quarters maps but I'm very excited to try it out", "label": 0}
{"text": "I guess cos you play Matches, overwatch is a game as a whole where you play matches.\n\nStill dont really see why they had to change it tho :/", "label": 0}
{"text": "Did it happen in Comp or you just bullied some newbie player?  Share the match replay code.", "label": 0}
{"text": "They hated Jesus because he told them the truth", "label": 0}
{"text": "this response gives me the same energy of Ramattra saying \"REALLY???\" in that one interaction with Genji LMAO", "label": 0}
{"text": "Uau eu também", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "r/angryupvote", "label": 0}
{"text": "That's the price you pay for match quality. Overwatch has a more complex matchmaking system with more requiem and stipulations than just about any other game I've ever played. Not only do you need 2-4-4 they also have a rank range and they need to match the ranks of the DPS to the DPS and supports to support on top of the fact that blizzard doesn't let you queue into the same map or mode more than once so if someone else just so if the 10 players in a lobby all played on different maps that seriously limits things (and just to be clear I don't know the exact system but it's not just one map your never gonna get the same map every other game either I think maps have a cooldown but again I don't think they've ever revealed the exact system)", "label": 0}
{"text": "I just want rein zar/ winton dva", "label": 0}
{"text": "Zen has a \"sike\" button tho", "label": 0}
{"text": "It’s not Mandela effect as the word potg exists, and is even in the Halloween email they send out for the new season and everything", "label": 0}
{"text": "Junkrat just to mess around  and bomb people", "label": 0}
{"text": "Valorant is not nearly as engaging IMO. Valorant is CS with abilities. Whereas OW is ability centered and more vertical and dynamic an colorful and full of lore, not mostly headshot focused, more team focused, etc.", "label": 0}
{"text": ">  general league being on a heavy decline.\n\nLoL is still big as f, just 2 years ago all runeterra games, without Valorant, combined had 180m monthly active players (mostly LoL), CS2 right now has 26m monthly players (check cs website) and its the most popular game on Steam.\n\nRiot Games also has eleast 3,5k employees, they doubled it from 2019 to 2022 (2k to 4k). The whole industry took a hit thats why they took the cut and save money and it happens almost always if a company expands way to fast. Some game projects got canceled and Riot Forge.\n\nThey have more employees than Capcom or Sega...", "label": 0}
{"text": "Doom Zarya is so back 😈", "label": 0}
{"text": "Go zarya.\n\nZarya can cleanse the anti heal from nade with her bubble. Against sym you can just bubble and get charged by syms damage", "label": 0}
{"text": "Because she's last alive. She can still do that in a fight", "label": 0}
{"text": "Just shoot the shield as a team for 4 seconds and destroy it", "label": 0}
{"text": "Ahhh thank you!", "label": 0}
{"text": "DPS queues were the main issue. Regularly at 5 to 10 minutes.", "label": 0}
{"text": "Thats the point.", "label": 0}
{"text": "The people complaining and the people buying are often not the same", "label": 0}
{"text": "As a Rein main I miss my zarya partner.", "label": 0}
{"text": "I tried to play a game of apex yesterday but the UI looks like shit compared to last time I played and my frames were shot. So mad they’re making the game worse.", "label": 0}
{"text": "I always thought DPS was the universally favourite role", "label": 0}
{"text": "sometimes I do a 180 to nade someone behind and apparently that person is literally on my ass so I die to my own grenade (real story, I hope that genji gets solo shattered every match)", "label": 0}
{"text": "Sigma. I love him so much... but even then I doubt it'd be very fun playing him over and over.", "label": 0}
{"text": "I have a friend who bought a mercy account just because it had the pink skin from last year. Like. Girl why?", "label": 0}
{"text": "Step one that really unlocked brig for me was to stop viewing her as a pseudo-tank. You're right that she is very vulnerable when swinging, so you have to play somewhat safe. You also want to keep your shield bash available to bash away as an escape option. This was a big change for me since it's tempting to bash into the enemy both for damage and getting inspire, but then you are stuck with no way out if you're in trouble.\n\nThe second big thing is simple, you just need to hit a decent percentage of your whip shots. They do a lot of damage and more importantly get your inspire going while you stay safe. In general you should use it on cooldown, of course there are exceptions, but it's a good rule of thumb.\n\nYou can use your packs a lot to help people who may not be getting your inspire healing. They've buffed the packs a lot over the last year or two so they are pretty good for this.\n\nOnce you are in the default state of being safe though, you need to re-learn when you can hit the gas. It's amazing as a brig when the enemy is on the backfoot because you can just start swinging, dive their healers, do whatever while healing a ton. Especially if you have Rally, you can make some big plays by stunning a critical target, posing a big threat to their backline, or even just cut off their line of sight with your huge shield. I actually don't mind playing her into snipers since the shield protects you from one shots.\n\nI'm by no means a high rank though but that's my experience", "label": 0}
{"text": "just wait till you see how mercy can move", "label": 0}
{"text": "Oh shit u just described my tank playstile", "label": 0}
{"text": "Junkrat, I used to be an OTP on him. I'd just need more frequent resting periods than I have now.", "label": 0}
{"text": "Hog Jq and Rat", "label": 0}
{"text": "The CoD devs themselves combined multiple games into the same launcher. The Steam Charts and the Xbox rank of popularity also have \"Call of Duty\" as a single entry.", "label": 0}
{"text": "it’s soccer or fútbol", "label": 0}
{"text": "It’s still so weird to me hearing about people who love Overwatch but never played OW1", "label": 0}
{"text": "They/them of the match", "label": 0}
{"text": "Ball and whoever because Ball", "label": 0}
{"text": "5v5 is why I stopped playing tank.", "label": 0}
{"text": "Hard to tell from stats alone. If your teammates get rein charged, junk combo or cree flash and double tapped, no amount of healing is gonna save them.", "label": 0}
{"text": "if you're north american. the rest of the world calls it football", "label": 0}
{"text": "I'd play tank again in 6v6. I stopped playing tank in 5v5 cause I didn't like the pressure and stress.", "label": 0}
{"text": "From my experience in Mystery Heroes, Hog and Orisa are the meanest combo.", "label": 0}
{"text": "Very helpful. Thanks for your contribution. 👍", "label": 0}
{"text": "The favorite role will always be the longest wait", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah just had this conversation yesterday and Ana is def the answer, isn't even in my 10 most played heroes but would almost not even mind the excuse to change that", "label": 0}
{"text": "And the more people spend on skins the more motivated, the game companies are to invest in skins versus actual games.\n\nI had no idea how how good we had it back in 2010 when an absolute banger came out every couple of months vs now we go years", "label": 0}
{"text": "“First person tower defense” is basically exactly what overwatch is and should be. It’s a first person MOBA. It’s not call of duty. Grow up.", "label": 0}
{"text": "Not if it kills dps queue times", "label": 0}
{"text": "Lifeweavers mobility heals him", "label": 0}
{"text": "Right. I’m dumb and didn’t think of that", "label": 0}
{"text": "and this is exactly why they removed free loot boxes, thanks......", "label": 0}
{"text": "Imagine thinking the crap you waste your money on is better than the crap someone else wastes their money on", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines).  A word or phrase in your title has triggered an automatic removal.  This could either poor language, or a misleading/meme title.  Please resubmit with a clear and appropriate title that accuratly describes your submission.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Honestly as a genji player, I find that I HAVE to dive into rat or else he comes for ME while I'm attacking a support (who btw is likely hard to kill themselves, IE bap Kiri etc) \n\n\nRat does a lot of dmg and gets very cheeky kills he's essentially a high priority target you never want to ignore like reap and bastion", "label": 0}
{"text": "What is wrong with people making this \"raid boss\" argument so often. \"Oh no I don't like being a powerful boss character. Oh no people look at me and try to kill me because I'm big\". Yeah so what. You're tank. Weirdos.", "label": 0}
{"text": "You know riot themself have admitted that league playuer counts are actively declining? Like this isn't some hidden conspiracy? It's well known?", "label": 0}
{"text": "I can only imagine the pain. I’m mostly a dps/supp player so it will be hell for me indeed.", "label": 0}
{"text": "🧐", "label": 0}
{"text": "if our tank leaves or just doing their own thing I will literally roleplay as our team's tank.", "label": 0}
{"text": ">It’s a first person MOBA\n\nThat's a misconception and even the dev team disagrees. Overwatch is what you call a \"hero shooter\". Classic fps mechanics but with a hero power fantasy twist. That's the reason I enjoy it so much, having really unique kits but in the confines of a fps setting.", "label": 0}
{"text": "If we’re including ults, then Juno’s heals too", "label": 0}
{"text": "That's not even countering, that's just flat out common sense. How are you gonna hit a flying bird with a baseball bat?", "label": 0}
{"text": "DOOM. AND. WRECKING BALL.", "label": 0}
{"text": "I don't want to play \"shield shooting simualtor\", that's why I quit originally.", "label": 0}
{"text": "Hm, what would even counter Hog Mauga? Ana can only do so much against just 1 of them and Kiri can just susu the 2 of them. Dva will likely have reduced DM time, Hog could just delete any of the shield heroes. Maybe the dps going Junkrat and Pharah would be the best bet?", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines), as it does not reach a minimum length.  Please resubmit with a clear and appropriate title.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Nah that is sombra G", "label": 0}
{"text": "Yeah Vanguard was the last straw for me. It served mostly as excuse to quit after a decade of playing, but being forced to install vanguard annoyed me too much.", "label": 0}
{"text": "unless you use a vpn, im not sure", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Depends, I mostly get stuck as support, so I play support a lot, but it's not my favorite class, just what I get stuck as. In support, there are 3 characters I'm really good with, moria, Lucio, and lifeweaver. Moria is probably my best all around because of heals and damage, but I have the least amount of fun as her. Lucio is probably the most character I have with because of his speed and wall skating. But I lack a little in the heals because none of my teams ever stay close enough together to heal multiple of them at once, which an aura heal I should be doing. And lifeweaver has a bit of a balance between getting high heal numbers and using air dashes and platforms to stay alive in fights, which I find fun. But because I'm always so busy healing my team, I rarely get to help out with dps. Overall, I'd go with lifeweaver since it would be the most fun and balanced enough to make me useful.\n\nTank is probably my worst class, but the one I get stuck in the second most. There it's easy. I'm really only consistently good with 2 characters, muaga and Ram. And I would probably stick with Ram since he's versatile, and I think he's more fun to play.\n\nLast is dps, I have the most fun being dps, but I almost never, I do mean never get to be dps, and most of the time when I do I'm getting backfilled into a team that is getting stomped on and a dps quit and the game is almost over sometime before I even to pick a character. But there are 2 big options for me there. One is torn, I whoop some ass with torn I get to back somewhere place a turrent and provide additional fire while repairing the current and just rack up damage and / or kills. But this isn't always the most fun gameplay. The second is echo. And I don't give a damn about her ultimate being able to be other heroes. I use it and all, but the end of the it's her beam, sticky cluster missles, and flight that make her so much fun for me. I love popping up into the air and raining down hell on an enemy before closing in close to the ground and finishing them with a well place beam blast. And as long as there isn't a really good sniper on their team I can stay in the air for a long enough time that by time I hit the ground I can immediately blast back up and escape to heal up reload or whatever else I wanna do. So echo would definitely be my choice there.\n\nAnd out of the three from each class echo would still be my favorite most fun to play as, so even though I get to use her the very least of my favs she's probably be who I take as my permanent character.", "label": 0}
{"text": "Mercy, she’s the first character I ever mained and I still love playing her even after 500 hours of playtime on just her\n\nGuardian Angel make me happy\nResurrect make me happier\nUsing Valkyrie to creative mode flight my way towards the nearest Widow makes me the happiest", "label": 0}
{"text": "Stop it.", "label": 0}
{"text": "It's like the other guy says he's essentially \"kinda smart\" because even in that interaction, he's wrong.\n\nSigma is referencing MENO'S paradox, with joke being junkrat is an idiot. \n\nZeno's paradox is kinda funny for junkrat to know about here though because its concept is basically \"motion is an illusion/doesn't exist\"", "label": 0}
{"text": "Still not enjoyable if you have another tank harassing you constantly and making target priority more difficult. I can't imagine Sojourn working well with two tanks. \n\nLike I said in my original post, I foresee the comeback of the classic ow1 clusterfuck. Fun for some but frustrating for people who want to take the game seriously.", "label": 0}
{"text": "I wanna play Rein and Dva combo, but I feed a bit much on Rein. I charge everything off cooldown.", "label": 0}
{"text": "[Get some help.](https://youtu.be/l60MnDJklnM?si=kfkslgq-Po7PMFLW)", "label": 0}
{"text": "Echo because I have 200 more hours in her than my second most used, Mei (total of 30 hours on her)", "label": 0}
{"text": "And it will unless 6v6 will take open q format (then everyone will flock to the dps, but the team with more tanks will win).\n\n6v6 is going to be awful, every role in tits own terms. Tanks will uave to suffer Hog otp duo, DPS will be glorified fifth wheel, while supports are going to he relegated into healbots.", "label": 0}
{"text": "The orb worked great - first she’d pull in people towards it, then hog would hook them for an easy kill. A nice one-two pick for the cost of 2 cooldowns.", "label": 0}
{"text": "You're joking.. Please tell me you're joking.", "label": 0}
{"text": "At least you're not spending on OF", "label": 0}
{"text": "valorant more popular than LOL? i dont think so", "label": 0}
{"text": "If you’re actually being serious then you’re insane lol.", "label": 0}
{"text": "Zarya and orisa\n\nGraviton surge and terra surge\n\nThrow in a good heals or emp", "label": 0}
{"text": "Yeah but keep telling us how Overwatch 2 was \"a waste of time that ruined the game\" or whatever.", "label": 0}
{"text": "Blah blah blah blah blah blah consumerism bad blah blah blah. This was over the span of a year. I buy the ultimate battle pass bundle every season and then a skin I like every now and then. There are people much worse than me I promise u", "label": 0}
{"text": "Doom and monkey widows and Ana’s aren’t same soon", "label": 0}
{"text": "Expected is your team being favored MMR wise over the other team so you get slightly penalized for having a better team on paper.\n\nWinning trend is basically win streak bonus for winning a certain amount of games over a 20 game span.\n\nYou still gained 20% what's the issue?", "label": 0}
{"text": "I plan to lower my spending. Ive have an issue of impulse buying things and spending money just because I have some.", "label": 0}
{"text": "and all that trouble for the 5% of the player base who main tank. I think Blizzard is smart enough to know that this 6v6 experiment is going nowhere so they want to quickly get it out the way and explain to the community, with data gathered from the tests, that it doesn't work and the game becomes less enjoyable overall.", "label": 0}
{"text": "I play Reinhardt and I am the groups tank. Whenever we play open queue one of my friends plays either Dva, Zarya, or Hog. Out of all of them. I honestly prefer a Dva as Reinhardt, I have no clue if it is synergy between us or if Reinhardt and Dva are a good duo", "label": 0}
{"text": "Playing open queue I really like Sigma/Rein. Sigma kinda sits back protects his team and Rein pushes the front.\n\nDva/Zarya is fun bc you can keep Dva up during an over committed dive.\n\nOrisa/Mauga because OPRESSIVE FIRE.\n\nRein/Orisa is a. Fucking. Wall.", "label": 0}
{"text": "youre giving people to much benefit of a doubt, chances are,theyre just horrible keybinds", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Why.", "label": 0}
{"text": "\n**Your post has been removed *automatically* for the following reason:**\n\nAll posts submitted by accounts under a minimum **comment karma** amount are removed. Please contribute to Reddit and this subreddit via comments and discussion first before posting submissions.\n \n## How much karma do I need to post?\nThe amount required is very low. We don't disclose the exact amount, but commenting and sharing around Reddit will help.\n\n## Can you approve my post? I'm not a spammer.\nThis rule is a necessary spam tool to help the mod team.  We ask each new submitter to gain the karma required before submitting, regardless of content.\n\n## How do I know when I've gained enough karma?\nWhen the bot stops removing your posts, you'll know that you've met our requirements.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Expected and Winning Trend are independent modifiers.\n\nIn theory you can have up to 5 modifiers simultaneously :\n1. Victory/Defeat/Draw\n2. Expected/Consolation/Uphill Battle/Reversal\n3. Wide\n4. Calibration\n5. Winning Trend / Losing Trend\n\nEach modifier adds/subtracts a small amount, so Winning Trend might have been +3% and Expected might have been -3% resulting in a net zero difference from a standard 20% match.", "label": 0}
{"text": "You be Sigma, I'll be Rein. They will behold THE BARRIER", "label": 0}
{"text": "If I enjoy playing a game then I’ll put some money into it instead of buying other games. I don’t really like most of the games coming out right now so I feel justified in spending my extra money in overwatch. And I like skins.", "label": 0}
{"text": "Yeah I don't play it myself but I saw a surge of hype around it lately, and also former OW players turning to it", "label": 0}
{"text": "when the enemy team has a flying character and you have 0 hit scan “tHeiR mOVemENt iS CRaZy!!!”", "label": 0}
{"text": "Probably lost due to bad placement. Numbers really don’t mean much.", "label": 0}
{"text": "I was also going to say that your continuous weak ad hominum attacks and circular logic are making this worth stopping.  \n\nYou start your argument positing that using the word \"toxic\" is stifling critical thinking, debate, nuance, and how dumbed down language is, so I offer some fully logical arguments, then you downvote, cry, attack, and prove just how illogical you are while calling me stupid.\n\nYou said:\n\n>And that everyone has the capacity to be rude on the internet from time to time and most of the people who are rude on the internet from time to time are perfectly normal and pleasant people.\n\nI replied with more nuance, and also added that of course there are normal, balanced people (as you said) who just have bad days and display:\n\n>uncommon rudeness\n\nThen you immediately jump to the weakest ad hominem \"ur stupid for saying that\" argument again, and try to claim the high ground to run away.\n\nNotice that I didn't put you down once...  I'm sure you're a smart, highly educated and balanced individual, who unfortunately has no logical counterpoints, and are obviously angry.  I'm sure you're just having a bad day, wanted to rant without anyone challenging you, and now I hope you have a better one.\n\nSo, yes, we're both done.  Have a great weekend.", "label": 0}
{"text": "Let us take a small excerpt from Moira “what are you on about? You’re a chancer.”", "label": 0}
{"text": "\"stupidly high dps\" less than bap, ashe, soldier, echo, tracer, sombra etc etc etc. \n\nHe has good dps by all means but, the zen just has to be better than the dps especially with his hitbox.", "label": 0}
{"text": "I honestly wish the barriers worked more like a form of damage reduction versus a flat out damage denial. Like imagine a reverse bap shield, where damage coming through is reduced instead of amplified.\n\nI don't even want much, something like 95% of the damage being tanked by the barrier and the remaining 5% going through and damaging anyone hit.", "label": 0}
{"text": "You got lootboxes by playing the game. You also got coins for playing the game to buy skins individually anyway", "label": 0}
{"text": "So just to be clear: the words and phrases listed in the post are either what was specifically reported by a player AND what the blizzard employee picked up and decided to include in the list? I just don’t see the point in including “moria” in the list if a human has agency in putting together such a list", "label": 0}
{"text": "If he’s spending on OW, he’s definitely spending on OF after the games", "label": 0}
{"text": "It’s qp does it really matter", "label": 0}
{"text": "As newbie D.va ot… I hate realizing the character is viewed in the menace category (how I felt about Sombra before). Though I’m probably not deadly enough to cause that level of frustration to opponents. I try to lay off if I feel like I’m repeat killing one DPS in a match (usually just seems their positioning is off/staggered)", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "sure but I'm not about to come down definitively on either side", "label": 0}
{"text": "i think they are already oiled up at this point.", "label": 0}
{"text": "Noobs…everyone knows king rein / queen zarya  always wins.", "label": 0}
{"text": "I guess skins give pleasure as well 😮‍💨", "label": 0}
{"text": "Lmao it's possible", "label": 0}
{"text": "$400 is an absurd amount of money to spend on a single game", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nIn accordance with our [Quality Guidelines](https://www.reddit.com/r/Overwatch/wiki/rules#wiki_discussion_threads_.28self.2Ftext_posts.29), we currently do not allow the submission of posts with no or minimal text description. Please resubmit your post with additional context. If you have a quick or simple question about the game, please see our [latest **Quick Questions** post](https://www.reddit.com/r/Overwatch/search?q=quick+questions+author%3Aautomoderator&t=week&sort=relevance&restrict_sr=on).    **Attempts to bypass the character requirement via inserting nonsensical text will possibly result in action against your account.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Tennis?", "label": 0}
{"text": "It's tough on a controller for sure, an elite controller helps with buttons on the back but it can still be touch to coordinate it right.", "label": 0}
{"text": "I mean bleed is really just burn with lifesteal.", "label": 0}
{"text": "I feel like the grass is always greener, haha. I've tried it and it really doesn't compare. I feel like people who want slightly more individual impact will like valorant better, probably.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "The pic makes Rein and Sigma look like Russian Mafia", "label": 0}
{"text": "so.... problem solved? what's the issue? lmao", "label": 0}
{"text": "Yes. This is what will make me uninstall.", "label": 0}
{"text": "Hey thats me, the widow, the better one.   \nIf anyone rewatches the replay, this orisa, was basically shooting/moving to avoid the AFK Kick. Round one ended with 31-3.   \nRound 4 ended, 34-3.   \nAbsolutely humiliating gameplay from this tank.", "label": 0}
{"text": "You can’t climb as LW, you rely on the other 4 members of your team being better than the other team and making all the plays to win. Zero carry potential yourself. You may be able to maintain a 50/50 WL ratio, but you won’t climb.", "label": 0}
{"text": "Nah its because your using chat.  \n\nI stopped using chat,  have spent the last 100 or so hours of my matchtime just hanging out in qp being a solo queue troll.    \n\nI mean I've played 100+ matches as mercy with zero healing done., some of them even doing better than the damage on my team..\n\nI'm literally pushing the envelope Trying to get pushed for something that isn't chat or cheating..   on an account that has had multiple month long suspensions,    and I literally haven't seen a warning since I've started playing like this.\n\nIt's insane, considering if I started throwing a few slurs out on chat each match, I'd be gone pretty damn quick.", "label": 0}
{"text": "When they removed lootboxes I had enough coins to buy any skins I wanted without opening lootboxes. Overwatch loot boxes were the most customer friendly of these.", "label": 0}
{"text": "We are in HARMONY!", "label": 0}
{"text": "Ok but real talk, Mauga probably won’t be nearly as cancerous in 6v6. Cardiac will probably be used more as a buff to your main tank than as a self-indulgence.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "You say that but would that really help in this situation? It would help them a little bit but not all that much.", "label": 0}
{"text": "Not everyone played the game to earn enough to get what they wanted, especially if they wanted everything.  Buying Loot Boxes was the only other option, and that was literally gambling.\n\nThey needed to implement a system that allowed people to earn loot boxes while also allowing people to buy cosmetics individually.", "label": 0}
{"text": "Because Overwatch is no longer a game.", "label": 0}
{"text": "I’m kinda hoping for a water-based hero with a reverse window as a shield. Also having an arching beam would be interesting.", "label": 0}
{"text": "I was thinking about how he can kick the cake out of me with his melee when I try and get him with Rein but you meant his ult", "label": 0}
{"text": "I just tried and am also receiving the same message as you.  Hopefully just a glitch that gets fixed", "label": 0}
{"text": "They’d be able to get on the platform and just burn her down? What are you saying that it’d only help a little bit?", "label": 0}
{"text": "Well you technically got one with the dva", "label": 0}
{"text": "Mei should’ve done better but c’mon it’s just a Junkrat, you can’t expect him to think of that", "label": 0}
{"text": "33 dollars a month on a game you love to play is not absurd...", "label": 0}
{"text": "That’s not at all why, let’s be real. They want as few people playing 6v6 over 5v5 during these tests to say “hey! The community doesn’t want it! 5v5 is staying and all tank players should off themselves now :D”", "label": 0}
{"text": "Well, they can go fuck off then lol.", "label": 0}
{"text": "Nope, America is not the world", "label": 0}
{"text": "Spamming like voicelines or a certain word or phrase in chat?", "label": 0}
{"text": "LOL so true, part of the reason I switched to OW. The “loot for 10min get stomped by a 3 stack” loop got old, at least when I’m getting stomped in OW I get to shoot my gun for more than one clip.", "label": 0}
{"text": "Goddamn Biggie Smalls ruining the game for everyone", "label": 0}
{"text": "Ball and sigma, cuz stigma has more balls", "label": 0}
{"text": "You can justify anything but spending $400 for essentially no return is a sign of mental illness and low impulse control", "label": 0}
{"text": "You get currency for playing the game still", "label": 0}
{"text": "I mainly play QP cuz I play with friends on crossplay and every time the competition on QP is worse than comp which doesn’t make much sense to me. And I don’t wanna play comp all the time, so once in a while I play QP so it can be more laid back but it’s always terrible now", "label": 0}
{"text": "There's an excess of weak/bad players  relitive to the number strong/good ones in the qp player pool.", "label": 0}
{"text": "worst part frfr", "label": 0}
{"text": "Is it her movement that causes a problem or the lack of people being able to hit a moving target?", "label": 0}
{"text": "People in this sub have really convinced themselves that Blizzard might have stuck to the \"your $40 from 2017 gets you everything forever\" monetization model, huh?", "label": 0}
{"text": "Voice lines", "label": 0}
{"text": "That only happens if you type GGEZ", "label": 0}
{"text": "I play tank, I hate life, unrelated?", "label": 0}
{"text": "low plat", "label": 0}
{"text": "Yes", "label": 0}
{"text": "That explains why I’m still pressing the reload button when I play orisa", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Literally everyone does.  You are on a win streak.  You played a team you were supposed to beat.   It's been like this for awhile now and is actually pretty fair.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "If I made a post every time someone talked shit to me in chat, I’d be banned.", "label": 0}
{"text": "Reinhardt. It’s nice to have the ability to be a team savior, along with the ability to secure picks. He’ll never be nerfed to nothing and I think will always be kinda strong. Rein my love", "label": 0}
{"text": "Some people choose to take it seriously. Some people literally throw \"because it's Quickplay lol.\"\n\nThat's what causes the pubstomps.", "label": 0}
{"text": "Cus its F2P. Every F2P gets an increase in playercount, the problem/the thing to think about is, are those all truly unique player? Multiaccounting was widespread even before it got f2p and now witht he harsher ban politic...", "label": 0}
{"text": "Players *are* matched by their skill level, it's just looser.\n\nI used to get a lot of well balanced games in QP and I don't think I've had one in the past two seasons, so I kinda understand what they mean.", "label": 0}
{"text": "Meh as long as you have some sense of control it’s not that big of deal.\n\nIt’s like people will say that you could have bought a bunch of games. And they’d all be backlogged and you’d probably never play them and so not that great a purchase. \n\nSaying you spend less than $40 a month on a hobby you enjoy doesn’t sound bad in a general sense though.", "label": 0}
{"text": "The fact your in a group is a major factor..\n\nI spend 90% of my time in solo queue qp..  \n\nThe most uneven matches I see typically involves players playing in larger groups..\n\nNothing makes me expect a dumpster fire match more than seeing 3 crossplay icons on my team as a pc player...  \n\nSometimes it's a stomp,   typically its get stomped..", "label": 0}
{"text": "I love playing tank", "label": 0}
{"text": "Nah think about how annoying they both are zipping around yappin about marathons", "label": 0}
{"text": "Thank you for bringing up zecora", "label": 0}
{"text": "not really forced. if it's in the assemble phase, you can just leave the match.. \n\nunless you're backfilling.. and yeah.. it's forced.", "label": 0}
{"text": "I disagree a lot on the \"tough on a controller\"\n\nhard disagree", "label": 0}
{"text": "I thought that was Moira for a second", "label": 0}
{"text": "Let’s not pretend the racism towards black people in overwatch isn’t way more prevalent than toward black people… half the people who play overwatch are weebs and otherwise and wouldn’t dare.", "label": 0}
{"text": "crazy how strong R6S is still going", "label": 0}
{"text": "Perhaps I just have a hard time coordinating my fingers", "label": 0}
{"text": "I think you misunderstood what ningnings was trying to say", "label": 0}
{"text": "I take more enjoyment in playing the troll in them..\n\n\"You need to heal mercy\"    \n\nI don't reply,  but laugh and think to myself \"no you need to find a 5th friend\"", "label": 0}
{"text": "What lore drip feed does to a mfer", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Im ususally aggressive more than i should be playing so i roleplay as a fuckin problem.", "label": 0}
{"text": "I'M ON FIRE! 🔥🔥🔥🔥🔥 WHAT ELSE IS NEW???? HAHA!!!🗣️", "label": 0}
{"text": "Sympathetic should not count as it requires an ally", "label": 0}
{"text": "real as fuck", "label": 0}
{"text": "It’s unfortunate because while it hasn’t been my main game for a long while I still think it’s a really good game at its core. With all the news though it’s hard to want to go back even just for a visit.", "label": 0}
{"text": "🐦🐦🐦", "label": 0}
{"text": "Fuck venture", "label": 0}
{"text": "Then they will complain why there's no heals with 1 healer", "label": 0}
{"text": "I understand the point you’re making but a more productive way to say this would be, “Why does it feel like when people make racist remarks toward Asian people it’s taken less seriously?”\n\nWhat’s the purpose of including the racist remarks levelled at black people in some odd juxtaposition?\n\nSwear to god, we catch strays even when the racism isn’t even about us. Crazy.", "label": 0}
{"text": "I mean it could just have the same visuals as a window, maybe with slight variations", "label": 0}
{"text": "It’s a light for when you walk through the defenders spawn in Blizzard World. Too scary in the dark :(", "label": 0}
{"text": "Now I'm glad I stopped playing right before she came out", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "stop putting me in lagged russian servers ffs. I don't want to play with +20-30 ping, just let me play in regular european ones - i dont mind waiting longer", "label": 0}
{"text": "I'm a Winston main. When playing 6v6 adjustments community custom games, I've had the most fun with Balls (pun intended?) as my partners in crime.", "label": 0}
{"text": "Reinhardt, always has, always will be", "label": 0}
{"text": "The last time I saw a real bot in comp was like 2 years ago and it was a reinhart just walking and swinging in random directions. Was obviously a computer.", "label": 0}
{"text": "Thanks Shaxx.", "label": 0}
{"text": "Playing tracer and your orisa gets a fat halt into a pulse bomb were the dream moments. Same with a nano blade and you kill half the team in two swipes. The days where combos were endless", "label": 0}
{"text": "Add Zen and you guys will definitely be ballin fr", "label": 0}
{"text": "9 - 11?? Coincidence??", "label": 0}
{"text": "Saying an objective generalization and claiming it to be the truth is a really good example of ignorance..", "label": 0}
{"text": "My guy, I didn’t say you were wrong, go reread. What I did say’s the way you’re choosing to communicate this (very understandable frustration) by roping in your perception of the reception of racist remarks targeted at black people by comparing it to Asian people’s treatment doesn’t helping anything.\n\nRacism as experienced by Asian people has its own merit, by virtue of it being just as awful and can stand on its own without your unprompted juxtaposition.", "label": 0}
{"text": "Did Rein make it though?", "label": 0}
{"text": "Bobby Singer, is that you?", "label": 0}
{"text": "You're right, I've played myself.", "label": 0}
{"text": "Bruh, where your hitscan at?", "label": 0}
{"text": "Because “game” offended a certain demographic or some dumb shit like that", "label": 0}
{"text": "It is still POTG in COMP.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Your fingers were rigged from the start 🤌🔫", "label": 0}
{"text": "I’m confused, am I just gullible or is everyone actually angry with a change of words that mean the same thing", "label": 0}
{"text": "Wait til you meet 100 charge Zarya during Halloween lol", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nThe title of your submission is prohibited under our [Titling Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_2._title_guidelines), as it does not reach a minimum length.  Please resubmit with a clear and appropriate title.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "This won't fix anything the problems with this game started before the switch to 5v5 and going back to 6v6 will bring back hellish unbalance that everyone forgot about.", "label": 0}
{"text": "\"Who are on the lobby\" I meant the ranks and mmr, and it doesn't really care how the match went, the \"expected\" and \"up-hill battle\" is about the matchmaking predicting who is gonna  win;  one team has more mmr, then is the one expected  to win, if the gap is big enough, the favored team gets less points by winning  and lose more.", "label": 0}
{"text": "As a tank main, I sincerely thank and congratulate and hype up all support mains in my lobbies who stop trying to DPS and and focus more on HEALING 🙌❤️", "label": 0}
{"text": "Yeah it's really zarn odd", "label": 0}
{"text": "Everyone knows yellow orb is the one that simply charges your ult.", "label": 0}
{"text": "PLEASE give Junkrat a Grilled Cheese skin! (He's the pony voiced by Weird Al)", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "THE BEACONS ARE LIT! WINSTON CALLS FOR AID!\n\n\n\nAnd off-tanks will answer!", "label": 0}
{"text": "Plz ? Is this too much to ask for", "label": 0}
{"text": "When there are crossplay icons in my team it usually means its 3x switch player on handheld", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "It must likely appears you used a different battlenet account.\n\nUse the battlenet website / app and go on https://account.battle.net/transactions, it should show all your purchases like battlepass, skins, voice lines etc\n\nIf it shows none, it's a new battlenet account.", "label": 0}
{"text": "Me and my friend could play nearly every duo under the sun, it’ll be fun to relive that again in 2-2-2. \n\nHe prefers Ball dive so I can enable him, or he can enable me if I’m on Winston with Zarya or D.Va. With brawl either of us can work as the main tank, and with poke he can enable my Sigma play", "label": 0}
{"text": "Its just sad when in the enemy team are the sweatlords and in his own team people who throw. If it would be equal it would be no problem", "label": 0}
{"text": "\"Puta\" means \"whore\" in spanish, but dunno if they speak spanish", "label": 0}
{"text": "Sounds like you've no idea what you're talking about since I bought it right when OW1 came out. I just don't blindly suck the 6v6 nipple that you do.", "label": 0}
{"text": "I’m communicating it the way it is to show the obvious contrast between the two. It’s literally that simple.", "label": 0}
{"text": "Hog and Zarya. \n\nWhole hogging into a grav is like crack.", "label": 0}
{"text": "For the past few days any time I try to play a blizzard game it's been laggy af both in Diablo and Ow it's getting really annoying", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Did you buy a bundle with credits that had a discount because you already had parts of the bundle? Not sure if I've seen bundles you can buy with credits but that's usually how it happens with coins.", "label": 0}
{"text": "Potato", "label": 0}
{"text": "No it will not lol.", "label": 0}
{"text": "Wait until they hear zen is just a DPS with passive healing", "label": 0}
{"text": "I see this is a moot point for you. Fair enough I suppose but Intersectionality’s a thing friend.\n\nWishing you all the best in working on deconstructing that internalised racism.", "label": 0}
{"text": "That’s great and all but I’m still going to say “gg no heals”", "label": 0}
{"text": "Yeah, sometimes I question my choices, but at least if I tank, I can't complain about my teams tank (or can I?)", "label": 0}
{"text": "Nah.....Thats what custom games are for.\n\nYou should play your best in QP and try to win.\n\nIf you dont,you bring bad habits over to ranked.\n\nThus making you a liability to any team you're on because of the stupid,bad habits you picked up in QP", "label": 0}
{"text": "I just don't fucking get why blizzard can't let pc plays \"opt out\" of being matched into crossplay lobbys..\n\nI'd take the longer queue times any day...", "label": 0}
{"text": "It's an honor", "label": 0}
{"text": "One tip I can give is you need to being very quick on how you react with your grips and your flower petals. Know when to pull and not to (ex. don’t pull your mauga when he’s low and has his overdrive ready, their going to be pissed lol)  Petal can completely counter ults like Zarya and Orisa and is a great escape utility with dash. \n\nAlso watch out for flankers, it’s definitely a lifeweaver job to watch his back line and grip teammates that are getting dived. Be fast with your decision making on who needs to be saved first and who can save themselves. You only have one grip and it’s a long cool down too so use it wisely.", "label": 0}
{"text": "lol no, just no.", "label": 0}
{"text": "This list is wrong. CS2 has 641,969 players right now on steam and is #1. How does this list make any sense? \n\nOverwatch isn't even in the top 25...", "label": 0}
{"text": "They might not honestly be that strong anymore especially since ram Mauga could low-key put in work vs them, ram does more barrier damage and can pressure both of them and maugas cardiac can give them a lot of space to play and let ramattra actually punch more and both ults can go together really well since you can use annihilation and punch everyone trapped in the cage plus holding people down with vortex to let mauga eat them will be pretty strong too this can be said for several new tank combos with tanks that rein zar might not be the best anymore", "label": 0}
{"text": "This list is wrong. CS2 has 641,969 players right now on steam and is #1. How does this list make any sense?\n\nOverwatch isn't even in the top 25...", "label": 0}
{"text": "I like and dislike stuff about both. I think as a Ball main, I generally prefer 6v6 of Overwatch 1, but the game is so different now that it’s hard to compare. ", "label": 0}
{"text": "Preventing what exactly?", "label": 0}
{"text": "This list is wrong. CS2 has 641,969 players right now on steam and is #1. How does this list make any sense?\n\nOverwatch isn't even in the top 25...", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "This says PC and consoles. Not just steam.", "label": 0}
{"text": "This list is wrong. CS2 has 641,969 players right now on steam and is #1. How does this list make any sense?\n\nOverwatch isn't even in the top 25...", "label": 0}
{"text": "Yes ....Yes\n\nIf you cant do well in QP you sure as hell wont do better in ranked", "label": 0}
{"text": "Gotta have something to spank to, right?", "label": 0}
{"text": "This list is wrong. CS2 has 641,969 players right now on steam and is #1. How does this list make any sense?\n\nOverwatch isn't even in the top 25...", "label": 0}
{"text": "Does it still happen when you hard-wire your PC to your router?", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nDue to current issues with spam and low-value content, we are temporarily removing image posts without a minimal description.  Please resubmit with a quality description.\n\nPlease read our [Quality Guidelines](https://www.reddit.com/r/overwatch/wiki/rules#wiki_3._quality_guidelines) to ensure your post is not prohibited under additional rules, including, but not limited to:\n\n* Phone-recorded images\n* Vertical/Portrait images\n* Low-Quality memes\n\n---\n\nAdditionally, please verify that your post is not a known issue in our [Common Bugs and Posts FAQ](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts).\n\nIf you are submitting fan content, please either use the descritpion to credit the original artist, or resubmit your post as a link post directly to the artist's portfolio.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Rein zar peak", "label": 0}
{"text": "Awesome!", "label": 0}
{"text": "So annoying when that tempting Ana or Dva swaps right before you have your ult ready. I’m left peaking over the roof: “Lessee, we got Doom, Rat, Genji, Bap, and Lucio… I guess I’m playing defensively until the Tank needs some help and I get to ult and throw immortality field + regen burst, and accomplish fuck all else because I’m terrible at Bap.”\n\n\nNot bad value, but I really enjoy Ana Anti-nade Airstrikes or a like a Ram/Dva Echo Surprise on the point with 5 health bars.", "label": 0}
{"text": "I'd say I would trust players to make a normal comp and want to win. But my experience with pre-role queue showed me that that just doesn't happen. Too many players are selfish and just want to play the hero that they want to play. I had countless triple and quadruple dps team comps where we lost to normal 2-2-2 comps. If there's a chance to have 3 dps in a team comp, it's just gonna happen all the time because it's the most popular role. Maybe less so in Competitive, but probably not that much less.", "label": 0}
{"text": "1 premium credit bastion skin + early ow2 challenge would give 20 premium credits. My account looks similar.", "label": 0}
{"text": "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "DOOMBALL", "label": 0}
{"text": "Worst part of it was, that was the least awful option. It was that, invade, which would drag the war on for much longer and lead to way more casualties-in anticipation of an invasion, the US manufactured so many Purple Hearts, we haven’t needed to manufacture another since-or let the Soviets invade, which has the same problem, as well as that of giving Japan over to Stalin after the war.", "label": 0}
{"text": "Rein mauga would be good for suppressive fire", "label": 0}
{"text": "Hog and ball torture is back baby", "label": 0}
{"text": "Ya I want ppl to quit the game too thats why I can't wait for the 6v6 nostalgia to remind all the old players and new players WHY its a bad idea", "label": 0}
{"text": "Yeah, same thing", "label": 0}
{"text": "Zarya and Rein weren't powerful because they were strong individually they were a powerful because they had synergy and covered each other well You're used to these new tanks in the 5 vs 5 version Where they are naturally the strongest individual character, but when we go 6 vs 6 they're going to be severely nerfed And have their survivability and damage Heavily reduced, Tanks will be just mortals again, Historically tanks whose only defense is some kind of body block They're not very good, I don't know if you've heard the expression \"ball and hog Torture\"", "label": 0}
{"text": "Wish I could see meis cooldown. She souldve ice walled up to u in this case", "label": 0}
{"text": "Queen/Zarya sounds so terrifying now that I think of it. If it is 3-man grav or more, Queen can axe then axe again 2 seconds later or even immediately.", "label": 0}
{"text": "In 6v6 a tank can lose a 1v1 against a dps, the classes where more even in terms of power", "label": 0}
{"text": "The junkrat just boosting her higher is what happens every time my team has a junkrat lol", "label": 0}
{"text": "Junos movement is pretty good but what did you expect with Rein, Brig and Junk? Only chance Junk might have had was to boop him self up there and hope to hit her point blank. No surprises.", "label": 0}
{"text": "It was the characters for me. I've been interested in the lore since day one but it's the characters that keep me invested in the game. I just see what Arcane has done for League and it makes me so sad that Overwatch will never have that.", "label": 0}
{"text": "I am not in possession of ginger bread bastion", "label": 0}
{"text": "Can I choose from each role?\n\nIf not, this is hard because I love a couple of heroes in different roles about equally. \n\nIf I seriously had to only choose, it'd be a toss-up between Juno or Widowmaker \n\nDva as tank if I get to choose all 3.", "label": 0}
{"text": "\nI’m pretty sure I didn’t play ow when that stuff was happening", "label": 0}
{"text": "**Your post has been removed *automatically* for the following reason:**\n\nIn accordance with our [Quality Guidelines](https://www.reddit.com/r/Overwatch/wiki/rules#wiki_discussion_threads_.28self.2Ftext_posts.29), we currently do not allow the submission of posts with no or minimal text description. Please resubmit your post with additional context. If you have a quick or simple question about the game, please see our [latest **Quick Questions** post](https://www.reddit.com/r/Overwatch/search?q=quick+questions+author%3Aautomoderator&t=week&sort=relevance&restrict_sr=on).    **Attempts to bypass the character requirement via inserting nonsensical text will possibly result in action against your account.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*", "label": 0}
{"text": "Hmmmm maybe", "label": 0}
{"text": "I still don't buy it. No shot overwatch has more console than PC players both combined more than CS2. \n\nSteam is like 50k peak a day and CS2 is over 600K. \n\nIt doesn't add up.", "label": 0}
{"text": "I got a few clips of the lag getting so bad I'm not pressing any Keyes and my characters still moving so I keep dying cuz my character physically won't do what I want so I'm just taking a break for a bit till that gets fixed", "label": 0}
{"text": "Junker Queen bc she’s soooo badass, Ik when I got on overwatch 2 she was for me. I love that she’s a dps but on the tank role. Her whole kit is sooo amazing!!", "label": 0}
{"text": "Orisa is even better.\n\nShe denies Hog completely.", "label": 0}
{"text": "^^^ just use bumper jumper losers been doing that since ‘17 with lucio", "label": 0}
{"text": "I only played OW2 but I did watch since OW1 so I'm saying Sig/Ram\n\nNot only because those are my 2 tank mains, but shields won't be the MAIN part of their use", "label": 0}
{"text": "Ram and Rein. Squishies beware", "label": 0}
{"text": "It's 8 players in a 10 player game with one skill. That's near impossible to get normally unless the whole lobby enjoys huddling up together and never seperate", "label": 0}
{"text": "Not as crazy as hog and ball torture", "label": 0}
{"text": "suzu also cleans which is the best parr", "label": 0}
