{"text": "i guess a 2060ti or even 3060 could work on this cpu...\n\nstill cpu bottleneck but he could go higher with reoslution at least and use dlss", "label": 0}
{"text": "I think questions like this are actually good to discuss with real people. There are so many sponsored content articles out there that just exist to shill a product. It is becoming increasingly hard to get a straight answer. That being said, there's probably previous reddit threads on this same question. But it's also nice to have your own discussion to make sure you have the answers you want.", "label": 0}
{"text": "pirate bay .com", "label": 0}
{"text": "DRM Software: Oh no! Your 8K TV is missing 1 pixel! Guess we'll need to play it in 480p Dual channel stereo \n\nSome Website: Enjoy the video in Max quality, full 7.1 surround, (p.s. click the boobie ad to support the website)", "label": 0}
{"text": "I mostly play offline so this would not affect me.", "label": 0}
{"text": "The thing is, that's 20 minutes and multiple steps that I shouldn't have to go through. I bought a Blu ray drive and a movie on blu Ray. I expected to pop in the disc and watch the movie. That's how dvds work on my old computer. I don't know why it doesn't work like that anymore, and I don't really care. It shouldn't be my problem. If I have to jump through *any* extra hoops, even simple ones, to consume the media I paid for, there's no point in paying for it.", "label": 0}
{"text": "Oooh, that makes perfect sense ngl", "label": 0}
{"text": "I have a graveyard of video cards. Never have the strenght to get rid of them.", "label": 0}
{"text": "Nope :(", "label": 0}
{"text": "Now that's some good info lol", "label": 0}
{"text": "Check that the cable has 4 pairs.", "label": 0}
{"text": "Oki, thanks for ur help", "label": 0}
{"text": "May be its time to cut drivers out of kernel? ", "label": 0}
{"text": "I will go way out of my way to avoid buying games with Denuvo, fuck that shit.  \nSince games no-longer release demos, I tend to Pirate>Play>Pay (if I like it and/or spend more than 5 hours on it, and ofc. it doesn't have Denuvo)", "label": 0}
{"text": "Whoever you talked to is pretty clueless. People who work with Linux in their job are probably doing some heavy IT stuff, which involves a completely different cognition than Linux for the consumer.\n\nThe vast majority of games work on Linux. Not many developers make native builds for Linux, so adapter software called Wine is used to make Windows games compatible with Linux. The Steam client has its own version of Wine integrated in a user-friendly way, called Proton. The vast majority of games run through it as well they do on Windows, sometimes better. The troubled area is competitive multiplayer games that use some form of invasive anti-cheat system. For those games, it will depend on the policy of the developer as to whether or not it will work on Linux. Overwatch 2, for instance, works great on Linux. All Blizzard games work well on Linux, and have for quite awhile. I just add BattleNet in Steam as a non-Steam game, set it to use Proton under its Steam properties, and it's good to go. However, I know Destiny 2, League of Legends, and Fortnite, are banned from Linux. If you're into those types of games, you'll have to make sure the ones you play are allowed on Linux. [ProtonDB.com](http://ProtonDB.com) is a good resource to check these things.\n\nAlso, keep in mind that the Steam Deck is fundamentally a handheld PC running Valve's own Linux distro, and its been very successful in gaming, so that should give you an idea.\n\nFor switching distros, it would just be a matter of installing a new one on top of the old one. You can set it up so that when you install a Linux distro, certain folders can be isolated on their own partition apart from the OS's partition, so when you install a new distro you can more easily migrate. Your *home* folder is where all the typical user stuff goes. I always like to set up the *home* folder on its own partition with most of the space for this reason, and leave the OS partition, simply */*, with 100GB. Again, keep some installation media for Windows and your preferred Linux distro always on hand, in case things go wrong or the bootloaders screw with each other.", "label": 0}
{"text": "You son of a bi... your like a detective", "label": 0}
{"text": "I always use Arctic MX6, and sometimes MX4 when 6 is unavailable", "label": 0}
{"text": "Yay, stagnation, how great !", "label": 0}
{"text": "It is weird, everyone knows you use the lowest number because that means it's cooler.", "label": 0}
{"text": "The more important question is why you pointed a camera at your monitor to record this.", "label": 0}
{"text": "I think there's some DRM plugin that requires Edge which let's you access the 4k streams.", "label": 0}
{"text": "Thats what i am thinking, also everyone lives in different climates and has their own experiences, which is helpful", "label": 0}
{"text": "https://www.reddit.com/r/pcmasterrace/s/v3EJuIBP7T", "label": 0}
{"text": "I made a mistake in the title it is a X670E not a B670E my mistake noticed that just now", "label": 0}
{"text": "So I don't know Celsius but I know it when my PC gets to hot like I know the range of what's bad just not how it equals F", "label": 0}
{"text": "Yes. Great GPU, excellent value, good CPU, awesome budget case. A really good deal.", "label": 0}
{"text": "But both are ok?", "label": 0}
{"text": "Usually denuvo cracks don't remove denuvo from the code, they bypass it but it's still running.", "label": 0}
{"text": "Turbo = going faster than stock. And these cpu can barely do stock", "label": 0}
{"text": "WOW", "label": 0}
{"text": "Well, actually depending on the case, you may not actually need standoff at all because some cases have them directly build in \n\nhttps://preview.redd.it/amyxfwmtrswd1.jpeg?width=1816&format=pjpg&auto=webp&s=a939bfa5a0959f4b29615675a46f67e54c36fbcf\n\nI'm guessing at some people before building that pc you saw a pc case with that type of standoff and assumed your case was the same, this would definitively qualify as an honest mistake, especially 25 years ago before the internet was widespread", "label": 0}
{"text": "I have Amazon Prime, but it's easier to just pirate all the shows. My HTPC is Windows 10, because it's older hardware and Microsoft is like fuck you.", "label": 0}
{"text": "You gave very little information, you should provide what you were doing when that happened, logs during that spike you can get from Event Viewer, etc", "label": 0}
{"text": "Yes, absolutely.   \nCheck this out:  \n[https://www.youtube.com/watch?v=RhaEOEGDb94](https://www.youtube.com/watch?v=RhaEOEGDb94)", "label": 0}
{"text": "The hard drive can be kept, and, it should also cause your new computer to get registered with your existing windows license so you don’t gotta get a new windows key either. \n\nyou can definitely keep the gpu as well, just don’t expect super great graphics or framerate with most modern games (unless they also have that fancy ai upscaling support, forget what it’s called.)\n\nHonestly the computer should still run most new games decently on low graphics settings, as long as it doesn’t require a 6 core cpu (I’m looking at you, Helldivers 2!) and aren’t expecting to get a particularly high frame rate.", "label": 0}
{"text": "I may have made this mistake.. I'm too scared to look.. But I mean.. It's been working.. It's been uh.. 2 years I think?", "label": 0}
{"text": "AMDs mobile naming scheme is awful.", "label": 0}
{"text": "Because denuvo don't want to. It's not going to improve performance, so denuvo have nothing to gain and everything to lose by doing it.", "label": 0}
{"text": "Ill use them then :)", "label": 0}
{"text": "it probably has audio passthrough in mobo but the brand decided not to include the 3.5mm audio jack.  my dell has one and it also comes up as audio output in Windows.", "label": 0}
{"text": "hmm, do you think it is safe to disable it, I'm probably going to do the same thing since I hate how my CPU fans would speed up randomly when I'm just idle watching movies", "label": 0}
{"text": "Tour Mouse is having a baby", "label": 0}
{"text": "Seriously. I've started buying gpus based on watts lol. Whatever runs 2077 fastest with ray tracing for under 250 watts", "label": 0}
{"text": "Denuvo does impact performance (and that's bad), but not as heavily as most people think.\n\nThe fact is, Steam overlay has a certain impact on CPU usage. Steam overlay is not running with a cracked copy. \n\nThat said, any noticeable decrease in performance due to antipiracy shouldn't be present at all, because it only hurts the honest people that paid for the game and every publisher that decides to use this \"anti-tamper\" deserves their games to be pirated. DRM is bad for so many reasons.", "label": 0}
{"text": "damn, this made me feel old.", "label": 0}
{"text": "PATA.", "label": 0}
{"text": "at this point, I think knowing about piracy leans more to \"digital literacy\" side of things that it does to \"shady knowledge\"", "label": 0}
{"text": "They improved upon them even though they were never even used before them and it took years for the competition to come up with their own solution to even compete with them.\n\n\nLet's also not address the elephant in the room that is AMD and their inability to even do real hardware ray tracing and not even able to do path tracing.", "label": 0}
{"text": "It’s calling mothership", "label": 0}
{"text": "beautiful.", "label": 0}
{"text": "I don't think the NZXT H6 Flow has support for zero cable / back connect.  Not seeing a mention of it on the [NZXT H6 Flow product page](https://nzxt.com/product/h6-flow).\n\nCases like [Phanteks XT View](https://phanteks.com/product/xt-view-black/), [Phanteks XT Pro](https://phanteks.com/product/xt-pro-black/), and [Phanteks XT Pro Ultra](https://phanteks.com/product/xt-pro-ultra-black) explicitly list:\n\n* Support for ASUS BTF mainboards.\n* Support for MSI Project Zero mainboards.\n\nA few other cases specifying back connect:\n\n* [MAG PANO 100R PZ](https://www.msi.com/PC-Case/MAG-PANO-100R-PZ) \\- lists MSI Project Zero but not ASUS BTF explicitly\n* [Corsair 6500D Airflow](https://www.corsair.com/us/en/p/pc-cases/cc-9011259-ww/6500d-airflow-mid-tower-dual-chamber-pc-case-black-cc-9011259-ww) \\- lists ASUS BTF, MSI PROJECT ZERO \n* [Thermaltake Ceres 330 TG ARGB](https://thermaltakeusa.com/products/ceres-330-tg-argb-mid-tower-chassis-ca-1y2-00m1wn-01) \\- lists ASUS and MSI Hidden-Connector motherboards\n* [CoolerMaster MasterBox 600](https://www.coolermaster.com/en-global/products/masterbox-600/) \\- states Back-connected motherboard support\n\nI think G.Skill Trident Z5 Royal will be a good choice both aesthetically and performance wise.", "label": 0}
{"text": "Which requires you to be logged in", "label": 0}
{"text": "Oh I meant a third party. Just someone who had the knowledge to test it.\nI didn't know that only denuvo could do it.", "label": 0}
{"text": "When a 12th gen i5 is better than a brand new top of the line cpu, we all know that this is going to be a rough year for Intel once again", "label": 0}
{"text": "Don't jinx yourself next thing you know a gremlin will sneak in and bend a pin lol", "label": 0}
{"text": "Because Amazon has sent me new motherboards in the past I open it up and find that it didn’t have a plastic socket and pins were bent and other more minor damages", "label": 0}
{"text": "They also didn't get my math joke. Oh well. Keep on keeping on dude.", "label": 0}
{"text": "u mean the dummies that buy nvidia lol", "label": 0}
{"text": "Just downloaded Utorrent again and am having unprotected Sex with PirateBay. 🥴", "label": 0}
{"text": "youre braindead", "label": 0}
{"text": "Warframe is an online game right?", "label": 0}
{"text": "https://preview.redd.it/9ajsl60ktswd1.jpeg?width=3000&format=pjpg&auto=webp&s=1fa24bded58fff521980b783de87ce746d8afc1b", "label": 0}
{"text": "That battle was fought like 20 years ago.\n\nThe alternative was 50 different launchers with 50 different patchers and 50 different friend lists\n\nSteam is our victory.  \n\nThat's why people praise GabeN, he's made a good product that kills the headache of owning multiple games.  He hasn't enshittified it and he hasn't sold it to Microsoft or Amazon.  \n\nIn addition, he's been working on breaking Microsoft's stranglehold on PC gaming.  \n\nThe Steam Deck runs Arch Linux.  Valve contributes A TON of development to WINE/Proton which lets Windows games run on Linux.  Also, Steam takes a smaller platform fee if a game developer adds Linux support.\n\nThe success of the Steam Deck has pushed many anticheat developers to include Linux support, which was often the only major barrier to Linux gaming.\n\nValve is hands down the most pro-consumer gaming company/developer in the Industry.", "label": 0}
{"text": "Right, acting like stab-il doesn't exist", "label": 0}
{"text": "One of us one of us!", "label": 0}
{"text": "Search for masgrave on reddit.", "label": 0}
{"text": "Pretty common with full harddrives. What sort of storage are you using and how full are you.", "label": 0}
{"text": "It's probably a good guess. \n\nOne of the reasons the 5800X3D did so well in gaming was that all of the cache and all of the cores are on a single component, it was effectively monolithic. The \"better\" chips are split between two parts and the communication slowed the  down.\n\nThe 285k is not a single monolithic chip, so I would bet that Intel, after shitting on AMD for years about not being monolithic are now eating their shoes trying to figure out how to make this work.", "label": 0}
{"text": "Thank you for this update. Initially, I thought this post was a joke.", "label": 0}
{"text": "I prefer native performance then red tape excuses. New games \"heavily\" use upscaling technologies because they trade for optimisation which is easier for them.\n\nThe only defining feature that I would consider using NVIDIA GPUs is the ray tracing and that still needs to be at a much higher performance metric to be viable.\n\nNothing else matters, if you are completely reliable on the upscaling technology then you have by far missed the point if you are able to afford it, It's used for those that can't.", "label": 0}
{"text": "Dang, yeston and gamemax in the US? First I've heard of it. Do they have warranty?", "label": 0}
{"text": "These companies spend more time making their DRM stronger and more broken, than they do making the service better for everyone.", "label": 0}
{"text": "Wow", "label": 0}
{"text": "Bro will be running an 80TB ZFS array and operating his own NAS by the end of next year", "label": 0}
{"text": "Well, you pulled off the cooler, so yes regardless.", "label": 0}
{"text": "I don't need the extra cores, and really can't justify having them, truth be told.  My 5700X is having some pretty serious issues keeping up with large, busy raid situations in WoW, and I've experienced some rather significant performance degradation in other recent \"higher-end\" releases.  I would like to future proof my system and would really like to stay away from a chip releasing next month at 6 or 700, which I imagine the 9800X3D would look like.  The bench numbers for the 7800X3D look GOOD, but the price hike seems a bit steep from MSRP.  Still doable, of course, and it's hard to imagine complaining about that price when the i9 I was looking at is only $30USD cheaper, and it would ultimately save me some money when purchasing a new motherboard.", "label": 0}
{"text": "Yea should work great that's normally my go to. For my last build I bought the mx6 and that's great too. You can also buy it with some alcohol wipes if you need to clean your CPU if you've not got any isopropyl.", "label": 0}
{"text": "That gets you an entire two weeks... And then it demands to be connected", "label": 0}
{"text": "Oh ill get a brand new CPU next month, do i still need to clean that", "label": 0}
{"text": "Not making things affordable is a service problem.", "label": 0}
{"text": "Yeah, and also make completely legitimate backups on my Plex server... 👀", "label": 0}
{"text": "I'd milk the am4. Pair the 5700x3d with Rx 7900 GRE or 7900XT. will be probably best bang for buck .", "label": 0}
{"text": "The \"If it works it ain't stupid\" solution.", "label": 0}
{"text": "I got xl2566k", "label": 0}
{"text": "Well they will then whine that no one is buying games", "label": 0}
{"text": "It's trying to make a black hole, but can only get it blue...", "label": 0}
{"text": "Carbon Monoxide?  Check!", "label": 0}
{"text": "We make over 24k a month in household and I pirate shit when it's not delivered to me correctly, it's most definitely a service issue.", "label": 0}
{"text": "Then couldn’t be better", "label": 0}
{"text": "Happened to my friend with the monitor he ordered, what is going on haha", "label": 0}
{"text": "We are now obligated to be brothers", "label": 0}
{"text": "I once bought a 10 pack of condoms to try out. They sent me like ten 10 packs. Glad I liked them lol.", "label": 0}
{"text": "Your license agreement is not between you and Steam or GoG, it is between you and the actual publisher of the game. So neither can revoke it.\n\nAnd if the license actually gets revoked (unlikely, but just for arguments sake), you are having an illegal copy on your system. That is not \"childish nonsense\", it is literally the law. \n\nYou didn't even \"own\" games when they were on CD. You still only had a license. Whether some DRM-free game is on Steam, GOG or CD - you are allowed to make a backup copy for yourself (at least acc. to EU law). For Steam you need to work around launch options occasionally, for CDs, you usually need to also create an iso of the CD itself, and for GoG, you got the installer. All of that is with a comparable license, just via different means.", "label": 0}
{"text": "I also plan on either upgrading one to a bigger storage or adding a new one altogether, should have mentioned. I've seen a nice MSI x870e board with 4, just not sure if it's completely worth it...", "label": 0}
{"text": "What you think I pay them to not clean everything?", "label": 0}
{"text": "Damn, you youngsters probably weren’t around when IKEA sold properly sized desks of good quality. 220x120cm-masterrace.", "label": 0}
{"text": "Damn imagine they sent like 10 CPUs or GPUs or something", "label": 0}
{"text": "While maintaining the cognitive dissonance required to accept that they're too blame for continuously supporting it. Videos of pre-order players getting mad is the best entertainment.", "label": 0}
{"text": "Looking at those bezels, seems like they were trying to do you a favor lol", "label": 0}
{"text": "its when the oil stops leaking you are really in trouble", "label": 0}
{"text": "True.\nIt is so strong that most games wont utilize it that much.\n\nBesides some games like cyberpunk.\nThat was the first game where it really had to work at 60-75%.", "label": 0}
{"text": "don't touch my lotion! hahaha", "label": 0}
{"text": "Ah, got it. Makes more sense. I spent \\~1800 for a similar build, but used the non XL fractal north, 750w PSU, and a cheaper cooler, already had peripherals. Either way, congrats. The build shreds through 1440p with raytracing. People are worried about 12 gb of vram, but I have absolutely no complaints so far. The GPU is excellent.", "label": 0}
{"text": "haha, true", "label": 0}
{"text": "Yeah as someone who doesn't have a desktop atm and is planning on building one, the 9800x3d is a solid option.", "label": 0}
{"text": "More possible than you'd think with big purchases. I bought a Secret Lab Titan EVO XL chair, and just randomly got an extra regular sized on delivered at the same time. Built it for my partner. Mistakes happen!", "label": 0}
{"text": "Not exclusively their desk.. are you saying you would expect them to specifically not include your desk or are you confused by maid services in general?", "label": 0}
{"text": "Usually what happens from my experience is they ship you something, it gets delivered, the tracking never updates, they automatically refund you after a week or so. I've never had them automatically send a replacement like a lot of people are claiming.", "label": 0}
{"text": "Sure buddy, cope harder.\n\nJust because a maid cleans for a living or you have given the company instructions doesn't mean they don't make mistakes or communication errors when a different employee comes to clean. As you can see from OPs post, they used literal furnature polish on his computer monitors.....", "label": 0}
{"text": "https://preview.redd.it/vse1luih7ywd1.jpeg?width=671&format=pjpg&auto=webp&s=a36a8b9501d16c521e3694c7b603b93b8bc1a6ec", "label": 0}
{"text": "14th gen was just a 13th gen re-release but slightly overclocked out of the box, yeah you're technically right but 14th was pretty much an excuse to release a new generation even tho they had nothing new to release, and it bit them in the ass pretty hard", "label": 0}
{"text": "Edifier", "label": 0}
{"text": "Amazon is a platform for small businessess. You dont know for sure you arent screwing one of them over by keeping it.", "label": 0}
{"text": "Today SATA and NVMe SSDs are at (near) price parity, and I’d only go with a SATA SSD because all my M.2 NVMe slots have been populated and when I’m still running out of storage.  \nYou can get decent 2TB drives for $100-120 those days, that’s already quite a lot. \n\nAnd you can always keep unused-at-the-moment games on the external HDDs, and simply move them between storage drives when you want to play them. Use the HDDs as \"inert\" storage, if you will.", "label": 0}
{"text": "I'm pretty sure I have, but I'll check next time I'm at my PC, and I'll let you know how it goes, thank you!", "label": 0}
{"text": "you too!", "label": 0}
{"text": "> Yeah this is borderline impossible to happen with physically large purchases\n\nNot true, my buddy had two fridges delivered when he only ordered one. He asked them to take it back right there during delivery because he didn't know he legal gets to keep it.", "label": 0}
{"text": "Yeah, keeping the second monitor would be straight-up stealing. Not something I was want on my conscious.", "label": 0}
{"text": "No you didn't, you only got one.", "label": 0}
{"text": "i see people saying this all the time, but neither my NH-D15 or 7800X3D had a sticker plastic cover. i was even trying to \"scratch\" the surface with my fingernail and it was 100% not plastic.", "label": 0}
{"text": "Like I said you didn’t make bad choices! Just kinda pricey ones, and there’s nothing wrong with that! Enjoy the new rig friend!", "label": 0}
{"text": "Luckily I will never have to cancel an Adobe subscription because I will never pay for an Adobe product 😂", "label": 0}
{"text": "|  ||\n||  |_\n\nThe future is now old man.", "label": 0}
{"text": "probably a fake image.", "label": 0}
{"text": "I once ordered a robot vacuum cleaner and got 2. But a week later amazon contacted me about the other one and i had to return it, otherwise they would've charged me for it.", "label": 0}
{"text": "When was the last time intel really changed their architecture anyway?", "label": 0}
{"text": "do it on carpet with magnetic screwdriver for maximum effiency /s", "label": 0}
{"text": "uh, this is a DELL monitor, shipped by amazon. i am not fucking over any small business with this purchase", "label": 0}
{"text": "Just following up. Got his rig setup and iRacing works fine with the 1050ti. He doesn’t really notice the quality difference since he’s just getting into it, but I told him he will probably want to upgrade eventually. Here’s a picture of his PC setup. (That’s a small GPU in a big case 😂) Also yes, the CPU is upside down. He tried setting things up before I got there…\n\nhttps://preview.redd.it/yj6hn5tg7ywd1.jpeg?width=4284&format=pjpg&auto=webp&s=0d7919488cc06575d0fd946d7736d0a1456a0b7f", "label": 0}
{"text": "Apparently they make mistakes even with large things because I’ve received two dog gates before, which are like 4 feet tall and decently heavy", "label": 0}
{"text": "This doesn’t sound right, but you can’t just swipe.", "label": 0}
{"text": "look on the bright side, now you have a glossy screen!", "label": 0}
{"text": "Get better internet? I cannot advice much without knowing what your theoretical maximum must be. I have gigabit from my ISP, and Steam gives me about 800 Mbit.", "label": 0}
{"text": "Ani two", "label": 0}
{"text": "Watch Linus tech tips and austin evans builds (all of them while you're building) that's how i built my pc", "label": 0}
{"text": "As a classic Mercedes owner that has bought 5 oil sensors the oil light is \"engine still there, check the oil periodically\"", "label": 0}
{"text": "https://preview.redd.it/ywsdl59s7ywd1.jpeg?width=828&format=pjpg&auto=webp&s=23b87bec5a336171e9c96a494bce8544b14eca13", "label": 0}
{"text": "best gpu you can afford.\n\nrx6650xt is $210 on amazon sapphire brand.", "label": 0}
{"text": "Where's the PC? Not seeing why this is posted in the PC sub. 🤷‍♂️", "label": 0}
{"text": "You are channeling that Pippin energy\n\n![gif](giphy|OiNW0PypI1RaE)", "label": 0}
{"text": "Bonus!", "label": 0}
{"text": "Glad you love it", "label": 0}
{"text": "stop crying. they did not damaged it.", "label": 0}
{"text": "That is the whole “with the features you want part”\n\nMy brother printer, which was $150 last year, has all of those features except the auto scanning.\n\nThis one has all those features.\nhttps://www.brother-usa.com/products/mfcl2820dw?srsltid=AfmBOoqoxTDfLsDI9XamsQxx8lqJ7ANMFeIDKlXzyoh46bjURI4DXv8l", "label": 0}
{"text": "Always funny if a company makes a mistake and you end up receiving nothing they have to send you a new one. But when you accidentally get more than you bought everyone keeps silent 🤐", "label": 0}
{"text": "This is the most #winning thing I've ever seen. Congratulations, and also I hate you now and forever.", "label": 0}
{"text": "So tired of these posts, true or not, it's just a picture of a box.  So what?", "label": 0}
{"text": "I mix 70% water and 30% alcohol (96%), wet microfiber cloth and clean electronics\n\nIt didn't damage my monitors but do additional research for your own products", "label": 0}
{"text": "I dont really play fps, so its not a problem for me", "label": 0}
{"text": "OP are you a kid or what? they did not damaged it and your monitor is working fine. stop making it an issue.", "label": 0}
{"text": "first intel 13th and 14th gen have cpu failures. 2nd yesterday new intel cpu came out now called core ultra 9.\n\nso price is going to be low.\n\nask $1500. but be ready to take $1000", "label": 0}
{"text": "You can find better deals for not much more. My i7 16 gig 3070 with 1tb laptop costs me 650 open box at Best Buy.  Spend 40 bucks on Amazon sale and got 32 gigs of ram. But still not bad at all. But I'm the type I'd rather spend a little more for more bang.", "label": 0}
{"text": "https://preview.redd.it/t94iqsz28ywd1.png?width=1080&format=pjpg&auto=webp&s=c953dbd257effa7c14c1fe213fd41f6731e706d3", "label": 0}
{"text": "The dark sign of CPU", "label": 0}
{"text": "Don't sweat on the board!", "label": 0}
{"text": "You did check your router output? Also, did you do a proper speedtest (e.g. ookla or so)?", "label": 0}
{"text": "DHL in my experience is actually the best, but I am also German and DHL service *might* be better here.", "label": 0}
{"text": "That's your storage access light, this gets asked probably about 3-5 times a day, it lights up when your storage gets accessed. As for your screen going black when you tilt the PC, don't tilt the PC wtf? Could be your HDMI/DP cable unseating due to the movement or your GPU isn't fully seated on its slot and moves a bit when you move your PC", "label": 0}
{"text": "😬🫣🤦🏻‍♂️", "label": 0}
{"text": "idk what you define as \"normal\" but there is just too much white goin on here.. imo it needs to look more alive and cozy, with warmer colors or something :/", "label": 0}
{"text": "Looks live you live in the grid in Flynn's house in Tron Legacy.", "label": 0}
{"text": "Keep me updated!!", "label": 0}
{"text": "It does, my sunglasses are on the case lol", "label": 0}
{"text": "Normally if that blue light is blinking, the PC is sleeping. Should wake up pressing a key or power button and goes back to solid light.\n\nScreen going black when tilting, must be something with the GPU not seated properly, not screwed in the back, or a bad cable, or a cable not completely pushed in.", "label": 0}
{"text": "I'd disagree, if anything requires special treatment he should be the one to let them know.\n\nI wouldn't blame on the maid", "label": 0}
{"text": "There’s so little difference it’s hard to say, I went x870 hero purely for a couple of small features and it was literally the same price as the x670 version. Usb4, slim sas and a backplate, I don’t NEED them but I want them, so at the same price it was a no brainer. If there’s nothing drawing you to either just go for whichever is cheapest.", "label": 0}
{"text": "Eli5", "label": 0}
{"text": "Stop downvoting my man, do y'all not know what a joke is", "label": 0}
{"text": "return one now you have free monitor.", "label": 0}
{"text": "STACK UM why they gotta be side by side?", "label": 0}
{"text": "My mate did this with a 4060", "label": 0}
{"text": "I only see one monitor. Congrats.", "label": 0}
{"text": "![gif](giphy|Z5xk7fGO5FjjTElnpT|downsized)", "label": 0}
{"text": "idk but the 4090 is just overkill imo", "label": 0}
{"text": "I used to have a crosshair VI. Great board but the sensors on it are wack lol. It's a shame the modern crosshairs are so expensive, I settled for a strix for AM5 instead.", "label": 0}
{"text": "I’m sorry I have a hard time feeling bad for someone who can afford maid service. But yes they owe you, the question is if you can let it slide and purchase new monitors yourself instead of making those people who probably works harder than the money they earn to pay for it.", "label": 0}
{"text": "Make sure your cables are plugged in all the way and dont touch the PC", "label": 0}
{"text": "This is the wallpaper on the boxes Looks like the ones on the AW3418DW which are difficult to find these days since they were released way back in 2018! And they are resilient and built to last I still have mine from the original really still this day !!! \n\nGreat purchase!", "label": 0}
{"text": "Get a razor blade and use that to line your pins back up in all directions.  Ive had to do it on an old am2 cpu I had butterfingers with.  Worked just fine.", "label": 0}
{"text": "Anti glare doesn’t “wipe off” like that. Just clean it harder, you’ll be fine.", "label": 0}
{"text": "I'm sorry where are you seeing something that looks close to practical here?", "label": 0}
{"text": "Use a guitar pick, debit card, membership card, or anything similar to simply bend the fins up. Technically you could also leave it and be fine, it's only cosmetic \"damage\" that can be easily repaired in a couple minutes.", "label": 0}
{"text": "Look up mechanic flexible LED light. The car guys figured out lighting for small spaces a long time ago.", "label": 0}
{"text": "Follow a YouTube guise", "label": 0}
{"text": "Funny thread to discuss it in but it's INSANE how much soap people use and how wasteful that is. People, put some soap in the bottom of a spray bottle and fill the rest with water. It will literally last you ten times longer this way.", "label": 0}
{"text": "Better pricey than too cheap in my opinion. That’s for your input I appreciate it!!", "label": 0}
{"text": "6750xt 12gb vram. 8gb vram wont be enough for 1440p highest settings .\n\n1440p gaming gpu matters mroe than cpu.", "label": 0}
{"text": "Well if they don't know how to clean it properly then they probably shouldn't clean it at all and ask. It's on the cleaning service just as much as it is on the owner to not just assume and destroy things. I mean really, who's dumb enough to put wood polish on a screen? This isn't a big wood frame TV from the 80s.", "label": 0}
{"text": "MS actually fixed a lot of the older games shortly after the acquisition", "label": 0}
{"text": "My gf has a 75” Sony 4k tv on the wall in the basement from before I moved in. Also before I moved in a cleaning person pulled a similar move and stained the hell out of it. \n\nWe have had other cleaning services since. I always make a big deal “do NOT clean any electronics!”", "label": 0}
{"text": "Surprisingly ive seen ppl test how much pins you can break off until failure i think it was 8 dude ran games pretty fine but idk the longevity", "label": 0}
{"text": "Dudes an idiot just yappin bout shit he don’t know online, ignore him", "label": 0}
{"text": "i also tell my wife Amazon accidently sent two...", "label": 0}
{"text": "When I was working overseas, my computer desk was strictly out of bounds to maid service.  \n  \nAnd since they send a different one every now and then, I covered my desk with a canvas just in case.  \n  \nNo one touches my desk, not even at home. Lol.", "label": 0}
{"text": "later you can still upgrade to 5700x3d when the time comes. still a good cpu.", "label": 0}
{"text": "Its the highlight", "label": 0}
{"text": "yup", "label": 0}
{"text": "Daaamn", "label": 0}
{"text": "Is that a G502 X, NOT on a powerplay mat?  What is that?  or did you mod it?", "label": 0}
{"text": "I did ran Malwarebytes. thank god I just got my steam account back", "label": 0}
{"text": "The power supply is a slight overkill but specs look good for 5+ years down the line depending on your requirements.", "label": 0}
{"text": "It never happened.", "label": 0}
{"text": "The display is tilted -0.7°.", "label": 0}
{"text": "If you're not doing it for 1-2 years, don't even think about it right now.", "label": 0}
{"text": "It seems like a good deal. Just make sure it isn’t ID banned by Riot Games.", "label": 0}
{"text": "Side by side but second monitor in portrait mode", "label": 0}
{"text": "Did this the other week at work. My Volvo truck would not start and just gave gearbox error and engine error. Ofcourse i was on the scale and blocking it completely so i called our mechanic and asked for good advice. I got good advice. Turn off the main breaker and turn it back on. solved the problem right away :D", "label": 0}
{"text": ":) nice 👍", "label": 0}
{"text": "If you can bend them straight, it’ll work.\n\nThat is a big IF, but still, try, it’ll be fucked unless those pins are straightened", "label": 0}
{"text": "The 7700 XT is a decent step up, but typically you want to save up for large upgrades every once in a while rather than make small increases frequently, it's better for your wallet. You should save up for a 7800 XT or 7900 GRE and a high refresh rate 1440p 1ms 165Hz+ monitor.", "label": 0}
{"text": "My maid service washed my gf cast iron. Now we make sure whoever we get knows. She just resealed it so not too harmful but yeah make sure to always tell them how you like stuff to be cleaned even if it feels condescending. Hope your monitors arent f’ed", "label": 0}
{"text": "Peeing in a bottle no less.", "label": 0}
{"text": "Get a Phantom Spirit 120, it's an updated version of the Peerless Assassin that gets recommended.", "label": 0}
{"text": "sounds like you installed the OS on the drive you removed.", "label": 0}
{"text": "![gif](giphy|84BjZMVEX3aRG|downsized)", "label": 0}
{"text": "Fixable! I accidentally dropped my 5950/3dx when doing a board swap. I took a step back to look for it and squashed it. The entire bottom was flat. I spent 6 hours with tweezers and a magnifying glass bending them all straight. One or two even broke off. It works to this day a year later. I also remember that after a couple of hours, I devised some homemade tool, but I can not for the life of me remember what I used. That said, it was extremely stressful trying to fix it, lol.", "label": 0}
{"text": "my Strix B650E-E has 4 M.2 slots, its been a great board but they are kind of expensive, the one I have was an open box return from amazon warehouse so I got a good deal on it", "label": 0}
{"text": "Literally every game has an online requirement now lmao and yall keep making these", "label": 0}
{"text": "Mutha fucker..:2x 4k qdled. You jammy git 😀 enjoy.", "label": 0}
{"text": "Well, what's your budget for a GPU?", "label": 0}
{"text": "Side by side, both vertical orientation combine the display and it turns into a giant 4:3\n\n(I didn’t do the math on if it is actually but my napkin math checked out)", "label": 0}
{"text": "Nice. I got 2 big macs today when I ordered just one.", "label": 0}
{"text": "Why don’t u clean your house yourself then", "label": 0}
{"text": "Aww poor guy", "label": 0}
{"text": "What's your budget?", "label": 0}
{"text": "On a post where the conversation evolved from just the case of the cleaning directly to the idea of personal space where the person is talking about value. Which inclines they are possibly going to take such an item of high value. While also noting that many people refuse to use maids or have horror stories of them stealing things. \n\nAs I said before. Items of special care are brought up in the process of hiring. Failure to do so isn't the fault of the cleaning service.", "label": 0}
{"text": "Polish does not contain acetone. Or at least, it shouldn’t. Polish usually consists of some kind of a wax or oil that leaves a shiny film on the surface. Putting acetone in a polish product would have the opposite effect. \n\nYou might have been referring to other cleaners that are not specifically “polish”. I don’t know of too many cleaners that contain acetone specifically, But yes, some chemicals will degrade plastics and rubbers, etc. This is why there are directions on the bottle and suggestions of what you can clean with it. 99.9% of the time there will also be a disclaimer that specifically tells you to test the product first on an inconspicuous area to make sure it doesn’t damage your surface.", "label": 0}
{"text": "I bought thermal paste and Amazon sent me 2x 48\" shop lights last week. I got to keep them and got refunded but like, idk what to even do with them. They aren't even wired to a plug.", "label": 0}
{"text": "That’s why the cleaner is forbidden from going into the office.", "label": 0}
{"text": "I ordered a cheap Magic the gathering commander deck several times (17 dollars) & each time they sent me a 45 dollar deck instead. Something like this is definitely possible in my experience.", "label": 0}
{"text": "110% fixable with more than a 50/50 I would say. None of them look to far bent. As others have said use a credit card/razor blade to straighten each row, Mechanical pencil also works like a charm! LTT has a recent video showcasing a few way of fixing this!!  \n\nGood luck!", "label": 0}
{"text": "Phantom Spirit 120, it's an updated version of the Peerless Assassin.", "label": 0}
{"text": "Use Amazon because you maybe might get one extra gold ingot", "label": 0}
{"text": "Okay I see what you’re saying, don’t use the SATA SSD unless all my NVME slots are full. Now switching games back and forth between different storages looked kinda difficult. 😅 idk why there isn’t a simple process to drag and drop between storages.  On a different note, so far SM2 looks and plays beautifully on high graphics right now. I’ll keep you updated.", "label": 0}
{"text": "order another and make a awesome triple monitor sim rig", "label": 0}
{"text": "Does the motherboard have trouble code LEDs (EZ Debug)? Are any of the lights on? Did he properly plug in the CPU cooler after the repaste? How sure is he that all the pins are exactly straight and identical to the other pins on the CPU?", "label": 0}
{"text": "I want to see a receipts", "label": 0}
{"text": "I didn’t see this post coming…", "label": 0}
{"text": "Imagine they sent (10) Japanese assassins.  To cut off your dick.", "label": 0}
{"text": "Why does this never happen with me?! 😭", "label": 0}
{"text": "That is no water-cooling, that is mineral oil.", "label": 0}
{"text": "Did you check what audio out device you have selected in windows?", "label": 0}
{"text": "You win - enjoy!  \n\nPersonally?  I’d return one and enjoy my free monitor.", "label": 0}
{"text": "I got 2x 1tb of memory, 64 bg ram free, and a full refund if the free products. I only ordered 1tb and 32gb ram. They just massively fucked uk then refunded me for twice. They paid me for free shit. No idea what happened but honestly it was a hassle and long story that led to this outcome ", "label": 0}
{"text": "I never said companies don't make mistakes. That wasn't the point of question. And certainly I can easily see an error happening. But damage wasn't the point of your post. It was the value of said item.", "label": 0}
{"text": "Hell mf yeah", "label": 0}
{"text": "so what if you return one of them? technically you bought 1 so you can return 1 right?", "label": 0}
{"text": "https://preview.redd.it/3r1h6rha9ywd1.jpeg?width=538&format=pjpg&auto=webp&s=b632025585f6767e317dc051a0884645ae881b2d", "label": 0}
{"text": "We/do have for the last two years.  What’s it to you?", "label": 0}
{"text": "On its way", "label": 0}
{"text": "NGL, I was actually thinking about doing almost exactly this same thing for my home/computer", "label": 0}
{"text": "The important thing is, how many did they charge you for?", "label": 0}
{"text": "Yeah I did notice the issue when I accidentally placed the computer on a cable causing it to tilt, but I did push in the power cables properly in( it was one hanging slightly out) and I made a makeshift gpu stand with Lego’s. That issue is now gone", "label": 0}
{"text": "Man and I thought I was lucky when I got 4 keyboards for the price of 1.  Nice.", "label": 0}
{"text": "Bought a InWin triple pack fan kit for my PC one time. Saw a large unmarked box delivered and was confused. They sent me 6. Got 20 fans for 30 bucks lol", "label": 0}
{"text": "Ah yes Amazon style Sashimi", "label": 0}
{"text": "No. Absolutely not. If you can afford a maid, you can afford new monitors. Do you need your purchaser to add them to the cart for you, too?", "label": 0}
{"text": "Are you downloading into an HDD? Maybe that's what's holding the download speeds back.", "label": 0}
{"text": "I wonder if people upload the final build? I see many post asking if they chose correctly. Rarely I see them build? \n\nAm I'm missing something?", "label": 0}
{"text": "Call it \"Dontuseuserbenchmark\".com and under every benchmark, explain why your site is way better than user benchmark and it's weird owner.", "label": 0}
{"text": "I've spent too long trying to figure out where the PSU is so I have to ask. Where is the PSU? It can't be in the 1\" deep cable management area right?", "label": 0}
{"text": "You win", "label": 0}
{"text": "Return one homie.", "label": 0}
{"text": "I've used a credit card to slide in between the pins to fix one or two at a time over the years.  Good luck and let us know how it goes.", "label": 0}
{"text": "Happened to my bro with 2 JBL boombox\nYou son are blessed, enjoy", "label": 0}
{"text": "It's not some arbitrary value, it's pixel density. There are simply less pixels in any given area on a screen that large. Never mind that though, how's your neck?", "label": 0}
{"text": "And a keyboard with white background light :)", "label": 0}
{"text": "I’m planning on posting mine, I just haven’t gotten my case yet. Should be here tomorrow!", "label": 0}
{"text": "The issue with the screen going black is fixed, but the blue light has always been turned on even if the computer is not sleeping, what’s new is the orange light", "label": 0}
{"text": "Several years ago, I remember seeing UB ranked an i3-9350K to be overall superior to a +12 cores Skylake-X CPU because of how borked their multicore performance weighing was.", "label": 0}
{"text": "This happened to me with swords. I ordered one and got 4. In an enormous box.", "label": 0}
{"text": "Looks like an apple ad", "label": 0}
{"text": "Don't need room on your desk, get a double arm desk mount, although side by side 32\" monitors is pretty wide.  Could always put one in portrait mode.  I use WALI mounts for my monitors and they work great.", "label": 0}
{"text": "Which of them are you gonna sell to me for $100?would take it off your hands", "label": 0}
{"text": "Once received two LG monitors instead of one that we ordered for a client, returned one but it made everybody confused as they had one asset tag assigned to it.", "label": 0}
{"text": "The card you want to upgrade to in 1-2 years probably isn't released yet. Upgrading to another card within the same generation usually isn't worth it. See what the 50/8000 series have to offer. Bare minimum, their existence will make the 7800XT cheaper.", "label": 0}
{"text": "Elaborate", "label": 0}
{"text": "Lol the classic no real world experience, terminally online response. \"Sue them!\"", "label": 0}
{"text": "Id even recommended your card if he cares more about performance than raytracing, much better price for similar+", "label": 0}
{"text": "The exact same thing happened to me a couple years ago with a similar monitor. Except I do have room on my desk. Welcome to the double Alienware monitor for the price of one club. :) For your peace of mind, nobody's hunted me down about it.", "label": 0}
{"text": "I only see one monitor there.", "label": 0}
{"text": "you don't need space on the desk for two. you need to file a return and get your money back and a free monitor", "label": 0}
{"text": "No, not practical in the least. But it is effective cooling. And probably impressive to people who are impressed by impractical things.", "label": 0}
{"text": "Send it all back", "label": 0}
{"text": "Thing is… it’s rather practical for conducting the heat elsewhere. Thus your server can also provide heating and warm water next door. \n\nI always found combatting waste heat energy with even more energy in the form of AC cooling ridiculous. You heat up the surrounding air which isn’t practical for anything except bad for the environment. \n\nBetter to reclaim some or most of it and do something useful.", "label": 0}
{"text": "We had a similar problem a few times with 2 deliveried instead of the 1 ordered. \nIf your Amazon invoice shows only one monitor, click on refund and send back one.\nKeep the other one - it's free :)", "label": 0}
{"text": "There's vesa arms with 2 mounts, you could have the 2nd one hover above the first.", "label": 0}
{"text": "Massive W, and amazon wont come back for it. Tbh if i was the driver i would have taken it home with me", "label": 0}
{"text": "Fuck, my computer is leaking oil again 😭", "label": 0}
{"text": "God, I see what you do for others 🙏🏽🙃", "label": 0}
{"text": "https://preview.redd.it/zy65qg14aywd1.jpeg?width=828&format=pjpg&auto=webp&s=aa492e3600c8bebfab3dc14ae7d933e2af0389f3", "label": 0}
{"text": "Usually such no need to return laws are to avoid the shady practice of sending someone something unbidden, then demand sending back or payment and defaulting to \"you want it if you don't ship back in a week\".\n\nIf you already have contractual relation normally you are required to contact the seller and either buy the second or the Seller has to take back the wares on their cost. Here", "label": 0}
{"text": "Brb, ordering 2 to see if 4 turn up", "label": 0}
{"text": "So can you actually keep that or do you have to return it?", "label": 0}
{"text": "My sister bought $100 magna-tiles box for my toddler for his bday. She got 2 delivered to her. Returned one and got a refund.", "label": 0}
{"text": "\\> Your license agreement is not between you and Steam or GoG, it is between you and the actual publisher of the game. So neither can revoke it.\n\nAgain, all of these are false childish fact that are not backed by any source. \n\n\"[Steam](https://www.thegamer.com/tag/steam/) has added a disclaimer that reminds buyers that they won't own the games they're purchasing on the storefront. Instead, they are buying a licence that lets them play the game, which can be revoked by Steam or if the publisher removes the game\". (Source: [Steam Update Addresses Digital Game Ownership](https://www.thegamer.com/steam-digital-game-ownership-licence-disclaimer/))", "label": 0}
{"text": "buy a better cpu cooler?", "label": 0}
{"text": "I mean it's not really a \"broken\" system. You have to tolerate a certain amount of error in a large operation. The larger the operation, the more errors you expect to happen. Even if OP legitimately got two monitors by accident, this is such a minor blip in Amazon's functions that it's not even worth them trying to recoup the losses.\n\nSame thing happens in government all the time. Except people die a lot when the government does it.", "label": 0}
{"text": "Won’t be an issue because we have AI to upscale it back to the original state. ", "label": 0}
{"text": "Sounds like promotion material if you can only fail at this test. \n\nhttps://preview.redd.it/gt64ha57aywd1.jpeg?width=612&format=pjpg&auto=webp&s=86859233d10081002e75e97d528176f7f46a31a7", "label": 0}
{"text": "Let’s see the receipt", "label": 0}
{"text": "My girlfriend got two smartphones delivered.. When she complained about it to amazon, they scheduled the return but never picked it up.. Then after another complaint, they asked her to keep both phones and sent her invoice for 0₹.", "label": 0}
{"text": "I've had this happen, I ordered 1 thing and 2 different amazon facilities fulfilled the order, so I ended up with 2 of the thing. It was deodorant I think.", "label": 0}
{"text": "Can you suggest any proper article or youtube video for the process?", "label": 0}
{"text": "If you have delicate/steady hands and nerve, trying carefully tilting them back using a tool or require a help of a professional.", "label": 0}
{"text": "invoice?", "label": 0}
{"text": "Certainly aestetichally pleasing. However, I am not one to put my PC on the desk. Much prefer it out of sight. Less noise, more desk space. Also, those memory modules look blinding. Seems like it would get annoying.", "label": 0}
{"text": "Don’t listen to this person. They’ve been terminated for taking a ten minute break. I’m the current CEO. Please send me an email that we can contact you at so we can retrieve the extra package.", "label": 0}
{"text": " Eternal the person getting a $48 GPU and you getting 2 monitors I’m getting pretty jealous. Congrats.", "label": 0}
{"text": "Build the world’s most impractical VR headset.", "label": 0}
{"text": "![gif](giphy|GhGPnlp2Gl3TG)", "label": 0}
{"text": "It's insane how much dividends the Nvidia marketing machine is getting Nvidia profit on unsuspecting buyers.", "label": 0}
{"text": "This reminds me of the time I order a litter box on Amazon and I received 5", "label": 0}
{"text": "When I first started getting into computers, they always showed up on top. I believed them to be somewhat accurate. Although, once I read the full page, I realized they were shite. \n\n\nSeeing red flags like:\n \"Why do YouTubers not like us?\"\n\"Why does reddit not like us?\"\n\"Why does no one like us?\"", "label": 0}
{"text": "hey it's me ur brother", "label": 0}
{"text": "Shittt I mean I can take it off your hands", "label": 0}
{"text": "Congratulations, OP! Even though I'm not a fan of white out builds I think your build came out beautifully. The red accent on the GPU looks great in there too.", "label": 0}
{"text": "Bro fuck it ima start ordering shit on Amazon and returning them if I don't get two of them. Fuck you!", "label": 0}
{"text": "[https://www.youtube.com/watch?v=zBkzqMYGcZ0](https://www.youtube.com/watch?v=zBkzqMYGcZ0) (Select Windows 11 if you have Win 11)\n\nThen boot to the flash drive and select the option to repair your Windows install.", "label": 0}
{"text": "How are we supposed to now without knowing what the new CPU is, what older CPU was, in which game, or if it is even gonna make a difference and the GPU isn't bottlenecking both of them?", "label": 0}
{"text": "Bro that looks like Heaven", "label": 0}
{"text": "Why is the Amazon in my country not making mistakes? They deliver me all the time exactly what I ordered.", "label": 0}
{"text": "It's crazy to me that nvidea released a card that wasn't even as powerful as the previous generation 1 up card. Then think up some bullshit bit of tech they could hold back for it to seem vaguely appealing.", "label": 0}
{"text": "Looks gorjus", "label": 0}
{"text": "Lots of rich people in this comment section lol", "label": 0}
{"text": "Generic white desk i found on my local store.\nThe gpu is pny 4070ti", "label": 0}
{"text": "Nice the only thing I ever got more of one item was when I ordered a Jacklinks beef stick to get free shipping.", "label": 0}
{"text": "Looks like dielectric coolant. Oil would be so messy.", "label": 0}
{"text": "neat", "label": 0}
{"text": "No, it genuinely was a Freudian slip from the WEF operative, the whole \"invite discussion\" thing is just a poor attempt to save face.", "label": 0}
{"text": "I do love the 6950XT, but I usually recommend a 7900 GRE over it due to the increased efficiency. My 335w card is a beast, but it also sucks up a shit ton of power and is a bitch to keep cool.", "label": 0}
{"text": "I once ordered one DVD-RAM disk and got 10 instead.", "label": 0}
{"text": "I did this with a trumpet but only because the one I ordered off my debit card didn’t actually cancel after I went through the process.", "label": 0}
{"text": "I have had these kinda things happen to me, however karma always gets me if I do not do the right thing.", "label": 0}
{"text": "Had this happen with a $400 carpet. They figured it out 3 weeks later fyi.", "label": 0}
{"text": "Put your GPU in the top slot. Make sure your RAM is in the right slots to run in dual channel.\n\nPlug your monitor into the GPU and not the motherboard.", "label": 0}
{"text": "In some games but overall it's top 10.", "label": 0}
{"text": "This happened to me with amd ryzen 3700x processors. Ordered 1, got 2", "label": 0}
{"text": "Do you think the price of 7800x3D will drop when the new one launch or for 370€ is a good buy?", "label": 0}
{"text": "change it in NVIDIA control panel", "label": 0}
{"text": "It sounds like you had sag and the gpu was not fully connecting to the pcie slot. You should ensure that it’s completely inserted to avoid damage.", "label": 0}
{"text": "Alienware is overpriced tho, so you probably broke even \n\n/s", "label": 0}
{"text": "Shhhhhh", "label": 0}
{"text": "If it's got HDMI/DP it's a monitor.\n\nMonitor? Monitor.\nTV? Monitor.\nProjector? Monitor.\nKVM? Monitor.", "label": 0}
{"text": "Because he is claiming Zen 5 is more efficient since it achieves the same performance at near half the TDP, the 9700X is only 65w while the 7700X is 105w, but in reality Zen 4 is more efficient at 65w than Zen 5, and 65w on Zen 5 has the same power draw as 105w on Zen 4, in gaming at least, the reduction in TDP didn't help efficiency except for multi theading.", "label": 0}
{"text": "It's okay, they'll charge you for three.", "label": 0}
{"text": "I would say Intel Xeon cpu and Nvidia Quadro now know as Nvidia RTX.", "label": 0}
{"text": "yeah true but $1600 isnt THAT much for how much power youre getting. You can use a build with that GPU and still keep the total price under 3k", "label": 0}
{"text": "Favor ain't fair. Congrats on the free monitor!", "label": 0}
{"text": "Oh yeah, it's totally an old system. Been planning to build a new one as well. In how small increments would it be safe to adjust the DRAM voltage at a time?", "label": 0}
{"text": "No you've not. You only got one. You hear me? One!", "label": 0}
{"text": "The back of my PC is facing a window and I did in fact put a box fan in that window", "label": 0}
{"text": "I ordered 2x32GB RAM. They sent 2 kits. Now I have 128GB RAM in my desktop.", "label": 0}
{"text": "I’ll buy the other one for a great discount", "label": 0}
{"text": "Bro, you're supposed to lay those floorboards staggered and not perfectly next to each other", "label": 0}
{"text": "Where do they put it on them, head, abdomen, feet, wait… naughty parts? \nSeems like a waste of perfectly good food. ", "label": 0}
{"text": "check my profile.", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "ok so name them", "label": 0}
{"text": "Not popular opinion but isn’t it stealing if you keep both?", "label": 0}
{"text": "The tiling job tho.", "label": 0}
{"text": "Magnifying glass and ceramic micro tweezers. Got my 5600x bent up like this when I pulled the heatsink and fan. Do it really sloooooowww.", "label": 0}
{"text": "Perfect response everytime..... \n\n\nCongrats!!! 😠 😡 😤", "label": 0}
{"text": "66.67% Fucked Forever\n\n33.33% Not Fucked Saved Holy Shit It Works", "label": 0}
{"text": "Sadly ADHD/Autism can hinder motivation for things like this. Paying for things like a robot vacuum or a maid once every few weeks can really help with that. Even if you still have to do it yourself most of the time.\n\nThough I agree with your last statement. If a company has to pay the damages I'm not sure though", "label": 0}
{"text": "Clean, but makes me unusually anxious.", "label": 0}
{"text": "What stress? LOL\n\nThats zero stress.  None. Whatsoever.", "label": 0}
{"text": "The case looks cool, but no exhaust fan so that's a -1, gojo figure on the table is concerning XD, also this desk needs an extra monitor IMO, you have enough space, you can get good 1080p  monitor for cheap...\n\nAlso looks cold, and waaay too clean... \nOverall 8/10", "label": 0}
{"text": "no idea", "label": 0}
{"text": "If I'm reading this right that's actually pretty reasonable system requirements compared to the others I've been seeing posted here.\n\nNo mention of upscaling tech being required for 60fps on high end hardware or anything like that.", "label": 0}
{"text": "Honestly sometimes you can find good deals like this and sometimes they’re rip offs or something. Are you able to return this product after it is delivered to you? If that’s the case, that’s pretty safe to me, anything wrong, just return it.", "label": 0}
{"text": "This isn't necessarily true, also it isn't water in the OP but likely some type of perfluorocarbon fluid with a low boiling point. Cray had been cooling supercomputers with this throughout the 80s and 90s, and 3M has run a nearly decade long material compatibility test with this in the mid 2000s. It's true that material compatibility is a challenge but at least with regard to perfluorocarbon fluids we have a very good idea as to what materials are compatible. As to servicing risk, essentially none, you just want to wear long insulated nitrile gloves to protect from the heat when you pull a server out, and I'd also recommend a respirator that filters out organic vapors, but servicing is as easy as pulling out the server, waiting 10 seconds for it to air/drip dry, replacing whatever components you need and dropping it back in the tank. Also not true that the only people taking it seriously are those selling it, there's been massive interest in this tech from public sector agencies and Nvidia. Although Nvidia is almost certainly working on their own implementation of this same technology. Two phase immersion cooling is an inevitability in the AI sector, with chips getting ever more powerful we are reaching the limit of what can be purely air-cooled , once we get chips firmly north of 1000 watts demand for this tech will grow. \n\nSource: server engineer in the industry", "label": 0}
{"text": "A tv is basically a monitor. and imma use this one as my #3", "label": 0}
{"text": "https://preview.redd.it/1zlmw45ebywd1.jpeg?width=40&format=pjpg&auto=webp&s=cd30f2d64768b0b4333a4cb78a8cd9967ba19e9d", "label": 0}
{"text": "Let me get the other, brother. I’ll owe you one", "label": 0}
{"text": "they also are fun to manage in that they will wick up your cables and out of enclosure, adding to the loss, and mess.", "label": 0}
{"text": "Same thing happened with me except it was Home Depot and I got two green Weber premium charcoal grills instead of 1… been thinking about doing a party with a raffle for like a $5 initial entry or something and then you get extra raffle tickets for every beer you consume and at the end whoever’s name gets pulled gets the free grill. Basically assure that everyone gets drunk and merry while also offsetting some of the food costs of throwing a party.  😂 gonna save it for Christmas time.", "label": 0}
{"text": "Jokes on you there’s rocks in both.", "label": 0}
{"text": "I just turn it off.", "label": 0}
{"text": "its from 2018ish", "label": 0}
{"text": "I ordered an AW3423 and it lasted a week before it fell over and entered the shadow realm", "label": 0}
{"text": "I will buy the best gpu possible that isn’t too good for the 5800x3d. ", "label": 0}
{"text": "Otaku sure, incels nah", "label": 0}
{"text": "This is a pro gamer move.", "label": 0}
{"text": "ive had two in the past 8 years....970 windforce and my current 3080 Gaming OC....i had zero issues with my 970 and im sure if i ever needed it i could plug it in and fire it up. The 3080 has been great, i dont have a huge OC on it but its been a beast for me so far at 1440.", "label": 0}
{"text": "You can get a 7800 XT for $299 the same prices as a 4060 and it embarrasses even the more expensive 4060ti 16gb", "label": 0}
{"text": "I'd choose bad internet over bad specs any day ngl.", "label": 0}
{"text": "CPU bottleneck. I don’t want the gpu to be better then the cpu and I lose frames on Valorant ", "label": 0}
{"text": "It’s from brateck e601 u", "label": 0}
{"text": "And it’s much easier to install that then most big ass air coolers to be honest lol I was surprised how easy it was. Bracket then 4 screws!", "label": 0}
{"text": "Sometimes the slightest change can help. Try changing the pc wallpaper/font/whatever you can think of.\n\nAnd also - Hello!", "label": 0}
{"text": "Modern Gaming is awesome. But being required to connect to servers for a single player game isn't.", "label": 0}
{"text": "It's a common misconception that BMWs don't have turn signals. They do. But they use a wavelength only visible to the wealthy.", "label": 0}
{"text": "I wish this was satire. Some people are really disconnected from reality. Sue the maid! 🤣", "label": 0}
{"text": "To ask the people saying he could sell at a discount.. he could return one and get a full refund 💡", "label": 0}
{"text": "This is to prevent cheating and drm. This is not new in most games now.", "label": 0}
{"text": "It reminds me of so many posts on /r/Tinder, many people will forget to hide the name sometimes", "label": 0}
{"text": "Your assumptions don't directly translate into reality dude, idk what you want me to say lol", "label": 0}
{"text": "There are many", "label": 0}
{"text": "https://www.ftc.gov/business-guidance/resources/business-guide-ftcs-mail-internet-or-telephone-order-merchandise-rule\n\n\nis that better?\n\nWhether or not the Rule is involved, in any approval or other sale you must obtain the customer’s prior express agreement to receive the merchandise. Otherwise the merchandise may be treated as unordered merchandise. It is unlawful to:\n\n    Send any merchandise by any means without the express request of the recipient (unless the merchandise is clearly identified as a gift, free sample, or the like); or,\n    Try to obtain payment for or the return of the unordered merchandise.\n\nMerchants who ship unordered merchandise with knowledge that it is unlawful to do so can be subject to civil penalties of up to $51,744 per violation. Moreover, customers who receive unordered merchandise are legally entitled to treat the merchandise as a gift. Using the U.S. mails to ship unordered merchandise also violates the Postal laws.", "label": 0}
{"text": "I am starting to suspect that these posts afre amazon marketing team trying to get more people to buy all electronics from Amazon lol", "label": 0}
{"text": "4:3 my old friend we meet again", "label": 0}
{"text": "all that and just a founders card?", "label": 0}
{"text": "The word \"may\" is doing a lot of work here for someone who is jumping right to \"Sue the maid\"", "label": 0}
{"text": "Seasoned DLC for games like summer, autumn, winter and spring for different climates could help the world's weather and improve game development.", "label": 0}
{"text": "Assuming they charged you for ONE...Return one keep the free one. Now you have a free monitor.", "label": 0}
{"text": "That's oil.\n\nA friend of mine built one for fun, it enables you to overclock stuff to oblivion.", "label": 0}
{"text": "\\+1 to independents. We pay far less than the commercial services and they do a very solid job.", "label": 0}
{"text": "Man get some reverse fans and it would be much cleaner", "label": 0}
{"text": "Unlike you people, i wouldn't be sharing thus stuff online if i ever got lucky like this.", "label": 0}
{"text": "I had my luck. I got 5x 4 TB WD gold hard drives under a warranty swap from 5x 2 TB WD Greens back when the 4 TB were brand new. IIRC it was over a $1200 upgrade for free. \n\nI had successful argued that because TLER was enabled on the greens and cannot be disabled— AND the WD Reds had not been released yet, I had bought a product that had a feature enabled that wasn’t advertised.\n\nThen the rep said Reds are not an upgrade path for greens via warranty and I have to get golds and because the 2 tb and 3 tb are out of stock I’ll have to get upgraded to 4 tb without being charged.", "label": 0}
{"text": "Happened to me too - got an extra $1k ultrawide lol", "label": 0}
{"text": "I got it for almost 2 years now although I just added some stuff", "label": 0}
{"text": "THE FLOOR", "label": 0}
{"text": "Lmao, for real?", "label": 0}
{"text": "Bros hard work is really shining very bright, my grandma's phone looks so dim.", "label": 0}
{"text": "Oh no", "label": 0}
{"text": "The seller is the actual Amazon so the return policy is great. That’s why I am kinda sure that it’s not a scam. How could Amazon be scamming on they’re on website. But the price just seems to good, and no reviews, that’s why I am suspicious.", "label": 0}
{"text": "Omg, omg, omg. I feel like a kid right now. It’s running so smooth and beautiful right now. It just went through a cut scene with absolutely no freezing on HIGH SETTINGS! It had the slightest lag on ultra settings but just barely. Dude I could kiss you. Lol I’ve been trying to play games for 3 damn days now and could barely play anything. THANK YOU SO MUCH!!!", "label": 0}
{"text": "The only thing shit like this happen to me with is food", "label": 0}
{"text": "I turn them when i use the pc, i only turn them on to admire it", "label": 0}
{"text": "Happy for you. Maybe see if an arm can get you the space you need? Maybe  not, either way, congratulations, that's a nice score. And the good thing, you're under no obligation to tell them, or return one. Win win.", "label": 0}
{"text": "In my personal opinion this is information that should’ve be relayed before the cleaning started. If you told them and they cleaned it wrong then yeah. But if not then I don’t see how they’re liable for that. They’re just doing their job. Either way the monitor is fine lol.", "label": 0}
{"text": "lmao good one", "label": 0}
{"text": "I’ve gotten 2 pairs of shoes when I ordered 1 pair. It really happens", "label": 0}
{"text": "This actually happens (happened to me too) \n\nEcommerce is full of free stuff whoops moments", "label": 0}
{"text": "I don’t care if it’s practical, that’s fucking awesome", "label": 0}
{"text": "Legit.\n\nAnd yeah, my folks had a polish cleaning lady before they downsized.  Did awesome work.  Took the job insanely seriously.\n\nOne day she was cleaning  a wine rack and knocked over a bottle and it broke.  Man, you’d have thought she ran over our dog based on how she reacted.  She was sobbing and kept saying in broken english “I sorry!”.  My mom ran over and hugged her and just kept saying “its ok, it was an accident, its fine” to calm her down.  This poor woman legit seemed scared she’d straight up lose her job.", "label": 0}
{"text": "The only thing that happened to me was that I wanted to return a €5-€10 item. I got my money back, didn't have to send it back and also got a \"replacement delivery\". So 2 for the price of 0. The problem was, I actually sent it back because I really didn't need it. I've now got still new and unopened twice at home.", "label": 0}
{"text": "Likely not novec 7100  since they stopped making that around 2 years ago, much more likely to be Solvay's HT-55 which boils at 55C. Possibly another fluid but 3M halted most of it PFC business in late 2022 due to some massive litigation over pollution from the manufacturing process", "label": 0}
{"text": "Got to plug in your OBD scanner to diagnose your PC.", "label": 0}
{"text": "Congrats! It’s twins!", "label": 0}
{"text": "Yup. This is the way. *\"My pool is heated -- by playing Fallout.\"*", "label": 0}
{"text": "Return one for a refund", "label": 0}
{"text": "Vision will be so degraded and still be able to identify exactly what meme it is bc the blur will look like crt version we already know and love", "label": 0}
{"text": "This is Raptor Lake, not Arrow Lake, those are two year old CPUs. The CPUs everyone is talking about is Arrow lake, the 285k, 265k etc. And this is also Chip power only, not total system power or wall power.", "label": 0}
{"text": "They wont, ur good. Have fun !", "label": 0}
{"text": "🤫 remember OP, you gotta use mineral water otherwise it wont work. I only use the best which is perrier. Other brands may cause lower fps on your RGB", "label": 0}
{"text": "I wouldn't invest in any computer with less than 16GB Ram.\n\nBesides that, I think the price is around right. A little bit overpriced but it comes with a warranty so it's kinda fine.", "label": 0}
{"text": "Link please, better send me the second one please", "label": 0}
{"text": "But bad specs with good internet can do cloud gaming", "label": 0}
{"text": "is for reasons of funny", "label": 0}
{"text": "Agreed", "label": 0}
{"text": "Actually more like  $2-300 per gallon when I was buying it while it was still available", "label": 0}
{"text": "Same thing happened to me! Ordered myself a 34inch dell monitor (was about 450). Shipping took longer than expected and eventually stated lost in transit. Asked for a replacement and was approved for one. Imagine my surprise when I come home the day of expected delivery to not just one, but two monitors!", "label": 0}
{"text": "I am in the US and the beauty of that is they passed a law that if a vendor sends you extra or something you did not order, it is considered a gift and does not need to be returned. Plus I did actually reach out to them at the time.", "label": 0}
{"text": "It's not even worth the $ for them to get it back and resell it - and it's their own fault for driving down consumer electronics margins over the past 10+ years lol \n\nThis happened to me too (different monitor)", "label": 0}
{"text": "Actually, they do that all the time - it's just that attention isn't drawn to that aspect of it.", "label": 0}
{"text": "Can you please change your keyboard to white keychron q1 max thanks", "label": 0}
{"text": "Nah, I dont find the sterile halo much fun at all.\n\n\nIf you like ADAD spamming and using precisions weapons, than infinite is your game, butbif you like the goofy physics sandbox of yore, no dice.", "label": 0}
{"text": "Looks like you won the monitor lottery.", "label": 0}
{"text": "You should have got the Corsair iCUE 4000D RGB Mid-Tower Case - so you can use ICUE to control all RGB since you already got a few Corsair RGB parts!", "label": 0}
{"text": "White tree snow live wallpaper", "label": 0}
{"text": "Meh, YMMV. Molly Maid has provided excellent service for our home. Not to knock independents though!", "label": 0}
{"text": "It looks nice. Definitely nails the 'sterile' look. Definitely not my thing.", "label": 0}
{"text": "Nzxt h9 flow", "label": 0}
{"text": "Return them, Order a new pair and wait for four.", "label": 0}
{"text": "I have tried about 10 cleaning services so far and not a single one has not broken something or left the house dirtier than when they got here. I have pretty much given up on that concept.", "label": 0}
{"text": "All joking aside, Amazon will find out and bill him accordingly ", "label": 0}
{"text": "Honestly I’d take the risk, maybe I’m crazy for that but hey if returns are allowed, it can’t rlly go that bad, right..? 🤷‍♀️", "label": 0}
{"text": "I bought a water bottle and got 2 shock collars. I have two dogs, so that was eerie AF. I would never use those on my dogs. Lol", "label": 0}
{"text": "I had the same thing happen with 2 laptops!", "label": 0}
{"text": "CTRL, WINDOWS, SHIFT & B.", "label": 0}
{"text": "What if he gets 2? Then he needs to more monitors.", "label": 0}
{"text": "I had this happen last week with 2 iPhone 15s, my partner only got a new phone 2 months ago so that’s the quickest upgrade he’s ever gotten lmao", "label": 0}
{"text": "Amazing deal.", "label": 0}
{"text": "Just return one.", "label": 0}
{"text": "https://preview.redd.it/jngnxartcywd1.jpeg?width=1290&format=pjpg&auto=webp&s=9f3d33526345edd36bc06ba9f6e13de3960bccb0", "label": 0}
{"text": "Did you diy your flooring??", "label": 0}
{"text": "Lucky fucker", "label": 0}
{"text": "good for you bro", "label": 0}
{"text": "Nice! Enjoy", "label": 0}
{"text": "I don't really think of GPUs as being for any particular resolution because not all games are equal.\n\nLike I was gaming at 4k about 10 years ago with a GTX 970, and with a 1080ti. \n\nI think it's better to just buy the best GPU you can afford, and then adjust your settings and resolution accordingly.", "label": 0}
{"text": "Lol you can tell them about it and they'll ask you to \"dispose\" of the old one.  The shipping costs are so high and margins so low on these that they aren't worth taking back even if they were able to resell it as \"new.\"  So by all means let them know - it won't matter. \n\nBut also, and more importantly, don't be a sucker.  Retailers don't give a shit about you.", "label": 0}
{"text": "> you do have to return it.\n\nYou do not have to spend money returning something you did not ask for. Shipping something is money.", "label": 0}
{"text": "Likely not novec since 3M halted most of is PFC business in late 2022/early 2023. More likely to be a Solvay product like HT-55", "label": 0}
{"text": "Bottlenecks aren't a thing. You get the power of a CPU for the CPU load and the power of a GPU for the GPU load. These loads will vary from game to game. You'll want to get the most powerful GPU you can afford for high FPS 1440p. Either a 4070 Ti Super, 4080 Super, 4090, 7900 GRE, 7900 XT, or 7900 XTX.", "label": 0}
{"text": "Return 1 for a full refund. #amazontactics", "label": 0}
{"text": "I purchased 1 pack of 2 wiz smart lights before and they sent me the retail display case containing 45 boxes of lights, 2k is smart lights. I have my whole home in smart lights now and gave away many for Christmas when it happened. Happened with a juicer I ordered off Amazon before too. Just need to get lucky.", "label": 0}
{"text": "Another \"nothing ever happens\" person - this shit happens ALL the time in ecommerce.", "label": 0}
{"text": "You do you. But I never understood this massive obsession with white. Gets dirty so easily. Not my thing but looks good.", "label": 0}
{"text": "I think you meant to say you got one delivered.", "label": 0}
{"text": "Same", "label": 0}
{"text": "Visual:\nBig fan of the color scheme.\nThe crisp clean is also a big plus.\nMouse pad is on point!\n\nSet:\nMonitor is a bit small- I use an ultra-wide curved ROG personally- so it’s difficult not using one at this point.\nNo side monitor for other apps/programs (discords, music, etc.)\nNot a fan of any wireless mouse.", "label": 0}
{"text": "Got it, thanks", "label": 0}
{"text": "Now order one desk and get two.", "label": 0}
{"text": "It shall be known as 'Lava in an ice cave'.", "label": 0}
{"text": "I have excellent karma, why does this shit not happen to me ever!?  Also, obligatory Congrats and Fuck You!!!! \n\n![gif](giphy|3ohze3kG5qO9DcTUbe|downsized)", "label": 0}
{"text": "Bluds floor more cooked than monitor", "label": 0}
{"text": "It's a facelift, not a new gen. ", "label": 0}
{"text": "https://preview.redd.it/n06s54c4dywd1.jpeg?width=4032&format=pjpg&auto=webp&s=2e3f79b8b57125ee1c0b848ae4363c14546bb1ec\n\nIn trying to achieve the same pls give me some suggestions how to reach the elites like you have", "label": 0}
{"text": "That’s why I bought it. It should ship in 4 days.", "label": 0}
{"text": "You’ll do the right thing, no?", "label": 0}
{"text": "lol no troll. brand new 32” 240Hz 4K QD OLEDS", "label": 0}
{"text": "bro wants to upgrade from a 2080Ti to a 4060\n\n  \nlmao", "label": 0}
{"text": "Its razer firefly v2 pro", "label": 0}
{"text": "They didn't ship you an empty envelope, the adhesive on the envelopes just doesn't stick sometimes, I'm an amazon driver and always find random open envelopes and small unlabelled boxes at the bottom of the bag, hate to think how many people have been excited after I hand them something only to be sorely disappointed lol", "label": 0}
{"text": "Not sure why you’re getting downvoted; nobody likes this AI generated shit lol", "label": 0}
{"text": "You do have the reasoning skills of a cabbage though", "label": 0}
{"text": "someday we’ll get lucky too. congrats", "label": 0}
{"text": "![gif](giphy|EouEzI5bBR8uk|downsized)", "label": 0}
{"text": "I thought he meant if the cpu was a 5600 vs a 5600g, the 5600 is definitely faster but not insanely", "label": 0}
{"text": "https://preview.redd.it/mwjopr1gdywd1.jpeg?width=1170&format=pjpg&auto=webp&s=bc9b79c2a22830f026e2ab8ff127f21ceda97afc", "label": 0}
{"text": "I changed to a 32\" from an ultrawide to game on for similar reasons. I felt I was unable to really pay attention to things happening on the sides of the screen well enough and it effected my ability to play. Still use it for general use/work tasks, though.", "label": 0}
{"text": "If you are in the U.S. they cannot charge you for the duplicate item after sending by mistake. The second one would be an unordered item, and per FTC they cannot charge you for the item or force a return. The consumer is under no obligation to pay for the unordered item, or to return it.", "label": 0}
{"text": "Why post this lol.", "label": 0}
{"text": "Well, it's still in the box, so not well so far.  Let us know once it's assembled and has a post.", "label": 0}
{"text": "If you switch houses, you'll be golden 👌", "label": 0}
{"text": "in that case, congratz", "label": 0}
{"text": "I can answer this!\n\nThere are people who do no cleaning and have a service do everything but that's expensive. That's also not what people do mostly!\n\nMost people who use a cleaning service pay them to come in once in a month, weekly, biweekly etc. They're not there every day, and they're mostly there for a more specific clean, a deeper clean! These people do clean up after themselves but the service will do shit like clean the walls, lug a steam cleaner around. They're paid to be meticulous not just clean. They will also do cursory cleaning of everything with more of a focus on fine details as the general cleaning is a quick process.  The process here was just wiping and polishing yhe desk real fast. They're more worried about both sides of windows, baseboards, steam cleaning a bathroom, etc. They're not generally there for the desk.", "label": 0}
{"text": "A ‘friend’ ordered a £2k iMac on Amazon. It was delivered and a week later refunded because they lost it.", "label": 0}
{"text": "are you inside an igloo? 10/10 tho really \"cool\"", "label": 0}
{"text": "0", "label": 0}
{"text": "11/10 love the white lighting", "label": 0}
{"text": "TCLs are such garbage", "label": 0}
{"text": "treyarch is the only reason i buy call of duty games anymore", "label": 0}
{"text": "Maybe I should give it a try then", "label": 0}
{"text": "I call bull 💩", "label": 0}
{"text": "https://preview.redd.it/c877m5amdywd1.png?width=1080&format=pjpg&auto=webp&s=b75f4b7653f9594b3e147202be5e4fbc5fee6093", "label": 0}
{"text": "Last night I updated windows and turned off my PC. Ever since, whenever I try to boot it, it gets stuck in the booting process of the GPU fans turning on and off and doesn't display anything. I tried resetting CMOS by shorting the pins but that didn't help. I'm a bit lost. Is there something I can do?", "label": 0}
{"text": "I had to replace a monitor from Alienware - it was the aw3418.  After troubleshooting they said they would send a replacement.  I ended up with two aw3821dw and tried to explain to the customer team what happened - they just said it was fine.  \n\nMaybe it is a sign for you too!", "label": 0}
{"text": "Profit? ", "label": 0}
{"text": "The people who do the design of the building, power, cooling, and integrate all of the systems and monitoring mostly work from home.", "label": 0}
{"text": "Return one, keep one for free 😂", "label": 0}
{"text": "Congratulations- say thank you. Wait a month in case they pick it up and then sale the second one on EBay", "label": 0}
{"text": "Grandma knows what is good...", "label": 0}
{"text": "Happened to me before but it was because I was charged twice even though my first order was canceled but they shipped it to me and charged me for it anyways. I tried to fight amazon for a refund for months and it never got resolved and so I gave up.", "label": 0}
{"text": "just got the same monitor, it is very nice enjoy it!\n\nas for conserving space the stand is ass so if u plan on keeping both i would look into getting a mount", "label": 0}
{"text": "how did you come up with your name lol its funny af😂😂", "label": 0}
{"text": "Shit I don't let my wife clean my computer for that reason alone.", "label": 0}
{"text": "Also side note, odds are the driver knew one of the monitors was a duplicate and delivered it anyway, so massive respect for that", "label": 0}
{"text": "I know its not related but i love the bloom into you pfp.\nI recently finished the manga and if you have not done so yourself you neeed to reed it.", "label": 0}
{"text": "Makes sense, you must need to shave it bald to see such tiny prick you are. :) ", "label": 0}
{"text": "That feels like a big miss from a professional maid.  Its pretty common knowledge that cast iron cant just be washed with soap and water the same way you could another pan like Teflon or stainless steel.", "label": 0}
{"text": "Return (one), get refund. Keep other", "label": 0}
{"text": "Bonerific.", "label": 0}
{"text": "Praise be to the omnissiah", "label": 0}
{"text": "Should return one.. Amazon is barely getting by!", "label": 0}
{"text": "What solutions do you all recommend for top of desk cable management?  I have 3 type Cs, an old apple lighting cable that all get regular use on top of my desk for charging various devices, but when they're not in use, I don't have a great solution for them other than jamming them to the back of the desk behind a side monitor.  I'd prefer something a little more organized and clean looking.", "label": 0}
{"text": "Man, i just bought 2. If i don't get at least 3, I'm calling", "label": 0}
{"text": "I don't know what this new Intel CUMMM thing is but it doesn't seem to be working out for them", "label": 0}
{"text": "Thanks for the tips.  I will try the repair", "label": 0}
{"text": "Show us the inside. Don’t be shy", "label": 0}
{"text": "Its not that bad, try to bend them back really carefully.", "label": 0}
{"text": "Yes you should absolutely have them compensate it. This is ridiculous. What kind of maid service do you run where they go out of their way to clean the computers? Anyway? I have never had a maid service/ janitorial staff in an office that would do that. We hire specific people to clean computers.", "label": 0}
{"text": "Intel 13 and 14th gen avoid like plague!!!!!\n\n\nThose are doomed processors. Read the news.\n\n\nAlso. Look at lenovo gaming laptops.\n\n\nAvoid acer, asus and cheap hp gaming laptops.", "label": 0}
{"text": "Someone explained they have to context the company (the seller) and they pay for shipping to get it back.", "label": 0}
{"text": "Nice one congratulations what are you planning on doing with the second one?", "label": 0}
{"text": "I love that for you but I also hate you lmao you have thoughts on what you'll do with the extra (if Amazon doesn't ask for it back?) 32\" is hard to do double screens with (not to mention drive)", "label": 0}
{"text": "It's also an easy write off.", "label": 0}
{"text": "No, he is not CEO, I'm a African prince who want to give you 50% of a transaction if you send me one of this cheap monitors", "label": 0}
{"text": "2 screens are bis", "label": 0}
{"text": "I’m realizing now that I wish I knew that this kind of case existed. It’s sooooo nice", "label": 0}
{"text": "Yeah no. Desk, jewelry boxes, etc seem like something they don’t really touch.", "label": 0}
{"text": "Laptops should not come with 8gb of ram in 2024, other than that it's priced correctly, whether a \"deal\" or not is if it fills your use case.", "label": 0}
{"text": "TIL some people don't know you can disable copilot and that recall was canceled.", "label": 0}
{"text": "just wipe it off you baby", "label": 0}
{"text": "You got *one* delivered", "label": 0}
{"text": "Notice how you're the one that said. You act like they're going to steal something.\n\nYou gave your opinion, implying that he was referencing them as being thieves.\n\nThe negative reaction that you're receiving is directly stemming from that.\n\nNo kidding, when you hire a maid service, you walk them through the house and talk about what expectations are. It's no different from anybody else that you hire for any other job.\n\nI gave my opinion.\n\nThat directly relates to the reality that the value of what is sitting on my desk is worth a fair bit more than one day's worth of cleaning. \n\nI can say, at least from the commercial standpoint, the turnover in a lot of cleaning service positions is relatively high. So the individual that I share my expectations and do's and don't most likely will probably not be there in a week or a month.\n\nSo I hold extremely firm to the idea that it's not fair for them, and it's not fair for me to have them cleaning by or cleaning something that has that value.\n\nCertainly, 9 times out of 10, you're not going to have any issue. But it just takes one time, and suddenly, that work relationship is going to have an extremely bumpy road, and it's not going to be positive on either side.", "label": 0}
{"text": "Came for the Floor-Comments.\nWas not disappointed.", "label": 0}
{"text": "I said Pentium D three times in a row in the past and it still haunts me.", "label": 0}
{"text": "he just needs to wipe it off, really not a biggy", "label": 0}
{"text": "There's also green on the roulette...", "label": 0}
{"text": "Totally fine yeah 👌😅😉", "label": 0}
{"text": "I'd just deal with it and save up for a 1440p oriented card and a 1440p monitor. \n\n1080p at 27\" has pretty terrible pixels per inch, it can start to look pretty blocky in certain areas, especially text on the screen, things like that. And if you *did* just buy a 27\" 1440p monitor and not upgrade your GPU, you'd have to play games natively at 1080p on a 1440p display, which can have a \"blurry\" effect because translating the image isn't perfect, but you can also use upscaling to 1440p which looks a good amount better than running 1080p on a 1440p display.", "label": 0}
{"text": "with what GPU? If you have your monitor connected to the GPU, its possible the BIOS output is happening on the iGPU instead, or vis versa. It would be a good idea to try booting with the GPU removed entirely. \n\nUnfortunately this board doesnt appear to support USB BIOS Flashback so thats a bummer. But the green Boot light usually means its not bricked.", "label": 0}
{"text": "My luck got used up with 20 metal joinery brackets which was kinda cool except I only needed 4. An extra GPU sure would've been neat.", "label": 0}
{"text": "check ur bill, happened to me. I was billed twice", "label": 0}
{"text": "🤔", "label": 0}
{"text": "Is the VGA and boot stuck on when restarting?", "label": 0}
{"text": "I was going to say this is old. Looks cool until you price out the liquid.", "label": 0}
{"text": "On my old system my 4790k was half knackered and it would bootloop for ages before it would start up, but then once it booted it would run perfectly. So I'd just put it to sleep every night instead of shutting it off. \n\nBesides that I don't think there's a good reason to keep it on. Especially with Windows randomly waking the PC from sleep to \"do stuff\" even when you have all the wakelocks disabled..", "label": 0}
{"text": "Thank you! Bloom into You is amazing, true. I've read the manga and watched the show, and I also have the physical tomes on my shelf, both in English and Japanese languages. :)", "label": 0}
{"text": "That’s not that bad, I’ve fixed a few that have a lot more bent pins, magnifying glass and a razor blade is your friend", "label": 0}
{"text": "LPT: if you are dissatisfied with a product, leave a review expressing that. if the item does not meet the listed specs, ask for a partial refund from amazon.\n\ni have gotten several free/upgraded products by doing this. not on purpose. for example:\n\n\\- bought a vacuum sealer on amazon, it had capacitive touch buttons. these were frequently activated on accident by the process of vacuum sealing something. i left a 2 or 3 star review, and the seller sent me the upgraded version which has physical buttons. \n\n\\- bought a power bank on amazon, it claimed to be 100whr. i measured it to be 60whr. i asked for a 40% partial refund since the capacity is 40% lower than advertised. i expressed that i wanted to keep it because it worked fine, but i wanted a discount since its not as advertised. they said they could not do a partial refund, and gave me a full refund without requiring me to send the item back.", "label": 0}
{"text": "Hi, my rabbit called and said he wants his monitor back now. Pls DM for shipping address.", "label": 0}
{"text": ">Now switching games back and forth between different storages looked kinda difficult.\n\nHow did you do it ?  \nI find the process that Steam uses now rather streamlined : https://help.steampowered.com/en/faqs/view/4BD4-4528-6B2E-8327#move\n\n>It’s running so smooth and beautiful right now\n\nThat’s good to hear !\n\nOut of curiosity, Wukong is still on the HDD ? If so, can you confirm that it still runs poorly, which would 100% validate that the HDD was the issue, and not - say - XMP or the chipset drivers ? ", "label": 0}
{"text": "Take your time and don’t rush anything\n\nSpread the building process over a couple of days if you have to", "label": 0}
{"text": "Damn I try hard for that grade A+ cunt on Reddit. Guess I will have to settle with just A on this one :(", "label": 0}
{"text": "Right the seller has to pay for the shipping.", "label": 0}
{"text": "Clean! Well done!", "label": 0}
{"text": "Asus motherboards do this not intel, other motherboards still deliver all power on the 12v rail so measuring that is still accurate.", "label": 0}
{"text": "Hyperscalers could implement the same process for hot/hotter aisle DCs where techs are only allowed in for 15-20 minutes at a time. Wait until X% of the rack needs maintenance before draining the entire rack (of customers), replacing racks like-for-like, and doing maintenance on the decommissioned rack as the next spare.", "label": 0}
{"text": "You need to learn the fine art of keeping your mouth shut", "label": 0}
{"text": "That’s like winning the lotto", "label": 0}
{"text": "Man I’d imagine. I went with the Lian Li O11 Dynamic. Nearly the same thing but I love glass angle on the front there. Makes it look so much slicker. What case is that anyways? Maybe down the line I’ll rebuild my computer from scratch again lol", "label": 0}
{"text": "Thank you !", "label": 0}
{"text": "Fucker.", "label": 0}
{"text": "Shh, quiet, Amazon doesn't have to know ...🤫", "label": 0}
{"text": "Time for a bigger desk", "label": 0}
{"text": "damn this is the monitor i wanted op lucky", "label": 0}
{"text": "gonna place my amazon orders around holiday so theres a higher chance of fuck up from them being worked into the ground", "label": 0}
{"text": "But cloud gaming makes me wish I was never born.", "label": 0}
{"text": "Customers do not work for amazon. You do not have to spend your time working for them for free handling their errors.", "label": 0}
{"text": "Buy a desk mount", "label": 0}
{"text": "nah I accidentally put your adress when I ordered mine, can u send it to me?", "label": 0}
{"text": "Someone else on one of the comments said this doesn’t hold true to duplicates of the same order. I don’t know anything about any of it, but if that’s true it may not apply to OP or anyone else in the US. Of that isn’t the case, please correct me if like to know for sure even though I don’t order anything from Amazon or except on rare occasion lol. It’s just better to know what is and isn’t legal even someone chooses to do what might be considered illegal anyways.", "label": 0}
{"text": "Hyte Y70! They have a similar option called the Y60 which is a bit smaller. This one is the Strawberry Milk color", "label": 0}
{"text": "One for desk, other for bed.", "label": 0}
{"text": "https://i.redd.it/5929un4xeywd1.gif", "label": 0}
{"text": "I had Amazon deliver my monitor one afternoon with a picture of my neighbors porch. I filled a complaint and got another one sent. 2 weeks later my neighbor brings it me saying \"Hey I got something of yours\"", "label": 0}
{"text": "You’ve got it backwards here, if they send you two of something you ordered then you can keep it. If they send you something you didn’t order as an honest mistake then you need to return only if they are willing to pay and make it easy for you.", "label": 0}
{"text": "4pp", "label": 0}
{"text": "Ok I’ll definitely try that. I’m not super knowledgeable about monitors. How would I be able to tell if the monitors are “damaged?” Besides any obvious dead pixels, but curious how obvious it would be if the anti-glare was damaged. Thank you for the cleaning advice btw!", "label": 0}
{"text": "Correct, if necessary their arrangement for shipping would include picking it up from your house.", "label": 0}
{"text": "Honestly - get a clamp mount for one, sit it vertical to the side of the other.", "label": 0}
{"text": "Clean them off", "label": 0}
{"text": "so they serve no troubleshooting purpose, i can believe that. thanks for pointing it out.", "label": 0}
{"text": "100% has a 4090, with custom loop and a 7950X3D.", "label": 0}
{"text": "Mine was President's Day. \n\n\nOrdered a premium mattress, well everybody bought that one. \n\n\nSo i \"reluctantly\" accepted a $700 upgrade and they also gave me a complimentary sheet set for the \"inconvenience\".", "label": 0}
{"text": "The other guy got two, sorry, mate. He definitely didn’t take it off your porch, by the way.", "label": 0}
{"text": "Depends if you want the second monitor. Personally if you don't, I would start a return. Send the monitor back, get a refund and keep the spare.\n\nThey won't reach out.", "label": 0}
{"text": "Just don't use the other for a couple weeks or months, happened with a friend and the xbox one when it came out they got sent two and amazon never found out", "label": 0}
{"text": "Worst floor i’ve seen in my life", "label": 0}
{"text": "I already have a car, no thanks.", "label": 0}
{"text": "Looks good for sure. How’s the temps and airflow? Especially the gpu.", "label": 0}
{"text": "I think I know who has your monitor. https://www.reddit.com/r/pcmasterrace/s/vGwpssgGH1", "label": 0}
{"text": "NGL I sometimes feel I miss out on some productivity. Unzipping stuff is painfully slow as are some other operations. Of course I don’t care that much, as it blows every thing away in gaming. \n\nBut man, those 9000x3D look juicy. Will probably be expensive AF, but 12 or 16 cores with 24/32 threads and all with 3D cache? Yummy. This is server level numbers. Can’t wait to see the benchmarks. I guess it will be diminishing returns unless games can use all cores and that heap of cache but still. \n\n\nOh and can’t wait until someone runs win98 or xp from cache. 😂 didn’t I see a video about that somewhere?", "label": 0}
{"text": "The biggest change here to hide the monitor cable behind the monitor arm, mine comes with socket for wire. Zip tie works too, when you hide the cable it gives your monitor a floating look. And remove everything that doesn’t belong there. Try it and keep me updated", "label": 0}
{"text": "My first job was a housekeeper and one of our clients would show us around the house before we begin so he can show us what NOT to touch. Never had any problems with that guy.", "label": 0}
{"text": "Just curious, why though? Will OP face any issues with the way it is?", "label": 0}
{"text": "https://preview.redd.it/j74wcc85fywd1.jpeg?width=400&format=pjpg&auto=webp&s=ce77737ef54e4db670aee9bb26a9ff73242c3407", "label": 0}
{"text": "bonus!", "label": 0}
{"text": "Nexusmods", "label": 0}
{"text": "Well here is your opportunity to make a new friend", "label": 0}
{"text": "No *that's* backwards. If you get something unsolicited, that's treated as a gift. If it's a shipping error, they are allowed to either charge you or they can pay for return shipping.", "label": 0}
{"text": "Fake. Impossible.", "label": 0}
{"text": "Yeah but the 4000 series has so many more features. If it was a 16gb 4060ti then yeah.. I'd do it..", "label": 0}
{"text": "Last time I tried Prime, it worked on Linux, but that was a couple of years ago.  I am curious if I'd get that same page if I tried.\n\nF Prime Video, you get ads even after paying.", "label": 0}
{"text": "Brother those are some fire pc specs 🔥", "label": 0}
{"text": "Only XMP was enabled (is that bad?) No I haven't cleared the CMOS yet. Thank you", "label": 0}
{"text": "As a PCB technician I can safely say YES it is repairable.", "label": 0}
{"text": "Not even close to impossible considering this has happened to almost everyone I know. I’m not sure how Amazon is still in business with how shit their warehouse system is.", "label": 0}
{"text": "Damn nice. Only time I got this kind of luck was when I ordered a decently good surge protector power strip and instead got a box of six of them.", "label": 0}
{"text": "Okay, this actually caught me off guard 🤣", "label": 0}
{"text": "It wouldn’t look so ridiculous if you had some optical disk drives in there to take up that space.", "label": 0}
{"text": "hahahaha", "label": 0}
{"text": "oH NO, you will have to buy an extra DP  cable!", "label": 0}
{"text": "This is PCMR not RPMR", "label": 0}
{"text": "This is page 232 in a book I'm writing called \"Stuff That Never Ever Comes Close to Ever Fucking Happening to Me\".", "label": 0}
{"text": "🤔", "label": 0}
{"text": "every time i see an “ordered one, many came” post like this i ask out loud when its gonna be my turn", "label": 0}
{"text": "Fun build! I would love to show up with it to a LAN party.", "label": 0}
{"text": "i just want my torrents to keep seeding", "label": 0}
{"text": "who needs to spend money on the PC when you can spend it on the peripherals", "label": 0}
{"text": "And the funniest part is that our kids will be shaking their heads wondering why we are laughing our arses off at smudges on the screen without realising that we know exactly what meme it is because we have seen it that many times...", "label": 0}
{"text": "Y’all really should stop posting about this stuff, gonna ruin it for the rest of us at some point…..", "label": 0}
{"text": "You laid your flooring the same way I built LEGO houses as a toddler", "label": 0}
{"text": "Oh dang, that’s pretty good. Great build tho 👌", "label": 0}
{"text": "still doesn't seem right. is this written in law somewhere?\n\ni should not be required to spend my own time fixing a mistake that a company made, and i also should not be required to hold the item while I wait for a shipping label or something.\n\ncrazy example: i order a new mattress. i receive three of them. company says that they will send someone to pick them up in a month. i should not have the burden of holding on to two extra mattresses for a whole month, I should be allowed to put them on facebook marketplace for free to get rid of them.", "label": 0}
{"text": "Lol! Thank you 😊", "label": 0}
{"text": "Yeah DHL in Europe seems pretty good", "label": 0}
{"text": "The reason i dropped BO3 was this shit", "label": 0}
{"text": "Thanks !", "label": 0}
{"text": "Oh man, it sucks!!!!", "label": 0}
{"text": "![gif](giphy|10ltVBrN9bO5d6|downsized)", "label": 0}
{"text": "https://preview.redd.it/ofcms0bnfywd1.jpeg?width=1138&format=pjpg&auto=webp&s=6bea61d7e0a897bebe29d36fe7270d7dc4b7709f", "label": 0}
{"text": "Works now I had to install retilek r drivers", "label": 0}
{"text": "I need a new monitor. Hook a brother up❤️", "label": 0}
{"text": "When you have long seams like that, there is an easier chance to pull them up via snag or shifting", "label": 0}
{"text": "That's awesome! 😂 I don't know if it's the smartest to post it on social media though 🤔", "label": 0}
{"text": "Happy for you. That's fantastic. Very lucky.", "label": 0}
{"text": "It's just polish, mate. Get some screen spray and a micro fibre cloth and wipe it off.", "label": 0}
{"text": "My partner ordered a tv from Best Buy and got two one time. I ordered a game and got an x box.\n\nThese mistakes do happen.", "label": 0}
{"text": "Tbf it is pretty unlikely for that to cause 2MB/s speeds. E.g. my router allows selecting either 100MBit/s or 1GBit/s for all LAN connections individually. 2MBits for LAN would be last century speeds.", "label": 0}
{"text": "I once bought a packet of cigarettes from a vending machine at my Uni bar.  \n\nI didn’t get any cigarettes but I did get all the cash in the machine.  It happens.", "label": 0}
{"text": "I’m not trying to be mean, but what do you not get? People have been doing this when Amazon makes a mistake for years.", "label": 0}
{"text": "This meme would make sense if I had friends", "label": 0}
{"text": "Small claims court exists for just this type of scenario. \n\nShould definitely still give them the option to remedy the issue first, though.", "label": 0}
{"text": "Throw all the components in a box, shake, and everything will be plugged in.", "label": 0}
{"text": "Sick! I have those speakers in black and they’re great", "label": 0}
{"text": "My sister ordered 2 monitors, one was a little broken so she sent for a replacement one. They sent her 2 again and never asked for the extra, so i'm about to have a dual monitor setup myself with the extra one lol. It's just a blessing it was the exact monitor that I already have.", "label": 0}
{"text": "I got more viruses from \"ads\" on legit sites than from grey-zone sites. Think about it.\n\nYour data is being sold by the \"legit\" industry because you clicked 'yes' when signing up. That's why some services are so cheap, we are the capital.", "label": 0}
{"text": "8.5/10. Needs a white keyboard cable to seal the deal", "label": 0}
{"text": "well then who is closing them back up before they are delivered??\n\ni received an empty envelope one time, it was sealed just like a regular envelope. so either they shipped it empty, or somebody saw that it was opened and then just closed it without even checking to see if there was an item inside..", "label": 0}
{"text": "Twice de fun (also power bill)", "label": 0}
{"text": "The data center itself wasn't filled with liquid though, it was a closed unit underwater.\n\nIt also wasn't anywhere near the bottom of the sea btw, just a few meters underwater.", "label": 0}
{"text": "Yeah, that’s much more aligned to your assertion. By that alone I would agree with you.\n\nHowever, I still don’t think it’s right. I found this on the legal stack exchange, specifically the second comment on this answer\n\nhttps://law.stackexchange.com/a/17540\n\nI’m not a lawyer and can’t argue further but it seems that the relevant law prohibits trade practices and not honest shipping errors\n\n> constitutes an unfair method of competition and an unfair trade practice in violation of section 45(a)(1) of title 15.\n\nhttps://www.law.cornell.edu/uscode/text/39/3009", "label": 0}
{"text": "Just take the L", "label": 0}
{"text": "Hard surfaces are easily clean just by wiping with tiisue paper", "label": 0}
{"text": "Omg that sapphire pure speaks to me! Been debating selling my non xt 6800 to help ease the cost of a 78xt or 79 gre card", "label": 0}
{"text": "Yet you still bought it knowingly. Why are you complaining then? People keep buying their shit so they are gonna keep making shits.", "label": 0}
{"text": "10/10\n\nim a sucker for minimalistic white builds", "label": 0}
{"text": "Now you have two for the price of one, which is basically a 50% discount. But if you return it and get your money back, you have one for the price of zero, which is a 100% discount.\n\nWhat's the better deal?", "label": 0}
{"text": "idk my friend got sent two laptops by amazon before and got to return one of them for full price it’s not that crazy of a chance to happen", "label": 0}
{"text": "…..bro were full of people that put disco lights into our cases just for the looks of it.\n\n\nA custom PC cases like this is highly sought after in the hobby and can fetch a pretty penny.", "label": 0}
{"text": "You can absolutely fix that with tweezers, just be extremely gentle not to break them off or bend any other ones", "label": 0}
{"text": "no the gojo statue what name is that?", "label": 0}
{"text": "The US [Federal Trade Commission](https://consumer.ftc.gov/articles/what-do-if-youre-billed-things-you-never-got-or-you-get-unordered-products):\n>By law, companies can’t send unordered merchandise to you, then demand payment. That means you never have to pay for things you get but didn’t order. You also don’t need to return unordered merchandise. You’re legally entitled to keep it as a free gift.\n\nAmazon can reach out, but you don't have to reach back. Slap that hand! \"No!\"", "label": 0}
{"text": "That’s the joke", "label": 0}
{"text": "It absolutely can, but tiles are laid with grout or caulk that helps keep them stable, but also still need maintenance over time.", "label": 0}
{"text": "A friend of mine once ordered a TV on Amazon. It was marked as delivered, but nowhere to be found.\n\nHe contacted customer support, and they send him a new one. Took a couple more days but eventually arrived. One day later the first one arrived too", "label": 0}
{"text": "You can look ok around, but there are scenarios in which enabling FG will actually reduce performance on a 4060 because of the 8 GB frame buffer.", "label": 0}
{"text": "Well if that's the case, maybe its the oxidation/overvoltage issue known to affect 13th and 14th gen. Sounds like RMA time.", "label": 0}
{"text": "My friend once bought a $4k table saw from them and when it got delivered to him it was missing 2 rails for the table extension… not a big deal. Well, he called Amazon and they said since it was +600lbs and they can’t sell the parts individually that he could keep it and they sent him another one…. the rails that were missing came the same day as the new table saw with all the parts.\n\n\nGuess who got a $4k table saw for $500 in freight charges? Me!", "label": 0}
{"text": "At least you dont have to worry about constant upgrading. No more unoptimised GPU greedy games.", "label": 0}
{"text": "yeah i’m pretty happy to have just had a free £990", "label": 0}
{"text": "happened to me before, i used a box cutter blade to straighten the pins and it worked pretty well", "label": 0}
{"text": "why can't I ever get this lucky.", "label": 0}
{"text": "I only see one in this picture if anyone asks 😉", "label": 0}
{"text": "Nice, congrats.", "label": 0}
{"text": "Well today I learned to make sure I nitpick about all the annoying parts of shit I buy on Amazon", "label": 0}
{"text": "2 choices here\n1. Return one of them, now you have a free monitor\n2. Get a multi-monitpr mount", "label": 0}
{"text": "Dawg what did he say", "label": 0}
{"text": "Found this:\nhttps://www.reddit.com/r/pcmasterrace/s/bNIjyrZBmn", "label": 0}
{"text": "They wanted Qualcomm because Apple was crushing X86 with their M series efficiency, even if windows was perfectly optimized the efficiency gap between first gen M1 and everyone else was huge when it released, AMD made big strides to reduce the gap but it's still not even close. The only way Windows laptops nowadays match the battery life of macbooks is by simply including a larger battery, the efficient is not there yet on windows.\n\n\n\n\nThe Ryzen AI 9 series is AMD's most efficient laptop chip and it idles at 3w, and draws up to 20w in single core workloads, meanwhile Apple M3 idles at 0.7w and only needs 8w or so to beat AMD, Apple M1 draws just 4.5w(!) Meaning even tho it has lower performance It's still more efficient than 4nm X86 chips designed for efficiency. High Multi core is useless on thin and light laptops and laptops in general, nobody is gonna hit 20 threads at once, the performance of each thread per each watt is the most important metric.\n\n\n\n\nIntel lunar lake solved the idle power draw for X86 and sits at just 0.7w, but still draws around 13w in single core tests while losing to M3 at 8w. And M3 is a last gen product mind you.", "label": 0}
{"text": "That's most of the stuff posted on here. I just treat them like meme posts now.\n\nAmazon sent you an extra $5 cable? An extra bottle of detergent? OK, it happens. \n\nNot on items with serials on them. Even AliExpress notes the serial of the controller you order from them so you can't return it with something else.", "label": 0}
{"text": "RDP woudln't work well at all. VNC might be a little better but you should look into something like Steam Remote play.", "label": 0}
{"text": "![gif](giphy|3ohuAsQcmrk3c8XgMU)", "label": 0}
{"text": "Just return it if you arent going to use the second one. Youll end up getting a free monitor at that point", "label": 0}
{"text": "Good for you and we don’t care", "label": 0}
{"text": "Found this:\nhttps://www.reddit.com/r/pcmasterrace/s/nLoLKDa5rm", "label": 0}
{"text": "1% better performance for only 2x the costs and maintenance.", "label": 0}
{"text": "https://preview.redd.it/jz8iu1fqgywd1.jpeg?width=1284&format=pjpg&auto=webp&s=ce2ab2e3ae0e45b1f834dc8c4c3d512bd952f7f3", "label": 0}
{"text": "Cool stuff, but it's difficult to implement as there are hundred of various pc cases. Also how do you plan to implement your designs considering most cases have glass panels, some with multiple glass panels. No doubt in my mind you could create some cool stuff, but it's going to be ridiculous expensive in a nish-market.", "label": 0}
{"text": "There’s an excellent chance Amazon didn’t own those monitors", "label": 0}
{"text": "9.8", "label": 0}
{"text": "Or, hear me out.. return one for a refund. And keep the extra at no cost 😤", "label": 0}
{"text": "100 degress or above should be worried.", "label": 0}
{"text": "Something similar happened to me a few years ago. Amazon sent me an extra of what I ordered.  They asked for it back 3 months later or they'll charge me full price for it. Just FYI.", "label": 0}
{"text": "5800x3d will do great with a 7900xtx on 1440", "label": 0}
{"text": "Apparently the 4070 is where it starts to get good.", "label": 0}
{"text": "Lord, I’ve seen what you do for others…", "label": 0}
{"text": "H5 flow 2022 front fans are a little weird so double check them", "label": 0}
{"text": "If u need it...", "label": 0}
{"text": "Did you buy Gojo with those headphones or buy them separately lol?", "label": 0}
{"text": "I only ever get the completely wrong item. Most recently it was a hat and they sent me an inflatable football mat.", "label": 0}
{"text": "Technically 14900k with 7200Mhz memory + nuclear power plant is the fastest gaming CPU", "label": 0}
{"text": "Any card with <insert GPU model here> perform much the same that all the other cards with <insert GPU model here>.\n\nThe main difference between cards come from cooler performance (how hot and loud the card gets under load) and design/dimensions.\n\nThere are lots of other small differences (number of required power connectors, number/types of video outputs, special features, etc.) but the 2 above are those most people will worry about.", "label": 0}
{"text": "The ultimate 0ns monitor /s", "label": 0}
{"text": "7/10.\n\n\nIt is not uncomfortably clean. It is going for clean but fails due to clutter. Get rid of the figurines, they add nothing here. Manage the black wires on the right side. Remove the clutter from atop the PC case.\n\n\nThe monochromatic scheme is sabotaged by a purple and green cord, violating the whole idea.", "label": 0}
{"text": "it mustve been nuts for that aggressive response lmao", "label": 0}
{"text": "Sounds like u are salty. My old computer broke, so I upgraded. That simple 🤷‍♀️", "label": 0}
{"text": "Instantly goes into the garbage, im not trying to fix this.", "label": 0}
{"text": "Grats!", "label": 0}
{"text": "How many of these posts since the pandemic where people order 1 stick of RAM and get sent 100, or somebody order 1 monitor and gets 2, are actually real? I've purchase shit from Amazon for decades, never had an order appear with anything other than what I ordered.", "label": 0}
{"text": "I'm sure there is a JJBA game somewhere.", "label": 0}
{"text": "If you don't return it they will go after you in court. The, if you mail me something I can just keep it, doesn't apply here.", "label": 0}
{"text": "What you oughta do is return one saying you found a working one then keep the other.", "label": 0}
{"text": "\"Every time\", the 5800x3d released late april 2022..... looking from a 5800x that came out late 2020, pathetic.", "label": 0}
{"text": "Tiny mousepad detracts. Headset is nice (totally not biased for using the same in that color spec).\n\nPersonally would go for a hardwood tabletop and drop the mouse pad entirely (trade secret, hardwood sanded but kept open pore without surface treatment is actually better than any mousepad and doesn't degrade over time either).\n\nAppreciation for the color trim detail of the green keyboard cable, tho I think it is perhaps a little too anonymous and has to fight for its right to attention. A more standout color may have offered a more confident look given that it has to be a standalone color and isn't coordinated with anything else. Like orange or red or yellow. Minor point though, the thought (which I presume is intentional) is nice.\n\nOverall great commitment, with some room to add the final flair if desired.\n\n8.75/10", "label": 0}
{"text": "WSB bleeding over", "label": 0}
{"text": "Chemical reactions. Depends on how strong the solution is, and if it's reactive to the coating.", "label": 0}
{"text": "Happy birthday !", "label": 0}
{"text": "The only time I’ve ever received a dupe from Amazon was when ordering a bottle of rubbing alcohol years ago, and I still have 1 3/4 bottles left", "label": 0}
{"text": "I got tired of this problem, 14 gen is on the way, thanks for the help", "label": 0}
{"text": "it runs nice and cool, the front and bottom fans are 140mm", "label": 0}
{"text": "Just remember, have fun with it!\nGood luck! ♥️", "label": 0}
{"text": "I have a 4070 Super and it is a great card for 1440p. I don't know what you're talking about?", "label": 0}
{"text": "sorry 50gb.", "label": 0}
{"text": "Have you updated your drivers?\n\n40-60fps seems low already, are you running ECO mode on your 5700X, and what resolution are you running?", "label": 0}
{"text": "This happened to me also, i got an amazon echo on prime day and got 2 when it was delivered.", "label": 0}
{"text": "https://itch.io/games/tag-dating-sim/tag-lgbt\n\nYou're welcome.", "label": 0}
{"text": "Return 1 for reimbursement?", "label": 0}
{"text": "That flooring has to be a landlord special", "label": 0}
{"text": "Heat pumps", "label": 0}
{"text": "I ordered a fuel filter for my truck. It was 8 dollars. I recieved one case of fuel filters. I now have about 150 fuel filters for my truck. I change them out for funsies sometimes.", "label": 0}
{"text": "Hey just saw they delivered mine at your house, i will swing by and pick it up thanks", "label": 0}
{"text": "Only 1 side monitor? You should get a 2nd having 3 monitors is the way forwards.", "label": 0}
{"text": "Maybe it's a cultural thing but over here I some maids didn't even know such technology even existed, not to the mention the special care they need.\n\nI could be wrong but over here if something needs special treatment you have to tell the maid.", "label": 0}
{"text": "You need to also drop the boiling point, so throw in some vodka. Bonus tip: The vodka with the gold flakes would have more thermal mass.", "label": 0}
{"text": "Peak", "label": 0}
{"text": "10", "label": 0}
{"text": "My friend ran into this with a desk chair, so they tried to explain to Amazon what happened out of the goodness of their heart. Amazon fucked up even more, started a return on the one in the order. It finalized and showed up as returned a week later. They never even got the paperwork or sent it in, got two chairs for free.", "label": 0}
{"text": "Thank you, _raiyan_. Unfortunately, your submission has been removed for the following reason(s):\n\n* **Rule #1** - Harassment of others is forbidden. We will not tolerate any kind of incitement to action against anyone, nor the posting of information that can be used to harm others (celebrities or not).\n\n  [More information about Rule 1](https://www.reddit.com/r/pcmasterrace/wiki/rules#wiki_rule_.231)\n\n* **Rule #2** - This post violates [PCMR Etiquette](https://www.reddit.com/r/pcmasterrace/wiki/etiquette). We will not allow behavior contrary to it, e.g. brigading, witch-hunting, asking for upvotes or downvotes, enabling piracy, flamebaiting, clickbaiting, intentional rudeness, text spamming, using all caps or emojis/smileys/emoticons in titles or overusing them in comments, meta-reddit or meta-subreddit drama or complaints.\n\n  [More information about Rule 2](https://www.reddit.com/r/pcmasterrace/wiki/rules#wiki_rule_.232)\n\n* **Rule #4** - Images/screenshots of Reddit, Facebook, Youtube, and other sites' comments should have the usernames and other personally identifiable information blacked out (including yours). Celebrities are the exception, as long as you respect rule #1.\n\n  [More information about Rule 4](https://www.reddit.com/r/pcmasterrace/wiki/rules#wiki_rule_.234)\n\n* **Rule #6** -  The following will be removed at moderator discretion:\n\n  * 6.1: Content that is unrelated, especially unoriginal, low quality, or low-effort (including, but not limited to: simple website/software bugs, steam/product reviews, comedic product/system specs, steam gift messages, screenshots of conversations, internet speed test results, negligible price reductions, items that aren't PC related, even if they are named similarly or resemble it, online petitions and surveys).\n  * 6.2: Pictures of purchase or shipping related notifications and information.\n  * 6.3: Blatant reposts/fad-chasing.\n  * 6.4: Reaction images/gifs (unless very high-effort/especially original).\n  * 6.5: [Concern trolling](https://www.urbandictionary.com/define.php?term=concern+troll).\n  * 6.6: Feigning idiocy when posting or commenting, or linking to such content.\n  \n  [More information about Rule 6](https://www.reddit.com/r/pcmasterrace/wiki/rules#wiki_rule_.236)\n\n\n\nFor info see the sidebar and the [rules](/r/pcmasterrace/wiki/rules). For questions [contact the mod team.](/message/compose?to=%2Fr%2Fpcmasterrace) **Replies to this removal or direct PMs to moderators about removals won't be replied to.** Thank you.", "label": 0}
{"text": "https://www.youtube.com/watch?v=RkN4duV4ia0", "label": 0}
{"text": "Put one in the bathroom and attach an apple tv.", "label": 0}
{"text": "Which would be equal to 2^4 colors = 16 colors. Not bad, could probably display what we need on the picture.", "label": 0}
{"text": "Either warehouse staff or a particularly lazy or rushed driver lol, although to be fair I usually check if there's anything *outside* of the parcel rather than checking if anything is inside as there's often more than one item in them anyway, but you do make a good point and I'll be sure to be extra vigilant haha", "label": 0}
{"text": "Their loss, your gain.  Don't say anything to Amazon", "label": 0}
{"text": "Oh nice, last time I had a similar mistake happen they told me keep it, congrats mate", "label": 0}
{"text": "Nah man Amazon fucks up all the time. I've gotten plenty of free shit by accident from Amazon. Sorry to hear you haven't", "label": 0}
{"text": "Sure you did. \n\nWhy would you even post this?", "label": 0}
{"text": "dunno why, but the Super is significantly more expensive, nearly 700€", "label": 0}
{"text": "I have an UW straight on, and a 27\" vertical to the right. Upper left I have a 27\" swing away 4k for PS5 gaming.", "label": 0}
{"text": "This happened to me when I ordered a synolgy nas drive, it had 4 16tb enterprise drives inside worth 150 quid each 😂.. (bought shell only)", "label": 0}
{"text": "Personally I would sell one but that’s just me.", "label": 0}
{"text": "What is the color pallette of your parts?", "label": 0}
{"text": "It's a bit harder to move people underwater so no they wouldn't", "label": 0}
{"text": "Ohhh! There it is. That damn delivery guys \nIm your neighbour you can drop at my nanny’s (out of town yk) i’ll dm you the address", "label": 0}
{"text": "ok, enjoy it. gg\n\nand as i said, i'm not salty sis, i don't like aquarium.", "label": 0}
{"text": "Usually they do the whole room.", "label": 0}
{"text": "Finally something new", "label": 0}
{"text": "I wouldn’t wanna touch it.", "label": 0}
{"text": "The solid-front H500 and H510 are both pretty bad in terms of airflow and not recommended. How important is this particular design to you?", "label": 0}
{"text": "Aight sis, if ya say so", "label": 0}
{"text": "Fucking beautiful I give this set up a 10/10.\n\nAnd I am usually an asshole when I see rate my set up posts, but this is just nice.", "label": 0}
{"text": "Cheap floor contractors be like", "label": 0}
{"text": "Yeah the cooler actually looks like that in person", "label": 0}
{"text": "It’s really tough but I believe it’s fixable, you won’t know unless you try. Do good research before going at it", "label": 0}
{"text": "You got scammed for that PC at 400$", "label": 0}
{"text": "return one. then you keep the free one.", "label": 0}
{"text": "I'm still using Razer DeathAdder 2013. The issue with the clicks was caused by my cat's hair. I had to dismantle it and blow out any fur inside the mouse.   \nI hope, I will be still using it another 10 years.", "label": 0}
{"text": "r/mildlyinfuriating", "label": 0}
{"text": "But would you rather have it be 300-400gb? Cant afford nor run it either way lmao", "label": 0}
{"text": "I guess the problem with your interpretation of this advice is the keyword “moreover”, so the part about keeping the unordered merchandise only applies if the merchant has knowledge of shipping the unordered merchandise", "label": 0}
{"text": "You should return one to not effect amazons profit", "label": 0}
{"text": "I tried it but unfortunately it didn't work I think it's the led lights that are dead or something", "label": 0}
{"text": "Same tracking number? I had that happen recently with air fryers.", "label": 0}
{"text": "Also gotten lucky once like this- ordered a 5 pack of Glade plugin refills, ended up with an entire BOX of 20 5 packs, so 100 refills total. \n\nI regularly order pricy car and motorcycle parts and accessories from Amazon, but my luck was limited to one time with Glade plugin refills.", "label": 0}
{"text": "Don’t use alcohol in any concentration on monitors.", "label": 0}
{"text": "Everythings black :I", "label": 0}
{"text": "Sprayway Glass cleaner non-ammonia. It’s in an aerosol can. And a good clean microfiber towel. Spray liberally, wipe lightly. You’ll be good to go.", "label": 0}
{"text": "I had another item double ship before. They ended up finding out and contacted me months later saying I can keep it or return it. I told them I already discarded the packaging, they said that’s fine.\n\nThe delivery driver wasn’t too happy he had to take ~350 pounds of plates from my house to his truck.\n\nPoint I’m trying to get across is, they eventually will likely do an inventory check", "label": 0}
{"text": "https://preview.redd.it/6b9l6qo1iywd1.png?width=527&format=pjpg&auto=webp&s=0b4c597d206649d8e3a10e5e0edda12b71fb86d3", "label": 0}
{"text": "i swear to fuck\n\ngratz op", "label": 0}
{"text": "you cant be talking with that rtx 3060ti and 15 12600kf lmaoo", "label": 0}
{"text": "You exposed yourself... Now you have to return one or at least contact them to let them know.", "label": 0}
{"text": "Razer blade and steady hand. You got this", "label": 0}
{"text": "Your friend has dial-up, and *they're* the one with strong internet? What's your pc hooked up to, a telegraph line?", "label": 0}
{"text": "Can you post results screenshot of Speedtest app from Microsoft store?", "label": 0}
{"text": "Yeah no kidding. Not everybody wants their home filmed for the entire world to see and judge. I will not be entering this \"\"\"contest\"\"\".", "label": 0}
{"text": "I'm on a budget, so I don't really have a wide range to choose from. Are there any better at the same price range?", "label": 0}
{"text": "I knew this game was too good to be true.", "label": 0}
{"text": "![gif](giphy|aw9vw51zjTa8g)", "label": 0}
{"text": "Liar.", "label": 0}
{"text": "Double check your bank statement and congrats.", "label": 0}
{"text": "Slow and precise.  Don't scrape the motherboard up getting it in the chassis.  Every connection and plug straight and true most should click when tight. Mind the torque order on the cpu/heat sink screws. Read the instructions and motherboard thoroughly before starting. You'll do fine. I was apprehensive on my first but it fire right up no issues!", "label": 0}
{"text": "Give it to me I’m poor", "label": 0}
{"text": "No you didn't. You got one delivered and you stick to that story. :⁠-⁠)", "label": 0}
{"text": "Black and White case then", "label": 0}
{"text": "is that what you told your wife?", "label": 0}
{"text": "I know that this is supposed to be like a concept/really cool sci-fi type thing but if your cpu is red hot and rapidly boiling water, I dont think it's being cooled effectively", "label": 0}
{"text": "Some of us are gearheads/blue collar.... game on!", "label": 0}
{"text": ">still going to need to cool the water with a radiator\n\nIt's not water, it's a kind of oil.\n\nYou only need a radiator if the fluid can't dissipate enough thermal energy through natural convection that it reaches unsafe temperatures during operation. From what I've seen, most builds don't generate enough heat to warrant that, though some choose to do so for aesthetics/high performance reasons.", "label": 0}
{"text": "And charged for three.", "label": 0}
{"text": "Happened to me once with a 3000$ item", "label": 0}
{"text": "Ty, it seems lian li is the go to for white setups, no big competitor", "label": 0}
{"text": "It’s pretty much plug and play for windows. If you’re not chucking the thing it’s fine. It’s not like the Nintendo switch controller with drift issues.", "label": 0}
{"text": "Reminds me of the time I ordered one pack of photo paper and got a whole case instead. And it was good stuff too ilford Pearl photo paper.", "label": 0}
{"text": "You lucky bastard. Why this no happen to meh", "label": 0}
{"text": "I don't get why people get.mad about both being vertical for fps games. It makes sense. You turn and you can't see him because of the borders? Then shoot because they will always be in the middle", "label": 0}
{"text": "not attention seeking, just thought it was cool. and check my post history for proof. anyways why get so pressed over it?", "label": 0}
{"text": "Oh then thats an alright deal on the PC since the RTX 3050 6GB on its own goes for 160-200$.\n\nThe 6700 is still good enough, and comes with plenty of RAM. Though if you want to put Windows 11 on there you'll have to bypass the security requirements with RUFUS", "label": 0}
{"text": "This happened to me earlier this year with Newegg. Got a new monitor, one came like 2 days later. Next week a 2nd one arrived 😂", "label": 0}
{"text": "Upgraded from 3600 to 5800x3d some time ago and it's crazy how my cheap b450 motherboard just needed a bios update to support the cpu. The motherboard had already been bios updated once in the store to support my 3600.\n\nPaired with an rtx 3060ti, the 5800x3d is a great combo for me, who doesn't play extremely graphic intensive games and has 1080p 144hz monitor. Oh and 48gb of ram for good measure :D\n\nBut the 3d cache is great for stuff like playing minecraft, because the cpu can generate the world extremely fast. It's the first time i have had a cpu that's been able to keep up with world generation, instead of having to wait for it to catch up.", "label": 0}
{"text": "Nice!! I once ordered a single 32gb corsair Vengeance DDR5 ram from Amazon and was sent an entire case of them. (10 I think) Each one sells for just over $100. That was a good day. I upgraded some friends pc’s for free and kept some for my next build :)", "label": 0}
{"text": "U sound salty ngl ", "label": 0}
{"text": "Patience, lots of patience.\n\nUse gloves\n\nTake your time and do things slowly", "label": 0}
{"text": "Sorry about the stupid question, but I won't be using ray tracing on a 4060?", "label": 0}
{"text": "Hello, this is Jeff Bezos. Please send me back my monitor.", "label": 0}
{"text": "Tbf I'm more of an ultawide guy myself", "label": 0}
{"text": "So that's where my monitor went.", "label": 0}
{"text": "Oh so thats where my order went", "label": 0}
{"text": "This video is pretty old, they released it back when Novec was still in production. People dig it out every other year.", "label": 0}
{"text": "My dad used rufus and made it bootable", "label": 0}
{"text": "If something isn't going in don't just push harder but sometimes push harder.", "label": 0}
{"text": "Something like this has a very strong possibility they took a picture or signature on delivery.", "label": 0}
{"text": "I got 4060 and its really good for the price, dont expect ultra but medium high on 1080 is pretty fluid", "label": 0}
{"text": "Even when we enter install windows it just doesnt want to install on ssd nor hdd", "label": 0}
{"text": "glad i'd never fall for it ig :(", "label": 0}
{"text": "Youtube", "label": 0}
{"text": "Yeah the 60 class does seem to be the mainstream gamer's choice. So $190 for a RTX 5050 8GB and $290 for the RTX 5060 16GB would be fine to my mind.", "label": 0}
{"text": "Its fine, people exagerate\n\nI run a 4080S and a 12900k on a H510 Elite and my GPU literally never goes above 68c and my CPU only goes above 65 when doing very CPU intensive tasks", "label": 0}
{"text": "Nah. Bought a JBL 5.1 sound system and got sent 2. The box is HUGE.", "label": 0}
{"text": "Hello I'm the second screen I don't know how I got here pls help", "label": 0}
{"text": "Porch pirate I guess if photo", "label": 0}
{"text": "I've had this happen. Return the extra as the original. Keep a free monitor.", "label": 0}
{"text": "What is your CPU? If you go RX 6400 it will be weaker on a PCIE 3.0 system, doesnt come with an encoder if you wanna make videos, and only has a display port and hdmi port", "label": 0}
{"text": "Before even the obvious comments of just look at a couple of YouTube videos which are obviously helpful. \nOne thing about computers is if it fits it most likely goes there that's how I used to teach novice students back in high school about building computers. Everything is slotted to fit a certain way. \"MOST\" of the time. I'd say the only time where you have to be careful is when you're dealing with RGB versus argb headers.", "label": 0}
{"text": "What if I only have 4 dicks", "label": 0}
{"text": "Same here, no one goes into the office", "label": 0}
{"text": "Always keep doubles, triples, quadruples of amazon shite. Shit goes directly onto a resell palette for auction where most of the items will end up straight into the landfill because they damaged or otherwise unsellable immediately.", "label": 0}
{"text": "Now you put your old monitor that you just replaced on the other side.", "label": 0}
{"text": "This has happened a few things with my friend and sports jerseys. We have matching XFL jerseys now though.", "label": 0}
{"text": "I have background 'ai\" type camera on my surface pro 8. 1185g processor. So they sold you snake oil homie. Waste of money because only a few programs exist for \"normal users\" unless your Wendell from Level1Tech the type os cpu was a waste of your damn money worse then strip club.  Atleast you have a chance to get some use out of a strip club fun night new ex wife ect", "label": 0}
{"text": "True, but I am sure I can do that once it comes to it, it will not be set up on wifi for long just enough to download the game, then keep it off and if win ten becomes unsupported then it should be okay till I absolutely need a new one", "label": 0}
{"text": "I hate this sub, everyone getting 3090 for under 200$ and this guy getting free monitor lol", "label": 0}
{"text": "https://preview.redd.it/lvyex12hjywd1.png?width=1080&format=pjpg&auto=webp&s=6c6ee437b6ae85dff4e0e84e7495cc84bdd608eb\n\ndo u know what brand is this? is FSP good or is that not the name of the brand", "label": 0}
{"text": "480hz 1440p oled screen?!?\n\nIf you’re trying to actually hit ~480fps  you’re gonna want a 4080 super or 4090 and even then you’re might not hit that frame rate if the game engine even supports that high of fps……..", "label": 0}
{"text": "Very easy to photoshop these.", "label": 0}
{"text": "google everything bro. like even where ram goes for dual channel, how to flash vbios. everything.", "label": 0}
{"text": "My point is simple. What's enough for now is not going to be enough in the future and time when games will require 16 gb of vram might come sooner than you think.\n\nOR\n\n8gb was plenty, no it wasn't\n\n12gb is plenty, no it isn't.\n\n8gb vram is not enough in 3070, 12 gb will be maxed out soon after.\n\nWhich is why i think about switching from ngreedia to sapphire radeon rx 7900 xtx with cool 24gb of vram.", "label": 0}
{"text": "Ordered a red Xbox controller 28 September, still waiting.", "label": 0}
{"text": "Cloud gaming sucks. I like single player games better anyway.", "label": 0}
{"text": "I had this happen when I ordered a $150 kettle bell. I one then another one came a week later! was a blessing because I needed two but was buying one then saving up for the next one lol.", "label": 0}
{"text": "You one lucky mofo", "label": 0}
{"text": "Pretty funny. I liked the bit about cutting off his dick. But did you think about writing\n\n\nten (10) \n\n\nlike you were clarifying the number of Japanese assassins?\n\n\nThat were going to cut off his dick", "label": 0}
{"text": "This guy gets it", "label": 0}
{"text": "Ya, that makes sense to do after the motherboard.", "label": 0}
{"text": "Mechanical pencil and patience", "label": 0}
{"text": "lol as if i’m gonna put that much effort into something 😭", "label": 0}
{"text": "A couple of weeks ago, I ordered a 4-pack of deodorant from Amazon. \n\nThey sent me a case.  20  4-packs for 80 total. \n\nI’m old enough where I may not need to buy it ever again.", "label": 0}
{"text": "In terms of cpu pin fuckage, this is only like a 5/10 for shittyness. Fairly easy to fix. When pins are bent over more then like 60 degrees, that's where it gets bad, because they have a high chance of snapping off when trying to straighten. If that happens... Hope they're just ground pins. Can loose some of those and still be fine.", "label": 0}
{"text": "https://preview.redd.it/tfkwngeflywd1.jpeg?width=3072&format=pjpg&auto=webp&s=706e27011ac7f472d180017a7ba28548b1cf815b\n\nI seem to not have posted the original fittings", "label": 0}
{"text": "Just buy an old metal General Electric box fan from the 1960s and mount computer parts inside it.", "label": 0}
{"text": "Tweakers bbg?", "label": 0}
{"text": "Yeah, mines the 32 as well. Best buy had it open box on sale for $800. Make sure you update the firmware, it adds some features.", "label": 0}
{"text": "Maaaaaan, and I got two cookbooks from Amazon.  So I think I win..........", "label": 0}
{"text": "The only thing I accidentally got two of from amazon was a Frisbe for my dog. While only being 10$ it worked out really well having two of them.", "label": 0}
{"text": "Let’s go man !", "label": 0}
{"text": "Good luck with two curved monitors, you won't be able to put them on an angle, so they'll have to be parallel.", "label": 0}
{"text": "They won’t reach out, happens a lot. You are good", "label": 0}
{"text": "I get about 300-400 FPS in CS2", "label": 0}
{"text": "Lmfao because these systems are perfect and never fuck up? Like what are you even saying", "label": 0}
{"text": "Hmmm so will we need PC mechanics soon?", "label": 0}
{"text": "Makes sense thank you my man I appreciate it!", "label": 0}
{"text": "Go to reddit and make p...oh wait a minute!", "label": 0}
{"text": "This is like the Ibai PC that Nate gentile made", "label": 0}
{"text": "My “quick google fu” shows all US 4070s start at $550 USD, which converts to $763 CAD.  Or, thought of the other way around, $750 CAD would give you the buying power of $540 USD.\n\nSo, $750 CAD for a 4070 is a good deal. I’m still not sure what your point is\n\nhttps://preview.redd.it/tl1zklmblywd1.jpeg?width=1170&format=pjpg&auto=webp&s=23b86b925687d0e3df1e6c71eeae5d3bfdb6b689", "label": 0}
{"text": "I've seen far worse make a full recovery at the hands of people who have never done this before so I'd say your odds are very good if you're careful\n\nhttps://youtu.be/uBQMVE1v-G4?si=Vb4pzEAracdD8VcQ", "label": 0}
{"text": "Thank you for your help, I restarted and everything was fine.. I guess bios forgot to do the final restart.", "label": 0}
{"text": "Nice. Return one for a refund and keep the other.", "label": 0}
{"text": "I once ordered a xps 17 on Amazon and got 2 in the mail. I called them and they said \"we would like it back but your not obligated to\".\n\nI obviously kept it, and returned the spare for a refund about a week later.", "label": 0}
{"text": "You may be confused. \nGoG games do have a license. You have the license to download and backup games. ", "label": 0}
{"text": "Now you have to run triple…", "label": 0}
{"text": "Hey if it’s enough for 096 it’s enough for me", "label": 0}
{"text": "recall was not cancelled, and I hope by \"disable copilot\" you mean \"uninstall that unholy abomination off your computer and send it back to Hell where it belongs\"", "label": 0}
{"text": "I ordered one set of rims for a car once and they delivered 2 sets. Wasn’t off Amazon and i believe in karma so I returned one. But another time I got 2 grill grates and wasn’t going through the hassle of returning that as my time is more valuable to me.", "label": 0}
{"text": "Its just that I never lived in an especially cold place,", "label": 0}
{"text": "They can make you return it as long as there's no expense to you (a small bit of your time isn't considered 'expense').  If they make that effort, you're required to either follow through with the return, or pay for the second (or third, whatever) item.", "label": 0}
{"text": "i dont really care if thats practical tbh", "label": 0}
{"text": "Third world problems. Two months is around 3000$.", "label": 0}
{"text": "I used mine up at 12 went to Argos to buy two ‘3 pack sets’ of Yugioh boosters for about a tenner each, got given two sealed booster boxes handed to me instead, spent the whole bus ride home sure I was dreaming", "label": 0}
{"text": "TechPowerUp has it about 25% faster than the 4080S/7900XTX and Tom’s Hardware is closer to 20%. So 20-25% faster, yeah. It’s pretty crazy lol", "label": 0}
{"text": "You Lucky bastard!! 😉", "label": 0}
{"text": "Free self-destruct feature", "label": 0}
{"text": "You’re welcome.", "label": 0}
{"text": "I got 10 ssds for the price of one", "label": 0}
{"text": "Fair point, lemme get that", "label": 0}
{"text": "Looks damn great! How much did it cost all together?", "label": 0}
{"text": "3 ultrawides?", "label": 0}
{"text": "Home world… nice", "label": 0}
{"text": "Did you get charged for 2??? I would check that.", "label": 0}
{"text": "That was my first PC game ever, so many core memories of it. Back then you'd play a game so much until you knew every single corner of every single map.", "label": 0}
{"text": "When I was younger my roommate and I ordered a custom stripper pole because we had unusually high ceilings. It was around $600 and they sent us two by mistake but only charged us for one. Since it was custom it could fit well in other apartments on our floor, so we sold it to the neighbors we were cool with. Basically got our pole for free.", "label": 0}
{"text": "A 7600x and a RX7800xt or RX7900gre is a good choice, a 4070super/ti/super ti might be worth considering too. Either way I think this would be quite a bit better than what you have, but a 2600x and a 1080ti is still good. I still use my R5 1600 and gtx 1060 for a media pc/bed gaming. My main rig is a 7600x and a 3060, so I’d 100% recommend going with a 7600x!", "label": 0}
{"text": "Congrats and fuck you", "label": 0}
{"text": "Technically, you don't need to deliver people to the equipment if you have an effective process for delivering the equipment to the people in an automated fashion. Regardless of reason, I don't think the success was as good as hoped.", "label": 0}
{"text": "Around 1700 ! Keep in mind I did pay some higher prices for the aesthetics. A similar all black build would probably be cheaper.", "label": 0}
{"text": "To cram 600W+ of components in a case like this, the custom loop would need to go through the desk to radiators mounted underneath it. That would be a massive PITA to build, but it would be an absolutely legendary sleeper PC.", "label": 0}
{"text": "https://preview.redd.it/kcev1shdmywd1.jpeg?width=2028&format=pjpg&auto=webp&s=31ae9c006a6792eb6ebc11b4f8cb54018f1f9bde", "label": 0}
{"text": "I'm gonna call total BS on it 'worked yesterday'.\n\nNo it didnt. You're full of shit.", "label": 0}
{"text": "Currently at my native 3440x1440, set to eco and my drivers are updated to the latest version", "label": 0}
{"text": "4070. One day you'll learn how to build pcs too", "label": 0}
{"text": "Idk about them but two months of wage is like 4k max lol", "label": 0}
{"text": "If they both use the same kind of ram, yes.\n\nYou can run CPUz on your laptop and on the AIO computer. Go to the SPD tab to check if it is DDR3, 4, 5, LV, etc. It's ok if the speed doesn't match but the DDR needs to match.", "label": 0}
{"text": "Why do these people keep posting \"I ordered one and got two!\"\n\nHow about you keep that shit quiet?", "label": 0}
{"text": "Yeah the 1070 still gets drivers too\n\nThe 570 technically does, but you would be relying on the RDN.ID (Nimez) driver team to bring new updates\n\nAny of those GPUs would be a good upgrade for that CPU.", "label": 0}
{"text": "Return the 4060 and get a better card.", "label": 0}
{"text": "I idle at around 20° so I think she's doing pretty good ! Damn though that's pretty odd", "label": 0}
{"text": "Tbh I don't think you understand the concept of software licensing.", "label": 0}
{"text": "RTFM", "label": 0}
{"text": "Order one from Amazon, pretty sure that you will get six this time.", "label": 0}
{"text": "Lol i had the same thing happened to me but it was a electric scooter. I bought two and i got 4 so i sold the other 2 and got my money back lol", "label": 0}
{"text": "Similar case for me. I ordered two 8 gb ram sticks and I got 2 32 gigs instead.", "label": 0}
{"text": ">18 Gigs of RAM\n\n\nWhat the fuck kind of RAM config are you running", "label": 0}
{"text": "r/beatmetoit", "label": 0}
{"text": "Nice luck but can't believe people are still buying Alienware hardware in 2024.", "label": 0}
{"text": "??", "label": 0}
{"text": "I wouldn't let you come over and set up shop in my house either, in fact I would not let you anywhere near my house if  we are honest.\n\nSo maybe he was not polite but the sentiment is correct.\n\nThe hassle and privacy risk to get $450 is not worth it for me.", "label": 0}
{"text": "How does this happen? I see posts like this all the time.", "label": 0}
{"text": "Would you recommend the gtx1070 over the rx570 even tho it's used?, this is my first time building a pc lol, so i donno what is best", "label": 0}
{"text": "Some poor Amazon robot is being tortured and deactivated as we speak.", "label": 0}
{"text": "Pre M2 ... After M2 haha does it matter?\nThen again OP probably meant for work... Ha power saving and work is only for the PR department.", "label": 0}
{"text": "Back in the day, having a friend with good internet was a blessing. Now it's all about who has the best gaming rig.", "label": 0}
{"text": "😶😏", "label": 0}
{"text": "Your build stats really don't support your claim of making big bucks here.", "label": 0}
{"text": "My point is this is a sub for expensive tech used for leisure and entertainment, everything here is a first world problem by definition. \n\nI make no comment on OPs cleaning service, although calling a human doing paid labor a servant is wild my guy.", "label": 0}
{"text": "Besides ram, nothing should take much pressure to clip in. If you feel like you are forcing something, stop and re-evaluate.  Your motherboard diagram is your friend.\n\n Also, make sure your ram is facing the correct way. Look at the groove underneath in correspondence to the slots on the motherboard before pressing that in", "label": 0}
{"text": "what a bad luck bro", "label": 0}
{"text": "2 months of wage in my country is less than 500USD", "label": 0}
{"text": "Am I doing something wrong with Win11? Because everyone here is talking about boot times so I checked mine: Win11 pro on my 3800x3d desktop, W11 edu on my Ultra 7 laptop, and Win11 vanilla on my shitty i3 laptop all booted in less than 30 seconds. \n\nDoes no one here do fresh installs? Even if it's a laptop, the first thing you should do with any new computer is a fresh OS install. It's free.", "label": 0}
{"text": "I challenge all geo-guessers to pinpoint the address hidden here.", "label": 0}
{"text": "2/10. Lacks life.", "label": 0}
{"text": "Whaat?!!", "label": 0}
{"text": "Don't listen to those clowns I'm the real CEO, Geoff Basils.", "label": 0}
{"text": "don’t rib on the maid, she just didn’t know. i would tell you to complain to the maid service, but if you’re in any non western country then they’ll just take it from her pay. be careful next time, don’t let anyone clean your office.", "label": 0}
{"text": "It's a Christmas miracle!", "label": 0}
{"text": "What Alienware monitor is this ?", "label": 0}
{"text": "It's triple channel bro. New technology.", "label": 0}
{"text": "Tell me this though: would you spend $450 on a graphics card without a verified benchmark?", "label": 0}
{"text": "I swear all these buy one get one free posts on reddit, or free upgrades posts are gorilla marketing.", "label": 0}
{"text": "My poor Barracuda X is on its last leg, for some reason it keeps popping in my ear. My steelseries headset has been serving me well 🙏", "label": 0}
{"text": "Lotion and sock serve two very different purposes in the process…", "label": 0}
{"text": "I got 2x the powdered cleaner I ordered. :/", "label": 0}
{"text": "$3.50", "label": 0}
{"text": "Be aware if you keep it you may be prosecuted. It is not a finders keepers situation. If they want it back you have to give it back.", "label": 0}
{"text": "You are the one who seem to be confused buddy. \n\nLet me put it in simple words.\n\nDownloading and using GOG's DRM free games is legal as per the software license. \n\nWhen you purchase a game from GOG, you are granted a license to use the game, which includes downloading, installing, and playing it without any digital rights management (DRM) restrictions. This means you can make backup copies, transfer the game between devices, and play it offline without needing to authenticate online.\n\nThe only thing you cannot do is commercially distribute the game or share online with others in ways that violate the terms of the license agreement. \n\nIf you can't understand these simple facts. debating with you is pointless. Good day.", "label": 0}
{"text": "Oh if you mean flair I'm on 4090 with ryzen 3950x, and play in 4k 120hz mostly, but 9800x3d, while not being a giga upgrade to gaming overall (everything is really good and smooth) will definitely help in 1% and 0.1%", "label": 0}
{"text": "This happened to me one time ever and it was with a belt. That’s awesome. Fuck you. Enjoy. ", "label": 0}
{"text": "My grandma did this with her flat screen till the day she left the house, she refused to use anything but pledge to clean the screen, when I explained to her that's why she would go though a TV every 2 years she would tell me she knows more then me and to keep my nose out of it", "label": 0}
{"text": "Temp is measure by highest core.  Overal cpu usage not good correlation.", "label": 0}
{"text": "Why would I get a better PC if I barely game anymore and my PC runs the game I do play that my monitors specs? Does not upgrading every year make me an idiot or something?", "label": 0}
{"text": "I didn’t even count and i knew it was supposed to be at least 350%", "label": 0}
{"text": "![gif](giphy|AQRapWCgC7dThyVEYb|downsized)", "label": 0}
{"text": "He said he shaves his pubes over my pc every time he’s in my house,  definitely nothing too crazy but also just stupid and not really funny in any sense.", "label": 0}
{"text": "Stremio + realdebrid. Dont look back.", "label": 0}
{"text": "If your GPU isn't maxed out when there's no framerate limiter in place - yes, your performance is limited by the CPU. CPU and GPU don't \"handle\" each other, they couldn't care less about each other. CPU draws a frame, then sends that frame to GPU to process it. There's no problem with your PC as it is of now. In fact, you want to avoid maxing out your GPU, as maxed out GPU might increase game's input latency and produce unsmooth gameplay.", "label": 0}
{"text": "“Fool me one time, shame on you. Fool me two times can’t but the blame on you, fool me three times, fuck the peace signs, load the chopper let it rain on you.”", "label": 0}
{"text": "Well done, you've got fuel monitor setup", "label": 0}
{"text": "Post a screenshot of all Hwinfo sensors for the CPU and GPU while the game is running", "label": 0}
{"text": "You're not a real gamer if the set up is too clean", "label": 0}
{"text": "me when the virtue signal soup kicks in", "label": 0}
{"text": "I got two tplink WiFi 7 mesh systems from Amazon after ordering just one.", "label": 0}
{"text": "At least he doesn't need to heed the call of duty anymore", "label": 0}
{"text": "https://preview.redd.it/1tccghdlnywd1.jpeg?width=527&format=pjpg&auto=webp&s=c3f81e7ffed8df2bcf490fd3c7d444dc238f36b2", "label": 0}
{"text": "Amazon literally doesn't care. This kind of thing happens all the time. I got sent a pair of ipod pros recently I never ordered and when I called Amazon they told me to either keep them or give them away if I don't want them. Sending them back was pointless as I never got charged for them and it costs them more in restock fees to take it back vs. just taking the loss.", "label": 0}
{"text": "During COVID, my 2070 Super died on me. I got a 3070 for a $1000 sidegrade.", "label": 0}
{"text": "Gavlan wheel Gavlan deal", "label": 0}
