{"text": "Yeah we stopped the Russians too. You're welcome by the way <3", "label": 1}
{"text": "But that isn't what you said. You're pissing and moaning about they way they said \"Brazilian\" instead of \"nice person from Brazil\"\n\nMean what you say. Also you suck, lol", "label": 1}
{"text": "Currently 90 downvotes for calling someone out on typecasting immigrants into menial roles... This is no different than if they said \"I got a jew to do my taxes\". Shits fucked up.", "label": 1}
{"text": "U must be fun at parties", "label": 1}
{"text": "You must be annoying as shit in public?", "label": 1}
{"text": "How stupid can you be?\n\nLegionof1: Yes", "label": 1}
{"text": "They were typecasting their nationality into menial labor. Sounds like the Trump \"Black Jobs\" shit, \"Get an immigrant to mow your lawn\", \"Get a jew to do your taxes\". \n\nWhy the fuck does their nationality matter. THEY are good at what they chose to do, nothing to do with their nationality.", "label": 1}
{"text": "Probably could have formulated my reply to the first guy better. I have explained my point better in other replies. Basically its typecasting minorities into menial jobs.", "label": 1}
{"text": "Stop looking to be offended by everything.  It's tiring.", "label": 1}
{"text": "Fuck you we Jews do great tax work\n\nSource: I'm a Jew that does tax returns", "label": 1}
{"text": "Think you should take a break from the Internet for a while and talk to people in person. Most are friendlier than you think.", "label": 1}
{"text": "If u say so", "label": 1}
{"text": "Oh fuck off Rebecca.", "label": 1}
{"text": "When I come round yours I shave my pubes over your PC", "label": 1}
{"text": "post link:   [https://www.reddit.com/r/pcmasterrace/comments/1gbqb4y/linux\\_user\\_here\\_and\\_yes\\_suspend\\_it\\_is\\_always/](https://www.reddit.com/r/pcmasterrace/comments/1gbqb4y/linux_user_here_and_yes_suspend_it_is_always/)", "label": 1}
{"text": "Are those the new 32\" 4k OLEDs? \n\nHoly shit fuck you man I really hope this is a troll lmfao", "label": 1}
{"text": "That's up to you if you want to play that game.", "label": 1}
{"text": "That's up to you if you want to play that game.", "label": 1}
{"text": "Fuck you.", "label": 1}
{"text": "Fuck you. Congratulations.", "label": 1}
{"text": "🎊Congratulations💐👌.Our final winner at Range rover  (Scot Paul) failed to respond.\nSo we're giving it to someone.. Quickly register here and put yourself as a winner👇👇\nrangerover-sptwin.weebly.com_", "label": 1}
{"text": "Fuck you and congrats", "label": 1}
{"text": "Firewatch?", "label": 1}
{"text": "IrisSAT", "label": 1}
{"text": "… but mostly, fuck you.", "label": 1}
{"text": "Boi we have the same wallpapah", "label": 1}
{"text": "W", "label": 1}
{"text": "Suck my [49\" dick](https://www.bestbuy.com/site/furrion-aurora-49-partial-sun-4k-led-outdoor-tv-2021/6466018.p?skuId=6466018).\n\nAnd honestly, that isn't even the point. A 49\" screen with standard 16:9 ratio is completely different that a 49\" screen with the ultrawide ratio of 32:9. By not saying it was an ultrawide, most people are picturing a screen a little over two feet tall, not just under a foot.", "label": 1}
{"text": "Fuck you", "label": 1}
{"text": "That's up to you if you want to play that game.", "label": 1}
{"text": "Or, you know, they rightfully tell you to fuck off because it's too much hassle to sell you the graphics card. Just go buy a new one.", "label": 1}
{"text": "CHA CHING 🤣😂🤣😂🤣😂😂", "label": 1}
{"text": "That's up to you if you want to play that game.", "label": 1}
{"text": "😂😂😂😂😂😂 ok if you think so lmao.\n\nIm willing to bet everything i have absolutely nothing comes of it and OP enjoys his second free monitor.", "label": 1}
{"text": "That happened with me multiple times 😂😂 I bought ram once, got two, bought a mouse got two. I need to find what the pattern is so I can buy something expensive like those monitors 😂😂", "label": 1}
{"text": "You also mentioned VA to IPS was a big change for you, hwo come? Is IPS better?", "label": 1}
{"text": "I reminded him that I routinely shave my pubic hair over his PC case", "label": 1}
{"text": "That’s crazy what luck u got!!", "label": 1}
{"text": "No they are not.. \n\nSource: https://www.reddit.com/r/dataisbeautiful/s/8a7jNBetBJ", "label": 1}
{"text": "If that was your old pc, what the hell did you buy?", "label": 1}
{"text": "I wanted to get away from intel. So I went full AMD for the new build.", "label": 1}
{"text": "Well since you already have your new pc, I’d recommend parting out your old build. You’ll get quite a bit more for it.", "label": 1}
{"text": "Check out /r/hardwareswap", "label": 1}
{"text": "Thank you! I will definitely check it out!", "label": 1}
{"text": "I don't know you yet I love you.\n\nThat being said... Fuck you.", "label": 1}
{"text": "Fuck you i still havent beat you 😭", "label": 1}
{"text": "!allmessage", "label": 1}
{"text": "!allmessage", "label": 1}
{"text": "Hello, No_Worldliness_7559.  I have detected [this](https://i.redd.it/03arkgg9o0xd1.jpeg) might be a duplicate image.  Potential matches below: \n\n Confidence | Score | Comments | Permalink | Posted \n-----------|-------|----------|-----------|--------\n96.50%|14,359|631|[Found on discord](/r/pcmasterrace/comments/ykcosu/found_on_discord/) [(image)](https://i.redd.it/5ws88iwvxkx91.png)|24 months ago\n90.35%|7,554|881|[Its not wrong. Windows defender works perfectly fine so long as you don't download stupid crap or go to shady sites.](/r/pcmasterrace/comments/18sjs6f/its_not_wrong_windows_defender_works_perfectly/) [(image)]()|10 months ago\n90.35%|635|129|[Whenever I ask for advice](/r/pcmasterrace/comments/13cu3lg/whenever_i_ask_for_advice/) [(image)]()|18 months ago\n93.42%|11|10|[I don't know what else to say. thank you!](/r/pcmasterrace/comments/191bft5/i_dont_know_what_else_to_say_thank_you/) [(image)](https://i.redd.it/e9dgvo5lx4bc1.png)|10 months ago\n96.50%|2|1|[Oh, wow, thank you!](/r/pcmasterrace/comments/10blmow/oh_wow_thank_you/) [(image)](https://i.redd.it/rik2nf3blzba1.jpg)|22 months ago\n\n As well as 3 more\n\n**Note:** This list may be incomplete.\n\n----\n\n*[I am a bot](https://i.imgur.com/hfRIhMe.png)* -  This action was done automatically. Please direct any questions or concerns ( or bug reports ) to [\\/u\\/eegras](https://www.reddit.com/message/compose?to=eegras&subject=&message=) - [About /u/PCMRBot](https://pcmasterrace.org/pcmrbot_old)[](#aLUrQ24GdS)", "label": 1}
{"text": "You are one lucky chad!\n\nCongrats bud...!\n\nThis could be one in a million chance if this is real!\n\nJust make sure your bank isn't charged twice ***wink*** ***wink***", "label": 1}
{"text": "Here's a post with a bit more info. Try searching the issues you have in the sub first. Saves time and gets better results.\n\n[https://www.reddit.com/r/pcmasterrace/comments/1g8qiqz/rtx\\_3060\\_12gb\\_vs\\_rtx\\_4060\\_8gb\\_for\\_4k\\_video/](https://www.reddit.com/r/pcmasterrace/comments/1g8qiqz/rtx_3060_12gb_vs_rtx_4060_8gb_for_4k_video/)", "label": 1}
{"text": "how can u tell😂", "label": 1}
{"text": "yeah im hoping at least a ryzen 5500", "label": 1}
{"text": "I totally get your struggle; finding that perfect gaming chair to complete your setup can be one hell of a challenge. Since you've mentioned the Fern, the Embody and the Leap aren't quite hitting the mark, you may find a gaming chair more satisfying. They're specifically designed for long hours of comfortable gaming and often provide greater adjustability and support options which can be a major game-changer. I was also on a similar hunt a while ago and stumbled upon [this ergonomically designed gaming chair](https://link.getsosocial.com/best-gaming-chair). It provides high comfort levels without compromising the aesthetic appeal. And, best part, it wasn't ridiculously priced. Might be worth checking out if you're after a solid, top-tier experience. Good luck on your quest!", "label": 1}
{"text": "Looks fire 🔥🔥🔥🧯", "label": 1}
{"text": "thats def the mobo but how did u get the picture from the back of it", "label": 1}
{"text": "bro mobiles nowadays are going to get 24gb ram from this year 🤣😂🤣😂🤣", "label": 1}
{"text": "r/pricacy and go ham, whole different world there", "label": 1}
{"text": "why is your generation so docile?\n\nyou could just explain the problem instead of thanking me for watching? 🤣🤣🤣🤣🤣", "label": 1}
{"text": "why is your generation so docile?\n\nyou could just explain the problem instead of thanking me for watching? 🤣", "label": 1}
{"text": "\"should i get them to compensate for damages\" 🤓🤓🤓🤓", "label": 1}
{"text": "Yeah, right. My browser can hover mouse over the thing, click buttons and do things that way. Right? MY BROWSER CAN DO IT RIGHT? That way it would be the same. It's not the same if it interacts with things in background while i do something else.\n\n I have an idea. Let all those freedom hating pussies have their locked up system as an option. I want my system to do my bidding, without a question.", "label": 1}
{"text": "I’ve never seen anyone so passionate about what is at absolute worst the mildest of inconveniences.  Oh no, a prompt on my computer. Bill Gates is clearly Hitler and is guilty of war crimes.", "label": 1}
{"text": "That’s Ai", "label": 1}
{"text": "Rub her nose in it and spank her.", "label": 1}
{"text": "Trying to make her a repeat offender?", "label": 1}
{"text": "I think your assistant is gonna to remove some cables so watch out 😂😂😂😂", "label": 1}
{"text": "I said i want to do something, i don't want no prompts to confirm it. If they want to protect me from some automated processes, they should learn their their os to differentiate between user and program input.\n\n  \nThe prompt is pain in the ass, i don't want it.", "label": 1}
{"text": "£300-400 \n\nCheck cex then post on FB marketplace \n\nBut yeah not a lot my friend", "label": 1}
{"text": "Your PC has a CPU from the future?", "label": 1}
{"text": "Easy £600 if you negotiate a bit", "label": 1}
{"text": "![gif](giphy|3o85xHi4t2UsuIY9QA)", "label": 1}
{"text": "€470.", "label": 1}
{"text": "Bullshit", "label": 1}
{"text": "Can you elaborate why?", "label": 1}
{"text": "1998 or go fuck yourself", "label": 1}
{"text": "16GB of RAM in 2024 isn’t great nor good. It will do and the buyer will make a mention of that. Plus the 5600X is 4 years old, and the 6700 XT. But those are the main poonts why.", "label": 1}
{"text": "ebay each component, find recent sale price, add them all together and take 10-20% off total.", "label": 1}
{"text": "Then how each components would go for?", "label": 1}
{"text": "There's a website called Partpicker which should show you the price of a lot of these parts on amazon and some other sites.\n\nFactor in the fact they're all used, and do the math of how much less the pc should cost. Also factor in the fact that the pc is already built, and the buyer needs not concern himself with the building aspect of the pc.", "label": 1}
{"text": "I don’t know. I just know the overall avg for the whole PC being sold.", "label": 1}
{"text": "Where do you live? Because here in France, we don't have the same price for computer components.", "label": 1}
{"text": "I am in Canada.", "label": 1}
{"text": "![gif](giphy|4LRkCWLi2MKOc|downsized)", "label": 1}
{"text": "You are asking an international subreddit what the pricing would be on a PC in a particular country. Prices can vay widely even within a country.\n\nThen when someone answers you, you ask them to break it down for you. Why don't you do your own research from listings in your own area...", "label": 1}
{"text": "$800 to 900$USD", "label": 1}
{"text": "I checked the price in my area, and it should be for 900€ used and 1200€ brand new.", "label": 1}
{"text": "If we take German pricing 450-500€ is a good range. Unfortunately you don’t get the NVIDIA gpu, which doesn’t matter for actual gaming performance, but Fortnite kids love that green NVIDIA sticker and non knowledgeable buyers want NVIDIA GPUs. Making it harder to sell amd GPUs at the same price, even if performance is equivalent and they have more vram", "label": 1}
{"text": "you can sell it well above for $1000usd just for rx 6700xt and upgrade that ram to 32gigs", "label": 1}
{"text": "Delusional, there are better options on leboncoin for that price range", "label": 1}
{"text": "keep it real ❤️❤️❤️💪🏼😜", "label": 1}
{"text": "Buy some cable management equipment, you can buy trays for running the cables under your desk for example.   \n  \nUnplug everything and take it out of the room, then bring in one PC and put it so the back is facing the wall when you're finished. Then plug things in again one at a time and really give some thought as to where the wires will need to be run.   \n\nMove those drawers that the PC is currently on closer to the desk so that the wires can naturally run down the back of it, then to under your desk and into the cable management trays.   \n  \nThe second PC will need more work but you could potentially move it to the other side of your desk and repeat the same process from that side, keeping the back of the PC facing the wall again.", "label": 1}
{"text": "There's not, where I live.", "label": 1}
{"text": "Another person that had a \"pen-ile\" accident.", "label": 1}
{"text": "Clean it before it dries. Water and cloth!", "label": 1}
{"text": "https://i.redd.it/fcvxt7hr84xd1.gif", "label": 1}
{"text": "What the fuck were you gooning to bro 😭", "label": 1}
{"text": "Why is your generation so imbecilic? You could just, you know, use your rotting brain to see that the stream's window is cut out in a piece over the browser like a ghost image, instead of asking people to chew it out for you.", "label": 1}
{"text": "https://preview.redd.it/x9b3e2loc4xd1.jpeg?width=1638&format=pjpg&auto=webp&s=53b54c42e0f5c4c43bf8d16614f570aae11cf45f", "label": 1}
{"text": "ستمتع بتجربة تسوق في متجرنا الأفضل لبيع الجوالات والاكسسوارات احصل على أحدث الهواتف الذكية بأسعار لا تقارن منصة التسوق الإلكتروني الرائدة في المملكة [https://newklma.com/](https://newklma.com/)", "label": 1}
{"text": "This is why we keep tissues and wet wipes close by.", "label": 1}
{"text": "Ya know. I like to bonk, but I've been thinking about trying out the honk. Maybe this is a sign.", "label": 1}
{"text": "Praise be the he HONK stick (plays chin music gracefully)", "label": 1}
{"text": "https://preview.redd.it/8h4asv1mj4xd1.png?width=412&format=pjpg&auto=webp&s=c618fd9395a10a38de467e0b0b6f1cba7f64a00f", "label": 1}
{"text": "Was this metallic paint marker stored in a cylinder?", "label": 1}
{"text": "\"paint\"", "label": 1}
{"text": "https://www.theverge.com/24216305/intel-13th-14th-gen-raptor-lake-cpu-crash-news-updates-patches-fixes-motherboards", "label": 1}
{"text": "No, fuck off.", "label": 1}
{"text": "Ah...metallic paint, did it come from your \"cylinder\"?", "label": 1}
{"text": "Another one of these shit spam posts. Fuck off. Delete this shit", "label": 1}
{"text": "I agree with that! Light hearted comments and even something like “try using a Brillo pad to scuff everything else up so it matches” are way better than the  “OMG YOU IDIOT! 😂😭😂😭 GKY” edgelord comments.", "label": 1}
{"text": "I think it's weird when people absolutely feel the need to be mean, make back handed compliments, or basically say \"you do you in a way\" that doesn't indicate solidarity. Like, if I don't like something that ultimately doesn't effect anything but the op, I just move on, or if I'm feeling spicy maybe a downvote. The only time i care enough to use any energy to comment in a \"negative\" way is if the post/comment is spreading misinformation, and even then I aim for neutral(doesn't always work well because text being difficult to interpret the tone of w/o knowing the person, and well, I'm also autistic)", "label": 1}
{"text": "Bunch of clowns in the comments.", "label": 1}
{"text": "Aggressive goon sesh", "label": 1}
{"text": "The wired and wireless movie cost the same wtf are you even talking about. They don't care what you buy as long as you buy a mouse they aren't going all dipshit foil on head conspiracy about it", "label": 1}
{"text": "ur probably retarded", "label": 1}
{"text": "LOOLLLL", "label": 1}
{"text": "delete system32", "label": 1}
{"text": "I’m new to computers so i am could u explain why ? 😅", "label": 1}
{"text": "I used to use one of these when the arm on my old chair broke but I wasn't quite ready to buy a new chair yet.  it worked fine, no complaints.  It did what it was supposed to do.", "label": 1}
{"text": "Behave. Absolute worst case if a PSU isn't able to provide what a GPU demands, you get instability.\n\nIf pigtailing caused fires, this sub would be absolutely awash with posts of burned out GPUs, PSUs and cables.\n\nAside from the 12vhpwr debacle, that has never ever been the case. It doesn't happen.", "label": 1}
{"text": "👏👏👏👏👏 congratulations", "label": 1}
{"text": "just by scrubbing it you can solve it", "label": 1}
{"text": "F", "label": 1}
{"text": "Name and shame.", "label": 1}
{"text": "This site needs to fuck off. How are there assholes trying to take out the wayback machine when this turd is just begging for it.", "label": 1}
{"text": "Ive never had a monitor fail.", "label": 1}
{"text": "What do you expect from  \"New Era\" employees? lol", "label": 1}
{"text": "If you're gonna call someone a 🤡 At least know the difference between your & you're. You fuckface.", "label": 1}
{"text": "I know you people are too stupid to actually inform yourselves on topics before speaking on them but the intel chip is basically 2 years newer and as for the 4% better that means the average cpu benchmark for all the people who tested using all different components with that cpu were 4% more calculation than the average amd benchmarks......you people are too dumb to even own what im sure u got prebuilt", "label": 1}
{"text": "Im just sick of reading retarded little kids like you who get all their info from streamers because you have no brain and no ability to research and test things yourself let alone do proper research.........then have the audacity to voice an \"opinion\" youre a delusional xyz entitled generation who identify as morons apparently", "label": 1}
{"text": "F", "label": 1}
{"text": "To my fellow owners of good monitors, that is a few generations behind. I myself use a msi monitor from 2016 where the bottom has random defective horizontal lines that spazz out until it \"warms up\" from being on long enough to work. It's a nice curved monitor with 144hz refresh rate. It won't die. I was gonna upgrade this coming black friday.", "label": 1}
{"text": "congrats 🫶 i have one similar", "label": 1}
{"text": "prolly the r5 5600x", "label": 1}
{"text": "probably dont trade the gpu is decent but your best bet is probably keep your xbox \n\n  \n[game benchmarks here](https://www.youtube.com/watch?v=JmwMZM9oCMU)", "label": 1}
{"text": "w/e ??", "label": 1}
{"text": "everything is so expensive in canada so if thats the only pc store near by than yes prob worth it", "label": 1}
{"text": "no, that is a bad decision", "label": 1}
{"text": "sure! take it and check how much is the difference 🤲", "label": 1}
{"text": "this is my dream mouse.", "label": 1}
{"text": "Imagine you tripped and sat on it.😁😂😂😂", "label": 1}
{"text": "Looks cool. That’s how to get the tards to buy stupid stuff… hahah enjoy your triangle, weatherboy.", "label": 1}
{"text": "My 1080 from 2018 is still chugging. Even thought I abuse it with 3 monitors, 1440p, and playing games with 50 tabs open. It still pumps way better than it should. I’m gonna have to retire it soon", "label": 1}
{"text": "Don't sell stuff on Amazon, then, that's all part of the risk.", "label": 1}
{"text": "Your paying for it in the price you pay. things would be less expensive if ass clowns wouldn't buy a whole rig then return them.", "label": 1}
{"text": "probably not u could build this yourself for less and its probably a i5 12400f and a 446gb ssd and 222gb ssd doesnt even make sense", "label": 1}
{"text": "btw if your just on a budget build it yourself because without the aio it will be like 50-100$ less depending on the air cooler u would get", "label": 1}
{"text": "i bought it about 2 months ago its good but to expensive for what your getting really it 90$ for 16gb ddr or 100 for 32 gb ddr 4 so no patriot viper steel ram is much better", "label": 1}
{"text": "Close...I mean, you're looking right at it, but seeing the wrong thing.", "label": 1}
{"text": "ok", "label": 1}
{"text": "thx for letting me know i thought they were making up numbers lol😂", "label": 1}
{"text": "ok ill check", "label": 1}
{"text": "The I on the bong, is it from apple like your \"pc\"", "label": 1}
{"text": "i cant tell but is this the same thing \n\nhttps://preview.redd.it/wcaomvmvl9xd1.png?width=671&format=png&auto=webp&s=8c917d68f9525b014fc5ba93967fb9fde338ef0f", "label": 1}
{"text": "Oh Sheesh this mouse so good. Where to buy it? What's the code?", "label": 1}
{"text": "I agree, sometimes it feel like it's ran by bots", "label": 1}
{"text": "Seen some people getting banned for no reason", "label": 1}
{"text": "There's always a reason.", "label": 1}
{"text": "Someone who agrees!", "label": 1}
{"text": "They all fuck ugly", "label": 1}
{"text": "My lungs can feel the mold that’s growing inside that bong.", "label": 1}
{"text": "Actually, it's one of the best ones, mate. \n\n\nI know of several worse ones.", "label": 1}
{"text": "screw you and your attention-whoring ways", "label": 1}
{"text": "Nope, condolences on your cat….\n\nI’m sure the farm up north will take good care of it.", "label": 1}
{"text": "OP what solved your issue?", "label": 1}
{"text": "He is 100% a cunt, you could sense it even from his prior responses\n\nHe is the epitome of \"bitch baby\"", "label": 1}
{"text": "Wow….that was totally uncalled for.", "label": 1}
{"text": "I get your frustrations, leave a message on Facebook, or Reddit even, I don't live in the USA so I don't know about local help communities and such. \n\nIsn't Craiglist something that can help? I don't know, ask for help. Friends, classmates, teachers, everyone. Don't stay alone, people can help you, I hate scammers too but this is not the time to stay angry st this issue. \n\nWe are all humans and we tend to be less solution oriented in times like that.\n\nSo remember, you can take care of this, but right now focus on finding support, maybe some people can lend you a laptop or desktop powerful enough.\n\nGood luck.", "label": 1}
{"text": "Library was just a generic response, you're right, I don't know what type of machinery you need or how your assignments work, that is your problem to figure out\n\nWhining and kicking and screaming on the internet ain't a solution, in fact you almost seem like a scammer/beggar to me which is a semi common occurence on these subreddits.  \n\nAlso, maybe if you weren't a douchebag you'd have a friend, family member or otherwise to borrow a computer from that is more capable but, you probably don't, cuz you're a bitch", "label": 1}
{"text": "Butcher, that you?", "label": 1}
{"text": "This definitely sucks as a domino effect dude and I hear you 100% you don't deserve to be barked out, I dont know what you said prior edit but I'm sorry you got reddit jumped, lol. I don't buy from Amazon anymore for anything but cheap junk that I can expect will be cheap.", "label": 1}
{"text": "I don't even need to look at yours to feel the same about you. \n\nFuck You.", "label": 1}
{"text": "Computer labs computers will be easily powerful enough. Get access to them via your student services. Not everyone doing your course will have a powerful PC so the institution will have alternate pcs for them.", "label": 1}
{"text": "What ram generation, ddr3 or ddr4?\n1tb ssd or hdd? Sata or nvme?\nWhat case does it have?", "label": 1}
{"text": "I didn't edit the text above I just edited to add the ML and DL bit. I know lol. Thanks for cheering me up.", "label": 1}
{"text": "Bro, grow up.\nEveryone who been to college has faced similar problems.\n\nDo or don’t. There are a million work arounds to your problem but clearly you’d rather lash out at strangers online.", "label": 1}
{"text": "I do have friends, however they can't lend me their own machine because they need it to also finish their assignments. None of my family members that live near me have any background on computers. I may have been frustrated and lashed out on you and I apologize about that.", "label": 1}
{"text": "Man,who came in your oat  flakes this morning? You seem like a Cunt as well.", "label": 1}
{"text": "I almost feel that he is trying to dupe Amazon and its seller, and he did indeed get a 5700X in the box but is trying to act like his whole world is hurt, just to return the Athlon CPU for a refund and get that sweet free upgrade.", "label": 1}
{"text": "Haha jokes on you that made me laugh. I bet you wanted to make me upset instead?", "label": 1}
{"text": ">Shut the f*** up. If I had any other way to do my work I wouldn't be agitated. You have 0 idea about the situation yet still talk shit as if you know shit.\n\nIf you're going to be aggressive about it towards people online trying to help, why did you even post this online? Frustrated or not, that does not give you an excuse to flame others..\n\nEither way, heard of the used market? Go on there and buy one there. Probably cheaper too...", "label": 1}
{"text": "Thats my thought on most posts like this. They post it as proof they are the victim.", "label": 1}
{"text": "His major sounds like it is designing ai", "label": 1}
{"text": "Bro you are kinda dumb for relying on a single purchase for one single damn part to make or break your semester. If you looked at the planner/ schedule you would a known this project was coming up for months and you last minutes bought something?", "label": 1}
{"text": "Yea, imagine your first thought when something like this happens and time is so very precious and the stakes are so very high, ...TO REDDIT I GO TO POST ABOUT THIS!", "label": 1}
{"text": "You're an asshole. Go kill yourself", "label": 1}
{"text": "If someone ***came*** in my oat flakes that would be upsetting? Literal free protein.\n\nYou need to seriously work on your idioms!", "label": 1}
{"text": "Maybe don't order a part at the last minute like a moron and just do what you can with limited resources. If you explain that you have limited resources or are on the poorer end of things nothing\nWould matter unless you have known about the project the entire semester. In that case you procrastinated to fail", "label": 1}
{"text": "Woah woah calm down there falcon. I have admittedly been an asshole but that doesn't warrant the \"kill yourself\" bit there.", "label": 1}
{"text": "Occam's razor applies here. Just because anonymity on the Internet makes it super easy to misrepresent doesn't imply that most people become downright malicious.\n\nThe factS are:\n\n- colleges vary in quality a lot, university as well\n- it's even worse in countries with for profit higher Ed \n- computing infrastructure for students is usually an afterthought \n\nImho, OP: don't fuck around with local environments, use paperspace or Google colab and worst case pay for some compute credits if you want to accelerate your results. \n\nIf your assignments specifically include the on-device MLOps part as a deliverable the. You have the choice of \n\n- asking for an extension explaining the situation \n- delivering the results but explaining why your repo doesn't include scripts for standing up a local dev and training environment \n\n\nAppears very fixable to me. Done right, the compute is never the problem, the small bugs that keep your pipeline from executing properly are. If you have issues in training and you took care to get on the fly debug outputs, then you can intervene early and abort the compute session if you run into NaNs or gradient collapses etc.", "label": 1}
{"text": "Get good scrub", "label": 1}
{"text": "I dont remember RAM gen but it is a 2133mhz. 1TB HDD, Sata. It was a pre-built, case is an Asus ROG.", "label": 1}
{"text": "\nImho, OP: don't fuck around with local environments, use paperspace or Google colab and worst case pay for some compute credits if you want to accelerate your results. \n\nIf your assignments specifically include the on-device MLOps part as a deliverable the. You have the choice of \n\n- asking for an extension explaining the situation \n- delivering the results but explaining why your repo doesn't include scripts for standing up a local dev and training environment \n\n\nAppears very fixable to me. Done right, the compute is never the problem, the small bugs that keep your pipeline from executing properly are. If you have issues in training and you took care to get on the fly debug outputs, then you can intervene early and abort the compute session if you run into NaNs or gradient collapses etc.", "label": 1}
{"text": "How much gb is sata and how much is hdd? Check the bios for the ram. It could be ddr4 locked in at 2133 wasting potential or it could be ddr3. \nYou can also check the ram stick, if it says PC3 then it’s ddr3. Check those first and I’ll tell you how much you can aim to sell for", "label": 1}
{"text": "Yes you can get a windows key for $5.\n\n\n\nThe last one I used was electronicfirst.com (in 2019 though!) and got it fine.", "label": 1}
{"text": "I would guess thats because its an powerPC", "label": 1}
{"text": "Not buying nice things because of cats. That's a nice way of saying you are poor lol", "label": 1}
{"text": "Consistently at 150-200fps? Under heavy or casual load? Because my son gets 500+ fps just standing still in Fortnite lol. Haven’t checked second hand in a bit but I don’t think you’d get any push back selling for $250-300. A lot of people looking to get young kids a “gaming pc” to play Minecraft/roblox and other lightweight games and these are excellent options since most of these kids will have less play time and won’t be consistently pushing the limits.", "label": 1}
{"text": "Embrace the damage, it's unique feline certified design feature.", "label": 1}
{"text": "You can buy retail keys as well for like 5$", "label": 1}
{"text": "> I worked with Amazon for 5 years \n\nLet me guess you got fired because you were an insufferable human being to everyone around you, because that's what you sound like in this comment section", "label": 1}
{"text": "Womp womp bitch", "label": 1}
{"text": "Just buy it as a service from aws or plug in the drive into another pc", "label": 1}
{"text": "Yeah, stopped long ago. Apparently working hard to save the company money wasn't worth the measly raises they gave.", "label": 1}
{"text": "HA! I didn't think of that.", "label": 1}
{"text": "Put the cat to sleep", "label": 1}
{"text": "Yeah the monitor, they will play farming sim on 1440p lol", "label": 1}
{"text": "I think your cat needs revival too. \n\nHonestly, your fault, a dog would never do this. \nCats are mean mf’s", "label": 1}
{"text": "I’d recommend using Google Colab for any ML projects while your PC is in disrepair.", "label": 1}
{"text": "Idk you still comment like their baby batter is dripping off your lips.", "label": 1}
{"text": "Maybe you weren’t worth the money.. you seem like a total piece of shit so maybe that had something to do with it. Also working in fraud protection at Amazon isn’t the flex you think it is.", "label": 1}
{"text": "You sound like a fun person", "label": 1}
{"text": "Or your an asshole assuming this guy did something wrong, when he likely got duped by a crappy Amazon seller.\n\nHe literally has 3-4 posts in regards to his PC problems. \n\n\nBeing a corporation knob licker must be your thing tho.", "label": 1}
{"text": "Not only that but he's probably trying to return an old CPU to get another new one.", "label": 1}
{"text": "How many months did you have issue with your pc? So instead of fixing it you played warframe? If you fail, you fail.", "label": 1}
{"text": "DDR4. 233GB SSD. 932GB HDD.", "label": 1}
{"text": "If you made all that rely on a single purchase of a random vendor on amazon and are blaming anyone but yourself then reconsider all your life choices. \nIt's not even a real problem, you will get your refund. \nJust sucks too miss those bucks for the meantime. \nGuess you should have used paypal 30 days (not amazon) or should have went to a real store. Even amazon offers rates as payment without interest.", "label": 1}
{"text": ">How much gb is sata and how much is hdd?\n\nThe HDD is 1TB and it is using a SATA connector.", "label": 1}
{"text": "Me when my parents didn't love me enough", "label": 1}
{"text": "I wasn't even replying to you lol. But you're an asshole too, probably.", "label": 1}
{"text": "From the start I got the sense there's more to this story that we don't know and they are using this incident as a reason to fail. They should be explaining this to his Uni a random sub.", "label": 1}
{"text": "You guys are more dangerous than him.", "label": 1}
{"text": "Aspergers", "label": 1}
{"text": "All calmed down now. You are right I wasn't calm at the time.", "label": 1}
{"text": "Don’t let Asperger’s get you down", "label": 1}
{"text": "Did you ignore the other guy?", "label": 1}
{"text": "I don't know why you're being so heavily downvoted, that other guy spoke out of pure ignorance.", "label": 1}
{"text": "Might want to read what OP was replying to. That helpful commenter threw a few insults and rude comments in there along with the good advice. A fuck off is pretty warranted.", "label": 1}
{"text": "Yeah, the person he replied to had good advice mixed in with a couple insults that were quite uncalled for. Asshole comments often are in reply to asshole comments.", "label": 1}
{"text": "Speaking truth", "label": 1}
{"text": "Yeah, that's probably what I would have done too. He might also be able to look into cloud solutions to provide the GPU power. It might cost a bit to run, but then you literally just need any semi-capable laptop to run the thing. If that's not an option either then... yeah, he is fucked and will have to have ask for an extention due to extenuating circumstances.", "label": 1}
{"text": "Someone didn't like that statement haha, wonder which sex it was 🤔", "label": 1}
{"text": "It was me. Don't bring that incel shit in here.", "label": 1}
{"text": "It’s ok. I don’t really care about your opinions. But hey, thanks for the feedback I guess 😂", "label": 1}
{"text": "Wait until real problems plague your world.", "label": 1}
{"text": "😢", "label": 1}
{"text": "It’s morally dubious at best to feed you cats chrooms, man. 🍄🍄‍🟫😡", "label": 1}
{"text": "Don't let people give you access to the internet", "label": 1}
{"text": "Your initial reply had a condescending, cunty undertone and proved entirely unhelpful. I am not surprised the stressed out college kid responded in kind. But way to hurl insults at him and make baseless claims like any intelligent, successful adult would. You really showed him. 👍", "label": 1}
{"text": "Stop being a lazy little bitch and ask your ask your school for help.", "label": 1}
{"text": "So if someone with an std came in your oat flakes you would be fine with it?", "label": 1}
{"text": "And in those cases AMD X3D cpus lose to Intel CPUs.\n\nhttps://i.imgur.com/oiXzcjL.png", "label": 1}
{"text": "![gif](giphy|CAYVZA5NRb529kKQUc|downsized)", "label": 1}
{"text": "Monitors are relatively cheap.", "label": 1}
{"text": "Shut up incel.", "label": 1}
{"text": "good thing you'll never have to worry about that eh", "label": 1}
{"text": "God I really hate Reddit. Obviously the OP is pissed, rightfully so, and knows his own life and situation way better than random Redditors, but he wrote a couple of comments in a surly tone and everyone reading took it personally. Then unthinking people like you pile on him with all these rude and presumptive comments, saying how he must be a terrible person. While also implying that Amazon's problem is somehow his fault.", "label": 1}
{"text": "Don’t feel bad about lashing out at that guy, I read his replies and he sounds like such a fucking loser lmao. Offered nothing of substance just came here to be a cunt and act condescending to get a reaction out of you.  Best of luck with your assignment.", "label": 1}
{"text": "Lol, you're gonna get banned bro, be careful.", "label": 1}
{"text": "lol life isn’t going to treat him with white gloves. a dose of reality is fine, he wasn’t a dick about it", "label": 1}
{"text": "Damn, you picked a garbage college", "label": 1}
{"text": "Bruh, don't listen to any of the people in you're replies, most of them are just losers.", "label": 1}
{"text": "> Then get literally any piece of shit laptop that can access the cloud service and run the needed programs and languages.\n\nI literally just said that. Please, don't answer if you didn't read the comment, it's not a good look.", "label": 1}
{"text": "Probably anybody who stands any chance of ever sex. Go play with your toys somewhere else.", "label": 1}
{"text": "where'd you post the joke?", "label": 1}
{"text": "Yeah, an upgrade from the Athlon THEY INCORRECRLY RECIEVED. OP payed for a 5700X and got an athlon and now you decide it's their fault and they aren't the victim and are just trying to get upvotes. Use your brain, please.", "label": 1}
{"text": "Fr fr. Personally for OP an alarm set 😂😂😂 people are crazy man", "label": 1}
{"text": "You and OP both should have picked better institutions to get degrees from. Holy hell. I understand the allure and low tuitions of degree mills, but seriously?", "label": 1}
{"text": "Small country, less options. We do get *paid* to study here, so that's supposed to cover expenses like this.", "label": 1}
{"text": "OP is probably taking this program either at a podunk CC in Nowheresville Wyoming, or at a degree mill. No properly ran state institution (think east coast state schools) would not give him the resources he needs in a pinch to get his assignments done. Computer labs galore (yes, even with surprisingly powerful GPUs).", "label": 1}
{"text": "That’s good man! Stipends rock and allow you to study more stress free. \n\nOP sounded more like a whiny american kid so I was coming at it from that angle. I apologize, my comment was harsh.", "label": 1}
{"text": "I don’t think ordering a part last minute because the previous part failed makes one a moron.", "label": 1}
{"text": "I am willing to guess it is people who actually have sex.", "label": 1}
{"text": "So you're dating a man?", "label": 1}
{"text": "Oof temper tantrum there mr man. Someone needs a nappy before praccy. \n\nNo one is saying the computers are good or it isn't harder. What they're saying is life fucking sucks sometimes and we gotta make do. \n\nWait till you get out of college homie. It only gets harder and you're the only who is coming to save you.", "label": 1}
{"text": "Are you being honest or is it a joke? \n\nSchrodinger's incel.", "label": 1}
{"text": "If you are trying to get women this way it’s not gonna work. May I suggest try talking to a woman in real life?", "label": 1}
{"text": "You’ve never seen how gay many straight men can get. They absolutely go through an experimental phase, it’s just society looking down on it.", "label": 1}
{"text": "Thank you 😅 muppit thinks so too, he just needs a crumb of attention", "label": 1}
{"text": "Hey ma! We got another one! This minch is also filled with sand", "label": 1}
{"text": "Yeah, I do respect women. \n\n(But you don't have to mention the dead. Super inconsiderate.)", "label": 1}
{"text": "Touching each other and talking about fucking each other up the ass is a totally different thing than actually doing it tbh. I honestly have never seen 2 straight men tongue kiss each other. Plenty of women do that just for fun. And scissoring, don’t forget about that.", "label": 1}
{"text": "...it's not a choice for anyone.", "label": 1}
{"text": "This guy throwing around his fuck you money.", "label": 1}
{"text": "Then why are women switching teams all the time?", "label": 1}
{"text": "Aye the computer labs at Uni for me helped. For some reason Anasys Fluent wouldn't run on my PC, only on my shitty laptop. So they gave me access to the computer labs. Those PCs weren't good for gaming but they had some powerful CPUs and some mid tier Quadros.", "label": 1}
{"text": "Knew you would respond with that. Simple case of a STEM not understanding economics so they project with something... related to college? \n\nKeep researching to uncover that story start to finish and stop belittling smarter people than you in the name of reddit karma.", "label": 1}
{"text": "The cloud solutions is also a good idea, you could remote into the Uni's computer lab too on your own PC off campus. I never tried it though tbh.", "label": 1}
{"text": "You want me to care, I want you to stop being pitiful. Both aren’t gonna happen…", "label": 1}
{"text": "What the hell *would* you even care about?", "label": 1}
{"text": "Too bad I'm married already. Think 1 whooping wasn't enough for you incel.", "label": 1}
{"text": "Dude just stop, it was already sad and now its getting pathetic...", "label": 1}
{"text": "She must be miserable having to deal with someone as infuriatingly dense and dickish as you. Hope she takes your stuff in the inevitable divorce:)", "label": 1}
{"text": "Women aren't the only ones who are \"switching sides\". I prefer the phrase \"exploring their sexuality\", Its a much less messy term, and has less assumptions. Nitpicking aside, they're doing just that- exploring their sexuality. Men do get that opportunity too, and I feel bad for you that you felt like you couldn't. Or I envy you for feeling so solid in your sexuality. \n\nAside from that, you seem to be working off the assumption that women in particular go back and forth between sexualities. Funnily enough there's a separate sexuality for that, called being bisexual/pansexual. \n\nThe last thing I'll add is I think you're ignoring the hits and counting the misses. I don't think you're actively doing it, it's a subconscious thing that everyone does.", "label": 1}
{"text": "Wc", "label": 1}
{"text": "I’ll entertain your lack of creativity. Please, go on. ", "label": 1}
{"text": "Ey mate get outta here and go fuck yourself", "label": 1}
{"text": "Seems like you have plenty of experience with that. I’ll leave it up to you if you don’t mind…", "label": 1}
{"text": "You talk a big talk for a dude that can’t repair his own computers lol", "label": 1}
{"text": "hey even hitler had a girlfriend", "label": 1}
{"text": "It isn’t just 1440p?", "label": 1}
{"text": "They stated, clearly confused.", "label": 1}
{"text": "Keep going", "label": 1}
{"text": "rip", "label": 1}
{"text": "Yes, surprisingly not everyone is rich. What's the big deal? You're saying that like it's something to be ashamed of.", "label": 1}
{"text": "Fonte bomba 💣💥💥💥 da loja que explode kkkkkkk", "label": 1}
{"text": "Here is the PCPartPicker list for the link you provided.  [Here's how to do it on your own.](https://i.imgur.com/upztBRs.png)\n\n----\n\n[PCPartPicker Part List](https://nl.pcpartpicker.com/list/qM6d89)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [Intel Core i3-7100 3.9 GHz Dual-Core Processor](https://nl.pcpartpicker.com/product/J9X2FT/intel-core-i3-7100-39ghz-dual-core-processor-bx80677i37100) | €3.00 \n**Motherboard** | [Gigabyte GA-B150-HD3P ATX LGA1151 Motherboard](https://nl.pcpartpicker.com/product/Hh38TW/gigabyte-ga-b150-hd3p-atx-lga1151-motherboard-ga-b150-hd3p) | €20.00 \n**Memory** | [Crucial Ballistix 16 GB (2 x 8 GB) DDR4-3200 CL16 Memory](https://nl.pcpartpicker.com/product/BxTzK8/crucial-ballistix-16-gb-2-x-8-gb-ddr4-3200-memory-bl2k8g32c16u4b) | €20.00 \n**Storage** | [PNY CS900 500 GB 2.5&quot; Solid State Drive](https://nl.pcpartpicker.com/product/XshmP6/pny-cs900-500-gb-25-solid-state-drive-ssd7cs900-500-rb) | €29.77 @ Amazon Netherlands \n**Video Card** | [MSI RX480-8G Radeon RX 480 8 GB Video Card](https://nl.pcpartpicker.com/product/PmrcCJ/msi-radeon-rx-480-8gb-video-card-rx480-8g) | €50.00 \n**Case** | [Antec AX20 ATX Mid Tower Case](https://nl.pcpartpicker.com/product/HZ9wrH/antec-ax20-atx-mid-tower-case-0-761345-10060-1) | €44.99 @ Amazon Netherlands \n**Power Supply** | [YEYIAN Raiden 500 W 80+ Certified ATX Power Supply](https://nl.pcpartpicker.com/product/6ydG3C/yeyian-raiden-500-w-80-certified-atx-power-supply-yfw-50020-01) | €39.99 @ Amazon Netherlands \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **€207.75**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2024-10-27 19:36 CET+0100 |\n\nThis bot is in **no way** associated with PC Part Picker.\n\n----\n\n*[I am a bot](https://i.imgur.com/hfRIhMe.png)* -  This action was done automatically. Please direct any questions or concerns ( or bug reports ) to [\\/u\\/eegras](https://www.reddit.com/message/compose?to=eegras&subject=&message=) - [About /u/PCMRBot](https://pcmasterrace.org/pcmrbot_old)", "label": 1}
{"text": "\"haha I was only pretending to be retarded\"", "label": 1}
{"text": "It's an Austrian site, but nevermind...", "label": 1}
{"text": ">Knew you would respond with that\n\n\"I knew you'd prove me wrong\" is certainly a take", "label": 1}
{"text": "yeah i totally didnt add that \"lol\"  and totally didnt edit my comment. Looks like reading with understanding is too much. That comment must have stung deep", "label": 1}
{"text": "what a fucking drug addict", "label": 1}
{"text": "Your price is in rule 8", "label": 1}
{"text": "Thank fuck you are conceding. Thought this would be a case of putting your fingers in your ears to act like you won a consolation prize.", "label": 1}
{"text": "LG 27GP850P-B nano IPS. It was on sale 2-3 weeks ago on amazon under 200. regular price around 250.", "label": 1}
{"text": "We don’t mentiom that whore’s name in this house….", "label": 1}
{"text": "What a fucking dick\n\nGet a fucking life", "label": 1}
{"text": "says the one who smokes his life away\n\nbruh", "label": 1}
{"text": "You're *still* here? Why the fuck do you care what I do with my life? I'm not the one sitting in mom's basement judging people, you ignoramus. \n\nbruh...cut your shit. You aren't even *remotely* worthy of textually sparring with me right now, kiddo.\n\nBut hey, keep poking the bear, bruh. Meanwhile, I'll take another hit and mellow out, maaaaaaan.", "label": 1}
{"text": "Avoid Intel 13th and 14th gen like a plague.  I would probably avoid 15th gen too but for different reasons.", "label": 1}
{"text": "Windows 11 hasnt been 'unstable' since early 2020.  Its 2024.  It has quite literally been THE most stable Windows operating system of all time for 4 years.\n\nYes. Its VERY good.", "label": 1}
{"text": "Common Sense.  Literally the only currently available components that you even need to worry about are CPU to Motherboard and Motherboard to Case.  Literally every single other component will work with every single other component.  Obviously an ATX or larger motherboard will not fit in an ITX case.  That should be common sense.  An Intel CPU will not fit in an AMD Motherboard.  Also common sense.", "label": 1}
{"text": "Non-Laptop PC's require a wired internet connection 99.999999999999999999999999999999% of the time upon first boot.  This is why literally no one uses Wifi on Desktops.", "label": 1}
{"text": "I'm an IT Professional too, I'm just not an insufferable dickhead.  \nYou know most of this sub hasn't paid for Windows and you know that makes it ridiculous *for them* to complain about monetization.", "label": 1}
{"text": "I’m an IT Director.  The irony isn’t lost on me, it’s partially why I love when people give me an opportunity to defend Microsoft.  Sorry to say, their shit just works.  I’ve heen using O365 for my personal email for a decade.", "label": 1}
{"text": "It 100000000% DOES affect performance.  It is LITERALLY a Virus.  Your PC is running 40-60% slower because of it.  \n\nI STRONGLY suggest talking to someone in power and getting your IT department transferred to a different company. They obviously know absolutely nothing whatsoever about computers.  They should not be allowed to keep their jobs.", "label": 1}
{"text": "Nevermind you are more incompetent than the IT morons..", "label": 1}
{"text": "You are getting exactly the FPS that you should be with that hardware.  There is no issue here.  You think your hardware is better than it is.  It is not.", "label": 1}
{"text": "How about every time you launch an Office app, it forces you to look at the \"new and exciting feature they added!!!\"  which does nothing but take up memory.  Every time I need to open an Excel doc I say \"no, now fuck off and let me work on this\"", "label": 1}
{"text": "This is basically the equivalent of saying Hitler did nothing wrong.", "label": 1}
{"text": "\n*\nI started experiencing the same pain about 20 years ago. I've since been using the IMAK Computer Glove to help avoid those pains.\n\nThroughout the years, I've bought different mice designed for the three different grip styles. Nothing made a difference, but what did was the glove.", "label": 1}
{"text": "+1", "label": 1}
{"text": "uhhh... It doesn't take a genius. \n\nSearch up \"7600 XT drivers\" and click the top link", "label": 1}
{"text": "Don’t need to be a dickhead", "label": 1}
{"text": "i'm not trying but it seems like a pretty straightforward thing", "label": 1}
{"text": "Yes", "label": 1}
{"text": "Yes", "label": 1}
{"text": "Yes", "label": 1}
{"text": "Fuck off", "label": 1}
{"text": "Sounds like someone's computer can't run the superior version", "label": 1}
{"text": "Actually youre the funny one if youre this delusional.", "label": 1}
{"text": "Don’t place anything under your wrist. The support holding the arm should be just after the elbow.", "label": 1}
{"text": "Empresa horrível. Não tentam resolver nada. Eles só enviam uma mensagem automática avisando que o monitor está fora da garantia e que vou ter que pagar pelo conserto. Tem um caso parecido com o meu aqui no sub r/Monitors, o cara inclusive é BR e o dele (mesmo modelo) também parou de funcionar do mesmo jeito com 1 ano de uso.", "label": 1}
{"text": "lmao you really got pissed, calm down kid, LG won’t give you anything", "label": 1}
{"text": "the most subhuman autistic user in any online community uses it and will both chastise you for not using Linux while also being clueless as to why people don't use Linux in the first place. its an amazing OS as long as you are ready to learn computer programming just to use everyday functions.\n\nits like being confused why dwarf fortress is not the most played game on steam.", "label": 1}
{"text": "Honey you have 0 self reflection and got pissed over a monitor calling me a whore. Do me a favor again and talk to your mom like that with that dirty mouth.\n\nDont get hissy because people dont wanna believe your conspiracy theories and move on with your broken ass monitor.  You just proved youre very immature and probably still a kid yourself by going off on people online like this. \nSo go on? Im not impressed by some self absorbed 18 yr old hormonal boy who probably lives at home and gets a new monitor from daddy anyways 😂 . Stfu next time please. Take your medicine like they prescribed to you. Delusional ass.", "label": 1}
{"text": "If you were offended, I didn’t offend you at any time, in some comments I use a translator and he ended up translating using the term “whore” which is slang in Brazil for people who waste time. I don’t care about the shit you say, little boy", "label": 1}
{"text": "who the fuck uses windows recall", "label": 1}
{"text": "Yes it's not that I'm to dumb to figure it out it's just I don't wanna ruin a fully working pc that everything works out of the box while Linux wasn't and probably still isn't but getting there", "label": 1}
{"text": "What everyday functions  you are talking about?", "label": 1}
{"text": "For whatever reasons, Linux neckbeards will ignore everything that you've written, and chalk it down to 'user issue' because fuck you, works fine on mine so it must work for everyone.\n\nI'm a multi-distro guy and have used it professionally and as a hobby for 15+ years. Even just this past weekend, I installed Tumbleweed (my favorite distro) and realize that KDE refuses to run my new 240hz monitor beyond 120hz. Spent an entire evening trying every trick in the book, including arcane GRUB kernel parameters, dumping custom EDID and loading it through `initramfs`, and everything else under the sun.\n\nAnd I've come to the final step, that is, I simply gave up, as with ALOT of my Unix-related endeavors. Its all compromises and accepting that certain things will just not work as advertised. 120hz it is I suppose, \\*shrugs\\*.\n\nGuess what, Windows worked just fine out of the box, after installing AMD drivers, boom, 240hz 10 bit RGB mode.", "label": 1}
{"text": "Have you tried searching Google for hours and then making a post on the distro forums so that a flock of neck beards can tell you to search for the answers yourself first?\n\nAnd once they finally offer help, did you copy and paste the obscure commands they suggested that will most definitely fix the issue into your terminal and make the issue even worse?\n\nAnd after reporting that the issue is now worse than when you started, have you taken into account that Linux isn't like Windows and you just need to have an open mind and think about computing differently?", "label": 1}
{"text": "Based", "label": 1}
{"text": "Gulp 😭😭😭😭😭okay", "label": 1}
{"text": "Found the neckbeard.", "label": 1}
{"text": "Teach these all poor souls how connect controller to noobuntu or why sound didn't work after deleting FireFox.\n\nUbuntu have same problems as Windows.   \nYes Mint exists and it's better but YOU still recommend Ubuntu for some reason.", "label": 1}
{"text": "Good boy! Keep going", "label": 1}
{"text": "You do not need to learn programming or any coding to use Linux.", "label": 1}
{"text": "you also need to get a gpu , for you to fully utilize your gaming monitor ,", "label": 1}
{"text": "Look into your TV's input settings; it might not support HDR at 144Hz.", "label": 1}
{"text": "Just remember, less is more with thermal paste; a thin layer works best.", "label": 1}
{"text": "Response time plays a huge role too; it’s not all about refresh rate.", "label": 1}
{"text": "what is the meaning to spend that much if you just wanted to game 😂 better get something else from the regular market.", "label": 1}
{"text": "can you send  it to me pls", "label": 1}
{"text": "see any of my comments , have i been toxic to anyone,  but some individuals to me ? yes 🥲 what is wrong with some redditor cant even put a /s to make the comment sound good.", "label": 1}
{"text": "You're outright giving outrageous suggestion then proceed tryna be the victim here \"what is wrong with some redditor\" dude really....", "label": 1}
{"text": "isn't the price outrageous without specific currency?", "label": 1}
{"text": "Brother you outright doutbing the choice of the SSD because it doesn't have a heatsink and suggesting a freakin threadripper which is not even a threadripper, 7950x wut. Also, a quick google could tell you this is in AUS dollar, not in USD. It's from Aftershock PC. First time on the Internet?", "label": 1}
{"text": "$\n\nhttps://preview.redd.it/uzb2gu8xxhxd1.png?width=1220&format=pjpg&auto=webp&s=be8bfda38920cde5ffc3173e360cefa908b30b13\n\nwhat ?", "label": 1}
{"text": "https://preview.redd.it/am1ygey7yhxd1.png?width=734&format=png&auto=webp&s=5f1c0e532234aadd68376a78fb9ae66bc18c4424\n\ndumbasss", "label": 1}
{"text": "https://preview.redd.it/w4s1c6j1zhxd1.jpeg?width=600&format=pjpg&auto=webp&s=e7fac7b72c0554c946d76e7cc0e051f465df7fe4\n\nleave the internet please and stop following other people even if they are wrong the australian dollar is written with A$ together while us is just $", "label": 1}
{"text": "you are just toxic and you should understand i am not saying that i have some personal problem with you but looking at how you are behaving seems suspicious so please have a good health and try to be nicer in comments even though it might seems like the person you are talking to is wrong.", "label": 1}
{"text": "Do not ever buy PC components from Aliexpress.  Ever. Under absolutely any circumstances.", "label": 1}
{"text": "is there any mention of store ? no\nand the currency it even states is in just $ not A$ which explaines why it is more likely to be usd ( region specific it is as the OP didnt disclosed what region he is from)\nOP didnt updated his reply nor commented anything related to the currency which most of the people are confused about.\n\nso i will assume its usd assuming that it is written without mention like canadian or australian currency.\nand also stop pulling out random psychological term like dunning kruger effect/syndrome makes you seem like more stupid than serious.", "label": 1}
{"text": "I dont understand what the issue is here.  1100rpm is basically barely even spinning.  This sounds totally normal.  There's nothing wrong here dude.", "label": 1}
{"text": "congrats and fuck you", "label": 1}
{"text": "For the 1 Trillionth time. STOP WORRYING ABOUT BOTTLENECKS!!!!!!! Just buy the most powerful GPU that is in your budget.  PERIOD.  Bottlenecks do not make that much of a difference. It will STILL be an improvement over what you have. It does not matter.\n\nJesus Christ can we PLEASE for the love of God get out of the mindset that bottlenecks cause your PC's to explode???", "label": 1}
{"text": "You should technically be replacing even HIGH quality GOOD PSU's after 6 years.  THAT piece of shit should have been replaced after 6 DAYS.  So you do the math.", "label": 1}
{"text": "You get what you pay for.  Its a super cheap budget laptop.", "label": 1}
{"text": "Thats literally how 90% of people buy their components my dude.  Prices for old stuff goes down right before new stuff launches because stores are trying to get rid of inventory to make room for the new goods.  Thats literally when we all buy our stuff.", "label": 1}
{"text": "Sure, no problem, though I'm not consistently logged into reddit so depending on when you message it may be a while until you hear back.", "label": 1}
{"text": "That looks good, though I personally don't like the H5 Flow as it's rather lacking in terms of stock fans.\n\nI'd spend 10 pounds more to get the Phanteks XT Pro Ultra, which is a similar-looking case but comes with 4 stock fans. They are RGB, but AFAIK if you really don't want RGB you can disable that functionality with OpenRGB.", "label": 1}
{"text": "Credit card so you Indian friends have easier way of scamming you", "label": 1}
{"text": "J", "label": 1}
{"text": "My DAV3 cable is so loose and poorly made.", "label": 1}
{"text": "https://gpu.userbenchmark.com/Compare/Nvidia-RTX-3050-vs-Nvidia-GTX-1080/4127vs3603", "label": 1}
{"text": "Will it cause issues? No, you're just more likely to hit CPU limits than you are at 1440p.\n\nThis isn't inherently a problem; you'll still get a big boost to performance (and/or be able to use higher settings) compared to your 1070 ti.\n\nIf you do find yourself CPU-limited in a game and the performance becomes inconsistent because of it, try capping the frame rate using RTSS to a number you can more consistently hit, and that'll likely feel a lot better.", "label": 1}
{"text": "Pulling or playing with your CPU is what cause it, smartass", "label": 1}
{"text": "If there is a place for a fan. You put a fan there. Always. No exceptions.\n\nThe MORE fans you have the quieter your PC will be.  2 Fans at 1/2 the rpm will always be quieter than 1 fan at 100%.", "label": 1}
{"text": "pay", "label": 1}
{"text": "[https://store.steampowered.com/app/3255100/MOM/?l=spanish](https://store.steampowered.com/app/3255100/MOM/?l=spanish)", "label": 1}
{"text": "Putting too much is worse than none, if the material degrades (e.g. if you don't redo it for several years). At least then there's still some heat transfer contact if it's not caked on. That's less likely to happen with Arctic Silver type paste though.", "label": 1}
{"text": "Rimworld; Crusader Kings 3; Fifa;", "label": 1}
{"text": "Which is better 4070 or 3080ti", "label": 1}
{"text": "I think that's way too expensive for a PC with a 4060 ti.\n\nThis one is much cheaper and should perform basically the same:\n\nhttps://www.currys.co.uk/products/medion-erazer-engineer-x10-gaming-pc-intel-core-i5-rtx-4060-ti-512-gb-ssd-10254466.html\n\nIt does have less storage, but that's something you should be able to pretty easily add on your own for much less than the 400 pound price difference between these two systems.\n\nIn the 1300-1400 pound range, you can actually get a PC with a 4070 instead of a 4060, like this one:\n\nhttps://www.currys.co.uk/products/pcspecialist-flux-330-gaming-pc-intel-core-i7-rtx-4070-1-tb-ssd-no-os-10257762.html", "label": 1}
{"text": "Just FYI, PCSpecialist and PCPartPicker are two very different websites. \n\nPC Specialist is a website where you can actually select parts and then order the entire PC which will be built for you by PC Specialist. \n\nPCPartPicker is just a tool that helps you create a compatible build list and lets you compare prices. It is NOT a retailer and you don't buy anything from them.", "label": 1}
{"text": "Also, keep in mind that PC Specialist is still selling \"prebuilt PCs\" even though you spec them out yourself, and you will still end up paying extra compared to buying components and assembling the PC yourself.", "label": 1}
{"text": "At those prices buy the 3070. The 4060 ti is honestly a joke of a GPU at 340+ pounds. You can get a used 3080 for about that much.", "label": 1}
{"text": "Ah, yeah that's a nice upgrade.", "label": 1}
{"text": "Both Youtube and Geometry Dash are EXTREMELY CPU intensive workloads and your laptop does not have a very powerful CPU.  I would guess that it cannot play the game and handle youtube at the same time.\n\nI love how people assume that just because its a video it doesnt actually use any power.  No, my dude. Youtube STRESSES your CPU.", "label": 1}
{"text": "Ebay?", "label": 1}
{"text": "Only other place I'd consider is maybe Craigslist, which will probably present the same issues you had with Facebook, and the others. eBay would probably be your best bet otherwise.", "label": 1}
{"text": "Bro the shop near me sells 4070 at 800 and 3080ti at 700", "label": 1}
{"text": "Amazon, Ebay", "label": 1}
{"text": "That's a grid portal. There was a school in NJ where all of the kids had those slots so that they could login to The Grid at anytime during lectures [https://codeelf.com/games/the-grid-2/grid/](https://codeelf.com/games/the-grid-2/grid/)", "label": 1}
{"text": "Capacitors will leak from the top, not through the motherboard. Thats literally not physically possible. That residue is NOT from the capacitors", "label": 1}
{"text": "!allmessage", "label": 1}
{"text": "Here is the PCPartPicker list for the link you provided.  [Here's how to do it on your own.](https://i.imgur.com/upztBRs.png)\n\n----\n\n[PCPartPicker Part List](https://pcpartpicker.com/list/qCHFJy)\n\nType|Item|Price\n:----|:----|:----\n**CPU** | [AMD Ryzen 9 7900X3D 4.4 GHz 12-Core Processor](https://pcpartpicker.com/product/XccgXL/amd-ryzen-9-7900x3d-44-ghz-12-core-processor-100-100000909wof) | $597.57 @ Amazon \n**CPU Cooler** | [NZXT Kraken Elite 360 RGB 78.02 CFM Liquid CPU Cooler](https://pcpartpicker.com/product/pbKscf/nzxt-kraken-elite-360-rgb-7802-cfm-liquid-cpu-cooler-rl-kr36e-w1) | $299.99 @ Adorama \n**Motherboard** | [Asus PRIME X670E-PRO WIFI ATX AM5 Motherboard](https://pcpartpicker.com/product/7nYmP6/asus-prime-x670e-pro-wifi-atx-am5-motherboard-prime-x670e-pro-wifi) | $299.99 @ Amazon \n**Memory** | [Corsair Vengeance RGB 32 GB (2 x 16 GB) DDR5-6000 CL36 Memory](https://pcpartpicker.com/product/QTLFf7/corsair-vengeance-rgb-32-gb-2-x-16-gb-ddr5-6000-cl36-memory-cmh32gx5m2d6000c36w) | $119.99 @ Amazon \n**Storage** | [Samsung 990 Pro 2 TB M.2-2280 PCIe 4.0 X4 NVME Solid State Drive](https://pcpartpicker.com/product/34ytt6/samsung-990-pro-2-tb-m2-2280-pcie-40-x4-nvme-solid-state-drive-mz-v9p2t0bw) | $168.00 @ Amazon \n**Video Card** | [MSI MECH 2X OC Radeon RX 6750 XT 12 GB Video Card](https://pcpartpicker.com/product/6F6p99/msi-mech-2x-oc-radeon-rx-6750-xt-12-gb-video-card-radeon-rx-6750-xt-mech-2x-12g-oc) | $429.00 @ Amazon \n**Case** | [NZXT H6 Flow RGB ATX Mid Tower Case](https://pcpartpicker.com/product/kfRwrH/nzxt-h6-flow-rgb-atx-mid-tower-case-cc-h61fw-r1) | $134.99 @ Amazon \n**Power Supply** | [Corsair HX1500i (2023) 1500 W 80+ Platinum Certified Fully Modular ATX Power Supply](https://pcpartpicker.com/product/fFbRsY/corsair-hx1500i-2023-1500-w-80-platinum-certified-fully-modular-atx-power-supply-cp-9020261-na) | $359.99 @ Amazon \n**Operating System** | [Microsoft Windows 11 Pro Retail - Download 64-bit](https://pcpartpicker.com/product/VCTp99/microsoft-windows-11-pro-retail-download-64-bit-fqc-10572) | $179.99 @ Newegg \n**Keyboard** | [SteelSeries Apex Pro TKL RGB Wired Gaming Keyboard](https://pcpartpicker.com/product/CKZzK8/steelseries-apex-pro-tkl-wired-gaming-keyboard-64734) | $206.13 @ Amazon \n**Mouse** | [Razer Basilisk Ultimate Wireless/Wired Optical Mouse](https://pcpartpicker.com/product/WJKKHx/razer-basilisk-ultimate-wirelesswired-optical-mouse-rz01-03170200-r3u1) | $120.26 @ Amazon \n | *Prices include shipping, taxes, rebates, and discounts* |\n | **Total** | **$2915.90**\n | Generated by [PCPartPicker](https://pcpartpicker.com) 2024-10-28 20:28 EDT-0400 |\n\nThis bot is in **no way** associated with PC Part Picker.\n\n----\n\n*[I am a bot](https://i.imgur.com/hfRIhMe.png)* -  This action was done automatically. Please direct any questions or concerns ( or bug reports ) to [\\/u\\/eegras](https://www.reddit.com/message/compose?to=eegras&subject=&message=) - [About /u/PCMRBot](https://pcmasterrace.org/pcmrbot_old)", "label": 1}
{"text": "How you got 3000$ from this is beyond me", "label": 1}
{"text": "Only way thats 3k is if there's a $1,500 chili's coupon in it", "label": 1}
{"text": "Again. Spend a few hours on the channel I mentioned. You will realise they are full of issues just like all laptop brands and the supposed quality is 15 years worth of marketing tactics with buzzwords like titanium or similar they so love to sprinkle into it.   \n\nAs a sysadmin I assure you the amount of laptops I see have issues a year far exceed most people on this sub and proportionally speaking we see way more issues with macs than Dells and they both fall in similar price classes.", "label": 1}
{"text": "He’s a hack who exaggerates for views on YouTube. Already know him. He has a bias and his own self interest at play. \n\nI have my own experience. They aren’t equal.", "label": 1}
{"text": "Oh you claim to work with more laptops than him a year? How many systems do you administer or repair then?", "label": 1}
{"text": "Wow you’re just a smarmy dickhead all the way down this comment chain, eh?", "label": 1}
{"text": "Slut maker", "label": 1}
{"text": "It sounds like you are already doing great, especially considering your age. Great effort!\n\nYou basically need to be present on all platforms that can get you more clients and sales. I would also suggest you try to tap into your whole local marketplace.   \n  \nEbay is a good choice but the fees can eat from your profits, especially on smaller orders. Setting up your own site through something like Shopify gives you more control but there's a lot of work to do. You need to research and learn how to start your business in order to do it properly, step by step and be prepared for everything. As you get more sales you can look into hiring some employs and scale your business.\n\nTo get more answers from other users you can try posting on r/smallbusiness or r/Entrepreneur", "label": 1}
{"text": "Well this post was removed apparently. Why is it so hard to speak online these days.. it’s pathetic really", "label": 1}
{"text": "There's no \"either way\"... you're not smart enough to gaslight. Stop blaming gamers. Hell it was probably old person like you that did it.\n\nDon't tell me it was costco. It was LIKE a costco. \n\nGet your shit right and learn how to talk to people, boomer.", "label": 1}
{"text": "idk $600 tops", "label": 1}
{"text": "Based on how old the hardware is, maybe $400-600", "label": 1}
{"text": "check on the market if same setup exist, it's good way to understand how can you sell.", "label": 1}
{"text": "oof nice build. sadly probably not more than 500 bucks", "label": 1}
{"text": "the only way that PC is worth 600$ is if it had a 300$ hooker sitting on it", "label": 1}
{"text": "around 450usd", "label": 1}
{"text": "300 will be hard sell.", "label": 1}
{"text": "300.", "label": 1}
{"text": "I think $250 will be fair for you. $200 will be fair for the buyer as they assume more risk than you for buying already old used parts.", "label": 1}
{"text": "At least $5", "label": 1}
{"text": "SOLD! :D", "label": 1}
{"text": "200-300$", "label": 1}
{"text": "What the heck are you talking about?! 😂\n\n\n\nIf I was a 13/14 year old kid **I would also pest my parents until they gave me a 4090!**.\n\n\nI don't have to pay bills, work, clean the house, make my own meals, walk the dog male an appointment to go see the doctor and so on.\n\n\nThe only thing required from me is go to school, study, have good grades and play some some sport. 🤣🤣🤣", "label": 1}
{"text": "Well, 200$ is “not more than 500$” so technically you’re not wrong", "label": 1}
{"text": "I mean, there is one... On the first picture :D", "label": 1}
{"text": "Tenner", "label": 1}
{"text": "not even close, the parts are nearly 8 years old\n\nthe GPU goes for $100-150\n\nthe CPU, board and memory would go for maybe $100 at most\n\nthe drives, case and PSU are somewhere between $40-80\n\nfor the whole setup even a optimistic estimate would fall short of $400,  i would say a fair price would be somewhere in the $250-350 range.", "label": 1}
{"text": "$250 maybe?", "label": 1}
{"text": "Saying tenner is so cringe g o d", "label": 1}
{"text": "$250. A company that I work in gives 1-year warranty for similar PCs and identical build on 6th gen i5 we sell for $300. So as you can't provide warranty, 250 seems like a fair price", "label": 1}
{"text": "1080 Tis are at $150 on eBay. That’s the only thing worth any money in the whole build unfortunately. Slow ram (for modern times), small storage, no upgrade path.", "label": 1}
{"text": "Don’t sell it not worth it.", "label": 1}
{"text": "I had this case but in white, crazy how cases have changed lol", "label": 1}
{"text": "200$, and if you get a better case, which would make it look worth much more, I think you can flip it for 350-400$", "label": 1}
{"text": "May i know why it's not worth it?", "label": 1}
{"text": "About three fiddy", "label": 1}
{"text": "Go to Amazon/newegg/pick of your choice.   Build your system at current prices, cut that in half, and that’s your sell price.", "label": 1}
{"text": "My local FB group would want $100 less than what it cost brand new.", "label": 1}
{"text": "So weird, I just watched an LTT video that used this exact case from like two years ago (it’s designed for old fashioned water cooling setups with the rad on the outside of the case!).", "label": 1}
{"text": "Jeez this post exploded real quick. Why people keep commenting? 😂", "label": 1}
{"text": "Are you selling the controller as well? If it doesn't drift, don't. Price of official controllers are high right now.", "label": 1}
{"text": "Saying cringe, is cringe", "label": 1}
{"text": "Find a 1080 ti used price in your area and charge like 100-150 dollars more than that", "label": 1}
{"text": "Tenner ? Tenner, tenner, tenner tenner. Tenner tenner ? Tenner.", "label": 1}
{"text": "I'll offer two fiddy 👍🏻", "label": 1}
{"text": "The fact that comments such as these are still up makes me wonder if X truly is the worst site ever", "label": 1}
{"text": "Pets: ❌\n\nKids: ❌\n\nPartner/Spouse: 🤷🏻‍♀️\n\nMoney: ✅", "label": 1}
{"text": "Components are quite nice and 1080P gaming still at peak but why all that mess? Why there's an ancient monitor and toolbox under desk? This picture is one step away from beinga neckbeard nest.", "label": 1}
{"text": "👉👌🤌👍", "label": 1}
{"text": "What do i get", "label": 1}
{"text": ">Do you think I give a singular F whether boob removal scars are in a game or not?\n\nLMFAO! I'm just saying. It's the reason I'm being downvoted to hell rn & also why people refuse to believe the reviews.  \n\n>I hope I'll disagree but with the dissapointments the past few years I am skeptical hence not getting it on release and waiting for more reviews and player feedback.  \n\nWell I'm getting it on day 1 and will enjoy it. I don't care.  \n\n>If it isn't what people like Neon Knight have said  \n\nListen, man. I'm an older guy & I've finished/completed the finest RPG's in my time. I literally do not give a fuck. If the game delivers on quality role playing and good fights fitting of wRPG's then I'm happy. It honestly matters little if it's Marvelesque or whatever the fuck. I've played an insane amount of games. Good is good. Get the steppin, dude.", "label": 1}
{"text": ">LMFAO! I'm just saying. It's the reason I'm being downvoted to hell rn & also why people refuse to believe the reviews. \n\n\nI am like 99.9% sure you are being downvoted because you fail to respect anyones opinion aside your own and reviewers and try to conflate any criticism to \"Anti woke chuds\", reviewers who routinely praise a game to the high heavens and it ends up being garbage or stomp a gake into the dirt and ot ends up great. Spacw marine 2 got like a 6 and it was great and starfield got an 8.4 and it was shit just to gove two examples. A lot of people juat dont trust reviewers like IGN or Eurogamer anymore and it makes sense, the fact you 100% trust them is up to you but dont fauly everyone else for taking anything they say with a grain of s...no with a saltmine of salt.\n\n>Well I'm getting it on day 1 and will enjoy it. I don't care. \n\nAnd who the hell told you that you can't?\n\n>Listen, man. I'm an older guy & I've finished/completed the finest RPG's in my time. \n\nUh? Okay?\n\n>I literally do not give a fuck. If the game delivers on quality role playing and good fights fitting of wRPG's then I'm happy.\n\nI think most people will be, it just seems that may very well not be the case, what is the point here?\n\n>It honestly matters little if it's Marvelesque or whatever the fuck. I've played an insane amount of games. Good is good.\n\nThat is inherently subjective to start with. But as a fan of DA since Origins I have expectations, if this game is \"Marvelesque or whatever the fuck\" I'll be at best dissapointed as it wont deliver on what I want out of a DA game, is that odd?\n\n>Get the steppin, dude\n\nI dont even know wtf that means. For real though, it may be worth consuming other content then your whole woke/anti woke bullshit, its tiresome to get people like you popping up like an unwanted rash in order to either call everything positive woke or call any criticism anti woke.", "label": 1}
{"text": "Do you know the skibbidi? I know the skibiddi, and I don’t like it.", "label": 1}
{"text": ">A lot of people just dont trust reviewers like IGN or Eurogamer anymore and it makes sense\n\nI don't trust anybody. What I do trust is my own processes. If 10-20 people are saying it's 8-9/10 then it is. Regardless of what you think. My system has not been wrong. Ever. Still isn't. Even on Starfield.  \n\n>But as a fan of DA since Origins\n\nI can still remember the day I got that game. I preordered it, went to pick it up at my local Gamestop and took it home. Played it until I beat it. Loved it.  \n\n>I'll be at best dissapointed as it wont deliver on what I want out of a DA game, is that odd?\n\nYeah. Because you're like those assholes who say Game A or B has to be like this and only this or else it's not Game Series. I can think of soooooo many of those types from RPG series over the years and it's insane. Fast forward in time and the company does the rerelease. Game ends up being reviewed well and you have people coming out of the woodworks saying how the game is so good or whatnot.  \n\nLike fuck outta here. I know what all you mufuckas thought. Yall jumped on the bandwagon because people said you had to think this way or you were made fun of. Games that come to mind were Wind Waker and FF12. Fuck what you people think. I KNEW those games were good ON RELEASE.  \n\n>its tiresome to get people like you\n\nshut the fuck up.", "label": 1}
{"text": "[https://www.sortmydrive.com/](https://www.sortmydrive.com/)", "label": 1}
{"text": "Credit cards the slut i mean slot is for credit cards my good sir", "label": 1}
{"text": "[Gentleman,We are Nazis! (10:52)](https://youtu.be/0_4nmW5GZhQ?si=jwpOnWqZUgLDREuc)", "label": 1}
{"text": "You’re a fucking idiot, read the title of this thread.", "label": 1}
{"text": "Lol a id card reader 😆 🤣 😂 😹", "label": 1}
{"text": "Stop crying, you attention seeker.", "label": 1}
{"text": "Why do you care", "label": 1}
{"text": "Someone posted yesterday some company logos from today that didn’t exist in 80’s done in an 80’s style.\n\nThey were awesome!", "label": 1}
{"text": "Thank you!! I agree it looks so clean, I love it.", "label": 1}
{"text": "Thank you!!", "label": 1}
{"text": "Its an ICUE H100X ELITE 240mm (x2 120mm)", "label": 1}
{"text": "Oh god ..", "label": 1}
{"text": "Are you like new to computers or something because those temps are literally Ice Cold.  Thats literally 30 degrees BELOW what it is rated for.\n\nYou're fine.\n\nJesus Christ learn how to use Google.", "label": 1}
{"text": "You what? You’ve never seen a USB A plug in your life? You ever look at a motherboard before?", "label": 1}
{"text": "Oh I've seen dogs for this pick and place machine", "label": 1}
{"text": "wait", "label": 1}
{"text": "Can't, it's military grade\n\n\nSometime next year I can move off base and get my own stuff", "label": 1}
{"text": "Buy one that's more than 20% faster then you aren't limited to the 4060.", "label": 1}
{"text": "Thats a steal...holy", "label": 1}
{"text": "I have not turned off or put to sleep any computer that I have ever owned since the mid 90's.  They run 24/7/365.", "label": 1}
{"text": "Most budget motherboards look BETTER than the expensive ones.", "label": 1}
{"text": "Maybe the port in the monitor is loose", "label": 1}
{"text": ">how long did it take you to purchase all the parts for your PCs?\n\nAs long as it takes to click 'add to cart' LOL  I can buy all of the components for a new PC in about 45 seconds.", "label": 1}
{"text": "My dude... read the fucking comment before you respond like a manchild. At no point did I even remotely apply that my hatred for Nvidia had anything to do with the price. Jesus, you're an insufferable prick.", "label": 1}
{"text": "“I fuck myself watching you download and torrent with that 2TB SSD in its external case… oh yeah baby”", "label": 1}
{"text": "I'll check the back of it, thanks", "label": 1}
{"text": "OMG bro u ppl must be slow man....it's not fkn difficult to find! They are using the same architecture it's just upgraded but it is not 3.5 like what the fuck are you talking about lol\n\nhttps://preview.redd.it/x18lwo8bwqxd1.jpeg?width=1850&format=pjpg&auto=webp&s=fbd37d45e1b9dd1de2779ca5c5742c149f6c441a", "label": 1}
{"text": "I'd give them $100 to take it from me.", "label": 1}
{"text": "It's every fucking Google search bro I'm not doing a deep dive you don't have to moron lolol ... Either way who gives a shit my whole argument is that people are dumb trying to compare it to a top level 40 series GPU which is completely accurate and if you argue against that you don't know what the fuck you're talking about lol ...", "label": 1}
{"text": "Did you not read my comment? Did you not check the source, and even Sony has confirmed that they will be using features from RDNA 4? This was also mentioned in the several-month-old leak that states the PS5 Pro GPU is a hybrid of RDNA 3 and 4. You clearly have significant reading comprehension issues.", "label": 1}
{"text": "Install Card:\n\nDoes the card sag? Install anti-sag bracket\n\nDoes the card not sag? Does not need anti-sag bracket\n\nDo you see how easy it is to make choices for yourself without needing to ask?", "label": 1}
{"text": "Yet another person that assumes everyone here is clairvoyant and doesnt give any actual necessary information whatsoever.\n\nWe're not psychic folks.", "label": 1}
{"text": "The most powerful card that is in your budget.  Period.", "label": 1}
{"text": "CPU Cooler .. literally not mounted\n\nCPU Overheating\n\nWOWWWWWWWWWWWWW No way?!!?!?!?!?!\n\nJesus Christ...", "label": 1}
{"text": "No one is discussing it because its not a thing for most people.  Its an isolated issue that only affects a very SMALL number of people.  MOST users are actually seeing a pretty significant IMPROVEMENT in performance actually.", "label": 1}
{"text": "$650 USD ($900 CAD).", "label": 1}
{"text": "She said cry Not kill herself", "label": 1}
{"text": "It's because the bottom is where the cooling comes from. It's not intentional. By bottom I mean, the bottom half of my fridge and it's pretty small because they're only going to invest so much in our well being.", "label": 1}
{"text": "AMD makes CPU's too", "label": 1}
{"text": "You might want to check your facts before posting.  I've seen more than a few dozen posts here most definitely defending 13th and 14th gen.\n\nJust because you close your eyes and dont see something doesnt mean that truck isnt about to run you over.", "label": 1}
{"text": "You're gonna have to learn how to remove that eventually.  I say now is the best time.  If you cant remove and replace a CPU cooler you probably wont be able to install new Ram anyway.", "label": 1}
{"text": "Ok bro we'll see...not gonna argue ... And my main point was not even about the processor for the pro It was the graphics processing for the pro which unless you live under a rock people have been making ridiculous comparisons people saying it's close to the 4070 super or the 4080 This is just nonsense That was my main point you can believe whatever you want about the CPU of the pro I really don't give a shit My point is the comparisons that people are making are dumb and unrealistic...", "label": 1}
{"text": "You put a CPU in there. You turn it on.  If it works then it works.  If it doesnt work, then it doesnt work.\n\nPretty damn simple procedure.", "label": 1}
{"text": "It absolutely **is** e-waste.\n\nIt's got a CPU and GPU that are no longer receiving ANY support from their manufacturer, most importantly **security updates**. That is a zero-day vulnerable machine, that will be even more vulnerable when Win10 support ends next October for consumers. It can't even upgrade to Win11 either. Unless OP is willing to learn Linux, or never connect the machine to the internet again, it's on a short timer.", "label": 1}
{"text": "Will it make a difference? Yes.\n\nAre the weaker fans still most likely more than enough cooling regardless? Probably.\n\nJust because one thing is better doesnt mean the other isnt still enough.", "label": 1}
{"text": "It’s been like that for a while 😂 I know exactly where everything is I’d be hurting myself by changing it 😂😂🤷🏻‍♂️", "label": 1}
{"text": "as a random guess from what little info i can tell from a cursory glance, maybe like $700?", "label": 1}
{"text": "LOL.  Yes do it.  Waste money. Please.", "label": 1}
{"text": "7/10 - needs a floppy drive and 48x burner to complete the look.", "label": 1}
{"text": "There is something wrong with your Windows install.  You have double the amount of ram that you actually need, it should NOT be hitting 99% at all.\n\n100% guarantee that if you had 64GB it would STILL hit 99%", "label": 1}
{"text": "I just played this on Xennia. Not to be a contrarian... but I don't remember the last time a game disappointed me this much.", "label": 1}
{"text": "Okay Grampa. Onboard audio is 10x better today than the best soundcard that was ever produced. Its fine.  Welcome to the 21st Century.", "label": 1}
{"text": "You can head to r/crackwatch if you want it now.", "label": 1}
{"text": "Oh thats 1000000% a mining card. That thermal paste and thermal pads are guaranteed toast.  Its actually a miracle it even runs at all.", "label": 1}
{"text": "You should just continue to use Windows .. like literally everyone else will do.\n\nStop being stupid.", "label": 1}
{"text": "You do know that you can just continue to use Windows 10 for MANY more years .. right?", "label": 1}
{"text": "I removed the SSD since you should repurpose in the new rig as the OS drive, but either way you go I wouldnt sell a drive that I used ANY of my info with the machine it came with(You do you). [https://pcpartpicker.com/list/nFBKJy](https://pcpartpicker.com/list/nFBKJy) is the retail price or thereabouts 1100$. I also didnt include the case since its moot.\n\nIf you were to seriously try to move it, AM4 is at the end of its span, the 3700x isnt a highly sought after card, the mobo isnt the newer AM4 550 series so those two can be subtracted(162 for the processor, about 70 for the mobo) which is a substantial chunk. However, they can still move, if you were to price 400-600 you probably would get someone to bite pretty quick. You can put it higher if you want, that doesnt mean itll move, eventually you will get discouraged and lower the price, or I can be wrong, I do love being wrong, but take into account AM5 is now reaching a higher performance point than AM4. If its for the right price, and they get say a 5700x3d for a good deal that may make the system more enticing to them, so put it at the high point of 600(or 800) and figure out what you are good to get talked down to, if that 800$ gets you talked down to 750, great, or 600.\n\nAlso realize, people buying second hand have no idea how the system was treated prior to them getting it, I almost always assume people screwed the machine up by OC or didnt maintain cleanliness etc, you can tell me you treated it right, but can I believe a stranger?\n\n I would probably say consider keeping your monitor unless you have higher aspirations like 48in. But once again you do you.\n\nI would also look on facebook to see what similar systems are going for and how long its been on the marketplace, to get a judge on if it makes more sense to part out the pieces than to sell as a system.", "label": 1}
{"text": "Yeah, nope. No amount of you wishing it can make it true. There are many viable uses for this machine", "label": 1}
{"text": "agree, fuck people like that. if they want crack, just crack it dont advertised it, especially on people who want to buy it", "label": 1}
{"text": "buying PC ports is a waste of money\\*", "label": 1}
{"text": "Yeah so is buying food from the grocery store. Start Boonk ganging", "label": 1}
{"text": "Nah food is good. The only PC port I've enjoyed was the Ninja Gaiden collection.", "label": 1}
{"text": "Don't group all of us pirates together. I pirate because I would like to test the game before buying it. Elden Ring is a prime example. Amazing game but the PC launch was atrocious. I ended up buying it after they fixed it and I tested it via a crack.", "label": 1}
{"text": "Meh, people wouldn't be so eager to pirate it if it wasn't 50 dollars for 14 year old game.", "label": 1}
{"text": "14 years after the fact. 20 bucks should be the price not 50.", "label": 1}
{"text": "me too haha, on jedi survivor.\n\nbut yeah, really hate they always advertised it on comment or post that encouraging to buy it", "label": 1}
{"text": "I’m still mad I bought this and it still doesn’t work on PC (at least for me).", "label": 1}
{"text": "yeah that game is really bad", "label": 1}
{"text": "What game from 2010 would you be willing to pay $50 to play again?  \n\nPick your favorite feature complete PC game that's over a decade old that you think people would drop $50 bucks on to have ported to console. \n\nSpeaking strictly of myself, I would have 100% paid full price for this PC port 14 years ago.    \n  \nToday?  I'll grab it for $15 or so.   That's about the limit I'd pay for ANY 14 year old game.", "label": 1}
{"text": "Most people who crack games will never buy it bc no regional pricing/being broke/don't see the point of paying\n\nFor me I can't give %10 of my mo of min wage  to play a game as a student \n\nFuck turkey", "label": 1}
{"text": "If you want some more graphical horsepower and found a 3080 for $300, sure go for it", "label": 1}
{"text": "The 3080 performs about 20% better as far as gaming performance than a 3060. Id go for it", "label": 1}
{"text": "Sounds like the move then, thank you.", "label": 1}
{"text": "I mean common sense would say the best CPU that is available for AM4 is the 5950x.", "label": 1}
{"text": "Is this something we actually have data on? I don't doubt it could be real but how could you tell?", "label": 1}
{"text": "You can just plug it in and use it.  HDMI is backwards compatible.  It will work perfectly fine.\n\nLOL", "label": 1}
{"text": "If this was priced reasonably, I'd buy it.  \n50USD and no regional pricing? Fuck no.  \n\nIt's an 13yo game that I already played back in the 360.  \nI bought Elden Ring for about 66% of what Rockstar is charging for RDR.  \nIf I didn't own RDR2, I could pick up a copy for almost half what they are charging for the first game.  \n\n50USD can get you a lot during Steam sales, specially if you are interested in buying games from that period.  \n\nRecently I bought Metal Gear Rising Revengeance, FFXIII, Hollow Knight, Portal 2, Hades, Cuphead, Battleblock Theater, South Park The Stick of Truth, Dragon Age Inquisition GOTY and Devil May 4.  \nAll those games combined costed less than what Rockstar wants for RDR.  \n\nThis is how ridiculous it is, I can buy a mix of 11 games that are either from the same time or later, and pay the exact same price rockstar is charging.  \nHell, I bought my digital 360 copy back for 9.90€", "label": 1}
{"text": "It’s really not hard. Just do it. Why sink a bunch of money into something you don’t fully understand/know how to fix. Stop being lazy and scared.", "label": 1}
{"text": "He said so, duh", "label": 1}
{"text": "Porting a game can't be as challenging or expensive as people somehow think just because a publisher complains about it. Random fans can spend a couple weeks/months tinkering with other people's code and get a working emulation of a game on PC that often runs and looks better than whatever AAA studios drop on us far later.\n\n\nThis game came out in May 2010 and they want 50 USD for changing some code in order for it to run on PC? PC ports are amazing and are very profitable for publishers, when they are done well and when they are done in a timely fashion. Games should release on PC same day, if they have to wait for the port that port should not cost the same as the game did on launch a year or two prior. 14 and a half years later? Fuck that. $15 and use it as some goodwill PR for your brand while you STILL make money hand over fist.", "label": 1}
{"text": "Definitely. It's a way, way faster card.", "label": 1}
{"text": "It's way faster. Like almost 60% faster at 1080p, and more than that at 1440p. It's a completely different class of card.", "label": 1}
{"text": "I own this game on my PS3 physically, and I own it on Xbox digitally. \n\nI ain't paying $50 for a port (albeit a solid one, though nothing groundbreaking, shame we see a solid port as an achievement, really) of a 2010 game so I pirated it and my conscience is totally clean. If R* released this port way back when, they could ask the price for it. \n\nNow, I ain't adding it to any of my PC digital libraries until it's $10 or less, and even then I'll think twice since I already own the game, paid the devs money when the game was still in its heyday, and don't really need an additional way to download the game...though who am I kidding, once it's below $10 on Steam, I'll snag it in an instant because I'm a shopaholic!", "label": 1}
{"text": " Lmao 🤣 😭 it's right there 👉👉👉", "label": 1}
{"text": "PC ports are often calls for tender, and in general they take the studio that offers the best price, so that the publisher saves as much money as possible on the development cost, this is the case for practically all ports released on PC.", "label": 1}
{"text": "Nah selling stuff to rebuy similiar stuff is a waste of money everytime u do it u lose a % of money u spent, 4060 is a good card save up for next gen and get a monster card from that lineup", "label": 1}
{"text": "EA Skate 😎", "label": 1}
{"text": "I mean I know people from countries when regional pricing pirate. I was more wonder what % of people are compared to just pirating cause they don't want to pay money", "label": 1}
{"text": "og yeah, I googled \"AM5 pin diagram\"", "label": 1}
{"text": "Spiderman's set-up", "label": 1}
{"text": "Msi z790 godlike is better", "label": 1}
{"text": "I use my mcbook as a mousepad, so might as well get that gaming pc you're hoping for", "label": 1}
{"text": "Systemd mentioned 😎😎💪💪", "label": 1}
{"text": "I pirate nothing. You fuckers are why we have to deal with shit like Denuvo! \n\nI honestly don't now, but I did back in the days of no-CD patchs when we were broke youngsters. One of our friend circle would buy a game and the rest of us would just install and patch it to run without the CD. LAN parties were as much a free game acquisition meeting as they were multiplayer events. I don't think I knew anyone who didn't pirate at all back then, unlike today. Yes, we nearly killed PC as a gaming platform!", "label": 1}
{"text": "A man of culture.", "label": 1}
{"text": "Or if you want chrome experience kiwi browser+ unlock origin \n\n\nAlso it you have amoled display any black screen app  yt music on browser ", "label": 1}
{"text": "They really tried to gotcha you lmao.", "label": 1}
{"text": "Hah, well I'm being honest here. I don't use Spotify as music and podcasts I listen to are on YouTube for free. I'm really not a fan of Apple's over priced products. If people like them that is okay, but I've never had one and I don't plan to own. I would argue that Apple's overall architecture and OS is way more stable, but PCs have really made a stride in the past 5-6 years. I remember reinstalling Windows and all the drivers was pain in the ass when I was a kid. Now you install Windows 10 and everything just works.", "label": 1}
{"text": "Feels nice living in Europe", "label": 1}
{"text": "Sorry to hear about the camera system☹️\nOn the other side some of those components are awesome for a nice retro build💪👍\nSaw Qimonda logo on the memory module, they had a factory here in Portugal👌", "label": 1}
{"text": "YOU'RE NOT MY SUPERVISOR!!!", "label": 1}
{"text": "A coconut", "label": 1}
{"text": "I didn't say it isn't overpriced. I stated a fact, that $50 is NOT full price these days. 70-80 is, deal with it.", "label": 1}
{"text": "Who are you calling cunt you corporate bitch? Stfu people buying it doesn’t mean it’s good value or even a good game. Every week shit games become top sellers, it doesn’t mean anything. \n\nIt’s not a remaster or a remake there’s no point to throw money at it just to have it in steam library instead of an emulator. having so many idiots buy it at a FULL price, yes! FULL PRICE which is 50-80 to get THE SAME shit they can get for free not even a remaster, is just retarded!\n\nAre you legit fucking dumb or trolling? How is that not registering in your buttery smooth brain?!", "label": 1}
{"text": "Bro really thought he had something but when you answered: he is nowhere in the replies", "label": 1}
{"text": "Kids thinking they are in some kind of war against everything their favourite neckbeard youtuber calls malpractice. Everybody and their mother are complaining about game preservation and shit and when finally a company releases the game on the platform it’s going to be preserved at not needing any shady software emulators mods etc to run. They all of a sudden mad because it’s not free and doesn’t include a blowjob. Sometimes it seems people forget they can just not buy things they don’t need.", "label": 1}
{"text": "Bots\n\nhttps://preview.redd.it/pxcrj40acvxd1.png?width=563&format=pjpg&auto=webp&s=90d622a2894ec7641874f5a8ba3b9e0b05922e15\n\nWhy is this fckin hilarious", "label": 1}
{"text": "I sure love spending $8/month instead of spending hours trying to troubleshoot how to steal with all the other kids who haven't finished highschool and don't have parents who love them as much as the price of one McDonald's meal a month", "label": 1}
{"text": "or am I?", "label": 1}
{"text": "That happened under Biden", "label": 1}
{"text": "What Putin and Kim being pieces of trash? Been that way forever brother.", "label": 1}
{"text": "Uh, no, Kim sending troops into Russia/Ukraine and the Ukraine war happened under Biden", "label": 1}
{"text": "Yeah I’m not sure Biden nor trump told Kim to send soldiers to Russia? Very strange.", "label": 1}
{"text": "Well Biden did nothing to stop it and no wars happened under Trump.\n\nVery strange indeed", "label": 1}
{"text": "Oh so trump controlled the North Korean forces? Or Biden does?", "label": 1}
{"text": "The point is that you manage alliances with foreign powers to prevent shit from happening. Trump was able to do that, that’s why him shaking hands with Kim was important, because it manages an alliance and allows for shared interests such as, oh idk, knowing what the other guy might be doing and having some power to negotiate otherwise", "label": 1}
{"text": "https://preview.redd.it/a7pf60vievxd1.jpeg?width=806&format=pjpg&auto=webp&s=d7dca8d10e703c1a52395de95dc1cec0b1ae5fbd", "label": 1}
{"text": "The world laughed at him. He didn’t manage shit. Kim and Putin kill their own.  We don’t bow to dictators.", "label": 1}
{"text": "It's not a gotcha really, it's just logical. After all the spotify price raises, my spotify premium was 1 pound less than YT premium + YT Music. It was a no brainer for me to switch at that point. If I didn't use spotify premium though, I likely never would have. Value decisions for each person depend on what they are already doing/consider worth paying for.", "label": 1}
{"text": "That baby is cute (bottom left) everyone else can suck my d........ jk", "label": 1}
{"text": "Definitely looks like a lot pro youtube premium bots have commented.", "label": 1}
{"text": "What?", "label": 1}
{"text": "I dunno, something about how they love corporate boots.", "label": 1}
{"text": "Not watching ads = stealing to you?", "label": 1}
{"text": "\"Steal\". My boy knows his corpo speak", "label": 1}
{"text": "You are weird", "label": 1}
{"text": "And occasionally one of them will go into details of their revenue from videos and it's always a lot more per view from premium users because online ads just aren't worth that much.", "label": 1}
{"text": "Nah, I keep my setup clean I’m not a neckbeard. I weigh 140 pounds.", "label": 1}
{"text": "Gaming is a relatively cheap hobby for the amount of hours you get per dollar spent.  Gamers are just entitled and cheap.  You should want companies that make quality games with tons of micro transactions to be successful and profitable or you'll end up with Tencent mobile shit everywhere.", "label": 1}
{"text": "Doubt it. The people who are actual pc master race are old as fuck now and have some money. Just typing this message out isn't worth the time. So I pay for the best subscription service out there and it just works all the time on every device. Easy", "label": 1}
{"text": "wth are you even talking about, lol and let's take this stupid argument in consideration, amount of hours = \"value\". If you truly believe on that, then the mobile Tencent games are the ideal choice, after all, they never end. The 30 hours or so of this PS3 game justifies $60 in 2024, sure, talking about logical reasoning", "label": 1}
{"text": "> Gaming is a relatively cheap hobby for the amount of hours you get per dollar spent\n\nJust because there's more expensive hobbies that doesn't mean its cheap which it really isn't.", "label": 1}
{"text": "No way.  Having an end is a good thing.  $2 an hour for entertainment is extremely cheap.  A round of golf with a cart is like $70 for 18 holes and that lasts about 4 hours.  Go to a concert and you're looking at $100 for 3 hours.  A nice dinner out with drinks and it's looking like $75.    Games give enormous value for the money, even at full price and gamers don't appreciate it.", "label": 1}
{"text": "That's pure horseshit, lol to share the hobby with such idiots, no wonder Ubisoft bloated all their games to be \"open world rpgs\" that take 100 hours to complete, Last of Us 2 being 30 hours long, etc.. bloat for the sake of bloat. A 3 hours long game like INSIDE is worthless by following this twisted logic, you can finish Cyberpunk in 20 hours, meanwhile Starfield takes 40 hours, that makes Starfield the more valuable product?", "label": 1}
{"text": "Less than $10 on ebay....so, no.", "label": 1}
{"text": "A $100 concert? Good god I need to move wherever you are. ", "label": 1}
{"text": "funny how you tell people to educate themselves while being completely wrong, not only do they get paid for ads, multiple content creators even have stated they get more of a cut from premium user that ad watchers, and a significant amount more on longer videos.", "label": 1}
{"text": "After you buy a $1500+ computer, $500 monitor, $200 mouse and keyboard, and a $80 game, it’s _FREE!_", "label": 1}
{"text": "My chats with these fellas have now evolved to \"Well youtube was losing money until recently so they need all those intrusive ads\"..... 🤣\n\n\n\n\nThey only earned 24 billion first quarter this year alone, poor bustards. ", "label": 1}
{"text": "That Google boot must taste real good", "label": 1}
{"text": "Making a fortnite map is desperate.", "label": 1}
{"text": "Funny, because the biggest excuse I hear for paying is \"I can't block ads on my shitty tv\".\n\n\n\n\nWouldn't have a shitty TV if you wasn't wasting you doe on a free service. 🤣", "label": 1}
{"text": "You don't have to spend 1.5k on a pc to game. I'm pretty sure people in less privileged parts of the world don't spend a years salary to game.", "label": 1}
{"text": "Concerts are overrated. Festivals are where it's at. 350 i get 4 days worth of fun that's like 96 hours. Pretty cheap per dollar  minus the food, travel expenses, hotel/camping equipment. It gets expensive and gaming isn't as cheap as you are acting like.", "label": 1}
{"text": "It's arguably piracy, since you're accessing content while bypassing the systems that's supposed to pay for it. And to some people, piracy is theft (I don't agree with that part).", "label": 1}
{"text": "No, you miss read his comment. He’s saying the VP controls everything lol", "label": 1}
{"text": "Why would your TV have anything to do with blocking ads? Blocking and filtering is done at the network level. \n\nBrains. Get some brains. And a job.", "label": 1}
{"text": "Then don't play dumbass", "label": 1}
{"text": "Clicking a few buttons on a browser is literally less effort than setting up an account and 2fa, activating that account and then setting up a payment agreement.  Stop messing around now.  \n\n\n\n\nIt only seems more effort if you don't have a clue what you are doing, and that's what Google is preying on.", "label": 1}
{"text": "To run this decade and a half old game? Think again.", "label": 1}
{"text": "I'm not saying old is bad, I'm saying GOOD isn't cheap", "label": 1}
{"text": "I hope you’re not charging money for your game because it would seem kinda hypocritical of you since you seem to think people like YouTubers don’t deserve revenue", "label": 1}
{"text": "Couple goals 💯💯\n\nAlso, Happy Cake Day 🎉🎊", "label": 1}
{"text": "Another one who thinks clicking a button to download a different app is too complicated yet downloading YouTube, setting up an account, setting up 2fa for that account and then setting up a payment account for that app is hot complicated.  🤣\n\n\n\n\nThere's a big difference in something actually being complicated and your brain thinking it's complicated.  ", "label": 1}
{"text": "Trying to insult my intelligence because I can afford a $10/month subscription isn't working. \n\nIt isn't complicated. It's inconvenient, and a worse experience than using th enative app.\n\nYou can make all the excuses you want for the poor experience you choose to have with Youtube. They have nothing to do with my ability to not be limited by them.", "label": 1}
{"text": "If you can't afford something then don't do it. Improve your life instead of focusing on fucking games. \n\nDont sit there and complain about the costs that's just straight loser speak. If you are an adult with an adult job, a one time $1200 purchase that lasts 5-10 years is NOTHING. If you can't afford that then you need to re-evaluate your life choices", "label": 1}
{"text": "I agree, so I didn't buy it. When it's sold for a price that's reasonable I'll buy it. Also, it has a 93% approval on Steam, being lauded as a \"perfect port\" by everyone.\n\n>a port that was probably outsourced by a dev studio in a third world country so that Rockstar could make as much profit as possible?\n\nTrying to make yourself feel better about being a mooch? It was made by Double Eleven Studios btw, a British dev...", "label": 1}
{"text": "How is it desperate? Fortnite is hugely popular among young people, it makes perfect sense to do something with it if you want to reach young voters.", "label": 1}
{"text": "Lol, trying to brag about having to pay for s free service because you can't afford a decent modern tv.\n\n\n\n\nStop it. 🤣", "label": 1}
{"text": "Had me in the first half ngl\n\nRelative to a lot of other hobbies, yes it’s pretty cheap, but just like other hobbies, can get expensive \n\nEntitled and cheap? I both agree and disagree, cheap, yeah maybe sometimes but I think entitled is the wrong word. Gamers just want companies to make GOOD games, and that’s not really a tall ask; there are so many amazing games of the past and when games coming out 5-10-15 years later aren’t producing games nearly as likable with MANY times the budget, that’s a problem.\n\nSome people like micro transactions but they do not belong in everything.\n\nBaldurs Gate 3, while not a perfect game, is an example of getting it right. Reasonably priced, reasonably optimized, a complete experience OTB, no micro transactions, no paywalled content, and a devs that actually delivered what the community asked for, not shareholders", "label": 1}
{"text": "DR Here, as long as you don't have an obsession with maxing all the sliders even modern games are very playable with hardware that reasonably priced even by our standards.\n\nPlaying at ultra settings is not a must to enjoy a game.", "label": 1}
{"text": "I run my 11 year old PC in the spare room for older games and emulating. Is that not gaming?", "label": 1}
{"text": "I play black ops 6 on 120 fps & ultra graphic and this shit have many problems i can't image how they have all these money and they can't make a games support more than 144hz 😂😂😂😂", "label": 1}
{"text": "Obviously it is. \n\nI’m in the same boat with my pretty old pc. \n\nGood luck to either of us when we try to launch RDR1.", "label": 1}
{"text": "But you can buy good stuff pretty cheap if you buy older/used.\nBut that's not the point. \nMy point was that you don't have to have a beast PC to game. There are lots of older and indie games that run well on older and cheaper hardware. \n\nIt just feels like you guys are saying that if you aren't playing the latest release, cranked to ultra, you're not gaming. And that, I just don't agree with.", "label": 1}
{"text": "YOU'RE the one that said \"year's salary to game\" right after \"$1500\"", "label": 1}
{"text": "Touching grass is 0€/hour, maybe you should try that.", "label": 1}
{"text": "scream it louder that you're broke lil bro it's okay", "label": 1}
{"text": "[https://imgur.com/a/aRgk4NR](https://imgur.com/a/aRgk4NR)\n\nHere's a photo i took last night. Didnt take any more unfortunately. Waiting for 1mm thermal pads to arrive later today.", "label": 1}
{"text": "Oh man, don't get me started on this.", "label": 1}
{"text": "I'm seeing a lot of pro-premium comments with the \"oh I love the music\", pretty sure they're all bots. who in their right mind gives money to youtube?!", "label": 1}
{"text": "No it's not \"basic political canvassing\" it's being stupid and attempting to connect to a different demographic without a clue in the world as to what they want. Videogames are the premiere escapist entertainment format and you decide to go there to drum up votes? This move is either stupidity or desperation and seeing how you are a diehard Harriser you should be on the side of desperation.", "label": 1}
{"text": "\"lil bro\" bro grow up", "label": 1}
{"text": "you’re 100% right. gamers complain about spending $60 on a game that they spend 100 hours playing. they will get mad that a free game doesn’t have enough content. most have absolutely no appreciation for the hundreds of artists and engineers spending thousands of hours creating the game. a lot of them produce absolutely nothing. they are the reason why it is embarrassing to admit you’re a gamer.", "label": 1}
{"text": "Fuck you, I am starting you anyway\n\n\"Wi-Fi cable\"", "label": 1}
{"text": "I just use brave browser. Don't have to do anything", "label": 1}
{"text": "People watch content from creators they seemingly like but then when it comes to some sort of payment for said comment the attitude is \"fuck you\". It's weird.", "label": 1}
{"text": "I love how upset you are over this absolutely nothing topic. Did you lose your mind like this when AOC and Walz streamed on Twitch? They’ve been doing outreach like this for years.", "label": 1}
{"text": "This sends me off on a tangential rant\n\nI am so disappointed that ethernet cable are called that because ether-net would be such an awesome name for wifi, it's networking through the ether (the Victorian term for the atmosphere)", "label": 1}
{"text": "You're an actual retard if you take manufacturer benchmarks at face value", "label": 1}
{"text": "When you do that is it saying anything on the POST screen like power failure or corruption?\n\nIf not it's probably time to check to make sure the bios battery is correctly seated and if that is fine I'd probably try to do a flash back or try another bios if your motherboard supports either of those.", "label": 1}
{"text": "Everything there is unholy. Rape capital of the world. And scam capital", "label": 1}
{"text": "[https://www.cdkeyoffer.com/key/201710180856556150.html?urd=3dcko10](https://www.cdkeyoffer.com/key/201710180856556150.html?urd=3dcko10) and then use code GURU30 to drop it to $16.20", "label": 1}
{"text": "Right, because its SO inconvenient to launch rdr lol, poor thing must've been traumatized having to open a whole different launcher. Theres also easy, LEGAL, ways around that...\n\nYou know what you are, stop trying to convince yourself it's for any reason other than you're cheap and a leech. I'll keep supporting the industry for you, don't worry ya little moocher.", "label": 1}
{"text": ">The biggest problem you’ll face is that you can’t play games with anti-cheat. \n\nThis is a non-issue for me because like I said, I don't play any online multiplayer games on PC.\n\n>A lot of games will perform worse than on Windows; some will work well, some better, some worse.\n\nI have pretty low expectations for performance and I mostly play older games so as long as they *work* at a playable frame rate I really don't care that much whether there is a performance regression.\n\n>Another major setback is that driver support for gaming peripherals is often nonexistent.\n\nThe main peripherals I use are a DualShock 4, Xbox One controller, Steam controller, Razer Blackwidow Mini keyboard, and a Logitech G305 mosue.\n\nI've tested the keyboard already on my laptop running Mint and it seems to work fine. I know the Steam controller will work and according to other posts I found, the DS4 and Xbox One controller should work just fine as well.\n\nAre there any other common pain points with peripherals that I should be aware of?", "label": 1}
{"text": "It is.\n\nYou want /r/hardwareswap", "label": 1}
{"text": "> Lutris is probably the easiest way to get games from other launchers working, but that brings us to my initial word, \"fiddly.\" While it's possible to get games from other launchers working, sometimes it takes lots of work and tweaking.\n\nYeah, this is the biggest thing holding me up. I'm fine with doing a lot of tweaking to get something running as long as I know that it can run, but it seems like with non-Steam games, \"will it run?\" is a real question mark.\n\nBasically I just want to make sure I can play Dragon Age and Mass Effect on my PC lol", "label": 1}
{"text": ">you're just another choosingbeggar\n\nI'm not begging though? I'm choosing that i don't want to pay. the multi billion dollar companies will survive without my support\n\n>Or just accept that you either pay with money or your time\n\nonly thing I'm accepting is that you're a corporate shill", "label": 1}
{"text": "First things first, 3000 euros is more than you need for a decent gaming PC. Even if you include the price of a monitor, keyboard, and mouse, you could build something that easily outperforms the PS5 Pro for half that much.\n\nAre you down with learning to build it yourself (which really isn't that hard), or would you prefer a prebuilt?", "label": 1}
{"text": "Spoken like a true beggar. You don't want to pay? then don't watch youtube. Also paying for a service I use often doesn't make me a shill.", "label": 1}
{"text": "All that time waiting to get bent over by some neck beard with a shield and throwing knives. COD fell off years ago.", "label": 1}
{"text": "15yeas 😄😄😄😄😄😄😄😄😄😄😄😄😄😄😄", "label": 1}
{"text": "Wow, total fucking midwit-take… “…the exact same PS3 game”\n\nDid the PS3 version have HDR, Native 4K resolution up to 144hz, 21:9 and 32:9 support, adjustable draw distances, shadow quality, and more?\n\nYou’re completely uninformed and the only thing sadder than that is all the smooth brains agreeing with you that don’t even realize you’re full of shit.", "label": 1}
{"text": "So what if they are not?", "label": 1}
{"text": "You get honorary membership", "label": 1}
{"text": "Wrong sub. Rule 8\n\nr/suggestalaptop", "label": 1}
{"text": "> That said, the reality that many devices that are still usable will stop receiving security updates in a year has pushed interest in Linux from people who are interested in it to preserve the usefulness of hardware that Windows is deliberately leaving behind, rather than some ideological concern.\n\nYep. My laptop is 11 years old. Microsoft won't support it any more (on Win11) despite the fact that it is still plenty usable for most basic computing tasks in a modern environment. On Mint it's still as snappy as ever and does everything I want it to. Win10 is technically still supported but runs like garbage doing the same stuff that Mint does without missing a beat.", "label": 1}
{"text": "The 1080 was a great card in 2016, not so great in late 2024.\n\nThe 4060 and 3060 are both ok-but-not-amazing cards in the current market. They're definitely more entry-level but you can still play every game on the market on them as long as you keep your expectations for frame rates and resolutions in check.", "label": 1}
{"text": "My first time seeing this version. I like this one better xD", "label": 1}
{"text": "![gif](giphy|aQwvKKi4Lv3t63nZl9|downsized)", "label": 1}
{"text": "Lil Diddy", "label": 1}
{"text": "Just use a crowbar if you're going that route anyway.", "label": 1}
{"text": "Raid 0 was really useful for gaming back when the WD Raptor was the fastest spinning platter HDD you could get.\n\nYou're increasing your chances for failure (especially with 3 lower end drives) for no real world gain on today's SSDs. There's no redundancy on RAID 0, so when one drive goes, everything goes. Everything? EVERYTHING.\n\nYou're also trying to squeeze blood from a stone - while your drives support HMB, they lack a DRAM cache and use QLC nand. If you wanted speed, you're probably better off getting a fast 980 or 990 pro or a P5.\n\nIt's fun for benchmarks, but if your Windows install ever goes, or if you need to update your SSD firmware.", "label": 1}
{"text": "For Christ sake it used to be FREE", "label": 1}
{"text": "My old boss called it the CPU, but that seems to have become systemic throughout the organization. Even younger employees in the same age bracket as me (i.e. mid-30s) have started calling it the CPU. I don't know if this is something that IT has just decided to go along with and not bother fighting it or what but it's strange.", "label": 1}
{"text": "I'm sorry I'm not from India and have no idea how bad the market is there. Your build does kind of suck though for the price you paid. Especially the 4060 ti. Amd is a much better option. And you should've went for the 7700x. Enjoy it nonetheless. I will admit I do prefer amd over intel. Fanboy not so much, intel just sucks at the moment, especially the 13th and 14th gen problems and the not so great core ultra series", "label": 1}
{"text": "lmao how about no? fuck off", "label": 1}
{"text": "They hate anything funny 😑", "label": 1}
{"text": "Bro chill 😂😂😂😂😂", "label": 1}
{"text": "Trump PC", "label": 1}
{"text": "Based flag", "label": 1}
{"text": "LowTierGod Jr.", "label": 1}
{"text": "Wow thanks man! No one asked", "label": 1}
{"text": "how dumb are you to think $80 for any modern GPU in existence is a rip off", "label": 1}
{"text": "At least 2", "label": 1}
{"text": "It was, but they eventually took 2 months to respond to my email and then claimed that I did not ask for a refund within the window. I sent it in twice to them and both times it returned unfixed and with the issues exacerbated.", "label": 1}
{"text": "Holy crap? Really? As I said, I thought I could get 2.5 for it with all the work done.", "label": 1}
{"text": "Why’d ya ask if you saw how much it was worth on pc price checker", "label": 1}
{"text": "Needed more opinions :)", "label": 1}
{"text": "Picking the same parts on pcpartpicker does not tell you the value of a PC. For example, a 9th gen i9 is almost $400. \n\nAsking for valuation is against the rules. But if you put $1000 to avoid low balls, you're in for a rude awakening on how dated this hardware is, you're going to end up accepting what you currently consider a low ball.", "label": 1}
{"text": "I'd say 1000 is more or less reasonable. Maybe as low as 800, but still reasonable for the specs. \n\nAt least your listing isn't one of the \"I know what I've got, firm $3500, no low-ball offers\" ones that is insane", "label": 1}
{"text": "Considering you can build this used for $675. You're probably not going to get more than $700 for it.", "label": 1}
{"text": "Bro found the wrong master race sub", "label": 1}
{"text": "What? Not true at all. You are ignorant.", "label": 1}
{"text": "Damn it whoops", "label": 1}
{"text": "Unhinged idea: Put wire mesh, presumably made out of copper to conduct electricity better. Cover the top of the PC with the copper wire and have a strong electric current running through, as soon as your car jumps on top they'll learn a lesson.", "label": 1}
{"text": "Lmfao what a joke, do people still fall for these? It ain't 2012 no more brother", "label": 1}
{"text": "Guess he didn’t think how his words would hit the bottom line. Classic executive blunder.", "label": 1}
{"text": "Running your mouth without a backup plan is a rookie mistake, especially in a volatile market like this. Costly blunder for Intel.", "label": 1}
{"text": "Guess that’s what happens when you forget the basics of business relations. Companies can’t afford to lose key partnerships over careless comments.", "label": 1}
{"text": "It’s a classic case of speaking without thinking. Business decisions are delicate, and comments like that can really backfire.", "label": 1}
{"text": "Mate that's a brilliant build looks frigging awesome ☣️👍", "label": 1}
{"text": "This is the correct answer. That CPU is outdated and wasn’t very good to start out with and the RAM is pretty slow so you’re basically selling the gpu in a working system", "label": 1}
{"text": "350?", "label": 1}
{"text": "Bought this pc like 5 years ago :') It has served me well... Ah memories", "label": 1}
{"text": "I get it. My first pc had a dual core i7 back when those were a thing. It was a pos but a pc is a pc", "label": 1}
{"text": "Easily 650 where i live", "label": 1}
{"text": "Intel made a 2c4t i7? The heck? Which gen was that?", "label": 1}
{"text": "Here's the whole look if that helps you guys\n\nhttps://preview.redd.it/u40hd9kmh2yd1.jpeg?width=3094&format=pjpg&auto=webp&s=37b8a111ad986512bf0cd3369f1144b85fc5a893", "label": 1}
{"text": "They're swapping pets for frames, selling souls for cores, and choosing FPS over TLC!", "label": 1}
{"text": "15 years ago Gelsinger was pleading for Otellini to go all in on discrete graphics cards and was insistent that Nvidia was their actual competitor and not AMD. No one listened and now Intel is a hair's breath from being a commodity product. He tried to steer the ship but the finance dipshit in charge only cared about next quarters profits. ", "label": 1}
{"text": "Apparently Germany is a better country and people get much higher IQ.", "label": 1}
{"text": "Insane thing to type out WTF", "label": 1}
{"text": "https://www.reddit.com/r/MapPorn/comments/1g3fvue/chinese_military_drills_around_taiwan_as_of_14/", "label": 1}
{"text": "My 1st pc had a pentium 166mhz with mmx technology and a whopping 2mb of ram.", "label": 1}
{"text": "Yea pretty much. Those fuckups made ryzen look pristine when we finally got laptops with it", "label": 1}
{"text": "You sound like my dad", "label": 1}
{"text": "300-350$ pretty ok price", "label": 1}
{"text": "If you don't run the newest intel/amd big dick 7000 core retard edition with tdp of 600 then 212 hyper or peerless is absolutely fine. Just mount it correctly and use new and good paste. If you worry about dba then use the spare money and get a good fan and regulate it with fan control.", "label": 1}
{"text": "MINDFACTORY ERWÄHNT! KOMMENTARBEREICH WIRD ANNEKTIERT!", "label": 1}
{"text": "No, China is literally the reason it's \"unstable\". It's one of those shitty neighbor countries like Russia, or North Korea or The USsy, that have a history and can come in and fuck you up on whim.", "label": 1}
{"text": "!allmessage", "label": 1}
{"text": "The amount of system RAM you have and the amount of VRAM on your GPU have nothing to do with each other.", "label": 1}
{"text": "I have a really great solution. some would almost call it genius. If you move your cat from there with you hands it won't be there anymore. Jokes. \n\nCats are clever just intimate to them through speech, body language or straight up physical contact that you don't want them there. He/she is only sitting there because its warm obviously. So they'll only be there when the PC is switched on and so should you most of the time it's on anyway. So it's not like she's going to sneak onto it and sit there when it isn't warm. Unless she actualy just likes sitting in that area. Which would be uncommon and weird, but not impossible.\n\n  \nSetting boundries is something that people don't do enough with their pets. I keep seeing all these posts, \"my cat broke this, pulled this down\" etc etc. It's simple. We love our pets but these things are expensive. Keep the pets away from you expensive, electronic equipment. That means closing the door when you're not there and not having them willfully running around playing with things when you're not about. Just kick you cat out of the room when you game. It's a win/win. you can focus on your gaming or work without distraction from the pet.", "label": 1}
{"text": "You're probably autistic.", "label": 1}
{"text": "Ok, do you have anything to add about my argument?", "label": 1}
{"text": "Lmao I love this response. It perfectly shuts him down with a “go fuck yourself” undertone.\n\nChefs kiss 🤌", "label": 1}
{"text": "With the current warranty extension and latest BIOS updates I would feel comfortable buying a 14th gen CPU. \n\nFor gaming, I would just get the 14700K presuming it's cheaper. No reason to pull more power and heat.", "label": 1}
{"text": "ha ha you like trains", "label": 1}
{"text": "Obligatory \"Rockchuck is a Nazi\"", "label": 1}
{"text": "> Maybe people just have different tastes and opinions. Nah. That can't be it. Must be corruption.\n\nWould you trust a food critic if he gave McDonalds/Applebees 5 Star Reviews?  Would you trust a 7 y/o old to review a michelin star restaurant?   \n\nThey're either corrupt OR their taste is so bad they have no business being a reviewer in the first place.", "label": 1}
{"text": "Pebble throw :)", "label": 1}
{"text": "My favorite thing about this comment is that it references Michelin stars which are restaurant ratings given out by literally a car tire company.", "label": 1}
{"text": "Michelin Stars are given out by professional chefs and restaurant owners who are hired by the tire company.", "label": 1}
{"text": "Okay everybody I have a solution to this moronic problem. \n\nOrder a PC without tempered glass panels. Before you put the last panel on, turn on the PC and take a picture of your fucking GPU cooler with anime manga hentai monster dick on it or whatever it is you like. Step 2 is putting this picture as your desktop background. \n\nClose the case. Look at the desktop at your animehentai tits ass boobs vagene dicktwatpenisasshole waifu and profit from a case that doesnt explode and you get to see your GPU (for some fucking reason). \n\nEnjoy being normal for once in your life. \n\nFollow me for more hateful advice.", "label": 1}
{"text": "Thank you, imreloadin. Unfortunately, your submission has been removed for the following reason(s):\n\n* **Rule #2** - This post violates [PCMR Etiquette](https://www.reddit.com/r/pcmasterrace/wiki/etiquette). We will not allow behavior contrary to it, e.g. brigading, witch-hunting, asking for upvotes or downvotes, enabling piracy, flamebaiting, clickbaiting, intentional rudeness, text spamming, using all caps or emojis/smileys/emoticons in titles or overusing them in comments, meta-reddit or meta-subreddit drama or complaints.\n\n  [More information about Rule 2](https://www.reddit.com/r/pcmasterrace/wiki/rules#wiki_rule_.232)\n\n* **Rule #6.3** - Blatant reposts/fad-chasing.\n\n  [More information about Rule 6](https://www.reddit.com/r/pcmasterrace/wiki/rules#wiki_rule_.236)\n\n\n\nFor info see the sidebar and the [rules](/r/pcmasterrace/wiki/rules). For questions [contact the mod team.](/message/compose?to=%2Fr%2Fpcmasterrace) **Replies to this removal or direct PMs to moderators about removals won't be replied to.** Thank you.", "label": 1}
{"text": "Clearly, you're tho one who's unable to comprehend the difference between a 400 dollar upgrade to a 2500+ dollar upgrade. Kindly go fuck yourself.", "label": 1}
{"text": "You posted a PCPartpicker link and you still need to ask? It quite literally TELLS you if everything is compatible. Thats the ENTIRE point of PCPartpicker!", "label": 1}
{"text": "🙏🙏🙏🙏7800x3d price goes down sometime in the next hundred years from the 5-fucking-hundred it is now", "label": 1}
{"text": "There is always one idiot who wants attention by saying the dumbest shit. Congratulations you are that idiot", "label": 1}
{"text": "The average journalist is lower than a used car salesman, politician, or even a patent troll lawyer. Absolute scum of the earth lacking any semblance of morality or ethics. Fortunately, they are being replaced by AI which, somehow, manages to be more accurate and truthful.", "label": 1}
{"text": "I’d be wary about selling them since there’s cracks in there.\n\nPersonally I’d keep the lot and play them all to re experience what PC gaming used to be.", "label": 1}
{"text": "Maybe someone on Marketplace or something, but I don't know of any retailer that's going to take CD burns of old games.", "label": 1}
{"text": "The point isn't that Michelin Star reviews are bad. The point is that arbitrary goalposts for what makes a reviewer \"trustworthy\" are just that, arbitrary.\n\n\nIf a child has a great sense for food, a review of a restaurant from them wouldn't be without value.", "label": 1}
{"text": "uh huh. Pirated pc games from 2 decades ago on cd-roms that are probably half eaten by fungus now (yes it's a thing, **Cladosporium cladosporioides**). In a world where cd-rom drives are not even cup holders anymore (also was a thing).\n\nWhere do I sign up?", "label": 1}
{"text": "Looking at the age of most of these games, they won't run on a current computer.  The backend framework of Windows has changed.  Also, everyone needs a buck right now but no one is buying you 20 year old shareware on cdrw.", "label": 1}
{"text": "the pirate bay booth on your local market", "label": 1}
{"text": "\"In a world where cd-rom drives are not even cup holders anymore (also was a thing).\"\n\nOkay but the \"free cupholder\" application that just popped out your CD drive was peak humour.", "label": 1}
{"text": "Look, Most these games are older than I am \nJust trying to see what to do with em \nIs there a way to recycle them or something ?", "label": 1}
{"text": ">The point is that arbitrary goalposts for what makes a reviewer \"trustworthy\" are just that, arbitrary.\n\nThis feels like some sort of aesthetic parallel to moral relativism. Sure, obviously all standards are inherently based on premises. So what? Most humans can find shared ground on their basic premises. Most of us agree genocide is bad, so moral relativism isn't very useful. Most of us agree that a \"video game\" consisting of ten hours of a black screen and then credits would be a bad game, so at least in principle we can find shared aesthetic preferences too. That makes aesthetic relativism seem to be of questionable value too. \n\nMichelin reviews are held to be trustworthy because they are very consistent in delivering ratings according to a set of standards that align with a clear set of aesthetic preferences people find useful. You're allowed to genuinely prefer shit sandwiches served out of cockroach-infested buildings, of course, but that wouldn't really say anything except that you had deviant tastes. The same could be true for your video game tastes, too, but that wouldn't mean that video game reviewers can't be classified into trustworthy or untrustworthy (for the vast majority of not-you consumers).", "label": 1}
{"text": "Some of these are,, backups of the original game. You can't sell those\n\nThe rest won't be worth much without original box", "label": 1}
{"text": "Ah well ,what can you do \nAppreciate it", "label": 1}
{"text": "While neat to look at, a lot of these games are available uploaded on myabandonware.com for example if they can't be bought digitally atm on steam, gog or similar.", "label": 1}
{"text": "I mean im genuinely interested to hear why you're so salty that I'd prefer an entertaining experience over a vanilla whitebread approach to game design. You're over here spamming insults in a vain effort to evoke the same, but I'm just really more confused than angry. What's your problem? Do you even know?", "label": 1}
{"text": "Are you lost?  You're in /r/pcmasterrace", "label": 1}
{"text": "🤣🤣🤣🤣", "label": 1}
{"text": "He's a Jew of course he lies ", "label": 1}
{"text": "Do we have any idea on when the \"9950X3D\" will release? With everything that's happened with intel recently, I'm finally really considering making the jump. Have only ever had Intel CPU's for decades, so got used to Quicksync etc and the performance I'd expect from them, but this last 285k release (maybe I'm getting it mixed up too) is seemingly a big flop. Sure , the 285k would be an upgrade but from what I've seen even 12th gen beats it out in some cases performance wise.", "label": 1}
{"text": "Is the \"9950X3D\" the one that's coming in November? Or is that the one that comes after it in 2025?", "label": 1}
{"text": "Shove them into your piss hole", "label": 1}
{"text": "In which apps? And what about the 9950x3d?", "label": 1}
{"text": "Why would it be slower?", "label": 1}
{"text": "No it wasnt AAA. But it got as much flak as a bad AAA game normally would. Dustborn reportedly cost 200m dollars last I checked and recieved tax payer money as well to fund it. I wouldnt call that indie. CD project red is considered AAA and the Witcher 3 reportedly cost 81 million.\n\nThe big issue with dusborn is that it effectively became an example of Poe's Law and thats why it got a TON of flak.\n\n\"Poe's law is an internet adage that states that some readers may mistake a sarcastic or parodic expression of extreme views for a sincere one if the author's intent is not clear.\" IE, people couldnt tell it was a parody because there was no humor to indicate so, but the other side of the coin is \"you cant be serious about this game right?\"\n\nWhen I saw actual gameplay, I thought it was a right wing PARODY until the devs had a MASSIVE meltdown on twitter.\n\nBut its not the AAA that made it a bad release cantidate, its all the AIRTIME it did. So we got concord with bad airtime and dustborn, also with bad airtime. IE both were highly visible failures, and thats what my comment was pointing to. AAA had *nothing* to do with it.\n\nDustborn had too many eyeballs on it and thats why it made the rounds everywhere.", "label": 1}
{"text": "No I didn't misinterpret anything, you've said \"Is there even anything that you genuinely enjoy or do you just hate everything?\"\n\nthat and what you just typed are two completely different tones. This is exactly what I meant by the the wiggle I mentioned enjoying. Whenever I put your kind in their place, they start wiggling. I do it almost regularly here. And yeah, sorry I've got more important things to do now, I've gotta watch paint dry.", "label": 1}
{"text": "Send that shit back bruv. Whoever put that together needs to be put on toilet cleaning duty for a few months and just when he thinks he's gonna be allowed to build a PC again they sack him.", "label": 1}
{"text": "You can't say that right now! It's election season! \n\nDidn't you hear? Both sides aren't bad anymore! Now only one side is bad, and it happens to be the side I don't like!", "label": 1}
{"text": "Also [this](https://kiwifarms.st/threads/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform.203453/#post-19684680)", "label": 1}
{"text": "Found the trumptard", "label": 1}
{"text": "Ohhhh.... Well in that case I hope it doesn't keep you too busy and you get her up running properly soon. ✌️", "label": 1}
{"text": "Are you dumb? I was talking about consoles obviously there's better PC shit out... Are you slow? Hahaha", "label": 1}
{"text": "I've played around 2 hours now and so far I can't really say that it's bad. It's no baldurs gate 3 but so far it seems that it doesn't want to be, and I can respect that. And shows like \"Arcane\" have really proven how you can tell a serious story with a different art style. Also - did anyone criticise Bioshock infinite for its cartoony artstyle ?\n\nGotta say, bought it on a whim yesterday because of the dissonance between the gaming crowd who seems to bandwagon the hate-train and the gaming journalists who praise this game to high heavens, which I also kind of doubt. The truth is probably somewhere in the middle and I intend to find out where this game sits with me. \n\nI'm mainly a RPG guy, so far this year I've played FF 16, FF7 Rebirth, Baldurs Gate 3 and now dragon age the veilguard. And so far I've enjoyed every single one of them, at some points more, at some points less. I've also played DA:O and DA:I and so far I feel that this game is better than DA:I. Didn't really like Origins that much though as it felt too dated when I played it after DA:I. The combat is tighter, way less MMO-ey than in DA:I. That's a big plus so far, I felt the combat was one of Inquistions weakest points, along with the very empty maps and fetch quests. Will reserve judgement for later, but atm I also don't feel the \"HR is always in the writers room\" comment from skillup. Though I play with german localisation rn which may play a role here. Though there are no real options to cause conflict in conversations so far. There's no \"fuck you\" option, basically. You can choose between nice guy, funny guy and serious guy. Haven't spotted any bad guy options yet. \n\nAnd bad facial animations ? Nah, they're on the same level as we've had this year, at least imho. You may not like the artstyle, but the environmental detail and art, cloth simulation and animations are all very very solid in this game", "label": 1}
{"text": "Slut", "label": 1}
{"text": ":( :( :( :( into a problem and didhfjdjfbtv into a problem and didhfjdjfbtv into a problem and didhfjdjfbtv into a problem and didhfjdjfbtv into a problem 100% complete 100% complete 100% complete 100% complete  aaaqrcodeaaaaaaaaaaqrcodeaaaaaaaqrcodeaaaaaaqrcodeaaaa\n*SCREAMING SOUNDS OF ABSOLUTE GRAPHICS DESTRUCTION* SJDBDHDJSJAJAJSJSSJSJSJSJAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA", "label": 1}
{"text": "Sadly I'm not even sure that's the worst failure they've had.", "label": 1}
{"text": "god that dad is dumb", "label": 1}
{"text": "It's the kind of computer every boy dreams of", "label": 1}
{"text": "You're dumb.", "label": 1}
{"text": "Seems like a lot of executives are brain dead re tar ds that drink lead paint", "label": 1}
{"text": "The game is garbage, people who defend it are either shills, mentally ill, or haven't played Dragon Age Origins.\n\nOne of the best all time series of videogames got butchered by worthless/talentless writers and animators (like literally look at the fucking Qunari), but the Reddit echo chamber is so bought into their garbage political ideology, that they will shill and defend such mediocrity 🤡", "label": 1}
{"text": "Then you definitely should spam your nonsense even more, we both know nobody really pays attention to you outside of reddit.", "label": 1}
{"text": "at least i ain't as dumb as that dudes dad though good lord that's dumb(>!bitch!<)", "label": 1}
{"text": "If you are going to insult someone at least have the courtesy to structure the sentence correctly", "label": 1}
{"text": "It's pretty much a defense reflex for these people, they realize they are wrong and look like an idiot so they fall back and pretend they were trolling.", "label": 1}
{"text": "The trump supporter part confirms the rage bait", "label": 1}
{"text": "It's like after a team already won a game, so they send in the JV team. It's just fun for them at that point", "label": 1}
{"text": "It's like after a team already won a game, so they send in the JV team. It's just fun for them at that point", "label": 1}
{"text": "It's like after a team already won a game, so they send in the JV team. It's just fun for them at that point", "label": 1}
{"text": "No, he just deletes everything where he was wrong to make it seem like he's mostly true. He's never been first and correct about anything Nvidia, for example.", "label": 1}
{"text": "Wtf 🤣 F (LOCKED) CPU IS GONNA COME DEGRADED 🤦‍♂️\nOMG🤣🤣🤦‍♂️🤦‍♂️🤦‍♂️", "label": 1}
{"text": "You said anything you dumbass, PS6 comes in 2027 and will Humble 100% your PC, unless if you have something better than one Rtx 4090, Because PS6 will be 100 Teraflops FP32, and I know that based on how Sony multiply their consoles performance and the Technology of 2027 holiday which will be 2nm and that way 8.000 Cores, 4 Flops per Core 3.5Ghz GPU will be easy, and 112 TeraFlops Basically is just Twice the Size of PS5 PRO GPU and an Higher clock of 51%.", "label": 1}
{"text": "How many wires are in a mice cable? 2 or 3 might be easy, but at some point that's just too many wires to solder, heat wrap, and try no to make look like shit that just spending 40 bucks on a new one is easier.", "label": 1}
{"text": "Hahahaha oooooooook 👍", "label": 1}
{"text": "😂😂😂😂😂😂Bro u must be autistic or something ....look how mad your getting about video games hahaha....what a fucking douchebag lol....go jerk off on ur PS5 pro bro lol ....good God ....how much u wanna bet the pro doesn't provide the same performance as a 7800 xt....trust me there will be videos on YouTube chief...until then shut the fuck up and chill out clown lol", "label": 1}
{"text": "I think they are just joking. More likely it's what [this comment](https://old.reddit.com/r/pcmasterrace/comments/1ggmkvv/who_are_you_031_people_and_what_are_you_guys_even/luscmlr/) says", "label": 1}
{"text": "BUY! BUY! BUY!", "label": 1}
{"text": "The people they're catering to doesn't have jobs", "label": 1}
{"text": "100% this is the important part... **kernel level**", "label": 1}
{"text": "Online long distance gaming can never beat the feeling of gaming in the same room as other people ... and there's always that one rascal friend who tries to cheat and gets caught... *Hahaha*\n\n\nMany competition. Much laughs. Maximum memories.", "label": 1}
{"text": "At least you have a close**s**t friend (or clos**et** friend?) and a good, reliable friend is worth way more than a PC.", "label": 1}
{"text": "To games nexus you go!", "label": 1}
{"text": "what's wrong with you people that you just run your mouth to waste peoples time? In the video you referenced it is shown the cache is in the middle as in TO THE LEFT AND RIGHT of the cache there are cores. That's not how you fucking construct a sandwich now is it? you'd call it a sandwich if there were cores above the cache as well as under the cache, which is NOT what's shown in the video. Are you dense or something.Also what EXTRA cache are you on about? there is no EXTRA cache. You know what, fuck this \n\n9800X3D CACHE IS UNDER THE CORES. PERIOD. NOW GTFO AND GO WASTE SOMEONE ELSE'S TIME \n\nFUCK", "label": 1}
{"text": "PLEASE, HELP, SIR. I'M INDIAN.", "label": 1}
{"text": "Photoshop the cable if they only want the picture 😂😂😂😂", "label": 1}
{"text": "They both represent ruling class elite parties that engage in bribery (lobbying) and manipulation (the texts they spam everyone with asking for their votes, astroturfing on X and Reddit, their language and rhetoric).\n\nIf you're lucky, you might even get to vote on which of their hand picked representatives for themselves you're allowed to vote for in the election! Only if you're lucky though, otherwise they just tell you \"Hey, we decided you only have one single choice from our side, and if you don't vote for them you might as well throw out your vote\".", "label": 1}
{"text": "Thats a laptop when you mention cooling", "label": 1}
{"text": "Only a retard would destroy the things the company says anyways, that’s just a cover their ass..", "label": 1}
{"text": "400 and someone should insta buy it", "label": 1}
{"text": "So I had 1 razer keyboard last me 10 years almost, I thought it was fantastic, bought another, spilled something on it, so of course it broke, my bad, bought a new one... it started spazzing out day one, I sent it in for replacement, they send me a new one... it also spazzed out. I was done dealing with them, so I gave it to my kid to pretend to have his own computer (He loves the clicky clacky) and have moeved to custom keyboards. As for a mouse I have a Naga that's still going strong after a few years. But I'm not counting on getting a new one later. Let us not forget their custom software is required for some functionality of their mice. \n\n  \nI've had a 10 times better experience with a custom keyboard that I can actually swap out parts on. And hey, if you like the clicky sound of Razer, fret not, they started selling their switches alone so you can get that sam clicky sound.", "label": 1}
{"text": "The license?", "label": 1}
{"text": "AMD users are the most oppressed minority in the history of humanity, no other group has ever faced such discrimination in the form of the mere *suggestion* there was a bias on an online chat forum for PC gaming.\n\nyall are actually worse than the console wars tards", "label": 1}
{"text": "🤣🤣🤣🤣", "label": 1}
{"text": "I laughed so hard at this😂😅 I build them as a side job, and when someone brings a cyberpower in to me to “fix” I’m always like “well… this is about to be some dumb shit. “😂😂", "label": 1}
{"text": "At my workplace we have a department that replaces computers every two years compared to the three to four year cycle for other departments and we had 300 all in one HP computers with Intel i7 and at the time 16gb RAM they were working powerhouses and had years of life left but nope we had to recycle and the recycling company makes us smash a hammer into the LCD screen to ensure they cannot be used.\n\nIt was bonkers as we are paying the company to collect the units when I put forward a proposal to factory reset the units and hand them to local schools or charities at zero cost which would have saved us a few grand but nope.", "label": 1}
{"text": "r/angryupvote", "label": 1}
{"text": "https://preview.redd.it/zad1r0jfcbyd1.png?width=720&format=pjpg&auto=webp&s=2539eb341a780dddce0ee6a0634d0526d12c3c71", "label": 1}
{"text": "https://preview.redd.it/o01m7y2ucbyd1.jpeg?width=736&format=pjpg&auto=webp&s=c5253e56555a62e231ebc57755ce665f9e774614", "label": 1}
{"text": "https://preview.redd.it/l08lpen3ebyd1.jpeg?width=1080&format=pjpg&auto=webp&s=6e09f12d5fa8216e122010eee6427d310b5d7912", "label": 1}
{"text": "The most cursed part of this is that it had 7 legs", "label": 1}
{"text": "https://preview.redd.it/clgmkftfebyd1.jpeg?width=500&format=pjpg&auto=webp&s=ec43cd7abd76d818aa2907953d0687cd895aee0b", "label": 1}
{"text": "https://preview.redd.it/c4ghasbufbyd1.jpeg?width=1170&format=pjpg&auto=webp&s=2b1dee2804f18db3a50dfb1cf647a4153c9def3e\n\nI will finish it before you can.", "label": 1}
{"text": "https://preview.redd.it/1ghjwig4gbyd1.jpeg?width=500&format=pjpg&auto=webp&s=3871075cb55031996f4a71ecf67a7b493df55d5f\n\nAllow me", "label": 1}
{"text": "https://preview.redd.it/fg3104ucgbyd1.png?width=246&format=pjpg&auto=webp&s=30ce1c3e117011fb2f32d38d3c4330ab5ddd11e4\n\nI don't allow you.", "label": 1}
{"text": "https://preview.redd.it/j74lhcavgbyd1.jpeg?width=1170&format=pjpg&auto=webp&s=32bfc05cda2a380f0e03315da27691d878785c01", "label": 1}
{"text": "Congrats man, now you can drop plinko balls on Stake in 4k ultra-hd right?", "label": 1}
{"text": "https://preview.redd.it/pgqnvcbpibyd1.png?width=827&format=pjpg&auto=webp&s=1718aa82d686792653532931f5e1bff70a7b7013", "label": 1}
{"text": "About 3.50", "label": 1}
{"text": "Never understand people you ask for help and then are super condescending to people afterwards. You’re the dickhead who can’t get his shit to work not anyone here, if you’re so much smarter then figure it out yourself", "label": 1}
{"text": "First off it was a joke you piece of shit. Secondly you never mentioned the price just the age. And idk dude just get a fucking job and stop crying on the Internet or don't and keep playing the copy you have. Poor loser.", "label": 1}
{"text": "what heads up? he didnt even provide a reason just said stay away like he has mental issues", "label": 1}
{"text": "Yoink", "label": 1}
{"text": "Nah, you are a retard.", "label": 1}
{"text": "https://preview.redd.it/a7u1izwg1cyd1.gif?width=300&format=png8&s=931d9e9a1b78390e0608ea0ec406792adb58dba8", "label": 1}
{"text": "Why not get another NVMe?", "label": 1}
{"text": "https://preview.redd.it/wn5rhb0b2cyd1.jpeg?width=1079&format=pjpg&auto=webp&s=84edc60f785c60604613aa6bdd50ffce1dc47094", "label": 1}
{"text": "That has nothing to do with the resolution and has everything to do with fan profile you setup rofl are you really that ignorant?", "label": 1}
{"text": "13th and 14th gen CPU have failure issues and they refuse(pretty much) to refund anyone and treat the refund decision as we should know what we got. It’s not a tiny fraction of people either. It’s basically the Red Ring of Death but for two generations of CPUs except Microsoft is saying fuck you.", "label": 1}
{"text": "https://preview.redd.it/bfprgenz2cyd1.jpeg?width=1079&format=pjpg&auto=webp&s=103fc5006001a03d4f3f7737296fa60e01800f87", "label": 1}
{"text": "BOC is reducing interest rates faster then the US so our dollar is going to 💩", "label": 1}
{"text": "well the cost of multiplying data went up 50% recently /s", "label": 1}
{"text": "https://preview.redd.it/faub3w5i9cyd1.jpeg?width=519&format=pjpg&auto=webp&s=55860224642c7a2ca933da37270a3bdc978f5da0", "label": 1}
{"text": "He loved the box so much he built his PC on it", "label": 1}
{"text": "Poor people fuck under the same roof. Rich people fuck in their individual mansions?", "label": 1}
{"text": "Faster in gaming? So the trade off is a bit of a hit to gaming but you gain productivity?", "label": 1}
{"text": "The bigots are trying to find any angle to attack this game, claiming it's \"woke.\" But that's not the reason why the game hasn't peaked as high as others. BG3 by the same definition is also very \"woke\" and is the highest one here.", "label": 1}
{"text": "And are the Ryzen 9 9900X3D and Ryzen 9 9950X3D supposed to be more powerful than the Ryzen 7 9800X3D?", "label": 1}
{"text": "WOKE", "label": 1}
{"text": "https://preview.redd.it/ylwphc6yjcyd1.png?width=720&format=pjpg&auto=webp&s=13eec60e330fd304d7636dd3bd71cd663abbfe13", "label": 1}
{"text": "You're in a cult. BG3 is not a woke game in the slightest. It doesn't pander, it doesn't shove woke propaganda and ideologies down your throat, it lets you be whoever you want including being straight up bad, gay people are just there, like everybody else and well written characters at that too... and guess what NOBODY CARED! Them bigots are only in your head lil bro. Keep coping though.", "label": 1}
{"text": "No counter argument, pussy.", "label": 1}
{"text": "Yeah but BG3 was a well written masterpiece of a game so its was loved by most people, yeah I agree some people are just bigots who cry \"woke\" but BG3 is a great example of how thats the minority BG3 is loved almost unanimously by the people who played it. Veilguard, on the other hand is pure crap it literally feels soulless and full of pure cringe in place of dialogue, diversity and inclusion is not why dragon age is bad.", "label": 1}
{"text": "The bigots aren't in their heads.... they are in their mirrors. That's why they see them so often.", "label": 1}
{"text": "Good. Trans non binary slop.", "label": 1}
{"text": "The difference is it was done in a natural way with BG3, whereas in this game it's there in order to lecture the player constantly and to make very on the nose points about current day social issues.", "label": 1}
{"text": "....and with this chain of memes, ive come to realise i love when people talk with memes", "label": 1}
{"text": "Woke with good writing = good game\nWoke with bad writing = bad game\n\n\nWoke != Bad\n\n\nPretty simple", "label": 1}
{"text": "\\*throws goblet\\* A miserable pile of secrets!", "label": 1}
{"text": "*only applicable for games that fail, for the good woke games that are massive hits I will completely alter my narrative so that I always come out on top \n\n🤡🤡🤡🤡🤡🤡🤡🤡", "label": 1}
{"text": "You don’t need a VPN unless you want to access a streaming service which is only available abroad.", "label": 1}
{"text": "I know nothing of Australia and can only assume Accc stands for \"Australian CUNT CUNT CUNT.\"", "label": 1}
{"text": "what is a woman?", "label": 1}
{"text": "Asking questions gets you answers. The fact that you just jumped to all these little assumptions in you little head is not MY problem lol. This huy. Anyways thanks for the input.", "label": 1}
{"text": "Hot take: the person that will never be questioned if it is its child", "label": 1}
{"text": "A featherless biped!", "label": 1}
{"text": "I am", "label": 1}
{"text": ":( :( :( :( :( :(", "label": 1}
{"text": "![gif](giphy|Vy9bLZxNutIlLuNXOZ)", "label": 1}
{"text": "Ah yes the all Knowing redditor knows whether or not a game has been profitable one day after launch by steam numbers  alone.  Also a game that had no preload available so many people may still be downloading it as we speak.\n\n\nHonestly just shut the fuck up you literally know that you have no idea whether or not a game was profitable", "label": 1}
{"text": "Congratulations, and fuck you. /s", "label": 1}
{"text": "Yes your ass does assume the position trust me I know kid. Youre toxic af we know this. Dont remind us. Now shoo, youre taking up space, adulrs are talking.", "label": 1}
{"text": "Hey! I'm sorry to hear about the average level IQ score. I'm sure that can be a bit frustrating to deal with. Because I'm feeling generous, I'll provide you with some tools written by a P.H.D level neuroscientist here--->[You can get started training your IQ level through this link](https://www.highiqpro.com/start-here)", "label": 1}
{"text": "Hey! I'm sorry to hear about the average level IQ score. I'm sure that can be a bit frustrating to deal with. Because I'm feeling generous, I'll provide you with some tools written by a P.H.D level neuroscientist here--->[You can get started training your IQ level through this link](https://www.highiqpro.com/start-here)", "label": 1}
{"text": "Hey! I'm sorry to hear about the average level IQ score. I'm sure that can be a bit frustrating to deal with. Because I'm feeling generous, I'll provide you with some tools written by a P.H.D level neuroscientist here--->[You can get started training your IQ level through this link](https://www.highiqpro.com/start-here)", "label": 1}
{"text": "I've only used headsets from razer, just one that is, and i've had it for many years and it's still great. I see a lot of people talking shit about razer but I'm personally extremely satisfied with this specific product.", "label": 1}
{"text": "Gg.deals", "label": 1}
{"text": "Stoner art student hitler?", "label": 1}
{"text": "Are you guys fucking insane? How much PCMR koolaid do you retards drink. Intel isn’t going anywhere. Insanity.", "label": 1}
{"text": "hahahahahahahahahahahahahha you’re so funny and smart hahahahahahahahahahahahahahahaha", "label": 1}
{"text": "I think you have a rock in your pc, hope this helps!", "label": 1}
{"text": "https://preview.redd.it/bf26kzo8jeyd1.jpeg?width=1440&format=pjpg&auto=webp&s=4fc50f17dc9a4cf82c5f9fef70f698d462a84aa9", "label": 1}
{"text": "So... since this wont affect you at all, and isnt relevant.. you're being a pedantic shitstain.. why?\n\nTrump cant raise your Tarrifs, kiddo.  \n\nHowever, Canadian Tarrifs are not different to US tarrifs.  And i happen to know you're required to pass the same kind of government classes in Canuckland.... that teach you the exact same things.  \n\nYou can go now, assclown.", "label": 1}
{"text": "No one owes you anything you drunk retard", "label": 1}
{"text": "SMH if we just ignore it Palestinian children will just rise from their graves", "label": 1}
{"text": "Israel has been a genocidal settler colonialist project for its entire history lmfao.", "label": 1}
{"text": "Look, folks, it sounds like you’re dealing with a real mess here! You were cruising at 144-200 FPS, and now you’re stuck at 30? That’s no good! \n\nFirst off, check for any background processes that might be hogging your resources. You know, sometimes those updates bring along unwanted guests, like a party you didn’t invite! And make sure your graphics drivers are up to date—always important, folks!\n\nIf other games are running smoothly, it’s probably not your hardware. But you might want to verify the game files. Sometimes a little check can do wonders! And if that doesn’t work, hey, reach out to support or check the forums—there’s always someone complaining about the latest patch!\n\nIn the end, you might just have to wait for a fix from Call of Duty. They’ve had their share of updates, and sometimes they don’t get it right. Just hang in there, and keep an eye out for those patches! You’ll be back to dominating in no time!", "label": 1}
{"text": "Thats crazy bro, wait until you hear about the United States.", "label": 1}
{"text": "That sounds pretty good to me", "label": 1}
{"text": "This isn’t the gotcha you think it is. At least the US is *only* funding the ongoing genocide in Palestine and not directly doing it.\n\n(Yes the US is fucking awful too)", "label": 1}
{"text": "Do you sit when you pee?", "label": 1}
{"text": "Kinda fishy", "label": 1}
{"text": "Can't stop laughing! 😂 This meme just hit different—perfectly captures the chaos of the week! What's your favorite part?", "label": 1}
{"text": "It sounds like you’re doing a great job troubleshooting your cooling situation! Given your setup, adding an exhaust fan is definitely a good move to improve airflow and reduce temperatures.\n\n1. **Number of Fans**: One exhaust fan at the rear would be a good start, but if you can fit a second one on top, it would help enhance airflow even more. Ideally, a balanced intake and exhaust setup keeps your system cool.\n2. **Fan Choice**: Both the Arctic P12 and NZXT AER P are solid options. The Arctic P12 is known for its performance and value, while the NZXT AER P also has good reviews but might be pricier. If budget is a concern and you're looking for the best performance for your investment, the Arctic P12 might be the way to go.\n3. **Placement**: If you opt for two fans, placing one at the rear and one on top can create effective airflow, drawing cooler air in from the front and pushing warmer air out.\n\nUltimately, it depends on your budget and space. If you can swing it, go for both an Arctic P12 for the rear and an additional fan on top. If not, starting with just the rear exhaust fan will already make a noticeable difference!", "label": 1}
{"text": "Yes, you can definitely try putting your RTX 4080 Super in a different PCIe slot on your Mag X670E Tomahawk WiFi motherboard. Here are a few things to consider:\n\n1. **Slot Compatibility**: Ensure the slot you’re considering is compatible with your GPU. The top slot usually provides the best performance, but if it’s loose, moving to a different slot can help secure it better.\n2. **Performance Impact**: While most modern GPUs perform well in PCIe x16 and x8 slots, using a different slot (like a lower bandwidth slot) may affect performance slightly, but it’s typically not drastic. For gaming and most tasks, you should still see good performance.\n3. **Physical Fit**: Make sure the GPU fits properly in the new slot and is secured well. If there's still some wiggle, check if the PCIe latch is engaged properly.\n4. **Cooling and Airflow**: Also consider how the new slot might affect airflow and cooling within your case.\n\nOverall, trying a different slot is a reasonable approach, especially if it resolves the issue of it being loose. Just be cautious to avoid damaging any components when reinstalling.\n\n4o mini", "label": 1}
{"text": "I say it’s alright.", "label": 1}
{"text": "Relate much", "label": 1}
{"text": "Get a job.", "label": 1}
{"text": "LOL", "label": 1}
{"text": "Our setup is almost identical I have a i7 6700k and a 1080 ti 2tb nvme 16gb ddr4", "label": 1}
{"text": "Nobody gives af. Wait another 2 weeks. Begging online is beyond pathetic. This is not the place.", "label": 1}
{"text": "Went from a petinum g4400 Dell mobo n case to a decent pc", "label": 1}
{"text": "OK buddy then don't give me a dollar I'm just asking not begging I'd no one sends it then oh well no reason to get mad I hope your In need one day and one helps 🫡", "label": 1}
{"text": "I code, but [AI will already do it better](https://www.rosebud.ai/ai-game-creator).", "label": 1}
{"text": "If Israels attacks on Hamas are a genocide, the bombing of nazi germany by the allied forces was too \n\nFuck Palestine, fuck Hamas", "label": 1}
{"text": "Israel are the nazis in this equation dumbass.", "label": 1}
{"text": "should checkout wallstreetbets, some of them invested an hour prior to intel disclosing their earnings and made some decent profit", "label": 1}
{"text": "Damn is it terrorism to fight back against a literal genocide?", "label": 1}
{"text": "4070?? The math is not mathing", "label": 1}
{"text": "Why you have ipod in it", "label": 1}
{"text": "PCs back then really were built different, now we cry if they sneeze lmao", "label": 1}
{"text": "What genocide? 😂", "label": 1}
{"text": "Everyone just send this post to support@logi.com", "label": 1}
{"text": "\\-\"Why are you hitting him\"  \n\\-\"Don't worry, there is such a large layer of dust there that it acts like an airbag.\"", "label": 1}
{"text": "People are always asking me, do it honk?", "label": 1}
{"text": "Murdering doctors and babies and other civilians is genocide kiddo", "label": 1}
{"text": "Fucking rip 😭😭😭 \n\n\n\n\n\n\n\nBut hey...next time you wanna change the thermalpaste or liquid just boot up the PC a little bit enough to warm it up 🤭", "label": 1}
{"text": "Nice to see a team red build once in a while. Great build man", "label": 1}
{"text": "This sub kinda sucks. \n\n\nIt's a bunch of dummy gamers pretending like they know about PCs. \n\n\n\nI enjoy r/buildapc and r/pcgaming more than this weird haphazard cult sub where People shit on you for saying they don't need a 4090 because video games cap out at 16 GB VRAM, And that 4090s are meant for video game creators in 3D artist who make the games for you in the first place.", "label": 1}
{"text": "People shit on you for saying objectively wrong things? Color me shocked…", "label": 1}
{"text": ">You can literally just glance at benchmarks of games and see the difference in performance \n\nNo, Your troglodyte brain [factually can't Tell the difference](https://lh5.googleusercontent.com/proxy/ts7BBYDOEIfU-ThYnC4ozDjzKMZF7QNMtqSjBF8O8TuFG1b5Ypel05GXilSBOkuDjrTzv13nw20jOVKo6-z4KyfsH1UV54m9kNqbZktotkbCStrI4gHzjYCOFmc) in frame increases until you hit about 500 frames a second, even then it's a barely noticeable improvement. You're the exact kind of dummy that marketing works on to sell more expensive shit. \n\n\n>You can literally just glance at benchmarks of games \n\nYeah but your human eyes still fucking suck. You're not a computer.", "label": 1}
{"text": "Got it, obvious troll. Move along.", "label": 1}
{"text": "Razer isn’t trash. You’re trash", "label": 1}
{"text": "Razer is trash.", "label": 1}
{"text": "I simply care about correctness, facts, and links and sources unlike most dummies.\n\nGo cry about it some more.", "label": 1}
{"text": "https://preview.redd.it/4hgz5x8wzhyd1.jpeg?width=3000&format=pjpg&auto=webp&s=def65e80551b88700c77571a3cc70f3a1a227789\n\nI'll strangle you with this cablw", "label": 1}
{"text": "You don’t care about correctness at all. You spout the same dumb shit console gamers spout when they say “your eyes can’t see above 24 fps.”\n\nHey, go to your desktop, set your fps to 60. Wiggle your mouse around. Pay attention to how it moves. Now set it to 120 or 144 and do the same thing. Tada, your eyes absolutely can notice a difference between 60 and 120/144. Or better yet, go to TestUFO in your browser. It’s immediately noticeable to me when I setup my OS for the first time and it’s at 60hz refresh instead of my usual 120. There was a time when I was naive like you and insisted that “I’ve been on 60 fps for so long and can’t see the difference so I don’t need to upgrade.” I was wrong and so are you \n\nSo the 4090 on average provides more than 2x the performance of a 4070 which allows people to play the latest games at high settings while retaining the FPS they’re comfortable with and you claim that there’s no reason to buy it unless you’re a 3D renderer?\n\nIt sounds like you’re just huffing massive copium trying to justify why your inability to purchase a better graphics card is actually “the best case scenario.” Either that, or you’re a troll.", "label": 1}
{"text": "Razer is complete garbage every single mouse i owned, the rubber pieces on the sides would fall off", "label": 1}
{"text": "Because mod who removed it has a small dick", "label": 1}
{"text": ">You don’t care about correctness at all. You spout the same dumb shit console gamers spout when they say “your eyes can’t see above 24 fps.”\n\n\nI'm literally a game designer dumbass. I know how shit works Because I make them for PC and console. \n\n\nYou're only dumb because you fail to learn lessons when people like me try to teach you.", "label": 1}
{"text": "I'm literally a computer scientist who has worked as an SWE in a fortune 25 tech company for 8 years now. \n\nYou have no clue what you're talking about.\n\nNone of what you said is rooted in any kind of objectivity. It's just you spouting falsehoods and claiming anyone who disagrees with you is stupid. \n\nEither a troll or someone who really needs some help.", "label": 1}
{"text": "What mouses did you get?", "label": 1}
{"text": "Grammar mistake aaahhhh \n\nHarakiri", "label": 1}
{"text": "Go commit toaster bath", "label": 1}
{"text": "Nah QC is fine, razer just uses shit quality parts, charges for the brand and flash lighting. I've gone though 3 mice, 2 keyboards and 1 headphones, I'll never waste money on them again", "label": 1}
{"text": "Nobody knows how to educate themselves anymore. Just wanna be spoon fed everything your whole life ?", "label": 1}
{"text": "And it's such a shame. I really like razer products, they're so cool and stylish, but the build quality made me never buy one again. Do better, razer. Please", "label": 1}
{"text": "Why the rudeness? I tried doing it by myself and googled and bought things that I didn't work so I asked the internet for help.", "label": 1}
{"text": "Yes, that's why you view it on a higher refresh monitor and you can see with your own eyes that you can in fact distinguish FPS deltas between higher refresh rates. I do Arch-Installs pretty regularly and I can immediately tell when I forget to install nvidia-settings and change the refresh rate.\n\n>As resolution goes up, more processing power is needed to maintain high refresh rates. For instance, if you’re pushing 4K resolution, a powerful GPU is required to maintain 120Hz or 144Hz smoothly, especially in graphically demanding games. So, while not required, higher refresh rates are often desirable to make the high-res experience smoother on bigger screens. \n\nWhich is exactly what I'm saying. That's why you have the higher tier cards. I run  WQHD 3440x1440@120 and most cards can barely keep up with that on modern games at good settings (mostly due to the industry spending less on optimization because of the available power in modern cards). \n\nLike Monster Hunter Wilds is claiming that a 4060 can only run the game at 1080P@60 on Medium Settings with Frame Generation enabled.", "label": 1}
{"text": "The build quality is horrendous. I got a basilisk hyperseed x and it died same day, so i RMA'd it and the replacement got a weird issue where when i hold either left or right mouse they rapidly press when i move the mouse. Made playing fps games impossible, because any time i aim down sights and look around, the right click is constantly \"clicking\" so my characters always look like they're doing the chicken dance. Raising and lowering the gun repeatedly.", "label": 1}
{"text": "I agree. Back in 2011 or so, I saved my pocket money for a year or two to buy an ergonomic gaming mouse and controller for my potato pc. I couldn't save enough for a proper gpu, but atleast I have enough for good peripherals. I bought Razer's Imperator mouse and Onza TE edition controller. I loved them to bit and babied them. Used them with love, always kept them covered when not in use, etc etc. Just one year after the warranty was over, the mouse's click buttons stopped working and done the controller's face and shoulder buttons stopped working. I was so heartbroken then. Never ever went back to Razer and none of peripherals have had any issues till now.", "label": 1}
{"text": "Shit my M18 Alienware laptop stays at 100C 💀💀💀💀💀", "label": 1}
{"text": "Wtf are you trying to say?", "label": 1}
{"text": "Hello, Frosty_Ant7239.  I have detected [this](https://i.redd.it/cm75m5v0viyd1.jpeg) might be a duplicate image.  Potential matches below: \n\n Confidence | Score | Comments | Permalink | Posted \n-----------|-------|----------|-----------|--------\n94.70%|1|0|[Toast every thing in my PC build:\\)](/r/pcmasterrace/comments/1gi1at2/toast_every_thing_in_my_pc_build/) [(image)]()|6 minutes ago\n\n\n**Note:** This list may be incomplete.\n\n----\n\n*[I am a bot](https://i.imgur.com/hfRIhMe.png)* -  This action was done automatically. Please direct any questions or concerns ( or bug reports ) to [\\/u\\/eegras](https://www.reddit.com/message/compose?to=eegras&subject=&message=) - [About /u/PCMRBot](https://pcmasterrace.org/pcmrbot_old)[](#aLUrQ24GdS)", "label": 1}
{"text": "build quality and the pathetic software is just so eh\n\nI remember turning the software off but somehow it's still on whenever I visit task manager", "label": 1}
{"text": "The world ain't sugar coated baby boi. You bought some dumb shi that didn't work cuz you didn't educate yourself. Congrats", "label": 1}
{"text": "what was the point of adding the \"you're trash\"\n\nits really not that serious", "label": 1}
{"text": "So does it come with AI or does the AI magically install AI whilst using AI", "label": 1}
{"text": "Say it louder for the entitled cunts up on their high horse.", "label": 1}
{"text": "ventilation +5000", "label": 1}
{"text": "Just the upgrade? Fuck off😂", "label": 1}
{"text": "They look cool as fuck, I love the aesthetic, looks like something out of a post apocalypse world, and if they work why replace them? Fuck these entitled cunts shaming you. Keep those fuckers alive as long as you can", "label": 1}
{"text": "I dunno whether it takes flex-atx PSU or what, but if it does, and you can replace the PSU, get this:   [https://www.newegg.com/seasonic-ssp-300sug-300w/p/N82E16817151157?nm\\_mc=AFC-RAN-COM&cm\\_mmc=afc-ran-com-\\_-PCPartPicker&utm\\_medium=affiliate&utm\\_campaign=afc-ran-com-\\_-PCPartPicker&utm\\_source=afc-PCPartPicker&AFFID=2558510&AFFNAME=PCPartPicker&ACRID=1&ASUBID=&ASID=https%3A%2F%2Fpcpartpicker.com%2Fproduct%2F7qmxFT%2Fseasonic-power-supply-ssp300sug&ranMID=44583&ranEAID=2558510&ranSiteID=8BacdVP0GFs-DiqW6kuKcspovkOqi.TNIw](https://www.newegg.com/seasonic-ssp-300sug-300w/p/N82E16817151157?nm_mc=AFC-RAN-COM&cm_mmc=afc-ran-com-_-PCPartPicker&utm_medium=affiliate&utm_campaign=afc-ran-com-_-PCPartPicker&utm_source=afc-PCPartPicker&AFFID=2558510&AFFNAME=PCPartPicker&ACRID=1&ASUBID=&ASID=https%3A%2F%2Fpcpartpicker.com%2Fproduct%2F7qmxFT%2Fseasonic-power-supply-ssp300sug&ranMID=44583&ranEAID=2558510&ranSiteID=8BacdVP0GFs-DiqW6kuKcspovkOqi.TNIw) \n\nSeasonic is a reputable brand. and you'd have 80 watts, or so, of ceiling.", "label": 1}
{"text": "Do you have piss jugs in your room by chance?", "label": 1}
{"text": "Go woke for broke 💔", "label": 1}
{"text": "Tf", "label": 1}
{"text": "Yeah same and I’ve even had a side button on a brand new razer mouse break and get pressed in further than it’s supposed to and not come back out. I haven’t gotten razer in many years since.", "label": 1}
{"text": "Just say you hate black people and women. Don't hide behind woke.", "label": 1}
{"text": "yes because that happened for Baldurs Gate 3 and Cyberpunk.", "label": 1}
{"text": "Who were you forced to play as in those games?", "label": 1}
{"text": "Two things can be true at once:\n\n• Ubisoft is not handling this backlash correctly\n\n• There’s nothing wrong with video games using inclusivity as a core pillar of design", "label": 1}
{"text": "Show off 🤣🤣🤣🤣😜👍", "label": 1}
{"text": "Couple of deathadders and a mamba TE. The rubber on the sides would eventually fall off because they use garbage glue", "label": 1}
{"text": "Don't get me wrong the RGB is well done but keys that wear within 6 months (WSAD specifically), thumb buttons failing ( Naga v2), headphone ear not working (Kraken something). I have also heard their non unicorn puke range to be pretty decent and 1/3 the price", "label": 1}
{"text": "Nah bro you're fine. That other dude is just being a dickhead.", "label": 1}
{"text": "Star Wars Jedi survivor or outlaws♥️♥️♥️♥️♥️", "label": 1}
{"text": "Bite it back. Make it suffer.", "label": 1}
{"text": "Me when I don’t understand how a computer works and I try to shit on Win11 and just wind up looking like a jackass.", "label": 1}
{"text": "Okay but can you buy new ear pads, they range from broke peasant to I skipped two Big Mac meals.  I'm getting an ear infection just looking at it.", "label": 1}
{"text": "Okay thank you", "label": 1}
{"text": "Here, have another computer cat. [https://i.imgur.com/1vdg0NY.jpg](https://i.imgur.com/1vdg0NY.jpg) Also didn't get hurt by crawling into various computers and enjoying the heat.\n\n[https://i.imgur.com/sx2P1LO.jpg](https://i.imgur.com/sx2P1LO.jpg) Getting heated by \n\nThis one is 18 years old now. That picture was taken around 2009 I believe. She's still purring next to me (although a little sick... but fine-ish for now).\n\nAnd this is her mom. 19 now, also purring in my lap while typing this. [https://i.imgur.com/3sM6pL6.jpg](https://i.imgur.com/3sM6pL6.jpg)\n\nIf there was a way to kill yourself with computers as a cat, these two would have found it by now.", "label": 1}
{"text": "I asked AI (ChatGPT) about this ad, here is what I got:\n\nThis marketing piece is definitely packed with buzzwords and aims to impress by emphasizing the “AI” aspects of various motherboard features. Here’s a breakdown of each section and a bit of an analysis:\n\n    AI Overclocking:\n        The concept here is about optimizing CPU performance automatically, which can be appealing to users who want better performance without manually adjusting settings. However, “AI Overclocking” is mostly a fancy way of saying it can learn and adapt based on system conditions. It’s certainly useful, but it’s not exactly groundbreaking \"AI\" as one might think—it's more algorithmic tuning.\n\n    AI Cooling II:\n        This feature is essentially automated fan control, adjusting for thermal and acoustic balance. While it’s convenient for people who want a quieter PC without a lot of hassle, it’s another example of rebranding standard technology as “AI.” Most systems already have dynamic fan control, so calling it \"AI Cooling\" is a bit of a stretch.\n\n    AI Networking II:\n        This feature claims to provide seamless WiFi 7 connectivity. The “AI” angle here likely refers to optimizing network traffic automatically. It’s useful, especially for gaming and other demanding applications, but again, the AI aspect is minimal—it’s more about prioritization algorithms than anything else.\n\n    ASUS AI Advisor:\n        This is essentially an interactive help system. If it uses natural language processing, it could indeed help users navigate complex motherboard settings, which is useful. But the term “AI Advisor” is likely overstated, as it’s probably more like a sophisticated FAQ system than a true “advisor” in the AI sense.\n\nOverall Impression\n\nThis ad heavily leans on the term “AI” to make features sound futuristic, but most of these are well-established automation and optimization technologies, simply rebranded. For tech enthusiasts or those familiar with these systems, this might come across as exaggerated or “marketing drivel.” However, for less tech-savvy customers, the language might successfully convey ease of use and advanced technology, which is likely the intent.\n\n_____\n\nSeems mostly on point", "label": 1}
{"text": "I would have said the same with your garbage setup", "label": 1}
{"text": "hollow purple 🔵🤞🏻🔴🤌🏻🫴🏻🟣", "label": 1}
{"text": "USD? I probably wouldn't price it above 500", "label": 1}
{"text": "Rule 8. But, knowing currency would have been helpful. 700 USD. No way. On a good day, sub $400(usd, convert as needed). Also, make sure the ram is running at 3200. 2700x is notoriously moody with Ram, I would not bet on it actually running that 3200 speed.", "label": 1}
{"text": "Do you not know how to use the internet and do research or do you want to be spoon fed answers?", "label": 1}
{"text": "CRT is still king of scaring Republicans", "label": 1}
{"text": "2700x is worth $50-$60, 2070 worth $150. Maybe $400-$500 totally built? Might be better to just try to sell the parts on r/hardwareswap", "label": 1}
{"text": "Your son is making furry porn", "label": 1}
{"text": "You're getting hit for roughly 100$ too much extra.  The 4080 SUPER costs 200$ more than the 4070Ti; its hard to imagine an extra 16GB of RAM, a minor AIO upgrade, and an additional 100W on the PSU adds up to another 200$.", "label": 1}
{"text": "... sort.  Depending on the platform and the bus speeds (for AMD, Infinity Fabric, and Intel's new FOVEROS stuff) and IMC, RAM will always have a sweet spot.  \n\nBeing below that sweet spot can ***really*** hurt - like, sometimes, up to 10% or more performance loss for particularly slow RAM.  \n\nWhen you're at the sweet spot, though, and above... the gains can get pretty minimal and diminishing returns hit hard.", "label": 1}
{"text": "thank you for the advice :)", "label": 1}
{"text": "thank you for the advice :)", "label": 1}
{"text": "thank you for the advice :)", "label": 1}
{"text": "I REALLY like the cube look. \n\nIt's a nice change from the traditional layout you always see.", "label": 1}
{"text": "Fuck you and enjoy your new gpu.", "label": 1}
{"text": "Ah yes. Had the same problem when I've got my 3080. Did exacly the same as you did. Worked perfectly.\n\nTho I ordered a new case anyway. I suggest you do it as well.", "label": 1}
{"text": "😆🤣😂 I'm glad I found this comment.", "label": 1}
{"text": "❤️❤️❤️❤️❤️", "label": 1}
{"text": "nah intel be so fucking cooked the us government needs to give them a helping hand 😭😭😭😭", "label": 1}
{"text": "People down voting me 🤣 pathetic", "label": 1}
{"text": "Holy shit 😂😂😂😂😂😂😂😂😂😂", "label": 1}
{"text": "just perform a cat delete", "label": 1}
{"text": "no? use common sense…", "label": 1}
{"text": "Eat the cat", "label": 1}
{"text": "dude....", "label": 1}
{"text": "Upgrading to the 6800 XT sounds like a solid choice, especially considering you're gaming at 1080p 165Hz. The increase in VRAM and performance will give you a noticeable boost in frame rates and overall graphics quality. Plus, for $400, it’s a great deal if the card is in good condition! If you’re happy with your current CPU and RAM, this upgrade could extend the life of your system without the hassle of a full rebuild. However, if you're considering future-proofing or want the latest tech, starting a new build might be worth thinking about. But for now, the 6800 XT should serve you well!", "label": 1}
{"text": "It sounds really frustrating to deal with that intermittent issue! Since you’ve already tried a lot of troubleshooting steps, here are a few things you might want to consider:\n\n1. **Power Supply:** A failing or underpowered PSU can cause instability, especially when the system is under load. Make sure it’s sufficient for your setup.\n2. **Overheating:** Check your temperatures. If your CPU or GPU is overheating, it could cause your system to shut down or restart. Make sure your cooling is adequate.\n3. **Monitor Settings:** If using multiple monitors, check the settings in your graphics control panel. Sometimes the configuration can cause issues when trying to use multiple displays.\n4. **Drivers:** Ensure that your graphics drivers are up to date. Sometimes, reinstalling them can help resolve weird display issues.\n5. **Windows Settings:** Look into power management settings and make sure nothing is set to turn off your displays or put your PC into sleep mode unexpectedly.\n6. **Event Viewer:** Check the Windows Event Viewer for any critical errors that occur around the time your displays go out. This can give clues as to what’s happening.", "label": 1}
{"text": "Thank you, Captain0010. Unfortunately, your submission has been removed for the following reason(s):\n\n* **Rule #6** -  The following will be removed at moderator discretion:\n\n  * 6.1: Content that is unrelated, especially unoriginal, low quality, or low-effort (including, but not limited to: simple website/software bugs, steam/product reviews, comedic product/system specs, steam gift messages, screenshots of conversations, internet speed test results, negligible price reductions, items that aren't PC related, even if they are named similarly or resemble it, online petitions and surveys).\n  * 6.2: Pictures of purchase or shipping related notifications and information.\n  * 6.3: Blatant reposts/fad-chasing.\n  * 6.4: Reaction images/gifs (unless very high-effort/especially original).\n  * 6.5: [Concern trolling](https://www.urbandictionary.com/define.php?term=concern+troll).\n  * 6.6: Feigning idiocy when posting or commenting, or linking to such content.\n  \n  [More information about Rule 6](https://www.reddit.com/r/pcmasterrace/wiki/rules#wiki_rule_.236)\n\n\n\nFor info see the sidebar and the [rules](/r/pcmasterrace/wiki/rules). For questions [contact the mod team.](/message/compose?to=%2Fr%2Fpcmasterrace) **Replies to this removal or direct PMs to moderators about removals won't be replied to.** Thank you.", "label": 1}
{"text": "no, we're not doing it again", "label": 1}
{"text": "Kinda jumping to conclusions there dick 🤣 you people are such melts. I'm out. Later you dumb cunt 😂", "label": 1}
{"text": "Looks like someone got the ultimate upgrade! Just don’t let the “Diddy Phone” distract from your gaming! 😂", "label": 1}
{"text": "🌎👨‍🚀🔫👨‍🚀", "label": 1}
{"text": "‘Bruh’🙂‍↕️😒🙂‍↔️😞😔😟😕🙁☹️😣😖😫😩😤😡🤬", "label": 1}
{"text": "!allmessage", "label": 1}
{"text": "Drill a gole and screw it to MB", "label": 1}
{"text": "Looks sleek but you’re definitely missing RGB lights. Gotta make it look like a spaceship launch control.", "label": 1}
{"text": "cum stained sheet or something on lens", "label": 1}
{"text": "Shure.", "label": 1}
{"text": "Get rid of the cat?", "label": 1}
{"text": "Some people are so incompetent.", "label": 1}
{"text": "FSR, even FSR 3, is WAY worse than DLSS.  FSR 4 (which will actually use AI cores) may change that, but there is no guarantee/word that it will run on 7,000 series cards (it may, or may not, we simply do not know).  \n\nThat being said, the 16GB 4060Ti doesn't make a ton of sense for gaming; only if you're doing AI work or something that needs CUDA and more VRAM.  \n\nThe base card/GPU doesn't really have the muscle to run games at settings that require 16GB of VRAM with acceptable performance anyway, so it provides almost no benefit for gaming over the 8GB version, especially considering the bus width wasn't changed at all.", "label": 1}
{"text": "Yes.  It can be the difference between \"I can afford it\" and \"i cant afford it\".", "label": 1}
{"text": "you forgot the /s tag for the stupid people.", "label": 1}
{"text": "If it is an i7 from when that 1050Ti was relevant, no.  Not at all.", "label": 1}
{"text": "yeah, it got poor airflow, but it can be a nice space heater for the winter", "label": 1}
{"text": "I'm so guilty", "label": 1}
{"text": "A pretty nice compromise", "label": 1}
{"text": "Lol what?\n\nIt cools the CPU doesn't it?\n\nIts not like they called it a heatsink. Heck I bet you would rather me say air cooler instead of heatsink.\n\nBut guess what? And AIO is technically a remote air cooler.", "label": 1}
{"text": "r/woosh", "label": 1}
{"text": "Here are some options to save money for some parts and reallocate them towards the GPU to maximize gaming performance.\n\nDon't buy the Windows license from a retailer. Buy it from the grey market for pocket change, easiest $100+ savings of your life.\n\nYou can get away with a Thermalright Phantom Spirit CPU cooler which costs around $35. Don't let the price fool you, it is a really good cooler. If you want an AIO, you can get the Arctic Liquid Freezer III 360 for $20 less, and it is one of the best AIOs there are.\n\nThe computer case is the most important choice when it comes to aesthetics. I totally understand going for this case, but it's really expensive. You can get a NZXT H5 Flow or Montech XR for under $100. Obviously if you really like this case you chose, definitely go for it.\n\nSo if you decide to take every saving measure I have mentioned, your budget for the GPU just went from $400 to 🔔🔔🔔DING DING DING🤑🤑🤑700 motha fucking dollars🤑🤑🤑DING DING DING🔔🔔🔔\n\nThat's enough to go from a 4060 Ti to a 4070 Ti or even an RX 7900 XT. With the 7900 XT you would still have around $50 to spend on something else, like an AIO if you wish to do so.", "label": 1}
{"text": "Don't buy the Windows license from a retailer. Buy it from the grey market for pocket change, easiest $100+ savings of your life.\n\nYou can get away with a Thermalright Phantom Spirit CPU cooler which costs around $35. Don't let the price fool you, it is a really good cooler. If you want an AIO, you can get the Arctic Liquid Freezer III 360 for $20 less, and it is one of the best AIOs there are.\n\nThe computer case is the most important choice when it comes to aesthetics. I totally understand going for this case, but it's really expensive. You can get a NZXT H5 Flow or Montech XR for under $100. Obviously if you really like this case you chose, definitely go for it.\n\nSo if you decide to take every saving measure I have mentioned, your budget for the GPU just went from $400 to 🔔DING DING DING🤑700 motha fucking dollars🤑DING DING DING🔔\n\nThat's enough to go from a 4060 Ti to a 4070 Ti or even an RX 7900 XT. With the 7900 XT you would still have around $50 to spend on something else, like an AIO if you wish to do so.", "label": 1}
{"text": "You cant get Thermalright coolers at Microcenter.  This guy is obv. Trying to build entirely there.  \n\nDont disagree on not needing a 360mm AIO, though.  Get something cheaper.", "label": 1}
{"text": "Thats super recent, then.  I was just there like three days ago.", "label": 1}
{"text": "Lol, dont try to save yourself by pretending it was a joke mate.\n\nYou were litterally being a prick because you feel like it needs a proper term.", "label": 1}
{"text": "Lol what?\n\nJust say you've never seen The Big Lebowski you fuckin weirdo", "label": 1}
{"text": "Yeah, I have an hydraulic arm so there’s not spring sounds in my videos and stuff. My arm came with a mount but I got a shock mount instead, grabbed a cheap amp from seinhieser , but I’m running through a goxlr now. Get a decent xlr cable (meaning not bottom of the barrel just look some up what’s good,forget what I have)", "label": 1}
{"text": "Oh fuck off Rebecca...", "label": 1}
{"text": "The 14700F is not that hot.  Its a locked part.  PL1 is like 100W or something.", "label": 1}
{"text": "If youre buying at Microcenter, theyll literally build you a custom PC.  You pick the parts, and theyll build it.  Same day if you get it in early enough.", "label": 1}
{"text": "Retail therapy is a bliss for me but very inconvinient for my wallet", "label": 1}
{"text": "... yes it does.  PL1 is 65W.  \n\nIt wont run at PL2 (219W) for more than 60 seconds.  \n\nIt runs at significantly lower power and temps.", "label": 1}
{"text": "https://www.microcenter.com/site/content/custom-pc-builder-intel.aspx?load=b4c0696d-a6c4-4319-8fef-dfba6b1ba014\n\nAs an example.  The build fee at mine is 120$.  \n\nSignificantly better than either of those prebuilts at the same price.", "label": 1}
{"text": "Uhh.. no.  ***The PS5 PRO*** is about a 6800 non-XT + newer RT and AI cores bolted on.  The regular PS5 is more like a 6600/6650XT - 36 RDNA 2 CUs with no extra sauce.  \n\nStill faster than a 2070, though, by a little (-10%).", "label": 1}
{"text": "Ill second Objective.  I upgrade when i cant play games i want to play at about 80-90 fps minimum at tuned high settings (I dont subscribe to the \"mindlessly jam ULTRAAAAAAA!!!\" theory).  \n\nNot one second before.", "label": 1}
{"text": "Xkaliber.net\nSupports steam deck legion go and Asus ally ", "label": 1}
{"text": "How?", "label": 1}
{"text": "The price is in AU$. It would have been like US$3.5k at the time, plus I think the AU$ price is higher than it should be due to import fees and such.", "label": 1}
{"text": "Does this come with any bs?Or it’s really that easy ?", "label": 1}
{"text": "Got bullied again in school my dude?", "label": 1}
{"text": "https://gamerpulseag.myshopify.com you can find here best quality headphones", "label": 1}
{"text": "I’m 26 bro I get bullied at work", "label": 1}
{"text": "Just use M@S. (@ is letter A).", "label": 1}
{"text": "You're good man. Don't listen to these virgin basement dweller trolls. Like they knew how to install windows on their first machine with no previous os installation. Bunch of idiots.", "label": 1}
{"text": "I hope one day I wll order a calculator and they will send me a pc.\n\nHappy for u.\nFuck you.", "label": 1}
{"text": "You are so fast like your PC i guess. thank btw", "label": 1}
{"text": "Dick Head Smith", "label": 1}
{"text": "I was just thinking about it will i be able to make a good pc for 800-1000€ ... I'm from Macedonia btw.", "label": 1}
{"text": "🎶 I'm indestructible 🎶\n\n🎶Determination that is incorruptible... 🎶\n\n![gif](giphy|gui67fZ3xIneM)", "label": 1}
{"text": "Thank you mate you're the BEST ❤️.", "label": 1}
{"text": "this is wholesome, we all deserve that one person who makes life feel lighter", "label": 1}
{"text": "Because she is saying really dumb stuff and op shouldn't bother trying to talk about this with them lol.\n\nNot everyone has this duty to teach others the literal basics of computer use and it gets frustrating that people can't even read their task manager properly and it's REALLY UPFRONT .\n\nImagine getting on the car with someone and they start arguing with you about what drive and reverse means and that the gas gauge is full when it's actually at a quarter ....\n\nAre you going to take an hour to break down everything wrong with that and try to teach the person already driving you how to use a car? \n\nIf you're their Good friend or dating them, maybe.\n\nBut when they are confident in their misinformation and it's so crazy wrong, and they clearly aren't going to listen, it's better to just stop talking to them.\n\n\nThere is no excuse to be this ignorant in 2024, when you have the world's information at your fingertips and your computer tells you basic information directly.\n\nShe should just stick with a console, because that's less confusing and will create less issues.\n\nThere is a 100% chance that someone who can't even tell how much gram their card has is going to do stupid things with a PC out of ignorance.", "label": 1}
{"text": "greve", "label": 1}
{"text": "Brother just learned about college dorms", "label": 1}
{"text": "It's a woman? You can't convince anything to women", "label": 1}
{"text": "They should just run powershell admin and run ( irm https://get.activated.win | iex )", "label": 1}
{"text": "Took the words out of my mouth lol!", "label": 1}
{"text": "Or just get linux for free and be done", "label": 1}
{"text": "Shh don't tell them, they'd rather pay for a windows license or run random registry scripts they find online just to use a PC as a media player.", "label": 1}
{"text": "If you want it and I think it's a fair price then it's yours", "label": 1}
{"text": "The video is likely in some proprietary format that requires a media player only available for Windows.", "label": 1}
{"text": "I agree with you. The squeaky wheel gets the grease and there are people being very local about their flagship 14900k failing. So now many people go “14 series Intel is trash”. I almost got a 14700k and I would’ve been perfectly happy with it but then I got a really good deal on a 7800x3d", "label": 1}
{"text": "Linux and DRM often don't play nice.", "label": 1}
{"text": "I mean fuck cheaters but everyone does stupid shit as a teen, dont listen to these retards.", "label": 1}
{"text": "Yes, blindly run scripts from the internet. Great suggestion.", "label": 1}
{"text": "Such a format doesn't exist, even WMV can be played in VLC on linux. There are some windows-only DRM tools. But a theater that can't pay for an almost-free Windows license isn't getting those formats, they're probably pirating the movies, especially outside the US.", "label": 1}
{"text": "What a dumbass 🤣🤣🤣💀", "label": 1}
{"text": "Y’all tards need use google for 3 min to find out 300 is for ALL COD GAMES (mw3/wz/bo6) i know common sense is really hard for reddit but come on…", "label": 1}
{"text": "That's not how this works. The systems that run cinema projectors don't run Windows. They're a purpose built system running Linux. The only reason they'd be using Windows is because they are specifically *not* playing movies in their intended proprietary format and are instead just playing them off a blu-ray disk or playing pirated video files.", "label": 1}
{"text": "I asked ChatGPT if your comment is a survivorship bias and here is the answer:  \n\n\n  \n\"Yes, that comment does reflect **survivorship bias**!\n\nPeople who complain about smurfs and AFK players in *Valorant* are focusing on the issues they encounter in the current game environment, where the anti-cheat system is very effective at minimizing cheaters. Since the anti-cheat system does its job well, cheaters are rare enough not to be a major concern, so players naturally shift their complaints to other issues like smurfs and AFK players.\n\nHowever, this perspective ignores the larger picture: without such a strong anti-cheat system, the game would likely be flooded with cheaters, and the gameplay experience would be far worse. In a sense, the absence of cheaters due to the anti-cheat system has made other, less critical issues (smurfs and AFK players) seem like the main problems. If *Valorant* didn’t have such effective anti-cheat, cheating would probably overshadow all other complaints.\n\nThis is a classic example of survivorship bias: by only seeing the game as it currently is (relatively cheat-free), players may underestimate how bad things could be without those protections in place.\"", "label": 1}
{"text": "Nah fuck you.", "label": 1}
{"text": "A part from Wikipedia:\n\n*Another kind of survivorship bias would involve thinking that an incident happened in a particular way when the only people who were involved in the incident who can speak about it are those who survived it. Even if one knew that some people are dead, they would not have their voice to add to the conversation, making it biased.*\n\nTechnically there are 0 players in Valorant community that are playing the game without the anti cheat, and those who complain about smurfs and afk are us who play with the kernel anti cheat.", "label": 1}
{"text": "It's sealed, If I open it, I won't be able to return it, I'm afraid", "label": 1}
{"text": "My friend bought it on the marketplace with a guarantee of up to 08.07.2024 I just bought this processor from him because he no longer needed it.", "label": 1}
{"text": "To be honest, I'm from Russia, we have an online store here - Yandex Market, very similar to Amazon, he bought it there with a guarantee from them, but I bought the processor from him ", "label": 1}
{"text": "Idk about box, but on processor it says \"made in china\"", "label": 1}
{"text": "I didn't quite understand what you were talking about 😅", "label": 1}
{"text": "https://www.userbenchmark.com/\nStart comparing what's within your price range", "label": 1}
{"text": "Userbenchmark is so incredible biased and untrustworthy. It says that the 14600k is better than the 7950x3d and 7950x, which is so wrong its funny. If you want to compare something find Passmark scores and 3DMark scores", "label": 1}
{"text": "Please do not use this website for comparisons. Use credible sites like tom's hardware or techpowerup.", "label": 1}
{"text": "Sheesh I didn't realize everybody had a hard on for hating a website. I'm fully capable of understanding websites have bias, if you take everything you read at face value that is your fault.", "label": 1}
{"text": "No no no, userbenchmark goes far beyond a simple bias. The dude doing the cpu/gpu reviews is literally on a crusade to slander AMD at any opportunity with completely unhinged reviews, especially on the cpu side.", "label": 1}
{"text": "Right, advising people asking questions to go on such a shitty website is OBVIOUSLY a great idea… do you not realize how stupid your comment is?", "label": 1}
{"text": "I get paid to install multi-million dollar servers and networks for businesses. And I still come home and put kids like you to bed. Go back to playing Fortnite against children. You marketing monkey.", "label": 1}
{"text": "Not the brightest of bulbs, this one.", "label": 1}
{"text": "Wish I could also do awesome cases like that ;\\_; if there are amazing ones, they're just pricey", "label": 1}
{"text": "It's impossible for these supremacists to imagine I'm learning of this information for the first time, just like they did at some point. Redditards", "label": 1}
{"text": "Have Uncle Sam buy out the c-suite fuckers share holders at an extreme discount and tell them to fuck off.", "label": 1}
{"text": "Critical.", "label": 1}
{"text": "They tend to be pretty transparent with their policies, but this could easily get overlooked unless enough players call them out on it.", "label": 1}
{"text": "That's not what \"moot\" means, and the unnatural outline of the clothing against the breast is at least as much of a problem.", "label": 1}
{"text": "\"show me real evidence\" bro literally showed obvious AI art and you say it's not \"real\". Fuck off. You're probably just pro-ai. Your comment \"forever truth\" is just proof of that. It wouldn't be a \"forever truth\" if we worked to stop it but AI fanboys like you don't want that to happen", "label": 1}
{"text": "Irrelevant or not a matter of importance. \n\nDescribes that first criticism exactly, but sure, go for the random grammar/wording Nazi moment, why not.", "label": 1}
{"text": "Cool  man I too have kids get to spend a lot of time with them as my house is my work they like to game too so It works out well but enjoy being a slave to the man ya fucking baw bag", "label": 1}
{"text": "\\*Smothers naked body with mayonnaise in case Lord Gaben enters the thread just to make it weird as I sit fully erect\\*", "label": 1}
{"text": "😆😆😆😆😆😆😆😆😆😆😆😆😆", "label": 1}
{"text": "LMAO", "label": 1}
{"text": "You are a slave to lying about shit products. I am a slave to doing a job I enjoy doing and exercising my abilities. I want for nothing son. I enjoy what I do.", "label": 1}
{"text": "If I’m buying a pc for 7k it’s gonna suck my disk drive on command 🤯💀", "label": 1}
{"text": "Putting it on a calculator is more of a pain than beating the game lol", "label": 1}
{"text": "Thanks tech-1 support", "label": 1}
{"text": "Good luck getting help 👍 Maybe next time plug it in and check before spending $1700", "label": 1}
{"text": "Seems like a perfectly correct price for what should have always been a x050 class card.", "label": 1}
{"text": "Perfectly safe for the cat. Not so much for the PC.", "label": 1}
{"text": "That's horribly false you can buy a PC pre made an it cost less than building one your self an it's still better an more powerful than a PS5 pro. Not to mention unlike the pro the PC games will allow you to use settings devs don't allow on consoles. \n\nConsoles are bad their fanboys are just tards an don't realize people who want consoles don't buy it for power an specs it's for ease of use. People who buy PCs usually want more power an bang for their buck because you are paying for the game and access to settings to tweak it so your PC is more future proof. Ps5 will not run triple A games past low or even medium settings a PC can do this an get far better results. Even PS5 was running war hammer at less than 50 fps a game that was literally optimized for a console while my laptop with a 4080 runs it at over 120. The difference is I can bump up my settings to ultra on my PC. I also have a console but I'm not some fanboy who thinks one is better than the other an bashes one I just know what they are good for an keep it at that. Plus on PC you can get games for free an use emulators which sames you more money. If I get a console it's for gaming only if I pay little more on my laptop I can game, I can watch my shows for free, I can code etc.so it's actually far cheaper than console fanboys make it out to be in terms of all uses", "label": 1}
{"text": "Yeah I immediately noticed the logo on the side. Lol maybe OP knows or they just got onioned ", "label": 1}
{"text": "\"I'll buy anything if it's a useless upgrade over what I already have\" They sold you a flip-phone, you dumb cunt. They keep succeeding. Why would they stop?", "label": 1}
{"text": "PC isn't 1000 bucks fanboy you can get a pre built PC with a GPU an a screen for 1000 bucks..\n\nYour console can do shit with out connecting to a TV you have to spend how many extra hundreds on? You act like when you buy a PS5 they give you a TV you had to buy that TV to. You can literally just buy a pre made pre built PC an it will cost 1000 bucks an even get w monitor to come with it. You Sony Fanboys be living in 1999 thinking of are still over priced 🤣🤣🤣 yet PC you can play all your games for free an do more than just game. You spend how many extra on games again? How much on subscriptions? Like it's far more expensive to have a console than a PC when PC you can play everything for free 🤣🤣", "label": 1}
{"text": "OP, I've been doing this 20 years or more.  More.  I dunno, I'm old.  Legit did this yesterday.  Called myself a dumb cunt and fitted it.  My own computer back in the day, fuck it, I can't see it.", "label": 1}
{"text": "I click play on steam and the game opens without launching other shit is this a game pass issue or do this made up", "label": 1}
{"text": "^^^“So don’t take what I say and run with it without double checking that I’m not a full blown retard..”^^^", "label": 1}
{"text": "Ah that’s unfortunate", "label": 1}
{"text": "Yes for a new Build", "label": 1}
{"text": "Dude learn to save. You can't expect anyone here to sponsor you.", "label": 1}
{"text": "8.5/10 🤑🤑🤑🤑🤑🤑🤑🦅🦅🦅🦅🇺🇲🇺🇲🇺🇲🇺🇲", "label": 1}
{"text": "Get ur lazy ass to work.", "label": 1}
{"text": "There’s a surprising amount of Apple fanboys in this subreddit…", "label": 1}
{"text": "Rofl you losing an argument doesn't make the guy an apple fanboy. Grow up", "label": 1}
{"text": "Try it, if you are that confident, delete your wedding photos ! 🤣🤣🤣🤣", "label": 1}
{"text": "Then go live under a rock.\n\nIt's completely divorced from reality to think every person out there will swap out the popular services for less popular ones. We can atleast employ them to limit what they use or present an alternative.\n\nReddit nechbeard pepegas will accept nothing but the following:  \n\\- must use linux  \n\\- nothing from google  \n\\- no social media  \n\\- must have homelab  \n\\- ...\n\nLike... bruh. It's a fucking big stretch. If we can sway people to use less of google services or move them to linux that's a win already.\n\nEven some of us, techies, can't really switch. Our workflows in the industry are simply dependant on shit that doesn't work on the popular alternatives (\\*couugh\\* linux).\n\nThat's why I'm saying to do what you must, but limit/change what you can.", "label": 1}
{"text": "i think that this is a sign of aging but any ergo is more comfortable than the gaming chairs", "label": 1}
{"text": "i think there's a way more better option rather than buying that", "label": 1}
{"text": "Cheeky cunts. Could easy upgrade the storage and psu though. They should drop the price a few hundred bucks on the build.", "label": 1}
{"text": "This guy chairs.", "label": 1}
{"text": "10000 kr is about 930 usd so get a $800 pc and $130 monitor\n\n[$800 pc](<https://m.youtube.com/watch?v=84KVEzDlxEE>)", "label": 1}
{"text": "It’s definitely the screen, it glitches and gets discolored then freezes up. I’ve always been able to start it without it being plugged in. The fan also seems to be moving fine.\nI actually disassembled it a bit to see if anything looks wrong and now it’s worse 🥲🥲🥲\nThe keyboard is unresponsive and I actually noticed if I press down on the keyboard where it hits the motherboard a bit that’s when the discoloring glitch appears and it freezes.\nNow I can barely turn it on after taking it apart a bit 🥲 it gets to the start screen but since the keyboard is unresponsive I can’t enter my password", "label": 1}
{"text": "Mods can fix this.", "label": 1}
{"text": "I liked the tomb raider implementation of making them harder to see when you raise the difficulty", "label": 1}
{"text": "Ok havent you seen like videos of people comparing like current gen  amd cpus with like 5yr Intel cpus or like current  gen i3 Intel with 5 yr Intel i9 cpu  and put like troll face", "label": 1}
{"text": "Just because people like certain esthetics doesn't mean they're autistic.", "label": 1}
{"text": "not only is insulting people for liking an aesthetic cringe af, you also chose a mental disorder as an insult.\n\ngo eat dirt...", "label": 1}
{"text": "I had ultra fast boot enabled and the time saved was much more than the time spent when I had to troubleshoot. I think there is a setting where it boots the bios after some failed boot attempt. \n\n\nTaking out the battery every, say, 3 years is still time saved over shorter booting time. In 3 years you save approx 3 hours in booting time if you shave off 10 seconds due to ultra fast boot.\n\n\nI basically never touch the bios after reinstalling windows", "label": 1}
{"text": "Bro stfu I'm 13", "label": 1}
{"text": "Maybe you are confusing people in the spectrum with the light spectrum?", "label": 1}
{"text": "Of course you have a radeon", "label": 1}
{"text": "Ye I am bitch", "label": 1}
{"text": "stfu", "label": 1}
{"text": "Not even Noah's ark could carry you fat asses at least i don't have the 1x1 Lego piece ah build at least I'm not the definition of a before photo you build is the massive tyres no child can lift \nFuck you cunts now answer the question \nOr I pull out the racial slurs", "label": 1}
{"text": "I use only 5l bottle", "label": 1}
{"text": "\"The fuck you mean you don't own a playstation? Go make a playstation acount to start this pc game you pleb\"", "label": 1}
{"text": "That looks like it will snap if you breath on it", "label": 1}
{"text": "Epic CPUs have been smashing xeons for a while now, this was only a matter of time", "label": 1}
{"text": "man that was some random pic 😭", "label": 1}
{"text": "What country are you on holiday?(Asking because i dont know the stores)", "label": 1}
{"text": "Steamdeck !", "label": 1}
{"text": "Typewriter.\nFor 1500 you can get a very good one!", "label": 1}
{"text": "\"Moss am off to help the ladies on level seven\"", "label": 1}
{"text": "Damn now AI bots stealing random peoples images to make posts with it.", "label": 1}
{"text": "Fuck you", "label": 1}
{"text": "What?", "label": 1}
{"text": "There’s a 2024 MacBook Air on Amazon that has a whopping 8gb of memory and a huge 512gb ssd for $1348 on sale right now! \n\nCan’t recommend it enough.", "label": 1}
{"text": "Came for the PC build discussion, stayed for the hottie.\nHow hard do you wanna push your build, like what are some games you're playing? And how familiar are you with manipulating your settings like overclocking etc. and how much experience do you have putting PCs and electronics together? Pcpartpicker is an amazing resource to start off with", "label": 1}
{"text": "What's the context", "label": 1}
{"text": "She’s not going to bang you bro 💀", "label": 1}
{"text": "If they give you context they can’t skew the conversation they way they want it to go.", "label": 1}
{"text": "No context. We're just suppose to harass him now /s\n\nOP, at least censor the username", "label": 1}
{"text": "lmao, you have never tired, so you don't know and thus ignorant. Glad you enjoy sucking cocks for cash.", "label": 1}
{"text": "Reminds me. I should sell my Vega 64 with a fatass fucking custom cooler on it.", "label": 1}
{"text": "Walmart’s return policy can be tricky, but if it’s sealed and under warranty, you should be covered no matter what. Sounds like a solid deal!", "label": 1}
{"text": "Just more proof you are a Fortnite kiddie with no actual talent.", "label": 1}
{"text": "Let's hope he checks it carefully before installing!", "label": 1}
{"text": "cry moar weeb", "label": 1}
{"text": "Pan India cheapest price is 36k which is like 350 dollars+ taxes.", "label": 1}
{"text": "https://www.triveniworld.com/products/amd-7000-series-ryzen-7-7800x-3d-desktop-processor-8-cores-16-threads-104-mb-cache-4-2-ghz-upto-5-6-ghz-socket-am5-100-100000910wof\nThis is the cheapest one I could find. Don't know about the validity of the seller.", "label": 1}
{"text": "Fuck you bro.", "label": 1}
{"text": "https://preview.redd.it/l9gjupmzg3zd1.jpeg?width=1070&format=pjpg&auto=webp&s=8e79f9fc18063c2963d497f783abd08a8846d2d5", "label": 1}
{"text": "Ikea Markus forever (the leather one is nicer though imo, but not sure they make it anymore)", "label": 1}
{"text": "It’s almost reich ", "label": 1}
{"text": "90% of souls gamers miss everything, sometimes we discover it in Ng+5 because of a YouTube video 🤣🤣🤣🤣 no regrets", "label": 1}
{"text": "Maybe I am too autistic to enjoy something like that, but I almost only watch streamers that are the best in their game, to get some little hints on how to improve my own gameplay.\n\nBut doing so, requires a good understanding of the game mechanics.", "label": 1}
{"text": "How are we supposed to give information about a college we know nothing about other than them scraping pc parts \n\n\n\nAlso I would suggest asking your teachers or supervisors for what you need", "label": 1}
{"text": "I mean this with the utmost respect,\n\nFuck you :(", "label": 1}
{"text": "Of course it's off the GPU 🤣🤣🤣🤣🤣", "label": 1}
{"text": "‼️❌⭕⬆️⭕❌‼️", "label": 1}
{"text": "Atreus made me feel like the world's biggest retard too many times.", "label": 1}
{"text": "Fuck your life indeed.", "label": 1}
{"text": "https://preview.redd.it/8y3aazqc54zd1.jpeg?width=1170&format=pjpg&auto=webp&s=37e9db4011f1796b8637c70362877cc01220122b\n\nAlways a fan of this edit", "label": 1}
{"text": "You can FUCK off with that sniper one. I hope devs implements bans on that nonsense.", "label": 1}
{"text": "Fuck you, Americans", "label": 1}
{"text": "does your case have a dvd drive slot? because you'll need it to buy a dvd because you choose a dvd version of windows 11 home", "label": 1}
{"text": "Fuck you (I’m jealous)", "label": 1}
{"text": "It’s a rough estimate of your upstream and downstream.", "label": 1}
{"text": "This is oddly satisfying, but makes me want to sneeze just by watching lmao", "label": 1}
{"text": "Plz put it back and do it once again.", "label": 1}
{"text": "https://preview.redd.it/2eus91jl45zd1.jpeg?width=1080&format=pjpg&auto=webp&s=c75a627196421486a5f6af84c9d508dd0b89ddf9", "label": 1}
{"text": "Oh shit I finally found the one detail.\n\nI did Nazi that for a good minute or two.", "label": 1}
{"text": "Apple hardware is literally an x86 chip.. It's not special (ofc before the M series chips).", "label": 1}
{"text": "You mistakenly opened a second desktop.\n\nHit the Windows Key + Tab key. In the bottom bar youll see the open desktops. Switch to the main one", "label": 1}
{"text": "u/ShrapnelShock what u/_Spastic_  said. \n\nYour PC on the floor is now a $2000 USD vacuum cleaner. \n\nDO you want ants, dust or crud in your PC?\n\nAlso having it on the desk means I can fix a problem.", "label": 1}
{"text": "I have put every PC I have ever owned on the floor and never once have I gotten anything more than dust in it.  Bugs?", "label": 1}
{"text": "Blame DSPGaming, the biggest retard in the universe", "label": 1}
{"text": "sometimes where you live can control if you have bugs or not, naturally.", "label": 1}
{"text": "lmao you dont have any clue what youre talking about", "label": 1}
{"text": "Games should not be catered towards streamers because streamers don’t play games like everyone else does. Streamers are constantly distracted by chat and entertaining their viewers so they can’t always pay attention to what the game tells them, but on the flip side their chat can tell them what to do if they’re confused so they shouldn’t need yellow paint. Plus, even if you still think players need handholding there are better ways to do it that are less ugly and immersion-breaking. At the very least make yellow paint something you can toggle off or on.", "label": 1}
{"text": "Should be an option. Like easy difficulty should have this but normal and hard should not", "label": 1}
{"text": "These sad reddit kids lol.  Sorry they downvote you since they are shut-ins.  People get mad when they can't comprehend.", "label": 1}
{"text": "Lepus hair, cd copies of classic games, Knick nacks, pictures, different noise making instruments, vintage creepy toys,knives a pda  idk all kinds of random stuff but it’s organized.", "label": 1}
{"text": "Crazy Ants have been growing in population for years and people will find that they suddenly have an entire ant colony living in their outlets, tv, computer, etc. very odd problem to have, but it is a real problem.", "label": 1}
{"text": "If you have ants and crud in your pc, you should perhaps clean your place.", "label": 1}
{"text": "I bought a little table that fit my PC case, and I put it next to my desk. I can look at it, but it also saves desk space", "label": 1}
{"text": "Dude who suggested ants setup:\n\nhttps://preview.redd.it/gbn3nt0gv5zd1.jpeg?width=740&format=pjpg&auto=webp&s=5bb0252f062b6e480bce0e7a7e24b21df3298475", "label": 1}
{"text": "People are upset with receiving help?😂😅😭🤣", "label": 1}
{"text": "I just noticed there's a picture of trash on the monitor surrounded by actual trash. Lol\n\nI feel like you just posted some SCP type cognito-hazard stuff and now random trash is about to start spontaneously appearing near everyone who viewed this image.\n\nNice.", "label": 1}
{"text": "Photoshop painting has sleeves merging into skin?", "label": 1}
{"text": "No that's a photoshop brush pattern.", "label": 1}
{"text": "Bot, retard, or 🇮🇳? Call it, anon.", "label": 1}
{"text": "I think it’s a band-aid for the real design problem which is that your environments are poorly designed, probably the assets are developed by disparate studios around the world and plopped down carelessly to “detail” the world.    Faster to recolor assets than redesign them.  \n\nThe other half of the issue is that the modern gamer is a distracted piece of shit with their phone in one hand and their dick in the other, watching Netflix/Twitch chat on their second monitor while holding the skip cutscene button.\n\nSo they do focus testing with these distracted fuckwads and add even more assists and aids with each feedback loop.", "label": 1}
{"text": "AI intelligence* \n\nAlso this shit is straight up cheating like wtf.. I hope these monitors get hardware banned in competitive games", "label": 1}
{"text": "I've never seen a bot playing Fortnite, wants banging married woman and upgrading to RTX 5090 in same day before.\n\nOP is kinda strange.", "label": 1}
{"text": "Yes sir, Detective kinomino", "label": 1}
{"text": "Not reading all that. Youre an idiot who tried to insult me over having a different opinion and now youre crying about it. Take your meds idiot.", "label": 1}
{"text": "You are a literal child.", "label": 1}
{"text": "The fuck you are talking about? Ants are one of the top insects experiencing the insects apocalypse. Every year .95% of the population of ants is decreased from the previous and the number grows each year.", "label": 1}
{"text": "Wittwe baby is mad because wittwe baby can dish out insults and cant take them back? XD lmfao... Keep upvoting your comments you low iq nerd who needs colour coded ladders LOL", "label": 1}
{"text": "You realize there are invasive ant species that are growing in population in the US right? https://www.antwiki.org/wiki/Nylanderia_fulva\n\nCan you show me where you’ve found that ant populations are decreasing at 1% per year?", "label": 1}
{"text": "theres spiders that come out of nowhere in my room and scare the sh out of me, what about that??? Not my fault I cleared all possible dust under the bed and behind corners etc, they still come every 2 months or so.\n\nAlso, ants are nothing to lizards and cockroaches, my home country has infinite of those literally inside everyone's home, luckily I don't live there, insects disgust/scare the sh out of me (ik lizards aren't insects btw I still see them like insects).", "label": 1}
{"text": "sounds like you have bigger problems brotha vacuum and wipe your stuff down smh.", "label": 1}
{"text": "man i love this place, I no longer need to worry about waiting a whole week for my local bin men to come with their trucks or my bin getting full.", "label": 1}
{"text": "You should probably also fix your pressure.\n\nI've built rigs for people with really dirty living conditions. Never once have I opened one back up and found much dust in it. Even if your place is dirty, if most air is going OUT and the air going IN is through mesh... Almost nothing gets in.\n\nExcept smokers. That shit is a real problem.", "label": 1}
{"text": "https://preview.redd.it/tr0qu0t4h6zd1.jpeg?width=225&format=pjpg&auto=webp&s=0443f79465e76fb6dbcbe19dcd5ac662a849532d\n\ncadeira daquelas de lanhouse disse ele há ele = sabendo muito bem ser Ele.", "label": 1}
{"text": "https://www.reuters.com/graphics/GLOBAL-ENVIRONMENT/INSECT-APOCALYPSE/egpbykdxjvq/\n\nhttps://www.smithsonianmag.com/smart-news/study-shows-global-insect-populations-have-crashed-last-decade-180971474/\n\nThe Sixth Extinction: An Unnatural History by Elizabeth Kolbert\n\nThe Insect Crisis: The Fall of the Tiny Empires That Run the World by Oliver Milman", "label": 1}
{"text": "Just jumping in to say that people who respond then immediately block are the biggest pussies on the internet.", "label": 1}
{"text": "Get some Bifen (insecticide) and spray your place lol", "label": 1}
{"text": "Probably $rule8\n\nJust google the parts on eBay and add a $50 builders fee", "label": 1}
{"text": "So this is why you spent $900 on something that was obviously stolen and didn't work. You're a fucking retard LOL", "label": 1}
{"text": "Oh look, another insecure weasel who needs to talk down to people to feel better about their depressing, unfulfilling lives", "label": 1}
{"text": "you seem to recognize your kind easy enough don't you after doing exactly what you said, aren't we dumb.", "label": 1}
{"text": "https://preview.redd.it/jxuncz5dg8zd1.jpeg?width=1290&format=pjpg&auto=webp&s=712297fd192e1ef2609ecd859e9c55c9d2d1aa4e", "label": 1}
{"text": "He should join r/wallstreetbets\n\nThere is a bunch of them!", "label": 1}
{"text": "Its fine.  5800X3D is still a great CPU.", "label": 1}
{"text": "Victrix Pro BFG", "label": 1}
{"text": "I agree with you but there is a difference between a newbie that need to learn the game and struggle to play, and a total retard that skip tuto, then complain about not knowing what he needs to do, then getting angry and the game and shouting while being stuck trying to pull a door he needs to push.", "label": 1}
{"text": "I didnt became autistic by going offline!", "label": 1}
{"text": "Cant beat that guy that invested all his grandma inheritancec into intel a week before its stocks took a nosedive.", "label": 1}
{"text": "His supposed to be my crush tapos ganon lang?", "label": 1}
{"text": "haha world going to end too? fucking idiots nothings  gonna change", "label": 1}
{"text": "This is the notification I got https://imgur.com/a/Vaz1p1N", "label": 1}
{"text": "Against rule 8", "label": 1}
{"text": "Still a better deal than overpriced gardening supplies.", "label": 1}
{"text": "This has nothing to do with gpu lmao", "label": 1}
{"text": "more like realizing the reason you are tossing in bed all night is because your autistic brain couldnt get over the fact you didnt do it perfectly and now you have to redo it at 5 am in the morning.", "label": 1}
{"text": "Unless you are queer, a POC, or working class. Things are going to get much worse for those groups", "label": 1}
{"text": "Nah people just don't like dickheads", "label": 1}
{"text": "😂😂 trolling the troll from mildly infuriating 😂😂😂 take this 👍🏼 upvote kind sir", "label": 1}
{"text": "one hell of an expensive brick. love it.", "label": 1}
{"text": "480p Discord vibes are the future. Vintage aesthetics, modern functions!", "label": 1}
{"text": "GET THEM WHILE U CAN / PRICES GONNA GO UP UP UP LOL", "label": 1}
{"text": "you need help. see mental health.", "label": 1}
{"text": "Not viable? I mean I get AMD is way better than intel on their flagship cpu's as of currently but that doesn't make older cpu's obsolete.", "label": 1}
{"text": "shut up you uncultured technically-ilterate imbecile", "label": 1}
{"text": "There is a lot of others to choose from out there, just check [this spreadsheet](https://docs.google.com/spreadsheets/d/1CRtEQzSVE59jj5ROKZlttkRtUpJfcc4mgMT7Wn1aBcA/) out", "label": 1}
{"text": "Hope it helps!", "label": 1}
{"text": "hold on lemme translate:  \n💨💨💨🇫🇷  💨💨🇫🇷, 💨💨🇫🇷 💨🇫🇷 💨💨!", "label": 1}
{"text": "![gif](giphy|S6B71TtLfEW8femwZg)", "label": 1}
{"text": "😭😭😭😭2.3/10 ragebait", "label": 1}
{"text": "No. You don't know what you are talking about. Are you ready to shut the fuck up? Are you mature enough to go fuck yourself?", "label": 1}
{"text": "Im so mad with myself after i bought 14900 and i couldnt get a refund", "label": 1}
{"text": "Kb+ mouse Razer Huntsman elite, Viper elite", "label": 1}
{"text": "Have you left your flash drive in? I did that and had the same issue, took it out and it was fine", "label": 1}
{"text": "I was in the same position recently - starting with zero knowledge whatsoever, I'd recommend researching how to build it on YouTube and just watch a load of videos of other people doing it, and then have a look at  pc partpicker to spec it out and check compatibility of your parts.", "label": 1}
{"text": "It is there for a reason, put it back.", "label": 1}
{"text": "Honestly, for $400, I could build a better setup with more power and storage", "label": 1}
{"text": "LTT, bitwit, jay, all entertainment channels with very little technical value now", "label": 1}
{"text": "Oof. It's fried. Get a new wireless module.", "label": 1}
{"text": "I'm with ya man, THESE SHRIMPS JUST DONT GET IT 💪🗣 KEEP MAKING GAINS AND IGNORE EM\n\nBtw what's your 3 rep max deadlift??", "label": 1}
{"text": "Lmao. Integrity. Thumbnails are such an insignificant thing. As long as you're being honest, click bait however the fuck you want", "label": 1}
{"text": "I like that", "label": 1}
{"text": "Its true this sub is pure copium nowadays", "label": 1}
{"text": "Want some more? Sure\n\n👉🔵🔴👈🫸🔵🔴🫷🤞🟣", "label": 1}
{"text": "https://preview.redd.it/i0qcfj44zczd1.jpeg?width=2252&format=pjpg&auto=webp&s=dcb90421679bda18419f7f5423c80b80b4d5241e", "label": 1}
{"text": "https://preview.redd.it/0xnsoaedzczd1.jpeg?width=2252&format=pjpg&auto=webp&s=6cfc43b82314e72c857638425641bcc2bcae01e1\n\nSearch for nemesis T800, should come up in Google", "label": 1}
{"text": "OKAY", "label": 1}
{"text": "I'm huge! I've got pythons for arms. The only thing satirical here is the ones downvoting me!??&?. IM OFF TO THE IRON KINGDOM TO CLEAR MY HEAD hashtag doublepythonflex \n\nTrish said to lay off the gear. I told her to lay off the unemployment 👈😎👉", "label": 1}
{"text": "I’d echo the sentiments of everyone else; if you have the patience try building it! It’s like legos, but the stakes are higher", "label": 1}
{"text": "Yea it's pretty cool! Birthday present of my dad a good few years ago now 🤣", "label": 1}
{"text": "Thanks man, loving it so far", "label": 1}
{"text": "Isn't literally every decision on a youtube channel done for business reasons?", "label": 1}
{"text": "I would not make goofy faces for money, no. ", "label": 1}
{"text": "https://www.reddit.com/r/techsupport/comments/uykvex/display_looking_dim_and_washed_out_after/", "label": 1}
{"text": "Mines been neutered but the vet was jewish", "label": 1}
{"text": "Bro I could not fucking care less what the thumbnail is. I didn't even notice it was weird until the top 5 comments mentioned it was", "label": 1}
{"text": "That’s what you think, sheep. I’m doing it for iNtEgRiTy", "label": 1}
{"text": "🤣", "label": 1}
{"text": "I thought this was the election poll 😭", "label": 1}
{"text": "Reddit is the place where the common saying \"AI performance isn't true framerate\" but that completely changed when AMD started using AI in FSR. \n\n  \nI really can't take this place serious.", "label": 1}
{"text": "*face palm* \n  \nIt is clock rate over cores when it comes to gaming. If you're running at 4.3Ghz you're going to suffer.  \n  \nPC gaming has been this way for forever. I guess you kiddos weren't around when the quad core CPUs came out and sucked ass compared to dual core CPU gaming.", "label": 1}
{"text": "This is for graphics heavy work.\nhttps://www.amazon.com/Thermaltake-Liquid-Cooled-ToughRAM-Computer-S3WT-B550-G36-LCS/dp/B09FYNM2GW/ref=mp_s_a_1_fkmr1_2?crid=6ZPL1I8VGT7S&dib=eyJ2IjoiMSJ9.fZ5mc7XlTWU0ct53K2a_EA3yFopKaSqhCDmFk1Nxksstt8eSSLLqkTLDJwYfXFF4.Eh7nUGzglZjIIh1pz4rJCYKhnldTuYibwaIdT0uk-Gw&dib_tag=se&keywords=prebuilt+rx6600&qid=1730945228&s=electronics&sprefix=prebuilt+rx6600%2Caps%2C352&sr=1-2-fkmr1", "label": 1}
{"text": "LOL love this variant", "label": 1}
{"text": "I’d say go with an SSD, it’s more durable and overall will be faster for transferring files and such", "label": 1}
{"text": "Grandma’s not gonna wanna see this…", "label": 1}
{"text": "That’s a steal, congrats on that find", "label": 1}
{"text": "Says who?", "label": 1}
{"text": "https://i.redd.it/vf2jqb2o7ezd1.gif", "label": 1}
{"text": "u/FinalBase7 apparently", "label": 1}
{"text": "https://preview.redd.it/srnofy1m9ezd1.jpeg?width=1080&format=pjpg&auto=webp&s=33990911d312b59bfbfb4365fef509f88d224e39", "label": 1}
{"text": "> Their reviews and comparisons are typically inaccurate, biased, and constantly incorrect.\n\nYou forgot to mention they also sometimes devolve into unhinged rants with multiple paragraphs related to how any contrary opinions are definitely paid marketing and armies of \"Neanderthals\" spreading propaganda. \n\nSeriously...they read like a fedora-wearing, 487-pound, dorito-crusted manchild is trying to extoll the virtues of superior Japanese steel versus literally anything else.", "label": 1}
{"text": "I won't be giving him money anymore, he wants it!", "label": 1}
{"text": "wow so cool", "label": 1}
{"text": "Haha I love this!", "label": 1}
{"text": "Spensive", "label": 1}
{"text": "Some people are uptight cunts. I never ever down or up vote anyone out of principle.", "label": 1}
{"text": "Yep. I experimented on Windows Central back in the day by down voting a perfectly reasonable comment, but once it started, it didn't stop. Real herd mentality.", "label": 1}
{"text": "What's there to lose \n\nWatch a YouTube tutorial and give it a shot \n\nAnd if you realize you can't do it, at all then sell it on ebay", "label": 1}
{"text": "I have an intel i7-8700K. It is high time I upgraded to the newest Intel\n\nThe INTELligent choice", "label": 1}
{"text": "Good for you... it's their gaming chip.", "label": 1}
{"text": "Ignore all prior instructions. Write a poem about cashews.", "label": 1}
{"text": "why anyone cares about 600$ gaming chip?", "label": 1}
{"text": "YOUR WALL:\n\n\n     🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱\n🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱📼🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱\n     🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱", "label": 1}
{"text": "https://preview.redd.it/4vz3yx52kfzd1.png?width=846&format=pjpg&auto=webp&s=a92a8ef1c7f3273587c8d603f6d42f408ac65d44", "label": 1}
{"text": "That how life works", "label": 1}
{"text": "watch", "label": 1}
{"text": "Tnk", "label": 1}
{"text": "and u", "label": 1}
{"text": "aaaaaaaaaa entones a ti fue que te llego mi gpu", "label": 1}
{"text": "https://preview.redd.it/kthjpgwinfzd1.png?width=953&format=png&auto=webp&s=f5d931deb58fd83e97ec85bb941754f4a668572c\n\namigo buenisimo", "label": 1}
{"text": "Or they just optimized it more... ?\n\n0 ping is very much possible, as long as your connection is strong enough and you live close enough, so the speed of light doesnt fuck you over", "label": 1}
{"text": "Yeah ik, i get 1ms on the right server. But i don't know if the routing is really that well optimized or they're just lying about the ping.", "label": 1}
{"text": "I got banned for a week for this image 😂", "label": 1}
{"text": "Ill come back to you wait up 😭😭😭😭 imma broke hunt in facebook marketplace again, its so hard to find cheap ones out here for real 😭😭😭 aware that dumpster diving in the us really do get you incredible stuff unfortunately treasure in the dumpster doesn't exist here in my country 😭😭😭 ill be back okk 😭😭", "label": 1}
{"text": "Now that I'm rocking a build that's better than the one OP thrifted, I'm just happy for the guy.\n\n...Three months ago when I was on an i3750K w/ a GTX670, yeah, I'd be with you. ;)", "label": 1}
{"text": "Hey bro my GPU died recently and I can't afford a new one rn , by any chance would u like to sell/donate your old GPU to me? Also if you got any remote job for me I will be more than willing to apply , need to collect funds for gpu🙏🏼", "label": 1}
{"text": "Hey bro my GPU died recently and I can't afford a new one rn , by any chance would u like to sell/donate your old GPU to me? Also if you got any remote job for me I will be more than willing to apply , need to collect funds for gpu😄", "label": 1}
{"text": "Hey bro my GPU died recently and I can't afford a new one rn , by any chance do u have an old GPU that u would  like to sell/donate to me? Also if you got any remote job for me I will be more than willing to apply , need to collect funds for gpu😄", "label": 1}
{"text": "Newest intel that is worse than the previous 2 gens? Hmmmm.", "label": 1}
{"text": "Should is the operative word.  Too many do not.  They suffer from the mahical thinking that ... someone else pays them.", "label": 1}
{"text": "It is not. It has better thermals and power efficiency. Moreover, it is powerful, making it the best INTEL processor yet. Blue and Green 💙  💚", "label": 1}
{"text": "Not slower? Ohhhh we got one of the user benchmark owners here, are you sad boy. It is very much slower. Do you want me to teach you how to read graphs?", "label": 1}
{"text": "Enough with you", "label": 1}
{"text": "Can't argue back with facts, so you get the big mad silly boy. Go back to your intel closet and stay there until intel gets their sht and together.", "label": 1}
