{"text": "This is called capital gains harvesting or tax gains harvesting — you can find info online about reasons to do it vs not do it. Mainly ACA once you come back from Oceania ", "label": 1}
{"text": "For that amount why are you asking random people on the internet instead of a pro like a fiduciary or a CPA?", "label": 1}
{"text": ">You must be exhausting to be around\n\nYou're no cup of tea yourself. \n\n>Half of the things you named will be paid to the dealer anyway and half of the things you named are not dependent on a single car sale.\n\nYou understand that taking a car back on the lot incurs *carrying costs* for the dealership right? So those things \"they've already been paid for\" are things they're not going to be paid again for. They now have to readvertise the car. They now have to recondition the car. They now have to pay the price of keeping a used car on their lot. \n\n>They don’t have to return the car you traded in, they do have to give you the net trade-in value. That is not how any contract is going to be worded.\n\nHonestly I love how you keep making assumptions about OPs contract with zero knowledge about it. You've made assumptions about their new interest rate, their mileage charge, so why wouldn't you make an assumption about whether they can demand the car back right? \n\n>I wish you luck, but I am done here. \nGood luck with what? \n\n>Your advice was objectively incorrect for most people in the OP’s situation. Your attempt to spin that because you would rather argue ridiculous pedantic crap on the internet than admit you didn’t know your north hole from your south hole when you gave the advice is tiresome.\n\nYou are incredibly rude, and I agree we should be done here.", "label": 1}
{"text": "This is horrendous advice", "label": 1}
{"text": "Is English not your first language? That's not how a full time job is considered.", "label": 1}
{"text": "It sounds like your new JPMC card’s limit hasn’t been reported to Experian yet, which is why your utilization is showing at 100%. This can happen because sometimes new accounts, especially new credit limits, can take a billing cycle or two to appear on your credit report.\n\nHere’s what likely happened:\n\n1. **Timing of Reporting:** Credit card companies usually report balances and limits to the credit bureaus at the end of each billing cycle. Since the JPMC card is new, its information may just not have been updated in Experian’s records yet.\n2. **Credit Utilization Calculation:** Right now, since only the Discover card limit is being considered, the $1800 on the JPMC card is making your utilization look higher than it actually is.\n3. **Expected Update:** Once JPMC reports to Experian (often within 30 days of your first billing cycle), your total available credit should reflect that additional $20k limit. This will reduce your overall credit utilization, which could help your score bounce back.\n\nFor now, it’s likely just a matter of waiting for the credit report to catch up with your new account information. If you still don’t see the update by the next billing cycle, it might be worth checking in with JPMC to ensure they’re reporting to Experian.", "label": 1}
{"text": "Call them.  Get something in writing no matter what they reply.  If they claim it's closed/not owed, keep making payments to a savings account for when it reappears within a few months.", "label": 1}
{"text": "Ally bank or financial resources", "label": 1}
{"text": "Man I have so much to say on this. I had no idea what depression or anxiety was like growing up . I had an amazing childhood and high school experience and was super extroverted and had so many friends. Didn’t even know what it was like to be in my own head and overthink. All that flipped and did a complete 180 when I turned 19/20 in college. I was a heavy weed smoker throughout high school and one day my arm started to go numb and I would bug out every time I smoked. I became super self aware and my mentality changed. I was really withdrawn, always felt awkward and got really depressed. \n\nYou can dm me and we can talk more but I struggled for so many years mentally, you can turn it around I promise.\n\nThe keys are this: \n\n1. Cut out weed/ nicotine/insert drug here. I would defend my weed usage and claim it helps my stress and anxiety. Cap. That’s an illusion and until your without it for an extended period of time you won’t realize it . Also terrible for REM sleep and disrupts recovery. \n\n2. Fix your diet. Cut out processed foods and eat Whole Foods. Research a general meal plan of healthy things to eat and stick to it. \n\n3. Fix your sleep schedule. I would stay up till 4-5 am playing video games or watching YouTube and I could never fix my schedule for more than a week. Pull an all nighter and go outside in the morning at the time you want to wake up and get sunlight in your eyes for five minutes. Do not sleep until night time and get up  at the same time everyday. You will reset your circadian rhythm and this does wonders hormonally.\n\n4. You have to exercise. Get into lifting, I don’t care what anyone says. I mean really learn about it and pick a plan. Start slow. I know there are many ways to exercise that are great but lifting weights sprinkled in with some light cardio throughout the week is the absolute best thing you can do and is the top thing I credit for changing my life. Before you start lifting weights, I recommend starting with walking and pick a mobility routine to really open and realign your body. Do this for 2-3 weeks then start going to the gym and do some mobility every once in a while to stay loose. \n\n5. Spend time in nature. You can go for hike as your cardio or simply walk in the woods, just get out in nature. Ideally 1-2 times a week, but I know it’s tough. I hardly do it anymore, life gets in the way. But at the beginning when I was really going through it, this helped me so much. \n\n6. Meditate. In through the nose out through the mouth slowly. Not guided, just you and your breath. Outside is my favorite but find what’s best for you. Thoughts will enter your mind just let them float by and if you get distracted bring yourself back to your breath. 15-30 min a day. Another thing that really helped me at my lowest point and something I need to get back to doing.\n\n7. Don’t watch porn. Look up yourbrainonporn. Easy dopamine shortcut. Too easy.\n\n8. This is going to be controversial. Cut out video games if you cant limit it to a couple of hours a week .I love gaming so much , played since the ps1 days. It was my escape and that was the problem. It still hurts having given it up lol and I can’t say I won’t ever go back but I couldn’t control how much I played. I avoided so many problems in life and just found comfort in video games. \n\n9. I’m gonna combine a few extra points here, find a hobby you love, cut out toxic people from your life, when your faced with a challenge and want to turn away, whatever it may be, FORCE yourself to push through it. It builds character and good things are on the other side of adversity.  Face your problems head on , no more running away or making excuses.\n\n10. Love yourself , you can do anything you put your mind to.\n\nSorry for the length but I hope this helps anyone reading this who is struggling. I pulled myself out of a pit and you can too.", "label": 1}
{"text": "r/personalfinance is probably a better source than any influencer", "label": 1}
{"text": "This is more appropriate for the weekly help thread than an actual post.", "label": 1}
{"text": "I'm an advisor and Dave Ramsey coach.  I'll give you some time gratis.  You can contact me thru www.kennedyfinancialsolutions.com.", "label": 1}
{"text": "Wtf are you doing lol", "label": 1}
{"text": "Stocks?  Gold and silver? \n\n  \nInflation is a bitch and a way for governments to steal wealth without having to raise taxes.  What country are you in?  Can you work get work that pays in a more stable currency or maybe work in something around tourism and get paid in other currencies even as tips?", "label": 1}
{"text": "No that’s illegal.", "label": 1}
{"text": "Sir how on God's green earth do you manage to spend 3k on nightlife a MONTH in SE Asia? That's pretty damn impressive, unless it's just high end prostitutes every night. You can easily get wasted in Bangkok for like $10.", "label": 1}
{"text": "70k at a 0% interest rate is 70k lol", "label": 1}
{"text": "Totally get where you're coming from! Selling 20% sounds like a smart way to hedge your bets, especially if the IPO timeline is still murky. You get to lock in some gains (15x is nothing to sneeze at!) and still hold most of your shares for the upside if the IPO eventually happens.\n\nA few things I'd keep in mind:\n\n* **De-risking vs. growth potential**: Selling a portion lets you secure a win now while keeping skin in the game. Kind of the best of both worlds if you're worried about timing or market shifts.\n* **Tax impact**: Make sure to check out the tax implications – sometimes a secondary sale can have a surprising impact, depending on your tax bracket and where you live.\n* **Company’s outlook**: If things are looking steady but without a solid IPO date, this partial sale keeps you flexible without taking all your chips off the table.\n\nIf you’re not feeling any urgency for the cash, a 20% sale sounds like a nice middle ground.  \n  \nAnd yeah it's not a financial advice :)", "label": 1}
{"text": "Yep, stablecoins like USDT can be a solid choice to protect your savings from devaluation. Just keep a few things in mind:\n\n1. **Crypto Risks**: Stablecoins depend on exchanges, which come with security risks. Use a secure wallet, ideally a hardware one.\n2. **Alternatives**: Some fintech apps offer USD accounts or stablecoins without the high account minimums—worth checking out!\n3. **Age Requirements**: Since you’re under 21, you may need a guardian for certain accounts.\n\nStablecoins can work well for savings, but consider diversifying a bit if you can. Good luck!", "label": 1}
{"text": "\"Partner is searching for a job, but this market is tough and I want to be prepared just in case it takes longer\"\n\nwhy do you need to send your child to daycare before your partner finds a job? you're not going to just stumble upon $1700/mo. while your partner isn't working, their primary responsibility is childcare. hopefully, they're going to provide better care and attention for your child than any daycare will.\n\nwhen they find a job, have a facility lined up for your child!\n\nalternately, consider your partner staying home until the child is in pre-k. those first few years really matter for secure attachment, and the only people who will remember how much they worked is the child. (this is a suggestion, not a prescription)", "label": 1}
{"text": "The child will attach *just fine* if they spend part of the day in daycare in those first years. \n\nDaycare won't be needed until the partner finds a job, and depending on the employer there may be help with securing and paying for daycare. In the Seattle area, many of the larger employers have their own agreements with specific daycares & provide some level of subsidy, and offer pre-tax dependent care deductions to further lower the cost.\n\nOP - you're overthinking it. When she returns to work, the cost of daycare will easily be covered by her paycheck, as will substantial savings for future care.\n\nSit down and figure out your budget - you're probably spending on things that you really don't need to spend on right now. \n\nHints for some common things that are easy to reduce: Are you *really* using all the streaming services that you're paying for, can you wait an extra 2 weeks between hair cuts? Can you lower your car insurance by changing providers? Can you eat out one less day per month?\n\nIt's highly likely you can cut a couple of hundred dollars a month fairly painlessly.", "label": 1}
{"text": "Taxes? I thought they meant Texas. I don’t want to oh Texas. Fuck them.", "label": 1}
{"text": "they would defiantly report income to her account.  so yes they should.   it would be under her wages transcript in the irs", "label": 1}
{"text": "They do indeed.", "label": 1}
{"text": "The only thing she has bought is a G wagon and took a couple trips…", "label": 1}
{"text": "I'd double check with your daughter she doesn't have a secret only fans or something..", "label": 1}
{"text": "A mistake that may take a while to fix and cause you great stress.  Welcome to the beauracracy!", "label": 1}
{"text": "oh no.. fat fingered thing on a phone.   you get the idea.", "label": 1}
{"text": "How is she physically ? Strange way to find out about an OF", "label": 1}
{"text": "Perhaps they’d report it with prejudice, great vengeance and furious anger.", "label": 1}
{"text": "22 and works at a coffee shop in the PNW. We have some coffee stands in the area that can bring in a very high income...", "label": 1}
{"text": "This submission has been temporarily locked for review due to a high volume of rule-breaking comments. Thank you in advance for your patience as we try to maintain a high-quality discussion. The original submission text is below.\n\n---\n\nToday my daughter got a letter in the mail from the state of Oregon. It reads \n\n“Statement of Account\nThe enclosed statement of account describes your debt. We're sending this statement in addition to the notices required by law. The account details shown on the following pages provide a summary of your accounts and any amounts owed and includes penalties, fees, and interest.\nThe voucher below shows the balance you owe for the accounts on the following pages. The amount doesn't include balances you've appealed.\nYou may pay electronically using Revenue Online at www.oregon.gov/dor. lf paying by check, include the voucher to make sure your payment is applied correctly. To avoid additional penalties and interest, please pay the balance due immediately.\nYour rights in the audit, appeals, and collection processes are explained in Your Rights as an Oregon Taxpayer, a free publication available online at www.oregon.gov/dor/forms or by calling us.” \n\nShe has only worked 4 years of her life, and works in a coffee shop. Total due is $59,003.82. I’m at a loss of how this is even possible? Is this a mistake? \n\nFor payment type it says “Other Agency Accounts”.", "label": 1}
{"text": "What?", "label": 1}
{"text": "I need a new battery at the very least. I thought I might as well upgrade to a new one.", "label": 1}
{"text": "I want a new phone. I need a partial new phone as I need a battery.", "label": 1}
{"text": "**Mortgage Protection Insurance Calculator**\n\nTo get an estimate and see how MPI might compare with other options, try this [**Mortgage Protection Insurance Calculator**](https://yourownbank.org/mortgage-protection-insurance-calculator/).\n\nJust enter your mortgage amount, age to get:\n\n* Estimated MPI Monthly Premium\n\nThis should give you a better sense of what makes the most financial sense for your situation!", "label": 1}
{"text": ">consider your partner staying home until the child is in pre-k. those first few years really matter for secure attachment, and the only people who will remember how much they worked is the child\n\n\nYeah, just opt out of the workforce for 4 years. Surely you'll be able to just slide back in with no issues or impact to your ability to get a job. Surely you won't miss those four years of not paying into social security or a 401k. Surely you'll be able to get a job that pays as well as the one you had four years ago, even though you've lost four years of potential experience and professional development. ", "label": 1}
{"text": "\"The child will attach *just fine* if they spend part of the day in daycare in those first years.\"\n\nyeah, maybe. \n\noften it's not \"part\" of the day, it's 8-5 (or something similar), which is >= 65% of the child's waking hours. there's been a decent amount of research on daycare centers and attachment. some studies suggest that children under 2 develop insecure maternal attachment if they spend a significant amount of time in daycare, others finding different correlations. here's a meta analysis if you're interested: [https://pmc.ncbi.nlm.nih.gov/articles/PMC8478126](https://pmc.ncbi.nlm.nih.gov/articles/PMC8478126)\n\nanecdotally, i have a few close friends who work at or in the child care system. the majority of the time, they tell me the average state of care is (even in expensive areas like NoVa) extremely poor, and that the standard is \"back to baseline, then release\". e.g. get the child to stop crying then let them go.\n\nit seems like best case, daycare has a neutral effect, worst case, it consistently creates avoidant and/or anxious attachment.\n\ni'm not condemning parents who have to use daycare, i totally get it. i'm just suggesting there's some evidence for keeping your children at home until they're 4+", "label": 1}
{"text": "i'm not saying there's no cost, i'm saying there's a higher reward.\n\nif you're going to put forth an argument, please do it in good faith <3", "label": 1}
{"text": "Higher reward in *your* opinion. It's not fact. It isn't even supported by peer reviewed research.\n\n\nAdvising women to sit out of the workforce to raise children during critical years for professional development has huge ramifications for their personal and professional lives. It's not a decision that should be made lightly or in a vacuum. ", "label": 1}
{"text": "Unless you have a collection of high value cars, I don't think any financial advisor worth their salt is going to file a car in your assets category. It is always going to depreciate in value.\n\nA car is a purchased thing. Period. If you plan to sell it right after purchasing new then you are an idiot. There is no impact to your actual finances just because the market price of an item that you own changes. You buy a couch for $1k. My God, it depreciated 50% as soon as you took it home! What a terrible decision you've just made! Except it doesn't fucking matter. You've spent the money, you now have the thing. You can choose to utilize the thing for your benefit (comfort), or you can stay up all night having anxiety attacks because it's value went down. Either way nothing changes. The market value of the thing makes no difference to you, the actual person. That computer you bought 2 years ago is worth basically zero dollars on the market now. Was it a bad idea to replace your computer because of the items depreciation? Or are you gaining utility from having it? \n\nAgain, the only time the depreciated value of a car matters is when you go to sell it. \n\nPlease, someone correct me if I'm wrong here about when the value of your car imlacts your finances otherwise. Because it doesn't. It's all theoretical until you sell and even then it only matters if you consider owning the vehicle to be a total waste that brought you no utility.", "label": 1}
{"text": "Cash App offers instant loans from $20-$200", "label": 1}
{"text": "I didn’t delete the mods; you did. It seems you're making increasingly unfounded assumptions and projections. It's evident that you’re the one being defensive here.", "label": 1}
{"text": "I didn’t offer to take out his teeth. Gtfo. ", "label": 1}
{"text": "Hard no", "label": 1}
{"text": "While life insurance is barely a tier above MLMs and crypto", "label": 1}
{"text": "The wiki for this sub", "label": 1}
{"text": "Might be cheaper to get a HELOC", "label": 1}
{"text": "Ok.\n\nSo ill take a loan for $100 from my 401k and pay back $1000. In your world, I just earned $900 interest!\n\nI weep for the bold ignorance of some people.", "label": 1}
{"text": "Pay that shit off and move on with your life.", "label": 1}
{"text": "You made a mistake by not reporting the theft to UPS. You owe the money. You'll likely have to pay it.", "label": 1}
{"text": "\"paying it to yourself\" means you get to keep it, as opposed to paying it to a financial institution and never seeing it again. No one is saying you are MAKING money. Are you being purposely obtuse or what?", "label": 1}
{"text": "I would go to the library it's free and you can find other families with kids.", "label": 1}
{"text": "I would go to great lengths to eliminate the debt, even if it meant settling for less than the total amount owed. Finding ways to reduce or manage the debt effectively would be a top priority for me, as I’d want to alleviate that financial burden as soon as possible.", "label": 1}
{"text": "You won't only owe ten percent at tax time unless your income is low enough to fall into the zero percent tax bracket for both federal and state taxes. Instead, you'll be liable for the percentage corresponding to your current marginal tax brackets. The ten percent is an additional penalty. \n\nGenerally, the best option is to roll it over. Any withdrawal, whether automatic or not, will be subject to taxes.", "label": 1}
{"text": "77,459 is an ass load of debt. Would literally take at least a decade to pay off. If you pay it all off now everything you save going forward will replenish your savings", "label": 1}
{"text": "People are calling it “interest”, which by definition is something “paid”. Moving money from your checking to your 401k is not a “payment” and is not, by definition, interest. \n\nNobody would ever say they paid themselves when they moved money from one of their checking accounts to another of their checking accounts at a different bank. \n\nThe government literally uses this as a tool to force people to save more for retirement as a penalty for mismanaging their money to a point of having to borrow from their 401k. They disguise it as “interest”, so stupid people don’t realize how dumb it is.", "label": 1}
{"text": "#Pay them and be free\n… you have plenty of time to make that money up", "label": 1}
{"text": "Sure but that's just arguing semantics, the money is still yours", "label": 1}
{"text": "Buy high sell low is a sound strategy", "label": 1}
{"text": "I wouldn’t put my family’s health and safety into some janky high mileage old piece of shit, but you do you", "label": 1}
{"text": "Increase your 401k weekly deduction to 15% and save into your hysa to about 5000 dollars cash as your emergency fund. Until rates fall to its appropriate level close to 2% to 3% a year or two from now do not buy a house of any kind. You got a long to go until you make that move and never mention it to anyone or worry about and just rent for now. What rush do you have to go into deeper debt? Look outside the front door of your workplace because your headstone's out front.", "label": 1}
{"text": "Dont", "label": 1}
{"text": "Don’t help him. He is a grown man. He needs to man the fuck up and stop taking sick days unless he physically cannot leave the bed. \nI’m in the military, I still get paid on sick days and I still show up to work unless I’m dying, but even then I still have to drive to base and be seen by medical. \n\nI was $18k in debt, my dad offered to pay off my loans, and charge me at a lower monthly rate with 0% interest, but I’m a man and I need to deal with the consequences of my poor life decisions. So I did it myself. \n\nTell him to grow up, join the Navy reserves. He might get a bonus big enough to pay his debt. He’d drill on one weekend every month. And 2 weeks In the summer.\nIf he wants to make more money to pay off his debt and he can do it with one single deployment to the Middle East, and he’d still have money left over. \nBahrain is a beautiful country for deployment. \n\nHaving a breadwinner gf isnt shameful.. I would love it.. but even if my gf was a breadwinner, I would still take care of her and pay my dues. \n\nOnce again.. do not help him. He will take advantage of your kindness as he already is. \nDon’t give him rent money back just because he’s poor, he did that to himself. \n$78 / week on gas is not that bad. That’s a single fill up for people in California. \n\nYou should also evaluate your life. Think about your future and where you want to be in 5, 10, 30 years. I don’t care how much you love somebody, if you have goals and your partner is doing nothing to help you achieve those goals then you need to leave them behind. \nYou will never be able to retire if the man in the relationship can’t even take care of himself.", "label": 1}
{"text": "Barstow is nice.", "label": 1}
{"text": "Hey there \nHey there I’m Britney I am willing to support your goals hmu if you don’t mind", "label": 1}
{"text": "the rule of thumb that gets tossed around a lot is an emergency fund should be 6 months worth of expenses.  Like any generalized advice, that's good generic advice but doesn't fit everyone's situation.\n\nBut, unless OP has some reason to not save up that amount, it's a good start since they are so young.  I would recommend that OP download the last 3 months worth of bank statements and look at all of their spending for everything.  Debit, credit, savings, etc.  and then put that amount into an emergency fund. \n\nThen they can evaluate if that's really enough to get them through an emergency like losing a job or needing to buy a car, pay for first and last months rent, etc.\n\nIf not, they can slowly increase it to 6 months worth of expenses.\n\nI agree that $2k is not an emergency fund that's going to get them through an actual emergency.  It's better than nothing, but it won't last long.", "label": 1}
{"text": "Yeah, while I'm all for electric vehicles, in a 2-car household, I would only have 1 EV and the other a hybrid. Gasoline still gives you the freedom to go places where aircraft don't go, like the smaller cities or towns, and out in the woods/mountains. Additionally, should there ever be electrical issues, you still have an alternative fuel and means of going to/from. Obviously, OP has solar, but if they need to drive 300+ miles, electric isn't the answer.", "label": 1}
{"text": "If you hate working, you can try make your money online. Can be quite slow if you didnt invest any money though its doable", "label": 1}
{"text": "Age? ​", "label": 1}
{"text": "I mean grid-type issues. Places where natural disasters can cause grid issues, like hurricanes, tornadoes, severe snow/ice, etc. OP is more insulated against those with having solar panels, but not entirely, and if they need to move their family elsewhere temporarily, having 2 electric vehicles is not the best. For example, if they're in Austin or San Antonio and those \"once in a lifetime\" Winter storms happen in Texas (like they have twice in the past 5-6 years), OP is likely stranded and reliant on an energy source that is no longer available. They already have 1 electric vehicle, so it'd be better for a 2nd vehicle to be hybrid or just gasoline powered.", "label": 1}
{"text": "if you have stable expenses, a method that sounds clever:\n\nput 1 months' worth of expenses in a 12-month CD every month for 12 months.  If you ever have an emergency, you have a new CD maturing every month for 1 year.  Every month that you don't have an emergency, you just re-invest in a new CD when the old one expires.", "label": 1}
{"text": "Didn't know what to think, hence why I asked here lol", "label": 1}
{"text": "Are you in the US? Can you become a caregiver ? You can use your biology degree to help with body mechanics and you can create a schedule that fluctuates with clients, if you’re a male, even better male caregivers are always needed. Sometimes you can even be a private pay client for rich people.", "label": 1}
{"text": "Refer to the subreddit’s wiki and flowchart.", "label": 1}
{"text": "she’s the one that chose to break up with you, so if she wants to stay in the apartment, she should be finding a roommate to cover your side and create an addendum to the apartment contract to change your portion to a new person. i know that’s not legal advice but it seems she’s getting all the benefits in this breakup. if she wants to stay in the apartment, she needs to find a roommate or it’s time to break the lease since you don’t live there anymore. no more subsidizing her life.", "label": 1}
{"text": "It totally should be manageable, but OP should seriously look at fiancé’s finances and be prepared for how she got into this situation. She should not owe that much for a car with that many miles. Was she underwater on a car loan she rolled into this loan? Is she regularly spending more than she makes? Are you prepared for her to keep doing this and potentially impact your finances? Are you ready for her credit score to be tied to your (depending on the state/situation) that could impact your ability to get loans if you marry? \n\nYou need some heart to heart honest convos here and Im not saying this from a sexist viewpoint im a woman and id still do this.", "label": 1}
{"text": "Use www.paycheckcalculator.com to call this and to find out all the variables", "label": 1}
{"text": "First time?", "label": 1}
{"text": "Fight the lack of protection and leaking of your data by giving it to more companies.\n\nWhat a crock of shit.", "label": 1}
{"text": "The estate lol. The truck and some tools were all my father had. Personally I told him it was silly to dump his life savings into the truck but whatever \n\nI am the executor of his estate. \n\n\nFor more context he live in California. Truck is in Colorado.\n\nIn the next couple months I will be relocating to Tennessee for work. My boss has offered to help me out with financing if I need it because my credit is shit.\n\nHe is starting a new chapter of his plumbing business out there and made an offer to relocate me. Currently I drive a 1996 Toyota 4Runner with about 350k miles. Could last me a while longer....could take a shit tomorrow.\n\nIf the Toyota takes a shit I have zero savings to afford another car.", "label": 1}
{"text": "1996 Toyota 4Runner 350k miles", "label": 1}
{"text": "I am 35\nI do not drive the truck it is in n Colorado \nMy father put 40k down and owed 15k(read my post dude)\n\n\nHe left me nothing else really. Might get a grand or two from his bank account but that's it", "label": 1}
{"text": "Honestly I'm leaning more toward this. Sure it'll be touch but if I pay off this 15k then I can then own a truck valued at more than 30-40k which I would get ALL of if I sell when paid off", "label": 1}
{"text": "I wonder....do dealers still require full coverage if the vehicle is non op?", "label": 1}
{"text": "What's the number? I'll take it off the dark web for you", "label": 1}
{"text": "it does not \"have to\"\n\nthere is not requirement to split an estate evenly amongst the kids", "label": 1}
{"text": "that is not true.  you do not have to split up an inheritance equally between the kids", "label": 1}
{"text": "It’s easily googleable dude, ignorance isn’t as charming as you think it is", "label": 1}
{"text": "I looked into the death clause. He doesn't have one.\n\nI will ask my boss about the refinancing option. He said he would help me out with this as I have poor credit.", "label": 1}
{"text": "Yes he said he would be willing to help me get financed. Either as a co buyer or get financing himself or through his company", "label": 1}
{"text": "You can also just keep scrolling and not comment if you find it that annoying.", "label": 1}
{"text": "This is what is wrong with this generation. Given everything on a platter still complaining about sales tax. Go work the weekends, and take up extra work to make it affordable to pay the insuranc. Don’t sit around with your video games and twiddle your thumb on social media. We the generation made it with grit and determination.", "label": 1}
{"text": "I drive a 1996 4 runner with 350k\n\n\nWhen it dies I'm fucked. \n\nIt could die any die", "label": 1}
{"text": "I am the executor", "label": 1}
{"text": "Is it being petty brat if you don’t live there and you’re no longer in a relationship.  Are you the Ex’s lawyer dad?  It say “giving 500 in rent AND covering utilities.”", "label": 1}
{"text": "Sign a prenup lmfao", "label": 1}
{"text": "The OP specifically stated: \"Can someone explain like I’m 5?\"", "label": 1}
{"text": "In a perfect world the plan is to buy it and sell it for a profit. \n\nThat's kinda what I'm getting at I guess \n\nIt seems foolish to throw away the value for 10-15k \n\nYeah it would be tough to afford and it doesn't help improve my current situation. If anything it will not makes things extremely hard and they're already bad.....but if I can acquire it then I can sell for much more and pocket it all", "label": 1}
{"text": "This is a solid explanation\n\n\nThanks", "label": 1}
{"text": ">   Idk who's idea was it to give a 19 year old a credit card with a 5600 dollar limit but they did. I got another card in hopes to transfer the money over with a 1 year 0%Apr. Long story short that didn't work out and both cards are maxed out\n\n\nYou're blaming other people for YOUR poor choices. \n\n\nStep One is owning up to your own behavior,  which you clearly haven't done. ", "label": 1}
{"text": "I imagine you didn't read the first sentence at all where I mention my irresponsibility with money and owning up to my poor choices 💀 reading comprehension isn't really your thing is it?", "label": 1}
{"text": "If yall can’t clear yall debts off lmk I can help", "label": 1}
{"text": "I'd drive it every single day it would be my daily driver I am a plumber so I'd likely use it a good bit for work related things as well. I'm sure I'd tow trailers at some point. I also enjoy camping and outdoor activity so I'd do a bit of off road if as well. Especially in Tennessee", "label": 1}
{"text": "I drive a 1996 4Runner with 350k and am about to relocate from California to Tennessee", "label": 1}
{"text": ">Well maybe you don’t work for the same company as the OP. Some companies are giving an allowance for a late model truck that is capable of towing a trailer, so they want a late model truck capable of towing a trailer. I am not saying the OP should buy a $73k truck, but my brother replaces his fleet every five years.\n\nThen his title isn't a project manager. You don't know what a PM does if you think we're wasting time hauling things. You can hire an expiditer for 1/3 or 1/4 of our pay to just drive. We are far more valuable doing anything but driving. \n\n>You are not including residual. Again, I am not saying a $73k truck is a good idea but in five years with normal wear and tear it will likely be worth $35k - $45k.\n\nYea I get residual exists, but how much do you think it's worth after 5 years of extensive driving either dings, scratches, and dents? Also $500/month take home after 60 months is $30k. The truck isn't worth $43k when he's done.", "label": 1}
{"text": "Would hate to see who you work for… you’re giving off the “I’m too good for that” vibe. I’ll do whatever my company needs me to do to get a job done because I enjoy being in the field and being in the office…", "label": 1}
{"text": "I literally don't have enough time to coordinate 27 trades,  keep up the budget, review shop and submittal, review RFI, make the schedule, update pull plan, do labor units for our self perform, QA/QC, OAC, coordination meetings, internal meetings, argue with subs about their change orders and somehow in my day, **and make runs to the job site from the main office.**\n\nYou're small time if you have time to run to the office and job site, where's your team. I run multi-million dollar ground up projects.", "label": 1}
{"text": "The automated tracking never worked for me. I track my expenses manually through SpendCircle (iPhone app).  It costs next to nothing (2 bucks for the whole year for my whole family) as opposed to paying $100+ for other apps. The automated ones don’t help me build good habits.", "label": 1}
{"text": "The one thing public education lacks is finance literacy... it not too late to pick up finance skills to help you down the road later in life...", "label": 1}
{"text": "Keep killing it then boss man 🫡", "label": 1}
{"text": "Word choice can be a form of coping. By using the type of words he uses it coveys mindset and if they understood the failure and can learn from it. The response is not trying to put words into OP’s mouth but to demonstrate a failing\n\nIdk whose idea [ they aren’t smart because it shouldn’t have happened ]\n\nLong story short [ excuses but I don’t want to talk about them ] \n\nBoth cards are maxed [ just a circumstance. Not that he maxed then ]\n\n~~\n\nInstead of saying the following which takes responsibility of the actions. \n\n>I was foolish at 18. I tried to game the system but after transferring money to one credit card I ran up the debt on the original.", "label": 1}
{"text": "No", "label": 1}
{"text": "Itt everyone's wrong. You'll have a higher credit score and better history lowering your balance by paying it early. The card most often will report your last statement's balance, which you can reduce ahead of time by paying 99% of it before statement time. Leave $1 or more, as $0 (inactive) doesn't positively contribute to history. There's models that check your score daily and cards that report more often than statement balance, so just pay in full any time utilization is high.\n\nThis isn't worth your time unless you are trying for under 10% (best) or 30% (good) utilization for the month, or actively seeking new credit. The effect on score is mostly temporary. When you have a high enough credit limit, it becomes irrelevant as it'll eventually be very hard to break 10% outside of big one-time purchases like a new vehicle or home remodel.\n\nDon't limit credit usage for score. You should always be getting 3% from PayPal Mastercard where paypal is accepted and 2% from everything else at a minimum. You fix the utilization hit to score by paying it early.", "label": 1}
{"text": "Did your research? How about giving them a fucking call.", "label": 1}
{"text": "The ONE thing??", "label": 1}
{"text": "That's not how attendance policy works", "label": 1}
{"text": "It's a 4Runner\n\nBut Tacoma, 4Runner.....no real difference there man", "label": 1}
{"text": "He has his business here that he built 14 years ago\n\n\nFor whatever reason he decided to move him and his family to Tennessee.\n\nI've never asked why but if I had to guess it prolly has something to do with how weird California is. He is also very god fearing and conservative so maybe Tennessee aligned more with his values", "label": 1}
{"text": "hmm.. i think you do Internet Marketing. you can start with $0 though that be slower. sell affliates stuff for quick money. if you can find buyers.", "label": 1}
{"text": "Today", "label": 1}
{"text": "My boss is paying all relocating costs.....but also I don't own anything. I don't have a lease anywhere...I sleep in my car because I live in Orange County. Cost of living plus child support is out of my budget so I just car camp. \n\n\nBasically zero moving costs associated to this relocation", "label": 1}
{"text": "He was a lifetime electrician\n\nWas on dialysis for 27 years with kidney failure from drug use\n\nSpent last 10 years on full disability \n\nLived in California", "label": 1}
{"text": "🙋‍♀️ COVID parent... you go insane 😂", "label": 1}
{"text": "Yieldstreet is actually \\[getting sued in a class action\\](https://www.realestatecrowdfunding.com/blog/october-2024-newsletter) right now.\n\nI think it's a bit of a stretch to call real estate crowdfunding a \"Ponzi scheme\" or \"scam,\" since it's a totally legitimate form of investment. But specific platforms have huge issues", "label": 1}
{"text": "What happens when my 96 4Runner with. 350k miles doesn't start this morning?", "label": 1}
{"text": "and about a year later they are having a kid together, oof.", "label": 1}
{"text": "Your post has been removed because we don't allow relationship or personal advice discussions ([rule 9](https://www.reddit.com/r/personalfinance/about/rules)). While there may be a financial component to your post, you will need to submit again with a title focused on personal finance and without any of the following:\n\n- Personal history or background information that is not essential to the financial discussion (it is appropriate to mention when abuse is a factor in a current or past situation)\n- Prominent emphasis of mistakes or financial surprises from a family member or S/O\n- Requests for relationship advice, asking for help convincing someone to change their behavior, asking for help settling a disagreement, etc.\n\n\n*If you have questions about this removal, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fpersonalfinance&subject=Removal%20help%20request&message=Hello%20moderators,%20<describe%20your%20issue%20here>.%20%0a%0a%0aMy%20submission:%20https://www.reddit.com/r/personalfinance/comments/1ge21m2/am_i_overfitting_to_my_son_in_my_home_search/%0a).*", "label": 1}
{"text": "1) pregnant 2) no job 3) 700 a month financed car.... \n\nlol", "label": 1}
{"text": "This a good lie for sure to get your money back from a CC transaction 🤣 did they believe this one??", "label": 1}
{"text": "I wouldnt leave a job unless I had a another job lined up", "label": 1}
{"text": "But before assuming inflation will be something like the past ... be sure and research Weimar Republic, Venezuela, Zimbabwe, Romania, Lebanon, and all the other countries that have attempted to wash away government debt by printing more currency running up hyperinflation then trimming off three zeros once twice or three times (so your \"$1 Million!\" can buy a $1 candy bar).", "label": 1}
{"text": "In 30 years, $110k per year is about the same as $45k per year today", "label": 1}
{"text": "> yes it is so max is $8300.\n\nYour limit for 2024 is prorated based on the number of months you are eligible to contribute. Since you just started in October, your contribution limit for 2024 will be $2,075.\n\n(Something to keep in mind. You can't start a HSA in December and drop in the max annual amount.)", "label": 1}
{"text": "Auto mod sends similar replies to people who post, actually even more helpful than this because it tries to suggest some specific headings. So yeah, you don’t need to make this kind of reply. Besides, this question isn’t in there. It says to save 15% for retirement. It doesn’t say how to adjust this when you have debts.", "label": 1}
{"text": "I took Home Economics. We learned how to use a sewing machine and bake sourdough. Didn't learn shit about finances.", "label": 1}
{"text": "Do you know what savings are?", "label": 1}
{"text": "You have room and board as an enlisted guy, right? Stop spending money. Do things that cost you zero dollars for a year. Stop buying shit. Only expenses you should have are for gas, insurance, and car payment maybe shaving and showering stuff too. If you can nut up and be a man enough to stop spending like a woman you'll be able to pay your shit off. I know that's sexist but that might be the perspective you need to change your habits.", "label": 1}
{"text": "You are overthinking this.", "label": 1}
{"text": "No\n\nAt least not to me.\n\nI’d say 50% for like 5% is ok.", "label": 1}
{"text": "They pay, everything's fine; I'm getting $500 monthly.", "label": 1}
{"text": "I’m already receiving $650, but l’ve been with them  for 4 years now", "label": 1}
{"text": "Sad. But based on what is going on in the insurance market, there has to be some major changes coming soon.", "label": 1}
{"text": "I would get rid of that time bomb ASAP ", "label": 1}
{"text": "These rich ppl smh", "label": 1}
{"text": "Yeah we can, answer these questions without more information. Half a million dollars to purchase a messed up condo op is to to have to pay monthly fees to keep in there babe. \n\nThat is absolutely insane. No more info needed. Did you even actually read the post?", "label": 1}
{"text": "You missed the point of the article.", "label": 1}
{"text": "If this is in florida, RUN, hard no.", "label": 1}
{"text": "Make them an offer they can't refuse.  Tell them you'll pay double their normal rate.  If that doesn't work, offer to triple it.", "label": 1}
{"text": "I'm off topic, but I find it ridiculous that the IRS is auditing low/moderate income households with their newly increased budget", "label": 1}
{"text": "It looks like someone is trying to get ( steal) your house.", "label": 1}
{"text": "That was the whole point unfortunately. That's how we go the income tax in the first place. \"it will only be a couple % on the richest among us. Fast forward 100 years and we pay half our pay in federal, state and local taxes. \n\nThe rich can lawyer their way out shit, and they know damn well the people who have to work for a living can't. You're damned no matter what you do. You pay taxes, they want more taxes. It's ridiculous. Not only that, but the return was accepted, and it's been 18 months since that tax deadline and they want more taxes retroactively. This country is going to shit.", "label": 1}
{"text": "It's not so much a question of income as it is what's easy to automate.\n\nThe check OP failed was claiming more for the EITC than allowed by their state. That likely amounts to a simple rule of \"Check lines X and Y, if greater than N, send out a letter.\" A few lines of code to implement that logic.\n\nCosts the IRS cents and gets them thousands. That's the same rate of return as spending millions to get back hundreds of billions.", "label": 1}
{"text": "If you have AT&T, they had a serious breach that exposed everyone’s SS number. Lock your credit files with all 3 credit bureaus and activate a fraud alert. Mine is on there as well.", "label": 1}
{"text": "Is this Florida? If yes, move out of Florida.", "label": 1}
{"text": "It’s amazing how many people don’t understand this! ONLY make a claim for CATASTROPHIC DAMAGE! Everything else is regular maintenance, yes, even the big ones.", "label": 1}
{"text": "This is correct.", "label": 1}
{"text": "Who ever said income tax would only be a couple percent to the highest earners? Do you use roads, public schools, national parks, emergency services, etc.? Planning on claiming social security when you retire? Who do you think subsidizes the gas you pump and the food you eat? \n\n> you pay taxes, they want more taxes\n\nWho’s the “they” in this scenario? Government employees aren’t getting rich off your tax dollars, I assure you. And the stuff about the return being accepted…do you think that means it’s been validated as accurate? Explain to me how that would be possible when returns are accepted within days and weeks and there are hundreds of millions filed each year. Anyway, there’s typically a 3-year statute of limitations on federal returns (states may be different), so the amount of time it takes to get closure is pretty short. \n\nAbsolute nonsense from you.", "label": 1}
{"text": "or you will get scam insurance companies pop up and insure a very expensive part of the country with very high premiums and if a disaster happens they will just go bankrupt and not pay out. Zero risk game.", "label": 1}
{"text": "To be fair- a lot of scammers fake being a poor household to get the generous cash benefits from the EIC. Just like they pretended to be a small business from Covid relief. We got 13k from it one year. It can be a fairly large windfall.\n\nI wouldn’t want them going after poor families either, but they should go after fake families and I’m not sure how they could make that distinction", "label": 1}
{"text": "I hate what a scam it all is. \"You must have this\", but also \"never use it\".", "label": 1}
{"text": "All those defense contractor firms’ CEOs would chuckle. No they are not getting rich by stealing from obscure expenditures, not at all.", "label": 1}
{"text": "It's Maryland. \n\nThey have to make up the shortfall after $700k was spent on the Baltimore mayor's childrens book", "label": 1}
{"text": "> cover costs + Profit,\n\nHere's a secret, not everything needs to be run as a for profit business. Insurance is a communal emergency fund, what purpose does putting a bunch of commissioned sales people, middle men, high paid executives and shareholders who demand value increase do for a communal money pool?", "label": 1}
{"text": "Probably too much regulation in the industry for that to happen on any large scale or for any length of time. They might get some people in the short term, I guess.", "label": 1}
{"text": "The insurance system is a total scam. Wow. Pay for years without using it. Use it once, get dropped.", "label": 1}
{"text": "Don't get me started. Homeowner insurance is such a scam because they will find any excuse to drop you if you use it.", "label": 1}
{"text": "Doesn't sound like a good idea.", "label": 1}
{"text": "It’s not a scam. People keep trying to use it for the wrong reason. \n\n**Home insurance is intended to protect you** (and the bank) **from a financial catastrophe from which you could never possibly recover.** \n\nIt is *not* for isolating you from the regular bumps and pitfalls of everyday life. \n\nA fire burns your house to the ground? A tree crashes on it and *completely* crushes the entire house? A floor knocks the whole thing off its foundations? Yes, that’s an insurance claim. \n\nBut a leaking pipe causing a bunch of ruined carpet and drywall that’s got to be replace? No. That is not an insurance claim. Pay that $15k out of pocket, because this is why standard home owning advice 101 is to maintain a sizable emergency fund. \n\n*Because things like that happen all the time*.", "label": 1}
{"text": "They already have this - it's called a mutual insurance company. They still have to trim bad risks (drop people) and deny claims when something isn't covered by the policy.", "label": 1}
{"text": "I wonder if this is similar to what health insurance turned into for the USA.\n\nFrom what I understand, health *insurance* was meant to insure you against catastrophic situations, like cancer or you broke a bone or suddenly need some surgery. It didn't cover routine\\maintenance care, like normal check ups or vaccines or small medications.\n\nBut over time, it grew and turned into this Frankenstein monster where it's both health care and health insurance. And combined with perverse incentives, it just made everything worse for almost eveyone.\n\nWonder if home insurance will turn the same based on how people like OP are using it.", "label": 1}
{"text": "Keep half cash in case of major event. Think Ashville nc right now\nThe rest block into 3k stacks. Deposit them every few weeks. If the bank asks tell them it's inheritance.\n\nIf for some reason anyone else were to ask. Tell them you don't like to travel with more than 3k cash for safety reasons.", "label": 1}
{"text": "You can use it to pay for things instead of using money from your bank account.  If you spend $2K per month in cash that you would otherwise use for groceries, gas and other items, transfer the $2K from your bank account to a HYSA.", "label": 1}
{"text": "Deposit a little at a time if you're worried. $5k a month. It's none of their business where it came from. Could be your side business.", "label": 1}
{"text": "Let your paycheck accumulate in your bank account until it hits this amount of money. In the meanwhile, use the cash to spend on your regular expenses.", "label": 1}
{"text": "If it’s clean cash yeah just go deposit. If its not than just buy things with cash for awhile like gas and groceries", "label": 1}
{"text": "Sorry for your loss. What is your goal by depositing it?  Could you not just keep it and pay your bills by money oder while whatever you have in the bank stays put? Between my mortgage and 2 car payments, 25k would be done in 4 months.", "label": 1}
{"text": "Do it in increments. The maximum amount parents can give their children without the child having to pay income taxes on it is 15,000 each year. Put $15,000 in the bank on in the year you pay taxes. Say, 2023. Then after your tax return comes in, put the other $10,000 in the bank. Tell the bank cashiers that mom instructed you to do it this way ( or whoever you got the money from)", "label": 1}
{"text": "Must be tiring to be scared 24/7, yeah?", "label": 1}
{"text": "This is what I would do.", "label": 1}
{"text": "This is the best advice, really", "label": 1}
{"text": "That’s dumb as hell. This is a realistic question homie.", "label": 1}
{"text": "Bing? What kind of monster are you?", "label": 1}
{"text": "…Bing?", "label": 1}
{"text": "Whoa whoa whoa, who approved of *bing* being used as a verb?", "label": 1}
{"text": "Dunno, seeing bing being used as a verb is just weird.\n\nI’m sure they’re much better now, but it’ll forever be IE until maybe another generation or two later.\n\nI’m just flat out biased that it sucks", "label": 1}
{"text": "My laptop came with Edge and that's what it uses for search.", "label": 1}
{"text": "No it’s not. \n\nThere is no good reason not to deposit in a bank where it’s safe, FDIC insured and earning interest.", "label": 1}
{"text": "You edge on your laptop?", "label": 1}
{"text": "I use Bing to find music for my Zune.", "label": 1}
{"text": "Make deposits less than $10,000. Banks are required by law to flag higher amounts.  Just makes your life easier.", "label": 1}
{"text": "And leave the cash open for potential theft? This is terrible advice. The bank will happily accept it all at once with an ID and honest explanation.", "label": 1}
{"text": "This submission has been temporarily locked for review due to a high volume of rule-breaking comments. Thank you in advance for your patience as we try to maintain a high-quality discussion. The original submission text is below.\n\n---\n\nI literally have no way to prove where it came from since my mom has passed away. I obviously could provide a death certificate but i dont know. I'd like to to use in the future (1 year+) for purchasing a home. I have had some past legal troubles (not drug stuff) but I'm still worried about just showing up with that much cash?", "label": 1}
{"text": "It’s a result of people abusing it. \n\nMy two best friends sell new roofs. A complete racket here in south Louisiana.", "label": 1}
{"text": "[https://www.youtube.com/watch?v=BAjxn2US7J8](https://www.youtube.com/watch?v=BAjxn2US7J8)", "label": 1}
{"text": "If home owners insurance was only for completely catastrophic events then the premium would be lower.", "label": 1}
{"text": "The advice should be to raise your deductible to $15,000 then.   Having a $500 but never using it is a big waste of money.", "label": 1}
{"text": "What you're saying is backwards.  If you're *not supposed to* make a claim for something that's not catastrophic, then why would the insurance accept that claim to begin with?  And why are most people under the impression this is what insurance is for?  You're here blaming people for using insurance in a way that's marketed to them, and in a way that insurance companies themselves don't try to dissuade customers from doing.\n\n\nThis isn't people using insurance incorrectly.  It's a system that's designed to be confusing to customers, and designed to extract as much as possible whole providing as little value as possible.\n\n\nAs for the usefulness of insurance, your premise is wrong.  It's not meant to prevent catastrophic costs.  It's meant to smooth out costs (big or small) in a way that can be paid regularly.  Otherwise, there wouldn't be caps on benefits, and only the most catastrophic events would be covered.", "label": 1}
{"text": "Same city", "label": 1}
{"text": "It's a result of being a for-profit scam. Like a casino where the house always wins.", "label": 1}
{"text": "This is sort of an entitled response.. \"just pay the $15k out of pocket\". You do realize a LOT of people don't have $15k sitting around, right? I understand where you're coming from, the fear of being dropped by insurance in some areas can be a big one (like Florida as an example) but a blanket statement like that seems counter to the entire point of having insurance.\n\nLast year my basement flooded after my sump pump died overnight. I just happened to have a rider on my policy that specifically covered \"damage due to sump pump failure\" as floods and normal water damage usually aren't covered. The rider had a $10k limit, with a $500 deductible. Is your suggestion that I shouldn't have claimed this because \"things happen?\" Whats the point of having coverage if you never use it? I understand if it was say $2k-$3k in damage...it might not be worth the claim. But for $10k-$15k, I'd absolutely make a claim.", "label": 1}
{"text": "This submission has been temporarily locked for review due to a high volume of rule-breaking comments. Thank you in advance for your patience as we try to maintain a high-quality discussion. The original submission text is below.\n\n---\n\nWe had massive hail damage this year as well as water damage in the house due to an overflow in the bathroom. A couple years ago the pipe feeding the washing machine busted when we tried to loosen the hose on it. Insurance has sited these 3 things as why they are dropping us. No other carriers will take us on, we have tried all the major ones. We have a mortgage on our house that requires us to have insurance. We do not have the money to pay off the house (or we would have already paid it off obviously). We always make every payment on time though. What can we do???", "label": 1}
{"text": "Having the CPA who prepared your return involved can really help clarify things. They’ll know the details of your case and can guide you through the audit process. Definitely worth reaching out to them", "label": 1}
{"text": "What would happen if the truck got stolen? Would your insurance pay off the loan?", "label": 1}
{"text": "This 100%. Chinese restaurants have their shit together. \n\nPlace near me, I order food for 2, I don’t pause, they say something and 90% of the time I have no idea what was said.\n\nI get there and my food is tied nice and tightly in that thank you to go bag. They ask me if I want extra fortune cookies or whatever and I’m on my way.\n\nI order with the McDonald’s app. I get there and it’s a process to tell them I ordered with the app and then it takes them forever to find the code and then when I get my food it’s so sloshed around in the bag o might as well have ordered a burger and fries salad.", "label": 1}
{"text": "May I know your daily expenses and your current investment portfolio?", "label": 1}
{"text": "Invest in financial management and stop living paycheck to paycheck.", "label": 1}
{"text": "I think we would have more communication if you were interested in investing.", "label": 1}
{"text": "Yep. Linus over at LTT went off about this recently on their podcast.\n\nhttps://youtu.be/t1oFvndpW_o\n\nHe gets into it about 2:30 in.", "label": 1}
{"text": "I used to go weekly. \nNow it's been a year. \n\nI can't see paying $30 meal and $6 in tip for someone to carry a plate 30 feet.  Yeah I know all the dialogue about shitty wages and everything but fuck that.\n\nIt's not my job to pay the wait staff. I also do not approve of turning the wait staff into a performative function like a little dancing monkey trying to get pennies in the cup.  It's demeaning and biased to the best performers.\n\nI'm a guy so it's all about the flirty attitude and the bending over a little too much for the titty flash. I don't want a lap dance, I just want a cheeseburger with fries.\n\nI've been to restaurants in countries that do not tip. The dining experience was a welcome contrast. No one is trying to push me out of my $200 dinner at 38 minutes because of metrics.", "label": 1}
{"text": "Remember when Biden wanted more funding for IRS agents, and everyone said it was to go after wealthy tax dodgers. Guess what, it was actually to go after the little guy who can't afford litigation. I was down voted and mocked yet see this shit happen over and over again. Good luck with the bull, I had to put mine on credit cards. ", "label": 1}
{"text": "Yes. We cook great meals from scratch, so we know what we are eating. My niece worked years ago at an Italian restaurant  and she said therapy use out of 55 gal drums is disgusting. Butter substitutes, etc.\nWe visited daughter in central pa last month and went to one of the highest end rated restaurants in Hershey pa, a touristy \nTown due to hersheypark.\nThe veal chop dinner was $30. absolutely excellent dinner that would cost almost that amount to make at home.\n\nThat is what we try for when eating out. Not the $30 hamburger at sag harbor ny.  A dozen $30m yachts in the harbor!", "label": 1}
{"text": " > Ah, so your local area is so devoid of decent restaurants that what is left is basically on-par with national chains for value and quality.\n\nThat's not at all what I said in either of my  responses, but OK.", "label": 1}
{"text": "1. Have you been applying to literally any job in your area/remote or have you been picky? I work in software engineering and I've noticed a lot of laid-off tech employees are stupidly picky and apply to one job a week because they believe themselves to be superior for XYZ company or the company isn't \"their passion\".\n\n2. Wife should be working a job with opposite hours, you can watch the kids when she's working. That extra $400 would be easy.", "label": 1}
{"text": "YES roll into IRA", "label": 1}
{"text": "Onward Search is the one I am familiar with. You can also find contractor jobs on LinkedIn really easily with their filters. Just search for your role and filter to remote and contract.", "label": 1}
{"text": "success is hard, yes. you do your homework and the sooner you buy rentals the better.", "label": 1}
{"text": "Deposit 9k then 9k the next week then the balance in the 3rd week\nAny deposit of 10 in cash will be reported", "label": 1}
{"text": "What ? You have never seen this legendary episode of Hawaii Five-O where some character tells another to [\"Bing it\"](https://youtu.be/nfHuZ5qrYX4) ?", "label": 1}
{"text": "Use Claude AI. If you ask it this question but organized in detail it will give a complete run down and budget for free.", "label": 1}
{"text": "bing it, because googling it is the worst of the two megacorps!", "label": 1}
{"text": "Badda", "label": 1}
{"text": "Not a Doughboys fan I see", "label": 1}
{"text": "Leasing only makes sense if you are in a place financially where you are so well off, that you plan to rent new cars for the rest of your life.\n\nBecause that's what a lease is - you are RENTING a car, and paying the depreciation on it. Over and over and over. \n\nWhich the bonus is that you are always driving a nice new reliable vehicle, with the downside that you are renting a vehicle forever.\n\nIf that plays into your long term financial goal - then rent/lease. If you don't like the truth of that - buy.\n\n  \n170k combined is great, but to me that isn't \"rent a $50k vehicle\" great.", "label": 1}
{"text": "Balance transfer right now 100% if it’s available. You have plenty of time between now and your refinancing of your mortgage.  The 0% interest is a teaser where the credit card is betting that you won’t pay off the balance before the 0% period ends.\n\nTo save the greatest amount of money you need to use the Avalanche method and pay off the highest interest card first. Interest payments in the short term are inevitable and unavoidable. Unless of course you refinance to that 0% interest card. \n\nThen the combination of the payments you are currently making towards that 0% interest card will chop that debt quickly and significantly. [Can you transfer both?]\n\nI would use an app called Tiller that I believe will work with UK banks and currency.  Tell her works with Excel and with Google sheets.  It’s a monster for budgeting and debt management.  They have a great feature for mapping out your payments based upon what you can afford on a monthly basis. To pay down the debt, you may have to wrap your head around being comfortable with paying more than what you are currently doing.", "label": 1}
{"text": "Not that it matters, but June 17th 2022 was when CDC approved emergency access to the Pfizer vaccine for children aged less than 4.  Maybe this person had young kids and continued to mask until everyone in their family was safe?\n\nEither way you’re kinda telling on yourself by choosing that aspect of this person’s story to nitpick.", "label": 1}
{"text": "It's 10,000$ ...", "label": 1}
{"text": "Ask for a rent reduction and if they say no, move out and report your landlord for stealing power.", "label": 1}
{"text": "If you plan to stay under 10k miles a year - then does spending $20k across 3 years then having literally nothing to show for that money when the 3 years is up - when you turn the car in?", "label": 1}
{"text": "Ya he didn't have a will or an estate or anything.. he died in the hospital was brought back as braindead and then finally passed last year. I am the only one with the death certificate and dont even speak to my family They never even visited him and my one sibling didn't even go to the funeral. The other sibling was the one that said to just let him die already. It is all very fucked up. \n\nSo I'm assuming pa will give it to whoever claims it and it will be up to me to split it but that's just an assumption.", "label": 1}
{"text": "But okay thanks.", "label": 1}
{"text": "In fact, you should first know whether you are suitable for learning easy investing or more difficult? And then choose what to invest in", "label": 1}
{"text": "Just shut up and dont reach out to them.", "label": 1}
{"text": "Well idk I'm bad w money by myself and trying to make the right decisions. I don't see myself making the right decisions on my own. But we'll see, I guess.", "label": 1}
{"text": "Yeah, the initial file date was Sept 30, and then I sent in notarized documents about 3 weeks ago. I'm expecting it to be Thanksgiving or Christmas for it to come, honestly. But we shall see.. their automated thing says 2 to 3 months, would be awesome if it would be sooner!", "label": 1}
{"text": "I would sign a new lease with your landlord starting today and have the service turn back on in your name. When they try to bill a previous occupant, you are under no obligation to help them with any information and make sure your landlord knows why you're doing this.\n\nI currently have a bill with the utility company on a house that I only need the electricity on and they turned on both electricity and gas. The gas bill has run up $400 of usage even though not one thing is running and there's no leaks, because the lock is still in place on the meter. I'm literally taking them to court over the money because of principal and I can't stand them as they have done much worse to me in the past.", "label": 1}
{"text": "This will work  You are a new tenant at that house and you know nothing about that addresses previous two years tenancy.", "label": 1}
{"text": "This is some 'rest of the owl' shit right here", "label": 1}
{"text": "I’m paid twice a month lol", "label": 1}
{"text": "move before they figure it out", "label": 1}
{"text": "Pay it off. No question.  Esp at 10%!", "label": 1}
{"text": "I know how to manage my money and everything and where it needs to go and I am the queen of stretching a dollar but it's the fact that I am getting a large sum of money and don't want to spend frivolously bc I have a large sum of money. \nIsn't there someone who could help me with that? Or like a savings account I could put it into where I can't just take out of it as I please??", "label": 1}
{"text": "If a person has investments, they should  have to sell.them before getting assitance.", "label": 1}
{"text": "It's great that you want to learn more about how credit works! Paying your credit card bill before the end of the billing cycle can help keep your credit utilization low, which is good for your score. The key is to use the card for small, manageable purchases you can pay off each month. Paying before the due date doesn’t show your spending habits, but it can prevent high interest charges. It sounds complicated at first, but with some practice, it becomes second nature. If you're curious to explore financial literacy further and improve credit scores at your own pace, I've personally found the Arro Card quite helpful.", "label": 1}
{"text": "Personal attacks are not okay here. Please do not do this again.\n\n*If you have questions about this removal, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fpersonalfinance&subject=Removal%20help%20request&message=Hello%20moderators,%20<describe%20your%20issue%20here>.%20%0a%0a%0aMy%20submission:%20https://www.reddit.com/r/personalfinance/comments/1gf0yte/i_got_bullied_by_yall_into_a_cheaper_car/%0a).*", "label": 1}
{"text": "I guess they just weren't on your side.", "label": 1}
{"text": "Buy a house", "label": 1}
{"text": "Yeah unfortunately there are labs that are out of network with all insurance plans, and they incentivize ($) private practice doctors to send their samples there.\n\nIn the future, make sure that you request an in-network lab directly, and in writing.\n\nThe first steps would be to call your insurance company and request a review of the determination. Specifically see if you can appeal that an out-of-network lab be covered under your in-network benefits. There are several reasons why this could be done: like, perhaps the in-network labs did not offer the tests required, or that they would be able to offer them in a timely manner. You could also argue that you had no choice in which lab the sample was sent to.\n\nYou should also call the lab and see if they offer self-pay discounts.", "label": 1}
{"text": "Enroll at an elementary school in order to receive the free sex change operation. Then add an A to your name.  \n\n\nProblem solved.", "label": 1}
{"text": "A lot of people here are saying no, but think about this: what if they’re all wrong and you’re the smart one?! You never know! \n\nYou miss 100% of the shots you don’t take ", "label": 1}
{"text": "Truth bombs hurt.", "label": 1}
{"text": "No one is more corrupt than the utility companies. 15 years ago we went 2 years without a bill and then they turned our water off. The back pay equivalent was for $150 a month. They could not show us any data indicating usage of that extreme level and every subsequent month after our bill was under $30. Scam. Atlanta, if anyone cares to know. They got in trouble for this at some point in the last decade. Straight up fraud.", "label": 1}
{"text": "We need a healthcare system instead of a healthcare market.", "label": 1}
{"text": "Did you read the law? Of just this little misleading blurb? Read the law and get back to me.", "label": 1}
{"text": "Good?", "label": 1}
{"text": "This is great advice!", "label": 1}
{"text": "Making $80k is more than enough to buy a home...What are you smoking", "label": 1}
{"text": "YouTube or even ChatGPT has great info about budgeting. But first thing is you need to talk to your husband about what is he’s thoughts or plan.", "label": 1}
{"text": "Use tools to track your expenses flux-task.com can do that for you or just really any tool", "label": 1}
{"text": "Buy the bike and also get your emergency fund up to a few months of expenses.  The wall street types sometimes get a bad batch of coke and do a rug-pull.", "label": 1}
{"text": "Started learning about finance at 41. I feel you! I learned a ton from Tory Dunlap and Vivian Tu. Start with their podcasts and see if they’re a fit for you. I can’t recommend Tory’s class enough. It’s a really great community of women, many in the same boat as you and I, learning for the first time. Dunlap and Tu have very easy to understand/ no shame teaching styles. \n\nIf you do go with a financial advisor (which is what I first did before learning how to do this myself) you must make sure that they are a fiduciary. Flat out ask if they don’t tell you up front. That will ensure that they legally have YOUR best interest at heart. If they are not a fiduciary, they can steer you toward investments in which they get a kickback from the company and those may be lousy investments. \n\nIt’s intimidating. But, honestly once you start learning you’ll find that it’s actually quite simple. Finance professionals often over complicate explanations. \n\nYou got this!", "label": 1}
{"text": "Uh, yeah. Did you read the post? That \"financial educated husband\" is not an audacious pick for this particular circumstance. Even if he was, should he be her only resource?\n\n  \nNow I'm curious, why did \\_you\\_ comment here? She was clear about what she was asking from this community. Chances are she has a reason for posting, just as she'd have a reason for Googling this information (which she likely did).", "label": 1}
{"text": "Have you tried using a spending tracker? I built good discipline and better habits by tracking every dollar we spend on a daily basis and to build awareness of family finances. I use SpendCircle (on iPhone) for this. It costs only 2 dollars per year for the whole family (not $100 like other apps), so totally worth it.", "label": 1}
{"text": "Our finances are a 100% joint. We each spend on whatever we want, but we trust each other to make good choices. We have a view of our family spendings through an app called SpendCircle (on our iPhones). So it helps that we both have a continuous eye on our monthly outgo, and can make sensible choices (example: saying no to eating out and choosing to eat at home when we know we've spent too much on food already for the month).\n\n  \nThe app is only 2 bucks a year for my whole family (2 adults and 2 teens), so totally worth it and much better than the $100 or so that other apps charge.", "label": 1}
{"text": "File with your insurance.", "label": 1}
{"text": "$100k today seems fine but in 30 years that’ll have the same purchasing power that $40k does today. Your math needs to include annual increases in the withdrawal rate to keep up with inflation", "label": 1}
{"text": "You left out daycare costs", "label": 1}
{"text": "`I have read and understand the spreadsheet disclaimer.`", "label": 1}
{"text": "There's a few different categories covered by what you're asking.\n\nFirst is \"fund\" (probably meaning \"mutual fund\") vs. ETF.  Both are essentially ways to aggregate up more basic financial assets (stocks, bonds, etc.).  That aggregate becomes it's own financial asset that can be divided up into shares which get bought/sold.  The difference is in how those new shares get traded.  Mutual funds (an older product type) get priced at the end of each market trading day based on the value of the \"stuff\" it bundled up, and trades occur only at that time.  ETFs trade *during* the market day more-or-less the same as stocks.  This can cause the ETF's share value to drift from the underlying value (due to how buy/sell order requests are managed), but there are mechanisms to correct for that.  \n\nMutual funds can always be purchased in fractional share amounts.  So if you have $100 to invest and the fund is trading for $125, you get 0.8 of a share.  ETFs are usually only traded in full-share amounts, but some ETFs at some brokerages allow for fractional trading.  This difference also tends to mean that any \"automatic investment\" you want to set up (brokerage pulls in $X from your bank account on a defined schedule to buy selected funds) is only offered for mutual funds.  \n\nThen there are \"index\" funds.  This describes what goes into a given fund's basket of assets, and can be part of the design of either a mutual fund or ETF.  Following an index offloads a lot of the decisions that go into a managed fund (where a person picks stuff), making them a lower-cost product.  There are many indexes that can be used to design a mutual fund / ETF.  \"S&P 500\" is one, that's a collection of the 500 biggest US companies, and the holdings are weighted by company size.  Each brokerage can build their own version of a fund, and if two use the same index the overall performance of those will be identical.  Or close enough, one may use slightly different weightings of the holdings, another may charge more fees, etc.\n\nVTI is a \"Total Market Index\" ETF, intended to track the entire US stock market.  That means the stuff in its holdings is more than just the S&P, though given the size of those companies and weighting methods, the S&P is a really big chunk of that total market.  \n\nThose kind of things tie into the concept of \"diversification\".  Picking a single company stock expecting it to do well is risky.  Picking a bunch of companies (in different sectors, different sizes, even different companies) means that you have a better chance of your overall \"winners\" outweighing \"losers\".  Mutual funds (and later ETFs) are a way financial companies have offered to simplify that \"bunch of companies\" selections.  The more stuff covered within the fund, the more diversification you tend to have.  So by that standard, VTI is more diversified than something solely holding the S&P 500.  One of those non-S&P companies might end up being the next Apple or Amazon and get you good returns.  The drawback is that including \"bad\" companies acts as a drag against your returns vs. having something focused only on \"good\" companies.  But identifying good vs. bad ahead of time is practically impossible.  So you accept that lower net return in trade for (at least hopefully) more reliable growth.", "label": 1}
{"text": "Quiz your accountant.  When I worked for a sole proprietor he would bonus himself the business profits at the end of the year and at the beginning of the following year “loan” it to the business", "label": 1}
{"text": "I have money. I just don’t like paying taxes. I’m looking for different ideas to eliminate taxes. I’ve used all the most common ways…equipment, real estate and charity.", "label": 1}
{"text": "How are you getting poorer?  you continually reinvest in equipment or real estate that is creating a new revenue which is creating more profit. Anyways, have a good day.", "label": 1}
{"text": "There some dumb stuff: boat, RV, cars but that very minimal compared to reinvesting. \n\nI’m just trying to come up with different ideas to reinvest my money so I don’t pay taxes.", "label": 1}
{"text": "I know. I do have a CPA. Just seeing if anyone has any ideas.", "label": 1}
{"text": "Thanks! Now I need to fine a part time job with health insurance and without a prick boss ;)", "label": 1}
{"text": "Are you the human torch?", "label": 1}
{"text": "Can't believe I get this reference, but to be fair it was a bank loan", "label": 1}
{"text": "I'm a financial planner, but not your financial planner. I love doing these types of analysis!\n\nBased on what you've shared, it sounds like you're in a strong financial position with a high income, significant retirement savings, and minimal debt. It's awesome that your kids will graduate debt-free, and that you're planning to retire soon. But here's why you might still want to consider maintaining some life insurance coverage.\n\n1. Life Insurance Isn't Just About lncome Replacement Anymore\n\n Most people think of life insurance purely as a way to replace income, especially for those with dependents. But life insurance can also serve as a financial bridge for other things like ensuring your spouse has extra financial security or providing liquidity for any unexpected expenses. For example, if something happened to you right after retirement, your spouse would suddenly lose access to your work benefits (like employer-provided life insurance) and the income you're used to making together. This could be a big shock financially, even with savings.\n\n2. Protecting Against Market Volatility in Retirement\n\nWhen you retire, you'll likely start drawing on your 401(k) and other investments. If the market takes a downturn just as you start retirement (think 2008 or 2020), withdrawing from those accounts could deplete your savings faster than expected. Life insurance can act as a safety net, covering any immediate needs without having to dip into investments during a bad market. Essentially, it can help you manage risk and preserve your retirement assets.\n\n3. Long-Term Care Costs and Health-Related Expenses\n\nHealth and long-term care expenses are one of the biggest financial risks retirees face. Life insurance with a long-term care or chronic illness rider can provide funds for care, taking the burden off your spouse or family if you need support later. Having a small policy could allow you to avoid tapping into your main savings or retirement funds if unexpected health costs come up.\n\n4. Leaving a Legacy or Financial Cushion for Your Spouse\n\nWhile your kids are nearly independent, your spouse may still benefit from a financial cushion in case of an untimely death, especially in early retirement. Even if you have substantial retirement savings, a small policy can cover final expenses, remaining mortgage payments, and ensure your spouse isn't forced to make difficult financial choices too soon after losing a partner.\n\nSo, are you 'crazy\" to extend your policy? Not at all! Life insurance at this stage can provide flexibility, protection against risks, and peace of mind as you enter retirement. Even a modest amount can make a big difference, not just for income replacement, but for many of the other challenges retirees face. Consider a smaller, affordable policy, or look into options that provide living benefits like a chronic illness rider. That way, you're protecting your spouse and retirement assets without over-insuring or Over-spending.\n\nOh and don't do term policies ever unless you are early in getting life insurance and are just trying to save your health rating. Only the life insurance companies \"win\" when people but term. Less than 2% of term policies pay.", "label": 1}
{"text": "No", "label": 1}
{"text": "Bro they are doing you a favour. Youre not going to get a lower insurance and you shouldnt. Youve proven that youre a liability. Everytime you pay fing 480 a month for insurance you should look in the mirror and tell yourself to be better", "label": 1}
{"text": "Why do people just want to stay broke their entire life 🤦🏻‍♂️", "label": 1}
{"text": "I'm curious, how would you consider this ChatGPT advice?\n\n---\n\nThis couple has a solid income baseline of $4,500 per month, which is sufficient for a monthly mortgage of $1,500. With their $300,000 in savings and a desire for long-term security, here are some ways they could approach a home purchase:\n\n1. Calculate Affordability Range Based on Payment Goals\nAiming for a $1,500 monthly mortgage payment allows for a loan amount around $225,000–$250,000. This amount assumes a 30-year fixed mortgage at a 7% interest rate (as of recent averages). However, rates vary, so checking current options could yield different results.\nAdding a down payment would increase their purchasing power, potentially allowing them to buy a home in the $275,000–$300,000 range while keeping monthly payments manageable.\n2. Consider Down Payment Amounts\n3.5% Down (FHA Loan): This keeps more cash on hand for emergencies or investments, requiring only about $10,500 on a $300,000 home. The tradeoff, however, is higher monthly payments and added mortgage insurance premiums, which can make budgeting tighter in the long run.\n20% Down (Conventional Loan): A 20% down payment eliminates mortgage insurance, reduces monthly costs, and increases equity, which can be a comfort at retirement age. This would require around $60,000 on a $300,000 home, leaving them with a solid $240,000 cushion.\nHigher Down Payment (30% or More): They might consider increasing the down payment to reduce monthly mortgage costs further. For example, a $90,000 down payment (30%) brings the loan down to $210,000, potentially lowering monthly payments below $1,500 and accelerating their timeline to be mortgage-free.\n3. Emergency Fund & Remaining Savings\nIt’s essential to leave sufficient funds for emergencies, ideally maintaining $100,000–$150,000 in savings. This provides a buffer for unexpected expenses or if their income decreases.\n4. Mortgage Term & Interest Rates\nThey could consider a 15- or 20-year mortgage, which would increase the monthly payments but allow them to pay off the home sooner. However, if maximizing monthly cash flow is more important, a 30-year mortgage with prepayments when possible is a flexible choice.\n5. Loan Qualification & Stability Concerns\nGiven the goal of stability, going for a conventional loan with a significant down payment, such as 20%, could help them secure lower payments while maintaining liquidity. Buying a modest home they can comfortably afford at $275,000–$300,000 with 20% down would align with their goals and allow for flexibility with their monthly income.\nIn summary:\n\nHome Price Range: $275,000–$300,000.\nDown Payment: 20% ($55,000–$60,000).\nRemaining Savings: Approximately $240,000, ensuring a strong safety net.\nMortgage Goal: Keep the payment close to $1,500 with a 30-year loan, and make extra payments when possible to achieve their goal of financial security in retirement.", "label": 1}
{"text": "Happiness is a necessity.", "label": 1}
{"text": "Yeah, the only reasonable way IMO to own used cars in that situation is to have the time, ability, knowledge, tools, and desire to do your own work. It's the only way I can think of to be able to bring the cost of repairs down (by basically making the labor \"free\" and eliminating any part markup, to a certain extent).\n\n\nEven if you have to buy tools, the tools plus the parts will commonly be less than the cost of paying someone else to do it even once, and you can use the tools again and again.\n\n\nBut you also have to have a place to do it, time to do it (tough with a full time job and if it's your only car) and some amount of mechanical aptitude. But if you've got all that and are willing to learn, YouTube and the web has made troubleshooting, maintaining, and repairing cars yourself way easier to learn than in the in the past, even on modern cars.\n\n\nIt's just not an option for everyone, and can be a good reason to buy new or certified used with a warranty.", "label": 1}
{"text": "Hello sorry for that I can help you with that because I am looking for someone who has a credit card which has some debt in it that not yet paid. I work as a freelance job and get paid using the credit cards. I was looking for someone whom I can use his/her credit card to receive my payment through there and in the process I can help you clear your debt on your credit gradually by giving you some commission depending on the number of times I am going to receive my payments through your card and in the process I will boost your credit card limit. Inform me when in need the help with that I am ready and here everyone will benefit because I will be able to receive my payment and you will be to clear your debt.", "label": 1}
{"text": "Work more.", "label": 1}
{"text": "Great user name", "label": 1}
{"text": "How did 1 more year of college cost you 40k. You can literally get a nursing degree online minus clinical time for a fraction of that at this point.", "label": 1}
{"text": "living expenses on campus?", "label": 1}
{"text": "Fire that advisor", "label": 1}
{"text": "That’s amazing news about your grandma’s generous gift. I can relate to feeling overwhelmed when managing student loans. I was also unsure about my next steps when I received some help. Focusing on the loans with the highest interest rates is a smart approach. \n\nAs for depositing the check, you can put it in your checking account and then decide how much to pay towards your loans. It's great to prioritize your financial health. I recommend keeping track of any tax implications you might need to consider. Just take it step by step, and you'll find your way. Good luck!", "label": 1}
{"text": "> My goal is to get rid of debt in 2-3 months.\n\n> I make about 1760 every two weeks\n\n1760 * 6 = 10560$\n\n> Car payment 318 Car insurance 260 (cheapest I found for my driving record) Phone bill 210 (I have 3 devices) Gas and Toll for work gets me about 340\n\n1128 * 3 = 3384\n\n10560 - 3384 = 7176\n\nIf you live like a monk for 3 months and you eat at home spending 0 you can do it according to your numbers.\n\n> I'm getting myself in more debt\n\nWhy?\n\nYou're earning 3520/month and you have 1128/month in expenses.\n\nMake a budget. You saying this tells us you don't have a budget.\n\nSpend nothing outside of getting you to work.\n\nEvery dollars on your debt.\n\nYou will be done in 3-5 months depending on how aggressive you want to be.", "label": 1}
{"text": "Nice troll.\n\nI gave you a great answer 4 months ago : \n\nhttps://www.reddit.com/r/personalfinance/comments/1gghnsw/how_to_get_rid_of_my_6k_credit_card_debt/", "label": 1}
{"text": ">America is royally fucked if a HR department can just chose not to process an employee request without recourse\n\n\nI have a hard time believing it was a conscious *choice* to not process something submitted by an employee.  \n\n\nMistakes happen. \n\n\nJust like in every other job function in the entire world. ", "label": 1}
{"text": "right? I'm fully aware it's our issue for not realizing the mistake for so long, but it sure sucks that the company making the mistake IN THE FIRST PLACE just floats.", "label": 1}
{"text": "I had a client who spent a summer working with Northwestern Mutual. She bought a WL policy for herself when she was single and in her 20’s. I met her when she was in her 40s and was a high level executive in NYC for a large securities and investments firm which everyone knows. She loved having bought her policy and said to me “I wish I had got a larger policy”. \n\nSo, you don’t know how people look at their finances and what’s going on in their heads. Which is why a good advisor asks questions, listens, explains and shares pros and cons and tries to get the client to think about the future.", "label": 1}
{"text": "I wouldn't say that they \"chose\" not to do it. I work for a large financial institution. In doing so, I have learned to assume that most people do not have a proper grasp of how to do their jobs, until I am proven otherwise. The amount of following up that I have to do on a daily basis...sheesh.", "label": 1}
{"text": "Yes and compensation is in order when mistakes result in a financial loss.", "label": 1}
{"text": "Yeah, absolutely. Sorry you have had to experience this. Shocking that the employer won’t rectify this too. I guess it says a lot about how much they care?", "label": 1}
{"text": "“Biotech software startup”\n\nNone of those words should imply that this company is traditional, stable, or even dependable.", "label": 1}
{"text": "I’ve been in a similar situation with balancing mortgages and rates, and it can be tricky. I ended up prioritizing keeping lower-rate debts and using cash to reduce the higher ones, especially if other expenses were minimal. Navigating those choices and weighing the early payoff vs. letting the CD mature helped me stay on track with my own goals. Sometimes, just reducing what feels like a larger burden can bring peace of mind, and the rates certainly make a difference in deciding which debt to tackle first.", "label": 1}
{"text": "I agree with this for sure.", "label": 1}
{"text": "Yeah, I work in a multinational myself and hate chasing people but it’s part and parcel with collaboration and knowledge sharing.\n\nAs is compensation when a company does not meet their end of any formal or even informal agreement. \n\nThey may not have chose to make a mistake but equally are unwilling to rectify it. It’s wrong", "label": 1}
{"text": "Maybe in your mind but any company hiring people is stable enough to hire in the first place. They should also be stable enough to meet their obligations", "label": 1}
{"text": "One question: the $230/mo represents what % of your gross income? That is a question which NO ONE here who is giving you advice has asked (which means that most people posting don’t know much about financial advising)", "label": 1}
{"text": "you're not wrong! doesn't change the fact that they're still required to follow the law, and I'm just trying to figure out what exactly that is in this case.", "label": 1}
{"text": "How do you know the kid isn't a trust fund baby sitting on 25 milly?\n\nMight actually need a FA in that case. Also might want whole life as a tax shelter in that case as well.", "label": 1}
{"text": "thanks for being kind. everyone makes mistakes (obviously including my husband and myself!) but it always goes such a long way when the erring party makes a genuine effort to rectify it.", "label": 1}
{"text": "A) No one needs a $20k funeral\n\nB) Most people have some sort of assets so their estate can cover their funeral.  If you don't have a net worth of a few grand to cover your funeral, you can't afford insurance anyway.  You're better off saving that money and being buried in a pauper's grave if it comes to that.", "label": 1}
{"text": "You're awesome. Just calculate the interest saved.", "label": 1}
{"text": "Yes Sir. One of my kinks is being yelled at, can you tell me something I know again... louder this time", "label": 1}
{"text": "Only consider term life insurance, any sales pitch that talks about the investment benefits is because the agent wants a fat commission. You are better off to invest directly in the stock market via index funds and buying term insurance than doing whole or variable life insurance. \n\nYou’re young and presumably healthy. You can get a 30 year term life policy for very little money. In 10 years a 20 year policy will be substantially more expensive. If you get any long term illness, you’re uninsurable.", "label": 1}
{"text": "The difference in \"maintenance costs\" is **so** low between a 3 year old car and a new car.  It's not like he's looking to buy a 20-year-old beater.  Modern cars can easily get to 200k miles with just routine maintenance and some basic repairs here and there.  This isn't something that's going to be costing him $5k/year in maintenance just to keep it alive.", "label": 1}
{"text": "Snow damage is going to happen to a new car or a used car, though.  All the accidents you got in will happen to a new or used car based on the driver, unless you're saying it was shit like your brakes failing constantly.\n\nOf course things can happen to damage a car that may cause it to need a repair.  But in general, modern cars will easily run over 10 years with routine maintenance.\n\nWe don't know the model but OP says it's the same model, just the slighter newer version.  Unless there were major upgrades in the past few years they're going to be very similar.\n\nAnd used cars these days almost always come with CarFax reports showing it's repair and maintenance schedule.  You're right that OP didn't mention it, but if it had a significantly bad history in the past three years you'd think he would've said something about that.  \n\nFrom everything he's said, it sounds like two extremely similar cars, one just a bit newer, so it's up to him if that's worth $7k or not.  But unless he drives cars into the ground, his maintenance costs will likely be the same either way.", "label": 1}
{"text": "Lower rent, raise income", "label": 1}
{"text": "Because you get a new car for only 7K difference?!?!🙄", "label": 1}
{"text": "Just wait until you start making more money, you're going to long for the days where they only took $100.  I lose nearly $2K per check to taxes.....", "label": 1}
{"text": "I mean it seems like you made one bad purchasing decision and now think all used cars are \"lemons\".  Sure some can be.  Brand new cars can be lemons.  You just have to do your research, look at the CarFax, and have a mechanic check it out if needed.  OP said absolutely nothing to indicate there's anything wrong with the used car.\n\n> Okay what if I already have 20k in savings while still saving 10% of my income every month post purchase?\n\nI have well over $20k in savings and save well over 10% of my income every month, and I still think $7k is a lot of money.  There's a lot else I could do with that.  A bathroom remodel.  Replace multiple home appliances.  A very nice vacation.  Depending on OP's age, you invest the payment difference for retirement and he could literally retire a year earlier- if he's 30 that amount invest for 30 years will be $65k, which most people could live for a year on in retirement.\n\nSome people don't think of money like that and are like \"Oh it's only an extra $115/mo, no biggie!\"  But when you add it all up it's a decent amount of money you could be doing a lot of other things with.  Is having a model 3 years newer worth more than a nice vacation, or small bathroom remodel, or extra year of retirement?  That's up to OP.  But it's not nothing.", "label": 1}
{"text": "or they bought the home 40 years ago for 5000 usd", "label": 1}
{"text": "You're assuming the useful life of a car is 10 years.  These days with proper maintenance you can easily get 15 years out of a car, unless you drive it really hard.  \n\nSo if he buys a new car, he'll get 10 years then trade it in when it has 5 useful years left.\n\nIf he buys a used car, he'll get 10 years then trade it in when it was 2 useful years left. \n\nEither way, he got rid of it before its useful life was over, and it started needing major repairs.  Could he maybe get a bit more for a 10 year old car than a 13 year old car when he trades it in, sure, so factor that in.\n\nIt depends on this model of car (is it one that's known to have a lot of problems that crop up after a few years?), how long OP likes to keep cars, what else OP would do with the $7k, etc.  It's a personal decision.  But he's only going to \"get three more years out of the new car\" if he drives cars until the end of their useful life.", "label": 1}
{"text": "lol what?  I'm assuming the 3 year old car will always stay 3 years older than the new car, because that's how basic math works.\n\nLike I said, modern cars last a very long time with basic maintenance and repairs here and there.  Cars generally don't break down between 10 and 13 years, so there's not much difference.  If he wants to drive a car into the ground, sure he'll get more years out of the new car.  If he's going to trade it in within 10 years, both cars will very likely last that long without anything major going wrong.  Because yes, cars can generally last 13years without any major issues if they are maintained.\n\nOf course there are variables, like what model it is, and how much OP drives, and exactly how often he gets new cars.  It's a personal decision.  But it's unlikely the used car will have significantly more maintenance costs.", "label": 1}
{"text": "Rats, I was 16 at the time and should have bought a 4 bedroom 2 bath house in a California beach community for that with my single minimum wage salary at $3.75.", "label": 1}
{"text": "Oh wow. I just read a paper from an ex-coworker turned financial advisor, and I couldn't figure out where he got 17.6% return from a 15% discount, and you just made me realize it's because a 15% discount means the non-discounted price is 17.6% higher than the discounted price (1/0.85).\n\n\nI also couldn't figure out how that return every 6 months (at our company) amounted to 35.2% per year, but it's because I was thinking about it being the same original money every 6 months. If I think about the discounted purchase price being the same chunk of money each offering period, then I understand how it's 35.2% per year return (no delay in selling once the stock is acquired).", "label": 1}
{"text": "Yes, and as I said, OP can decide what he wants to do most for $7k.  You had a bad experience with a previous car, so to you personally buying new cars is very important and worth the extra money.  No one said \"he absolutely under no circumstance should buy the new car\".  I said it's a personal choice, but saying \"Oh it's only $7k, who cares!\" ignores all the other things one could do with $7k.", "label": 1}
{"text": "All by design.", "label": 1}
{"text": "I think people still think of Don Drapers house in Mad Men when they think 40 years ago 🫠", "label": 1}
{"text": "OP is giving you a completely hypothetical scenario if you didn’t pick that up\n\nSerious note, I live in rural IL and decent 2bd 2ba houses can be had for $170k", "label": 1}
{"text": ">!hyperbole-exaggerated statements or claims not meant to be taken literally!<", "label": 1}
{"text": "Yes, it was a joke. I am not pulling up real estate prices on different US regions by date lol\n\n1984 homes in affluent areas were expensive same as always.\n\n2008 homes in shitty/normal  areas were dirt cheap almost everywhere.\n\nTown homes near ATL metro could be bought for 20k-30k. Those same tiny town homes for 20k were selling for almost 300k 2020-2023.\n\nAverage mortgage from an average home near me went from $800 USD to 3k USD in about 10-14 years.", "label": 1}
{"text": "And wages were vastly lower back then.", "label": 1}
{"text": "35 years ago my dad made as much as I do now. He bought a home for 1.5 years wages around that median price. If I bought a house for the median price (according to Redfin) now it would be 7.33 years wages. If I made enough for it to be 1.5 years wages I would make $293k.", "label": 1}
{"text": "I'm looking at homes reaching from 150-200 in a 45 minute bubble from Kansas City. Granted they're in less desirable places or in extremely rural areas, but they do exist.", "label": 1}
{"text": "1976, $17,750. Todays tax estimate $243,500.  I feel for you kids.", "label": 1}
{"text": "Dollar had a lot more value then though.", "label": 1}
{"text": "That's the neat part, you don't.", "label": 1}
{"text": "Back when 1 income families were the norm. Now it is 2, and the market has adjusted.", "label": 1}
{"text": "Well here is what you are thinking, if you’re taking out a personal loan with an interest rate of, say, 10%, your investment would need to consistently yield more than that just to break even—most investments don’t guarantee a return that high. Plus, if the market dips, you could end up paying off the loan without any gains.\n\nSome people look at safer, lower-risk institutions like mutual funds or high-yield savings, but these often yield around 3-5%, which may not cover loan interest. I’d suggest only using a loan if the returns are highly secure and the risk is minimal. Money Lender Squad has info on loan options if you’re considering a backup plan or need to see the costs of borrowing. Just weigh it carefully.", "label": 1}
{"text": "40 years ago, my father had a job offer in San Francisco. He turned it down because SF was too expensive. Some things never change.", "label": 1}
{"text": "God, what an idiot!", "label": 1}
{"text": "You are on r/personalfinance What I see is that you can't afford the used 30k car as you can't pay cash for it. What makes you believe you can afford a 40% more expensive car? These types of decisions are one of the reasons people can't get ahead with their finances. They are not aware what kind of money drain new cars and car payments are.", "label": 1}
{"text": "If your dad made as much 35 years ago as you make now then he was most likely absolutely loaded.", "label": 1}
{"text": "My parents bought their first house in 1967 for $9k.", "label": 1}
{"text": "Yep, doesn’t matter if the median wage was $0.25 an hour, if a house cost 5k that’s still cheaper relative to the median wage today ", "label": 1}
{"text": "What is the FMV. Your tax liability may be much larger than the cost to exercise. Is the FMV is below the exercise price then that’s not a good sign.", "label": 1}
{"text": "What makes me think I can afford it? My wife and I bringing in 250k a year. I'm sorry if you don't believe in buying anything without cash, but there's no need to be a condescending asshole about it. I'm doing *just fine*.", "label": 1}
{"text": "There are some houses for $17k. Not any that you'd like to own or in places you'd like to live but they exist.", "label": 1}
{"text": "Your annual taxes vary by model year? My state is just a flat fee for any 2-axle vehicle, it doesn't matter what year. ", "label": 1}
{"text": "Start listening to Dave Ramsey. You need him in your life", "label": 1}
{"text": "You might make $250k but there seems to be nothing left over. What sane person would take a 6-7% car loan out if they could pay cash? YOU asked for other considerations. YOU got my answer. There is nothing condescending about this. If you would have the cash you wouldn’t have asked this question. Stop lying to yourself.", "label": 1}
{"text": "A couple of suggestions, ask for itemized bills.  Ask to speak to a social worker who might be able to find you resources to help pay.", "label": 1}
{"text": "All adults need their own health insurance.", "label": 1}
{"text": "What a super helpful comment that completely ignores the point of this post. So glad you're here to shed a light on the obvious.", "label": 1}
{"text": "Step one: When you receive the bill, try not to cry\n\n\nStep two: cry a lot. ", "label": 1}
{"text": "The 409a FMV could be a good estimate if your company is struggling to get a new funding round - it’s what I use to understand what we could be purchased at by private equity when we can’t get funding and we’re shit out of luck.", "label": 1}
{"text": "It saddens me whenever I see a post that has \"no insurance\" in the title.\n\nA lesson to others...", "label": 1}
{"text": "Or as in this case, can't afford not to have it.", "label": 1}
{"text": "Who’s going to pay for it? You?", "label": 1}
{"text": "You are right but it's also a wicked game of musical chairs at this point in time and the system keeps taking away more and more chairs.", "label": 1}
{"text": "You don’t. You’re not married and you have zero obligations", "label": 1}
{"text": "If you see someone in their 30s who seems to have achieved some modicum of financial stability (and they didn't inherit their wealth) then their sacrifices and smart decisions almost certainly started in their 20s. The *shortest* timeline someone should be looking at when it comes to building wealth is a decade. 2 decades if you also have children.", "label": 1}
{"text": "All good points, its takes a lot of sacrifice, something alot of people(me included) are disinclined to do. But you get out what you put in or so the saying goes", "label": 1}
{"text": "its designed like this on purpose, unless you get a good windfall from inheritance/settlement or strike it lucky with a viral music video/product the average person is struggling to buy a home even on two incomes", "label": 1}
{"text": "Try wells Fargo", "label": 1}
{"text": "OP needs to just look at the registration records and see when the car was actually first sold.  You can buy a 2025 model right now, so a 2023 model might be over 24 months on the road by now.  that certainly changes the usage.  23K in one year is a lot.  23K in 2 years is right in the average range.", "label": 1}
{"text": "Your new teeth will give you the confidence to do so much more in your life.  Set up a gofundme and spread the word on social media. Be very open and honest and share your dental history/journey. Share everything with your new followers. You'd be surprised how many people will support your journey.  If 23k people gave you a dollar you'd be on your way.  Or Maybe a dentist will take you on for free.  You can be an inspiration to someone in your position.  You can really turn this into something.  Next thing you know Crest will be paying you to sponsor their products. :)", "label": 1}
{"text": "She should be able to get ACA insurance. Depending on where you live, the policies that are offered may not be very helpful, but it's worth checking into. \n\nIf you're in a Medicaid expansion state, she may have to reduce her working hours to the point where her income is low enough to qualify for Medicaid. (I think the cutoff is around $17,000.) This is probably the best route if she has ongoing, expensive healthcare problems. It is obviously illegal but she may have to pick up some cash jobs like cleaning, babysitting or taking care of an elderly person to make ends meet while maintaining her Medicaid eligibility.", "label": 1}
{"text": "I signed up with Mariner in June '24 to manage half of my investment total... So, they were given \\~$2M and I managed slightly over $2M.    I was fine with paying the 1% since if they managed the money well, the fees were not significant if they met their expected returns..   I also liked their tax planning, estate planning(I retire in a couple of years).  I am not pleased with their options trading as the returns are measly.. I emailed my rep and he responded immediately and scheduled a review right away.  They asked to revisit it at the 6 month window and they can adjust how they invest.  Overall, I am lukewarm on my experience because of the lack of returns but it has only  been 6 months.", "label": 1}
{"text": "Sorry boss. Was just having fun. Won't happen again.", "label": 1}
{"text": "do you like sea shanty's?", "label": 1}
{"text": "Buy SPY and forget you have it.", "label": 1}
{"text": "I've been testing Copilot for a while. I dig some parts of it, but I found it really challenging to actually segment and view my spend. What are your thoughts?", "label": 1}
{"text": "A mix of stocks and HYSA.", "label": 1}
{"text": "Came here to say this and wow u/Here4Snow that was so condescending. I'm also in an OPS \"temp\" position that the organization could not live without, and that has been a position here since the center started. This is the new move for gov't and university jobs, to hire endless OPS folks so they don't have to pay for benefits. It's awful. I'm worried about what happens when I try to collect Social Security and I have years and years of not \"contributing\" because I was on my own as a \"temporary\" worker. I wish they'd regulate it.", "label": 1}
{"text": "That's not actually true.\n\nWhen you are married, under ERISA federal law, your spouse has an implied right to one half of the marital portion.\n\nThere are laws about bypassing the spousal authorization in cases of domestic abuse, but it is flatly incorrect to say \"It's your 401k\"\n\nWhen you are married, it is by law \"our 401k\"", "label": 1}
{"text": "It doesn’t penalize you, buddy. You can still invest and save and will gain access to the very same catch up contributions. JFK, some people love to be awful and find wrong in everything. That’s YOU.", "label": 1}
{"text": "While I agree that if you can’t afford closing costs, you can’t afford to buy that home. I highly suggest going for a house that is in more in line with what you can actually afford. There are so many costs when purchasing a home. \n\nOwning a house that you live is always going to be a liability on your balance sheet with many unforeseen costs, including property tax, insurance, INSPECTION, etc etc. \n\nHere are a few ideas that might help:\n\n\t1.\tPersonal Loan: Have you considered a personal loan? If you have good credit, you might get a decent rate, and it could cover the immediate need.\n\t2.\tFriends or Family: I know it’s not easy, but maybe reaching out to family or close friends for a short-term loan could be an option, especially if you have a clear plan for paying it back.\n\t3.\tEmployer Help: Some employers offer programs or advances for housing needs, so it might be worth asking if that’s available.\n\t4.\tCredit Card: While it’s not ideal due to interest, using a credit card for part of the closing costs could work if you’re able to pay it down quickly.\n\t5.\tLocal Assistance Programs: A lot of cities and states offer grants or low-interest loans for first-time homebuyers. Checking into those could be worth a shot.\n\t6.\tSide Gig: If you have some extra time, picking up a temporary side job or freelance work could help you make up the difference.\n\t7.\tLease Extension: If all else fails, maybe talking to your landlord about a short lease extension could buy you some time to save or explore financing options.\n\t8.\t401(k) Loan: If you have a 401(k), you might be able to borrow from it without penalties, though there could be interest. Just check with your plan administrator.\n\nI hope some of these ideas help! Let me know how it goes.", "label": 1}
{"text": "It's obvious you are a classist ageist.", "label": 1}
{"text": "no, i am in fact the opposite. the current system is ageist. young people have a contribution penalty.", "label": 1}
{"text": "r/CarNegotiation also has a collection of useful information about buying a car and saving money or even how to estimate how much you should spend on a car, I'd also recommend these posts for the inexperienced.\n\nFirst Time Buyers Guide: [https://www.reddit.com/r/CarNegotiation/comments/1geeur3/first\\_time\\_car\\_buyers\\_read\\_this/](https://www.reddit.com/r/CarNegotiation/comments/1geeur3/first_time_car_buyers_read_this/)\n\nExpected Taxes & Fees by State:  \n[https://docs.google.com/spreadsheets/d/e/2PACX-1vRheS7-XUaiU6LR2qHMcGGxJS-ODMFoz1cmf1uWfMTtEw9ZpeAUmqxdzE25WSxbrxB01HlucvAGpua7/pubhtml](https://docs.google.com/spreadsheets/d/e/2PACX-1vRheS7-XUaiU6LR2qHMcGGxJS-ODMFoz1cmf1uWfMTtEw9ZpeAUmqxdzE25WSxbrxB01HlucvAGpua7/pubhtml)\n\nBrand Discount Likelyhood:  \n[https://docs.google.com/spreadsheets/d/e/2PACX-1vTsrc03sz\\_cEDwthGBc4xAZgPSVNDDVA8XBpRGI-XlsZ6oWA4qJdx5BnjJaiMi9CwZK8\\_kbTRSxmn0y/pubhtml](https://docs.google.com/spreadsheets/d/e/2PACX-1vTsrc03sz_cEDwthGBc4xAZgPSVNDDVA8XBpRGI-XlsZ6oWA4qJdx5BnjJaiMi9CwZK8_kbTRSxmn0y/pubhtml)\n\nLeasing vs Finance:  \n[https://www.reddit.com/r/CarNegotiation/comments/1gf5lgg/leasing\\_vs\\_finance\\_guide\\_pros\\_cons/](https://www.reddit.com/r/CarNegotiation/comments/1gf5lgg/leasing_vs_finance_guide_pros_cons/)\n\nIf anybody has any other questions about personal financed related to automotive, feel free to post on r/CarNegotiation", "label": 1}
{"text": "Since you are paranoid, you should move all your funds to cash so your savings won't plummit to $0 during the blackout period.", "label": 1}
{"text": "Yes, but I suspect it will be found that most of it was from the boat anchor who left.", "label": 1}
{"text": "Sounds like you might consider selling the cars instead.", "label": 1}
{"text": "There is nothing in this world preventing you from contributing to another retirement product if you feel like your main account isn't enough. Hell take advantage of an HSA even if you're young. It IS triple tax advantaged.", "label": 1}
{"text": "or complete opposite", "label": 1}
{"text": "Delete your life 😂😞", "label": 1}
{"text": "It always is", "label": 1}
{"text": "If you’re living on campus just sell weed", "label": 1}
{"text": "Are you an attractive woman? You have options that men don't, like them or not.", "label": 1}
{"text": "Or maybe he left because she's the boat anchor that didn't know how to stop using her CC's", "label": 1}
{"text": "Why do you assume OP is a her?", "label": 1}
{"text": "You can do it! Find a healthy community with succesful people that love you ❤️", "label": 1}
{"text": "Pretty sure this is the number one killer of long term relationships right here.", "label": 1}
{"text": "Because it's the normal thing to assume.", "label": 1}
{"text": "Except when it’s not.", "label": 1}
{"text": "Yes.", "label": 1}
{"text": "It’s less than a dollar.   I can’t believe you’re asking this question.", "label": 1}
{"text": "Lol", "label": 1}
{"text": "OP refers to their partner as 'he'. Most relationships are still hetero so via probability, it's likely a woman, even if I'd agree with you it's better not to assume.", "label": 1}
{"text": "I am going to post high quality and on-topic comments on this sub for now on because you didn't remove my comment or ban me and I am completely serious.", "label": 1}
{"text": "Max out rest of CCs to fix house.  Then file bankruptcy", "label": 1}
{"text": "You originally said “very well funded” which could mean different things to different people.", "label": 1}
{"text": "I suppose it is reasonable for someone to have such a high standard of “very well funded retirement” that it can be reasonable for them not to have met that amount yet and also to donate $100 a month.", "label": 1}
{"text": "OP likely grosses around $60k/year, they're unlikely to qualify for Ch7 bankruptcy that will \"get rid of their debt\".  They'd just get a court-ordered structured payment plan to pay off the debt.  \n\nThey'd be better off trying to get a lower rate on the CC debt themselves.  Possibly pay it off with a HELOC, which would have a lower interest rate and monthly payment.  Or- IF they could qualify, which is probably unlikely- get a new card with a low introductory rate on balance transfers.  Or, probably most reasonably, call the credit card company and negotiate- often they will work with you to lower the rate, put you on a payment plan, and cut off your credit line.\n\nThis really isn't \"bankruptcy\" territory... yes it's an *insane* amount of credit card debt but if OP can restructure it and get the monthly payment down they can keep their head above water, at least long enough for them to make other decisions like selling the house and finding something cheaper.", "label": 1}
{"text": "She's not even close to bankrupt.  Negotiate with the CC company and get put on a 5-year pymt plan with a payment of <$1k/mo, that leaves her $1200/mo to cover expenses outside the mortgage & CC pymts.  She won't be able to save much for a few years but she'll be fine.  Adding a roommate for a few hundred in income each month and she'd be better than fine.", "label": 1}
{"text": "Damn houses by me are 800k plus", "label": 1}
{"text": "Here's some real numbers for you to work with:\n\n\nI bought my first house for $321,000. I put down 10% and had an extra $10k set aside for emergencies. It's a new build and the builder had a bunch of insentives, one of which got my rate down to 4.99% when rates at the time were over 7%. My mortgage insurance is roughly ~$100/mo and I have a $75/mo HOA fee. My mortgage including property taxes is right under $2400/mo\n\n\nI know people say to avoid new builds but my house came with a 1 year warranty that covers everything except paint, 2 year warranty that covers electric and plumbing, and 10 warranty that covers the foundation. Those incentives added up to roughly $20k and if it weren't for those, I'd have kept saving for another year to get that 20% down payment.\n\n\nHope this helps. Good luck", "label": 1}
{"text": "wtf you are 30 living in house of your daddy and he is bad with money??? 😂😂😂at your age he probably already has a house , he is retired and wanted to enjoy his money the rest of his life….move that ass from his house 😂😂😂😂", "label": 1}
{"text": "Maybe OP is honorable.", "label": 1}
{"text": "You are flirting with fraud there. If the judge sees the charges not as necessities they may not be discharged, or your whole bankruptcy denied.", "label": 1}
{"text": "fraud.  send this bitch to prison.  get it in the news papers as well.  she psycho", "label": 1}
{"text": "Dude, she robbed you, stop being a pussy", "label": 1}
{"text": "All these comments suck. Just take the L and move on for the sake 800 bucks", "label": 1}
{"text": "It is CC debt so 30% sounds about right for the interest rate.", "label": 1}
{"text": "Sounds like it's someone in your household. ", "label": 1}
{"text": "Oh damn that’s low… I didn’t see that haha", "label": 1}
{"text": "You don't seem very excited for finding out about a half million dollar windfall.", "label": 1}
{"text": "Do you need a tik-tok video of them doing cartwheels?\n\nWith $500k if you're young you can set yourself up for retirement in 40 years, or buy an almost decent house. You don't even get to do both. Its not all that much money.", "label": 1}
{"text": "The worst part is what he said isn't even true. Not having a mortgage can push your retirement up decades.", "label": 1}
{"text": "Sounds like you have an alternate personality/schizo and they are using the card while you’re sleeping", "label": 1}
{"text": "Come on now, they used an exclamation mark!", "label": 1}
{"text": "> Have you ever seen antiques roadshow? I'd like a reaction like that.\n\nThey look surprisingly similar to \"Thank you!\"", "label": 1}
{"text": "I would think 300K is easily a good setup for retirement in 40 years. There are a lot of places where 200k can buy a pretty nice house. \n\n300k untouched for 20 years would provide me with enough to live on the interest alone from 65 until I die (combined with what I have now). \n\n300k @ 5% for 40 would provide a comfortable retirement, especially if you own your home outright.", "label": 1}
{"text": "Nah, you're watching the wrong episodes. \n\nhttps://youtu.be/b9Y4bmbh1KY?si=TFI0yeE7pf-7LhEr&t=264", "label": 1}
{"text": "Man, do that at my house we all getting shot.", "label": 1}
{"text": "They clearly said a young person receiving $500k and investing for 40 years. If you’re starting with that much in your retirement fund and can’t invest correctly for retirement over that length of time, something is wrong.", "label": 1}
{"text": "Do you not understand what investing/compound interest is? If OP put that in an IRA and did just never touched it he/she would be set for retirement", "label": 1}
{"text": "$500k in a retirement account, in an S&P-500 index fund, will be worth approximately $22,626,627.79 in 40 years, nominal dollars (10% long run average RoR).\n\nDiscounting for inflation (-3% off interest rate), the value is $7,487,228.92 in today's dollars.\n\n\nAnd that's not investing an additional single red cent for the next 40 years.\n\n\nMy question for you: What world are **you** living in?", "label": 1}
{"text": "5% is quite pessimistic too, since the conservative long-run market average is closer to 10%, or 7% inflation-adjusted.", "label": 1}
{"text": "UK needs a Bill of Rights, the Magna Carta is Not cutting it anymore.\n\n\nThis is another reason not to let deadbeats move in with you?\n\n\nI am an old soldier; and remember a quote: Possession in 9/10s of the Law, and the Infantry are the Baliff's Men.", "label": 1}
{"text": "You're wrong, 250k into the stock market averaging 10% returns will get you 10+ million dollars in 40 years. 250k down payment on a 450k house ( the average in U.S.) will get you a comfortable mortgage.", "label": 1}
{"text": "Do not cancel it. It is clearly self-sustaining and growing, even if by a little. If you really do need the money, look into borrowing that amount to fuel other investments. 50,000 of permanent insurance is not enough, but is guaranteed assuming you still pay your premiums. It will last you and you'll see growth in it. Again, look at borrowing if you want to use it for other investments.", "label": 1}
{"text": "You could sue her in small claims court. Assuming this is in USA.\n\nIf you won a judgement you would still have to go through the collection process. Could sell the judgement to a debt collector for pennies on the dollar if you want her to face non jail consequences.\n\nFirst I would ask myself is the $800 worth having to deal with her or should I just go no contact and move on.", "label": 1}
{"text": "Comparing life insurance to an investment is like comparing apples to oranges.\n\nWL is a great savings alternative when set up properly but has little-no risk, hence lower returns than say stocks.\n\nUsing WL to buy investments would provide a better volatility buffer than throwing it all on black in the markets.", "label": 1}
{"text": "Check wiki for “windfall”", "label": 1}
{"text": "I didn't say it was universal - I explicitly mentioned certain states like WA.", "label": 1}
{"text": "How are your Co2 detectors?", "label": 1}
{"text": "Hi, it’s me you long lost cousin!\n\nDon’t let people know about this, people an get greedy with money", "label": 1}
{"text": "get another 10k loan and put it on red haha, just joking, if you work only 40hours a week, try to get a mini job or a part time job, and use that money towards debt, eat mostly home, coffee is a money waster if you pay 4pounds for a coffee but if you make it at home it costs only 0.30p.", "label": 1}
{"text": "Step brother? What are you doing?", "label": 1}
{"text": "here is what I would do .. first, check their current value—Apple's stock is sitting around $222.58 now, so that could be a nice chunk of change especially since Apple had multiple share splits over the years! Since the certificates are unsigned, hit up Computershare to figure out how to transfer them (they're the ones to contact for Apple stuff). It might also be smart to consult a lawyer about any legal stuff, just in case. And don't forget about taxes when you sell! If you have more questions lmk ... these days you can even get some decent information how to handle situations like that from ai tools I like using castello ai for financial stuff, I'd put a link but I don't wanna promote, they're just a solid resource imo.", "label": 1}
{"text": "You need to listen to me carefully boy…. Invest in Yieldmax. Its cheap for alot of dividends, some are weekly and some are monthly. Look into it 🙏🏻🙏🏻🙏🏻", "label": 1}
{"text": "Woah ok thank you all i think I'll heedd your advice. I really appreciate the help. I'll come back and comment later", "label": 1}
{"text": "I know how to get on the line.", "label": 1}
{"text": "Change your email account password first", "label": 1}
{"text": "Check for a carbon monoxide leak, lol", "label": 1}
{"text": "Thanks you, do you know if it works in the same way for the other indexes? Like SPDR?", "label": 1}
{"text": "Unexpected Perfect Strangers", "label": 1}
{"text": "Thank you, I’m looking for index historical data because I want build a portfolio starting from asset allocation and not from etfs.", "label": 1}
{"text": "I like spyx (spy without fossil fuels)", "label": 1}
{"text": "> I make 2.3k after taxes\n\nper day? per year? per quarter? per 2 weeks?", "label": 1}
{"text": "[Niko it's your cousin, why don't you take me bowwwlinnn](https://www.youtube.com/watch?v=zxMLVlspD1Y)\n?", "label": 1}
{"text": "nothing says you have to put everything into 1 etf.\n\nThe problem with the growth will be when the economy has issues, your employment situation will also be at risk, resulting in high risk of losing your job and selling at the bottom.\n\nPersonally, I keep my living costs as low as possible, so even if I lose my job and have to sell at the bottom, I don't need to sell much.", "label": 1}
{"text": "I'd strongly consider getting a second job (uber, doordash, costco, etc.).\n\nWithout any interest payments, it will take 0.9 years to pay this down. Interest will eat you alive.", "label": 1}
{"text": "There’s always money in the banana stand", "label": 1}
{"text": "I think this is one those things where they don't supply enough information for there to be an obvious smoking gun, but ill try:\n\n1. Survivorship bias. I don't know how many funds they killed due to under performance. Even page 7, they highlight it: \"Since 2000, **nearly all** [..] generated more wealth than their indexes\"\n2. Cherry picked dates. In recent history, their funds way underperform against the snp500. (Go to google and compare the 5Y performance of Snp500 and one of their funds).\n3. Too much focus on minor metrics. idc if they \"beat the index\" 122 of 169 days of the year. If in those 47 days they missed the metric by 100%, then I am out a lot of money.", "label": 1}
{"text": "Why are they subtracting 160k from your share?\n\nThe 160k is something split down the middle at least so they should minus 80k from your share or 160k from the combined value.", "label": 1}
{"text": "AAPL 1981 $0.08\nAAPL 1994 $0.24\nOutstanding!", "label": 1}
{"text": "If you aren't sure if you want kids, I'd take the money.\n\nNo point in my life have I been upset about having too much money. I currently earn $500k/yr and have $5.3m. The mental freedom of \"f*ck you\" money I have compared to my friends is amazing.", "label": 1}
{"text": "Make your money while you can.", "label": 1}
{"text": "Hang in there friend. You are loved", "label": 1}
{"text": "Everyone has given all the practical advice I could offer. \n\nBut if you happened to also be looking for love, moving back home in December could cast you a Hallmark holiday movie happily ever after.", "label": 1}
{"text": "Omg - that is amazing advice. I don't know why I didn't think of that", "label": 1}
{"text": "I was gonna say SPY puts, but your advice seems more reasonable.", "label": 1}
{"text": "I started my professional poker journey with 50k.", "label": 1}
{"text": "Have you considered that your parents have already done their part and shouldn't be tasked with supporting you with what appears to be an adult level life and ability to earn wages?\n\nWhile a safety net is good, assumed safety net puts stress on others who might not be able to afford it.\n\nDon't assume your parents want or would be willing to finance your want to \"figure it out\".\n\nLife is about finding your way while being self sufficient as much as possible. What you want to do is maintain your current lifestyle at others expense.\n\nHaving 70k saved is more than 99% of all 20-30 year old people have. Use it to figure your shit out, don't weigh on your parents retirement like a piggy bank.\n\nSometimes adversity leads to a breakthrough in your life. Treat this break as such. Don't treat it like a vacation while you decide how to support yourself in the future.", "label": 1}
{"text": "I'd probably go to a Spanish immersion school, dial into some intensive self-defense training and spend a lot of time read and meditating on what I want to do with my life before making a leap.", "label": 1}
{"text": "I had to check if I was in r/wallstreebets for a sec again", "label": 1}
{"text": "Why are his parents responsible for all this? He's 27 for Christ's sake. 27 with a salary potential that probably eclipses his parents income.\n\nThis isn't welfare. This is robbery of relatives.", "label": 1}
{"text": "Some people have good relationships with their family and the tech market is brutal right now.", "label": 1}
{"text": "I envy people who have good relationships with their parents that moving back home is an easier choice to make when not even close to the verge of financial ruin.", "label": 1}
{"text": "exactly. terrible financial advice, and not worth the savings in rent to fall in love and spend all that money. just see if you can find something that's month to month (your lease might do that automatically) and squirrel your nuts for winter", "label": 1}
{"text": "I'm sorry that you are so isolated and cynical that you consider family supporting each other to be \"robbery.\"", "label": 1}
{"text": "NVDY\n\nThat'd be roughly $3k a month in dividend payment.", "label": 1}
{"text": "How do you know he's Polish?", "label": 1}
{"text": "You can’t argue with a Mr.Bootstrap type of person.", "label": 1}
{"text": "Do your parents not love you?!?!?\n\nBeing a parent doesn't end when your child turns 18.", "label": 1}
{"text": "Jesus christ my dude, what happened in your family? You're goal as a family, if you're on good terms, is to help each other financially if it helps the *overall* wealth of the family even if one person is taking a slight hit but it's a net positive for *the family*. I'm an only kid, it's not robbery, they've told me I'm getting it all. \n\nSeek therapy.", "label": 1}
{"text": "polish, not Polish", "label": 1}
{"text": "\"Bankrupt\" isn't whatever you say it is, it's a legal proceeding.  She can't qualify for Ch 7 and get her debts wiped out or reduced.  She ain't bankrupt.  She can *possibly* get her debt restructured but generally it's better to just take care of it yourself when you can, which she can.", "label": 1}
{"text": "maybe he will change their diaper later to thanks them instead of parking them in a retirement home", "label": 1}
{"text": "Maybe a good idea. Nana works in mysterious ways.", "label": 1}
{"text": "Party and start building something cool", "label": 1}
{"text": "If you were homeless in a tent on the sidewalk, they'd complain about that too.", "label": 1}
{"text": "have you considered his parents mortgage on the house they bought 40 years ago is paid off and they have empty rooms, meanwhile his rent is $2300 for a cramped apartment and probably all of them could appreciate the company.", "label": 1}
{"text": "Yup. I bounced when I was 17 because I couldn't stand my mother. At one point in my early 20's, I told my dad that if I ever \"asked\" to move in with them, that I was desperate and out of money so please don't say no. Thankfully, although sometimes I was about to wonder, things never got that bad. \n\nI've spent *a lot* of money not living with my parents, and that's put off FIRE by at least five years, if not a decade. For better or for worse, for me, it was worth it.", "label": 1}
{"text": "I mean... have you talked to his parents about this or something? What you're saying is definitely possible, but maybe the advice should be \"hey consider talking to your parents to see how they feel!\" not \"Your parents don't want you.\"", "label": 1}
{"text": "If Harris wins she is planning on building 3 million houses to bring housing costs down, theyvalresdy sued landlords for price fixing so rent should go down! Other that whu don't you have a chance to get another job?", "label": 1}
{"text": "Take a month off! Enjoy it! We gotta work until we die anyways", "label": 1}
{"text": "No it clearly says Polish", "label": 1}
{"text": "I'm an only kid too and while I want my parents to be around for a long time, I know I'm getting everything they have left when they pass, there's no one else to leave it to.", "label": 1}
{"text": ">  it’s killing me just knowing my throwing all that money away.\n\nwhat money are you throwing away? the 6% interest ($32400/yr or $2.7k/mo)? would you rent a place thats cheaper than $2.7k/mo?\n\n> another $40,000 from stock\n\nWould you owe taxes if you sold this stock?\n\n> I have a 540K mortgage\n\nIf you invested 540k into VTI 1y ago, you'd have $745.2k. Has your home value increased $205.2k?", "label": 1}
{"text": "I got a grand on TZA.  Just patiently waiting for a crash", "label": 1}
{"text": "Please take out the only fans line before we can approve this. We don't allow posting jokes that will distract people from the financial question.", "label": 1}
{"text": "If he has a strong jawline and a green sweater he's golden!", "label": 1}
{"text": "The best thing a parent can do is assist and support their child. Your values seem out of whack", "label": 1}
{"text": "It’s cupping season so I’m sure love is out there", "label": 1}
{"text": "A resume in Polish may not help OP to get a new job though", "label": 1}
{"text": "I would move to Omaha Nebraska and start doing stand up gigs.", "label": 1}
{"text": "I have a great relationship with my family. Not isolated or cynical, just stating that I think it's ridiculous that the expectation is that his parents should be responsible for floating a grown man who has 70k in savings.\n\nWhy isn't he just floating himself? It's crazy that everyone in here sees it as \"free rent, free food and free utilities\". \n\nIt's not, he is just shifting the cost of those things to his parents, and again... He's got 70k saved up!\n\nIt's not like he's destitute.", "label": 1}
{"text": "I have a great relationship with mine, and if I was broke would have no issues reaching out for help.\n\nThis isn't what the OP is or is doing. He's just leaning on his parents goodwill vs working to find another job before his emergency reserve runs out.\n\nHell, I'm pretty sure I saw some on here saying \" go travel for a while bro, losing your job is stressful and you need to decompress\" or some shit. What?!?\n\nSo he should go home and live on his parents dime, and instead of working to get back on his feet, he should *travel* and relax?\n\nThat is a ridiculous expectation. And for the record, I am a STRONG supporter of safety nets like unemployment, food stamps, Medicare, etc., so if the market is brutal, use them! \n\nWhy do all these grown children want to play act being an adult without the responsibility of actually *being* an adult?", "label": 1}
{"text": "r/wallstreetbets", "label": 1}
{"text": "We live on a spinning rock for 80 years then die. He doesn’t need to be productive every minute of his life and he didn’t choose to be alive. If he’s fine with it and his parents are fine with it idk why ur opinions even being offered.", "label": 1}
{"text": "Nope, I would tell him to use some of the $70k in savings to go rent a cheap apartment. Comparing this situation to being in a tent on a sidewalk shows how delusional some of these replies are.\n\nHe has more in savings than like 90% of retirees in the US have in their 401k, and instead of being self sufficient, would prefer to lean on his family at their expense and his benefit, and some of the folks in here are telling him to go travel or some shit while doing it. \n\nRidiculous.", "label": 1}
{"text": "I could be on board with the free rent, particularly if their mortgage is paid off. But our dude should cover his own food and pitch in for utilities at the very least. And fully contribute to household labor.", "label": 1}
{"text": "I agree. But that's not this. This is someone with a 6 figure income potential and 70k in savings for this exact type of situation who instead of dealing with life that he is financially prepared for instead leaning on his parents to do it for him.\n\nIf you think that taking advantage of your parents kindness and willingness to help at their detriment while not *needing* to is appropriate, then it's not my values that are out of whack, it's yours.", "label": 1}
{"text": "Maybe OP wants to move to Poland.", "label": 1}
{"text": "U2 edge or pro wrasslin edge?", "label": 1}
{"text": "Mortgage fraud is illegal you dirtbag.", "label": 1}
{"text": "Leave them as is", "label": 1}
{"text": "Immediately start backpacking/long term travel. Pick up part time remote tech work. Go to Thailand/Bali or something of the like and find a remote work group, live in a villa like a king every day and code on the beach. \n\nIn two months time you'll question why you ever lived any other way.", "label": 1}
{"text": "You have another car, the Tacoma is a money sink, sell it", "label": 1}
{"text": "Go traveling around the world", "label": 1}
{"text": "Is this a serious question?", "label": 1}
{"text": "But again being able to pay your debts and have $1200/mo left over is not \"broke\".  Hell that's better than most people.  Add like $500/mo from renting a room and she's doing great.  Under no definition is she bankrupt.\n\nSelling the house *might* make sense for her but we'd need a lot more information.  What's her interest rate?  Have housing prices gone up so much in the area that if she sells now, she might never be able to get back in to home ownership?  When she says \"major repairs\" does she mean a new roof, a crack in the foundation, or like, replace some drywall and carpeting?  But she isn't broke at all, if keeping the house makes sense for her she can easily do it by just restructuring the CC debt.", "label": 1}
{"text": "Again, $1200/mo for gas, utilities, and groceries in not \"broke\".  You don't seem to get that.\n\nAgain, you have no way of knowing the home is a bad investment.  I have no idea why you're assuming that.  If she paid a fair price and has a fair interest rate, it is not a bad investment.\n\nAgain, we don't know what the repairs are.  I already stated that.\n\nAgain, she can get the credit card debt restructured to lower the interest and monthly payment.\n\nI don't think you're even following this thread.", "label": 1}
{"text": "e", "label": 1}
{"text": "Makes sense, did not think about it that way. Though if I keep fixing it and it continues to break down, at what point should I start consider replacing it? Definitely will consider cheaper models if it comes to that.", "label": 1}
{"text": "You’ve moved in to financial advisor territory.  I wouldn’t recommend taking advice from Reddit for something like this.", "label": 1}
{"text": "Easy: put more in the 401k", "label": 1}
{"text": "the new loan will dip your credit temporarily and if you're closing soon, that will affect rates offered to you slightly. so space it out if possible. the other comments covered the dti aspect.", "label": 1}
{"text": "Man…this irks me. Where’s your integrity?", "label": 1}
{"text": "This is awful.", "label": 1}
{"text": "If you leave don’t come back you pile of steaming crop", "label": 1}
{"text": "I would call you a thief for doing this but it is what you want. Even if statute of limitations expire, it’s unlikely that you will be able to come back to the US without legal or financial repercussions. \n\nDont jeopardize your legal standing with a foreign government by pulling such shenanigans and instead go get a consultation with a bankruptcy lawyer and an immigration lawyer to make sure you have the beat option moving forward. \n\nThis is beyond Reddit territory", "label": 1}
{"text": "I would do everything in my power to keep the house. Rent by the room if you have the extra space to bring in some extra money.  \nI’d prioritize your food, electric, water, housing and means to get to and from work. I don’t know what your income looks like so it’s hard to break it all down. \nI’d say if your credit is already shitty you’re not needing to save anything there so do the min while you can. Call all the companies and see if perhaps they can defer payment without adding any fees. If you have any extra money and can snowball your debt payments that might help gain some traction. If you want me to help you work out a budget and talk through it send me a message. \nThis sucks it’s happening to you but now you have the opportunity to be so much better than that weight of a partner allowed you to be.", "label": 1}
{"text": "Has none. Probably already expired their visa too", "label": 1}
{"text": "Thanks for all the input everyone. Im fucking sick, i hate things, in tears, tired, desperate. Im so fucking sick of this place. I fucking hate society so much. How did this shit show happen? Its not what i ever envisioned for life i was a driven and motivated person 10 years ago i had a future. I know it all sounds ridiculous. It happened so fast in  a 2 year period. I eat from the foodbank i drive a piece of shit car that isnt safe. I cant afford health insurance for my family or my kids, hence the medical debt. I'm so fucking sorry for them. Get therapy? $150 a week? Fuck i tried i was desperate i bought health insurance and went 3 times a week sometimes and they told me this isnt going anywhere and cancelled my future appointments. Cancelled insurance because i couldn't pay it. Constant overdrafts constant late fee's work our fucking asses off and nothing to show. Eat from the fucking food bank fuck. \n\nThats all i just didnt want to bail just wanted say i'm going to delete this is a couple minutes because i dont want to see it, or the notifications or any of it.", "label": 1}
{"text": "> start finding a financial advisor or planner\n\nno. financial advisors are only useful if you need someone to tell you \"no\" or your networth exceeds $2m and you need assistance with estate planning or you're approaching retirement and you need help strategizing your retirement income/allocations.\n\nFor everyone else, just invest in VOO or VTI or target date funds.", "label": 1}
{"text": "I hate myself for getting political, but if you haven’t already voted, there’s one candidate who will increase the cost of medical care/insurance so the rich can get richer, and one candidate who will fight to make sure that you have access to medical care at an affordable price because…. communism, I guess?\n\nThe fact that you have the option to pay $273/month for low-quality, high-deductible health insurance is because the Dems fought so hard for “Obamacare.” Pre-Obamacare, it’s very unlikely that you could get any insurance for less than a grand.\n\nYou’re not doing anything wrong. But you’re making little enough money that lobbyists have convinced both Rep & Dem policymakers that you don’t matter.\n\nYou matter. It’s fucked that you’re working hard, and you’re skilled enough to earn a decent wage, PLUS going to school…\n\nThe only thing you can do is vote responsibly.\n\nBecause shit isn’t fair for hardworking people, but we can vote to make things better.", "label": 1}
{"text": "Speak to a financial advisor", "label": 1}
{"text": "Where's the integrity of the bank that makes an unsecured loan of any amount to someone at 30%?\n\nYou have no idea what led this person to this situation, you don't even know how much they borrowed. For all you know this amount could be mostly interest and fees.", "label": 1}
{"text": "Note that one of the common benefits of a roboadvisor is tax-loss harvesting, which does not provide any benefit in a tax-advantaged account like an IRA.", "label": 1}
{"text": "If home is *actually* in need of major repairs, like roof or foundation, home ain't gonna sell for a remotely decent price either.  We are wayyyyyy past the time of everyone waiving inspections.  If OP is panicking, as is very clear in the post, \"major repairs\" might mean leaky sink and drywall damage.  That OP *can* easily afford to make if, instead of panicking and selling the house, she restructures her credit card debt and gets a roommate.\n\nWhen someone is panicking and making bad decisions, you as an impartial observer shouldn't just jump in and panic with them.  OP clearly has plenty of money to live on here and has the time to think things through and be rational about it.  That CC debt can be completely gone in a few years, leaving her with an extra $1k/mo to throw into home repairs.", "label": 1}
{"text": "personally, I don't \"save for ___\". I separate my \"income\" from my \"spending.\"\n\nI optimize my portfolio to maximize growth and when I need to buy something, I go buy it.\n\nAs long as I am making the right decisions for growth and I'm mindful how I spend my money (always considering ROI), then I turn out ok.\n\nsource:\ncurrent pay: $500k/yr\nnetworth (excluding home): $5.3m\nYoE: 14 years.", "label": 1}
{"text": "consider going back to school for an associate's / bachelor's in something you like that also pays well which you could finish in 2-4 years while working. perhaps you can validate some of the courses from your previous degree somehow so that you can take less credits. unless of course you are keen to stay in psych, where you'd have to earn a masters or a higher level of education as well as obtain the necessary license(s) to practice.", "label": 1}
{"text": "i'm curious too", "label": 1}
{"text": "Lowering the price could definitely attract more interest, and listing it in multiple places is key. Consider posting in Jeep-specific groups on social media or forums; those communities are often eager to buy modifications or unique vehicles.", "label": 1}
{"text": "You're right; cashing it out is an option if you’re the policy owner, even if the payout isn’t substantial. Sometimes it’s better to move on from a policy that doesn’t provide much value. I found this [overview on cashing out policies](https://secure.money.com/pr/u33643e6e1a0?s1=Reddit-PerFi8&s2=Reply) helpful.", "label": 1}
{"text": "Harris's staunch supporter", "label": 1}
{"text": "What's the rate on your student loan?", "label": 1}
{"text": "It's incredible that you got into college.", "label": 1}
{"text": "I could but the apartment management couldn't find out about it lol I think I'd get in trouble & yes I could but the more money I make then my rent would go up next year... but I technically could. I was thinking about finding a cash paying job so that it wouldn't cause my rent to increase. If I go above 35k it will go up next year but I'm not sure by how much.", "label": 1}
{"text": "Your home???  This is not your home.  This is your mother-in-laws home that she signed over to her son for safekeeling.    Sounds like you have destroyed your own creditworthiness and are now eyeballing the mother-in-laws house.  Most people in your position destroy their kids' credit before moving on to other adults.", "label": 1}
{"text": "He can call his insurance.  And be less of a dick.\n\nBTW 'ordered me to open the gate'. No one orders you. You aren't in the military. He asks.", "label": 1}
{"text": "How is it annoying to store stuff in the rear seats? And am curious to hear what other beefs you have!", "label": 1}
{"text": "Okay can you read my statements I am not good math.", "label": 1}
{"text": "Did your credit score drop 100 points on all of the bureaus? Experian, TransUnion, & Equifax all report separately.\n\nIn the past, I had an unpaid parking ticket that I was unaware of and it went to collections, which dropped my credit score by 100+ points to a staggering 661! \n\nI found this out as I was in the middle of applying for a mortgage and the bank pulled my credit report after I was telling them how my credit score was amazing since I had never missed a payment in my life. The guy on the line audibly gasped when he asked if I knew why one of the bureaus had my credit score at 661, while the other two were 790+. Turned out to be this parking ticket.\n\nFor the mortgage, they luckily took the average of the 3 reports which still enabled me to get the best interest rate (credit score above 720). Hopefully it's the same situation for the credit card balances.\n\nThere wasn't anything I could do about the one bureau that docked me - they said it could take 7 yrs to recover - but it eventually moved back up within a year. I did also reluctantly pay collections :)", "label": 1}
{"text": "Let's take this slow bc you don't seem to be following.\n\nDo you understand the CC debt can be restructured to a lower interest rate?", "label": 1}
{"text": "Several variables to consider:\n\n1. Will the amount of expected rental income cover the new mortgage (principal, interest, taxes, insurance) at the higher 6% rate + higher debt amount (cash out)?\n\n2. If so, what would your cash-on-cash return be? I.e. if you now have $20K of equity in the home after taking out $80k from the refi, what would your annualized return for the equity held in the asset be? You could compare this to other possible investment returns while also considering the potential appreciation of the house itself.\n\n3. From a tax perspective you'd be able to get a depreciation deduction on the rental property\n\n4. HELOC terms would likely be less beneficial than a traditional mortgage in this case; HELOCs are typically floating rates and have shorter payback periods while conventional mortgages can be up to 30 yrs", "label": 1}
{"text": "What if we get a prenup and buy a house together and divorce 10-20 years later?", "label": 1}
{"text": "I wouldn’t be able to sleep at night.", "label": 1}
{"text": "Nope not gonna work out in this universe lmao", "label": 1}
{"text": "I actually did that for a month or two once. The hard part is making the micro sacrifices which isn’t worth it because that’s not really enjoying life to me especially since I make over $100k which isn’t a lot but still above average, which I justify for the micro spending. I mainly just don’t go overboard like I want a brand new or even slightly used Harley for $15-25k but stick with a paid off $3k 20 year old Yamaha", "label": 1}
{"text": "That’s frustrating – sorry you’re going through this. I’d definitely push back on the broker to see if they can honor the original rate. It might be worth mentioning that this mistake could cost you significantly over the loan term. If they won’t budge, maybe ask if they can reduce some of their fees as a goodwill gesture.\n\nAlso, you might want to look around with other lenders, especially if you’re still within your rate shopping window. It could give you some leverage or at least help you find a better rate to switch to if needed.\n\nGood luck – hope it works out in your favor!", "label": 1}
{"text": "Definitely fight for that original rate - their mistake shouldn't cost you thousands over the years. And yeah, shop around if they won't budge. Even if the current rates aren't great, you might find someone willing to match that original quote just to get your business. Good luck!", "label": 1}
{"text": "Adjusting the fees is not enough in my opinion. Assuming normal home prices, this is likely going to cost the OP at least $30K over the life of the loan. \n\nThe only acceptable answer is they offer the original rate, or they offer to pay to buy down the current rate to meet the original rate. This should in no way fall on the buyer, and bad business practices like this should not be encouraged with easy outs by dropping a couple fees and footing the buyer with tens of thousands higher in the home price.", "label": 1}
{"text": "Thank you for the encouragement. You tried. Even with fitness, I’ve been going consistently for 6 months, and even would meal prep chicken breast, rice and veggies 5 meals a day. Even that I got tired of. I’ve recently started not dieting anymore and barely have thankfully still been consistent at the gym but not lifting like I did before. Hopefully it’s just a rut and I’ll bounce back but mostly likely not. \n\nI don’t think I’ll be able to get a house. The ironic thing is my parents (I still live with them), have a 2 bedroom house with a 2 bedroom ADU, and a car shop property they leased out. But regardless of how much they bring in from the shop and ADU, they are so tight on cash and borrow money from me sometime (even though I give my mom $2k a month for rent and car payment). It’s ridiculous. They claim the shop is worth 2 million (they owe 500k) and house another 1.5-2 million. But my parents are only 63 and 73, and if something happened I’d have to split with my sister (after tax and money owed for properties). So I don’t really have hope on those. I just plan my life as if I have none of that.", "label": 1}
{"text": "Damn I didn't know lenders did that, thanks.", "label": 1}
{"text": "I mean, it's how it fucking feels toast person. Trying to put my family in position, and pay off this shitty loan asap and they are taking money that is supposed to go into MY HOME and putting it into THE BANKS POCKET. Kinda feels like robbery to me.", "label": 1}
{"text": "It's not just a matter of whether they can, the verbal agreement constitutes a legally binding contract even if it's not in the written contract. The fact they even emailed you referencing a rate lock that's not in the contract should be slam dunk evidence if the matter were to go to court.", "label": 1}
{"text": "hey I put your tax question into our team's AI personal finance coach. I included the answer [in this link](https://askaicoach.writeas.com/question-i-am-a-legal-immigrant-in-the-us-working-in-industry). Please feel free to check it out!", "label": 1}
{"text": "> I will have 10,000 dollars in savings\n\nHow much is in your 401k and IRAs? Is your house paid off? How much money are you expecting from social security", "label": 1}
{"text": "You need to get a full-time job and earn beyond your disability payments. You're living in a poverty trap.", "label": 1}
{"text": "100%. People do this all the time. You get free tuition for those years you stay together and you get a wife. I don’t see how this isn’t a good thing tbh.", "label": 1}
{"text": "Pay me I will steal it a total it and only charge you $10,000", "label": 1}
{"text": "😂 tempting", "label": 1}
{"text": "I can assure you that the particular plan offered is not accepted by any of my doctors. The conversation has been “ya we take Aetna…oh not that Aetna plan”. In my comment I said I called 50 doctors and then had a painful procedure awake. Do you think this is something I didnt check and recheck and check again? What a condescending comment.", "label": 1}
{"text": "How much does it cost to have a lawyer confirm that?", "label": 1}
{"text": "Exactly.  OP should pay a lawyer to draw up or review the deal if he wants to settle outside of insurance. Add that cost on.", "label": 1}
{"text": "Your savings situation is solid, but because your income is variable, it’s important to build a larger emergency fund. You might aim for 3-6 months of expenses in an accessible savings account. The good news is, without debt or major monthly obligations, you are in a great place to keep building that fund.", "label": 1}
{"text": "You bought a POS house that needs $100k in repairs.  Your experience is not the norm.  Sorry you are in a shit situation.", "label": 1}
{"text": "You’d think age would bring wisdom and self awareness but I suppose not", "label": 1}
{"text": "I could say the same for you. You're the one sitting here telling me that this is the same as every other one that's come before it and that it's really nothing special. Obviously, you haven't been paying attention", "label": 1}
{"text": "Get insurance of the value of the house and then take loan citing the insurance papers as guarantee against it . Safe and secure \n\nI can help you to discuss further on this", "label": 1}
{"text": "Major bank is not the same as a small mortgage company. Not even in the same world bud.", "label": 1}
{"text": "I'd first note that mutual funds are available on pretty much any brokerage platform, so there's no need to be purchasing them through a financial advisor, unless you find it useful to work with that advisor to select mutual funds. You would likely be able to reduce your total fees if you purchased these mutual funds directly vs. through an advisor.\n\nThat said, if you want to minimize fees overall, low-cost, passive ETFs will typically have significantly expense ratios vs. mutual funds. \n\nIt's also worth thinking about how you're selecting mutual funds. When you're investing in an actively-managed mutual fund, a big part of what you're investing in is the team behind those active decisions. Often folks will just look at past performance of the protfolio, but as they say – you can't buy past performance. A big part of selecting a particular mutual fund is underwriting the mutual fund manager's ability to make good future decisions about the portfolio.\n\nNote that none of this is investment advice – just a framework for how to think about this decision!", "label": 1}
{"text": "One consideration is your overall tax situation. When you sell a stock at a loss, you can often use that loss to reduce your tax bill. In fact, many investors employ a strategy called [tax-loss harvesting](https://www.investopedia.com/terms/t/taxgainlossharvesting.asp) to improve after-tax returns.", "label": 1}
{"text": "Sounds like your layabout wife really needs to get a job or you need to leave her.", "label": 1}
{"text": "You guys are so wrong. OP is not in the clear. I'm literally a subject matter expert in this field. Stop giving bad advice on stuff you do not fully understand.", "label": 1}
{"text": "They had their chance. Fuck them. Chargeback stays.", "label": 1}
{"text": "hey I put your tax question into our team's AI personal finance coach. I included the answer [in this link](https://www.reddit.com/r/personalfinance/comments/1fzbjwf/how_to_save_tax_in_the_us/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Please feel free to check it out!", "label": 1}
{"text": "And think... if you would have bought bitcoin", "label": 1}
{"text": "Thank you for the advice I will go to the large lenders", "label": 1}
{"text": "If you would like to adopt a 401K plan instead for your business, our firm specializes in plan design and administration work. Doing so would make you exempt from having to do CalSavers.  401K plans offer many tax saving benefits that CalSavers do not.  Let me know if you'd like to learn more.", "label": 1}
{"text": "Is he trying to sell you on a product you should be putting your money into instead?\n\nGetting as much money in when you're young is a great idea.  If you are happy with the lifestyle you can afford even after your 16% contribution, keep doing it.  You will absolutely thank yourself later.  It gives you flexibility in the future if you need to reduce contributions for a few years bc of job loss, saving for house, illness, etc.  Worst case scenario is you retire early or live a more lavish retirement.  \n\nIf you are putting in so much that you are struggling to get by *now*, then reconsider if it's really worth it to you.  But as long as you're happy with how much you have leftover to live on, and you can meet other short-term savings goals (emergency fund, house downpayment, etc) then keep contributing the 16%.", "label": 1}
{"text": "#1 consideration.  Just in front of mortgage being paid off.", "label": 1}
{"text": "Scared money doesn’t make money", "label": 1}
{"text": "Consider ditching the car if they can arrange transport via bus or bike. It might be worth moving or getting a different job to get to that point but would save them the most money in gas, up keep, insurance.  I would favor this deep cost cutting over getting another job as having time for college is important.\n\nIt they haven't already, they need to do fafsa and see about grant or fed subsidized loans for college. \n\nSee if anyone in the family is willing to pay off that cc in exchange for repayment after graduation. An uncle? Gma? They may help if it's a one time thing and he writes up this plan and shares it with them. Then chop it up.", "label": 1}
{"text": "Dave Ramsey", "label": 1}
{"text": "> Car loan payments: $500\n\nI don't understand why people get car loans for cars (old or new). his down payment on the car, he could have gotten a great Toyota.", "label": 1}
{"text": "I juggled debt for years. Mine was mostly maxed out credit cards from constant car repairs and a myriad of medical bills. At my worst, it totaled nearly $30k. I feel you.\n\n\nTwo things that helped me:\n\n\n1. Non-negotioable savings account. \n\n\nThis needs to be seperate from your main account and auto-deposited. \n\n\nI mean, don't even LOOK at it unless it's an emergency. I kept winding up in debt because I didn't save for emergencies or viewed my savings as play money. \n\n\nAnd when an emergency inevitably came up, I needed a loan or a credit card to rescue me.\n\n\nDon't assume emergencies won't happen. Tires wear out, accidents happen, animals get sick...\nBut also, don't view emergency money as a funds store for fun stuff. \n\n\nI specifically put mine in an account that takes about 3 days to transfer back to my main account. I can't use it without effort. \n\n\n\n\n2. This one is debatable but it worked for me....\n\n\nI opened a new credit card any time it had a 0% transfer offer. I would transfer the debt to that card and then work with the 0% interest to pay it off faster.  \n\n\nThe thing here is to immediately box up or cut up that card and not use it. For all intents and purposes, that new card is a loan and not a line of credit. The transfer has an initial fee but over the course of the 12-18 month period of 0% interest, it'll be worth it. \n\n\nI would have thought opening endless cards over the course of several years would have impacted my credit negatively but it actually made it better each time. You get a hard inquiry but I opened a new card only when the 0% interest ran out so they were space at least a year apart. \n\n\nBecause I wasn't adding debt to the old or the new card, it was increasing my line of credit capacity which reduced my use ratio. \n\n\nThat Apple card has a crazy interest rate, focus on offboarding or paying that off first.\n\n\n---\n\n\nThese two things can help but you have to break the habit of relying on your cards for purchases or emergencies first. You know this but remember habits are not light switches. It's not an off or on switch - it's daily decisions creating expectations. You have to make the choice everyday to not fall back into bad spending. \n\n\nI know you're overwhelmed. It takes time to get where you are and time to get back out. But there's nothing more satisfying than making that last payment and being debt free again. You can get there. ", "label": 1}
{"text": "admit you have no idea what you are talking about and move on.\n\n  \n\"I'll sue\" is about as valid as \"just file a chargeback\".  it doesn't work the way most people think it does", "label": 1}
{"text": ">  but fell out of favor with them after a fraudulent bank transfer they didn't protect me for that cost me $1200+. \n\ncan you tell me more? I use wise a lot", "label": 1}
{"text": "Hmmm, personally, looks like you only have expenses of around $1000 even, if you can open a savings account without penalties of quick withdrawals and that money is not locked in some plan, I would, put 6k into that, use 4k as an emergency fund (car breakdown, random bills, essentially a black hour fund should shit hit the fan)\n\nWith your 3000 a month, either put that in a fixed savings account or into stocks if you’re happy with that, S&P 500, etc etc, if you don’t want to, I’m sure your bank has some sort of 6 or 12 month fixed % savings account. \n\nFinally you have 750 left, let that accumulate in your bank account until you build up another 3k and then transfer to savings, that will ensure you always have enough money for any disasters so to speak\n\nOverall:\n\nExpenses - $1000\nBank Account: $4000 (top up from emergency fund to make it is always there)\nSavings Account - $6000 + $3000pm = $42,000 after 1 year of saving\nEmergency Fund - $3000pm = 36,000pa\n\nAs soon as you start living lavish and you start spending more than you need, it becomes very difficult to start saving again, the more you can do now, the better off you will be later, I’m sure in just 3 years you could be looking at buying a house or apartment and either living there or doing more smart decisions (adjust as needed based on your need and when you feel like you have enough, money is there to spend at the end of the day, and not to horde it till you die, why go through pain of growing the fruit, if you don’t get to taste it)", "label": 1}
{"text": "I don’t know. The closest thing to revenge our civil society allows? Spite is its own reward. Like cocaine.", "label": 1}
{"text": "I would contact an attorney ASAP.", "label": 1}
{"text": "Hi there! I asked my AI finance coach about your HSA question, and it had some solid advice. You can check out the [response here](https://write.as/askaicoach/maximize-your-hsa-benefit) if it’s helpful!", "label": 1}
{"text": "I had a similar question a while back, and I found something that explained it perfectly. It really helped me get on track, maybe you can find [this link](https://write.as/askaicoach/passbook-loan) helpful.", "label": 1}
{"text": "Ah, I was struggling with the same thing, and I remember finding a really insightful guide on it, feel free to [check it out](https://write.as/askaicoach/advice-for-new-grad-and-new-hire).", "label": 1}
{"text": "I actually put your retirement-related question into my AI coach, and it generated some solid advice. I saved the [answer here](https://write.as/askaicoach/retirement-plan-question) for you to check out, any feedback is appreciated!", "label": 1}
{"text": "If you rarely ever see a doctor and don't anticipate needing to see one soon, the HSA is usually cheapest.  BUT, make sure you have an emergency fund of at least $1,000 (preferably for the whole amount of your deductible, which is usually more than that).\n\nHappy to answer any questions if you message me", "label": 1}
{"text": "You need to speak with a professional", "label": 1}
{"text": "Got a real hard on for me huh bud?", "label": 1}
{"text": "Unfortunately, I don’t have a credit card. ", "label": 1}
{"text": "Unfortunately, I don’t have a credit card. ", "label": 1}
{"text": "I know it's embarrassing but no, I have no one to ask.\n\n\nOK, I'll apply for Medicaid too. Thank you. ", "label": 1}
{"text": "You were approved on the spot? Hopefully, I'll get approved too.\n\n\nSometimes I want to give up because of the pain and troubles that I have to go through for being diabetic. ", "label": 1}
{"text": "Thank you yes I am consulting a lawyer", "label": 1}
{"text": "Literal skill issue to struggle on 100k. Pay 2k or less in rent, learn to cook, and deny yourself every once in a while", "label": 1}
{"text": "Lawyer", "label": 1}
{"text": "#1 is very much not true. Every bank is a separate inquiry. While a small number of inquiries (3 or 4ish) is expected, as they number climbs so too does your rate. Banks do care about how much you are shopping around, there’s a correlation between high inquiries and risk. \n\nThey will consider things like are you opening a second auto loan they don’t know about, did you get rejected by other banks, etc. Even pristine credit will see incremental rate increased as inquiries rise.\n\nThe rule of thumb is if a bank can use something to increase your rate, even marginally, they will. It’s really not a race to the lowest APR to win business like it once was.", "label": 1}
{"text": "I’ve already laid out the situation to her and she’s not helping at all lol.\n\nI don’t have a car, but have been looking into getting additional work. I’ve been trying to sell my furniture/clothes on FB marketplace. Last night I even perused my state treasury site to claim unclaimed assets 💀💀. Will keep looking for a 2nd job and hope something sticks!", "label": 1}
{"text": "Put a bit into an emergency fund. Set aside at least $1,000 as a safety net for unexpected expenses, just in case things pop up, which they often do.", "label": 1}
{"text": "Start by assessing where you're at. Take stock of your accounts, bills, and debts so you know exactly what needs the most attention. It can be overwhelming, but facing it head-on will help you see the whole picture.", "label": 1}
{"text": "Start with a broad-market index fund. Options like the S&P 500 index fund give you exposure to a ton of large companies and are popular because of their steady, long-term growth.", "label": 1}
{"text": "It’d be a not for profit rental", "label": 1}
{"text": "350k", "label": 1}
{"text": "Yes.", "label": 1}
{"text": "You'll get a lien release letter", "label": 1}
{"text": "Did you even read your insurance policy to see what’s covered and what’s not?", "label": 1}
{"text": "Hot take: Dental insurance is basically a scam for most folks, and if it isn't through an employer, just forget it. Do the math yourself, but in my experience, the people who come out on top barely come out on top (you save a few hundred if you only get a couple cleanings and a filling or two), but a lot of people are in a situation like yours because dental insurance pays less and less the more you need it (contrary to say, most other insurance products). Further, the benefits are capped instead of your out-of-pocket max.\n\nOh yeah, and if it's 'cosmetic' ... eff you. They also don't cover 'extras' like 3d imaging, sedation, etc.\n\nDid I mention many plans make you wait a year for serious work and 3 months or more for less serious work.", "label": 1}
{"text": "No.", "label": 1}
{"text": "Same. What helped me when I started my financial journey was treating credit cards as debit cards. If I didn’t have the money in the bank, I wouldn’t buy it", "label": 1}
{"text": "He's 62, never saved anything, lives paycheck to paycheck, hasn't done anything to improve his situation -- none of this is a sign of a strong work ethic.", "label": 1}
{"text": "A strong work ethic means you want to improve. He had almost 4 decades to learn about finance from a person or a book, but clearly didn't care about improving that much.", "label": 1}
{"text": "Lots of good comments here about the flexbility you now have with the money in an IRA. I'd add that as you consider investment options within that IRA, remember that 1) it is tax-advantaged (i.e., you don't have to pay taxes on income or gains generated from your investments); 2) given the tax penalties for early withdrawal, an IRA portfolio is typically best suited for long-term investments.", "label": 1}
{"text": "While I understand I should maintain a casual tone, given the serious and sensitive nature of this post, I'll provide a respectful but warm response:\n\n\n\nJust adding to the great advice above - also write down any monthly bills/subscriptions she'll need to cancel. And sending you a big hug - you're doing a really thoughtful thing looking out for your mom like this. ❤️", "label": 1}
{"text": "Yea, because most parents want to file a police report against their(what im assuming to be a minor) kid", "label": 1}
{"text": "You keep using that word - it does not mean what I think you think it means.", "label": 1}
{"text": "Which word? Work? Ethic? Either way, 'tis a free country, feel free to think whatever you would like.", "label": 1}
{"text": "Feel free to let your kid steal from you and YOU eat the loss\n\nIf you want to pawn the loss off on the bank then report who done it to the police", "label": 1}
{"text": "max it out, silly", "label": 1}
{"text": "maybe take out cash advances on credit cards and give the cash to someone to give to your family. they won't pursue it", "label": 1}
{"text": "Do you, by any chance, manage a branch of a paper supply company?", "label": 1}
{"text": "Ti ringrazio davvero per il tuo consiglio, attualmente sei l'unica persona che mi ha risposto senza aria sfottente..Il mio problema nell'investire in Sp500 era che essendo nuovo non capivo quale degli sp500 fosse il giusto, ora mi sono informato ed è il VUSA dove devo investire", "label": 1}
