{"text": "The existence of anecdotes is proof of anecdotes yes I agree, please, try again :)", "label": 1}
{"text": "Yes :) seems like you're resorting to ad hominem now, hope you aren't because that would be very hypocritical and a bit sad", "label": 1}
{"text": "i'm just asking, because it seems you don't realize that anecdotes are rooted in personal experience.\n\nthen comes the part where you explain the experience. not hand-wave it away", "label": 1}
{"text": "How interesting they separate a school shooting from deer hunting. They look at the video games and the cop says get him away from that, The dad agrees, then says Colt took his first life and on his dad’s phone is a picture of Colt with the Deer’s blood on his face to commemorate the occasion.\n\n I’m not saying there’s a direct correlation, but many shouldn’t be encouraged to kill anyone human or non. We live in a melting pot of cultures that vary wildly with the exception that they’re mostly all entirely backwards.", "label": 1}
{"text": "Hunting and sports shooting is a recreational reason to own gun but the REAL reason to own a gun is for self defense and to maintain a well regulated militia. Which I know sounds silly to people when the government has tanks and nukes, but when you have to combat a tyrannical government; would you rather start with your fists or at least with some sort of offensive weapon. That being said. I agree that the challenge of not just gun violence but violence as a whole begins with people minds and hearts.", "label": 1}
{"text": "Holis, mucho gusto! \n¿Cómo están?", "label": 1}
{"text": "IOW, we should continue to rely on professional police to protect us and keep the peace?\n\nDALLAS MORNING NEWS, [**NEWS**](https://www.dallasnews.com/news/)[**WATCHDOG**](https://www.dallasnews.com/news/watchdog/)**,US. Justice Department report on Uvalde school shooting is an emotional but important read**\n\n**The 600-page report on the 2022 shooting at Robb Elementary depicts a cowardly law enforcement response - making it required reading for anyone wearing a uniform.**\n\n[https://www.dallasnews.com/news/watchdog/2024/01/29/us-justice-department-report-on-uvalde-school-shooting-is-an-emotional-but-important-read/](https://www.dallasnews.com/news/watchdog/2024/01/29/us-justice-department-report-on-uvalde-school-shooting-is-an-emotional-but-important-read/)", "label": 1}
{"text": "Lost me at “I tried to meet a few girls but they were usually bitching.”", "label": 1}
{"text": "I was about to stop there too, but i gave it a couple more sentences until the complaints about how everyone is shallow because they want sex. So? Slut-shaming doesn't help whatever argument you are getting ready to make.  The reason people don't want to be your friend is because you think you're better than them", "label": 1}
{"text": "It's all funny until this really starts affecting their mental health. I am not necessarily bitching about England or girls (I did make friends outside of the university) but I am talking about something that is happening below the radar- that the other generations hardly have a clue about. Here's a study - [https://www.hsph.harvard.edu/news/hsph-in-the-news/exploring-the-effect-of-social-media-on-teen-girls-mental-health/](https://www.hsph.harvard.edu/news/hsph-in-the-news/exploring-the-effect-of-social-media-on-teen-girls-mental-health/)", "label": 1}
{"text": "1. Philosophy’s Role in the Development of Knowledge: I think you’re overlooking how deeply philosophy has influenced almost every field we have today. What you call \"philosophy_1\" and \"philosophy_2\" are not just stagnant categories—they represent a progression. Philosophy started by asking fundamental questions, and as we refined those questions and methods, entire disciplines, like physics, psychology, and law, branched off. But this doesn’t mean philosophy itself became irrelevant; it evolved, and its foundational questions continue to shape and inform our understanding.\n\n\n\n\n2. Kant’s Contribution to Universal Human Rights: Dismissing Kant’s contributions to universal human rights as just “basic empathy” or something the Bible already covers overlooks how Kant shaped political and ethical thought. Kant proposed rights not simply as religious principles but as rational imperatives based on human dignity and autonomy, which had a huge impact on later political philosophy. The universal human rights principles we see in modern institutions, like the UN, owe a significant debt to this kind of philosophical framing.\n\n\n\n\n3. Debate on Innate Knowledge: While I agree that questions of innate knowledge are now often studied scientifically, Kant’s work was crucial in setting up these questions in the first place. He reopened debates about what humans might be born knowing or how we experience knowledge, a line of thought that paved the way for later work in psychology and neuroscience. Kant didn’t have today’s scientific tools, but his ideas helped shape the field, pushing others to look at cognition and development in new ways.\n\n\n\n\n4. Kant’s Ethical Theories: You seem to dismiss Kant’s ethics, like the categorical imperative, as pointless or impractical, but I think that misses the point. His ideas about duty and morality independent of consequences added a new dimension to ethics that Greek thought didn’t fully address. Kant’s deontology argued that moral value is intrinsic, not just a matter of pleasure or pain, and this had profound implications on how we approach moral reasoning, justice, and even legal structures today. His work was not intended as “real-world” guidelines like a rulebook but rather as a rigorous ethical framework to test and question our moral assumptions.", "label": 1}
{"text": "I don't call it pseudoscience because I'm brushing off the hard problem, I call it pseudoscience because he misrepresents empirical results. (See the **Scientific Evidence** section.)", "label": 1}
{"text": "You should read the books of kastrup and not just reddit posts about it. There is no spiritual woo in it, it's really just a very strong argument for idealism.", "label": 1}
{"text": "It doesn't provide any indication that Kastrup's views are pseudoscientific, and it *certainly* doesn't indicate that the Kastrup quote you presented misrepresents the scientific research. As a reminder, that quote is:\n\n>The latest experiments in quantum mechanics seem to show that, when not observed by personal psyches, reality exists in a fuzzy state, as waves of probabilities... Quantum mechanics has been showing that when not observed by personal, localized consciousness, reality isn't definite.\n\nThe abstract quoted above certainly deals with \"localized consciousness\" as the presumed observer, as observation is treated as a function of consciousness. If you want to say that observation doesn't require consciousness or that localized consciousness doesn't exist then that's...certainly something you can say, I guess. But that doesn't seem to be what anyone else is claiming, those don't seem to be claims that you have made elsewhere in this thread, and you haven't provided any sort of warrant for those claims", "label": 1}
{"text": "And it's a common misconception that \"not supported by scientific research\" means that it's been scientifically disproven. It's weird that you are willing to leap to conclusions based on a single sentence from Wikipedia, but completely unwilling to read the actual peer reviewed research you cite before saying it's being misrepresented\n\nHonestly, seems more like you are the one deliberately misrepresenting research here, and I would be curious what you think the paper believes an observation *is* if it's explicitly not a function of either an objective reality that exists independent of an observer (as the paper claims can't be proven), nor is it related to a localized consciousness which is doing the observing (as you claim)\n\n*Would* be curious, if you had actually read the article", "label": 1}
{"text": "I didn't say it was scientifically disproven, I said it wasn't considered a requirement. \"Observer\" has a technical connotation in quantum mechanics. This issue has been thoroughly hashed out over decades, and most modern experts regard this sort of [quantum mysticism as pseudoscience.](https://en.wikipedia.org/wiki/Quantum_mysticism) This article describes how the von Neumann-Wigner interpretation, which suggested that a conscious observer played a fundamental role in quantum mechanics, was an inspiration for modern quantum mysticism. Kastrup quotes this interpretation directly in his original paper.", "label": 1}
{"text": ">  It's weird that you are willing to leap to conclusions based on a single sentence from Wikipedia\n\nAnd these disparaging remarks are really unneccessary. Quoting a sentence does not mean that that sentence is the entire basis for my belief.", "label": 1}
{"text": "No, you didn't say it, you just implied it. Without that implication, it's just a non-sequitur that in no way, shape, or form addresses the very specific claims made in the articles you refused to read\n\nIt's incredibly poor reasoning, kind of like the idea that citing von Neumann-Wigner means you must be doing a scary, bad quantum mysticism instead of engaging with the scientific articles that Kastrup cites (which, again, *you have admitted to not reading*)", "label": 1}
{"text": "Disparaging? Methinks thou doth protest too much\n\nSorry, but citing a Wikipedia article in response to a specific peer reviewed article that you explicitly *did not* read makes it seem like you don't have much in the way of a basis for your belief or resources to support it. That's not denigration, that's accurate evaluation of the credibility of sources, and it doesn't escape my notice that you have completely failed to state what you think the article you claim is being misrepresented is in fact saying if it's not dealing with conscious observers when it calls an external objective reality into question", "label": 1}
{"text": ">I've read *most* of them, *especially in the months since making that post*\n\n🤣🤣🤣🤣🤣🤣\n\nI don't think any more needs to be said. At least you're right about this not being a productive conversation, lmao", "label": 1}
{"text": "So I've only fully read three out of four. Sue me.", "label": 1}
{"text": "\"I made demonstrably incorrect claims about articles I hadn't read at the time, some of which I still haven't read, because I wanted to provide a post-hoc rationalization for a belief I already held in a 'debate' sub. Big whoop\"", "label": 1}
{"text": "> what you think the article you claim is being misrepresented is in fact saying\n\nLook, if anyone else wants to come along and continue this line of discussion, please respond here I'd be happy to delve into it.\n\nBut you're lying about what I've said and being incredibly hostile, so I'm going to cut this conversation short. Have a nice day.", "label": 1}
{"text": "We all have eyes, dude. You just straight up asserted that articles you hadn't read are being misrepresented, then you got defensive when you were called on it\n\nHold that L and try to be better next time", "label": 1}
{"text": "I'm interested, but fairly ignorant on the topic, and don't have the time to watch right now... but is there a side to this argument that assumes consciousness is a just illusion arising through a flood of indivisible inputs, similar to our intuitive (but unsubstantiated) feeling of having free will, and therefore will have no real single physical source to find?", "label": 1}
{"text": "Rule 1: Watch before you reply.\n\nYes, there are theories like that, but Prof. Brown disagrees with them and they're not discussed in-depth here. Check out the wikipedia page on [eliminative materialism](https://en.wikipedia.org/wiki/Eliminative_materialism) as a starting point.", "label": 1}
{"text": "The idea that consciousness is a feature of our brain processes only is an element of Physicalism, and there's various subordinate views within physicalism to explain consciousness.  What would fit your description depends a lot on how strongly you mean the word \"illusion\"; many physicalists believe that consciousness exists but that it is a series of states our brain creates (this is a form of reductive materialism), others view the conscious mind as a sort of emergent property of our brains that arises out of many smaller individual components that add up to a thing we call consciousness (Emergentism). Both of these would disagree that consciousness is an *illusion*, but potentially agree that it arises from a flood of indivisible inputs and that there is no real single physical source (other than the trite answer of \"the nervous system\").  \n\nBut there is a position called \"Eliminative Materialism\" which more or less holds that consciousness truly is an illusion, and that all of our subjective experience and intuition that tells us that consciousness exists is just wrong.", "label": 1}
{"text": "Thanks so much for the substantive reply and giving me more to research!", "label": 1}
{"text": "Thank you for the info, and sorry for posting before reading.", "label": 1}
{"text": "Such a powerful reminder that in confronting darkness, we must be vigilant not to let it consume us.", "label": 1}
{"text": "Welcome to /r/philosophy! **Please read [our updated rules and guidelines](https://reddit.com/r/philosophy/comments/14pn2k9/welcome_to_rphilosophy_check_out_our_rules_and/?) before commenting**. \n\n/r/philosophy is a subreddit dedicated to discussing philosophy and philosophical issues. To that end, please keep in mind our commenting rules:\n\n###CR1: Read/Listen/Watch the Posted Content Before You Reply\n> Read/watch/listen the posted content, understand and identify the philosophical arguments given, and respond to these substantively. If you have unrelated thoughts or don't wish to read the content, please post your own thread or simply refrain from commenting. Comments which are clearly not in direct response to the posted content may be removed.\n\n###CR2:  Argue Your Position\n> Opinions are not valuable here, arguments are! Comments that solely express musings, opinions, beliefs, or assertions without argument may be removed.\n\n###CR3: Be Respectful\n> Comments which consist of personal attacks will be removed. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted.\n\nPlease note that as of July 1 2023, reddit has made it substantially more difficult to moderate subreddits. If you see posts or comments which violate our [subreddit rules and guidelines](https://reddit.com/r/philosophy/comments/14pn2k9/welcome_to_rphilosophy_check_out_our_rules_and/?), please report them using the report function. For more significant issues, please [contact the moderators via modmail](https://reddit.com/message/compose/?to=/r/philosophy) (not via private message or chat).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/philosophy) if you have any questions or concerns.*", "label": 1}
{"text": "That’s not what this sub is for. And realistically the way America has changed and force narratives everywhere, this is wholly political through and through. /r/politics might eat this up tho", "label": 1}
{"text": "Where is philosophy discussed at any point in his article. \n\nIf you mean to say any matter which has a relation to ethics and therfore politics is a matter of philosophy, than any political issues could be discussed here.\n\nThis is lazy crap and not fitting of the sub", "label": 1}
{"text": "Your comment was removed for violating the following rule:\n\n>**CR3: Be Respectful**\n\n>Comments which consist of personal attacks will be removed. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted.\n\nRepeated or serious violations of the [subreddit rules](https://reddit.com/r/philosophy/wiki/rules) will result in a ban.\n\n-----\n\nThis is a shared account that is only used for notifications. Please do not reply, as your message will go unread.", "label": 1}
{"text": "Your comment was removed for violating the following rule:\n\n>**CR3: Be Respectful**\n\n>Comments which consist of personal attacks will be removed. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted.\n\nRepeated or serious violations of the [subreddit rules](https://reddit.com/r/philosophy/wiki/rules) will result in a ban.\n\n-----\n\nThis is a shared account that is only used for notifications. Please do not reply, as your message will go unread.", "label": 1}
{"text": "Your comment was removed for violating the following rule:\n\n>**CR3: Be Respectful**\n\n>Comments which consist of personal attacks will be removed. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted.\n\nRepeated or serious violations of the [subreddit rules](https://reddit.com/r/philosophy/wiki/rules) will result in a ban.\n\n-----\n\nThis is a shared account that is only used for notifications. Please do not reply, as your message will go unread.", "label": 1}
{"text": "Your comment was removed for violating the following rule:\n\n>**CR3: Be Respectful**\n\n>Comments which consist of personal attacks will be removed. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted.\n\nRepeated or serious violations of the [subreddit rules](https://reddit.com/r/philosophy/wiki/rules) will result in a ban.\n\n-----\n\nThis is a shared account that is only used for notifications. Please do not reply, as your message will go unread.", "label": 1}
{"text": "Welcome to /r/philosophy! **Please read [our updated rules and guidelines](https://reddit.com/r/philosophy/comments/14pn2k9/welcome_to_rphilosophy_check_out_our_rules_and/?) before commenting**. \n\n/r/philosophy is a subreddit dedicated to discussing philosophy and philosophical issues. To that end, please keep in mind our commenting rules:\n\n###CR1: Read/Listen/Watch the Posted Content Before You Reply\n> Read/watch/listen the posted content, understand and identify the philosophical arguments given, and respond to these substantively. If you have unrelated thoughts or don't wish to read the content, please post your own thread or simply refrain from commenting. Comments which are clearly not in direct response to the posted content may be removed.\n\n###CR2:  Argue Your Position\n> Opinions are not valuable here, arguments are! Comments that solely express musings, opinions, beliefs, or assertions without argument may be removed.\n\n###CR3: Be Respectful\n> Comments which consist of personal attacks will be removed. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted.\n\nPlease note that as of July 1 2023, reddit has made it substantially more difficult to moderate subreddits. If you see posts or comments which violate our [subreddit rules and guidelines](https://reddit.com/r/philosophy/comments/14pn2k9/welcome_to_rphilosophy_check_out_our_rules_and/?), please report them using the report function. For more significant issues, please [contact the moderators via modmail](https://reddit.com/message/compose/?to=/r/philosophy) (not via private message or chat).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/philosophy) if you have any questions or concerns.*", "label": 1}
{"text": "Welcome to /r/philosophy! **Please read [our updated rules and guidelines](https://reddit.com/r/philosophy/comments/14pn2k9/welcome_to_rphilosophy_check_out_our_rules_and/?) before commenting**. \n\n/r/philosophy is a subreddit dedicated to discussing philosophy and philosophical issues. To that end, please keep in mind our commenting rules:\n\n###CR1: Read/Listen/Watch the Posted Content Before You Reply\n> Read/watch/listen the posted content, understand and identify the philosophical arguments given, and respond to these substantively. If you have unrelated thoughts or don't wish to read the content, please post your own thread or simply refrain from commenting. Comments which are clearly not in direct response to the posted content may be removed.\n\n###CR2:  Argue Your Position\n> Opinions are not valuable here, arguments are! Comments that solely express musings, opinions, beliefs, or assertions without argument may be removed.\n\n###CR3: Be Respectful\n> Comments which consist of personal attacks will be removed. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted.\n\nPlease note that as of July 1 2023, reddit has made it substantially more difficult to moderate subreddits. If you see posts or comments which violate our [subreddit rules and guidelines](https://reddit.com/r/philosophy/comments/14pn2k9/welcome_to_rphilosophy_check_out_our_rules_and/?), please report them using the report function. For more significant issues, please [contact the moderators via modmail](https://reddit.com/message/compose/?to=/r/philosophy) (not via private message or chat).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/philosophy) if you have any questions or concerns.*", "label": 1}
{"text": "Welcome to /r/philosophy! **Please read [our updated rules and guidelines](https://reddit.com/r/philosophy/comments/14pn2k9/welcome_to_rphilosophy_check_out_our_rules_and/?) before commenting**. \n\n/r/philosophy is a subreddit dedicated to discussing philosophy and philosophical issues. To that end, please keep in mind our commenting rules:\n\n###CR1: Read/Listen/Watch the Posted Content Before You Reply\n> Read/watch/listen the posted content, understand and identify the philosophical arguments given, and respond to these substantively. If you have unrelated thoughts or don't wish to read the content, please post your own thread or simply refrain from commenting. Comments which are clearly not in direct response to the posted content may be removed.\n\n###CR2:  Argue Your Position\n> Opinions are not valuable here, arguments are! Comments that solely express musings, opinions, beliefs, or assertions without argument may be removed.\n\n###CR3: Be Respectful\n> Comments which consist of personal attacks will be removed. Users with a history of such comments may be banned. Slurs, racism, and bigotry are absolutely not permitted.\n\nPlease note that as of July 1 2023, reddit has made it substantially more difficult to moderate subreddits. If you see posts or comments which violate our [subreddit rules and guidelines](https://reddit.com/r/philosophy/comments/14pn2k9/welcome_to_rphilosophy_check_out_our_rules_and/?), please report them using the report function. For more significant issues, please [contact the moderators via modmail](https://reddit.com/message/compose/?to=/r/philosophy) (not via private message or chat).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/philosophy) if you have any questions or concerns.*", "label": 1}
{"text": "They will forget about it like 5 seconds after the fireworks are over.\n\nI've been around enough animals during a firework display.", "label": 1}
{"text": "Me when I’m stupid:", "label": 1}
{"text": "How's highschool treating you?", "label": 1}
{"text": "> You can’t control thunderstorms happening.\n\nThat's not what a sitting US Congresswoman told me.", "label": 1}
{"text": "It's not about firework displays of a festival. \n\nIt's about not being an ass and getting the crappy firehazards of child injuring missiles for a tiny flash and loud disturbing bangs.\n\nHome fireworks are frankly ghetto/trailer park adornments.  Launching at 1am on weekdays...  they're a nuance at best and child endangerment when things go wrong, and the amount of yearly \"wrongs\" is so obviously harmful, but hey, that's why they're called \"accidents\" cause harming kids is fine when it's accidental and unintentional...  \n\nI took my dog to 4th of July firework display and he napped on my blanket.  I get the sparklers and neon lights for celebrating.  But the amusement of lighting a few home fireworks quickly became a campy cliche of cheap explosions and people wanting \"I made thing go boom.\"   \n\nBut hey, traditions and danger are part of the American dream.  A statistical dream of completely preventable deaths and mutilation.", "label": 1}
{"text": "Kill them all, God will recognise his own, seems, alas, more the spirit of our age.", "label": 1}
{"text": "I prefer the Mill quote:\n\n> Conservatives are not necessarily stupid, but most stupid people are conservatives...\nI never meant to say that the Conservatives are generally stupid. I meant to say that stupid people are generally Conservative. I believe that is so obviously and universally admitted a principle that I hardly think any gentleman will deny it. Suppose any party, in addition to whatever share it may possess of the ability of the community, has nearly the whole of its stupidity, that party must, by the law of its constitution, be the stupidest party; and I do not see why honorable gentlemen should see that position as at all offensive to them, for it ensures their being always an extremely powerful party . . . There is so much dense, solid force in sheer stupidity, that any body of able men with that force pressing behind them may ensure victory in many a struggle, and many a victory the Conservative party has gained through that power.\"", "label": 1}
{"text": "That's why education is the enemy of Conservatism", "label": 1}
{"text": "This is a ridiculous statement.  It's simply not true.", "label": 1}
{"text": "Conservative's 40+ year attack on public education in the US begs to differ.", "label": 1}
{"text": "Well, I've discovered that this subreddit is not really a place of actual logical discussion.  Someone here can make a statement that says, \"That's why education is the enemy of Conservatism.\" and it gets upvoted without any evidence or sources to back up the claim.", "label": 1}
{"text": "I know many teachers that would not agree. Maybe just like, speak for yourself. Your lazy, and likely untrue, generalization does nothing to move the needle in any direction.", "label": 1}
{"text": "You do understand the conservatives in England, 150 years ago, whom Mill was talking about, are not the same as modern day, Trump Republicans in the United States, right?\n\nAnd that fundamentally this is an appeal to authority joined to an ad hominem, you do understand that, right?", "label": 1}
{"text": "It’s ironic too, given the listing of rules at the top of this post.", "label": 1}
{"text": "But that isn't what the quote was talking about. He was talking about a specific political party in a specific time that has nothing to do with now or the US.", "label": 1}
{"text": "I would go as far to say that the large majority of people jumping on this quote with frothing agreement are unaware of the time period or anything that was going on at the time.", "label": 1}
{"text": "The election isn't even over and the left is already preparing to lose the next one.", "label": 1}
{"text": "What is there to understand? Nothing they say makes sense. Nothing. Some of what they say has the *veneer* of reason, but that’s all.", "label": 1}
{"text": "[the commenter isn’t wrong.](https://www.sciencedirect.com/science/article/abs/pii/S0160289624000254) IQ is an excellent predictor of political beliefs. Higher IQ = higher likelihood of being on the left.", "label": 1}
{"text": "It wasn't progressives who sought to end the teaching of critical thinking in Texas.", "label": 1}
{"text": "Yup, entertaining but it's a political polemic versus a philosophical response.", "label": 1}
{"text": "I mean it *was* said by the same guy lol", "label": 1}
{"text": "It's happened twice now, and apparently it will keep happening, yes. Repeating it in a disbelieving tone of voice, or stating that it shouldn't happen, or bemoaning how stupid voters must be to do this, etc. isn't a convincing argument.", "label": 1}
{"text": "Yet the modern conservative party still performs extraordinarily well with and loves the uneducated.  They've achieved great power with that alliance.", "label": 1}
{"text": "😮‍💨 <- that tone.\n\n\nThe argument is, basically,  how can she slap.\n\n\nAlso I really don't believe that not insulting Republicans as they continue the insults would change anything.", "label": 1}
{"text": "It is also a philosophical response. The most powerful political party in any case study, should it contain a majority of all supporters who are on par considered more stupid or ignorant than whatever the average is, necessarily is the most stupid party by its own right. It is also trivial that individuals who are less-knowledgeable regarding political matters are prone to reactionary politics, and that reactionary politics are necessarily conservative (a return to status quo).\n\nThat these are true statements by their own definition says nothing about how any given political supporter is influenced or manipulated, or otherwise interested in providing their support. Nor does it speak to the totality or actual composition of any political party and their constituents’ individual knowledge and abilities.", "label": 1}
{"text": "Wow. You answered the question. Right?", "label": 1}
{"text": "How smart are they if they lost the election against someone who should’ve been a slam dunk? Or is that a different intelligence metric? 🤔", "label": 1}
{"text": "Thank you for making me laugh today", "label": 1}
{"text": "Most first world countries are generally more progressive than the US. The things progressives fight for in the US are commonplace in many European countries and in no other western country does religion have such a stronghold on politics as the US.", "label": 1}
{"text": "The paper discusses IQ as a predictor of an *individual’s* political preference. It does not talk about the recent election or about people who ran Democratic campaigns. I have to explain this very simple concept to you, which makes me think that you’re a conservative", "label": 1}
{"text": "At some point you have to say the truth. Unpalatable as it may be. And the truth is that conservatives, on average, are dumber than liberals.", "label": 1}
{"text": "Conservatives, generally speaking.", "label": 1}
{"text": "Education has a weird relationship to conservatism. It tends to be a small portion of the most educated people, and a huge portion of the least educated people, that compose conservative movements.\n\nThe public faces of conservatism are almost always well educated people, often born into their wealth, who have realised how much power they can wield by continuing to misinform and under educate a large populace of primarily rural people.", "label": 1}
{"text": "I voted for Kamala, just find the selective introduction of this study unhelpful within context of the conversation, If you’re inferring that the reason people disagree with your ideas is because they’re intellectually inferior to you. It leads you to bias such as how you assume I voted for trump and therefore also intellectually inferior.\n\nLet me reverse uno and say I believe those who rely on IQ score to indicate intelligence are relying on a simple concept I might have to explain to you.", "label": 1}
{"text": "Conservatives are dumber than liberals, on average. This absolutely contributed to the Democratic Party’s loss. At some point we’ve got to stop pretending.", "label": 1}
{"text": "Yes! I agree with your outlook. It creates the conservative elite.", "label": 1}
{"text": ">It tends to be a small portion of the most educated people, and a huge portion of the least educated people, that compose conservative movements.\n\nThe few educated know they can utilize the many uneducated like a cudgel to get them power and the money that comes with it.", "label": 1}
{"text": "No one reading allat lil bro", "label": 1}
{"text": "It's not comparative, it's absolute. There are plenty of stupid liberals who happen to come to similar political conclusions as more intelligent liberals, and the same thing applies to conservatives. So it's not, \"conservatives are dumber than *me*, so they don't agree.\" It's, \"on the whole, conservatives are dumber as a total group, which means that, to the extent that an intelligent liberal's political views are changed by an understanding of issue complexity, conservatives, as a *group*, are less likely to follow or accept that reasoning.\" It does not mean that, were they more capable of following the reasoning as a group, they would accept the liberal viewpoint. Extremely intelligent conservatives disprove that assertion outright. And many views informed by complexity can arrive at the same conclusion as views that the issues are simple. Stupid liberals are proof of that as well. \n\nIQ is a highly imperfect measure of intelligence, but it does still strongly correlate. And to my knowledge, we don't have a better measure, but I would be happy to learn something new there. I look at it similar to political polling- it is decently indicative of what it measures, but it can be and often is wrong, sometimes very wrong. But it's not nothing.", "label": 1}
{"text": "What?", "label": 1}
{"text": "That Mill quote, and the U.S. election results, remind us that democracy is not a meritocracy. \n\nThis prompted me take a quick look at the Wiki article on meritocracy, and lo and behold, Mill was an advocate of meritocracy, in which educated people are given more voting power.", "label": 1}
{"text": "50% morons, 40% bigots, and 10% control hungry sociopaths with just enough wealth and intellect to think they're Einstein because they only ever compared to the people they lead.", "label": 1}
{"text": "Brother just described liberal ideology 😂", "label": 1}
{"text": "2012, Texas GOP.", "label": 1}
{"text": "Seems like you have an arbitrarily strict definition of progressive if  few 1st world countries would fit the bill. Presumably there are even fewer (or no) non 1st world countries...", "label": 1}
{"text": "How is not contextual to the quote above?", "label": 1}
{"text": "There was a documentary on this called idiocracy", "label": 1}
{"text": "You're speaking to a non-american here, what does \"sought to end the teaching of critical thinking\" mean?", "label": 1}
{"text": "It means the Texas GOP wanted the teaching of critical thinking skills(what is a fallacy and how to identify them, that kind of thing) to be removed from the curriculum.", "label": 1}
{"text": "Masters and servants", "label": 1}
{"text": "Is that true about all unpleasant truths? You _have_ to say them? Trump basically won because certain other unpleasant truths can't be stated on most of the internet.", "label": 1}
{"text": "And yet here we find ourselves out smarted", "label": 1}
