{"text": "[Snowbearding](https://imgur.com/aGelZNd)", "label": 1}
{"text": "Rivals the original Lucille Ball statue that was erected in Jamestown NY. [https://time.com/4442285/lucille-ball-statue-scary-lucy/](https://time.com/4442285/lucille-ball-statue-scary-lucy/)", "label": 1}
{"text": "thats great one lol", "label": 1}
{"text": "Keep your hateful politics out of this sub, also i must say, you fail to understand what subreddit you’re in, [this](https://www.reddit.com/r/pics/s/9o6H9Zg2jA) isn’t a picture you took", "label": 1}
{"text": "LOL! Please explain how this was a display of “hateful politics.”", "label": 1}
{"text": "It is a clear insult and the reason for why it’s hateful is clear through OP’s previous posts, active communities etc., he dislikes leftist politicians and is trying to poke fun at AOC", "label": 1}
{"text": "Because the title is deliberate bait.", "label": 1}
{"text": "Has anyone ever posted anything poking fun at Trump on this sub and have you told them to stop when they’ve done so?", "label": 1}
{"text": "I would never do that because I’m not soft. Just pointing out the obvious double standard.", "label": 1}
{"text": "Don’t blame them. Just desperate and pathetic.", "label": 1}
{"text": "Luce - Lucifer?!!", "label": 1}
{"text": "Fushigiiiiiiii", "label": 1}
{"text": "Why don’t we do a battle of Harris on knee pads suck poles?", "label": 1}
{"text": "[not photoshop but accurate](https://imgur.com/a/RDAzRuV)", "label": 1}
{"text": "I like yours.  It’s not infuriating.", "label": 1}
{"text": "“I’ve done more for these county back roads 🫸🫷 than anyone maybe in history, probably ever. 🫸    🫷You look at-and they’re gonna say-but it’s really not-the GARBAGE….on these roads👌….its like nothing we’ve seen before. You walk along the roads 🫸🫷and it’s like McDonald’s and beer cans and the tires like you’d put on your car, 🫸   🫷we have a LLLOTTA cars coming down these roads….very trashy, nasty people, who……they like to throw out their garbage, maybe they are garbage, I dunno but we’re gonna fix that. We’re gonna fix that and we’re gonna fix the roads, we’re gonna have beautiful roads…….we found aaaa SEX DOLL out there one time, very lifelike, you wouldn’t believe it. With the shapes and the orifices and-listen, we found it and I told them I said “You’re not gonna-“ and this probably sounds bad but I don’t care, I said “You wouldn’t believe it but if she was a little younger and a little cleaner I’d probably be dating her, she doesn’t talk, she doesn’t complain and I like that, AND SHES WEARING HOT PINK, which I love but anyway…..”", "label": 1}
{"text": "Oompa Loompa doompadee doo\n\nI’ve got another puzzle for you\n\nOompa Loompa doompadee dee\n\nIf you are wise you will listen to me\n\nWho do you blame when your kid is a brat\n\nPampered and spoiled like a Siamese cat?\n\nBlaming the kids is a lie and a shame\n\nYou know exactly who’s to blame:\n\nThe mother and the father!\n\nOompa Loompa doompadee dah\n\nIf you’re not spoiled then you will go far\n\nYou will live in happiness too\n\nLike the Oompa Loompa doompadee do", "label": 1}
{"text": "Oompa, Loompa, doom-pa-dee-dawesome. \n\nDwight is now gone, which is totally awesome. \n\nWhy was he gone? He was such a nice guy. \n\nNo, he was not. He was a total douche.\n\nDoompa-dee-doom.", "label": 1}
{"text": "Trump is more like Veruca Salt. The Oompa Loompas have a traitor amongst them.", "label": 1}
{"text": "\"Use me\"", "label": 1}
{"text": "I don’t like the look of this.", "label": 1}
{"text": "He looks like an over used sex doll.", "label": 1}
{"text": "I really like the shades of her facial complexion.", "label": 1}
{"text": "[Goldeneye](https://imgur.com/a/ZU8AhYx)", "label": 1}
{"text": "The perfect job for him.  He can blame the garbage for the stank.", "label": 1}
{"text": "[https://i.imgur.com/tTlAmOI.jpg](https://i.imgur.com/tTlAmOI.jpg)", "label": 1}
{"text": "He looks like a big butthole", "label": 1}
{"text": "Is he trying to get his face to match his trash vest?", "label": 1}
{"text": "That reminds me of that game: [Seaman](https://www.youtube.com/watch?v=-IV8hCvsXy0)", "label": 1}
{"text": "Its that a MAGA sex doll?", "label": 1}
{"text": "I literally thought that this was a joke. Will this POS not stoop to any level? Does he really think that besides his cult followers, anybody else will believe this nonsense? Besides the 5 to 7 year olds but they can't vote.. LMFAO", "label": 1}
{"text": "Agixabot AI: The Leading Crypto Trading Bot of 2024..... \nhttps://agixalert.com/2024/11/01/agixabot-ai-the-leading-crypto-trading-bot-of-2024/", "label": 1}
{"text": "Looks like he's getting ready for Putin.", "label": 1}
{"text": "\n\n[https://imgur.com/a/1HE64bO](https://imgur.com/a/1HE64bO)\n\nedit: ohh shiny", "label": 1}
{"text": "[Ivanka Trump holding Ivanka Trump holding Ivanka Trump holding Ivanka Trump holding Ivanka Trump holding Ivanka Trump holding...](https://i.imgur.com/XzTTI7w.png)", "label": 1}
{"text": "This is funny, but the original is not. I'm surprised the mods let animal abuse be posted on this sub. Kinda fucked up", "label": 1}
{"text": "How is the original animal abuse?", "label": 1}
{"text": "Lol 😂", "label": 1}
{"text": "Well you see on the internet any photo or video of a pet doing anything is animal abuse.", "label": 1}
{"text": "Salvadore Kitty", "label": 1}
{"text": "Please tell me this comment is satire.", "label": 1}
{"text": "First of all she was also a hooker in college don't forget that. And yes she's the worst choice for starting a mosh pit.\n\nAnd also for president. \n\nHighly decorated my ass. Successful hahaha hardly. \n\nMy non-support of Kamala has nothing to do with her just being a democrat.  92% of her staff quit when she took office as VP.   As a prosecutor, she was soft on crime and supported defund the police.  Biden appointed her to not only get to the root cause of border issues, but to secure the border as well - Which she has never done.  Biden/Harris have allowed hundreds of thousands of illegals, terrorists, child molesters and murderers into our country and people have lost their lives because of it.  She supported the violent riots all over the country and they have allowed the desecration of government property and the burning of our American Flag with no consequences to those responsible. Our country has never been in such turmoil more than under this administration. Even further, she started a go fund me for a cop killer, but let criminals walk while withholding evidence that exonerated an innocent man until AFTER higher courts forced her to accept it. \n\nTHOSE are a few of the reasons I do not stand by her OR accept her. I’m all for a female president. I would love to see that in my lifetime, but just not her.\n\nAnd also don't think she's a good choice to start a mosh pit.", "label": 1}
{"text": "Now if you wanna talk Kennedy we can do that.", "label": 1}
{"text": "Don't bother engaging. If you read through their comment history you'll see they're disengenuous as Fuck. They talk about the \"few\" reasons Harris ain't it all the while unironically making excuses for Trump. They made up their mind before Harris became a candidate.", "label": 1}
{"text": "That cat looks like Mr. Belvedere.", "label": 1}
{"text": "Get over yourself lmfao. Jesus fucking Christ.", "label": 1}
{"text": "I don’t even think it was drawn on right?", "label": 1}
{"text": "She actually was but that's OK you keep up with your little Kamala fantasy. Just don't go too hard on yourself when she loses.", "label": 1}
{"text": "She was not 😂\n\nYou were lied to\n\nAnd you believed it\n\nBecause you desperately wanted to believe it\n\nAnd it's such a weirdly transparent lie to believe, too\n\nHow embarrassing", "label": 1}
{"text": "Kinda sucks if it is, I understand that animals don’t really care about their looks but sharper can’t be good for them, I don’t know anything it just seems like it wouldnt", "label": 1}
{"text": "[We interrupt this PsBattle to bring you a special news bulletin!](https://i.imgur.com/pVLzxt4.jpg)", "label": 1}
{"text": "CHOMP", "label": 1}
{"text": "[Mother of Croissant](https://imgur.com/qBrLMi2)", "label": 1}
{"text": "Now I am quite glad I am not wearing that sweater. Never seen that before.", "label": 1}
{"text": "\n\n[You've been hit by...you've been struck by...](https://imgur.com/Z21HZnu)", "label": 1}
{"text": "[School picture day](https://i.imgur.com/bGb0ay2.png)", "label": 1}
