{"text": "That’s weird. You don’t think of Hitler when you think of Hitler?", "label": 0}
{"text": "I MAKE BIG VOTE 🥴", "label": 0}
{"text": "The largest and most sell funded gang in LA, THE LAPF.", "label": 0}
{"text": "Ew why did you post a picture of Voldemort’s circumcised dick?", "label": 0}
{"text": "Michelle Obama casts an illegal vote.", "label": 0}
{"text": "I bet he was the head of his class", "label": 0}
{"text": "Someone should inform him about his secure/open borders sign", "label": 0}
{"text": "You’re right, probably going to vote 5 times and if Trump loses still say the election was stolen while they are actively trying to rig it for him. I am not wrong. I just wish my morals for a “true” better America allowed me to commit voter fraud. Sad how far we have come.", "label": 0}
{"text": "[Gotcha](https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fi.dailymail.co.uk%2F1s%2F2019%2F08%2F07%2F21%2F16969056-7329259-Date_night_Kamala_Harris_and_talks_show_host_Montel_Williams_dat-m-1_1565209673634.jpg&f=1&nofb=1&ipt=b259052123d6f25c6b6d7fa4f0e1dddc51d528fb691a08198142679c5df37ef3&ipo=images)", "label": 0}
{"text": "Yeah.. ok hero", "label": 0}
{"text": "She voted for TRUMP", "label": 0}
{"text": "I only have the rumor mill to go by, but that says he was a miserable piece of shit first and just doubled down that everyone else was wrong when they left.", "label": 0}
{"text": "The 4202 election is going to be a real nail-biter. The Supreme Intelligence V.42 will be running against the genetically engineered Dino-man, Lord Xarkod. The race really shouldn't be as tight as it is since everyone knows Xarkod has been doing lizardman dog whistles.", "label": 0}
{"text": "Imagine being this much of a cuck for a man you’ve never met and would hate to be near you if you did…", "label": 0}
{"text": "Right out of Central casting for the Trump party!", "label": 0}
{"text": "The Dreaded Santa Monica Fascist", "label": 0}
{"text": "You either too old to understand the saying or you are just a delusional person. Nobody is whining, besides you and ya butt buddy.", "label": 0}
{"text": "What a piece of shit lol.", "label": 0}
{"text": "Joan Rivers says she's a Man and a woman at the same time too lol", "label": 0}
{"text": "That poor lawn", "label": 0}
{"text": "I support PMURT too.", "label": 0}
{"text": "> “Defund critical race theory”…….wow\n\nWhile not its only flaw, Critical Race Theory is an extremist ideology which advocates for racial segregation. Here is a quote where Critical Race Theory explicitly endorses segregation:\n\n>8 Cultural nationalism/separatism. An emerging strain within CRT holds that people of color can best promote their interest through separation from the American mainstream. Some believe that preserving diversity and separateness will benefit all, not just groups of color. We include here, as well, articles encouraging black nationalism, power, or insurrection. (Theme number 8).\n\nRacial separatism is identified as one of ten major themes of Critical Race Theory in an early bibliography that was codifying CRT with a list of works in the field:\n\n>To be included in the Bibliography, a work needed to address one or more themes we deemed to fall within Critical Race thought. These themes, along with the numbering scheme we have employed, follow:\n\nDelgado, Richard, and Jean Stefancic. \"Critical race theory: An annotated bibliography 1993, a year of transition.\" U. Colo. L. Rev. 66 (1994): 159.\n\nOne of the cited works under theme 8 analogizes contemporary CRT and Malcolm X's endorsement of Black and White segregation:\n\n>But Malcolm X did identify the basic racial compromise that the incorporation of the \"the civil rights struggle\" into mainstream American culture would eventually embody: Along with the suppression of white racism that was the widely celebrated aim of civil rights reform, the dominant conception of racial justice was framed to require that black nationalists be equated with white supremacists, and that race consciousness on the part of either whites or blacks be marginalized as beyond the good sense of enlightened American culture. When a new generation of scholars embraced race consciousness as a fundamental prism through which to organize social analysis in the latter half of the 1980s, a negative reaction from mainstream academics was predictable. That is, Randall Kennedy's criticism of the work of critical race theorists for being based on racial \"stereotypes\" and \"status-based\" standards is coherent from the vantage point of the reigning interpretation of racial justice. And it was the exclusionary borders of this ideology that Malcolm X identified.\n\nPeller, Gary. \"Race consciousness.\" Duke LJ (1990): 758.\n\nThis is current and mentioned in the most prominent textbook on CRT:\n\n>The two friends illustrate twin poles in the way minorities of color can represent and position themselves. The nationalist, or separatist, position illustrated by Jamal holds that people of color should embrace their culture and origins. Jamal, who by choice lives in an upscale black neighborhood and sends his children to local schools, could easily fit into mainstream life. But he feels more comfortable working and living in black milieux and considers that he has a duty to contribute to the minority community. Accordingly, he does as much business as possible with other blacks. The last time he and his family moved, for example, he made several phone calls until he found a black-owned moving company. He donates money to several African American philanthropies and colleges. And, of course, his work in the music industry allows him the opportunity to boost the careers of black musicians, which he does.\n\nDelgado, Richard and Jean Stefancic Critical Race Theory: An Introduction. New York. New York University Press, 2001.\n\nDelgado and Stefancic (2001)'s fourth edition was printed in 2023 and is currently the top result for the Google search 'Critical Race Theory textbook':\n\nhttps://www.google.com/search?q=critical+race+theory+textbook\n\nOne more from the recognized founder of CRT, who specialized in education policy:\n\n>\"From the standpoint of education, we would have been better served had the court in Brown rejected the petitioners' arguments to overrule Plessy v. Ferguson,\" Bell said, referring to the 1896 Supreme Court ruling that enforced a \"separate but equal\" standard for blacks and whites.\n\nhttps://web.archive.org/web/20110802202458/https://news.stanford.edu/news/2004/april21/brownbell-421.html", "label": 0}
{"text": "Love the Starbucks in the background", "label": 0}
{"text": "Lawn care.", "label": 0}
{"text": "This is the guy that needs a ice pick", "label": 0}
{"text": "This is a trash, political post", "label": 0}
{"text": "NGL, pretty bad ass. Come and loot my store, I DARE ya!", "label": 0}
{"text": "You should absolutely abandon country. National cahauvinism, patriotism an nationalism are all variants of the same evil.\n\nThe only thing that is really important is class solidarity. The workers of the world have more in common with each other than with the capitalists who own everything. Cast aside the stars and stripes, and hoist high the red banner of international labour!", "label": 0}
{"text": "She looks like ya aunt with to too much money", "label": 0}
{"text": "Why do you comment on it then?", "label": 0}
{"text": "We are very clearly not a serious country.", "label": 0}
{"text": "I assume his high school superlative was ‘most likely to commit and act of mass violence’", "label": 0}
{"text": "Agreed, you keep sucking DonOlds wrinkled little mushroom and I'll do my duty as an American pussy eater...", "label": 0}
{"text": "Racist", "label": 0}
{"text": "I'm sorry I am not as woke as you are, but I have never used tik tok.", "label": 0}
{"text": "lots of comments on how beautiful her hair is — i remember reading an article about her a few months ago where she said she had to wear white hairstyles (like a silk press) in office because black hairstyles aren’t widely accepted. now that her & barack are out of office, she gets to wear & dress how she wants!", "label": 0}
{"text": "“Defund Critical Race Theory” lol as a 6’5” Virginia born farm raised white male, this is some insane little dick energy. \n\nAny inequality we deal with is likely our own doing. Fuck this guy, and fuck that ideology. This country was not built by the innocence of the white men nor does it operate that way. Look at East St. Louis and tell me otherwise. \n\nIQ of a brick.", "label": 0}
{"text": "Yeah. Loser. Fucking jerk.", "label": 0}
{"text": "Should've pushed for McDonalds like Trump does. Or better yet, she should've just been a white woman for this country to respect her.", "label": 0}
{"text": "C+ Santa Monica Fascist, good sir", "label": 0}
{"text": "For people who hate windmills, they sure seem to thrive on wind power.", "label": 0}
{"text": "Chocolate microscopes?", "label": 0}
{"text": "The Shawn Ryan Show has a few. Love his show. His military interviews are great. Some of his non military guests are a bit questionable…", "label": 0}
{"text": "All that hatred from one guy, so easily canceled out by an opposing vote. Must drive him crazy.", "label": 0}
{"text": "it’s either all in the hips or loose seal.", "label": 0}
{"text": "What a totally normal and well adjusted individual…I don’t see the problem at all", "label": 0}
{"text": "That's odd because Trump stuff is never on Reddit. Tried to submit a link to a Kamala interview in a very popular subreddit and they banned me because it was an interview she didn't do well in. \n\nAnd everyone is supposed to believe Trump is the bad guy. \n\nJust say something anti Kamala or democrats and they want to come ruin your life", "label": 0}
{"text": "That's weird.", "label": 0}
{"text": "I find it hard to believe they would be legal allowed to shoot someone. Wonder how many if any shots were fired", "label": 0}
{"text": "This is peak mental illness", "label": 0}
{"text": "Trump always talks about people ‘outta Central Casting’. This fuckwad is the perfect portrayal of villainous evil asshole.", "label": 0}
{"text": "Last time I checked, convicted felons can’t vote", "label": 0}
{"text": "She's such an adorable and beautiful babe! \n\n( I can say that and not sound shallow, as I'm a hetro woman! Haha)", "label": 0}
{"text": "Douche", "label": 0}
{"text": "No you didnt. You answered a question thay you made on your own. My question not once did mention the pledge or petition.\n\nNow ill ask again.\n\nYes or no, is one or the requirements to get an raffle entry/ticket for the 1m is to be REGISTERED TO VOTE?", "label": 0}
{"text": "some were able to slide back down, others followed Senator McCarty turn the red scare and became the modern GOP.\n\nin germany it seems as though they were squashed flat for decades to revive once again during the past 10 years or so.", "label": 0}
{"text": "\"Hell no! Damned alligator BIT my hand off!\"", "label": 0}
{"text": "What’s LAPF?", "label": 0}
{"text": "The irony of the POW MIA flag hanging amongst all that garbage when your shir-for-brains leader said he \"liked people that weren't captured\"", "label": 0}
{"text": "What russia is doing is a million times worse. In fact a million people are dead or wounded… how many people were taken from iraq? Russia has abducted atleast 10,000 children, thats only the children that have been verified and thats only the children. Your a fking russian if you think what america did is the same….", "label": 0}
{"text": "Their one vote is negated by my one vote.\n\nThem spends hundreds or thousands on that shit will have no impact on my one vote negating theirs.", "label": 0}
{"text": "thanks, you're right! I always get them mixed up", "label": 0}
{"text": "Last election I knew someone who was out on the street selling all MAGA propaganda and I went out to see them… I sat out there and watched the type of people who were coming out to buy this stuff and I just couldn’t believe it.. they were all good folks who just had been fooled… it made me really question my fellow man", "label": 0}
{"text": "Honestly it is possible with the current Youtube algorithm. I occasionally stumble across 100 views videos.", "label": 0}
{"text": "And, then complain about the same government.", "label": 0}
{"text": "ok bot", "label": 0}
{"text": "Idk what you’re watching (Faux news). But she answers articulately with a calm and witty demeanor. Show me a freaking time where she has ever projected issues onto her opponent. Thank you come again.", "label": 0}
{"text": ">pulling off of being a flawless doesn't entail being perfect\n\nHoly fuck. You've got to be kidding me.", "label": 0}
{"text": "Voting for this because \"eggs are expensive\"?  Definitely not a cult...\n\n![gif](giphy|H47XFX8I6mdstTlGHY|downsized)", "label": 0}
{"text": "Would love to see the moment he is out there taking them all down. If ever, lol", "label": 0}
{"text": "OP does nothing but constant political posts", "label": 0}
{"text": "I love that you came to realize that! Me too. Age helped me as well.", "label": 0}
{"text": "When this man dies no one will attend his funeral.", "label": 0}
{"text": "She’s so pretty besides a lot of other great things.", "label": 0}
{"text": "Bet she voted for Trump.   lol j/k", "label": 0}
{"text": "Totally normal. Not weird at all.", "label": 0}
{"text": "Wassup Beautifu", "label": 0}
{"text": "Roy Cohn Jr.", "label": 0}
{"text": "Voting like him", "label": 0}
{"text": "A mind is a terrible thing to waste.", "label": 0}
{"text": "That is definitely a punch me face", "label": 0}
{"text": "I for one am very skeptical of the polls. I don’t think their are any more Trump voters than 2020, just more vocal. \n\nI say he gets beat. Maybe badly", "label": 0}
{"text": "Or, as the journalist and blogger Marcy Wheeler refers to him, discount Goebbels.", "label": 0}
{"text": "Copium", "label": 0}
{"text": "The genocidire", "label": 0}
{"text": "ok, bot", "label": 0}
{"text": "Full of sociopath", "label": 0}
{"text": "Is it just me, or does he look like a guilty defendant at the Nuremberg trials?", "label": 0}
{"text": "I think it's also due to having more melanin, so the skin is way more protected against the harsh UV light.", "label": 0}
{"text": "\"Big Mike\" lol.", "label": 0}
{"text": "Nah people are just being weird with the glazing. She looks old AF (because she is)", "label": 0}
{"text": "Why does Trump the creepiest people around him?", "label": 0}
{"text": "Same or soster!\n\n![gif](giphy|fjallj45M1aoM)", "label": 0}
{"text": "He’s also probably the type of dipshit to scribble out Kamala and invalidate his vote", "label": 0}
{"text": "The lawn doesn't even look that good", "label": 0}
{"text": "SSI is normally around 1800 a month. They can normally still get SNAP for another 200ish for food.... but once you do the math for rent- if you are living alone- it is just not enough.\n\nIn my area- semi decent 1 bedroom s 1600, you can find places for 1200 but they are old and normally have infestations..  SNAP covers food, but 200 for utilities is barely enough.\n\nSo you need a roommate in your 70ies if all you have is a pension.  A 2 bedroom may be 2k, but there is more breathing room dropping 1k per month of that on rent vs. 1600 (and utilities can be shared, like internet, netflix, ect).  Some figure that out and make it work, others never do and end up homeless.\n\nThere are housing subsidies, but in many places the wiatlist is so long they will be dead by the time they come off of it...  Even to barely scrape by (ie not having a car since that is another several hundred a month), you need a roomie.", "label": 0}
{"text": "That's a broken soul.", "label": 0}
{"text": "But thats why we need it, its a last resort while you sort yourself out 👍", "label": 0}
{"text": "Define fascist and explain how Trump is one. ", "label": 0}
{"text": "They all are.  Just little subservient cowards.", "label": 0}
{"text": "Thanks for pointing it out. Sounds like he should be paid by someone at this point", "label": 0}
{"text": "What drives me crazy is the disrespect to the American flag being flown so low beneath the Trump flag on top.\n\nWhenever you see these obnoxious flag displays the American flag is either to the beneath, smaller, or displayed 2nd to the Trump flag.", "label": 0}
{"text": "What are you talking about?", "label": 0}
{"text": "I find it funny that modernity has started to reverse the old adage of growing more conservative as you get older.", "label": 0}
{"text": "Do these people even know what CRT is? The white washing of history is so fucking deplorable.", "label": 0}
{"text": "Hahah, yeah right, comatose Joe already beat Donnie..DonOlds diaper is full and he's ready to spend his retirement the same way he spent his time as president...by playing golf....what a fkn joke", "label": 0}
{"text": "At that point he’s earned two votes lmao not that he should get them", "label": 0}
{"text": "ok, bot", "label": 0}
{"text": "The good news is that he can express his opinion as loudly as he likes, still only gets one vote.", "label": 0}
{"text": "If they want to deport liberals... Just try to imagine what they want to do to actual leftists.", "label": 0}
{"text": "😂", "label": 0}
{"text": "Also a good thing you don't even get how English language naming methods generally work.", "label": 0}
{"text": "you were already going to, friend ;)", "label": 0}
{"text": "Why are people convinced this woman is trans? Insecure conservatives who are shorter and have flabby arms?", "label": 0}
{"text": "only once. no matter how many flags", "label": 0}
{"text": "Man Reddit is so insufferable in Election season", "label": 0}
{"text": "ok, bot", "label": 0}
{"text": "People’s faces will lose fat with age. I think you’re being overly critical. \n\nI doubt she is on ozempic, unless she has diabetes…which is also possible…. And none of our business.   My 66-year-old mother was diagnosed with diabetes this year, and she eats healthy, exercises, and is never above a size 6. She’s now on ozempic because of it. Sometimes it just happens.", "label": 0}
{"text": "Ok, you remember all the orange man bad bullshit they used to comment and now the signs literally day Trump safety Kamala crime.", "label": 0}
{"text": "lol “educated” + voting for Trump = get a refund. They ripped you off.", "label": 0}
{"text": "I think that's good, fascists and alike are always bad", "label": 0}
{"text": "Q tip suppository", "label": 0}
{"text": "You’re gonna hate him.", "label": 0}
{"text": "I wonder who she voted for", "label": 0}
{"text": "Bit more whataboutism right back..https://en.wikipedia.org/wiki/Malaysia_Airlines_Flight_17", "label": 0}
{"text": "A fine example of human backwash", "label": 0}
{"text": "literally who cares.", "label": 0}
{"text": "I know, kinda like abortion.  >70% of the country wants access to it.  The other 30% have taken it away from us by manipulating the 50-ish% that vote republican.", "label": 0}
{"text": "ok, bot", "label": 0}
{"text": "Deport liberals and defund critical race theory? Who the fuck made these signs.. and how do they embody democracy and liberty for all..? 🤣", "label": 0}
{"text": "He can have a thousand trump flags but his vote still only counts once lol", "label": 0}
{"text": "Serves these people right.", "label": 0}
{"text": "We need to protect our children!!!\n\nMeanwhile 6+ year olds in the car: “Daddy, what does “fuck” mean? That sign said fuck? Also, what does “suck my dick mean?”", "label": 0}
{"text": "Op got butt hurt and took away points. Oh no!", "label": 0}
{"text": "She voted for Trump.", "label": 0}
{"text": "Can't even see the double wide behind all that paraphernalia.....", "label": 0}
{"text": "Either he’s voting for Trump or someone is playing a very cruel prank on a liberal 😂", "label": 0}
{"text": "So sharpe she couldn't think of a mistake she's ever made in her life. Even computers aren't that accurate.", "label": 0}
{"text": "fine, don't vote", "label": 0}
{"text": "Due to “Bidenomics” he could only afford $10,000 in flags and signs.\n\nPoor dude.", "label": 0}
{"text": "All those flags and only 1 vote.", "label": 0}
{"text": "Until you need one", "label": 0}
{"text": "The problem is Trump never wins the majority vote. It’s gerrymandering and the electoral college that’s fucking is over.", "label": 0}
{"text": "The Greeks called this “irony”.", "label": 0}
{"text": "No because he's no longer with us.", "label": 0}
{"text": "But it seems like he sure spent a lot of good money on that", "label": 0}
{"text": "🤢", "label": 0}
{"text": "Black don’t crack!", "label": 0}
{"text": "Fair enough.", "label": 0}
{"text": "*Future* President Harris (plz)", "label": 0}
{"text": "Weird Halloween decorations", "label": 0}
{"text": "Yeah but think about it.  She took a creampie from Stephen Miller.", "label": 0}
{"text": "Dude, that’s Roy Cohn!", "label": 0}
{"text": "I was aware of a punchable face, but I wasn't sure there was such a thing as a punchable whole head", "label": 0}
{"text": "It would have been on the news still. I don't know WTF your dad was talking about. Black people were targeting Asian owned stores, mostly Korean, because they felt like they invaded and took advantage of their neighborhoods. There was, and still is, a lot of animosity between black residents and Asian business/store owners. Maybe your dad just didn't know what he was talking about.", "label": 0}
{"text": "Meet the Jewish Nazi who will run all the immigrant detention camps. This guy has a black soul.", "label": 0}
{"text": "I’m from Brazil, and we have our fair share of black people commiting crimes, hopefully our socieity was never divided enough some types of crimes known to be commited only by blacks, it would just make everybody more racists. I feel bad for America, people are a by product of their environment and their behavior make the environment for the newer generations", "label": 0}
{"text": "At least he included a phone number.", "label": 0}
{"text": "What’s up with her hair?", "label": 0}
{"text": "Trump did not start any new wars your party did!\nIt was the Republican Party that ended slavery, not you!", "label": 0}
{"text": "Economy must be doing great if he can afford all of this stuff to later be thrown away in a fit of rage when he loses. This guy knows he still only gets one vote, right?", "label": 0}
{"text": "I’m taking a vacation to the US just to vote against him!!!", "label": 0}
{"text": "\"what I can't stand about those durned woke alphabet soup rainbow queers is how they're always shoving it in our faces and making it their whole identity, ya know?\"", "label": 0}
{"text": "I have a guy like this in my town but he makes his own signs and makes all sorts of stuff out of scrap", "label": 0}
{"text": "Eh, Kamala's not really doing too well with her interview tour....", "label": 0}
{"text": "Imagine he ends up not voting.", "label": 0}
{"text": "Nice, keep it up!", "label": 0}
{"text": "Of course it is. He’s a moron and a hypocrite, through and through.", "label": 0}
{"text": "I’d rather her a president than Trump Biden or Harris.", "label": 0}
{"text": "Ssssh, you aren't supposed to say that... he won a Nobel Peace prize for that!", "label": 0}
{"text": "Wow.\nI definitely did a double take. \nShe honestly looks amazing for age.", "label": 0}
{"text": "World class cunt!", "label": 0}
{"text": "You know, as an undecided voter, this election cycle has been a tough one, but ᑫMUЯT has really started a resonate with me lately.", "label": 0}
{"text": "China would like to thank this individual for supporting a decent sized village with all his expenditures on their products.", "label": 0}
{"text": "What a snake.", "label": 0}
{"text": "Got my papers today Kennedy jeff for the win baby🤩", "label": 0}
{"text": "Can we just vote....that yards should never look like this", "label": 0}
{"text": "Sorry, i forgot that expressing an opiniom was allowed only under certain conditions", "label": 0}
{"text": "Fuck yea! Let’s go Trump!", "label": 0}
{"text": "It’s a face you could just punch 🤜", "label": 0}
{"text": "![gif](emote|free_emotes_pack|give_upvote)", "label": 0}
{"text": "I just think so highly of her.", "label": 0}
{"text": "Stunning", "label": 0}
{"text": "I think it highly depends on what school district you were taught in.  The US gov't only mandates things like basic reading/writing and arithmetic and leave everything else up to the local school boards.\n\nSo, much of the southern states call our civil war the \"war of northern aggression\" and leave out the fact that most of the south was filled with slaver owners and the whole slave trade economy that fed it.", "label": 0}
{"text": "What a sad personality to adopt.", "label": 0}
{"text": "Confirms your bunch is as slow as you are gullible", "label": 0}
{"text": "KoroiNeko, thank you for your submission. It has been removed for violating the following rule(s):\n\n---\n\n- Rule 2: No pictures with added or superimposed digital text, emojis, and \"MS Paint\"-like scribbles. \n\n---\n\nFor information regarding this and similar issues, please see the [rules](https://www.reddit.com/r/pics/wiki/index/) and [title guidelines](/r/pics/wiki/titles). \r\n\r\nIf you have any questions, please feel free to [message the moderators via modmail.](https://www.reddit.com/message/compose?to=/r/pics&subject=Question%20regarding%20the%20removal%20of%20this%20submission%20by%20/u/KoroiNeko&message=I%20have%20a%20question%20regarding%20the%20removal%20of%20this%20%5Bsubmission.%5D%28https://redd.it/1gbhs17%3Fcontext%3D10%29)", "label": 0}
{"text": "I’m sure at least one person who drove under this and was on the fence voting wise will think, “u know what, fuck that guy”. Harris ✅ \n\nSo thanks, idiot.", "label": 0}
{"text": "I'm voting for him too, but . . . Some people are crazy over it.", "label": 0}
{"text": "I mean, if you don't like it, why do you stay in here?", "label": 0}
{"text": "Can't fucking wait for her to lose. She's the type of disgusting that is needs to be removed from politics. She wouldn't survive a fucking day in a normal job. Maybe that's why she was busy fucking her way to the top before to get favors. \n\nIf Trump had fucked a woman 40 years younger to make it to the top you'd never hear the end of it.", "label": 0}
{"text": "When Kamala was growing up her area had well groomed lawns, maybe this guys just trying to keep up.", "label": 0}
{"text": "You know?  Honestly, he looks sufficiently disappointed with his life choices in this pic for me to forgive him should he request it of me sometime in the future.", "label": 0}
{"text": "Thanks for letting us know you identify with and support a [Felon](https://apnews.com/article/trump-trial-deliberations-jury-testimony-verdict-85558c6d08efb434d05b694364470aa0) and [Rapist](https://en.wikipedia.org/wiki/E._Jean_Carroll_v._Donald_J._Trump) who [illegally](https://www.brennancenter.org/our-work/research-reports/fact-check-trumps-georgia-call-raffensperger) attempted to [overturn](https://en.wikipedia.org/wiki/Trump_fake_electors_plot) an election, who is the leader of a party that has **[38 TIMES MORE CRIMINAL CONVICTIONS](https://rantt.com/gop-admins-had-38-times-more-criminal-convictions-than-democrats-1961-2016)** (stats from before the Trump era) than the other party.\n\nWe'll be sure not to take you seriously and keep our children away from you.", "label": 0}
{"text": "So we aren’t gonna talk about Election Fraud and the Mail in Ballots being the worst election fraud ever huh ok I guess Civil War is gonna happen good luck guys 🤷‍♂️", "label": 0}
{"text": "Thank god my one vote cancels out his vote.", "label": 0}
{"text": "That’s bizarre. Who do you think of when you think of Napoleon?", "label": 0}
{"text": "dear god imagine being this much of a meat rider to absolutely anything or anyone at all", "label": 0}
{"text": "I’m guessing he has money.", "label": 0}
{"text": "Follow this guys lead please.", "label": 0}
{"text": "Puzzleheaded_Time_44, thank you for your submission. It has been removed for violating the following rule(s):\n\n---\n\n- Rule 1: No screenshots or pics where the only focus is a screen. No AI-generated pics\n\n---\n\nFor information regarding this and similar issues, please see the [rules](https://www.reddit.com/r/pics/wiki/index/) and [title guidelines](/r/pics/wiki/titles). \r\n\r\nIf you have any questions, please feel free to [message the moderators via modmail.](https://www.reddit.com/message/compose?to=/r/pics&subject=Question%20regarding%20the%20removal%20of%20this%20submission%20by%20/u/Puzzleheaded_Time_44&message=I%20have%20a%20question%20regarding%20the%20removal%20of%20this%20%5Bsubmission.%5D%28https://redd.it/1gbh3kh%3Fcontext%3D10%29)", "label": 0}
{"text": "Thanks for letting us know you identify with and support a [Felon](https://apnews.com/article/trump-trial-deliberations-jury-testimony-verdict-85558c6d08efb434d05b694364470aa0) and [Rapist](https://en.wikipedia.org/wiki/E._Jean_Carroll_v._Donald_J._Trump) who [illegally](https://www.brennancenter.org/our-work/research-reports/fact-check-trumps-georgia-call-raffensperger) attempted to [overturn](https://en.wikipedia.org/wiki/Trump_fake_electors_plot) an election, who is the leader of a party that has **[38 TIMES MORE CRIMINAL CONVICTIONS](https://rantt.com/gop-admins-had-38-times-more-criminal-convictions-than-democrats-1961-2016)** (stats from before the Trump era) than the other party.\n\nWe'll be sure not to take you seriously and keep our children away from you.", "label": 0}
{"text": "The brain is missing entirely", "label": 0}
{"text": "I'm well aware. From Snopes:\n\n> In a news conference after the rally protesting the planned removal of a Confederate statue, Trump did say there were \"very fine people on both sides,\" referring to the protesters and the counterprotesters. He said in the same statement he wasn't talking about neo-Nazis and white nationalists, who he said should be \"condemned totally.\"\n\nOne side was dominated by Nazis and white supremacists (as confirmed by Snopes) protesting the removal of a statue of Robert E Lee, it's no reach to view that as praising the Nazis and white supremacists. (he then walked back his Nazi sympathy like he walked back his unified Reich slip, cowardly liar that he is). You left out Trump's condemnation of the Nazis along the lines of Harris' condemnation of Hamas - why? I've already pointed out his overtly, undeniably Nazi rhetoric, we can look at his policies, common enemies, etc.\n\nWhat do you think it says about you that you see Trump posting videos about building a unified Reich and the immigrants polluting the blood of the nation, praising white supremacists and Nazis, and you *still* jump to his defence? What are you personally most excited about in Trump's unified Reich?", "label": 0}
{"text": "Is that a waning gibbous on his head?", "label": 0}
{"text": "it do be like that with the lizard people", "label": 0}
{"text": "I’m not surprised it’s fake he’s had assassinations attempts - it’s not diffident than Kamala going down to the boarder for pictures lmao it’s all fake.", "label": 0}
{"text": "That outfit and hairstyle look gorgeous on her", "label": 0}
{"text": "Wonder how much China makes with these elections", "label": 0}
{"text": "Agreed. Have your principles but have your pragmatism too. And recognize that in others whose job it is to work with these kinds of people.", "label": 0}
{"text": "Was just gonna say... Wait she looks younger... 🧐 Being a nice human being might age you backwards. No sources cited.", "label": 0}
{"text": "Yeah they’re being crazy and I’m just trying to find the most respectful way to express my thirst", "label": 0}
{"text": "I don't ultimately like hoa but there has to be a limit on accordion amount of political flags you can have in one yard", "label": 0}
{"text": "Why is she terrible?", "label": 0}
{"text": "The fact that you are defending trumps behavior shows just how unwilling you are to accept information contrary to your beliefs.", "label": 0}
{"text": "i think they're just grown out 😂😂", "label": 0}
{"text": "You're voting for Trump, lol, he's not a serious person", "label": 0}
{"text": "Lol. You sound like a grade-A moron.", "label": 0}
{"text": "Not weird at all", "label": 0}
{"text": "I'll have the side salad. If it's on top I send it back.", "label": 0}
{"text": "It's the comrades... literally. All reporting to comrade Kamala", "label": 0}
{"text": "Yes, but he's only voting once- just like the rest of us. And if he's not, I'm sure he'll be caught. \n\nAll those signs make it look like he's trying to make up for some sort of deficiency- I wonder what it is?", "label": 0}
{"text": "Mental illness", "label": 0}
{"text": "Spent a mortgage payment on Trump flags.", "label": 0}
{"text": "At least it's only one vote!", "label": 0}
{"text": "I wuv her.", "label": 0}
{"text": "It means all the racists came out in droves when a black man became president. With Trump, they have someone who shares their views and are losing their minds at the thought of another black president, and the fact it's a woman even more so. So hence the need for their hankies to wipe the tears away .", "label": 0}
{"text": "It'd ok to dislike Trump, but I dont think you truly know what a fascist is...", "label": 0}
{"text": "Blue nails say everything", "label": 0}
{"text": "Somebody has to rake the forests!", "label": 0}
{"text": "Pro tip, each flag added to your lawn increases your vote multiplier by x2", "label": 0}
{"text": "Dude out here coming with outright racism.", "label": 0}
{"text": "How am I older than him but I look younger?", "label": 0}
{"text": "Mental illness", "label": 0}
{"text": "Well did you see his dementia? Although to be fair now the presidency that caused it probably", "label": 0}
{"text": "Let me guess, far left? Don’t worry, I support Kamala but think about it from a person with a different political perspective. You love the sub the then it gets over run with political that put down you views. What if this sub were all trump supporters and you had to scroll through endless posts saying how cool he is? Thats how others feel. I understand if you don’t completely agree with my statement but it should be too difficult to see where I’m coming from.", "label": 0}
{"text": "It actually CLEARLY SAYS qmurt, who’s the idiot now", "label": 0}
{"text": "I love what she is wearing too.", "label": 0}
{"text": "I hate that artform, i like natural nails.", "label": 0}
{"text": "Sad boy", "label": 0}
{"text": "lol, and there it is.", "label": 0}
{"text": "I will be making sure I vote, and triple checking my selections before submitting.", "label": 0}
{"text": "I bet he doesn’t know what a kilometer is", "label": 0}
{"text": "More like Oooooooohhhhhhhh...Helllllllllll no to Trump..this MF wanna be Hitler/Putin game show con man", "label": 0}
{"text": "Hahahahah.  Hahahaha", "label": 0}
{"text": "Hi. Trans person here. I’m just giving as much as I’m getting from yall.", "label": 0}
{"text": "I like to go up to these kinds of people and tell them, “I can’t wait to cancel out your vote, after you expended all this time, energy, and money.”", "label": 0}
{"text": "Sue him for destroying your property value.", "label": 0}
{"text": "Evil the Incel", "label": 0}
{"text": "Who are they voting for?", "label": 0}
{"text": "I was gonna say this too 😂 she looks too good!", "label": 0}
{"text": "I hate mixed signals!", "label": 0}
{"text": "Not a cult", "label": 0}
{"text": "That works well for Barack", "label": 0}
{"text": "Dead eyes Miller", "label": 0}
{"text": "This is spot on. Like really, you're even asking if this a real quote. There are a thousand other quotes of his that are dumber than this.", "label": 0}
{"text": "she looks better than my partner’s grandma whos barely 75", "label": 0}
{"text": "Fucking awesome", "label": 0}
{"text": "Perfectly normal behavior….", "label": 0}
{"text": "Wait, I thought Obama golfed more /s", "label": 0}
{"text": "I can name you 27 of Trumps mistakes if yould like, to start with at least", "label": 0}
{"text": "Stephen Miller is so toxic his own hair follicles left him.", "label": 0}
{"text": "This is like actually mentally insane, even if he was supporting the greatest canidate the universe will ever see this would not be ok", "label": 0}
{"text": "You and your dad are ignorant", "label": 0}
{"text": "He looks like he's gonna get killed by his brother, Vito.", "label": 0}
{"text": "This is just reverse american exceptionalism. Not everything is about America. ruzzia has been a continuous imperialist autocracy since before USA existed. Stop feeling sorry for yourself.", "label": 0}
{"text": "Mmmboy are you fat.", "label": 0}
{"text": "Voted Tuesday morning. Thanks.", "label": 0}
{"text": "Definitely too old. I guess complaining about a post instead of just moving on is what you kids do these days.  In my day we had to walk up hill 12 miles both ways to post a comment, so we didn’t waste replies. Now: Get off my lawn. ;)", "label": 0}
{"text": "I don’t understand why he has to be so cryptic about it though.\n\n![gif](giphy|a5viI92PAF89q)", "label": 0}
{"text": "They don't get laid because they are dickheads. They just look for anything to blame so they don't have to take responsibility.", "label": 0}
{"text": "I always loved her, classy, funny & a good mom. Her relationship to Barack always made me smile too, they’re both lucky to have each other. ❤️", "label": 0}
{"text": "Her ballot might be burned by some USPS Trump loyalists", "label": 0}
{"text": "Uh oh, you won't like what they've got planned for nursing home food", "label": 0}
{"text": "\"WELCOME TO THE JUNGLE\" in Axles voice", "label": 0}
{"text": "a husk", "label": 0}
{"text": "“wank” means masturbate; in any case, he probably is a masturbator, as are most adults; but i don’t think the word was invented for him", "label": 0}
{"text": "![gif](giphy|o7GyDEjsyCuGI)", "label": 0}
{"text": "As a Trump supporter, you are in no position to call anyone dumb.\nYou guys are the stupidest gullible assholes in the world.", "label": 0}
{"text": "Because the founding fathers needed to appease the slave owners with affirmative action.", "label": 0}
{"text": "Wonder if these people understand the concept of irony?", "label": 0}
{"text": "His mind is a terrible thing.", "label": 0}
{"text": "And all that and his vote only counts as 1.", "label": 0}
{"text": "\"ITS NOT A CULT!\"", "label": 0}
{"text": ">Eh whatever. It was sexy.\n\nEwww. \n\nLooks like I was mistaken on them being introduced through Epstein, though they were all close acquaintances regardless:\n\nhttps://www.reddit.com/r/pics/comments/p8pv5h/donald_trump_melania_trump_jeffrey_epstein_and/", "label": 0}
{"text": "Wonder who she voted for", "label": 0}
{"text": "I wonder how much of his repulsiveness is nature vs nurture...", "label": 0}
{"text": "Go bug your mom.", "label": 0}
{"text": "Wow!! She is radiant!!!", "label": 0}
{"text": "Hahahaha this cracked me up. I’ll get off that lawn ;) 😂😂", "label": 0}
{"text": "Just change the name of the sub to r/politics2", "label": 0}
{"text": "Fucking evil little bastard.", "label": 0}
{"text": "You guys know its the exact same on the other side right?", "label": 0}
{"text": "> suck my dick\n\nI wouldn’t recommend. Small parts may be a choking hazard.", "label": 0}
{"text": "I particularly like the Deport Liberals signs. Wonder where they’ll send me?", "label": 0}
{"text": "He's gotta get his money's worth for all the banners he paid for", "label": 0}
{"text": "I need that phone number so I can call him and tell him I need my lawn freshly cut for when Kamala wins.", "label": 0}
{"text": "This really wants someone to suck his dick. Preferably a Democrat, I guess.", "label": 0}
{"text": "Anyone know of a good dupe for the cardigan she’s wearing? Or something slightly more casual but still with padded shoulders? It looks so good!", "label": 0}
{"text": "It's an option at the cost of another ticket! Even though lap carry was an option to us, I felt more comfortable buying a separate ticket considering that NTSB recommends children in separate restraints and the increased incidence of turbulence injuries reported in the news.", "label": 0}
{"text": "Who is that?", "label": 0}
{"text": "![gif](giphy|hYt3U3EiuBq48DVZhS)", "label": 0}
{"text": "Yep. Sadly drove by this monstrosity last week.\nAnd obligatory reminder Ron Johnson (R) WI traveled to Russia on July 4th.", "label": 0}
{"text": "Someone has total devotion syndrome. And probably also complains about not having enough money for groceries yet just 5 minutes before dropped $80 on another flag.", "label": 0}
{"text": "How the actual f is that even legal? Gotta be some kind of fire hazard.", "label": 0}
{"text": "In 2023, 3 weeks  after I turned 50 I had my first (clonic/tonic) seizure followed up by 3 more in May of this year. Gotta keep your health in perspective man. ", "label": 0}
{"text": "News flash Patrick, but he really is that bad..unless you think that 3 Decorated American Generals are wrong...", "label": 0}
{"text": "Michelle can do those nails, if she chooses. She can carry it off. Me? No. I had mine done today. They were almost two weeks past due. I agree with you about the touch screen. I cannot with the long nails.", "label": 0}
{"text": "what in the actual fuck", "label": 0}
{"text": "I wonder what Country she Voted For she has many times stated how badly the Citizens of the USA treated her", "label": 0}
{"text": "That face just screams “I hate my life”… and then it gets worse when he speaks…", "label": 0}
{"text": "Textbook definition of “ghoul”", "label": 0}
{"text": "2024 Barack is a babe", "label": 0}
{"text": "She looks awful", "label": 0}
{"text": "Yes that was exactly my point when I made that comment. You're so smart", "label": 0}
{"text": "These people are advertising to vote for Dems. Do people really want to associate with this?", "label": 0}
{"text": "Rejecting stupidity doesn’t make me phobic or discriminatory. It makes me logical. Believing a man can be a woman or even is entitled to enter their exclusive spaces makes you stupid. Reject stupidity. Reject suicidal empathy.\n\n2nd Timothy 4:3-4.\n\nI voted for Bernie because I respect him, not his policies. He is a man trying to do good, in his own way. Conviction is infectious.", "label": 0}
{"text": "He physically reminds me of a Nazi snake", "label": 0}
{"text": "Michael.", "label": 0}
{"text": "Total BadAss Babe with Body Armour...Let's GO!!", "label": 0}
{"text": "Expect statues in every town and city of their Supreme Leader if he wins.\n\nExpect Jan 6th will become a national holiday \"Patriots Day\" if he wins.\n\nExpect a lot of dissenters to disappear mysteriously if he wins.\n\nExpect everything apart from democracy and freedom... if he wins.", "label": 0}
{"text": "The gall to fly a POW flag next to a sea of flags supporting the guy that mocks them.", "label": 0}
{"text": "The disrespect to George’s tasteful and sensual photo shoot is stunning.", "label": 0}
{"text": "I'm in a household of 3. We're voting for Kamala next Monday!\n\nMy sister and her roommate are also voting for Kamala sometime soon!", "label": 0}
{"text": "Who is somehow still in his 30s by the way.", "label": 0}
{"text": "She looks beautiful. She is getting younger ☺️", "label": 0}
{"text": "Loser creep", "label": 0}
{"text": "Hope you’re right", "label": 0}
{"text": "You forgot “Nazi”", "label": 0}
{"text": "very weird", "label": 0}
{"text": "Oh boy a thread where we have to pretend she's attractive.", "label": 0}
{"text": "The UN has been irrelevant since the great meme, Boutros Boutros Boutros Ghali", "label": 0}
{"text": "Reddit is going to implode when dude wins.  Life will move on.", "label": 0}
{"text": "There is no proof of this. You are the victim of propaganda.", "label": 0}
{"text": "lol fucking brutal \n\nalso accurate", "label": 0}
{"text": "Now there’s a fella who looks like he is enjoying life in the Trump orbit 😬", "label": 0}
{"text": "Yeesh 😬", "label": 0}
{"text": "You forgot white supremacist.", "label": 0}
{"text": "I wish Michelle would run for president someday. I miss their family.", "label": 0}
{"text": "lol what a stupid face.", "label": 0}
{"text": "Yeah, show some respect for the Abstract", "label": 0}
{"text": "I bet this guy complains about how bad the economy is. But has extra money for all that crap unreal!", "label": 0}
{"text": "He’ll probably invalidate his ballot by crossing out Harris and writing all kinds of hate speech on it", "label": 0}
{"text": "Considering the fact that in order to enter this raffle you already have to be a registered voter, I’m not sure you’re fully aware of the situation.  Perhaps the warning from the DOJ that he’s possibly breaking the law, which made Musk stop the raffle, could fill you in.", "label": 0}
{"text": "Rethinking his exit row responsibilities", "label": 0}
{"text": "“YOU put the mask on first???”", "label": 0}
{"text": "Democratic socialism doesn’t work.  It leads to communism.  Any form of it is awful.  I have experienced and have family that experienced socialism turned capitalism.  It always ends bad.  I won’t have it.  Vote however you like but do your own research on how it won’t work.", "label": 0}
{"text": "I know this guy!\n\nHe is Obergruppenführer Dümbasfük.", "label": 0}
{"text": "White chubbs", "label": 0}
{"text": "No matter how many flags you have, your vote only counts once. Well, unless you’re a MAGA, vote multiple times, and then get caught", "label": 0}
{"text": "He’s smiling.   Loves his life.", "label": 0}
{"text": "Aren't you blaming other people for YOUR shitty life by blaming the current administration for under appreciating you, or whatever you said? Seems like you just did the same exact thing you're accusing the liberals of doing. Lol\n\nAlso, I'm an American. I voted Trump the first time. I regretted it after January 6th. \n\nI'm also over here fighting in Ukraine. \n\nLook up the Budapest Memorandum and familiarize yourself with it before you start talking about why we should be forcing Ukraine to settle for peace with the country that is invading them.", "label": 0}
{"text": "Trump is terrible and a borderline fascist, but he’s not some evil supervillain lmao", "label": 0}
{"text": "Joseph Goebbels", "label": 0}
{"text": "We don’t have that kind of control over our people", "label": 0}
{"text": "His forehead looks like it is trying to escape.", "label": 0}
{"text": "Never mind, just take a photo next time… Or use tracing paper. There, is that better?", "label": 0}
{"text": "proto-Trent Crimm, the Independent", "label": 0}
{"text": "Id hit it", "label": 0}
{"text": "To the jail bus", "label": 0}
{"text": "O_O does bro sell flags or is he just singke handedly keep some other flag salesman afloat?", "label": 0}
{"text": "Trump will save america", "label": 0}
{"text": "This comment is dumb af. Do you even know what she would stand for? You are the definition of the idiot American voter.", "label": 0}
{"text": "Kamala?", "label": 0}
{"text": "Careful… don’t say that. They thumbed me down for saying it", "label": 0}
{"text": "He looks better now than he used to. Look up old photos of him before he lost weight. He looked even older back then.", "label": 0}
{"text": "she wears a suit better than i ever could \n\ngood god damn", "label": 0}
{"text": "flags≠votes", "label": 0}
{"text": "![gif](giphy|gecNxHaA7NbCU|downsized)", "label": 0}
{"text": "Lady Boner Killer", "label": 0}
{"text": "Lol someone was listening to pod save america", "label": 0}
{"text": "Let's see what the voters think on Nov 5th 🤷🏾‍♂️", "label": 0}
{"text": "Looking back to 2004, I can relate!", "label": 0}
{"text": "Trump is a massive piece of shit.\nHis presidency was a disaster.\nYou have to be a gullible moron to vote for Trump ", "label": 0}
{"text": "Were your proof. Because Democratic socialism has not been used in any other country. Thanks for solidifying your ignorance.", "label": 0}
{"text": "It’s a typo. They meant LAPD.", "label": 0}
{"text": "Looks like his shirt collar is straining to push one out", "label": 0}
{"text": "Seems like a weird compliment, but ok? [ALLEGATION](https://www.merriam-webster.com/dictionary/allegation). I wanted to include a hyperlink for you, too, but it’s not as fancy🤷‍♀️\n\nKids, eh? Let’s not pretend you care about kids. You’re voting to murder babies, allow men into girls bathrooms, allow children to mutilate their bodies, and continue to support child trafficking. That’s your party.", "label": 0}
{"text": "That dumb turd better not complain about inflation. Dude literally spent 6 months of mortgage on Chinese trump trash", "label": 0}
{"text": "Kamala’s not even black though", "label": 0}
{"text": "This guy wrote an op-ed in high school newspaper arguing that he doesn't need to throw his trash away because it's the janitor's job. He never improved as a person", "label": 0}
{"text": "2022??", "label": 0}
{"text": "I mean, it's scary af", "label": 0}
{"text": "Who'd she vote for?", "label": 0}
{"text": "Republicans: Inflation has gotten so bad! I can’t afford to buy anything anymore!!!\n\nAlso Republicans:", "label": 0}
{"text": "Thankfully he only gets the one vote.", "label": 0}
{"text": "Probably multiple times too", "label": 0}
{"text": "What's qMURT? /s", "label": 0}
{"text": "Dude really wants his ass eaten while he gets his D S'ed.\nI mean.. that feels pretty anti republican to me but hey", "label": 0}
{"text": "They think lawn care is one word 😂🤣🤣🤣😂🤣", "label": 0}
{"text": "No matter how many flags,  his vote only counts as one.\n\nI'll nullify this person with my vote.", "label": 0}
{"text": "dude...", "label": 0}
{"text": "Nah that's a dude", "label": 0}
{"text": "My state voted 70% for Trump in 2020, my county was 80% Trump.\n\nI'm voting for her, but it's going to be like a fly pissing in the wind.", "label": 0}
{"text": "This guy takes the Putin love too far.", "label": 0}
{"text": "I lived in LA (Venice) during the riots, and I can tell you for certain the death toll was higher \n\nThere were probably 20+ helicopters in the air - seemingly at all times - so a sitload of footage was shown on live local tv, that didn’t make it to the national level \n\nI watxhed a kid get pulled from his car and fucked up much worse than Reginald Denny \n\nhe almost certainly died \n\n  \nI watched another dude walk up to a car that was at an intersection- goes up to the drivers side window, with gun drawn and kills the drive, two shots iirc\n\n  \nthe car coasted toward the intersection and into a light post", "label": 0}
{"text": "Gross 25 and unattractive 50. Yeah, i can see that.", "label": 0}
{"text": "Looks a little light headed in that picture.", "label": 0}
{"text": "Homeboy is refusing to accept the election results, and that he should just shave his head completely", "label": 0}
{"text": "Is there a way to be tested for this?", "label": 0}
{"text": "what if he doesn't vote... why do i suddenly get the idea that this guy is just using this to peacock and it's all just a ruse to pull numbers?", "label": 0}
{"text": "By the way, if it wasn’t for socialism, you wouldn’t have roads, firefighters, police officers, public schools, public libraries. FDIC insurance, SSDI, SSI, or SS. Just to name a few.", "label": 0}
{"text": "Big F’n deal now my life has meaning 🤪", "label": 0}
{"text": "Her eyebrows have relocated and it's uncanny.", "label": 0}
{"text": "Me + No Flags = 1 vote\nHim + Many flags = 1 vote. \n\nAll those flags, yet still only gets 1 vote like the rest of us.", "label": 0}
{"text": "If Stephen Miller were a disease, he certainly wouldn't be a *sexually* transmitted one.", "label": 0}
{"text": "Wasnt he responsible for giving epstein a sweet heart deal the fiest time they charged him?", "label": 0}
{"text": "‘Boogaloo Boi’ charged in fire of Minneapolis police precinct during George Floyd protest\n\n[Ivan Harrison Hunter, a Texas rightwing extremist, bragged about helping to set the fire then was seen shooting 13 rounds at the building](https://www.theguardian.com/world/2020/oct/23/texas-boogaloo-boi-minneapolis-police-building-george-floyd)", "label": 0}
{"text": "If you can find an easy way, you should patent it.", "label": 0}
{"text": "Yea, 10 seconds is a lifetime when you're brain thinks what if he trips and hits his head, or pases out, or something malfunctions, etc... and then you get cooked alive. Unlike reddit thinks, joking about non-lethal things can indeed \"sometimes\" be funny, that would NOT be one of those times.", "label": 0}
{"text": "Iirc they sedate you. It's only painful if you skwerm", "label": 0}
{"text": "Patient would usually not be in a lucid frame of mind from the anesthesia.", "label": 0}
{"text": "I think you need a break from the internet.", "label": 0}
{"text": "I wish he could trade places with Matthew Perry.", "label": 0}
{"text": "Yeah like imagine if buddy slipped and hit his head unconscious while hysterically laughing at you locked in the oven", "label": 0}
{"text": "I got attacked by a 100lb+ dog a couple years ago, went to the animal shelter to meet him cause i was thinking about adopting him, ripped my ear about half off. I slapped a bandaid over it cause adrenaline is a helluva drug. \n\n\nWent to the emergency care (not real hospital) cause dog bite to the head needs cleaning. Dr lifted the bandaid and apparently my ear just peeled up with it. He  said \"NOPE. NOPE NOPE. No nonono. You gotta go to the ER\" \n\n\nId never heard a dr say the polite equivalent of \"OH HELL NO\" before lol\n\nFun fact, you can hear your ear being stitched back on. It sounds super cool.", "label": 0}
{"text": "This pic has to be AI right? This doesn’t look real. The way this fossil is dug around.. something is off", "label": 0}
{"text": "This was either negligence or murder. If it’s murder, it needs to be prosecuted to the full the extent of the law. \n\nIf it isn’t negligence or safety violations, then Walmart needs to be sued into bankruptcy and oblivion.\n\nThis poor young woman died a horrendous, excruciating death on the level of medieval torture and execution methods or the brutality of drug cartels. This child died screaming. 19 years old. She still a child. She was found by her mother, her mother of all people. Imagine finding the burned in charred remains of your own daughter having been cooked alive. There’s no coming back from that type of trauma and horror. This poor girls suffering continues in the soul of her mother and family. \n\nThis is fucking horrendous.", "label": 0}
{"text": "And betcha the only thing Walmart does is the old “thoughts and prayers” saying we don’t give a fuck.", "label": 0}
{"text": "I used one of these all the time at Meijer! It was always my worst fear. Allegedly, one had exploded next to a coworker i worked with. Became a whole ordeal. The way ours were built, the two ovens couldn't be \"locked out tagged out\" unless you had a key to a main shutoff lever. But we still had to crawl inside and clean it. Fun.", "label": 0}
{"text": "Trump, in the June 1, 2020, call, described Walz as “an excellent guy” and later said: “I don’t blame you. I blame the mayor.” The president didn’t criticize the governor at the time.\n\n“Tim, you called up big numbers and the big numbers knocked them out so fast, it was like bowling pins,” Trump said.", "label": 0}
{"text": "I meant a lock out tag too. You needed to be able to be in it while it was on to constantly move around meats and check for doneness", "label": 0}
{"text": "Mind if we steel this idea?  I love it.", "label": 0}
{"text": "It really is. This store is local to me, been there plenty of times… it’s a tragedy what happened, the whole province is devastated. I don’t understand what people gain by making light of this.", "label": 0}
{"text": "Big NOPE", "label": 0}
{"text": "Banana for scale?", "label": 0}
{"text": "Where is this?", "label": 0}
{"text": "I'll have a 4pc poop!", "label": 0}
{"text": "Usually the super huge ones are only at commercial factory-sized bakeries. I looked it up and walmart tends to use roll-in ovens for their in-store bakery.", "label": 0}
{"text": "Nah, I’d rather vote", "label": 0}
{"text": "She looks like deaf", "label": 0}
{"text": "Too bad you voted incorrectly on the abortion measure.", "label": 0}
{"text": "I’m so sorry that happened to you.", "label": 0}
{"text": "To be honest I find the whole newspapers supporting a candidate thing weird anyway but the timing is very odd", "label": 0}
{"text": "Sorry to be hyperbolic on that one... But yea I wouldnt buy something within eye sight of that oven.", "label": 0}
{"text": "Yeah those types of things should have L.O.T.O. procedures where it CAN'T turn on while a person's inside of it, because that very person has the only key to let it turn back on.", "label": 0}
{"text": "> the business that hires the person is greedy, immoral, unethical and liable as F***.\n\nYou do know that sometimes crazy people can act normal, right? What would your hiring process be to guarantee that you never hired someone capable of this be? In other words, what reasonable steps should they have taken to screen this guy out?", "label": 0}
{"text": "Being the father of her bastard child that lives next door is a perfect reason for Peggy to despise bill.\n\nBill is a bumbling idiot, but also loyal to a fault and warship's the ground Hank walks on. I think it wouldn't be far fetched that Bill would keep that secret as he knows letting it out would effectively end the only life he knows.", "label": 0}
{"text": "It was one of the little pleasure of working there. There were a few, but this one always made me smile.", "label": 0}
{"text": "I would have LOST IT.", "label": 0}
{"text": "Are the CIA agents in the room with us now?", "label": 0}
{"text": "Have you ever seen the Canadian tv show Trailer Park Boys? The show takes place in Nova Scotia.", "label": 0}
{"text": "I had a lump on my neck and my doctor was like “you just had surgery there though right?” And I was all “uh no” and he says in a panic “book an urgent CT scan with these people” to the nurse that was in there too.   \n\n I was sitting there like “uhhhhhhh” and he realized he fucked up and convinced me it wasn’t a big deal.   \n\nIt ended up just being this skin thing, totally benign. But dude sent me to an ear nose throat doctor that is a cancer specialist so he definitely thought it was that lmao.", "label": 0}
{"text": "Not everyone *wants* democracy and that is deeply disturbing to me", "label": 0}
{"text": "Holy so this is what my mother gave me when i was a child I thought she was joking when she said worms", "label": 0}
{"text": "We trust the FBI now? Well... Only when it's convenient.", "label": 0}
{"text": "Half price on all baked goods.", "label": 0}
{"text": "Perfect 3D shadow.", "label": 0}
{"text": "And I thought people dying in ovens was only in Mexico with those cartel human oven killings.", "label": 0}
{"text": "The latch should be designed so that the door can't be closed from the inside. (Like the outside latch needs to be pulled and then the door be pushed in order for the door to close) and the oven shouldn't turn on unless the door is fully shut. I feel like this should be basic OSHA standards...", "label": 0}
{"text": "You enter them to clean them, or remove items that fall off of the racks.", "label": 0}
{"text": "The freezer death was found to not be suspicious and not connected to the job. The person just happened to die while there but death wasn’t caused by the freezer.", "label": 0}
{"text": "I highly recommend you and anybody that doubts this may not be a murder to check out the r/walmart sub. That sub is made up of walmart employees all over the world and almost all of them have unanimously agreed this was a murder. The reason I bring it up is because all the big super centres have these walk in ovens, my fiance works at a Walmart that has a walk in oven and he said there is ZERO way this poor girl died due to negligence.", "label": 0}
{"text": "Yeah, the new Beavis feels exactly like the old shows in a good way.", "label": 0}
{"text": "That’s a shame imagine how much money the owners of that Walmart are losing right now", "label": 0}
{"text": "Yes. Incessant anti-Republican posting on non-political subs is a form of desperation, especially since Trump is slightly favored to win the election currently.", "label": 0}
{"text": "Probably one of those Epstein cameras.", "label": 0}
{"text": "I am aware, I just find it amusing, it’s what came to my mind n it stuck. The humour got me through. Oh look there’s the “n” again everyone’s at me about 🤣", "label": 0}
{"text": "About 1 and 3/8 offensive linemen.", "label": 0}
{"text": "Did you do anything to stand up for yourself or just let them get away with doing that? That’s insane behavior, what if something malfunctioned and it didn’t turn off or open.", "label": 0}
{"text": "Looks like a day full of love", "label": 0}
{"text": "![gif](emote|free_emotes_pack|surprise)", "label": 0}
{"text": "They are investigating this as a potential homicide...", "label": 0}
{"text": "Op would need proof for that and they might not have had any.", "label": 0}
{"text": "A person burned to death and here you are making (bad) jokes.", "label": 0}
{"text": "If you missed watching the last one, they'll be replaying it soon.", "label": 0}
{"text": "Not nearly enough.", "label": 0}
{"text": "Steamed even.", "label": 0}
{"text": "Why did I click on this?", "label": 0}
{"text": "My friend and I were talking when the news initially broke, and you past experience is what we suspect happened.", "label": 0}
{"text": "Seems peaceful. 🙄", "label": 0}
{"text": "They do make you take a whole course on lock out tag out procedures but no one every really does them.", "label": 0}
{"text": "I can't wait for Walmart to face no consequences and move on", "label": 0}
{"text": "This truly feels like foul play", "label": 0}
{"text": "That is not a joke. That is Sadism!", "label": 0}
{"text": "I doubt suicide. With the hatred there's been towards immigrants in Canada recently, I wouldn't put it past someone to have done this to her. I know they have a reputation of being polite, but lately there has been a lot of anti-immigrant rhetoric over there, you'd think it was the US.", "label": 0}
{"text": "And you didn’t kick his ass after?", "label": 0}
{"text": "People died during this. All based off a complete lies. Instigated by the current running President elect. wtf is going on?", "label": 0}
{"text": "I'm guessing so I'll say that up front.\n\nI am not a wrestling fan, but if you are familiar with the death of Owen Hart he died from the failure of a harness holding him 80 feet in the air.\n\nThe family sued the wresting organization, and the organization sued the manufacturer of the harness.\n\nI would not be surprised one bit if this was the case here as well regardless of where the blame should lay.\n\nThere was also speculation Owen accidentally undid the harness, human error could also be at fault.  It would take a lot for me to suspect foul play.", "label": 0}
{"text": "As the saying goes: beware the fury of a patient man.", "label": 0}
{"text": "Man I’ve worked in bakeries for 10 years, been around walk in ovens the whole time, this makes absolutely NO damn sense. From experience, it’s literally impossible for this to happen. It can’t be their procedure that when they clean their ovens they leave them running and close the door behind themselves. It HAS to be murder or suicide, there is no other scenario that someone could do this to themselves. I also don’t believe that any person, no matter how depressed or done with life, could willingly stay inside and oven and cook themselves to death. Your brain would NOT allow it, just like trying to drown yourself\n\nThe only thing that makes sense to me is that while she was cleaning the oven, someone else came up and closed the door, turned the oven on, and held the latch shut until she ended up unconscious or dead. Truly a horrific and terrifying way to go. \n\nMy thoughts go out to the family and friends affected.", "label": 0}
{"text": "Hahahha most likely! \n\nPeople always think I'm crazy if it ever comes up in conversation for doing it 😅\n\nWhich reminds me I'm about due to again", "label": 0}
{"text": "Where was this that you're speaking about?", "label": 0}
{"text": "that sounds like attempted murder??", "label": 0}
{"text": "Ah yes, another quality post on /r/pics.\n\nI get next turn to post about this.", "label": 0}
{"text": "Having my over thought theory moment - she was Sikh, and Canada is in a pissing match with India, over India possibly killing Sikhs here in Canada.  And, currently places like Walmart are full of people from India.\n\nPlus, if it wasn't a stupid accident, that kind of killing feels like a pretty intense, hot headed feel of a feud, but really impulsive, too.  Like, not well thought out.\n\nNot certain I like some of the implications I came up with.", "label": 0}
{"text": "Okay, let's say for whatever reason, it's impossible to clean this oven (it's not). Why would you not just buy a new oven instead of tearing down the store?\n\nAccidents happen. Murder happens. Death happens. Those are just facts of life. Are we to demolish any place where a death occurs?\n\nThis is a ridiculous statement imo", "label": 0}
{"text": "I sing this all the time, and the look on faces tells me I’ve seen Monsters Inc way too many times.", "label": 0}
{"text": "With my slightly dark twisted sense of humour, I would have started calling that day of the week Nazi Wednesday (or whatever day it was).", "label": 0}
{"text": "Looks peaceful to me. /s", "label": 0}
{"text": "And that would have been the day I went to jail\n\nThat's not a \"joke\", that's fucked all the way up", "label": 0}
{"text": "What? Kodaks still around? I thought they went out of business", "label": 0}
{"text": "Was your co worker either Hansel or Gretel and are you actually the witch in the candy house?", "label": 0}
{"text": "I get that, unfortunately if you punch the guy, you might end up in jail, and lose your job. And that sucks.", "label": 0}
{"text": "Like I said, it was just a video of the woman screaming, and it just showed up on my TikTok FYP. It was not graphic in the sense that they didn’t show any actual details, but it was still enough to make me sick.", "label": 0}
{"text": "New fear: unlocked", "label": 0}
{"text": "Damn", "label": 0}
{"text": "[Here you go!](https://atlantic.ctvnews.ca/the-mom-is-shattered-body-of-employee-who-died-at-halifax-walmart-was-found-by-her-mother-1.7085347)", "label": 0}
{"text": "South Africa", "label": 0}
{"text": "Is there a zillow listing? I can't find it.", "label": 0}
{"text": "Walmart needs to fucking pay to this family", "label": 0}
{"text": "Is it dead? I mean did you kill it or this picture of a live worm?", "label": 0}
{"text": "Hyperbole.\n\nHe‘d be in for the ass whoppin of his lifetime tho. And I stand by that.", "label": 0}
{"text": "I’m fine with the Trump crowd being made fun of. 🤷🏻‍♂️", "label": 0}
{"text": "His head on a spike", "label": 0}
{"text": "Willing to share what his diagnosis was?\n\nI had a few of these in my ER days. One was a patient who had bullet lodged in his brain, and was totally normal and alert. minus the blood.\n\nAnother was primary amoebic meningoencephalitis, aka the brain-eating amoeba disease. The patient was already dead and their body just hadn't caught on to it yet.", "label": 0}
{"text": "I worked a student job as a cleaner in a factory that made car parts (I don't really know which ones) and they had a huuuge oven where some parts were apparently heat-treated? The entire room was covered in a brown residue on the inside. It took a crew of 4 of us 2 entire days to clean that oven and it was still not completely clean.", "label": 0}
{"text": "For a second I thought that was a meathook with an eyeloop on the end. And then I thought 'figures'.", "label": 0}
{"text": "I don’t know what I thought it was going to be but nothing could have prepared me for that.", "label": 0}
{"text": "I'm right behind you 😅", "label": 0}
{"text": "There is one of this at my uni", "label": 0}
{"text": "Fuck it let’s just serve him up [Pittsburgh style](https://en.m.wikipedia.org/wiki/Pittsburgh_rare)", "label": 0}
{"text": "Not all hero’s wear capes.", "label": 0}
{"text": "It's more of a functionality one.  The type of walk-in oven I've experienced would be functionality useless if it had to be shut down and locked out every time we needed to walk into it.  You'd have to climb up to the roof of the oven to turn off and lock out the gas supply, and also lock out the breaker. It would take at least an hour to cool and about 30 minutes to heat. You'd be looking at only getting 1 load of parts every 3ish hours or 2 loads per shift. \n\nLook up Precision Quincy industrial ovens to get an idea of some types of large industrial walk-in ovens.", "label": 0}
{"text": "The podcast [Swindled](https://swindledpodcast.com/), which I strongly recommend, had a recent episode about worker unsafety which included just such a story, of a worker burned to death in an oven. If I remember correctly, the context was that in this case, the death didn't just happen because of an unfortunate mistake: it was more a number of safety precautions that were ignored because of penny-pinching, which compounded to make this horrendous death possible. It wouldn't surprise me if the same is true in this case.", "label": 0}
{"text": "Ok that makes sense. Because the actual Walmart and memorial and sign and everything are real… It’s an AI zoom. So weird they did that and unnecessary especially given the circumstances.", "label": 0}
{"text": "If I was your Manager I would have dragged him into an office and called emergency services for you and police for him. What the fuck, man?!", "label": 0}
{"text": "You could've put  /s like everyone does", "label": 0}
{"text": "\"It was a peaceful gathering\" - MAGAs everywhere", "label": 0}
{"text": "Then let him. He’s not leaving that room without pain.", "label": 0}
{"text": "It's ok, it's very unlikely you have a massive colony of worms inside you...", "label": 0}
{"text": "Looks like an unopened PTouch label cartridge on the desk in pic 20. Snag that shit and sell it on eBay, or just send it to me.", "label": 0}
{"text": "Not the current President elect.  The current GOP candidate who was the President at the time.", "label": 0}
{"text": "Not looking forward to a possible superpower volunteering to have a narcissistic dictator in charge.", "label": 0}
{"text": "I was in a car accident and was unconscious while they used the jaws of life to extricate me from the car. I was laying in the middle of the street when I started to come to and the first thing I heard was some pedestrian looky-loo say “oh my god! Look at her leg!” My femur was shattered all to hell and I was wearing shorts so my leg probably looked pretty gnarly. Nevertheless I remember thinking “oh shit.” But then had no time to think anything else because they were lifting me up to put me on a gurney and the pain was so intense I passed out again. Fun times!", "label": 0}
{"text": "Are doctors/nurses shocked when they find something like that and weren't expecting it?", "label": 0}
{"text": "lol exactly 😂", "label": 0}
{"text": "Trump called it a day of love and has fully endorsed that pack of MAGA domestic terrorists.", "label": 0}
{"text": "I feel like that has to be attempted murder.", "label": 0}
{"text": "Feel the love", "label": 0}
{"text": "If that would have been my child you could have straight send me up into an asylum.   \nI would have gone crazy.\n\nI do hope the mother gets all the help she needs.   \nThis is the kind of stories where nightmares are made of ...", "label": 0}
{"text": "Is there a way to know tho like would I feel weird or smth", "label": 0}
{"text": "I need my eyes tested asap, I thought it was a foley’s catheter.", "label": 0}
{"text": "I used to work for a bakery and we had these. They were nightmare fuel. They're not like walk in freezers but they are large enough to walk into. Ours had safety buttons that you punch to open it like freezers do. We had one that had a door that did not like to stay open. So when I had to use that one I absolutely refused to step inside. I would rotate the... rotator thingy that the racks go on and spin it around until the rack in the back was at the front of the oven. And I would always keep my leg extended so the door wouldn't hit me from behind.", "label": 0}
{"text": "What do you expect the community of r/pics to add to this discussion?", "label": 0}
{"text": "then killed the 3 dudes because his hands smells like fish goofy ahh", "label": 0}
{"text": ">We’re strongly looking for arrests. You have to get much tougher. You’re gonna get over it. I know Gov. Walz is on the phone and we spoke and I fully agree with the way he handled it the last couple of days\n\n\\~ Trump on Walz' handling of the incident\n\nAlso:\n\n[‘Boogaloo Boi’ charged in fire of Minneapolis police precinct during George Floyd protest](https://www.theguardian.com/world/2020/oct/23/texas-boogaloo-boi-minneapolis-police-building-george-floyd)\n\n[Ivan Harrison Hunter, a Texas rightwing extremist, bragged about helping to set the fire then was seen shooting 13 rounds at the building](https://www.theguardian.com/world/2020/oct/23/texas-boogaloo-boi-minneapolis-police-building-george-floyd)", "label": 0}
{"text": "How much blood was shed getting that cat in that turtleneck?", "label": 0}
{"text": "It's a deception of light and angle, that hooded individual is actually snorting a fart straight from source, tony montana scarface style", "label": 0}
{"text": "Check your facts. You are totally out of line.", "label": 0}
{"text": "Just call the police. Let them decide what to charge him with.", "label": 0}
{"text": "Was she hot?", "label": 0}
{"text": "Deplorable", "label": 0}
{"text": "But but but my groceries were 10% cheaper then!", "label": 0}
{"text": "\"It's just a bake prank bro!\"", "label": 0}
{"text": "I voted for Bush and McCain.  I'll never vote for another Republican as long as I live, and the entire party should be demolished and started over.", "label": 0}
{"text": "It was an insurrection attempt. They were there to prevent certification of the election, because they hate democracy and the American people.", "label": 0}
{"text": "I’m medically complex and have been through a good bit and I experience this on the regular. Sometimes the doctor also tells the interns/residents I’m a model/great/excellent patient because I’m medically literate and a good historian (I take notes on when symptoms present and abate, last time I had it checked out by whom, etc). It’s nice. But it would be nicer to be boring lol", "label": 0}
{"text": "feel the love", "label": 0}
{"text": "Nearly. Feather!", "label": 0}
{"text": "She could have been murdered then put in the oven to destroy forensics. I imagine this is one of the lines of investigation if they do suspect foul play.", "label": 0}
{"text": "WaPo is owned by Jeff Bezos I doubt this guy is the only person involved here", "label": 0}
{"text": "The article says the oven does not lock.", "label": 0}
{"text": "that's Trucky from pootie tang", "label": 0}
{"text": "I kind of hope Trump wins, simply because the MAGA people need to learn the hard way. Everything will get worse, more costly, and America will turn to shit more than it already is now.", "label": 0}
{"text": "I worked in a bakery with an oven like this, they don't lock, but do latch closed. There was an emergency release handle on the inside, much like in a walk in freezer. \n\nThis happened in the middle of a shift at Walmart. How did no one witness anything? Someone murdered that girl for sure, I wouldn't be surprised to find out she was dead before she was put in the oven.", "label": 0}
{"text": "So it’s either murder or the most bizarre suicide I’ve ever heard of.", "label": 0}
{"text": "I mean it’s going to be a full investigation. Even if it was not deliberate there would be an investigation.", "label": 0}
{"text": "Walmart doesn't practice Lock out Tag out at least for this 1 job?    holy shit..   I hope this family sues them..", "label": 0}
{"text": "It's kind of pertinent.", "label": 0}
{"text": "My work sent a guy on light duty down to the hardware store to find a golden shower. He did not think it was funny when he got back.", "label": 0}
{"text": "FR 🙏🙏😭", "label": 0}
{"text": "I’m not a violent person, and I’m slow to anger, but I’m a big dude. It scares me to think about how bad I would’ve hurt that person, but by the end, they would’ve been begging for the oven.", "label": 0}
{"text": "I used to work in a cookie factory that used walk-in ovens like the ones in the article \n\nThe entire oven room felt like an oven, I'd start sweating after only a few minutes being in it.  It wasn't super uncomfortable, but it was definitely enough to keep warm.\n\nEven if there was only 1 oven, if you opened the door, you were blasted with a wave of hot air.  And the outside of the door was pretty hot.\n\nI'm not saying she didn't go inside on her own, but she certainly didn't have to in order to get some warmth.", "label": 0}
{"text": "That shit should be burned down that poor girl died *HORRIBLY*", "label": 0}
{"text": "Source? Dude made it the fuck up", "label": 0}
{"text": "Disgusting. And MAGA want him back.", "label": 0}
{"text": "It looks like this post is about Politics. Various methods of filtering out content relating to Politics can be found [here](https://www.reddit.com/r/pics/wiki/v2/resources/filter/politics).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pics) if you have any questions or concerns.*", "label": 0}
{"text": ">Okay, let's say for whatever reason, it's impossible to clean this oven (it's not). Why would you not just buy a new oven instead of tearing down the store?\n\nFor the same reason I am wrong.  Customer perception.  Customers dont know Walmart replaced it.  Its just \"theres where they baked that lady\"\n\nClose the kitchen at bare minimum. Unsure how much this is part of Walmart.", "label": 0}
{"text": "Mob mentality at its finest", "label": 0}
{"text": "There's no way someone could be dumb enough to do that.. Right? This can't be serious. Have you ever worked with one of these ovens?", "label": 0}
{"text": "Dude I would have called the cops. Wtf.", "label": 0}
{"text": "Or she may have been murdered and the oven was to cremate the body. She may not have actually died as a result of the oven.", "label": 0}
{"text": "Doubt she went willingly.", "label": 0}
{"text": "About a thousand.  Of course, the GOP delayed the trials of the leaders of the insurrection, such as Trump.  Traitors to the US.", "label": 0}
{"text": "What a bunch of disgusting terrorists. They should all be locked up for life.", "label": 0}
{"text": "MISSION STATEMENTS \n\nThe Canadian Centre for Occupational Health and Safety (CCOHS) has a vision: the elimination of work-related illnesses and injuries. We serve Canadians - and the world - with credible and relevant tools and resources to improve workplace health and safety programs. We believe that all Canadians have a fundamental right to a healthy and safe working environment. Through our programs, services, knowledge, commitment, and action, CCOHS will continue its efforts to advance health and safety in the workplace.\n\nOSHA's mission is to assure America's workers have safe and healthful working conditions free from unlawful retaliation. OSHA carries out its mission by setting and enforcing standards; enforcing anti-retaliation provisions of the OSH Act and other federal whistleblower laws; providing and supporting training, outreach, education, and assistance; and working collaboratively with our state OSHA programs as well as ensuring that they are at least as effective as federal OSHA, furthering a national system of worker safety and health protections.\n\nThey sound very similar to me. Except OSHA has enforcement power.", "label": 0}
{"text": "MAGA: it wasn't us! It was antifa and aliens... Illegal aliens", "label": 0}
{"text": "There are so many things wrong about Donnie and you spread misinformations and give them redhats food. \n\n\nA dissservice par excellence.", "label": 0}
{"text": "At least get this ***factually correct***, **Bezos killed the endorsement.\n\nhttps://www.cjr.org/political_press/the-washington-post-opinion-editor-approved-a-harris-endorsement-a-week-later-the-papers-publisher-killed-it.php", "label": 0}
{"text": "Crosspost to r/evilbuildings", "label": 0}
{"text": "I was really hoping that Kahnnie was a burnt out \"Former gifted child\" still trying to pay off her college, and Bobby was a massively successful Twitch streamer.  That way he could still have his dream of prop comedy and Hank had to steal his head around it.", "label": 0}
{"text": "This kind of shit is why i have claustrophobia.", "label": 0}
{"text": "An “insurrection” without guns from a party who everyone says are gun nuts.", "label": 0}
{"text": "Just a head’s up for all of you!", "label": 0}
{"text": "Yes, and when I refer to Lock Out Tag Out, that isn't referring to the oven actually locking.", "label": 0}
{"text": "Not ONE of those people should EVER be allowed to vote again. They all need a really thorough public shaming.", "label": 0}
{"text": "Holy fuck that's messed up.", "label": 0}
{"text": "Please tell me they got the culprit cause ain’t no way she close it on herself and turn it on", "label": 0}
{"text": "The world is too paranoid now. The picture is definitely not ai generated…so many news reports based on it", "label": 0}
{"text": "I work in a Walmart Deli, those ovens are no joke, but it’s pretty hard to actually get stuck in one (this is all we talked about last shift) I’m suspecting there was foul play involved", "label": 0}
{"text": "This seems like it would be a plot line on Superstore.", "label": 0}
{"text": "They did, someone died, not that reddit gives a fuck because life is only precious if it is on their team.", "label": 0}
{"text": "A Trump supporter will look at this photo then look you dead in the eyes and say nothing is wrong.", "label": 0}
{"text": "Does water go up your butthole whenever you swim?", "label": 0}
{"text": "The evening of November 5, Trump will claim victory before results are final.  His supporters will celebrate, Trump will make a victory speech, and then days later when media announces the winner is Kamala Harris, all hell will break loose because Trump will say the election was stolen.  Trump is as subtle as a brick.  \n\nAs retired Judge Luttig testified to at the January 6 hearings, there are ongoing efforts by Trump and Republicans to accomplish in 2024 what they failed to do in 2020.  This is the reality we are dealing with.  Vote early.  Vote Harris/Walz 2024.", "label": 0}
{"text": "Harris campaign is in full force before the election.  I have been seeing a lot of posts on all subreddits.   This reminds me of 2016.  And the Donald sub.  \"high energy\".  \"10 feet higher\".   Lol", "label": 0}
{"text": "I know right! Now she's in heaven.\n\nGod bless her soul.", "label": 0}
{"text": "Humor is a valid coping mechanism recognized by psychologists all around the world", "label": 0}
{"text": "I made a post last night about how Im predicting trump will incite worse against every day citizens if he loses again. Many people agreed, some said I was crazy. Others say only democrats are inciting violence. I deleted it because isn’t doing me any good. But this o I tie is part of why I’m predicting it.", "label": 0}
{"text": "Bullshit! That's an earthworm not am intestinal worm.", "label": 0}
{"text": "Seems like I may have a hard time suing the bloody pulp what was their body after I beat them to death for locking me in a fucking oven and turning it on.", "label": 0}
{"text": "Depending on the state, felons can vote.", "label": 0}
{"text": "Can you explain this to me? I feel really dumb. If it didn’t have any lock mechanism then she would have been able to get out on her own right? This is so sad.", "label": 0}
{"text": "They discovered rockwool like isolation?", "label": 0}
{"text": "That isn't because of of a lack of effort on Hezbollah's part, it's because of a difference in military philosophy.\n\n\nIn Israel the military uses its resources to protect its citizens. For example, Hezbollah has launched over 10000 missiles at Israel in the last year, but systems like Iron Dome intercepted them.they also evacuated most of the people in northern Israel.\n\n\nBy comparison Hezbollah uses the civilians as a resource to protect themselves. Every weapons cache and leadership bunker is hidden under a hospital or school or apartment building. They have never protected a civilian from an attack, they use civilians shields. \n\n\nNo fucking shit Lebanon is taking higher civilian casualties, Hezbollah's whole strategy is designed to accomplish that. ", "label": 0}
{"text": "Maybe it was just the lining of your intestines from the alcohol.", "label": 0}
{"text": "Stuff like this shouldn't happen in 2024.  Hope Walmart can make that family ... not whole, but something better than it is now.  Jesus Christ, this is going to be fucking hard for them to get past.", "label": 0}
{"text": "Man, I’d be worth millions after suing.", "label": 0}
{"text": "Not a chance I wouldn't have pressed charges.", "label": 0}
{"text": "Ignorance is one hell of a drug", "label": 0}
{"text": "That is not how u spell Bezos....", "label": 0}
{"text": "Vascular doctor said, \"Well, that's impressive,\" when he saw my varicose veins. I wasn't thrilled about that.", "label": 0}
{"text": "I would've sued but you have much more patience than I do.", "label": 0}
{"text": "Recently as well.", "label": 0}
{"text": "uhm...what demise in what oven?", "label": 0}
{"text": "It was an attempted coup.", "label": 0}
{"text": "Like this? lol\n\n![gif](giphy|Ltef6FGAGxXcwbgTha|downsized)", "label": 0}
{"text": "Fascist garbage", "label": 0}
{"text": "I would literally kill someone for that and I’m not exaggerating. That’s the most fucked up thing I’ve heard in a while.", "label": 0}
{"text": "Clash of the Titans!", "label": 0}
{"text": "The thing that gets me, is someone would have almost had to have shut the door behind her. The oven stays hot if it's left on, but the one's in my bakery have no way to close the door from the inside and the door is so heavy there's no way it would swing shut on its own.", "label": 0}
{"text": "'Cause you, my tapeworm tells me what to do\n\n[You, my tapeworm tells me where to go](https://youtu.be/Y45oADjAAuQ?si=_aTfEdlR_sKggWfw)", "label": 0}
{"text": "I am traumatized by just reading this. I'd have wanted to seriously injure that person.", "label": 0}
{"text": "surprising only eejits", "label": 0}
{"text": "If you’re in a life threatening situation, pain is usually an afterthought to survival. Adrenaline is a hell of a thing. \nI shattered my hand in an accident. I was fine for about five minutes, didn’t feel much of anything, then passed out after the adrenaline wore off and endured months of pain in recovery afterwords. ", "label": 0}
{"text": "If there isn’t catnip in the fanny pack it’s a missed opportunity", "label": 0}
{"text": "this is so creepy like out of a horror movie", "label": 0}
{"text": "Apparently she was the one who found her too, I can't even begin to imagine.\n\nNot enough therapy in the world.", "label": 0}
{"text": "“We just peacefully walked in through open doors and were welcomed in gracefully without opposition”", "label": 0}
{"text": "It’s hard to tell that it’s her when she’s putting silencers on the gunshow… 💪🏾💪🏾", "label": 0}
{"text": "Huh", "label": 0}
{"text": "Careful though. Entirely discounting one side like that leads to other problems. Republicans, less now, but used to still have good intentions and want the country to succeed. The divide that’s grown between the two parties is damaging to us as a country. If one party simply stops existing at all, there’s no balance. The system is flawed, sure, but we can’t jump too far either way. \n\nDisclaimer. Not supporting trump in this comment. Just the general statement", "label": 0}
{"text": "There would have been a very different investigation if that was me.", "label": 0}
{"text": "The menu has \"tit twister \" listed.", "label": 0}
{"text": "With \"it should be very easily handled by, if necessary, by National Guard, or if really necessary, by the military, because they can't let that happen\".", "label": 0}
{"text": "Probably inbuilt into phones now, but this AI noise removal or upscaling sucks absolute dick and makes text that would otherwise be legible look like nonsense.", "label": 0}
{"text": "I got my head split open playing basketball once. The nurse comes in and says “let me have a look” then says “oh God… I’ll be right back”… he goes and gets another guy and they’re both freaking out about how bad it is and taking pics… then they both leave and I never see either of them again 😂 it was like 30 minutes before I saw anyone else…", "label": 0}
{"text": "Or she was unalived before and someone put her in there. Police are investigating homic*de", "label": 0}
{"text": "The electorate has a memory worse than a goldfish. It's important to remind them *right now* what happened four years ago as early voting opens up so they can see what's at stake.", "label": 0}
{"text": "\"FEBRUARY 14, 2025! CELEBRATE A DAY OF LOVE WITH OTHER GREAT PATRIOTS! IT WILL BE WILD! SEE YOU IN DETROIT!\"", "label": 0}
{"text": "Well, unfortunately a person is dead because of that. Depending on the state, it could be considered manslaughter.", "label": 0}
{"text": "Amazing that none of the guards shot these assholes", "label": 0}
{"text": "My heart just stopped. That’s insane. I just…nope. Insane. I am shocked.", "label": 0}
{"text": "I live in this city. The only rumors of it being homicide are racists saying her dad somehow appeared here from India, put her in the oven and honour killed her, while being able to make it back to India by the time the mom found her.\n\nPlease stop spreading false information. Wait until the investigation has concluded at the very least.", "label": 0}
{"text": "Absolutely this.", "label": 0}
{"text": "Fuckin losers.   Anyone who denies that Trump tried to cheat the American people is an idiot.  He tried very hard.", "label": 0}
{"text": "![gif](giphy|xL7PDV9frcudO)", "label": 0}
{"text": "Yeah but that _is_ hilarious, he goes home in one piece, life moves on… and he gets to do it to the next new guy! Tricking someone into thinking they’re about to die is marginally less cool", "label": 0}
{"text": ">VIOLENTLY storm", "label": 0}
{"text": "I know, I was just commenting.", "label": 0}
{"text": "I have nothing to do with the Harris campaign, I just support democracy.", "label": 0}
{"text": "It looks like this post is about Politics. Various methods of filtering out content relating to Politics can be found [here](https://www.reddit.com/r/pics/wiki/v2/resources/filter/politics).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pics) if you have any questions or concerns.*", "label": 0}
{"text": "This is a pic of the day of love haha", "label": 0}
{"text": "Have you missed the part where Harris said she wouldn’t change a thing from what Biden did?\n\nIf you vote for her, you deserve another 4 years of economic shitfall.", "label": 0}
{"text": "How would you describe it?", "label": 0}
{"text": "😄 🤣 😂", "label": 0}
{"text": "I heard you can treat anything with ivermectin.", "label": 0}
{"text": "That's criminal!", "label": 0}
{"text": "This time, will the army shoot on the traitors?", "label": 0}
{"text": "Big enough for a human...", "label": 0}
{"text": "\\#neverforget this boils my blood and all these cultists supporting this shit are treasonous. They call them self patriots when they're fucking fascist bullies. And weird af. They don't deserve to live in this America.", "label": 0}
{"text": "You mean I don't want to see regurgitated content for a country I don't live in?\n\nCrazy.\n\nOP has already blocked me as I dared call out his rehashing of content. This is his second post of this today.", "label": 0}
{"text": "> Careful though. Entirely discounting one side like that leads to other problems. The Nazi Party, less now, but used to still have good intentions and want the country to succeed. The divide that’s grown between the two parties is damaging to us as a country. If one party simply stops existing at all, there’s no balance. The system is flawed, sure, but we can’t jump too far either way.\n\nHmm.", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "This dumbass country has always had double standards for republicans and democrats. Democrats can’t fart without the media and the majority of the country jumping down their throats, but republicans get to get impeached like Nixon, start wars based on lies like Bush, try to overthrow the government like Trump, and their side just keeps getting votes somehow 🤷‍♂️ ", "label": 0}
{"text": "that is horrifying, i am so sorry another human did this to you bro.  god damn.", "label": 0}
{"text": "And yet the dems picked a candidate who can’t articulate sentences other than being from the middle class. If Kamala loses (polls are indicating as such), there will be no accountability and people will just be gaslighted into “Trump bad” instead of admitting they put together a ticket the dems had no faith in to begin with… They are gearing up for 2028 with either Shapiro or Newsome. Even Reddit - one of the most liberal medias out there and it’s nonstop political propaganda being shoved down our throats by bot accounts won’t stop the inevitable. The left really fucked the American people this election cycle.  And no one cares. Wild.", "label": 0}
{"text": "Yeah, it did happen.  Here is a link to the media story.\n\n[https://www.cbc.ca/news/canada/nova-scotia/halifax-walmart-workplace-death-police-1.7359358](https://www.cbc.ca/news/canada/nova-scotia/halifax-walmart-workplace-death-police-1.7359358)", "label": 0}
{"text": "Gay.", "label": 0}
{"text": "Why does an oven lock shut. There is absolutely no reason whatsoever for an oven to lock shut.", "label": 0}
{"text": "Why do Republicans hate America?", "label": 0}
{"text": "Pompeii has some \n.", "label": 0}
{"text": "They liked it until people like them weren't the majority. Then they suddenly found a lot of fault in it. ", "label": 0}
{"text": "That is completely outrageous. I'd have decked them as soon as I got out", "label": 0}
{"text": "That would actually be attempted voluntary manslaughter. Where the goal wasn't harm someone but you intentionally put an individual in a lethal situation that got them killed.\n\nNot murder or involuntary. The charge would be attempted voluntary manslaughter since the person didn't die.", "label": 0}
{"text": "A bit of both. Trump is preemptively been trying to discredit the election in case he loses. Presumably because he once again wants to circumvent the democratic process.\n\nhttps://en.m.wikipedia.org/wiki/Donald_Trump_2024_presidential_campaign#/media/File%3A20240524_Trump_groundwork_for_election_denial.svg", "label": 0}
{"text": "Or on a roofing crew send new person to find a sky hook & bucket of slack in bosses truck.", "label": 0}
{"text": "Might be the hardest I’ve ever laughed at a comment.", "label": 0}
{"text": "So what exactly ARE you trying to say?", "label": 0}
{"text": "I wish their sentences were harsher, most rioters weren't even arrested sadly.", "label": 0}
{"text": "Low resolution photos don't look like that, this is AI nonsense that people are putting in cameras now.", "label": 0}
{"text": "Sometimes the old ways are best.", "label": 0}
{"text": "Unrelated question, why do you think medical field is so toxic?", "label": 0}
{"text": "Wtf is that !", "label": 0}
{"text": "If you can realize the flaw with that line of reaction I think that you would have the capacity to grow past that. I can’t even imagine what you’ve been through but it would be a shame to throw away your future over an issue with control you are aware of. I can’t say how I’d react in that situation but I don’t fault anyone for being to the point of seriously contemplating violence.", "label": 0}
{"text": "Maga is a cancer", "label": 0}
{"text": "Judge: \"six months probation, the PO will call you once, then leave you alone\".", "label": 0}
{"text": "Sounds delicious", "label": 0}
{"text": "How is there not a ln emergency switch in a walk in oven?", "label": 0}
{"text": "lol", "label": 0}
{"text": "That was my question, why in the world would an oven have a lock, furthermore, why in the world would an oven that a person can fit inside have a lock?", "label": 0}
{"text": "It should be played every day to remind people of the traitors in their midst and their leader", "label": 0}
{"text": "Different symptoms for different worms \n\nBut generally one or more of; increased appetite, lethargic,  diarhea, abdominal pain, worse than normal gas and gas pain, bloating (more than usual), itchy anus (especially at night), nausea and or vomiting", "label": 0}
{"text": "An article someone linked to seemed oddly worded, hard to tell how valid it is, but it claimed that the walk-in oven did not lock from the inside. And there was also a remark from an officer saying that it was uncertain if the staff could turn the oven off. Which makes me think someone locked her in as a joke, it turned on, and they couldn't turn it off.", "label": 0}
{"text": "*Anti-semite votes for Trump, news at 11*", "label": 0}
{"text": "If there's an enemy from within, it's these people.", "label": 0}
{"text": "Yes of course it was staged. Do you think he filled out an application, sat for an interview and gets paid for 15 minutes? Kamala was videoed in a Wawa looking for Doritos. The Secret Service and the cameras were rolling when she walked in. So that was real?", "label": 0}
{"text": "I would have called the police on him.", "label": 0}
{"text": "They have a little disc on the inside of them that you can use to open the door. Not that I think you could use it if the oven is actively baking because it’s metal and gets just as hot as everything else.", "label": 0}
{"text": "Yet, the ppl who were behind it all never got prosecuted.", "label": 0}
{"text": "“I think this should be left open.\"\n\nAs an American, IDGI. What are they trying to say here?", "label": 0}
{"text": "Someone who gets the playbook. Thank you!", "label": 0}
{"text": "I was so sick pre covid (I probably had covid but it wasn’t “around” yet.) I had been in Mexico for a week, and the second day developed a 105 fever. Was only given 2 aspirin a day from the front desk. When I finally flew home and saw my doctors, I had developed a rash, and my doctor pulled out an old medical book and was trying to diagnose me. The book made me almost pass out on the table. Like you gotta pull a BOOK out?!", "label": 0}
{"text": "This is horrible, but the morbid curiosity in me also wonders what would happen to your body right up until death. It would have been a slow agonizing death I’m sure. May that person rest in peace now", "label": 0}
{"text": "Jesus christ", "label": 0}
{"text": "By her mother? Jesus I didn’t hear that part", "label": 0}
{"text": "I wouldve got an heartattack oh my god", "label": 0}
{"text": "Id be willing to bet that \"attacking that person because I feared for my life after getting out of the oven\" would hold up in court.", "label": 0}
{"text": "It was done so poorly they were able to pretend they weren’t serious.", "label": 0}
{"text": "So?", "label": 0}
{"text": "She should have just complied.", "label": 0}
{"text": "Is he sucking on her nose?", "label": 0}
{"text": "This was my first thought. How tf was there not LOTO or an emergency alarm or escape button. So terrifying and tragic.", "label": 0}
{"text": "Holy shit", "label": 0}
{"text": "Those ovens have no way of closing by the inside.  They have to be closed from the outside and turned on after!  This is NOT an “accident “", "label": 0}
{"text": "😡😡😡", "label": 0}
{"text": "Who's ready for round 2?", "label": 0}
{"text": "In the military you send someone to grab the ID10T form", "label": 0}
{"text": "The article says that the oven does not lock.", "label": 0}
{"text": "Yeah that's not what happened. The protest was very peaceful. Then ANTIFA and CIA dressed as MAGA showed up and changed that. \n\nThere is video of this you can watch for yourself. You can see the difference between the MAGA Protesters and the others who are very aggressive and break in. \n\nThis is why Pelosi herself declined Trump's request to add more security. It was a set up. \n\nANTIFA breaks into things and does violent protest. , name a time MAGA has ever in the 10+ years. Never. We aren't aggressive.", "label": 0}
{"text": "\"You got a problem with that, sugartits?\"", "label": 0}
{"text": "Or to have in general.", "label": 0}
{"text": "That was my thought. Fear of life imprisonment wouldn't have even crossed my mind, that dude's ticket would've been punched the moment that door shut.", "label": 0}
{"text": "Trump now says he will pardon all of them if elected.", "label": 0}
{"text": "I 100% agree - I hope they are better prepared this time.", "label": 0}
{"text": "I worked at a Pizza Hut back in college. One of my managers liked to grow insanely hot peppers from his garden. A hazing ritual at that store was to have the newbies at a ghost pepper. I don't mind some spice but that was the worst food experience of my life. I couldn't work for at least an hour. I was chugging milk. Anything to deal with the burn.\n\nI trust Gary the manager more than I would trust the jagoff outside the oven. \n\nThe guy should have sued, but to even do that he would have needed to take it to management. Then given management reasonable time to address the situation. In this situation it sounds like they walked off the job right away. Labor law sucks.", "label": 0}
{"text": "I guarantee that this place will become a local cultural landmark like Murder Kroger. In a year from now, local people will be saying they're going to \"Oven Walmart\"", "label": 0}
{"text": "“Demise” makes the worker sound like some kind of comic book villain.", "label": 0}
{"text": "You guys have severe problems.", "label": 0}
{"text": "Harris 2024", "label": 0}
{"text": "With a colonoscope too . I’ve never seen one in my 4 years of Endo experience.", "label": 0}
{"text": "Wtf!!?", "label": 0}
{"text": "The only thing that gives me some peace is that Biden will call the National Guard and be ready", "label": 0}
{"text": "Assuming he doesn't just think Indians are stupid, a yoong person who may not speak or read very well English could be more likely to not be able to read the danger signs", "label": 0}
{"text": "I would have gone feral at that bitch for letting me survive that oven \"prank\"", "label": 0}
{"text": "Does anyone realize how stupid and rude it is to ask someone a question like this when they are travelling? If you insist on talking to a celebrity, use that moment for important questions, things that actually matter.", "label": 0}
{"text": "Wait....what?", "label": 0}
{"text": "Thanks I hate it", "label": 0}
{"text": "Fascism appeals to subservient people.", "label": 0}
{"text": "Walmart to the employees at the other stores:\n\n\nPlease remain silent for 1 minute as we mourn the loss of profits during this tragic closure\"", "label": 0}
{"text": "It should have been loto'd and potentially handled as a confined space with an entrance spotter. My ass would been walked to my vehicle if I did anything like that.", "label": 0}
{"text": "Used to work at Panera in highschool and I remember the walk in ovens! They use to put off so much heat even when closed", "label": 0}
{"text": "Lockout tagout", "label": 0}
{"text": "When you reap the constant privileges of a systemically racist state, equality feels like oppression.", "label": 0}
{"text": "Yeah, I make jokes about myself all the time as a coping mechanism; even though my body is falling apart & I'll be lucky to live into my 60's", "label": 0}
{"text": "I saw the same videos. I’m not sure what the audio is from, but most people have said it’s not actually from this incident from what I’ve seen. But it freaked me out when I first heard it", "label": 0}
{"text": "That’s 114.8 degrees Fahrenheit for those wondering.", "label": 0}
{"text": "Get ready for another thing like this very soon!", "label": 0}
{"text": "Fine I will wait, but claiming it is negligence not foul play is the exact same thing. No proof or evidence that it was negligence. \nIf I can’t claim homicide because the investigation is on going then someone else equally can not claim negligence", "label": 0}
{"text": "A girl was burned alive and people in the comments are caught up on the picture resolution and sign spelling. Fucking wild priorities.", "label": 0}
{"text": "Lock out tag out is a term used when working around large and potentially dangerous pieces of equipment.\n\nOne example from a previous job I had: A large trash compactor. Sometimes people would have to go into the compactor to clean or do other maintenance, and if it were turned on with someone in there that would obviously be very bad.\n\nSo the power button had a locking mechanism on it. Anyone who went into it would put a lock on the switch and pocket the key. So the machine could not be powered on until they came back out and removed their lock.\n\nIf multiple people needed to go on, they each added a lock.", "label": 0}
{"text": "Eggs were $2.99 instead of $4!", "label": 0}
{"text": "WHY ISN'T THERE A WAY TO OPEN FROM INSIDE", "label": 0}
{"text": "I just imagine if any of this was done my Muslims it would be called an act of terror but when the white supremacist do it, it's not an act of terror!", "label": 0}
{"text": "From an unbiased perspective/question trying to understand, was the 2016 marching in the streets for 3 weeks chanting “not my president” and causing destruction/ injuries any comparison to Jan 6?\n\nThe 2016 marching is wiped off the internet and never talked about again but Jan 6 has been talked about everyday. Is Jan 6 significantly worse because it’s people of elite positions? Or it’s because trump didn’t accept that 2020 was a fair election and didn’t condone them properly?\n\nBecause technically both parties, it was the people not the candidates who went to the streets refusing to accept the results and causing destruction. Right? Or trumps is non-comparable for what reason? For the ones I listed?", "label": 0}
{"text": "You are assuming the person inside the oven is both conscious physically able to operate that switch.", "label": 0}
{"text": "Sorry this wasn't about Trump.", "label": 0}
{"text": "This is the comment I was looking for that will let me sleep at night.", "label": 0}
{"text": "Those traitors and haters shoulda been $#@! on the $¶®! 👎👎👎", "label": 0}
{"text": "And this is what lockout/tagout policies exist.", "label": 0}
{"text": "Agreed a million times over my brother..as a half breed of Irish and Mexican immigrants in South Texas,  i was the first known \"legal\" child born of parents who weren't legally allowed to marry until 1976. The concept of America, a land of immigrants seeking freedom from prosecution for their religious views, has no precedent...And though obviously flawed per the time period, it's ideals encourage a world of acceptance and love for fellow mankind...God fucking bless this country!God bless intelligent, good natured ppl like you and your family, makes me proud to be American!", "label": 0}
{"text": "> You mean I don't want to see regurgitated content for a country I don't live in?\n\nThat's pretty vague but I have a hung it's only *specific* content that meets that definition you choose to complain about.", "label": 0}
{"text": "Yeah....looks peaceful to me!\n\n/s", "label": 0}
{"text": "Unless she was already dead. I saw on another post that apparently there was blood all over the place. Oven would be an interesting place to stick a body to try to destroy or hide evidence.", "label": 0}
{"text": "That is attempted murder bro! You wouldn’t call someone shooting at you but purposely barely grazing you a “joker coworker”.", "label": 0}
{"text": "The government should fear the people", "label": 0}
{"text": "Any pictures of Teddy Cruz in the broom closet?", "label": 0}
{"text": "From an unbiased perspective/question trying to understand, was the 2016 marching in the streets for 3 weeks chanting “not my president” and causing destruction/ injuries any comparison to Jan 6?\n\nThe 2016 marching is wiped off the internet and never talked about again but Jan 6 has been talked about everyday. Is Jan 6 significantly worse because it’s people of elite positions? Or it’s because trump didn’t accept that 2020 was a fair election and didn’t condone them properly?\n\nBecause technically both parties, it was the people not the candidates who went to the streets refusing to accept the results and causing destruction. Right? Or trumps is non-comparable for what reason? For the ones I listed?", "label": 0}
{"text": "IS this graffiti? I'd have assumed \"mural\" would be a better word.", "label": 0}
{"text": "Do BLM", "label": 0}
{"text": "Attempted murder? LoL", "label": 0}
{"text": "That’s a fish fin from the block, not a ring. If you look at the other blocks you can see random fins coming out.", "label": 0}
{"text": "Walk this way", "label": 0}
{"text": "Sorry to speculate, but what if the person was already deceased when they were placed in the oven? Someone might have murdered the person and then tried to use the oven to destroy or reduce evidence (such as DNA)", "label": 0}
{"text": "I mean, I'd be more surprised if they cancelled it. A show like this employs a lot of people and that's a lot of jobs to get rid of because the voice of a supporting character is gone.", "label": 0}
{"text": "Lack of accountability.", "label": 0}
{"text": "Puckering my asshole so tight after reading this thread man. Thanks for the nightmares.. Jesus", "label": 0}
{"text": "And kneecapped them with a bat", "label": 0}
{"text": "Damn he doubled down!?!?! He really me y it when he said he could shot someone in time square and he would t lose a single supporter… The fucking brain rot of these people man…", "label": 0}
{"text": "Oh god, the way I would’ve panicked and kicked the door open😖not only would I have quit, but they would’ve needed a whole new oven.", "label": 0}
{"text": "Did you send it to path to get an id on what species it is?  It looks relatively big for a worm in the pic but it is hard to gauge it’s size.", "label": 0}
{"text": "Imagine dying… for Trump… wearing a Trump cape\n\nSorry, you can’t clutch your pearls hard enough to erase the absurdity of that. Clowns dying for clowns.", "label": 0}
{"text": "I wonder what treasures will be unearthed in the future.\n\nAnd I'm not just talking earth. There's millions of pounds of ice revealing unknown things too!", "label": 0}
{"text": "Was he cooked medium rare or well done?", "label": 0}
{"text": "Never seen hocus pocus? lol", "label": 0}
{"text": "[96% of BLM protests were peaceful](https://www.wshu.org/news/2020-10-19/uconn-study-at-least-96-of-black-lives-matter-protests-were-peaceful), but a small number got co-opted by violent looters, nothing to do with the movement.\n\nhttps://apnews.com/article/virus-outbreak-race-and-ethnicity-suburbs-health-racial-injustice-7edf9027af1878283f3818d96c54f748\n\nIn fact much of the violence was instigated by right-wingers.\n\nhttps://kevinjshay44.medium.com/right-wing-provocateurs-likely-inflaming-protest-violence-bcf1c48e1d40\n\nNazi's Caught Dressing As BLM Protestors To Instigate Riots https://bipartisanreport.com/2020/07/27/nazis-caught-dressing-as-blm-protestors-to-instigate-riots/\n\nWhite supremacists pose as Antifa online and instigate violence https://www.independent.co.uk/news/world/americas/us-politics/george-floyd-protests-antifa-twitter-white-supremacists-far-right-racist-a9544276.html\n\nGov Walz: Organized Groups Now Using Protests to ‘Break the Back of Civil Society’ https://heavy.com/news/2020/05/gov-walz-organized-groups-now-using-protests-to-break-the-back-of-civil-society/\n\nPolice: Richmond riots instigated by white supremacists disguised as Black Lives Matter https://www.wsls.com/news/virginia/2020/07/27/police-richmond-riots-instigated-by-white-supremacists-disguised-as-black-lives-matter/\n\nMystery 'Umbrella Man' Vandal From Minnesota: Police Say He’s A White Supremacist Instigator https://www.forbes.com/sites/mattperez/2020/07/28/mystery-umbrella-man-vandal-from-minnesota-police-say-hes-a-white-supremacist-instigator/#1b39787f48ee\n\nTons of video evidence supports this:\n\nhttps://streamable.com/ypam81\n\nhttps://v.redd.it/qqwp9m4a17251\n\nhttps://www.youtube.com/watch?v=mP-D6NnZdDI&feature=youtu.be\n\nhttps://twitter.com/Freeyourmindkid/status/1266661155994550272\n\nhttps://twitter.com/Freeyourmindkid/status/1267140001952866304\n\nhttps://twitter.com/Freeyourmindkid/status/1267168431897444353\n\nhttps://twitter.com/Freeyourmindkid/status/1267468697595195397\n\nhttps://twitter.com/Freeyourmindkid/status/1267692198537068544\n\nhttps://twitter.com/Freeyourmindkid/status/1268047430026694657\n\nhttps://twitter.com/Freeyourmindkid/status/1267160837401325569\n\nhttps://twitter.com/AndrewSolender/status/1266924387795709954\n\nBLM protesters clearly telling instigators to stop rioting.", "label": 0}
{"text": "We had a walmart walk in freezer suicide a few weeks ago near me (also in Canada)", "label": 0}
{"text": "a day of peace and love", "label": 0}
{"text": "It’s possible the door was held shut", "label": 0}
{"text": "Eros Bendato\nautor: Igor Mitoraj\nMadrid 2008", "label": 0}
{"text": "Ha, they spelled center wrong.", "label": 0}
{"text": "So did Futurama, but that didn't stop them from digging up that grave.", "label": 0}
{"text": "the fact that you didnt start this comment with \" i once sued\". you better have not let that slide and made that guy not face time in prison for attempted murder", "label": 0}
{"text": "Cold War Steve on instagram does some good parody’s 👍🏼", "label": 0}
{"text": "Please tell me he got fired, that's not even funny. The funny would be if he didn't close the door but turned on a orange/amber flash light into the room.", "label": 0}
{"text": "Yes, they can't be better than anyone if we're all equal.", "label": 0}
{"text": "Think they were referring to a YouTube video about the bumblebee incident. 🤔", "label": 0}
{"text": "Damn rip the victim", "label": 0}
{"text": "i find very few things about celebrities actually matter.", "label": 0}
{"text": "The people should fear Republicans.", "label": 0}
{"text": "Your submission was automatically removed because youtube.com is not an approved site. Please try uploading your picture to imgur.com or reddit's own           image host. Thank you\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pics) if you have any questions or concerns.*", "label": 0}
{"text": "I thought it looks cool and shared it. You got a problem with that? Lol", "label": 0}
{"text": "That or maybe in closing the door made something fall and couldve obstructed it, that is quite the reach though.", "label": 0}
{"text": "Yea, I think it's more likely homicide, and I imagine (or hope) that the poor person deceased quickly, before they were even placed into the oven. So sorry to read this in any case", "label": 0}
{"text": "What's up with the yellow sign looking like AI text?", "label": 0}
{"text": "Either she didn't walk out because she randomly passed out or someone held the door she couldn't leave so murder. I'm guessing its complex because there is no video footage inside the oven.", "label": 0}
{"text": "😨", "label": 0}
{"text": "I’m still trying to wrap my head around “walk in oven”", "label": 0}
{"text": "Why is there no lockout on a device like this? Usually stuff that you enter that puts your life at risk there’s lockout/tagout and someone that’s aware you’re in a confined dangerous place, 0 safety measures here on Walmarts part. Insane", "label": 0}
{"text": "I wouldn't have thought someone crawled in the oven for a nap. \"Accident\" was not on my radar.", "label": 0}
{"text": "Looks like ascaris. \n\n\nWas there any other?", "label": 0}
{"text": "Or she had a panic attack? Something preventing her from thinking straight and escaping", "label": 0}
{"text": "No one wants others to die. But when it is completely and totally justified, \\*especially against a domestic terrorist\\*, then no, I will not spare a thought.", "label": 0}
{"text": "You want us to grieve over some cooked bro in America? \n\nIt’s comical, let’s be honest - he got cooked in a supermarket oven. Never in my life will I find myself in a situation where I’m going to potentially be cooked 😂", "label": 0}
{"text": "They had to, it wasn't a choice. There is going to be an investigation by multiple agencies into her death.", "label": 0}
{"text": "Come on bro", "label": 0}
{"text": "That’s not even a prank that’s just attempted murder.", "label": 0}
{"text": "I'm leaning towards the mother that found her. Because a) murdering a young daughter who displeases the parents is not uncommon in Indian families and b) how did the mother know to look in the oven before anyone else?", "label": 0}
{"text": "Are you sure that’s not actually Dwayne “The Rock” Johnson? They look great!", "label": 0}
{"text": "My dentist got excited once. He then said to me “you really don’t want your dentist to be excited” - after gleefully stating to his assistant “wow!! Look at the size of this cavity!”", "label": 0}
{"text": "Thanks Mr. Carlos , what a nice thing to do ", "label": 0}
{"text": "Those are some large beetles", "label": 0}
{"text": "Please stop answering questions. No offense, but it's not helping!", "label": 0}
{"text": "AHHHHH NO! RED FLAG! FUCK NO! HELL TO THE FUCKING NO! HOME! I WOULD GO HOME THAT VERY MOMENT! HELL NO", "label": 0}
{"text": "this is 2024... nothing would surprise me.", "label": 0}
{"text": "I remember too.  You could tune in and learn something!", "label": 0}
{"text": "I was on a Navy ship (I was in the Army) for a short time, and one of the 1st class petty officers was telling tales of when he was on an attack submarine in the berthing area. He said he got sent to wipe down the inside of a torpedo tube (which I think they really do have to do). Once he crawled inside they slammed the hatch ( breach block? I don't know the correct nomenclature) closed behind him and loudly shouted that they were going to flood the tubes. He said he didn't think it was very funny until afterwards.", "label": 0}
{"text": "Can someone gives some context please?", "label": 0}
{"text": "🤮", "label": 0}
{"text": "Bro is cooked.", "label": 0}
{"text": "Good.", "label": 0}
{"text": "Embarrassing enough though it'll be for the same candidate", "label": 0}
{"text": "It was just a joke bro.   \n\n\nI’m all seriousness, that’s messed up.", "label": 0}
{"text": "I worked in the bakery at the Sprouts in Huntington Beach CA on Adams and Brookhurst.  We had a woman die in my bakery because she cut her arm open with a bread slicer, went into shock, and then died of a heart attack.  The store is still goin strong!  We just have a ghost in the bakery that knocks things off the shelves.  Don’t believe me?  Go to the store and ask yourself.", "label": 0}
{"text": "that walmart is local to me. i feel awful about the situation", "label": 0}
{"text": "My husband cut his finger badly and went to the urgent care for stitches. I had done some pretty good first aid on it to get the bleeding to stop, but when the nurse took off the bandages it started spurting blood, which I guess she wasn’t expecting. She yelled “Oh my God!!” in a really loud voice, and terrified my poor husband. He thought he was going to lose his finger or something. She immediately calmed down and apologized for startling him. She said she just wasn’t expecting him to be that much of a bleeder, lol.\n\n\nHe did bleed a lot. After I doctored him I started wiping all the blood off the floor because I didn’t want the cats tracking it everywhere while we were gone and he got very upset with me. \n\n\nI was just like, chill dude, take deep breaths and hold your hand over your head, you’ll be fine. I was a klutzy kid and still am a klutzy adult. I know when a wound is an emergency and when I can get the blood off the floor before driving your ass to urgent care.", "label": 0}
{"text": "Or someone held the door shut from the outside. The investigation will hopefully reveal what happened. Do Canadian news do follow-ups on cases like this?", "label": 0}
{"text": "Didn’t have room to mention in the title that this pic was snapped the day that was recorded.", "label": 0}
{"text": "Pretty sure they're trolling", "label": 0}
{"text": "No, but I could have sworn I’d heard of something similar happening a few years ago. I can’t find the story though. Maybe I imagined it.", "label": 0}
{"text": "So how about “attempted coup”, “sedition” “traitorous action”, “domestic terrorism” then ? I think they sum it up pretty well. \nFucking traitors.", "label": 0}
{"text": "I would not want to go urban exploring in an abandoned prison. I'd be too paranoid that I'd hear a \"click\" behind me as a door swings closed behind me and locks.", "label": 0}
{"text": "Now go fishing with it", "label": 0}
{"text": "Israel purposefully targets civilians in Lebanon even when there's no Hezbollah members anywhere near them", "label": 0}
{"text": "Not disputing any theory (I'm totally unfamiliar with these ovens), but couldn't she have had an accident while working around or in the oven, perhaps fallen or rendered unconscious while performing a task, fetching something or even taking a shortcut in her work? Incredibly sad for all involved.", "label": 0}
{"text": "It's not vague at all unless you're the type of guy to lap up this low effort reposting.\n\nYour hunch is garbage too. \n\nThis site is cancer when it's american election time and you're part of it.", "label": 0}
{"text": "Well, if that ain’t a lovely gathering,\nJust like a tailgate party", "label": 0}
{"text": "So what are they setting up in the capitol this time to stop them  ? They are going to come again…Trump has made it pretty clear win or lose he’s taking power.", "label": 0}
{"text": "What the fuck man that's not even funny 😭", "label": 0}
{"text": "Not really the point but what’s up with the distortion on the sign in the first picture?", "label": 0}
{"text": "If person A points a gun at person Bs head and pulls the trigger while person A knows it's unloaded but person B doesn't, you would still have to PROVE that person A did not intend to kill person B. Which would be exceedingly difficult, given the indisputable fact that they just pulled the trigger against someone's head. \n\nPerson A would claim they knew it was unloaded, but a jury is free to doubt the claims of a deranged lunatic. Clear definitions are great, and technically it's not attempted murder by perfect justice, but it does come down to providing convincing evidence to a group of 12 hairless emotional apes who are putting themselves in the victims shoes while deciding if perhaps society would benefit if person A wasn't in it.", "label": 0}
{"text": "Seriously. He could have renamed that restaurant after himself when that lawsuit was done.", "label": 0}
{"text": "Proof that American patriotism isn't dead yet", "label": 0}
{"text": "But they did accept the results in 2016, you can tell by how they didn't attack congress in an attempt to overturn the election results.  While you could interpret \"not my president\" as them not accepting but given the context of it being in a peaceful protest it's way more accurate to view that statement as the protestors saying the president does not match their values.", "label": 0}
{"text": "It didn’t get flushed out with prep?? 😲😲", "label": 0}
{"text": "Sorry mister boss of Reddit", "label": 0}
{"text": "Yeah it is AI enhanced from what it seems, not 100% generated.", "label": 0}
{"text": "It Orange County, California that would DEFINITELY be charged as attempted murder. They always overcharge and force you to plea.", "label": 0}
{"text": "Legally, it would not be justifiable and they certainly could be held accountable for breaking their jaw. I’m just speaking in a strict legal sense.", "label": 0}
{"text": "The only thing Trump seems to be able to articulate is his desire for fascism.\n\nAnd Trump's own cabinet are the ones saying that he is a fascist.\n\nYet it's the Dem's fault for running the current VP and former AG of California?  Sorry, I have heard her speak, and she is far more cogent than 78 year old Trump in clear cognitive decline.", "label": 0}
{"text": "Jesus Christ😵‍💫", "label": 0}
{"text": "Pepsi? As in they're sponsoring the prison or what?", "label": 0}
{"text": "Every one I’ve been in can be opened from the inside even if locked and pad locked from the outside. I’m sure there are some really old ones still in use without this safety feature but anything installed within the last couple decades definitely should.", "label": 0}
{"text": "Or the incredibly stupid lottery of a mop handle tipping over and landing on the door handle, final destination style.\n\nBut also, fuck Walmart, not having multiple employees to watch each others backs.", "label": 0}
{"text": "Is it safe to vote by mail??? And how can I do it if I am outside the USA??? 👀👀👀", "label": 0}
{"text": "i remember when this happened!! right where i live :(", "label": 0}
{"text": "This don't look very peaceful and full of love to me.", "label": 0}
{"text": "How the heck did that dude hang on in there with the pre colonoscopy purge? Must’ve been a wild ride!", "label": 0}
{"text": "Any claim to love their country was eradicated when Republicans acquitted him after this", "label": 0}
{"text": "Nice baseball helmet, dork", "label": 0}
{"text": "They never really went away, just stopped making certain products. They're currently making 35mm, medium format, and movie industry films, along with an assortment of film cameras and digital printers.", "label": 0}
{"text": "You don’t have to attend the school bully’s birthday party.", "label": 0}
{"text": "Yeah, it's truly awful. If foul play isn't involved, I have no idea how it could actually happen. We had ovens like this at Panera, it's unimaginable to think someone could get stuck in one without someone like intentionally doing it to them.", "label": 0}
{"text": "If I were the judge at that trial I would throw out the case.  and I would declare 1 week of amnesty for any thing that could possibly happen.", "label": 0}
{"text": "Trump was president last time this went down. Try it again, see what happens", "label": 0}
{"text": "Or look you dead in the eyes and say \"it's clearly Antifa\" smh", "label": 0}
{"text": "Love it when a local news story makes international news. Gross and horrific way to die. Fuck Walmart", "label": 0}
{"text": "This sounds like someone watched Only Murders in the building this season and is using the oven to cover up evidence. Dead people can't get out of ovens, live ones can.", "label": 0}
{"text": "Ha, they spelt centre correctly.", "label": 0}
{"text": "Which is exactly what makes it so horrible and suspicious. There is never a reason for a person to be fully inside one of these. Maybe a technician but obviously it would then be powered off.", "label": 0}
{"text": "Traitors", "label": 0}
{"text": "Actually the United States spells it wrong.\n\nAmerican English spelling was influenced by Noah Webster, an early American lexicographer, who sought to simplify and standardize English spelling in the United States. His changes were aimed at making spelling more phonetic and distinct from British English, which he believed would help establish a unique American identity. Over time, these differences became standardized in dictionaries and educational systems, leading to the variations we see today.\n\nSo basically some American jackass decided to spell a bunch of words wrong and the US kept the spellings to make them sound cool.", "label": 0}
{"text": "So you’re happy with what happened ?", "label": 0}
{"text": "Not for lack of trying, he didn’t succeed and suddenly people assume he’ll just be a sane normal leader? Or worse, just assume the guardrail will hold this time even though the Supreme Court has specifically weakened them.", "label": 0}
{"text": "After ingestion, the A. lumbricoides roundworm reproduces inside your intestine. The worm goes through several stages:\n\nSwallowed eggs first hatch in the intestine.\nThe larvae then move through the bloodstream to your lungs.\nAfter maturing, the roundworms leave your lungs and travel to your throat.\nYou’ll either cough up or swallow the roundworms in your throat. The worms that are swallowed will travel back to your intestine.\nOnce they’re back in your intestine, the worms will mate and lay more eggs.\nThe cycle continues. Some eggs are excreted through your feces. Other eggs hatch and return to the lungs.\n\n\nI'm imagining coughing up a worm 🪱  like Will at the end of Stranger Things season 1, and that is some nightmare fuel....", "label": 0}
{"text": "Covid really didn't help when we all had to socialize less, seems like some people missed out on retaining their empathy.  It's not even funny to make a joke about this shit and yet we have assholes on here that think they're the class clown.", "label": 0}
{"text": "![gif](giphy|W561jj5bXQvqGRMXoR)", "label": 0}
{"text": ">This site is cancer when it's american election time and you're part of it.\n\nOkay. Now we're getting somewhere. A little more specific...", "label": 0}
{"text": "guys it was peaceful!", "label": 0}
{"text": "Wouldn’t a hamburger sub just be a hamburger?", "label": 0}
{"text": "i'd have actually assaulted that person holy shit, that gave me anxiety jjust reading it\n\ni hope to fuck you slapped that boy out of his shoes", "label": 0}
{"text": "I'd bet money that EVERY Nazi is supporting Trump.", "label": 0}
{"text": "That's not why they're making jokes in this thread. This isn't a death they're trying to mentally cope with. They just don't care.", "label": 0}
{"text": "A worker was cleaning the inside of a commercial bakery oven, and was somehow stuck inside while the oven turned on.", "label": 0}
{"text": "That and as Americans we don't have the luxury of \"tragedy + time = comedy\"", "label": 0}
{"text": "the real question is how can we get rid of these without a colonoscopy? Please tell us.", "label": 0}
{"text": "all because the over grown orange turd cant accept defeat, has clearly always got his way in life and threw a big temper tantrum on the floor.\n\nladies dont be with men that act this way, this is not manly, this is not alpha, this is a spoiled little brat that always thinks life will go his way somehow someway", "label": 0}
{"text": "This reminds me of the Kenneka Jenkins case but with an extra layer of wtf. I hope all the store cameras are working, Walmarts are like fort know with CCTV.", "label": 0}
{"text": "Now it is", "label": 0}
{"text": "Fax over some paper.\n\nA bucket of steam.\n\nThe classics.", "label": 0}
{"text": "wtf dude missed a windfall", "label": 0}
{"text": "Omggg yes. Did not think of that smh.", "label": 0}
{"text": "I bet they feel so much better now, lol.", "label": 0}
{"text": "I’m confused how the mom was only out of contact with the daughter for an hour and then the next time she saw her she was “charred remains”. Something seems fishy here to me. I think it’d take longer than an hour for something like this to occur.", "label": 0}
{"text": "😂😂😂😂", "label": 0}
{"text": "And? Wtf is your point", "label": 0}
{"text": "\"In ancient Argentina, armadillos run over YOU.\"", "label": 0}
{"text": "I honestly believe, IF Kamala wins, this will happen again...", "label": 0}
{"text": "Seriously? After the fact, it’s not self defense anymore. Congrats to your defense if they get an acquittal. It would be a mitigating factor but still illegal.", "label": 0}
{"text": "Imagine THAT being the “better” option here. One can only HOPE she was murdered and then put in the oven to destroy evidence. Like literally hoping that is the case, because it’s better than the thought of being cooked alive.", "label": 0}
{"text": "The store was open for 20-30 mins *after* they found out what happened.", "label": 0}
{"text": "Some lead from a Walmart posted a video of their ovens on TikTok. The door doesn't even latch unless you apply force. Even if it were too hot to touch all they needed was to kick it lightly with their feet and it would've opened. There's no way this was by accident unless it was the upmost grossest négligence in existence. She had to have been unconscious going in there. Now with how those ovens are supposedly set up", "label": 0}
{"text": "Ugh, that’s so disappointing when doctors dismiss patients concerns. Hopefully youre better now", "label": 0}
{"text": ">Echo chamber dweller upset 😭\n\nSorry, buddy, didn't mean to upset you. Weird that you refer to yourself in the third person. Guess weird is just par for the course for you people.", "label": 0}
{"text": "I work in a manufacturing facility. We take worker safety very seriously and have not had a fatality, but we have had injuries. LOTO (lockout tagout), machine guards, andons, PPE, all play a part but most important is a philosophy that no one’s life or limb is worth meeting a production quota.  Intentionally bypassing safety systems because it’s faster than waiting to call someone to fix something is not an option.", "label": 0}
{"text": "100 % and if your good enough to vet the manager, boss coworker on record whether written like on text or recorded o. Phone call you have evidence and a case against them", "label": 0}
{"text": "Then they will suffer consequences - I hope physical consequences this time since we were way too calm about the last one.", "label": 0}
{"text": "It was mostly a play on OP using “joker” to describe someone who attempted to murder them. You are 100% correct it’s not at all funny or little.", "label": 0}
{"text": "You forgot the /s", "label": 0}
{"text": "Police are investigating and the store has been closed multiple days because of it", "label": 0}
{"text": "I was thinking this is giving brazen bull", "label": 0}
{"text": "100%", "label": 0}
{"text": "The division is bad. Trump is the prime divider", "label": 0}
{"text": "I had a tooth with 3 roots too, unfortunately the dentist didn't notice until I finally got back in a week after his first attempt at the root canal. What a miserable week!", "label": 0}
{"text": "It was done to hopefully open your eyes to how silly your statement was.", "label": 0}
{"text": "That shit is gonna be haunted now", "label": 0}
{"text": "The flip-flopping on that is hilarious. Don't trust the FBI because they did Jan 6th, but also trust the FBI when it comes to the Trump assassination attempt investigations, but also don't trust the FBI because....reasons.", "label": 0}
{"text": "Apollo 1 astronauts were melting to the inside of their capsule while trying to open it", "label": 0}
{"text": "I dare you to try and think anywhere neat this rationally if this happened to you. That moron deserves the ass beating and no one's going to convict you of beating someone's ass WHO TRIED TO KILL YOU.", "label": 0}
{"text": "Ow boohoo she tried to hang the VP and be shot, you guys are such victims 😢 should have been way more.", "label": 0}
{"text": "Aw shit, trolls got me again.", "label": 0}
{"text": "What was the other incident?", "label": 0}
{"text": "He have a friend who got looked into  walking  freezer, it huge, they have gear but not for 6 hours.  He is missing toes.  I hate when people do pranks with peoples life.", "label": 0}
{"text": "Yea I think really people are just wild everywhere", "label": 0}
{"text": "That was a Loblaws store", "label": 0}
{"text": "That scene from The Boys is the first thing I thought of when I heard about this. Absolutely horrible", "label": 0}
{"text": "We'll use the Network Traffic Drain lol!", "label": 0}
{"text": "If there was an election for work safety regulators, you would have my vote.", "label": 0}
{"text": "Now it's clear why u/TheCreativeProducer indeed is a Trump supporter: he also has a superbig mouth making ridiculous claims, even shouting he has proof, yet fails to produce anything. Sad!", "label": 0}
{"text": "This is dark, but I kind of hope she was already dead. The oven would be a HORRIBLE way to die.", "label": 0}
{"text": "This article and another state that Walmart's oven did not have the capability to lock, but models I've seen do have emergency open buttons on the inside. \nSo either the door was blocked, super stuck, or she fell and couldn't leave under her own power.\nI'm praying the last one because it means there's a chance she was unconscious.", "label": 0}
{"text": "It's almost comical if it weren't so dumb that people genuinely try this: https://reddit.com/comments/1gc153q/comment/ltqabp9", "label": 0}
{"text": "Still salty, don’t worry they’ll give you a break for a few minutes at the ward", "label": 0}
{"text": "Ir they could have taken drugs so they didn’t feel anything.", "label": 0}
{"text": "Trump's government was the latest in a long line of business failures he has led. But his supporters *still* think things were better under his presidency.", "label": 0}
{"text": "Not an insurrection. Just a peaceful walkabout in a building their taxes maintain", "label": 0}
{"text": "Reddit comments like that 100% are being edgy because they aren't coming from people who actually have to cope with this disaster. Don't compare edgelords to the victim's friends/family or anyone who had to be on the scene to witness this.", "label": 0}
{"text": "Remember some managers cut off lock out locks for “reasons”", "label": 0}
{"text": "I agree, those types of ovens don't lock (for this reason), and they're certainly not soundproof, so if someone was conscious and was stuck in there, someone would know about it. They were definitely put in there when they were unconscious", "label": 0}
{"text": "No details of that nature have been released", "label": 0}
{"text": "🇨🇦", "label": 0}
{"text": "Even if there was an emergency shutoff, there’s no guarantee that it works. I worked for a large corporate chain and happened to get locked in a walk in freezer for almost 45 minutes. I didn’t have my phone on me because it was supposed to be a quick trip, but the door latched behind me and wouldn’t open. I tried the emergency exit button multiple times with no luck and the door wouldn’t budge. I started banging against the door and yelling, hoping someone could hear me. Someone heard eventually and let me out but it was a terrifying experience. I’m not sure if that door was ever fixed or became part of a routine maintenance/functionality checklist (I highly doubt it), but that was the final straw to get me to leave that job.", "label": 0}
{"text": "A MAGA protester tried to throw me to the ground in November 2020 because I flipped off a different MAGA protester. Complete scum.", "label": 0}
{"text": "Were they attacking the country in order to install an unelected leader or were they protesting the unjust killing of unarmed US citizens by law enforcement officers?", "label": 0}
{"text": "But I doubt Biden would refuse to call out the National Guard.", "label": 0}
{"text": "I can't remember exactly but one ankle and foot was swollen and never went down. Years later it was still the same.", "label": 0}
{"text": "Well, good thing there’s cameras everywhere ", "label": 0}
{"text": "Open outwards so that would have to be a insanely unlikely circumstance where the broom is somehow wedged like that. Not to mention even a person of small stature would likely be able to force the door enough to snap a broomstick. Not saying it's not possible, but suspicious activity is far more likely.. sadly :'(", "label": 0}
{"text": "Oh you're right it was. My bad.", "label": 0}
{"text": "why would you down vote me asshat? Jeesh. No it won't happen again. It was unprecedented before. We'll be ready this time.", "label": 0}
{"text": "Maybe she hit her head or fainted? The walk-in freezers at my restaurant jobs always freaked my out a little. I’d always want to prop the door or not let it close all the way while I was grabbing stuff in there.", "label": 0}
{"text": "Bro. Trump has done enough bad shit. If by now they haven’t been able to see the crap he’s responsible for, it’s not going to happen. It’ll be denial, mental gymnastics, and lies. They are lost causes.", "label": 0}
{"text": "Holy. Fucking. Shit.\n\nWhat is *wrong* with people?!?!", "label": 0}
{"text": "how tf does someone just have that in their body without knowing 😭", "label": 0}
{"text": "Anyone else see Moo Deng in the shadow? Just me?", "label": 0}
{"text": "imagine so called tough alphas that still want another man to tell them what to do, how to live their life..thats not alpha at all idiots!", "label": 0}
{"text": "Insert generic Reddit comment here!", "label": 0}
{"text": "Your faith in corperations to alter our nervous system is alarming. It makes me angry that people are so careless and shortsighted in our technological progress. I'm not saying that we shouldn't progress but that ideally we would do so cautiously. Currently we are letting the 1% guide our future in the manner that benefits themselves most with disregard for the long term implications. This opinion is my motivation for responding to you. Forgive my frustration and please consider the above. \n\n\nI noticed what I believe to be gaps in knowledge of your description of nervouse physiology and what constitutes an invasive procedure. I can elaborated but I didn't want to dilute my greater concern. ", "label": 0}
{"text": "Very true.", "label": 0}
{"text": "They sure look like peaceful tourists...F\\*ck those elected officials who enable this behavior.", "label": 0}
{"text": "Don't think this is what they mean by....let that man cook!", "label": 0}
{"text": "Neither my cousin (28) nor my mom (49) had any symptoms until one day they suddenly did. Went in immediately and both were stage 4. Neither is with us anymore. \n\nGO GET CHECKED.", "label": 0}
{"text": "shoulda beat his aas", "label": 0}
{"text": "\"It was a day of Love\" -DJT", "label": 0}
{"text": "It's possible while it doesn't have a lock, it may \"latch\"...which from the outside wouldn't prevent you from opening it, but would keep it secure while operating. I worked at a Wendy's in my teens and they had a convection over for potatoes that has a latch... to speed cooking it sealed. It wasn't locked, but there was a positive seal once the oven started.", "label": 0}
{"text": "Toasty!", "label": 0}
{"text": "My guess would be assault.  When in doubt, some form of assault usually applies.", "label": 0}
{"text": "Yeah I didn’t think you meant it was super graphic, but hearing someone scream for help and filming it instead of trying to help them is insane.", "label": 0}
{"text": "Hello 🤗", "label": 0}
{"text": "I worked in a Walmart bakey and had terrible, terrible anxiety just looking at the human sized baking oven. ", "label": 0}
{"text": "Did you nickname it Ozempic?", "label": 0}
{"text": "Cost of doing businesd", "label": 0}
{"text": "Jesus. How big are Walmart's ovens?", "label": 0}
{"text": "I think they’ll be more prepared this time", "label": 0}
{"text": "Animals on the highway are no different. \n\nParasites are not caugh on the highway caught. They are caugh in the wild, usually eating grass, poop or drinking water", "label": 0}
{"text": "‘One man’ is the owner, and employment is at-will.", "label": 0}
{"text": "Of course they don't see anything wrong with that. This are idiots risking and doing everything for the Republicans that is a major part of their voters. As long it's for their party everything is justified", "label": 0}
{"text": "back into the conv….??\n\n\nIt was an attempt at an insurrection on our own capitol! How is that not being talked about CONSTANTLY?!\n\n\nDo people just not understand how insane that is?!", "label": 0}
{"text": "someone has not worked in a bakery. walk in ovens are standard equipment in bakeries. \n\nthis is absolutely horrifying though. i could not imagine. it's just awful that someone could get trapped inside of one.", "label": 0}
{"text": "I know right? Some people even pushed to have a popular candidate removed from ballots! \n\nEven worse, one of the leading candidates wasn’t even elected during the primaries. 14 million votes were discarded so that a certain political party could install a candidate without them being elected. Crazy right?", "label": 0}
{"text": "You don’t have to know a person to need to cope with the reality of life and death. People always joke about death and what comes after because it brings levity to a sad topic.", "label": 0}
{"text": "A 19 year old was found dead in a walk in oven. Investigation is still ongoing.", "label": 0}
{"text": "Kids shouldn’t even be on here and they’re old enough to know what Reddit is and lie about their age then they should be old enough to not fucking joke about this?", "label": 0}
{"text": "Woow", "label": 0}
{"text": "Eeww. Let’s name him David.", "label": 0}
{"text": "Aren't Black Panthers leopards?", "label": 0}
{"text": "That's very kind of Trump to promise to pardon all the Antifa currently in prison.", "label": 0}
{"text": "These ovens are only slightly larger than the size of a fridge. Human instinct to survive would already be enough for a person to instinctively press themselves against the door right next to them, which SHOULD open. All signs point to an unknown reason it could not be opened.", "label": 0}
{"text": "No", "label": 0}
