{"text": "My big  disappointment was when I realized I was noticeably taller than Charizard.", "label": 0}
{"text": "Just a coincidence because it's a common cat thing, but that's really cute!", "label": 0}
{"text": "I don't miss people bringing Excadrill to SwSh raids and killing the whole group with Earthquake.", "label": 0}
{"text": "Meowth was actually his own trainer in the battle he fought in for custody of Togepi in the episode where he stole the egg and spent time with it probably ultimately leading to him hatching from the egg", "label": 0}
{"text": "Tbh all of these Pokémon are cool", "label": 0}
{"text": "I haven’t partaken in a single raid since I finished the story DLC. I didn’t find them exciting in game outside of finding Pokémon I might like. SV was cool but didn’t have longevity to me.", "label": 0}
{"text": "This.", "label": 0}
{"text": ">Mewtwo's balls are strong enough to rip Pokémon \n\nhttps://preview.redd.it/a0aan05xsswd1.png?width=640&format=png&auto=webp&s=85d5fa09fc034cab308a2f623ac5ebcb5dcef542", "label": 0}
{"text": "oh thats unfortunate but its good to know so i can keep an eye out for plugin features on other things. eventually us real artists wont have to fear being replaced but it seems like the longer ai gets used without laws in place the more companies seem to be willing to unreasonably integrated everywhere.", "label": 0}
{"text": "You drew these illustrations while being sick? You're very talented!", "label": 0}
{"text": "Weird to see a Typhlosion that isn’t fire type, but a Typhlosion is a Typhlosion so have my upvote lol", "label": 0}
{"text": "You can say this about... Any champion team. It's less about the trainer and more about the Pokemon at that point. \n\nBesides, she'd be more likely to have Dialga or Palkia. Y'know, the legendaries she's actively researching.", "label": 0}
{"text": "The flexibility needed for a kick like in pic one is actually crazy. Nice, dude", "label": 0}
{"text": "They don’t even work well solo…", "label": 0}
{"text": "Wow I wish this was available in game, I’d have a whole team of them 😭 Jumpluff is one of my favorite mons ever and you just made it 10x cooler. thanks for sharing!", "label": 0}
{"text": "Thanks! Im actually a black belt in martial arts now for 4 years so thats why i can usually do stuff like that lol\n\nhttps://preview.redd.it/yoj7us82uswd1.jpeg?width=3024&format=pjpg&auto=webp&s=b601f71de50b124998f6a492236ecbf4c9b9a533", "label": 0}
{"text": "Gonna have to be forced to agree with you, because apparently everyone HAS to have the same experience in any Pokemon game. Don't want to go against the subs hivemind!", "label": 0}
{"text": "Yooooo, okay, that's just epic. You have my respect\n\nhttps://preview.redd.it/mkt71hjbuswd1.jpeg?width=653&format=pjpg&auto=webp&s=c52283cfb4fa51ea0806b4f4bff15cd437db10dd", "label": 0}
{"text": "I don’t think a final form should go past level 50 max, it’s not satisfying to use them in play throughs at all, the first and second forms tend to be garbage until fully evolved and they just become far less fun to use. I love hydreigon but I’m only using it in harder post game or online because you just can’t use it in normal play throughs", "label": 0}
{"text": "I love FR & LG and I can say without a doubt that I've replayed them more than Emerald.", "label": 0}
{"text": "Caraxzard", "label": 0}
{"text": "Thank you for posting to r/pokemon! It looks like this post has not been claimed as Original Content (OC).\n\n- If this is **your own work**, please reply to this comment with `[OC]` or `I made this`. You can also toggle the `oc` flag on your post.\n\nA reminder that \\/r/pokemon requires all creative work to be OC, in order to protect creators. If this is ***not*** **your own work**, please delete your post per [Rule 5](/r/pokemon/wiki/rules#wiki_5._original_content_.28oc.29_only). Thank you!\n\n***\n\n*I am a bot, and may not detect all forms of OC claims. If you've already made it clear that this is your work, please ignore this comment.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pokemon) if you have any questions or concerns.*", "label": 0}
{"text": "I made this.", "label": 0}
{"text": "The shellfish turning into a praying mantis you can see?", "label": 0}
{"text": "I might not be understanding this correctly, but am I supposed to make an Encounter 3 Sandwich for Grass or Ghost and then keep shifting the days forward to get Poltchageist outbreaks? I've tried this and moved forward 2 months and have only gotten one single Poltchageist outbreak and it was Counterfeit.", "label": 0}
{"text": "This is the way… to be the very best, like no one ever was.", "label": 0}
{"text": "sylveon, hitmonchan, mothim, lycanroc dusk, flapple", "label": 0}
{"text": "Ah, gotcha. Thanks for correcting me on that", "label": 0}
{"text": "Hi Positive_Ad9629!\n\nThis post has been removed under [Rule 4](/r/pokemon/wiki/rules#wiki_4._no_reposts_or_posting_too_quickly) because it is one of the following:\n\n- A link post that is very similar to a submission from within the last 6 months\n- A text post that is very similar to a submission from within the last 2 weeks \n- One of the top 50 posts on r/pokemon\n\nThanks for understanding!\n\n\n\n^(Mods are not notified if you reply to this comment. To contact the) ^[r/pokemon](/r/pokemon) ^(mod team, please click) ^[here!](/message/compose/?to=/r/pokemon)", "label": 0}
{"text": "Hi vitjarubinski!\n\nThis post has been removed under [Rule 11](/r/pokemon/wiki/rules#wiki_11._no_advertisement_or_self-promotion.2A). /r/pokemon is not an advertising platform, so we do not allow links to store pages, personal blogs, or social media (including chat servers). We also don't allow for advertisement of events, whether online or in-person. \n\nOur only exception to this is allowing a top-level comment with such links as an accompaniment to original content. You can read up on [our policy](/r/pokemon/wiki/rules#wiki_11._no_advertisement_or_self-promotion.2A) here. Cheers!\n\n\n\n\n^(Mods are not notified if you reply to this comment. To contact the) ^[r/pokemon](/r/pokemon) ^(mod team, please click) ^[here!](/message/compose/?to=/r/pokemon)", "label": 0}
{"text": "We got one in my grocery store and it's always sold out 😭", "label": 0}
{"text": "Gotta have the cases!", "label": 0}
{"text": "Beheeyem, Swalot and Eelektross obviously, but my next two faves are shiinotic and omastar. So there's a top 5!", "label": 0}
{"text": "society as a whole would improve if legendaries were allowed to be Kaiju sized", "label": 0}
{"text": "Yes, but the fact that run out in less than 5 days into a 61 day promotional period means their stock didn't even last 10% of the time.  Which is absurd.", "label": 0}
{"text": "Oh, these look gorgeous. Good job, buddy!", "label": 0}
{"text": "Nailed it!", "label": 0}
{"text": "Lando-T?", "label": 0}
{"text": "ITS PUMPKABOO", "label": 0}
{"text": "It looks great, and will decrease theft, and prevent pre weighing. Unfortunately the one at my mall, is almost a 50% markup on the 10 card packs, and around 20% on boxes.", "label": 0}
{"text": "and how do you use the tm? do you feed the pokemon it?", "label": 0}
{"text": "Decades and yes they do lol", "label": 0}
{"text": "Hello! This post has been removed under [Rule 14](/r/pokemon/wiki/rules#wiki_14._no_illegal_content), which disallows requests for and links to Pokemon content that does not come directly from a legal source.\n\nThis is not a moral stance on the part of r/pokemon mods, but a safety measure for the subreddit to avoid any chance of legal grief. Thanks for understanding!", "label": 0}
{"text": "OOOOHH so that's why when I was 11 I thought it was weird that my Raichu didn't learn any new moves in FireRed 😭", "label": 0}
{"text": "Hello!\n\nWe try to keep r/pokemon family-friendly, in the interest of underage users and a franchise generally geared at children. This post has been deemed too explicit for the subreddit, and has been removed under [Rule 15](/r/pokemon/wiki/rules#wiki_15._no_explicit_or_violent_content). Thanks for understanding!", "label": 0}
{"text": "Thanks for posting to r/pokemon!\n\nThis post has been removed for breaking our [post title guidelines](/r/pokemon/wiki/rules#wiki_9._follow_post_title_guidelines), which disallow all-caps titles, clickbait titles, negative titles designed to elicit pity, and asking for upvotes (this also breaks Reddit's [sitewide policy](https://www.redditinc.com/policies/content-policy)). If this post is in accordance with all other rules, feel free to repost with an appropriate title.\n\nThanks!", "label": 0}
{"text": "It's not entirely unheard of for stock to run out earlier than expected, and the Pokemon Center certainly isn't the first nor the last to experience this. That's also accounting for scalpers/resellers throwing their hats into the ring to scoop up many of which use bots and similar programs/applications/software to automate adding stuff to their carts and checking out.", "label": 0}
{"text": "I believe this is how the remakes used to be. You may not be able to evolve them until the national dex was opened but I know in FR/LG or HG/SS they had the full pokedex.", "label": 0}
{"text": "I love it!!! The Frankenstein one looks sad though 😭", "label": 0}
{"text": "Still have it, don't use it as it only works with lets go :( \n\nkinda dumb it doesnt work with other pokemon games", "label": 0}
{"text": "Gible. Nothing to do with the powerhouse that garchomp is, but because my cat already acts the same way I imagine a cute little landshark would act, and I find gible to be adorable for some reason, cant really put my finger on why though.", "label": 0}
{"text": "One day I’ll make a Lucario themed Mando armor.", "label": 0}
{"text": "The mall near me added one of these but all packs were 2x MSRP the first couple times i passed it so i just started to ignore it. Shit, there was a gamestop 2mins from it idk what they were achieving", "label": 0}
{"text": "feels very stretched", "label": 0}
{"text": "Wow this is dope how did it take you", "label": 0}
{"text": "Thanks mate.", "label": 0}
{"text": "Yeah I know I'm just shocked because I thought these were expensive in my country but it's a lot more in the US", "label": 0}
{"text": "now that's amazing!", "label": 0}
{"text": "Giant Wooloo plush would make this PERFECT!!", "label": 0}
{"text": "Idk, I find many old designs are better than the newer stuff. A lot of the newer mons (in my opinion) are waaaay overdesigned", "label": 0}
{"text": "Is there really a reason to run fire types that aren't cyndaquil in G/S/C or SS/HG?\n\nI love fire types but they're just kind of dead weight past the early game in Johto.\n\nIMO both gen 2 and 4 shpuld be criticized for msking fire types largely inviable but its for fully different reasons\n\nG2 Typhlosian and G4 Infernape might share a common bond of being tbe only viable fire types of there gens but the fire type itself is leagues more viable in G4 than it was in G2.  Which shows up via the best G2 fire (Typholsian) being UU in a more limited pool while Infernape was OU in G4 witj a more extensive pokedex", "label": 0}
{"text": "Please be my husband!", "label": 0}
{"text": "That's a good one lol, but I'm not afraid of a pair of dragons balls~ 🤤", "label": 0}
{"text": "I sometimes forget that card people are playing the hunger games out there", "label": 0}
{"text": "I use it for pokemon go all the time!", "label": 0}
{"text": "Hitmonchan, mothim, midnight, hydrapple.", "label": 0}
{"text": "I wrap rubber bands around a key that holds the button down so that I can spin stops in Pokémon Go. 😆", "label": 0}
{"text": "still better than trash bag/key chain/petal bracelet", "label": 0}
{"text": "It never really occured to me just how big the water shurikens we're until I saw this", "label": 0}
{"text": "Don't you dare talk shit about Klefki", "label": 0}
{"text": "oh this is an old thing from back in the 90's. but yeah the foil makes the packs weigh heavier juat enough thar if you got a scale that could see like .0001 grams you could tell which ones had ultra rates in them.", "label": 0}
{"text": "There’s also the “Cubones grow up to be Kangaskhan if their mother doesn’t die” one which I like more than any of these", "label": 0}
{"text": "Quaxly accepted his fate\n\nhttps://preview.redd.it/na9hksynfywd1.png?width=1080&format=pjpg&auto=webp&s=1729e46b2888f792004ac2baec6e8ef10162bc4b", "label": 0}
{"text": "Yes, the OG Sugimori Artwork are so nostalgic. I love the art style.", "label": 0}
{"text": "The included promotion items (when an applicable promotion is available) are shown when viewing the cart at the confirmation step prior to finalizing payment as it gets added to the cart (either listed as  free or at a $0.00 price tag). It not being there would be a clear indication that the promotion items were not applied. Failure to notice it at that step isn't on the vendor.\n\n\nIn regards to the supply of the promotional item, that's how logistics work especially in regards to physical items. They can, and will, run out eventually. How fast they run out would depend on how much stock is initially available and the demand for the product. If a product is (un) surprisingly popular, it runs out faster than a less popular item.\n\n\nThat particular item being holiday gift boxes, which come in a Ditto or Eevee variant with the Ditto having different patterns depending on the size. The gift box you get is random, so with a fan favorite like Eevee being offered up you can bet that people would gamble a few multiple instances trying to snag it, or scalpers/resellers wanting to scoop to bank on the Pokemon's popularity. The Ditto while not as popular coming in several different designs would still see some hits especially as they're essentially limited edition holiday products.", "label": 0}
{"text": "This is absolutely brilliant", "label": 0}
{"text": "Wow thats really well done! Nice!!", "label": 0}
{"text": "Again, headcannon, but I feel like the separate shell from the GS beta was one that fell off a Slowpoke and remained changed permanently. At that point it would just be a Bro.", "label": 0}
{"text": "Wait… what do you mean?!", "label": 0}
{"text": "I still have a plushie I bought from those machines years ago. I wish they were still around 😞", "label": 0}
{"text": "That is awesome! It looks amazing! If you can make others, I would love to see it.", "label": 0}
{"text": "if you saw this stranger in person, is that what you'd say to his face when he tells you about his halloween costume? no? then don't do it online either", "label": 0}
{"text": "These vending machines are a game-changer. It’s like bringing the thrill of a pack opening right to the grocery aisle. Makes you wonder how long until we see them everywhere, transforming casual shopping into a mini Pokémon adventure.", "label": 0}
{"text": "lol with all the deleted comments i thought this was about pack weighing and was confused as 😅", "label": 0}
{"text": "Upgrades ppl, upgrades", "label": 0}
{"text": "Still so surprised they haven’t ever made the slowbro slowking shellders their own individual forms now. Been one of my biggest peeves with the series for the longest time, it just doesn’t make sense why they only ever make an appearance on slowpoke’s evolutions", "label": 0}
{"text": "> doesn't it auto-turn them into caps when you save them? If not, does it keep the letters super-big, like you can only have 8-10 character deck names?\n\nidk if I've just not noticed but I don't think it converts them from lower to upper-case, but the length of deck names is MUCH shorter than it was in the first game, yeah\n\nI feel kinda silly not noticing the thematic names. You did a good job with that too!", "label": 0}
{"text": "If you just want the strongest Pokemon then sure", "label": 0}
{"text": "reselling weighed packs you suspect suck is just shitty too", "label": 0}
{"text": "Exactly what I was thinking. Like I'm not seeing a correlation whatsoever for a fair chunk of these", "label": 0}
{"text": "Absolutely love the detail on this", "label": 0}
{"text": "BDSP is as close as you're going to get. Pokemon has been 3D ever since XY.", "label": 0}
{"text": "My favorite Pokémon is Beedrill.\n\nhttps://preview.redd.it/mb24lzhiiywd1.png?width=1080&format=pjpg&auto=webp&s=65482cc4a5999152e0014a0222c02d85ded0254c", "label": 0}
{"text": "In this certain context with the exact thing i said? Totally, yes.", "label": 0}
{"text": "I wrapped a rubberized wire around it from Home Depot and use it for Pokémon GO and it automatically stops and catches things for me", "label": 0}
{"text": "Thank you !", "label": 0}
{"text": "Thank you so much !", "label": 0}
{"text": "So jealous haha", "label": 0}
{"text": "It probably doesn't look as good without Milo's hair but you still rock it", "label": 0}
{"text": "There are some at the krogers here in northern GA", "label": 0}
{"text": "I wasn't being sarcastic about the \"peak design\" bit. If you ask me to pick 5 favourite pokemon of each type, about 80% of them would be from Gens 1-4 and the remaining 20% from Gens 5-9.\n\nIncidentally, I did a similar exercise a few days ago, and I struggled trying not to stack the chart with Gen 1 Pokemon (1/3 were from Gen 1). For example, I really like Manectric and Staraptor (in large part due to their moves and abilities), but I'd be lying if I said Pokemon like Jolteon and Pidgeot didn't have to give up their positions just so I didn't come off as a genwunner.\n\nhttps://preview.redd.it/5889bxe7jywd1.jpeg?width=1021&format=pjpg&auto=webp&s=cc83cdf9d638aee9495d039af9a76b9dd303f228", "label": 0}
{"text": "Lol love that", "label": 0}
{"text": "Trust me, [so do I](https://www.reddit.com/r/pokemon/s/Us6it38sNK).", "label": 0}
{"text": "The solution was just including a foil card in every pack. Cards of all rarities can be foiled in MTG, so that would be the fix.", "label": 0}
{"text": "Good news and bad news", "label": 0}
{"text": "And with the custom cases for the Game Boy series of games as well!  I went on a small splurge myself earlier this year and got Emerald, White, Black 2, Moon, and Ultra Sun, as well as those same cases you have for Blue, Yellow, Gold, Silver, Emerald, and FireRed.  I think I may have just as excited for the cases as I was for the games themselves.  Now to find the time to play these all someday, haha.  \n\nCongrats on your collection!", "label": 0}
{"text": "I think it's just that Cubone was created breeding was a thing, so the idea that you'd actually own its mother wasn't even a consideration. It's original name was even going to be Orphon,", "label": 0}
{"text": "Golurk, specifically Shiny Golurk", "label": 0}
{"text": "https://preview.redd.it/dme4q4svlywd1.png?width=1080&format=pjpg&auto=webp&s=af9e98c646f6f06a95c29c2a8e42122c56135321\n\nIt doesn't hold a charge anymore but it's the perfect olive for my Dratini Martini", "label": 0}
{"text": "Don’t all packs have foil cards now though? I remember the OG series being a 1/3 chance for a foil.", "label": 0}
{"text": "Nice pulls at least", "label": 0}
{"text": "Aaah I need that Maushold tin!! Is it Paldean Fates? It's my favorite series but it's becoming harder to find around me, I want the Gardevoir cards so bad", "label": 0}
{"text": "'Tism", "label": 0}
{"text": "There you go even more minute.", "label": 0}
{"text": "For the intimated ones is more that since their death doesn't give you a penalty toward the timer, them dying again and again end up benefit you more since it keeps triggering intimate, so you're safer in setting up to kill the boss. \n\nSo the lack of penalty is the real benefit at the end, though you also always end up with a defense cheer at the start of the raid, something an actual player doesn't usually do.", "label": 0}
{"text": "I love the dancing duck!", "label": 0}
{"text": "Pictures of what you pulled?", "label": 0}
{"text": "All are best.", "label": 0}
{"text": "I love him.", "label": 0}
{"text": "**centigrams or milligrams", "label": 0}
{"text": "you would tell a stranger they make you hard when they show you their outfit?", "label": 0}
{"text": "Wimp Out and Emergency exit is a deliberate joke though.", "label": 0}
{"text": "One mankey was hard to handle in the anime", "label": 0}
{"text": "Oshawott", "label": 0}
{"text": "As I said, in this certain context with the exact same words, yes. Because everybody would understand, that this is a topic related joke and expresses nothing else than admiration for how awesome this costume looks.", "label": 0}
{"text": "I’m predictable, mine is Incineroar. :D", "label": 0}
{"text": "I love this", "label": 0}
{"text": "Good upgrade", "label": 0}
{"text": "you're probably pretty good at VGC then.", "label": 0}
{"text": "I can understand it as a joke, but don't you think it's the wrong type of joke to direct at someone who doesn't know you? It could make someone very uncomfortable", "label": 0}
{"text": "So you are saying Sharp Knuckles, Feral Wings and Pointed Spiral are 1st gen paradoxes??", "label": 0}
{"text": "Jesus lol I just bought black 2 for 60€", "label": 0}
{"text": "I never heard that one before", "label": 0}
{"text": "Klefki saved my family from the war, I won’t take this klefki slander", "label": 0}
{"text": "Crobat 💜", "label": 0}
{"text": "Must be nice", "label": 0}
{"text": "what a shit take  \nin japan folklore inanimate objects gain a soul if they sit around for long enough  \nthats why these designs are actually top tier, as opposed to gen 1 where its like a ball (voltorb line) or a magnet and now theres three of them.", "label": 0}
{"text": "I wasn't trying to \"feel like a saint\", I was trying to speak up in case your comment made OP uncomfortable. it's easy for all of us to forget that our behaviour online has the same consequences as real life to the person on the receiving end. this is something I had to learn myself", "label": 0}
{"text": "I purchased ultra sun when it came out november 17. and beat the game. came back to get poipole timid before I restart but got shiny poipole + 1attack iv over 30+ reset, oct 22 2024", "label": 0}
{"text": "It's a great controller for the Let's Go games and my preference when I play Pikachu now and then. Bit I abandoned it for use in PoGo, my storage spaces are getting too close to full for it to be auto catching and spinning disks all day", "label": 0}
{"text": "One of these recently showed up at a local store near me too. Thought it was going to have stuff from the poke center website.", "label": 0}
{"text": "Damn old head", "label": 0}
{"text": "Good job", "label": 0}
{"text": "This is fantastic! You should submit this to Lego Ideas!", "label": 0}
{"text": "your poses look sick af!", "label": 0}
{"text": "Can you do a Lego tutorial? I’d love to have that in my room dude", "label": 0}
{"text": "I'm sorry, you can weigh packs?", "label": 0}
{"text": "Which is ironic because those are the ORIGINAL poodle breed. They're even called \"Standard\" (15 or more inches at the shoulder). The smaller sizes, Miniature (over 10 inches but under 15) and Toy (up to 10 inches), were bred later.", "label": 0}
{"text": "Rapidash is the easiest fully-evolved fire type that isn't a starter to obtain, and thankfully it doesn't need the most grinding, which can't be said about many Johto encounters\n\nArcanine/Ninetales and Flareon need a fire stone, which is either stupidly annoying to obtain or relegated to way too late in the game in Kanto\n\nGood luck getting the magmarizer to obtain Magmortar\n\nMagcargo is obtainable really late in the game to the point that it's not worth using\n\nIn gen 4's defense, Platinum made viable fire types obtainable and usable way earlier. Can't say the same for any Johto title", "label": 0}
{"text": "If the item is available, it would automatically be added to the cart. If its not available, it doesn't get added. It doesn't get any simpler than that. You can keep moving the goal posts but the end result would still be the same.\n\n\nI work in retail, so situations like this is quite common. As a real world example we'll use a Target in-store Starbucks. Their system doesn't let them order certain products. One of which is the pumpkin creme muffin. That's on auto shipment and even then it's based off of projected demand that corporate or the district manager or whomever decides is enough for that particular location to sell and should last them the expected duration between auto shipments.\n\n\nExcept it doesn't because actual demand is different from estimated ones. This is a similar case to that. Some higher up at Pokemon Center projected X amount of demand, got unexpected Y amount of demand that their Z actual stock doesn't last. Also factoring in the fact that an actual restock wouldn't happen in a timely manner (or if it did, would clip the end of the duration of the promotion) it's unreasonable to solely blame one party for 100% of the fault. A good chunk if not a majority sure, but the consumer has their own fair share of the blame because they themselves are the primary contributing factor to demand.", "label": 0}
{"text": "Amber is actually between orange and yellow, not orange and red. Reddish orange would actually be vermilion.", "label": 0}
{"text": "Plus? B/W has the *smallest* regional dex since Sinnoh. As a result? Six is a much bigger percentage over the \"small\" regional dexes of even Sw/Sh. \n\nNot only that but the Unova dex suffers the opposite problem of Kanto: Too little water types.", "label": 0}
{"text": "Was gonna say. Our local Fred Meyer has had one for at least a few months already.", "label": 0}
{"text": "The animated series has way better proportions. I feel like for the pokedex they just threw some random numbers at it and called it a day.", "label": 0}
{"text": "What are your underloved favorite mons?\n\nhttps://preview.redd.it/byvzulblqywd1.png?width=475&format=png&auto=webp&s=ae8c332e8ba9230a6c4a210fe28a2c7edaf55728\n\nParas is another favorite of mine that doesn't get as much glamor, but Masquerain is serviced far, far worse: barely existing in any of the games despite its charming look and useful learnset.\n\nI name mine Aoitan after a run of cards in my favorite classic card game. And look at that face! What an Aoitan.\n\nIt has the advantages of a bug learnset (quiver dance my beloved!), plus a decent water learnset from its surskit origins. It has an honorary place in my Showdown team as scald on wings! Its stat spread is pretty one-note, and favoring special defence doesn't help against rock moves, but its speed isn't terrible by any metric.", "label": 0}
{"text": "They also have one at a Safeway in Vancouver, WA as well. I was there the other day with my coworkers", "label": 0}
{"text": "Type: Null", "label": 0}
{"text": "“He was struck by an onix” \n#AND LIVED!?", "label": 0}
{"text": "Only one person here has brought up my favorite’s evo line at the time of writing, my favorite pokemon of all time would be Cherubi. I loved it as a kid and i came back around to loving it as an adult. #1 grass type for me", "label": 0}
{"text": "Definitely", "label": 0}
{"text": "I just want to say I love the gen 1 sprites", "label": 0}
{"text": "Getting a Geodude is great. Rock Pokémon are good vs flying and bug", "label": 0}
{"text": "Lucario", "label": 0}
{"text": ">I feel like keeping things simple is also important\n\nOr they could just add mechanical differences to keep them distinct. Would be a better solution than just homogenizing everything.", "label": 0}
{"text": "You can’t weigh modern packs", "label": 0}
{"text": "Ah, looked into it some more and I think I get it now. They were both right, basically. It sounds like Ultra Megalopolis had their own light originally, but when they discovered Necrozma they wanted to imprison it to harness its power. It retaliated by eating all of their light, but ultimately lost and was imprisoned in Megalo tower, which had to be built to provide light artificially now that it was all gone.\n\nThat's really neat, I never realized Necrozma wasn't the aggressor in the situation leading to its imprisonment.", "label": 0}
{"text": "Latias", "label": 0}
{"text": "love it! but my immediate thought was that the eyes are in an unfortunate spot lol and i know its in a similar spot for mimikyu", "label": 0}
{"text": "That would have way more impact on the game than renaming abilities that are already identical.", "label": 0}
{"text": "Actual intrusive thoughts or impulsive thoughts?", "label": 0}
{"text": "https://preview.redd.it/btycycmnuywd1.png?width=96&format=pjpg&auto=webp&s=f7e1498dd1a4e46efac5a94ca9abb93c311d2fc3\n\nBest electric-type. Best Eeveelution. Best Pokémon.", "label": 0}
{"text": "Yes all of these options outside of cyndaquil and growlithe suck ass wtp here", "label": 0}
{"text": "I have actually been lucky in finding several left packs in these. People who buy multiple packs seem to often leave the last behind", "label": 0}
{"text": "and that is a bad thing because?", "label": 0}
{"text": "Never been a big fan of ghost types, but that thing's pretty darn cool.", "label": 0}
{"text": "Magikarp* \n\nWhy are we acting like Charizard is their baby...? Magikarp is.", "label": 0}
{"text": "I still cant believe weighing packs is a thing", "label": 0}
{"text": "Nope. At least on Kabutops and Omastar, I don't think there is any impression meant to be drawn that they're in any way related to Scyther, Slowbro, or Cloyster. There's more of an argument to be made with Aerodactyl and Charizard as they're both non-Dragon 'dragons' with horns. But these were all designed in the 90's. There's spikes and sharp things on like half of the Pokemon.\n\nRhydon isn't implied to be related to the Nidos, yet there's more in common there than with most of these examples. Same with the Butterfree/Venomoth swap, or the Gyarados/Dragonite swap.", "label": 0}
{"text": "Go with Emerald or black2white2", "label": 0}
{"text": "Also Voltorb and Electrode look more like balls(They are literally the ball Pokemon)", "label": 0}
{"text": "Pumpkaboo, but it mimicked gardivior.", "label": 0}
{"text": "I would love the instructions to this 3 years ago. This is SO good.", "label": 0}
{"text": "As someone who grew up with pokemon. I think these are really cool. I have not bought anything from then. But would prefer these over a red box any day.", "label": 0}
{"text": "Did you ever do it?", "label": 0}
{"text": "OP is the Charles Darwin of the Pokémon world", "label": 0}
{"text": "The top 3 are BW2, Platinum and Emerald. Honorable mentions to ORAS which has some of the best Pokemon mechanics in the franchise, and USUM with great fanservice", "label": 0}
{"text": "I hate the advice of \"touch grass and get help\", but this sure seems like a time for that advice.\n\nI don't know your past experiences, nor how your mental health is doing in your day to day life. However if you find it hard to normally play Pokémon(you said impulsive so I'm guessing you throw your controller or something? Or did you mean intrusive?), maybe you should take a break for a while from either the games, those bad spaces that give you those impulses, or both?\n\nMental health has its ups and downs, don't worry if you feel like \"the odd one out\", you're never alone. \nDo you only have this when playing Pokémon games?\nTake a break for a while and try to find something to heal you, maybe talk to a professional if you have the funds.\n\nCome back to the games when you're in a better headspace, it'll make it more fun as well!", "label": 0}
{"text": "Came here to say this. I like other combinations just as much in concept, but grass/ghost has been a cool concept AND very awesome pokemon designs in actuality as well", "label": 0}
{"text": "Girafarig 🦒🦒", "label": 0}
{"text": "None but my team would be weird AF too:\n- Metagross\n- Heliolisk\n- Gengar\n- Noivern\n- Ivysaur\n- Tepig\n\nCurrently doing a run of Pokemon Y with this team and it’s surprisingly solid. Except for Tepig that is, he’s just there for emotional support!", "label": 0}
{"text": "There’s a Zangoose on the loose", "label": 0}
{"text": "primarina :3", "label": 0}
{"text": "Thats a super easy team to play a majority of the games with too!", "label": 0}
{"text": "I like grass/ghost, but I'm a bit sad I don't see normal/fairy here. It's such a funny combo and I hope they make more of this combo, instead of most being alterations to previously normal only pokemon.", "label": 0}
{"text": "Sadly, that would require GameFreak to rotate out few of their babies. \n\nCharizard? I'm talking about Magikarp, Slowpoke, and Gengar! They always try to find some way to work them in.", "label": 0}
{"text": "for me jolt is pretty closely tied with umbreon for being the best -eon.", "label": 0}
{"text": "Cool finally getting something that's been in Japan for years", "label": 0}
{"text": "https://preview.redd.it/3ype5ovcxywd1.jpeg?width=1080&format=pjpg&auto=webp&s=cbab032655c61bae23f2f6bc61c2568f094d7f8b\n\nBanette for sure. I love it so much.", "label": 0}
{"text": "This looks great completely original, throwing officer Jenny in there and your views will go through the roof. LMFAO", "label": 0}
{"text": "https://preview.redd.it/l7mbnw2rxywd1.png?width=946&format=png&auto=webp&s=c87bea7b1674c4e57b7b0354ecce81ce5e50eebb\n\nIt’s steelix obliviously", "label": 0}
{"text": "Where did I say it's a bad thing?", "label": 0}
{"text": "And it's a team made during a time when the boundaries of pokemon and mankind wasn't really defined. ", "label": 0}
{"text": "Haunter I have to fight the urge to use it on my team every time I do a Gen 1 (or it's remakes) run", "label": 0}
{"text": "> While it's true that this can add flavor, I feel like keeping things simple is also important", "label": 0}
{"text": ">While it's true that this can add flavor, I feel like keeping things simple is also important", "label": 0}
{"text": "Some of them also have limits on how many you can buy :)", "label": 0}
{"text": "https://preview.redd.it/z9v7otb7yywd1.jpeg?width=189&format=pjpg&auto=webp&s=275d36fa9dd221c7db87c5f0e978bc97d40be7f3\n\nHe approaches…", "label": 0}
{"text": "Omg Pidgey's cry was so cute", "label": 0}
{"text": "Sonic!", "label": 0}
{"text": "I was going to say this looks like a Freddie's and all locations just got rid of the red boxes. I think Kroger has a deal with The Pokemon Company because the store I work at has 2 separate machines at opposite entrances and there is someone checking the machine at least twice a day.", "label": 0}
{"text": "Absolutely stunning!", "label": 0}
{"text": "People harp on Magnemite and Voltorb, but those are great designs imo.\n\nThe actual bad ones from Gen1 imo are the Seal and Goldeen lines. They're just uninspired.", "label": 0}
{"text": "that’s a pumpkin", "label": 0}
{"text": "Absol 100%. Mega or not, just absol.\n\nhttps://preview.redd.it/n0t9mwbuyywd1.jpeg?width=763&format=pjpg&auto=webp&s=827621c7e3dce4ba001490a60b57e368c3038946", "label": 0}
{"text": "Same here but on a GBA SP", "label": 0}
{"text": "The Pokémon version Rothenburg ob der Tauber would also be great with it’s fairy-tale like aesthetic. It would be this game’s equivalent to Ecruteak city, maybe a place where you fight a legendary or mythical Pokémon.", "label": 0}
{"text": "Not really, as these are put in place by individuals and not the the store so the packs etc could stick be weighed before hand, plus damage to cards can be higher as the coil and dropping them to you can damage a card and if a card could of been a 10 and now due to the machine drops to an 8 due to da.age you'd be pissed.  The shops near me simply put booster behind or at tills, and you request them at purchase means no stealling. Weighting isn't possible and less likely for another damage done to them.", "label": 0}
{"text": "The correct choice", "label": 0}
{"text": "Haunter or Mega Banette", "label": 0}
{"text": "Nah, it’s not just you. Like you, I’ve inadvertently seen uncomfortable things and because my mind is very referential, I end up thinking about that stuff when I see/hear something similar. What I’ve been trying is to “replace” those thoughts with similar but better ones through repetition. It doesn’t always work, but it does help.", "label": 0}
{"text": "Chandelure or golurk", "label": 0}
{"text": "Aegislash", "label": 0}
{"text": "Ahhh so that's what it's name was supposed to sound like! Concept makes more sense now.", "label": 0}
{"text": "None. I always wanted to see them succeed. Also I really enjoyed the episodes at the beginning of Black & White where they were actually being competent instead of chasing Pikachu. Too bad that arc was never completed.", "label": 0}
{"text": "At least Seel and Dewgong are cute. Meanwhile Goldeen and Seaking are both, boring and weak. Not a single redeeming quality. \n\nThat said, I still think there is hope for Goldeen line. Game Freak can patch them anytime now by giving them a cool 3rd stage, perhaps one based on a mermaid or something.", "label": 0}
{"text": "Usually don’t buy stuffed animals but would totally pick up a ghastly if possible", "label": 0}
{"text": "Things like this are why I loved gen 1. Although, I was young and only noticed the Scyther line", "label": 0}
{"text": "I saw the life-size Mareep ones, if only they made a Wooloo version too lol", "label": 0}
{"text": "\n\nGen 5 had the most complex designs, gen 4 probably second.  But then gen 6 dialed things back, designs are more similar to pre gen 4, but they kept the legendaries more complex \n\nI do prefer gens 1-2 over most other.", "label": 0}
{"text": "It's probably an emulator.", "label": 0}
{"text": "https://preview.redd.it/w9euoy222zwd1.png?width=320&format=png&auto=webp&s=f733f48eeb5b8323e41bad9422c6f69eaf52f64a\n\noh sorry wrong sub", "label": 0}
{"text": "https://preview.redd.it/miuoctd72zwd1.jpeg?width=792&format=pjpg&auto=webp&s=cdac9885a97a38b65b4979e4f978fc985859d3e7\n\nThis is one of the creepier ones that come to mind", "label": 0}
{"text": "yes  thats his name now", "label": 0}
{"text": "of you send them to nintendo you'll never see your original joy con's again.", "label": 0}
{"text": "i made this", "label": 0}
{"text": "Trevenant for me. Loved the design so much I used a Harvest/Sitrus Berry set on one back in X/Y competitive. Really ought to get around to shiny hunting one some day.", "label": 0}
{"text": "Rayquaza, my best friend has one tattooed on his leg and that's what our first conversation was about", "label": 0}
{"text": "This was the ideia.", "label": 0}
{"text": "Blaze is my personal favorite.", "label": 0}
{"text": "A three-way tie between Giratina, Mimikyu and Banette.", "label": 0}
{"text": "Snorlax. They look like they give great hugs and they would be perfect nap buddies", "label": 0}
{"text": "kum", "label": 0}
{"text": "It does because now you have used joy cons that you have no clue where they have been and if you send in existed joy con's then have fun never having those again unless you buy another exclusive switch.", "label": 0}
{"text": "Dragapult! Such a badass draconic ghost with a sick design and yet has some cute factors like the Dreepys, and it' just such an AAAH YES design in general.", "label": 0}
{"text": "😏", "label": 0}
{"text": "Ghost is my favourite type, with many of my favourite pokemon being ghost type. Other than Mawile, my overall favourite pokemon is Mismagius. Next would probably be Hisuian Typhlosion, so ghost type does very well for me.\n\nI’d also like to mention banette, Litwick, and aegilsash.\n\nGhost is a type that makes me think of cool and scary pokemon, but I think cute ones work amazingly. He already mentioned Litwick, but pumpkaboo and phantump are both really cute ghost type pokemon\n\nOff the top of my head, I can’t think of a single ghost type that a dislike", "label": 0}
{"text": "Kabutops is based on horseshoe crabs, which are arthropods. They are more closely related to spiders than any shellfish. Also the shellfish you are thinking of do share a common ancestor with insects.", "label": 0}
{"text": "Terrifying i love this", "label": 0}
{"text": "existed joy cons?   \nthe broken joy-cons were used anyway, whatever joy-con you send them, they send the same kind back, personally I got my same joy con back and not just a replacement anyway.\n\nif you'd rather just keep a broken joy con, then good for you.", "label": 0}
{"text": "Probably ", "label": 0}
{"text": "We have one of these in our local mall it’s super awesome", "label": 0}
{"text": "Promotional items being auto applied in cart isn't some magical new concept, it's been around for a significant amount of time not just on the Pokemon Center website. If there's anything to be offended about it's hiding the \"while supplies last\" bit as small text either under the promotional banner or at the very bottom of the screen with other disclaimers, as this makes it easier to miss.", "label": 0}
{"text": "As long as you keep copies of your saves and save states, then sure. Just remember to keep track.\n\nWhen you're done with one save, get the pokemon out of that save and replace it with one of the alternate saves you have to get everything you want.", "label": 0}
{"text": "He's a nice guy really. Once he gets to know you.", "label": 0}
{"text": "Neat. Thanks. My lab scales dont even gi to .0001 grams though, thats wild", "label": 0}
{"text": "Creepy that little guy is cute af.", "label": 0}
{"text": "There’s a bunch of these in Washington state, USA. I scroll through what’s available occasionally", "label": 0}
{"text": "I can't find Entei for the first time, I've been trying for an hour and nothing :(", "label": 0}
{"text": "You and Milo have the exact same silhouette. Your Milo cosplay will be top tier.", "label": 0}
{"text": "Oh god, it's probably Ogerpon I love it's lore and look at this baby \n*", "label": 0}
{"text": "Hello. On Bulbapedia, it says that when a pokemon evolves, it becomes a new species. Can someone show me where they got this information. A quote of dialouge from a piece of Pokemon media, a statement from an official source, or anything similar would be useful.\n\n  \nLink: [https://bulbapedia.bulbagarden.net/wiki/Evolution](https://bulbapedia.bulbagarden.net/wiki/Evolution)", "label": 0}
{"text": "autocorrect. exclusive", "label": 0}
{"text": "In shield I have my trusty Umbreon named shadoe, my sociable noivern named Fanta, and my chandelure named fh", "label": 0}
{"text": "*Thousandth\n\n.001 is a thousandth", "label": 0}
{"text": "it's guadivour", "label": 0}
{"text": "Definitely that one Ghost/Rock line! Oh wait...\n\nI guess Decidueye.", "label": 0}
{"text": "Yeah they one near Gladstone has had one for at least a year. I remember seeing these in a Seattle mall a few years back even.", "label": 0}
{"text": "I fuck with it 😍", "label": 0}
{"text": "Chimpokomon", "label": 0}
{"text": "😆 I zoomed in too far when I was looking at the picture and the left side was cut off!! 👍🏼👍🏼", "label": 0}
{"text": "I also mostly use fire as an offensive type rather than a defensive one, so I looked what else is super effective against what fire is super effective against; the only types that cover multiple are flying, fighting, and rock.", "label": 0}
{"text": "Can we appreciate omastars sprite for a sec? Bro is busting it down", "label": 0}
{"text": "The irony being Pokémon, YGO, MTG, ie the majority of card games, are played by adults.", "label": 0}
{"text": "Awesome", "label": 0}
{"text": "My tesco’s puts them in unwieldy and cumbersome plastic boxes with a magnetic latch", "label": 0}
{"text": "Flareon", "label": 0}
{"text": "Hellooooo prepaid visas", "label": 0}
{"text": "Mine is hanging from the rear view mirror of my car.", "label": 0}
{"text": "Pokemon Food Chain?", "label": 0}
{"text": "The dictionary defines species as \"a class of things of the same kind with the same name.\"\n\nSince a pokemon's name changes when it evolves, it can be said to become a new species", "label": 0}
{"text": "So you want Pikachu to stay captured?\n\nhttps://preview.redd.it/3npz84ez6zwd1.jpeg?width=503&format=pjpg&auto=webp&s=e87691c8300b94966306fd072c7aace1557847b7", "label": 0}
{"text": "zoroark !", "label": 0}
{"text": "Naw, come on, I'm sure Giovanni and Team Rocket have great uses for the strongest Pikachu on the planet.", "label": 0}
{"text": "Cuz they don't hold much, so people buy them out, weigh everything, then sell the no-gos for standard retail on Amazon or Ebay", "label": 0}
{"text": "I would be so broke", "label": 0}
{"text": "You can weigh anything heavier than air.", "label": 0}
{"text": "Yeah, happy with them!", "label": 0}
{"text": "Will send in the morning! You opened any recently yourself?", "label": 0}
{"text": "One thing that might help is to treat intrusive thoughts for what they are: simply 'thoughts,' not a real threat. If a specific thought frightens you and you try to reject it, it may become more intense because you give it importance. Accepting the thought, recognizing it as such, and ignoring it could help reduce its intensity over time. I'm not an expert, but this is a strategy I have found useful", "label": 0}
{"text": "Probably bulbasaur, spinarak, and tauros in no particular order. Growlithe is up there too.", "label": 0}
{"text": "One of these popped up in a Vons near my house (San Diego) a couple weeks ago, but wasn't working", "label": 0}
{"text": "This would be great to help the efficiency of my card shop", "label": 0}
{"text": "Luckyyyy I had to pay $150 each for my copies. :(", "label": 0}
{"text": "Probably Altaria or Ampharos\n\nI always look to both of them and starts thinking \"they are just like me\". If I was a pokemon, I would totally be one of this two", "label": 0}
{"text": "As you said, it doesn't explain how accessible it needs to be which gives them a wide amount of wiggle room especially in regards to how if the cart doesn't apply for the promotion then the promotion simply does not activate. It's a kick in the balls yes, but it scrapes by with that loophole if you would consider it as such.\n\n\nMay as well try for a refund/file a chargeback and then ping them over to the relevant authorities for their promotional stuff at that point if some gift bags mean that much to you.", "label": 0}
{"text": "Okay. I suppose he'll still be moving around. Plus, if Team Rocket did succeed early in the series, Pikachu may have become a footnote and Charizard would be the Pokémon mascot. That would actually be cooler cos much as I like Pikachu, he looks and sounds too much like a baby to be the mascot", "label": 0}
{"text": "Pumpkaboo \n\nWith special love for banette, litwick, mimikyu and giratina. I don’t think there is a ghost type Pokémon I dislike ", "label": 0}
{"text": "Thanks.", "label": 0}
{"text": "So would this be calls “mimizor”?", "label": 0}
{"text": "Haunter", "label": 0}
{"text": "We got a ton of these in the Fry's aka Kroger in AZ almost every store by me has one", "label": 0}
{"text": "Sounds cool!", "label": 0}
{"text": "Literally afraid of Pokémon for almost half her season? \n\nI'd say it was more of an apathy/aversion than fear. And she got over that \"fear\" rather quickly once she learned about Pokémon Contests in episode 13.", "label": 0}
{"text": "Do you think Charizard is more mascot worthy? If so, why?", "label": 0}
{"text": "Chandelure especially the shiny version", "label": 0}
{"text": "Ghost is one of my favorite types and I used to go back and forth on a favorite all the time but I can now 100% confidently say that my favorite is Drifblim. It's just the right combination of spooky, silly, adorable and elegant. Also its in-game cry makes me happy every time I hear it (same with Drifloon).", "label": 0}
{"text": "The praying mantis gaining rock armor, yes.", "label": 0}
{"text": "These have been in Krogers for years.", "label": 0}
{"text": "Definitely Cofagrigus. It always ends up on my team in B/W.", "label": 0}
{"text": "So damn cool", "label": 0}
{"text": "I've played pokemon sknce blue version, my first own videogame, since were 4 siblings at the time, later 6.\n\n\nWhen GS came out i dont know which was my fave pokemon at first, i wanted to try the new evos. Being 7 at the time, i didn't know how the mechanics worked (hell, i'm 32 and still struggle with EV theory), even less so in a foreign language.\n\n\n\nSince i had no link cable to tradw my friends (irl friends, not my pokes), it was very hard to get a scizor. I heard that Eevee gained new evos but didn't understand how to get them, but it was interesting.\n\n\nEevee, of course, was a prime candidate to test, however i couldnt find one, and i had no prior knowledge of the dex, so i was amazed beyond words when my Golbat evolved into Crobat, what the damn was happening?\n\n\nSo i got another Golbat to the same level the previous one evolved and nothing happened. I asked around and my older brother read about friendship evolution. I was moved beyond words, i read it as it was meant to, Crobat thought of me as a friend SO MUCH that it reached a new stage just because we are a team.\n\n\nCrobat, ever since, has been my favorite pokemon and even though i have other favorites, he's my Ace anywhere i can play him. Gotta say, a VIOLET pokemon really should have appeared in the latest VIOLET version, but well, i can only hope my Crobat will return next gen.", "label": 0}
{"text": "Gourgeist or Mismagius ", "label": 0}
{"text": "They could turn him in, get promoted, and ash could rescue him from the HQ.\n\nThen Jessie and James could go on to make billions making mechs", "label": 0}
{"text": "Bro u literally made it, whyyy 😭", "label": 0}
{"text": "Very cool.", "label": 0}
{"text": "I received the helpful member flair as recognition for being active in the QA thread. That being said, I understand that it sucks getting the short end of the stick when it comes to items purchased with your own money. I've been there several times.\n\n\nTo go back to the crux of the issue, it's not Pokemon Center's (the vendor's) fault, but whomever approved the allocation of the boxes further up in the supply chain as that's the upper limit to the supply that is available to be given to the consumer.", "label": 0}
{"text": "I'm currently play gen 5 with a emulator on my phone so this is cool", "label": 0}
{"text": "Cute! Gonna go pink? ", "label": 0}
{"text": "Drifloon NUMBER 1 ‼️‼️", "label": 0}
{"text": "Kabutops is literally the shellfish pokemon in the pokedex", "label": 0}
{"text": "Oh yeah this one is really annoying too", "label": 0}
{"text": "There are none. Havent been any since the Black/White 2", "label": 0}
{"text": "Absolutely, that's one issue I had in mind.\n\nBut if you say limit it to 4 packs per credit card, you're now dealing with scalpers going and buying dozens of pre paid cards, setting them up, and leaving them with just a tiny bit per card.\n\nAny barrier is going to weed out people, and make it super obvious what they are doing.", "label": 0}
{"text": "https://preview.redd.it/enfofgjfdzwd1.png?width=1080&format=pjpg&auto=webp&s=9217f50e69c3eb3f6c1534ecae971c6b9be8ebe2", "label": 0}
{"text": "Oh no it absolutely works. I knew a guy who ran a very successful business that way. \n\nHe weighed packs, opened the ones with good cards, sold the good cards as individuals, and sold the unopened packs as unopened packs. If he got a complaint about the packs being weighed he just refunded the person, and made a huge profit because people so rarely complained.", "label": 0}
{"text": "We gotta get you the rotating pokeball hip devices and a stuffed appletun! ", "label": 0}
{"text": "Decidueye. I love birds of prey and I think his archer theme is really cool.\n\nhttps://preview.redd.it/vfnpd1ykdzwd1.png?width=800&format=png&auto=webp&s=3c77197de944b10999ef9fb745d329e934b2206a", "label": 0}
{"text": "I think they need to be \"overdesigned\" to showcase the improving technology of the platform/console they're in. Gen 1 is in Gameboy with few pixels so they can't really complicate it.", "label": 0}
{"text": "I was gonna just rattle off my favorites, but coverage wise I feel like you want the following for a game playthrough\n\nJolteon: Lots of flying weaknesses on this team, and ground really doesn’t bother the rest of the mons.\n\nHitmonchan: punch moves= coverage MONSTER\n\nMothim: mainly to negate the ground weakness of Jolteon and your rockruff evolution\n\nAppletun: I actually don’t know much about Hydrapple, but I know Appletun is nice and bulky in addition to packing some great stall tools. Could be good as a backup swap for your other members weaknesses.\n\nDusk: Preference mainly, but tough claws and fang moves  or even just some hard hitting STAB makes him probably the best mon on the team.", "label": 0}
{"text": "Chandelure because it can hit like a truck.\n\nMisdreavus, Mismagius and Flutter Mane are very close though. I just think that whole family of Pokemon is just kinda neat.", "label": 0}
{"text": "Trevanant and Phantump", "label": 0}
{"text": "https://preview.redd.it/vk4jovojfzwd1.jpeg?width=450&format=pjpg&auto=webp&s=72ffe881f31c96e89a5da9bc88eebf75a253b7c4", "label": 0}
{"text": "This such a brilliant idea I don't know why I've never seen anyone else do it before. Please continue making these!", "label": 0}
{"text": "Either Mismagius, Golurk, or Froslass for me.", "label": 0}
{"text": "Thyplosion", "label": 0}
{"text": "Team player! Goated Mon", "label": 0}
{"text": "French: Pokemon Johto\n\nJapanese: Together", "label": 0}
{"text": "Spooky! I love it!", "label": 0}
{"text": "Great picks!", "label": 0}
{"text": "MISMAGIUS! It’s my favorite Pokemon of all time. Love the ghost witch.", "label": 0}
{"text": "Asking the real questions, cmon OP", "label": 0}
{"text": "I see what you did there, miss bee.", "label": 0}
{"text": "I have many ghostie favorites, but Chandelure is the one I have the most fun naming because of his duel fire and ghost typing. My best buddy is Ghost Pepper. I have two shiny ones named Peppergeist (pepper and poltergeist) and Jalapeñghost (jalapeño and ghost).\n\nOther favorites that I tend to use on my teams:\n\n-Decidueye\n-Drifloon and Drifblim (especially their shiny forms)\n-Spiritomb mostly for the noise it makes\n-Alolan Marowak \n-Cofagrigus\n-Gengar of course but also Haunter\n-I’ve become obsessed with Sandyghast and Greavard", "label": 0}
{"text": "I'd start Legends Arceus if you're just getting into the games", "label": 0}
{"text": "Old Amber is a reference to Jurassic Park, not Charizard.", "label": 0}
{"text": "It's a Jigglypuff seen from above!", "label": 0}
{"text": "So is Blastoise", "label": 0}
{"text": "https://preview.redd.it/bg53v149hzwd1.jpeg?width=570&format=pjpg&auto=webp&s=0f7d13af043788611353e43d646ec6ff85342ebe", "label": 0}
{"text": "I use it every day while I drive. The red material is peeling off in the top lol", "label": 0}
{"text": "https://preview.redd.it/vpip6j0hhzwd1.png?width=522&format=png&auto=webp&s=78aa0a48c32bf9711a2ff8014d2d50eaacc6892d\n\nOP rn", "label": 0}
{"text": "What 3rd party would EVER receive the licensing from Pokemon company to do this?!", "label": 0}
{"text": "Marshtomp", "label": 0}
{"text": "I think it's a bit of a reach for the kabutops and omastar lines, but I'm in on aerodactyl being an ancestor to the charizard line.", "label": 0}
{"text": "Another one for the memory tree 🥲", "label": 0}
{"text": "Well I asked people their favorite. I mean the Pokemon games aren't that hard and can be finish with some weak Pokemon ! The stats comparison on the left are there just because I screenshot the entirety of the bulbapedia table !", "label": 0}
{"text": "Not type coverage so much as a glass cannon that isn't electric.  The more Def/SpDef the better. Kind thinking maybe special attack Carnivine with ingrain, growth, and hyper beam", "label": 0}
{"text": "😂😂😭 I has no choice Frankenstein is too iconic not to use as a Halloween design", "label": 0}
{"text": "You.... do? Cuz I don't even see what I did.", "label": 0}
{"text": "Aerodactyl!", "label": 0}
{"text": "https://preview.redd.it/tn5t1se2jzwd1.jpeg?width=1280&format=pjpg&auto=webp&s=09a907595859302e0e74fa1a95174c3b7cceeb36\n\nPunchy lil guy", "label": 0}
{"text": "Read my username. Ma boi sableye is the best. I think it's because he reminds me of stitch (that movie is in my top 3 disney movies) plus the goofy smile. Idk why but i love characters or creatures with creepy smiles. Jax from tadc, sans undertale, and other mon like gengar. And sableye is just a design that does it to me, plus with the gem eyes, just makes it into my favorite pokemon in general.", "label": 0}
{"text": "Mimikyu and pumpkaboo!! I actually just got a mimikyu tattoo:)", "label": 0}
{"text": "https://preview.redd.it/i57xlrw7jzwd1.png?width=475&format=png&auto=webp&s=307bf3e95ab5874f9e574155d260f9ce3ed2b551\n\nzweilous <3", "label": 0}
{"text": "All you need now is the orange hair and a huge sun hat plus the pokeball straps on the side", "label": 0}
{"text": "Lets go for new players, Legends Arceus for unique mechanics and better visuals.", "label": 0}
{"text": "Exclusive Move : Bullet sneak \nAbility: Disguise technique", "label": 0}
{"text": "Yeah. I do rips on TikTok. Currently chasing 151 Master Set.", "label": 0}
{"text": "Same, my starters so rarely even get to low health. I kind of wish they would just get rid of those abilities.", "label": 0}
{"text": "Flair to match", "label": 0}
{"text": "Hasty or Naive for speed, otherwise Lonely/Naughty for Attack or Mild/Rash for SpAtk depending on if you wanted the stat bonus in one or the other offensive stat.\n\nHasty, Lonely, and Mild lower Defense while Naive, Naughty, and Rash lower SpDef.", "label": 0}
{"text": "My current favourite is Frillish, the Water/Ghost type. 😊💖\n\nhttps://preview.redd.it/sfqaapk7lzwd1.jpeg?width=144&format=pjpg&auto=webp&s=9e47c0b6515ccbeeb3c83ebff9a377d42178cc0b", "label": 0}
{"text": "Espeon, Hitmonlee, Trashcloak Wormadam, and Appletun.", "label": 0}
{"text": "Thought this was gonna be shipping and I was so confused.", "label": 0}
{"text": "https://preview.redd.it/ts4phlbqlzwd1.jpeg?width=1500&format=pjpg&auto=webp&s=68b276cef785491bad9a990e6f5a7d4447c9423f", "label": 0}
{"text": "Each individual zygarde cell is spinning its tail like a tiny propeller", "label": 0}
{"text": "Trash bag is objectively better than literal pile of sewage and larger/angrier literal pile of sewage", "label": 0}
{"text": "Zekrom: great design, powerful, cool typing, interesting lore", "label": 0}
{"text": "Don’t *all* the sprites face the same direction?", "label": 0}
{"text": "Banette is my favorite ghost type and pokemon overall. Chandlure, Dragapult, and Decidueye are some of my other favorites", "label": 0}
{"text": "I guess that's kinda fair.", "label": 0}
{"text": "Interestingly, they don't do this in Japan, but I never see packs on shelves anyway. Still a big thing for resellers though, I'm sure.", "label": 0}
{"text": "I’d say it’s pretty darn close to the original, given the size of the character! This is legit!!", "label": 0}
{"text": "When I think about German folklore and Pokemon, I think about another Charizard variant.", "label": 0}
{"text": "Hi GroyEhBoy!\n\nPhotos of merchandise are generally disallowed on r/pokemon, because they unfortunately tend to lose meaning with oversaturation (see [Rule 8](/r/pokemon/wiki/rules#wiki_8._no_screenshots_or_merchandise)). This post has been removed, but you may instead share your photo to the merch megathread to celebrate your find.\n\nIf you intended this post as a discussion prompt or a theory, please feel free to resubmit as a **text post**, bearing in mind that you'd need to reach 50+ words in that post to promote substantial discussion.\n\nCheers!\n\n\n\n\n^(Mods are not notified if you reply to this comment. To contact the) ^[r/pokemon](/r/pokemon) ^(mod team, please click) ^[here!](/message/compose/?to=/r/pokemon)", "label": 0}
{"text": "As a munchlax of a person who’s trying to get in shape, I highly approve and like!", "label": 0}
{"text": "For old school fans (born in 99)\n\nFirst gen are the only way to go..\n\nDont have a \"favourite\" one but list would be:\n\nGengar is the highest, so cool. \nBeedrill (Bro looks like a killer)\nLugia (Always loved his design) \nMewtwo (Backstory / Power)\nBlastoise (Coolest looking Pokemon)\nGyrados (Sea dragon come on ffs)", "label": 0}
{"text": "ITS PIKACHU!!!!", "label": 0}
{"text": "anyone else have any ideas on this or there own set up", "label": 0}
{"text": "Mimikyu, followed by Honedge.  \nThey really cooked when it came to the 3DS era's Pokemon designs.", "label": 0}
{"text": ">*Any barrier is going to weed out people, and make it super obvious what they are doing.*\n\nExcept it's not cold medicine, you don't get the cops called on you for buying and loading prepaid visas 100 at a time.\n\nAnd unless they have security or facial recognition literally preventing the same human from buying more, it won't have any effect at all.", "label": 0}
{"text": "Get a sun hat", "label": 0}
{"text": "Anyone know why a Pokémon's IVs would drop after evolving in HGSS?\nI had EV trained them from a Nidoran (4hp/252att/252spe) and when I evolved it at lvl 43 its att iv plummeted. Anyone see this happen before?\n\n[Nidorino](https://imgur.com/hjOAvhL)\n[Nidoking](https://imgur.com/E4eH4Ql)", "label": 0}
{"text": "Its almost like I said that this is not real or that I'm just having fun with it or seeing how far I can stretch it 😂", "label": 0}
{"text": "That’s awesome!  It must have been such a rush, haha.", "label": 0}
{"text": "Either Drifblim or Spiritomb at the moment", "label": 0}
{"text": "Har-har. I didn't know that weighing packs would be useful to valuation. Or at least that the difference between foil and non-foil would be entirely negligible.", "label": 0}
{"text": "So this is where my old Pokémon poster I had when I was 8 is from.", "label": 0}
{"text": "Scarlet and violet or Sword and Shield they have basic gameplay", "label": 0}
{"text": "Chandelure", "label": 0}
{"text": "Aegislash", "label": 0}
{"text": "Lucario", "label": 0}
{"text": "Thank you for posting to r/pokemon! We're glad to have you here, but unfortunately we've had to remove this post per our rule on [Objective Questions](/r/pokemon/wiki/rules#wiki_3._follow_text_and_poll_post_restrictions). This rule is in place per feedback we've received from the community because objective questions tend to fill the topic listing and often leave little room for further discussion once the question has been answered.\n\nWe do have a [Weekly Questions Thread](https://rpkmn.center/questions) dedicated to seeking answers for questions like yours, though! A lot of knowledgeable Pokémon fans frequent that thread, so please consider posting your question there if you're still looking for an answer, and you may get a detailed answer even faster than you would have here! You also don't need to worry about a minimum word count in that thread.", "label": 0}
{"text": "I can’t believe I forgot about Sableye! I would also definitely be a ghost type trainer, but there’s too many amazing ones to chose from. It’s honestly (obviously very subjectively) a very perfect type", "label": 0}
{"text": "Before I saw the pictures, I thought you were going as the chocolate milk mix.", "label": 0}
{"text": "If they didn't put it in the gameboy color games, then I probably don't know about it.", "label": 0}
{"text": "a dead Pumpkaboo", "label": 0}
{"text": "They never do lol", "label": 0}
{"text": "I love Ghost and it’s in my top 3 favorite types. \n\nNo particular order after # 1. \n\n1. Mismagius\n2. Drifblim\n3. Dragapult\n4. Dhelmise \n5. Basculegion", "label": 0}
{"text": "Love it", "label": 0}
{"text": "I expect you will figure it out soon enough", "label": 0}
{"text": "So real", "label": 0}
{"text": "My Goat!", "label": 0}
{"text": "Thank you! Protoman was a favorite as a kid in the 80’s and 90’s 😁", "label": 0}
{"text": "Have? Yes. Use? No, cause I stopped caring about Pokemon Go once they removed the covid-era raid distance.", "label": 0}
{"text": "Mermaid doesn't really make sense, and we already have Primarina for peak mermaid/siren design.\n\nA narwhal would be cool and could make sense, but I feel like that might be encroaching on Dewgong evolution territory. Maybe a Lionfish?", "label": 0}
{"text": "In Sword/Shield, Pokemon in which you are OT will always obey you so this will work.", "label": 0}
{"text": "Yep. Nope.", "label": 0}
{"text": "phantump", "label": 0}
{"text": "Scarlett and Violet have their issues but they gave me my first Gengar and I've wanted one since red and blue so they get a pass.", "label": 0}
{"text": "Same goes for the parasect fungus. It’s figured that would have been used more often if not on its own by now", "label": 0}
{"text": "That's fair. Then Team Rocket can have Pikachu", "label": 0}
{"text": "Pikachu is perfect as a mascot.\n\n\nEevee is popular because it turning into 8 different things is a gimmick. Your mascot should be something you DONT want to evolve.", "label": 0}
{"text": "If you keep adding pokemon like its own safari zone you will be cooking!", "label": 0}
{"text": "I’m gonna have to use game sprites to pad it out while I build other animatronics, but I plan on making this a regular thing", "label": 0}
{"text": "ceruledge\n\nbut for halloween probably pumpkaboo", "label": 0}
{"text": "Ngl I would love like a ton of different mimikyu forms depending on like terrain, say urban areas get the pikachu line, forests get some kinda bug or grass type, caves get a rock or steel type, it’d be great", "label": 0}
{"text": ">Pikachu is perfect as a mascot.  \n\nHow?", "label": 0}
{"text": "Same!", "label": 0}
{"text": "They Gotta Catch Them All With That Profile.", "label": 0}
{"text": "Mudkip. That is all", "label": 0}
{"text": "Yeah, just use straight up regular fish. There are also plenty of pokemon based food products that don't actually harm the pokemon. Slowpoke tails (they regrow and are painless to cut off), Combee honey, Moomoo Milk, and eggs come to mind, but you could probably make other things work too, such as inanimate exeggcute, Tropius bananas, and shed Vanilite cream.", "label": 0}
{"text": "All I know is that Magikarp is all bones.", "label": 0}
{"text": "Kyurem does too", "label": 0}
{"text": "There's a big card machine in some Vegas casino that was meant to trick people into thinking it was from the PSA rating company. It sold random graded cards and looked like it could have very expensive cards in it. It turned out to be owned by a different company and all of the cards were mid at best. It's not the same as weighing packs or resealing them, but a machine like this, if not owned by Pokémon, could sell bad packs.", "label": 0}
{"text": "It's simple to draw - simple in shape and colors. Speaking of colors - yellow is a very gender neutral color too. \n\n\nYellow, black, and a little red. It doesn't overlap much with other mice; there are no other electric mice mascots in any industry or in any media. It's unique.\n\n\nIn 1998, at first glance, you can't tell if Pikachu is a boy or a girl. It's tailored towards all kids.", "label": 0}
{"text": "I’ve always loved the implication that there are regular animals in the Pokémon world. How are they surviving living alongside the Pokémon? It already strains credibility that humans would survive it.", "label": 0}
{"text": "nerd.", "label": 0}
{"text": "https://preview.redd.it/wk05plczwzwd1.png?width=1080&format=pjpg&auto=webp&s=e48b9d41a20e03f3957b58cd2483377b34c6551d\n\nI look like this all year long so it's gonna have to be Pumpkaboo!", "label": 0}
{"text": "Charizard, final evolution of one of the starters.\n\n\nIt's still a starter pokemon and there are two other starters in the same game. \n\n\n\n\nYou either have to make all of them a mascot, or none of them - because otherwise, your players think there is an objectively better/Canon option", "label": 0}
{"text": "Your vending machine still sells evolving skies? The oldest packs they have in my local vending machines is Crown Zenith.", "label": 0}
{"text": "Yeah you can almost never get them as solo packs but they're there in tins quite a bit.", "label": 0}
{"text": "Chandelure", "label": 0}
{"text": "Shedinja", "label": 0}
{"text": "I didn't see anyone else say it, but I am probably going to say Alolan Marowak. \n\nGhosts weren't ever one of my favorite types, but I did like the cubone line, and Alolan Marowak is one of the regionals that I think is better than the original.", "label": 0}
{"text": "Drifblim and Jellicent (don't make me choose)", "label": 0}
{"text": "I have a figure that looks exactly like that.", "label": 0}
{"text": "My favorite is Mimikyu 💜", "label": 0}
{"text": "Lunala", "label": 0}
{"text": "Aw man the picture didn't attach :(", "label": 0}
{"text": "Hisuian Lilligant\n\nhttps://preview.redd.it/8g4jxtl8zzwd1.jpeg?width=189&format=pjpg&auto=webp&s=f829ce4334597328a72ef1f46b5e88bea6374bef\n\nJust look how beautiful she is", "label": 0}
{"text": "Well, there's Houndoom, my personal fav fire of the gen.", "label": 0}
{"text": "Mimikyu!", "label": 0}
{"text": "yup texas has them, was thinking I wish they had these when I was younger", "label": 0}
{"text": "I just wish the one near me stocked new packs faster.", "label": 0}
{"text": "Hoenn is the best region and music, sinnoh has the best lore and probably region design as a map, Unova has the best story and sequel story. \n\nThere's a lot to love about all Pokemon, but I agree with op", "label": 0}
{"text": "Aegislash.", "label": 0}
{"text": "Is your favourite Turtwig?", "label": 0}
{"text": "As much as I love Decudueye, the ghost typing just feels added on :(", "label": 0}
{"text": "Bring back Pumpkaboo and Gourgeist! Why they weren't featured in a game that has various Pokemon sizes is beyond me.\n\nAt least we are returning to Kalos soon!", "label": 0}
{"text": "Oh god a 3rd tier Seaking evolution lionfish would be daaaaaank", "label": 0}
{"text": "Do you often find the in demand sets in them?  How often would you estimate they are restocked?", "label": 0}
{"text": "Pumpkivoir", "label": 0}
{"text": "30 Years later, still a problem", "label": 0}
{"text": "Umbreon, Hitmonlee, Mothim, Duskroc, Hydrapple", "label": 0}
{"text": "This is awesome", "label": 0}
{"text": "Gimmieghoul", "label": 0}
{"text": "What's your favorite part about working there?", "label": 0}
{"text": "Not a series, but could you imagine a western with Pokemon?", "label": 0}
{"text": "Gardewhor-", "label": 0}
{"text": "Love it!", "label": 0}
{"text": "you can find the nearest one to you in a couple of us states   \n[https://support.pokemoncenter.com/hc/en-us/sections/13360842288916-Pok%C3%A9mon-Automated-Retail-Vending-Machines](https://support.pokemoncenter.com/hc/en-us/sections/13360842288916-Pok%C3%A9mon-Automated-Retail-Vending-Machines)", "label": 0}
{"text": "I actually have 2. One that I bought with my copy of let’s go that I keep displayed next to my switch and a second one I bought used just for Pokémon go and hang it off my belt loop", "label": 0}
{"text": "The single interesting thing about the goldeen line is that waterfall was their signature move in gen 1", "label": 0}
{"text": "Thanks for posting to r/pokemon! If you're looking for advice on the value of a product you are buying or selling, please ask in the [**monthly value megathread**](https://rpkmn.center/weekly/value) or the [**weekly questions thread**](https://rpkmn.center/questions). Thanks!", "label": 0}
{"text": "All the Rotoms\nHe's adorable but also had his day on ladder\nI have him shiny in a dreamball and I love when i get the chance to brig him out", "label": 0}
{"text": "Thank you for posting to r/pokemon! We're glad to have you here, but unfortunately we've had to remove this post per our rule on [Objective Questions](/r/pokemon/wiki/rules#wiki_3._follow_text_and_poll_post_restrictions). This rule is in place per feedback we've received from the community because objective questions tend to fill the topic listing and often leave little room for further discussion once the question has been answered.\n\nWe do have a [Weekly Questions Thread](https://rpkmn.center/questions) dedicated to seeking answers for questions like yours, though! A lot of knowledgeable Pokémon fans frequent that thread, so please consider posting your question there if you're still looking for an answer, and you may get a detailed answer even faster than you would have here! You also don't need to worry about a minimum word count in that thread.", "label": 0}
{"text": "Thanks for posting to r/pokemon! This post has been removed under [Rule 3](/r/pokemon/wiki/rules#wiki_3._follow_text_and_poll_post_restrictions), which requires text posts with be 50+ words *without* filler text (text unrelated to your idea that is there just to meet the word minimum). This metric was voted in by /r/pokemon users in 2017 and sustained in multiple votes to promote substantial discussion.\n\nMaybe expand on your personal take, or possible factors to consider. If you still don't have enough content to meet the word minimum without filler text, you could instead ask your question in the [Weekly Questions Thread](https://rpkmn.center/questions), which does not have a word count requirement. Otherwise, just remember that the word count applies only to the **post body**, not the title and feel free to repost with these guidelines in mind!", "label": 0}
{"text": "My 7 year old has been asking for a Clip ‘N’ Go Master Ball.\n\nBased on my Googling, it seems that it was either a Game Stop or SDCC exclusive.\n\nI have only been able to find it on eBay for over $100. He’s a kid that will be playing with it, so I don’t care if it’s used.\n\nIs there anywhere else I should look?", "label": 0}
{"text": "Chandelure! Ghost abd Fire is such a cool combo. I like the design too.", "label": 0}
{"text": "👏👏👏", "label": 0}
{"text": "Yeah, its head is HUMONGOUS :/ ( My mom gave me them as a gift)", "label": 0}
{"text": "Same! :)", "label": 0}
{"text": "Anyone know if there is a good website that has Pokemon figures? I'm looking for something simple and specifically an Ambipom figure.", "label": 0}
{"text": "Yes, the chonky dinosaur shall :)", "label": 0}
{"text": "Finally found another one! 😂 Their line gets no love at all I swear 😞 It’s why James was my favorite in the show. He always had the coolest Pokémon and loved them so much.", "label": 0}
{"text": "Every 7/11, FamilyMart, Lawsons convenience store in Asia should have these installed. 💯🗺👏", "label": 0}
{"text": "Chandelure <3 gengar solid second", "label": 0}
{"text": "https://preview.redd.it/7y16rscx60xd1.jpeg?width=1280&format=pjpg&auto=webp&s=cf32ad02038240195ede60fd2d2f3515da0a04bb", "label": 0}
{"text": "Fuckin love Dusknoir, dude looks so cool", "label": 0}
{"text": "Is he still not in Go? Do they have dreepy yet?", "label": 0}
{"text": "You don't need to worry about this. The software will not know any different.", "label": 0}
{"text": "Shedinja.\n\nI love gimmicky mons", "label": 0}
{"text": "No love for dhelmise or brambleghast? Ok I’ll be the first one. Love those dudes. Very neat designs", "label": 0}
{"text": "Eevee. It’s lovable, evolutions that bring diversity promoting the most options for a player to find one that personally reflects them.", "label": 0}
{"text": "What do you mean creepy? It's friend shaped! These guys actively want to be your friend! He's trying his best not to kill you and that's what counts.\n\nhttps://preview.redd.it/d0afv80z90xd1.png?width=40&format=png&auto=webp&s=8970ff064696c21e542f446f7444c93287ca9ca6\n\n\\^ ^(Certified Buddy)", "label": 0}
{"text": "BRO THEY AINT WOMEN THEY ARE GODAMN MEN LOOK AT THEIR SHOULDERS", "label": 0}
{"text": "Isn’t decidueye based on an extinct owl species in Hawaii?", "label": 0}
{"text": "Mega Banette is my favourite mega evolution. I found a shiny in Pokémon Scarlet recently that I look forward to using as a mega in Pokémon : Legends Z-A.", "label": 0}
{"text": "Garden Boar", "label": 0}
{"text": "yes that would be awesome!", "label": 0}
{"text": "Decidueye likely gets its typing from the owl it's based on, the Stilt-Owl. It was native to Hawaii and has been extinct for roughly 1000 years from what scientists can deduce. It could also have something to do with global superstitions around owls but becoming a ghost in reference to its real life counter part just sounds cooler.", "label": 0}
{"text": "https://preview.redd.it/yno7nb3vb0xd1.jpeg?width=2316&format=pjpg&auto=webp&s=76c23705a1e087fba9c4777fc97ff506efb11f06\n\nUsed it for my costume tonight… 😂🤓", "label": 0}
{"text": "Real talk: Maractus is a G.  I’ve never used him on any competitive team regardless of generation or tier.  I’d feel like I was cheating.  I wouldn’t get any satisfaction out of sweeping my hapless opposition with such an upper-echelon threat.  You just click a button, and Maractus is taking something’s soul.  Hidden Power Water?  Checkmate, Heatran.  Catch this crisp 5HKO.  Petal Blizzard absolutely KNIFES through Sealeo for a hefty 45%.  Keep repping the cactus, man!  With Maractus in the fold, you can’t lose!!! 🔥", "label": 0}
{"text": "I’m glad you get it! I think if it got a Mega more people would remember it! Hopefully soon!", "label": 0}
{"text": "My favourite ghost Pokemon is ghost chicken because he can peck at wands and also licks fabled pocket men.", "label": 0}
{"text": "Yoooo! That’s such a nice take! I wish they had Phione evolve into Manaphy. I think it would be more loved if so. I like both personally 👍", "label": 0}
{"text": "When you move from home to sv, the move will reset yes, but before you save, you can use home's move relearner to keep the moves that are compatible, such as giga impact. Confide is not compatible so you cant do it", "label": 0}
{"text": "But there are lots of pokemon based on extinct animals and they aren't ghost types.", "label": 0}
{"text": "You’re right that it’s possible. I just want to add the info that it’s not accessible and isn’t really a thing to worry about unless you’re buying classic packs. \n\nNo one is using that tech in new releases due to how much it costs to get the set up to do it.", "label": 0}
{"text": "Man dude I wish!!! I should do one of those no rules online battles and roll up with 6 Maracti. I think that would scare some competitive giants. 😤", "label": 0}
{"text": "Chandelure. Fight me.", "label": 0}
{"text": "You can do that in Anything Goes on Showdown!  I once smoked a guy by using a team of 6 Spoinks in that tier.  You can make your faves kick some ass if you predict and get some matchup luck!  I bet you’d clean someone’s clock even quicker with Maractus.  Maybe even pull up to the ladder with just 5 Maracti and an empty team slot to make a statement: you need to give your opponent a handicap for them to have a chance!", "label": 0}
{"text": "https://preview.redd.it/j6l5quacd0xd1.png?width=250&format=png&auto=webp&s=fc6ea095fd4974e9f291643b8625eb1ee8a81b95\n\nThere are so many cool Ghost-types (Mimikyu, Hisuian Zoroark, Alolan Marowak, and Annihilape to name a few), but I've gotta go with Runerigus! I've always loved Yamask, but Cofagrigus is a little underwhelming even though I still like it. Runerigus is just purely awesome! The evolution method is annoying though...", "label": 0}
{"text": "Love me some Banette appreciation!", "label": 0}
{"text": "Does anyone have the leaked character bio’s for the gen 7 and 8 characters? Im curious about how tall, and what age character like Leon, Melony, Leon, Professor Kukui etc, and what inspired their designs, and the background of the characters. So far, I’ve only been seeing bios for gen 5, and 6 characters.", "label": 0}
{"text": "https://preview.redd.it/ny99ei83e0xd1.jpeg?width=1125&format=pjpg&auto=webp&s=d92e0f62a7703df1edb0f5bc56c7e39e7f66ca6b", "label": 0}
{"text": "I get one every time I go grocery shopping. I hate grocery shopping so it’s really nice to have something to look forward to.", "label": 0}
{"text": "My Walmart kept them in one of the checkout aisles, I have no idea what they were thinking with that.", "label": 0}
{"text": "Wait I like it. That’s  a good one 😌", "label": 0}
{"text": "We are? What time? When? I wanna go! \n\nHow do I get on this trip?", "label": 0}
{"text": "[Here's a screen recording of Vision Pro in action.\n](https://www.youtube.com/watch?v=BV9Xy6L_rlM)\n\nIt's not CGI - it's real tech you can buy today! Amazing, right?", "label": 0}
{"text": "Any moves that vivillon can learn in SV. Giga impact for example is a tm move in sv for vivillon. And since your vivillon from home has it, you can use home's relearner to give it that move instead of using a tm in sv.", "label": 0}
{"text": "I'm playing SoulSilver right now -- just got to Kanto.  Been carrying an Ampharos the entire game.\n\nIt's certainly not the best Electric type I've ever carried, but I do really like my goofy kangaroo-sheep.", "label": 0}
{"text": "WAIT!!, never mind I found the problem! Its Psypokes IV calculator thats wrong! I checked on a marriland and it confirmed that the IVs didn't change. My bad, disregard that.", "label": 0}
{"text": "Hopefully we can ride on Cyclizar in a future pokemon game. But with our own though.", "label": 0}
{"text": "Before Mimikyu Banette was my favorite ghost. Still is my favorite mega too.", "label": 0}
{"text": "Jellicient.. I just think it's cute.", "label": 0}
{"text": "But what about it's forgotten middle evo? :(", "label": 0}
{"text": "https://preview.redd.it/sn8xbq9kg0xd1.jpeg?width=1566&format=pjpg&auto=webp&s=48918ca2cb09923340356b8d473ac9c20920aaac", "label": 0}
{"text": "Yeah just realized that, my bad. Thanks though!", "label": 0}
{"text": "Hisuian Typhlosion", "label": 0}
{"text": "https://preview.redd.it/71rx2vn0h0xd1.png?width=720&format=pjpg&auto=webp&s=11094842cb302e09b8b2e5400332343a24a81efd\n\n*used Silph Scope* \"M-m-mother?!\" 😢", "label": 0}
{"text": "Officially: Giratina \n\nUnofficially: Missingno (if they count)", "label": 0}
{"text": "that sounds so needlessly complex (the weight of the dye) vs just putting basically anything in there with randomly variable weight?", "label": 0}
{"text": "I believe the mystery dungeon games have a line of text like that (plus some little animated lines that run down the Pokemon). The mainstream games really ought to as well.", "label": 0}
{"text": "If my grocery store had one of these I’d go broke so freaking fast lol", "label": 0}
{"text": "This is badass", "label": 0}
{"text": "Wow, Mimikyu still isn’t in Go, but it’s gonna be showing up in Sleep starting on Monday. That’s funny.", "label": 0}
{"text": "I still have mine but I use my wristband accessory more than anything because I'm at work 90% of the time I'm awake", "label": 0}
{"text": "https://preview.redd.it/ejt6ralth0xd1.jpeg?width=735&format=pjpg&auto=webp&s=37fa9956bc23d5b568ee1ec6935322b486ca5fb5\n\nGengar evolution line 💜", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "It could also be width to measure how far apart their disconnected hands can be from each other.", "label": 0}
{"text": "Didn’t know I desperately needed something in my community until this post 😂", "label": 0}
{"text": "Haunter is best boy.", "label": 0}
{"text": "Yep", "label": 0}
{"text": "Ah it did look familiar. Some safeways have them too.", "label": 0}
{"text": "Classic Gengar. Iconic design and one of the first we see, facing that Nidorino.", "label": 0}
{"text": "Annihilape", "label": 0}
{"text": "No trainer in RGBY owns a Venusaur (discounting yourself if you pick Bulbasaur or, as you mentioned, the rival if you pick Squirtle). Additionally, no trainer owns a Golem either, so you'd have to trade Graveler, only to see it evolve into an uncharacteristically cute, round turtle-like Pokémon (RGB).", "label": 0}
{"text": "Would love to see them incorporate the Orange Islands into a game! Then we could finally have Pokémon from Pinkan Island, Valencia AND the Crystal Onix! A lot of missed opportunities there, I feel.", "label": 0}
{"text": "I'm more of a cacnea guy, but maractus is great. I dig cactus pokemon in general. Such a cool look.", "label": 0}
{"text": "I could never pass this without pressing Touch to Start.. 😱", "label": 0}
{"text": "One thing about the throwing animations in the games is that they throw the ball like it would land farther away and a faster throw, and the camera then switches when it \"hits\" the ground at more or less the same distance you have at the end of the animation", "label": 0}
{"text": "I can hear the music now", "label": 0}
{"text": "Wasap", "label": 0}
{"text": "It certainly draws one in. Like a siren to the rocks 😂", "label": 0}
{"text": "This is 100% correct. This is actually only their beta/initial rollout of these machines so they aren't fully nationwide yet.\n\nSource: I'm an engineer that works for the company that makes these for Pokémon. The tester machine is just a few feet away from my desk (along with tons and tons of booster packs and tins for testing).", "label": 0}
{"text": "kanto raichu, compketely outshadowed by its entire evo line (especially pikachu)", "label": 0}
{"text": "Yeah, 4x fire weakness!", "label": 0}
{"text": "Thanks for that. Good to know about Golem not even appearing in a trainer battle.\nAlso where did you get your info? I tried to find a single list of Pokémon that appear only I trainer battles, but couldn’t. Or are you just a Pokémon savant lol?\nI’m trying to fill out as many spots (and capture where possible) as many Pokémon as a single solo play though will allow. I’m trying to avoid glitches and cheats out side of Mew, but that was partially to fulfill a childhood dream.", "label": 0}
{"text": "Hey man I'd really appreciate an invite to this discord page. I've a game breaking glitch I really need help with", "label": 0}
{"text": "Mismagius has been my favorite ever since it was introduced. Best ghostie! Although I do love them all, they all have great qualities and fun aspects.", "label": 0}
{"text": "There are too many complaints about arts drowning the sub, almost like this is a pokemon art sub instead of the general pokemon sub. It becomes so bad that back when reddit have pages instead of unlimited scroll, it is possible to have 2 pages full of arts without any discussion post. The text mode only rule is voted in by the community as a compromise. Same reason why memes are only allowed for mon and tue. Because people spam so mods have to introduce restriction", "label": 0}
{"text": "I used to play Pokémon Blue as a child with Charmander as my starter, battling every trainer I could to grind for a Level 100 Charizard. Kid me made the mistake of teaching it Cut, Strength, Fissure, and Mega Punch, thus having difficulty with Agatha.", "label": 0}
{"text": "I'm a big fan of Drifloon, especially after making two of my own for my Team Rocket Hallowe'en costume a couple of years ago. They just floated around the party, blowing in the air streams made by the central heating, freaking people out", "label": 0}
{"text": "This is awesome! It’s a shame Lego doesn’t have the rights to Pokemon", "label": 0}
{"text": "Dracopult", "label": 0}
{"text": "Sad I had to scroll this far 🥲", "label": 0}
{"text": "I.jusr bought a tin from this machine this week. It's like a reward for running errands", "label": 0}
{"text": "Username checks out as well haha you are on point!", "label": 0}
{"text": "Hi eslib!\n\nPhotos of merchandise are generally disallowed on r/pokemon, because they unfortunately tend to lose meaning with oversaturation (see [Rule 8](/r/pokemon/wiki/rules#wiki_8._no_screenshots_or_merchandise)). This post has been removed, but you may instead share your photo to the merch megathread to celebrate your find.\n\nIf you intended this post as a discussion prompt or a theory, please feel free to resubmit as a **text post**, bearing in mind that you'd need to reach 50+ words in that post to promote substantial discussion.\n\nCheers!\n\n\n\n\n^(Mods are not notified if you reply to this comment. To contact the) ^[r/pokemon](/r/pokemon) ^(mod team, please click) ^[here!](/message/compose/?to=/r/pokemon)", "label": 0}
{"text": "What is a Redbox?", "label": 0}
{"text": "thank you so very much furriend!!!", "label": 0}
{"text": "Hey there! The pokemon TCG has quite a few products that they offer that contain quite a good number of packs, all ranging in price points. Do you have a specific price point/budget? In my experience, each boster box I have opened contains at least one secret rare, but I have pulled amazing things from collection boxes as well, which are a bit cheaper usually!\n\nAs for sets to pick, do your kids have any particular pokemon they like? I can look up what recent sets they are in and let you know :) If they don't have any preference, the recent set, Stellar Crown, is a great option. There is also a new set coming out November 8, 2024 called Surging Sparks thats looking to be pretty awesome too! Hope this was able to help some!", "label": 0}
{"text": "Strongly approve.", "label": 0}
{"text": "Sword and Shield packs with VSTAR cards (the card that's a VSTAR marker) are impossible to weigh.\n\nHowever, since Scarlet/Violet no longer do that, some packs are weighable. However, 151 and Shrouded Fable that have Holo energy does throw that math off enough to make it hard to weigh it.", "label": 0}
{"text": "All the mythicals, I am so sad I lost the 20th anniversary mythicals 😢 thank you so much if you can", "label": 0}
{"text": ":D", "label": 0}
{"text": "Gallade!", "label": 0}
{"text": "Have you played the extra missions in explorers of sky yet?", "label": 0}
{"text": "+1 for Galarian corsola, love the lore and eviolite shenanigans and I love it’s sad little face", "label": 0}
{"text": "You haven't been able to weigh packs to gauge their rarity for a hot minute. The current solution is that they pack in the tcg game code card that has one of 3 weights depending on the type of cards in them. The packs with more foils in them will have the lightest code card and vice versa", "label": 0}
{"text": "NICEEEE! I love Milo", "label": 0}
{"text": "For me, it’s either Litwick or Phantump. Though I do slightly lean towards Litwick", "label": 0}
{"text": "Mimikyu", "label": 0}
{"text": "Yeah Cacnea is great too! Very awesome first stage!", "label": 0}
{"text": "Flatten the edges more, even if its foam it can still hurt people if he throws it", "label": 0}
{"text": "https://preview.redd.it/2vydgbfwt0xd1.jpeg?width=900&format=pjpg&auto=webp&s=96244f5503db2df3403e1f3a65e0dcc99b11fec5\n\nGengar all day, the only way 😈", "label": 0}
{"text": "Ghost are my favorite type overall. \n\nGengar is my absolute favorite Pokemon of all. \n\nBut other top contenders are: \n\nChandelure \nTrevenant \nAnnihilape \nDecidueye \nBasculegion", "label": 0}
{"text": "Golurk", "label": 0}
{"text": "If Pokemon was real chances are poke balls would be used as weapons and pokémon would go extinct because of how dangerous of a threat they pose. I mean a snorlax that doesn’t look at where they’re going to lay down would instantly squish several humans.", "label": 0}
{"text": "Super cool!", "label": 0}
{"text": "In Japanese, Kabutops is just the Shell Pokémon, so this only applies to the English release and should not be considered as a result.", "label": 0}
{"text": "https://preview.redd.it/brazawy1v0xd1.jpeg?width=412&format=pjpg&auto=webp&s=1a93aff3664b9c8188be007e53d00b632081b90c", "label": 0}
{"text": "I was rewatching to and i noticed something he was always to calm and nice to dawn maybe I'm overthinking it but why?", "label": 0}
{"text": "The right answer. I love Giratina!", "label": 0}
{"text": "As someone who only uses Poke Balls, that would certainly make things easier for me, lol", "label": 0}
{"text": "Well as an ice/ghost fan you'd think I'd go for Froslass, but actually it's Chandelure. Love myself some Chandelure.\n\nShout out to Lunala, Froslass, and Aegislash for being top pick contenders though.", "label": 0}
{"text": "They’re in Phoenix as well!", "label": 0}
{"text": "https://preview.redd.it/rftmzpd0w0xd1.png?width=640&format=png&auto=webp&s=92f15452f3fc60d23730791431fcce2aecffd240", "label": 0}
{"text": "love the ghastly trio of course but i love Misdreavus and Mismagius; they’re so chic!", "label": 0}
{"text": "Aegislash", "label": 0}
{"text": "Glavenus after he joins an imperial army", "label": 0}
{"text": "The only shiny I’ve bred for. Love that purple pumpkin!", "label": 0}
{"text": "Legends za baby", "label": 0}
{"text": "Ageislash has-been my runner up favorite of all time for years now there's no way it would b my favorite ghost", "label": 0}
{"text": "My favorite is Chandelure, but it's close.  I also really like Dragapult, Annihilape, Mimikyu, and Gholdengo.", "label": 0}
{"text": "If it’s The bills route hack/method your referring to that literally blew my fkn mind at 30 \n\nThere were so many jenky rumours about acquiring mew in the early internet days (beat the elite four x times in a row, etc) it was so wild to discover you can get him quite easily that way 🤣", "label": 0}
{"text": "Not yet! I literally just beat it earlier this week lol. I found my old copy a couple weeks ago and have been slowly moving thru it", "label": 0}
{"text": "You're in for a treat, that's for sure :)", "label": 0}
{"text": "\n\nLike there's any other option", "label": 0}
{"text": "Umbreon for life, Hitmonlee, Wormadam (ground), Lycanroc Midday, and Flapple", "label": 0}
{"text": "Thanks everybody! Looks like I have plenty of games to play 😁", "label": 0}
{"text": "Duskull. I don't much care for its evolutions. I wouldn't mind them, but the fact that none of duskulls design is present in them makes me dislike them", "label": 0}
{"text": "Chandelure 100%", "label": 0}
{"text": "Love this question. Sylveon, Hitmonchan, Mothim, Lycanroc, Appletun", "label": 0}
{"text": "Missingno Might Be Illegal, Also Bellsprout Is LEGAL!!!!", "label": 0}
{"text": "None, because you can enjoy them for free if you have right switch (old serial nr) or if you have a OLED fused with a chip.", "label": 0}
{"text": "Always another con", "label": 0}
{"text": "But beautifully has a 100 spc attack? How do you justify this?", "label": 0}
{"text": "Ceruledge has one of the best designs in the franchise, amazing moves, unique typing, what's not to like ?", "label": 0}
{"text": "What games are you trying to move them to? Does it also play 3ds games?", "label": 0}
{"text": "I feel you homie trust me I feel you especially every boss battle that end with their last on in terra.... so confusing", "label": 0}
{"text": "That... isn't really just related to Home.\n\nAlso, a 3DS is very easy to mod and once that's done you can just give yourself any pokemon you might need. You could even install Bank that way to then transfer to Home if you really want to.", "label": 0}
{"text": "What do you mean by huh", "label": 0}
{"text": "Mismagius is probably my favourite. And Gourgeist is a very close second.", "label": 0}
{"text": "My favorite name for Gholsengo is Midas", "label": 0}
{"text": "You dislike Pokémon Home \"on a fundamental level\" because of issues you have with Bank and the 3DS games?", "label": 0}
{"text": "Trevanent and Bramblin", "label": 0}
{"text": "Mega version for me", "label": 0}
{"text": "Chandelure i love him but i especially love his shiny its  goated\n\nhttps://preview.redd.it/miacu19d81xd1.jpeg?width=1051&format=pjpg&auto=webp&s=44bba118df699530efd85699dde888974c371249", "label": 0}
{"text": "They always make past legendary available in the newer games. And competitive always make use of the newer games so it is not like you must catch xerneas in a 3ds game. You can catch xerneas in sword shield for example.", "label": 0}
{"text": "The little Bobby Tables of the Pokémon world.", "label": 0}
{"text": "Ended up with a shiny shadow one on Pokemon go. Love the red gem eyes with the yellow body", "label": 0}
{"text": "I think a lot of people remember it for its absolutely peak shiny too. Really made me wish Magcargo inherited it", "label": 0}
{"text": "link the video", "label": 0}
{"text": "https://preview.redd.it/yq1j08dp91xd1.jpeg?width=1800&format=pjpg&auto=webp&s=88f650eca547030eae87c4cde43e29abbdecf932\n\nThis purple guy!!", "label": 0}
{"text": "I'm here to proudly defend Inkay requiring you to flip your console upside down. It's weird but in the best way possible", "label": 0}
{"text": "It was overall a fun game! The cutscenes definitely went on a bit long for me, personally. Took my actual years to finish the game in my first run; I only just finished it tonight, in 2024. 💀 But it's a fun game! I do appreciate the exploration of the villain in this. The plot twist was pretty fun! ", "label": 0}
{"text": "https://preview.redd.it/6nz00mol91xd1.png?width=496&format=png&auto=webp&s=4ca61f0986aedb0f8913b2971744aecf93cfce7b\n\nRotom, my favorite lil guy! I always nicknamed mine “Voltergeist”", "label": 0}
{"text": "Yeah, I noticed it pretty strongly in this game in particular. It definitely bothered me, and I felt that some of the fights were way too easy because of it. It's fun overall, but for me, the hand-holding and slow-pacing weren't as nice. The plot is interesting, though! ", "label": 0}
{"text": "Of course Eevee, their main shtick coincides with the specialness of the whole series.", "label": 0}
{"text": "Doesn’t Redbox own these vending machines? Makes sense they’ll replace the dvd nonsense with something way more convenient.", "label": 0}
{"text": "Oh right, I never remember that", "label": 0}
{"text": "Doesn't explode*", "label": 0}
{"text": "Someone mentioned code cards having variable weight but I don't have a way to test that. Do you think that has a good enough impact?", "label": 0}
{"text": "Check out Moonstone Island", "label": 0}
{"text": "its a cute pokemon…until you get hit with a bullet punch, i love it", "label": 0}
{"text": "I love all ghost types except the Golurk line. Such an oddball ghost-mech-titan thing", "label": 0}
{"text": "My bad I think I misread your post.", "label": 0}
{"text": "is this ai", "label": 0}
{"text": "nvm, but the left foot is weird", "label": 0}
{"text": "What are these figures called? Is there a certain company that made them?", "label": 0}
{"text": "Technically they are in Pokemon Go, if you count that game", "label": 0}
{"text": "Gengar is my favorite Pokemon, period. So that answers that lol.\n\nMy favorite Ghost-type besides him is probably Sableye.", "label": 0}
{"text": "Sableye was such a cool pokemon, both design and typing wise. But then they added the Fairy type and this little goober lost its zero weakness status 🥲", "label": 0}
{"text": "The OG", "label": 0}
{"text": "Corsola (Galarian form) I’ve always been a fan of og corsola because misty is my favorite and I love water peek on but I’m a little dark/edgy so when the galarian form came out and fell in loved with this Pokémon and with an eviolite so good. I also like Jellicent and a lot more ghost Pokémon. Mismagius was my ace when I replayed Brilliant Diamond", "label": 0}
{"text": "Wow, its almost like artists have the same art styles across different subjects. Who would have thought.", "label": 0}
{"text": "aegislash", "label": 0}
{"text": "Dragapult and Aegislash", "label": 0}
{"text": "Flair checks out", "label": 0}
{"text": "Lunala! (Cause she’s my favorite Pokémon overall) (my favorite Pokémon that is Halloween themed is mimikyu though, and he is in my top ten)", "label": 0}
{"text": "Time to play.  \n\nShould I open it?  \n\nOr should I keep it sealed?", "label": 0}
{"text": "Maractus is chill, haven’t used maractus much but I love the design and its little dance. \n\nFor me, Heliolisk is the underrated Pokémon I’m crazy about. He is my favorite Pokémon and I will defend him till I die. He is fast and able to hit hard with moves like thunder, makes a great glass cannon. He also is able to have the ability dry skin which is in my opinion one of the best abilities. If you give him a focus sash and are able to set up rain dance, he is fucking amazing. And he kind of dances when you send him out, but not like maractus unfortunately. I also love his running animation in more recent games.", "label": 0}
{"text": "Silvally", "label": 0}
{"text": "Flutter Mane", "label": 0}
{"text": "I wish 😮‍💨", "label": 0}
{"text": "Aegislash is up there. Most of the other ghosts before didn't really catch my attention", "label": 0}
{"text": "Banette and duskull", "label": 0}
{"text": "https://preview.redd.it/1gydv572l1xd1.png?width=475&format=png&auto=webp&s=37c5446117f91b1c78e637bbc04c32a71b53fb41\n\nCursola! I love everything about this Pokémon. Such a clever design.", "label": 0}
{"text": "https://preview.redd.it/5zexf6jbl1xd1.jpeg?width=360&format=pjpg&auto=webp&s=4d316e66ba9b08e9c0719f9c818c3aecedf4a30e\n\nThis angry mf here", "label": 0}
{"text": "Have you entered and beaten \"The Way Home\" yet? The story with the professor.\n\nI think she appears even if you haven't, but just in case, have you started the Indigo Disc story?", "label": 0}
{"text": "This is AMAZING!!! Holy cow I love this! Great job!", "label": 0}
{"text": "Finally, a good fucking vending machine.", "label": 0}
{"text": "Sableye", "label": 0}
{"text": "They were a dvd/blueray rental kiosk", "label": 0}
{"text": "Marowak, and not the Galarian of whatever", "label": 0}
{"text": "I hadn’t heard that.", "label": 0}
{"text": "Oh I didn't know about that. I'm not very familiar with the paradox pokemons. Either way, it'd be cool if it was based on mismagius instead. I love it's design", "label": 0}
{"text": "Misdreavus, followed by Marshadow and Annihilape.", "label": 0}
{"text": "Fun!", "label": 0}
{"text": "My little cup Abra is amazing. And it has such a great movepool indeed.", "label": 0}
{"text": "The question came up for me \"How many Kanto mons haven't gotten a unique form or whatever by now?\" that sprawled into a very long debate and I needed to post these findings somewhere. \n\nWe did debate on using scrapped gen 2 cross gen evos as tiebreakers if need be for Cloyster/Dodrio/Paras/Seaking but we ended up not using them. You could argue that having an idea and removing it is a special form of neglect. \n\nAlso Venomoth. When discussing this with my friends, originally tried pushing for early Tinted Lens and Quiver Dance showed that they cared about it enough. However it wasn't specific/tangible enough and due to how this list needed to be structured sharing things at all just made things awkward. \n\nFunnily enough Dragonite didn't get \"multiscale\" as a unique feature because otherwise Dewgong would have been in the same boat because it shared Hydration with Manaphy in Gen 4. I didn't include it in the post proper to be funnier and so many things get Hydration now.", "label": 0}
{"text": "My Type: Null with eviolite. It's surprised me many times how it stood it's ground. In S/M I used Eevee special Z move with baton pass into Type:Null. No crits to overpass that defense.", "label": 0}
{"text": "Thats so interesting. Pokémon’s so complex if you think about it!", "label": 0}
{"text": "Wow childhood me would’ve freaked out if I saw this!!! So would adult me honestly lol who all I kidding", "label": 0}
{"text": "Not many of them can fit the label of \"quiet as the grave\". Owls don't really make a sound when they fly. Being almost perfectly silent, based on an extinct bird, and the myths of owls being harbingers of death in some cultures all adds up.", "label": 0}
{"text": "Asking me to pick between all of the best Pokémon designs is a tall order, but I am just old enough that I managed to get a hand me down gameboy color and Pokémon Yellow. It's where my 2 favorite types became my favorites, Electric, and Ghost. So I really have to say Gengar, but outside of that Duskull. Specifically Duskull, it's the strongest design of its line.", "label": 0}
{"text": "there are so many bangers in ghost type but galarian corsola or shedinja have to be up there.", "label": 0}
{"text": "I’m interested in the lasagna", "label": 0}
{"text": "This user is just a weirdo when it comes to HGSS. It's so weird", "label": 0}
{"text": "Anybody who knows:  are any of these under the umbrella of the pokemon company or just people setting up on their own", "label": 0}
{"text": "i love venomoth but game freak does not", "label": 0}
{"text": "Chandelier and Trevanant.", "label": 0}
{"text": "I’d have to say shiny hisuian Zorua or Zoroark", "label": 0}
{"text": "https://preview.redd.it/xnzegnexp1xd1.jpeg?width=1920&format=pjpg&auto=webp&s=ce2aecfaf774bb7c674b609d69e240a0ba0b444b\n\nThis guy has QUICKLY become one of my favorite pokemon", "label": 0}
{"text": "The amnesia one. I would list the exact episode but I don't have the time as of current. It was so sad though.", "label": 0}
{"text": "Do you know for sure or are speculating at all? Thanks for response.", "label": 0}
{"text": "Mega Scizor", "label": 0}
{"text": "golurk", "label": 0}
{"text": "https://preview.redd.it/wt08eqrpq1xd1.jpeg?width=1170&format=pjpg&auto=webp&s=56dbcf50e007ea24e172a257dd1ef766f262d32c\n\n🤝🏻", "label": 0}
{"text": "That cry has been used in the games for over 20 years! I'd recognize it blindfolded with no context😂", "label": 0}
{"text": "Dewgong is like Game Freak’s neglected child", "label": 0}
{"text": "Pokémon White Castelia City spawns?", "label": 0}
{"text": "thanks, must have edited right before you responded.", "label": 0}
{"text": "Gengar", "label": 0}
{"text": "This was my first thought too! It was really sad :(", "label": 0}
{"text": "I want Gorochu added to the games, let’s start there. \nParasect needs an evolution. \nGolduck needs an evolution, or a mega. \nHypno needs an evolution. \nSeaking needs a miracle.", "label": 0}
{"text": "OP, this is amazing. 100000000/10", "label": 0}
{"text": "There is no spawn in castelia city in black white. Only black2 white2.", "label": 0}
{"text": "Dusknoir. Such a majestic but also sinister looking ghost.", "label": 0}
{"text": "28 years and Dewgong's biggest accomplishment is still being part of Lorelei's team", "label": 0}
{"text": "For photo ops\n\nhttps://preview.redd.it/4fd1qm40z1xd1.jpeg?width=3024&format=pjpg&auto=webp&s=93e991ba119dd2c3750fe5c80a7b8b5016a2a968", "label": 0}
{"text": "Hey all, I've really got nowhere else to turn, so I'm trying a few places on reddit now. I'm trying to trade Pokemon out of my Virtual Console copy of Pokemon Green, and I've run into some issues with trading out. I have a 2DS XL with Pokemon Red, Blue, Yellow, Gold, Silver, and Crystal on it, and a 2DS with Pokemon Green on it. Whenever I try to link Green up to any of the games on my 2DS XL, I'm immediately met with a message saying no link partner can be found. It's like it doesn't even try searching. I tested local connectivity between a copy of Alpha Sapphire and X using both systems and they linked fine, but the Virtual Console games won't. Just kinda hit a wall here and was hoping someone could help me get things moving. Thanks!", "label": 0}
{"text": "https://preview.redd.it/35qqyhifz1xd1.jpeg?width=1079&format=pjpg&auto=webp&s=72063bf65249e69a08abe8cc09dfee064919c8a5\n\nPumpkaboo!!! The cutest ever. I actually want to get a tattoo of it", "label": 0}
{"text": "Dhelmise all the way", "label": 0}
{"text": "spiritomb", "label": 0}
{"text": "Damn, dude. Rock on.", "label": 0}
{"text": "The Japanese gen 1 games can't trade with the western versions.", "label": 0}
{"text": "**Pure:** Mismagius\n\n**Primary:** Giratina\n\n**Secondary:** Lunala or Ceruledge", "label": 0}
{"text": "My og fave were haunter and gengar since i grew up with the anime and always loved the tower episode. \nAnd best boi Giratina origin form he is just Legen.. wait for it.. dary🤙 still one of the best designed imo", "label": 0}
{"text": "Mienshao always felt like it should've been more popular than it was. I think it could've been in the same league as Gardevoir or Luxray, but it's completely ignored instead", "label": 0}
{"text": "Love this", "label": 0}
{"text": "95% of the time, the joycons are repaired and not replaced. We only replace them if the issue isn't the standard cause of the drift, which is very rare. Even then, there is still a 90% chance the replacement will match your original, even if it's limited edition.", "label": 0}
{"text": "Pumpkaboo doesn't get enough love so cute!", "label": 0}
{"text": "r/pokemonrng", "label": 0}
{"text": "Definitely", "label": 0}
{"text": "I'm an adult -- Gengar", "label": 0}
{"text": "its just an gen 3 all out battle now .\\_.", "label": 0}
{"text": "https://preview.redd.it/bfftiqwl12xd1.jpeg?width=500&format=pjpg&auto=webp&s=f9c081565869acaac73f6e96cdd0da70ace674cd\n\nGotta be Lunala for me. I still haven't let go of Nebby ngl, I'll always be immensely attached to it. For non-legendaries, it's Phantump and Trevenant. There's really not much to say there. I love trees, I love good designs and lore, and I love the Baby Ghost Tree and the Angry Ghost Tree.", "label": 0}
{"text": "okay hats off to an OG", "label": 0}
{"text": "I have a stuffed Haunter and Gengar in the rear dash of my car 😈", "label": 0}
{"text": "It’s still supported until they communicate it is coming to an end.", "label": 0}
{"text": "fuck yeah", "label": 0}
{"text": "Well I don't really think he's in any way cooler than Blastoise, who is obviously the coolest pokemon from gen I as far as I'm concerned, but Charizard has always been the most popular starter and also most popular Pokemon card. It just seems like a natural choice.", "label": 0}
{"text": "own tempo rockruff is event only, so you cannot get it in-game. you must trade with someone who has it, be it via breeding or the original event", "label": 0}
{"text": "Eevee.  \nit has every base typing it's the perfect mascot.  \nPikachu only became popular as the mascot because of the Anime.", "label": 0}
{"text": "Alright! Thank you alot by the way", "label": 0}
{"text": "I love its design but I tried using it in a casual play through and it was quite disappointing, it doesn’t have a great physical STAB move and it’s slow and frail, I had to bench it when I got to the Blueberry Academy", "label": 0}
{"text": "think of the ? as a very big number. when it reaches ?00, it will count down to ?99 next.\n\nthey never planned for bank to be free, the timer is not updated to take into account bank becoming free.", "label": 0}
{"text": "Definitely but im tryna find a good but cheap one", "label": 0}
{"text": "weight + yes = yes", "label": 0}
{"text": "Yeah without the mega it’s really rough. It definitely needs to be buffed.", "label": 0}
{"text": "I'm not sure if you're counting spin-offs, but Dodrio is playable in pokemon unite, which is a bit more than the others in its category", "label": 0}
{"text": "I think the only bone for my sweet, sweet moth child is appearing somewhat prominently in the early S/V trailers. Like, on the level of Magnemite. It also got a GX card in the card game in 2019?\n\nI mean it’s more than Seaking and Dewgong.", "label": 0}
{"text": "Fun Fact: Until BDSP and Legends Arceus, the only game you could naturally find Glameow in(naturally as in, without extra methods like mirage islands, hidden grottoes, etc) was Pokémon Pearl. Not Diamond and Pearl, just Pearl, as a version exclusive. Its counterpart Stunky meanwhile got to be in BW2, XY, and SwSh", "label": 0}
{"text": "Assuming one has both the SwSh DLCs, can you Gigantamax Rillaboom as soon as possible? Like in the battle against Mustard’s Urshifu. Or is there some story related thing that you have to do b4?", "label": 0}
{"text": "Dawn wings necrozma", "label": 0}
{"text": "This supports the case that Venonat was supposed to evolve into Butterfree. They were so embarrassed by the mistake that they made it just not show up or get anything new.", "label": 0}
{"text": "If you wanna make a full living dex the best game are the Switch game, because breeding & leveling is so fast. ", "label": 0}
{"text": "I remember the ice gym leader in Johto had a Dewgong and he was a tough matchup with that rest and sleep talk combo and he was a water type so the fire type you had to fight the ice types wouldn’t work against him", "label": 0}
{"text": "I'd recommend Scarlet or Legends Arceus, mostly because I don't much care for the exclusive pokemon from Violet. \n\nScarlet and Violet are true open world pokemon games that have you embark on 3 main quests all across the Paldea region, you can see pokemon roaming around the region, and find about 400 different adorable and fierce creatures to add to your party. The characters you meet are also some of my favourites in the series, specifically Arven. Nemona, and Clavell. You're sure to have a unique adventure. It's the pokemon game I dreamed of as a little kid.\n\nLegends Arceus sees you travel back in time and be stranded in the Hisui region, a past form of the Sinnoh region. You get taken in by some kind people in Team Galactic, and be given the quest to help complete the first pokedex (a collection of notes on the pokemon that live in any region). They'll ask you to explore 5 large areas within the region and catalog all the different pokemon in them. You'll also meet some absolutely fantastic characters here, like Adaman, Irida, Volo, and Clayton. This game is more like a standard RPG than the creature collector game that pokemon usually is, but it's a breath of fresh air the series so sorely needed.\n\nThe Let's Go! games are also quite good, though I'd say they're the easiest and most little kid friendly of the bunch. They take place in Kanto, the very first region that was ever in pokemon, and you're taken on an adventure that is very similar to those first games. The main catching mechanic of the game is based on pokemon go, so there won't be any wild battles, you just get to throw pokeballs at wild pokemon. I really enjoyed playing it, but I never finished it, as it just wasn't that challenging.\n\nPokemon Brilliant Diamond and Shining Pearl take place in the aforementioned Sinnoh region, as they're remakes of the 2006 Diamond and Pearl games. They are faithful to the original, just with updates graphics. It's the most classic pokemon experience you can get on the switch. I am highly biased in liking this game, as it was my first way back when. The rival, champion, and villains are some of the best the series has, and the choice of pokemon you get are also really varied (except fire types, oops, there's only 3 lines you can get...).\n\nPokemon Sword and Shield also exist. I had some fun in my playthrough, yes, but ultimately I'd rather play any of the previously mentioned games. The story is rather bland and predictable, the battles are rather easy, and the characters are not really outstanding in any way (beside our punk queen Marnie of course). It's a very straight forward and railroaded experience, even for a pokemon game. But, it might just be a nice and relaxing first pokemon experience, as it's still a decent game. Plus, every other game you play afterwards is just gonna be better :)\n\n\nHope this helps! If you ever want to complete the pokedex for Scarlet or Violet I'd be more than willing to trade by the way, just shoot me a message.", "label": 0}
{"text": "Based, love those guys", "label": 0}
{"text": "I haven’t seen this, thankyou!!! Will be watching when I have the energy :D", "label": 0}
{"text": "NICE they’re so cute I love them", "label": 0}
{"text": "Haunter. But hard, as I heavily like basically all of them!", "label": 0}
{"text": "What could have been indeed... So, what's your opinion on the 'floater' it has along the waist? Some users have speculated that it's a tail it can unfurl at will and I agree it's probably the most plausible explanation.", "label": 0}
{"text": "There is no specific reason I can think of, they just are, and the most specific I can be is that specifically Pokémon Crystal is THE BEST Pokémon game ever made. Just play the game and you’ll understand. ", "label": 0}
{"text": "As i said, you wont miss any legendary just because you play the game. You still can beat the whole game and then catch them. You can catch them as early as possible and then beat the game. It doesnt matter.", "label": 0}
{"text": "Glaceon, Hitmontop, Trash Cloak Wormadam, Dusk Lycanroc, and Flapple. My boys :)", "label": 0}
{"text": "Thank you so much appreciate you so much", "label": 0}
{"text": "Omg how does this work?? I wasted 9 ultra balls and 5 great balls on a bombirdier with 1hp and paralysed. Use 1 regular pokeball and he's caught. Makes no sense!!", "label": 0}
{"text": "And no other weaknesses :3", "label": 0}
{"text": "A fair few of the motorway services in the UK have something similar (not quite that snazzy, has a selection of booster packs from recent sets), so I'll often buy the odd pack when I come across them.\n\nI do a lot of work driving up and down the country so I come across them fairly often.", "label": 0}
{"text": "https://preview.redd.it/whwn1yx6d2xd1.jpeg?width=620&format=pjpg&auto=webp&s=4ece7a06f284c90bdc0bfa301ff68196c596c554", "label": 0}
{"text": "Dunno why, but it reminds me of Ryuk from Death Note", "label": 0}
{"text": "Mismagius", "label": 0}
{"text": "Am I the only one who likes Goldeen and Seaking?", "label": 0}
{"text": "-Get an electric type. Iirc, he always has a Staraptor, so an electric type can deal with that and prinplup. I  think there are elekids in the windmill town, or just get a shinx or pachirisu. \n\n-Level up your Pokemon to evenly match with Barry(friend’s official name). \n\n-go online and learn about type matchups if you can. There are offensive and defensive sides and it’s pretty straightforward. I learned it from the games alone but searching online can speed up the process. \nPersonally, I recommend pokemondb.net because it is quite easy to use, just search “Pokemon db type matchup” and you should be good to go. \n\n-However, I don’t recommend checking any play through or gameplay guides, it makes the game less fun.\n\nPlatinum is my childhood, it was really enjoyable, keep grinding and have fun.", "label": 0}
{"text": "Nope, bc english is not my first language and neither was theirs, so it wouldn’t be pronounced the same at all in that case and I saw later that they also wrote it as eevee", "label": 0}
{"text": "I FUCKING LOVE MIMIKYU", "label": 0}
{"text": "If you have the DLC, you can feed a Snorlax Gigantamax Soup or get one from a raid in the Crown Tundra", "label": 0}
{"text": "Smart", "label": 0}
{"text": "Zorua, Hisuian Zorua, Zoroark, Hisuian Zororark, and Zeraora. I like the Zs", "label": 0}
{"text": "Ghost types aee definitely my favourite! Number #1 would definitely be mimikyu but honourable mention to misdreavous and froslass ", "label": 0}
{"text": "I may have just realized that ghost is my favorite type because i have no idea lol \n\nBefore this I thought fighting was my favorite but I have clear favorite in Infernape sooo", "label": 0}
{"text": "Chandlure line was my second shiny ever so it will forever have a place in my heart. The color change in the shiny is sick too", "label": 0}
{"text": "And that meanwhile it’s a really beautiful Pokemon. Very elegant.", "label": 0}
{"text": "Glameow is so forgettable, Game Freak angled its ears wrong on its 3D model in Gen 6 and had to fix it going into Gen 7", "label": 0}
{"text": "HAXORUS 🗣️🗣️\n\nhttps://preview.redd.it/ndxvsvwug2xd1.jpeg?width=936&format=pjpg&auto=webp&s=a7396523a00d0ba9b240c2536a181a865ea33b5a", "label": 0}
{"text": "Zangoose is better than seviper and i stand by this", "label": 0}
{"text": "unlike the mighty event in SV, the gmax pokemon in swsh can be caught more than once. there is a permanent wild area event that add all the gmax pokemon so you can keep catching them. else, use the soup method like shyrake said", "label": 0}
{"text": "Mimikyu and Marshadow!! My new favourite is Hisuian Zorua, normal x ghost typing", "label": 0}
{"text": "I'm currently using one right now in my Black 2, and i hope she will destroy Clay. The only thing that stops me from using it fully - bad movepool. Can't be a support role if you don't have support moves.", "label": 0}
{"text": "as long as you have dynamax unlocked which is very near the start of the game, you can always gmax pokemon if they have gmax unlocked", "label": 0}
{"text": "But now i can't pick the pack art for \"good luck\"", "label": 0}
{"text": "oh.. thank you for answering!  \n  \nIf i were to have an own tempo rockruff on switch(scarlet), can i trade between switch and 3ds? or do i need a kind of 3ds app for that.", "label": 0}
{"text": "Gardevoir, Gothitelle, Pheremosa, Meloetta, Selazzle, Lopunny, Tsareena, Jynx, and Delphox are some good options maybe", "label": 0}
{"text": "weed 👍‼️‼️", "label": 0}
{"text": "I think violet is better because you could fly on top of other people and steal the pokemon which they just fought😅😁😎👊💩😈", "label": 0}
{"text": "Mimikyuu for sure is my favorite ghost type, let alone one of my favorite top 5 mons ever. Gengar used to be my fav ghost type when I was younger, but ehh some obnoxious dude I met a long time ago sorta ruined it for me since it was his favorite....actually it seems to be a lot of people's favorite mon nowadays. Damn thing is too popular lol \n\n I also really like Banette.", "label": 0}
{"text": "There is no game where a Pokémon becomes unobtainable after a certain point.", "label": 0}
{"text": "Makes me want a stop motion animation of it,\n\nIt’s so good", "label": 0}
{"text": "It's just a shame they don't take cash... the two times I looked for a cash input for the thing, I haven't been able to find a spot for it. Second time was because I'd been real tired the first time and thought I might have missed it", "label": 0}
{"text": "and I think scarlet sux", "label": 0}
{"text": "Gengar . The OG spooky boi", "label": 0}
{"text": "This comment is awesome!😁😅👍😈👏😎👊😂👌🤝💕😍😀😃😄😁😆", "label": 0}
{"text": "“Named after their smell”", "label": 0}
{"text": "🇺🇸rules!", "label": 0}
{"text": "Bruxish", "label": 0}
{"text": "“We named you after your real dad”", "label": 0}
{"text": "Polteageist, the only Pokemon that learns both Shell Smash & Stored Power. But that may change if they release one with Shell Smash & Power Trip.", "label": 0}
{"text": "Adding to the unique abilities section: Weezing (both forms) got Neutralizing Gas, and they now make regular appearances in VGC.", "label": 0}
{"text": "My guess was Nidoqueen, so not too far off", "label": 0}
{"text": "Parasect to me is the number 1 choice. It isn't a very good Pokémon but ut has a really cool design and concept. I want it to have something.", "label": 0}
{"text": "my favorite ghost type is also my favorite pokemon that is litwick  also my top 5 are all ghost type 3 of which are the litwick line\n\nhttps://preview.redd.it/paf4cbq2j2xd1.jpeg?width=1021&format=pjpg&auto=webp&s=95ef0055e409e26950b0fc129df36603c6151656\n\nIDK who did this art but not by me", "label": 0}
{"text": "Starting my Journey in Pokemon Black 2. What Starter should I choose if I want Hugh to have his correct canon starter? I’ve seen in wiki he used both Snivy & Oshawott in anime. Which starter pokemon is Hugh’s most well associated with?", "label": 0}
{"text": "Cipher, hands down. They control almost the entirety of orre, and fund mostly everything in the region, their grunts are actually somewhat competent and admins are gnarly", "label": 0}
{"text": "Oh my.", "label": 0}
{"text": "No. I mean if this was intended, Charizard's arms would be connected to his wings. But they aren't. Because it wasn't intentional.\n\nThere is also the theory that Genosect is actually a Kabutops that has been modified. I also don't think this is true, but you might enjoy thinking about it.", "label": 0}
{"text": "For me it’s definitely Mismagius. I love her overall aesthetic and with a pretty decent move pool, she makes for a great addition to any team.\n\nhttps://preview.redd.it/zosj1co7m2xd1.jpeg?width=578&format=pjpg&auto=webp&s=ec0bbcfeacc92f0098a5122c0c44290c2c0dcbca", "label": 0}
{"text": "Heatmor. Most people ignore it over its rival Durant, but it can be string as well. Give him fire lash, rock tomb & assault vest and it can be a menace. Plus it can be an excellent switch in against fire types with its flash fire ability. Lastly, its design is dope and the shiny even more so.", "label": 0}
{"text": "Nidoking.", "label": 0}
{"text": "It's so amazing (◕ヮ◕)\\*:･ﾟ✧ I luv it so much!", "label": 0}
{"text": "No its not. but you could just change the tera type at the restaurant at medali. Prolly steel cuz that resists like every weakness hydrapple has.", "label": 0}
{"text": "[Just look how cute he is!](https://youtu.be/sRy8x6-mhgU?si=63z-IfYld2i2TIRn)", "label": 0}
{"text": "Thank you for posting to r/pokemon! We're glad to have you here, but unfortunately we've had to remove this post per our rule on [Objective Questions](/r/pokemon/wiki/rules#wiki_3._follow_text_and_poll_post_restrictions). This rule is in place per feedback we've received from the community because objective questions tend to fill the topic listing and often leave little room for further discussion once the question has been answered.\n\nWe do have a [Weekly Questions Thread](https://rpkmn.center/questions) dedicated to seeking answers for questions like yours, though! A lot of knowledgeable Pokémon fans frequent that thread, so please consider posting your question there if you're still looking for an answer, and you may get a detailed answer even faster than you would have here! You also don't need to worry about a minimum word count in that thread.", "label": 0}
{"text": "So young and already a furry", "label": 0}
{"text": "You are a gem man. IT WORKS SO FUCKING GOOD. IM SO THANKFUL", "label": 0}
{"text": "DP remakes are more similar to SwSh fwiw. PLA is vastly different but a very fun and good game nonetheless", "label": 0}
{"text": "I liked the lore expansion in PLA, but the world of SV felt so empty, lacking personality", "label": 0}
{"text": "I think the best option is to choose Tepig for Main Character bcs after looking into this, apparently Rosa will later appear as an npc as well and since she always picks the pokemon that is weak to our main character, it’s only right to let her have Snivy, Oshawott for Hugh & Tepig for us the mc.", "label": 0}
{"text": "Every pack I’ve opened has a holo and two reversals. Every single one from Scarlet Violet", "label": 0}
{"text": "Tell us what pokemon he uses and what attacks he has.", "label": 0}
{"text": "Nobody likes Milhouse!", "label": 0}
{"text": "No, you cannot move from switch to 3ds. You can only move from 3ds to switch one way direction", "label": 0}
{"text": "did it work?", "label": 0}
{"text": "Ever heard of Coralline? Because if they make a Pokemon version of Coralline, this is definitely the distorted other father", "label": 0}
{"text": "sure did!", "label": 0}
{"text": "DP Remakes are very loyal to the originals, even when it shouldn’t be. It’s a classic top down Pokemon game. Judging by your Pokemon experience, you will probably really enjoy these games. I feel a lot of criticism for them comes from the expectation as the remakes of Gens 1-3 were all significant improvements on the originals, which were all great on their own. Gen 4 ones are a graphics update. All that being said, Gen 4 games are great, best starters in my opinion.\n\nLegends Arceus is a vastly different experience, and I wouldn’t go into it expecting a typical Pokemon formulaic experience. If you want something closer to Sword and Shield, this is not it.\n\nLastly, if you haven’t checked them out, Sword and Shield have decent DLCs.", "label": 0}
{"text": "<3", "label": 0}
{"text": "I mean they are the same concept though, and to be fair trubbish, garbodor and comfey would have been pretty hard to do well on gameboy hardware, where as voltorb and magnemite work pretty well in early games and later ones.\n\nI think alot of the backlash against gen 5 was because it felt reductive of earlier pokemon and you couldn't use earlier pokemon until postgame, I reckon if they'd thought about divergent and convergent pokemon earlier it would have alleviated alot of the crisiticism around the gen 5+ designs.", "label": 0}
{"text": "Golurk", "label": 0}
{"text": "I know this is an unpopular opinion; but I don't like Annihilape. I *love* Primeape and refuse to let mine evolve. GF literally killed one of my favorite mons and I genuinely would have preferred they left the line alone.\n\nIronically, I also wish they'd do more with the Fearow line. A regional variant or a mega evolution or something; anything. So much potential left on the table only to be outshined by the Pidgey line.", "label": 0}
{"text": "I miss the days when 60$ for this game was expensive", "label": 0}
{"text": "unfortunately i think you’ve reached the part of pokemon where you have to start grinding. grind xp on the highest level routes you can, try to get more diverse typing in your team. i usually try to keep my whole team at the same level (and always a couple lvls above the highest lvled pokemon of my next big opponent), but idk if other people do that too or if they have an ace. if your ace is your starter, you’re gonna have to get another pokemon to match its level so that you can defeat the friend’s starter.", "label": 0}
{"text": "The timer is basically set to unlimited. But the timer can't handle unlimited.", "label": 0}
{"text": "It's pretty common to hit a point in a long shiny hunt where you start to question if you're doing something wrong - you just have to keep at it.", "label": 0}
{"text": "https://preview.redd.it/kinz542cz2xd1.png?width=475&format=pjpg&auto=webp&s=4efe96cb4232dd3bc52b87d3bf559f5ef20672be\n\nSpiritomb, the most evil of the Ghosts", "label": 0}
{"text": "Noice.", "label": 0}
{"text": "Mimikyu and Gengar", "label": 0}
{"text": "Gengar and pumpkaboo", "label": 0}
{"text": "2 major parts of my childhood in one. I looooove it.", "label": 0}
{"text": "Give my boy carnivine some love", "label": 0}
{"text": "dang", "label": 0}
{"text": "wait but Jynkx didn’t get any regional form", "label": 0}
{"text": "https://preview.redd.it/cbawmauoz2xd1.png?width=288&format=pjpg&auto=webp&s=611ff2ee13cf036623866b9813cb1ed357a1ec45\n\nThe original ghost", "label": 0}
{"text": "this is peak", "label": 0}
{"text": "Yeah I grew up on 1/4096 odds, so I couldn't tell if I did something wrong. But if you say that I'll keep at it, currently around 4000-5000 encounters", "label": 0}
{"text": "Chandelure, it's sooooo cool.", "label": 0}
{"text": "I have it and haven't used it since the first hour of Let's Go Pikachu", "label": 0}
{"text": "Misdreavus is best girl", "label": 0}
{"text": "I don't think Talonflame is a bad name.", "label": 0}
{"text": "All I can say is that the names teach you real words that relate to the Pokemon. The game teaches you English so I would happily let kids play Pokémon.", "label": 0}
{"text": "Who cares? It's there names. If you wanna give them a nickname, do it.", "label": 0}
{"text": "Only ever did one in FR/LG for the Kanto dex when I was a kid. This was before I even knew the Living Dex was an actual thing people did. I thought I was just being quirky.\n\nIt was a tad more tedious than fun though. And anyone who does this in the newer gens with the full national dex, Godspeed and good luck to ya.\n\nI will admit though, scrolling through my PC after the fact was hella satisfying.", "label": 0}
{"text": "So the answer is Fearow? That ugly chicken deserves it.", "label": 0}
{"text": "tldr I disagree with the title", "label": 0}
{"text": "I'm so salty we didn't get this. I love mudkip, but honestly, I would take warabbit over quaxly.", "label": 0}
{"text": "Definitely Hoopa. He's just a silly little guy :D", "label": 0}
{"text": "TLDR I disagree with the title", "label": 0}
{"text": "I keep forgetting that I’m literally taller than Charizard and Machamp", "label": 0}
{"text": "You kind of wasted my time there. It’s okay, but I’m done talking to u. What was the point of your comment? Weird.", "label": 0}
{"text": "Scale and bone according to the Pokédex. Sounds nasty lol", "label": 0}
{"text": "Hard question! I like so many of them. Maybe Phantump?", "label": 0}
{"text": "SwSh.", "label": 0}
{"text": "Dude is just a Talonflame hated and needed a vague reason for it. \nTalonflame is a great name. \n\nPidgey is just essentially pidgeon but with a y instead. Starly is a play on Starling which is a bird. Pidove is literally just pidgeon and dove combined. Swellow is just a play on Swallows which is more birds. \n\nIn summary, all the route 1 birds are simplist names even the evolved versions are still plays on the bird names they are loosely based on. Talonflame is probably one of the best names of the route 1 birds. So unless that person also hated all the route 1 bird names then their argument is moot.", "label": 0}
{"text": "I know everyone's going to pick Greninja, but I think Delphox deserves a chance at least", "label": 0}
{"text": "To be fair, many pokémon designs can be very abstract and thus I suppose it's up to individual viewers to decide if that 'floater's' indeed a tail wrapped around Warabbit's/Wallabit's body or a different appendage entirely.", "label": 0}
{"text": "I would say it depends on how we measure physical strength. Is it in terms of lifting or hitting? \n\nMany Pokedex entries mention that a Pokemon can destroy something with a punch/swipe of its tail/charging etc., but speed obviously also plays a role in this. For example Hitmonchan can punch through a concrete wall, but it probably can't lift much. It's punches are so fast that even a graze leaves a scorch mark, so it's most likely using its speed to punch the hole.>  \nSimilarly Machamp has megaton-punches so his punches are 50 times stronger than the Nagasaki bomb, but he can also punch 500 times a second, so speed plays a factor. He can move mountains with one arm, but is this with a punch or by pushing? In any case it's an incredible feat as a mountain can easily be 1-2+ billion tons.\n\nThen there's the fact that many pokemon can shoot something with incredible force without being pushed back. This would require them to be able to do an equivalent counterpush with their legs. For example Blastoise can shoot through thick steel plates with it's very wide water beams despite only weighing a bit more than 80 kg. This would probably be the equivalent of counter pushing a train driving at you. Its main cannon is even more powerful.\n\nThere are also some Pokemon that are so big that their incredibly strong by default. For example Ting-Lus head is apparently so heavy that even lowering is slowly to the ground would leave a 50m deep crater (this doesn't make much sense, though, as the Pokemon itself is only 700 kg).\n\nA lot have mentioned Regigigas, but his entries are all alledged, so he's out. Even so he'd be outperformed by Melmetal as his alledged entry says that his punch is the most powerful of all Pokemon.\n\nBuzzwole doesn't actually have anything to imply that he is amongst the strongest, plus he steals his strength from other Pokemon, so it's kind of a power.\n\nConkeldurr doesn't seem to have any particular (relatively) impressive feats of strength other than being able to throw his concrete pillars with ease, so he's not in the running for strongest.\n\n\n\nThe strongest in general are probably:\n\nMachamp, Grimmsnarl and Tyranitar.\n\n* Machamp because of the previously mentioned feats (he can also send an enemy flying all the way to the horizon with a punch).\n* Grimmsnarls entry says that with his muscles he can overwhelm even Machamp, so he must be stronger.\n* Tyranitar has the power to make mountains crumble with just one arm, but it's unspecified whether this is through prolonged effort or just one hit. In any case it's incredibly strong.\n\n\n\nIn terms of pure lifting I think Hero Form Palafin has the most impressive feat of strength as it says he can easily lift a cruise ship with one fin. A cruise ship could potentially be more than 200,000 tons \n\nOther much less impressive, but still very heavy lifts include:\n\n* Heracross can easily lift (and throw) 100 times its own weight, so about 5,4 tons easily. In megafrom it can do 500 times its own weight, so around 31 tons.\n* Tapu Bulu can uproot large trees and use them as clubs. A heavy tree could be anywhere between 1-10 tons or more.\n* Mudsdale can carry a load of 10 tons for extended periods of time, but it's a bit unclear whether it's on its back or in a wagon.\n* Braviary can lift a car while flying.\n\n\n\nSome impressive abilities where speed might play a factor:\n\n* Rhydon can topple a building with his tail, Nidoking can snap a telephone pole like a matchstick with his.\n* Terrakion can charge through a giant castle wall, Rampardos can topple a skyscraper with his charge and Bouffalant can derail a train with a headbutt.\n* Buzzwole, Pangoro and Darmanitan can destroy a dump truck with a single hit. Mudsdale can do the same with a kick.\n* Armaldo can punch through a steel slab and Carracosta can slap a hole in a tanker. As mentioned Hitmonchan can punch through a concrete wall.\n* Hariyama can send a 10-ton truck flying with a punch and it can stop a moving train with a slap.\n* Walrein can shatter 10 tons blocks of ice with a single blow from his tusks.\n* Sawk's karate chops can cleave the ocean (from the wind pressure I assume).", "label": 0}
{"text": "Sableye", "label": 0}
{"text": "And the Pokémon of Alola are GRRAT! I just wish they’d go back to how hand holding was done in the first two generations.", "label": 0}
{"text": "Can’t say I agree with the reasoning for Parasect. If anything, Dry Skin is the reason it saw any appreciation from fans at all, slotting it a niche in 2010 VGC Worlds as a way to counter Kyogre.", "label": 0}
{"text": "Eevee", "label": 0}
{"text": "Alolan Raichu is also so much cooler", "label": 0}
{"text": "Honestly I agree. I've been playing a lot of rad red and PokeRogue recently and they go pop up if they're activated, and it made me realise just how much I'm actually using them, even putting myself into situations where it procs to get a kill I might not have gotten otherwise.", "label": 0}
{"text": "Why you would give it any physical tms is a mystery", "label": 0}
{"text": "Spheal because round is life", "label": 0}
{"text": "Muk", "label": 0}
{"text": "Mudkip", "label": 0}
{"text": "Terapagos is the comparison to ultra necrozma", "label": 0}
{"text": "Quagsire, with Alcremie as a close second.", "label": 0}
{"text": "As a genwunner, mine ahs to be Gengar. I was made up when I finally got one as a kid.", "label": 0}
{"text": "for in game use it really doesnt matter honestly. competitive often use adamat and dragonite's moveset reflect accordingly such as using physical moves only.\n\nyou can use mild if you want to use it for special attack or mixed, but competitive often use rash instead.\n\neither way, i personally dont focus too much on nature for in game play.", "label": 0}
{"text": "Togepi!!", "label": 0}
{"text": "Alcremie looks so cute and delicious", "label": 0}
{"text": "https://preview.redd.it/il5opop9b3xd1.png?width=720&format=pjpg&auto=webp&s=9399d0271862472572938989b1161c7016ef3f6d\n\n\\-\\_-", "label": 0}
{"text": "Thx m8! I downloaded an melonds and platinum! You're a bro! Didn't knew this was possible :D\n\n(It's sad I have a switch but the characters look like nintendo Wii characters/ look childish)", "label": 0}
{"text": "The curly, indoor fire lamp. Love it to bits.", "label": 0}
{"text": "i like normal Raichu more because its less \"puffy\" looking, i like the sharp edges on its tail and ears", "label": 0}
{"text": "Nobody mentioned Marshadow, so here it is. Also Zeraora and Mewtwo the second best", "label": 0}
{"text": "Counterpoint Alolan Raichu is rippin on a fuckin surfboard", "label": 0}
{"text": "Sandile\n\nhttps://preview.redd.it/fyd0n0vmb3xd1.jpeg?width=300&format=pjpg&auto=webp&s=7a56226ab6c16a090b30eca0fd897ef78ed4477d", "label": 0}
{"text": "Cradily.", "label": 0}
{"text": "Platypus", "label": 0}
{"text": "Greavard. Just a cutie", "label": 0}
{"text": "Pachirisu surely", "label": 0}
{"text": "fair point lmao", "label": 0}
{"text": "i forgot how easy her gym was!! i haven’t played hgss since i was a kid, i was expecting there to be trainers at the very least", "label": 0}
{"text": "Thx, I played eevee let's go portable since I have the switch lite. \n\nI miss the battles and randomness vs wild pokemons in this game and already played pokemon yellow.\n\nSomeone here mentioned to download an emulator for Android phone, and I can now play pokemon ds platinum on my phone. Quite happy:)", "label": 0}
{"text": "They will let us know when it's going to shut down well in advance, but yes - transfer them rather sooner than later is the best advice.", "label": 0}
{"text": "Yup you right, someone here mentioned I could download ds pokemon platinum on android. \n\nSo can now freely play it :D", "label": 0}
{"text": "Yup you right, someone here mentioned I could download ds pokemon platinum on android. \n\nSo can now freely play it :D", "label": 0}
{"text": "Yup you right, someone here mentioned I could download ds pokemon platinum on android. \n\nSo can now freely play it :D", "label": 0}
{"text": "It just seems a bit boring for me to have all the starters have the exact same base ability instead of something that is more thematically fitting. People are basically always more interested in their hidden abilities because of that.", "label": 0}
{"text": "I might try it later, first gonna play pokemon platinum. Thx!", "label": 0}
{"text": "That’s a difficult one. I’m a massive fan of Ghost-types. I’ll say Phantump with Mimikyu and Banette as a sort of equal close second. I’m all for the little ones who need all the love in the world.", "label": 0}
{"text": "Raichu", "label": 0}
{"text": "i agree", "label": 0}
{"text": "Yes did that just now! Thx! :D", "label": 0}
{"text": "Swablu. It likes to clean things and be a hat", "label": 0}
{"text": "chansey", "label": 0}
{"text": "Smoochum. \n\nAnd technically there was a Mega planned for it that never materialized.", "label": 0}
{"text": "Guzzlord", "label": 0}
{"text": "I can't explain why but I really like Quilava, I just think he's cute as heck. I think it was from playing one of the older Mystery Dungeon games, and his lil world sprite made me feel cuteness aggression.", "label": 0}
{"text": "Mime Jr!", "label": 0}
{"text": "Parasect ghost/grass Evo pls and go for the creepy mushroom zombie vibe the earlier sprites had, don't make it some over designed mess", "label": 0}
{"text": "Azurill", "label": 0}
{"text": "Especially this anime, which is just completely doing its own thing ignoring almost all of the game canon", "label": 0}
{"text": "Squirtle Abra Mew", "label": 0}
{"text": "https://preview.redd.it/ny5jvuz0f3xd1.jpeg?width=1156&format=pjpg&auto=webp&s=05a770c15dbbd94c065fbdb987eb4f253dc35359", "label": 0}
{"text": "Cyndaquil", "label": 0}
{"text": "There are five actually.\n\nPatrat line, Pansear line, Pansage line, Panpour line and Furfrou", "label": 0}
{"text": "or maybe Torchic", "label": 0}
{"text": "By far Let’s Go. Not that’s it’s actually hard it’s just hard to play. Tedious catching system combined and grinding is annoying. Still fun though ", "label": 0}
{"text": "Yeah platinum is the best Pokémon game imo so play that instead but do check out Scarlet and Violet", "label": 0}
{"text": "Sprigatito! especially Liko's", "label": 0}
{"text": "Jigglypuff feels like it was designed by a committee to be as cute as possible.", "label": 0}
{"text": "Munna wins easily", "label": 0}
{"text": "Johto obviously.", "label": 0}
{"text": "Alola would be the one I'd want. 🥺", "label": 0}
{"text": "Oh it's litwick", "label": 0}
{"text": "Teddiursa and I don’t even think it’s particularly close", "label": 0}
{"text": "Yes I still have mine, no I don’t use it( it literally only works for the one game)", "label": 0}
{"text": "Bulbasaur", "label": 0}
{"text": "Johto, Hoenn and Unova are definitely the best candidates, they feel the most in-depth of the regions when it comes to the lore. Kanto and Johto could even be combined since they're next to each other", "label": 0}
{"text": "Completely agree", "label": 0}
{"text": "Especially adding the relationship it has with Khangaskhan", "label": 0}
{"text": "I always felt Lapras was neglected! The blue shellos looked it should have been its baby evolution ", "label": 0}
{"text": "Johto, a Legends: Celebi would be cool.\n\nOr perhaps we could get a Hoenn one centered around Jirachi (who hasn’t gotten enough lore like the other hoenn legendaries/mythicals)", "label": 0}
{"text": "Jigglypuff", "label": 0}
{"text": "Why the downvotes guys", "label": 0}
{"text": "Unova certainly not since he next remakes are the gen 5 remakes...i believe johto should get the next legends game", "label": 0}
{"text": "Unreal! 10/10", "label": 0}
{"text": "Do NOT look at the X/Y stuff from the Teraleak. It might just break your heart.", "label": 0}
{"text": "Magnemite", "label": 0}
{"text": "Either Kanto or Alola. Kanto desperately needs some more lore, while Alola is pretty much made for the concept.", "label": 0}
{"text": "I cried at Stufful so...", "label": 0}
{"text": "ah, well, i just searched it up and i see that they started repairing them for free in europe (or at least where i live) only since april 2023 lol", "label": 0}
{"text": "Piplup. My girlfriend calls him Plup Plup. We love him sm\n\nhttps://preview.redd.it/geldazq8i3xd1.jpeg?width=600&format=pjpg&auto=webp&s=b6f1d44dc5b33e83c33eeb2728c072ab105d8ca1", "label": 0}
{"text": "Though this is the first time ever hearing this myth, and I've been playing since the original GameBoy games, this seems to have some validity. Would be cool if this were confirmed by Soujimori himself if this is a thing or not. Epic find btw!!", "label": 0}
{"text": "But wouldn't it make sense to have it with the remakes, the remakes could be like a refresher to then move on to the new story in the Legends game, and they are gonna have to do a good remake either way because the artstyle of BW can't even be done in the same way as gen 4 remakes, well that is, if they do the remakes at all, cause even the gen 4 remakes were a last minute thing and they were just gonna do a legends game", "label": 0}
{"text": "Unova, I want to know about the original dragon", "label": 0}
{"text": "Galarian ponyta and alolan Vulpix are perfection and i will throw muk at anyone who disagrees", "label": 0}
{"text": "Unova. I honestly would’ve rather went to that and kept Kalos for later.", "label": 0}
{"text": "I found Garfield’s Reddit account everyone!", "label": 0}
{"text": "Look at all the jealous stuffies in the claw game 🥹", "label": 0}
{"text": "https://preview.redd.it/g1g3ih7pj3xd1.jpeg?width=640&format=pjpg&auto=webp&s=c85a754cffda99fb57ff09d79babbf0901be98eb", "label": 0}
{"text": "https://preview.redd.it/o2ef5yuqj3xd1.jpeg?width=1080&format=pjpg&auto=webp&s=39cb81991e6274cadbc10b93c2e2c3220e8e516e", "label": 0}
{"text": "https://preview.redd.it/f8du0qhuj3xd1.jpeg?width=576&format=pjpg&auto=webp&s=04edb838bbbafbe312b90bad4762d0bf4bb87c29", "label": 0}
{"text": "I use the Autumn BB Uniform, it looks nice with the rest of my accessories! I feel like it’s one of the more neutral/boring ones but that’s why it goes well with a lot of other clothes.", "label": 0}
{"text": "https://preview.redd.it/tuc91f13k3xd1.jpeg?width=580&format=pjpg&auto=webp&s=96848c0445eb3060142a6fabd31eb590c434b4e5", "label": 0}
{"text": "https://preview.redd.it/6g2l1idck3xd1.jpeg?width=561&format=pjpg&auto=webp&s=81a6a275baece284c549079ff13ce0f8e9664948", "label": 0}
{"text": "Skitty", "label": 0}
{"text": "Out of my fav's evolution lines, it's Petilil or Surskit.", "label": 0}
{"text": "The average person screaming for a Greek Pokemon game will be sorely disappointed. The fuck does Anything in Paldea have to do with Spain? Other than a football aesthetic, the hell does Galar have to do with Britain? It gets worse the further you go back! Kalos has some fashion obsession, but what does Unova have that makes it American in any distinct way? We'll get maybe one Greek Mythology pokemon, and that would be it.", "label": 0}
{"text": "So you hate hamburgers?", "label": 0}
{"text": "https://preview.redd.it/sznhfzujk3xd1.jpeg?width=856&format=pjpg&auto=webp&s=d5ee384e206d540497757485fd9feb6668c0de87", "label": 0}
{"text": "Spheal. Spheal is a friend.", "label": 0}
{"text": "Charmander\nSandile\nPhanpy\nLitten\nQuagsire\nPsyduck", "label": 0}
{"text": "Bro just played through the Pokemon Fire-Red Rocket Edition (first time playing Pokemon in years after leaving mid-Diamond). Loved the story. Great explanation to what happened to Agatha (obv. fan-made but it's amamzing).\n\nMind-blowing story along the way showing the behind the scenes, highly recommend.", "label": 0}
{"text": "Honestly sandshrew or totodile for me", "label": 0}
{"text": "Evoli!", "label": 0}
{"text": "Froslass player here. She’s my always my go-to and if she’s in-game I’m hunting to catch her as soon as possible.\n\nhttps://preview.redd.it/1poxqhoel3xd1.png?width=733&format=png&auto=webp&s=dce5794777a3ed2a1b5598b6a431b536499b443b", "label": 0}
{"text": "I forgot Oshawott omg", "label": 0}
{"text": "https://preview.redd.it/87xb92gfl3xd1.png?width=245&format=png&auto=webp&s=36f8e53a9f5adcd3f004543ba10f44e40b6d8228\n\nI also like Dhelmise, Cursola & Haunter.", "label": 0}
{"text": "I would LOVE a baby lapras evolution.", "label": 0}
{"text": "https://preview.redd.it/3kn6hc0nl3xd1.jpeg?width=766&format=pjpg&auto=webp&s=7401db1b282a5bbbb3e27a250cb1cd1f5a8237b3\n\nNo contest", "label": 0}
{"text": "Honestly, it becoming Ghost/Psychic would’ve also made sense when it evolved into Mismagius given its move pool", "label": 0}
{"text": "https://preview.redd.it/ucs4f3izl3xd1.jpeg?width=576&format=pjpg&auto=webp&s=26e8a8e9d8573fac2f407d52f52e729c11b606cc\n\nThis little boy 🤍", "label": 0}
{"text": "Cyndaquil and Sprigatito", "label": 0}
{"text": "Honestly, great concept. Personally, when I thought of a scizor-mimikyu, i thought of it more posessing/wearing the empty shell of a scizor, but the shell maybe cracked ans worn, like Mimikyu is tryin to hold it together", "label": 0}
{"text": "Togepi", "label": 0}
{"text": "If youve never played diamond pearl or platinum, you probably wont understand much of legends arceus’s plot. You might be better off playing BDSP (the remakes) or just platinum first. Comes down to if you’re comfortable emulating or not ", "label": 0}
{"text": "Tbf they nailled japan....all 4 times...who would expect that from a japamese company", "label": 0}
{"text": "IT'S GONE.", "label": 0}
{"text": "I don't understand why it would be Johto. \n\nLike, the Legends ganes are clearly supposed to be about \"that one legendary/mythical who never got anything\". Mew would be a far better choice than any of the Johto ones.", "label": 0}
{"text": "Jynx is a weird case that barely scrapes by.\n\nI doesn’t show up on lists like this because of Smoochum, whose inclusion was decided before the controversy. It hasn’t got anything since Smoochum, despite both Kanto groups it belongs to (Magmar/Electabuzz elemental trio, Mr. Mime humanoid Psychic duo) getting evolutions/regional forms.\n\nIt was included in the Sword/Shield Pokedex, and was known about early, sparing it from being used as a “We’re never seeing this again” Dexit mascot.\n\nIt also occasionally appears in spinoffs as Pokedex filler, even in games that don’t have every Pokemon, but never as something that would have the spotlight (so it’s in games like Ranger, not Pokken).\n\nIt’s in the perfect zone of obscurity - never getting anything notable, but also not left out enough to be notable.", "label": 0}
{"text": "Totodile I get but sandshrew is kinda crazy", "label": 0}
{"text": "Jirachi", "label": 0}
{"text": "Love it", "label": 0}
{"text": "I mean. Arceus came out at about the same time as the gen 4 remakes. It wouldn’t be that weird for them to do legends Kyurem after.", "label": 0}
{"text": "Cufant and Cutiefly. It’s in their names!", "label": 0}
{"text": "https://preview.redd.it/6qho49e4r3xd1.png?width=1227&format=png&auto=webp&s=d3828a8e7a18f0ccfcfb4962eae3043736fa5c45", "label": 0}
{"text": "Legends Arceus", "label": 0}
{"text": "I kindle hope after the last few years, the remake era is over. Unova could see the start of old generations getting new games instead of remakes, with a BW3.\n\nHow could would it be if we got new 2D games to revisit old generations and regions, whilst getting 3d games to explore Legends and new gens?\n\nWe haven't had a good remake in the longest time now, so let's just stop wasting resources that could be put towards new content.", "label": 0}
{"text": "I have put some thought into an Alolan Legends and I would love to see an undisguised Mimikyu as the big bad and and get dolls that they possess for different stats/purposes", "label": 0}
{"text": "ORAS were pretty good ...no?", "label": 0}
{"text": "https://preview.redd.it/7e345j1or3xd1.png?width=2732&format=pjpg&auto=webp&s=3c92bb39f9ebac2d24e987b4637eba02f91d28f7\n\nMismagius", "label": 0}
