{"text": "It's very clear that Nitanic and Nintendo wantes more money but to set a price on somthing like that is not cool. I think costummes should be free in events like halloween. What do you guys think about this?", "label": 1}
{"text": "I Just created a new acc and I have nothing to lose", "label": 1}
{"text": "How dumb can one corp be srsly. What are they thinking ? Oh yeah lets go to Facebook and write to everyone hey lets raid as 40 ppl at Spot xy where everyone has to get to. As if i have nothing better to do, get a grip niantic", "label": 1}
{"text": "I think we need to create an app where spoofers show up at your location, like a spoofer pokiegenie where you get help from spoofers but don't have to spoof yourself.", "label": 1}
{"text": "Spoof ur vpn or sum?", "label": 1}
{"text": "Because why would anyone ever admit to cheating and obviously people love to bash Niantic on their way out the door.\n\nGood riddance", "label": 1}
{"text": "weird im hardcore cheating and never even got a single warning", "label": 1}
{"text": "Not wasting my time with this terrible mechanic, dumb we can’t use existing Pokémon and d/gmax them", "label": 1}
{"text": "One that's so fucking accurate it wooshed right over your head I guess.\n\nGame's dogshit. All people do daily on here is fucking complain. Uninstall if you don't like it. Otherwise it'll continue to get worse.\n\nDo you wanna borrow some braincells to comprehend it? Seems like a pretty straightforward sentiment.", "label": 1}
{"text": "Lol. I've cheated on my account when the game came out (location spoofing) and my account isn't banned.", "label": 1}
{"text": "Cheat less", "label": 1}
{"text": "I spoof all the time and I'm not banned. This sucks.", "label": 1}
{"text": "Lucky? Have you been huffing gas? This is a property that is tied to one of the biggest things that has hit our planet in a century, pokémon is known all over the world and is celebrated and enjoyed all over the world And has wormed its way into multiple cultures and other IPs. You think it was luck to take this idea that was well established for well over a decade and put it in a mobile app and give everybody access to it? You have definitely been huffing gas....\n\n\nNo one gives a crap that the game isn't catering to your individual tastes, tens of millions of people play this game every hour all over the world. They measure their profits in billions, something that many countries around the world can't claim. You and your small minority don't like it? Oh well, the rest of us do so kick rocks 🤣\n\nOh was there a feature that was buggy for a little while And you thought it should be perfect? Can you name one video game that isn't buggy at all for anyone? Go ahead. I'll wait.... That has never happened in the history of gaming, all games have some kind of bug or inconsistency or problem and the fact that this game is played all around the world by literally hundreds of millions of people and it works for Soo many different languages, software and hardware differences is a miracle. Have you produced anything even slightly on par with what this is doing? You sound like a spoiled baby who has no idea how video games or even societal rules work. \n\n\nOh, you have to actually go outside and interact with other people and the world in the game whose primary focus is to get you to go outside and interact with other people and the world? Shocking!  I don't know what game you're playing or what tools you're using but You are not playing the game as it's intended to be played, nor are you supposed to be using those tools that are allowing you to fly wherever or trade wherever or do whatever the heck it is you think you should be doing. If you don't like the game as is, stop playing it, go play something else or go do your bug catching, but don't think that you speak for the hundreds of millions of other players that enjoy the game, nor should the company that owns it, invests in it, and puts their love and care into it should listen to anything YOU who does nothing to contribute anything meaningful to the development and continuation of the game has to say.\n\n\nStop huffing gas...", "label": 1}
{"text": "No, I read it, and you're complaining about something that you contribute literally nothing to and that many people asked for and that is newly implemented. My comprehension skills are fine, yours are lacking.\n\nI replied to your junk comment in other comments as well.... I clicked on a Blastoise and got a warning to have at least 30 people with me, but you seem to think you're special and because you and your (12?🤣🤣)buddies have been kicking butt the last couple of years, you should be able to crush anything including the new system that they implemented purposely because millions upon millions of people wanted harder things for them and their friends to do. They also wanted ways to get people to go out and interact with each other somewhere near levels that they used to years ago and that's also what this feature is doing. I understand this, you have lacking comprehension skills.\n\n\nYou don't like it, too bad, don't use the feature just like millions of people don't use a lot of the features in the game and still play (There are people that don't battle or don't do raids or don't trade or don't do routes, etc) And enjoy themselves. If you can't find enjoyment then kick rocks. But when you cry like a little girl because you're not getting your way, don't be surprised when people like me poke at your BS.", "label": 1}
{"text": "You need an auto-walker.", "label": 1}
{"text": "Hey everyone I found a 🤡", "label": 1}
{"text": "Because people don't evolve their pokemon nor increase the Dynamax skills", "label": 1}
{"text": "Max raids in general are just so unbelievably stupid. You’re forced to use shit Pokemon to get slightly less shit Pokemon, and all for shit rewards. And then they have audacity to prompt you to pay $2 just to double the amount of shit that they shove down your throat. Then you have to spend hundreds of candies and a bunch of stardust just to make those Pokemon even semi useful, but only if you use them in max raids. Oh, and they’re in-person only. AND THAT’S JUST FOR DYNAMAX. After that, you get to do G-max raids, a complete carbon-copy of the aforementioned battles, but about 120x harder so that you need ~30 people just to have a *chance* at beating them. Oh, and they’re STILL in-person only. And then you get to do it all over again, because the Pokemon you get are only useful in max battles. And all this, FOR THE SAME SHIT REWARDS! \n\nWhat a joke.", "label": 1}
{"text": "Skill issue", "label": 1}
{"text": "Get good", "label": 1}
{"text": "If you know how to read, it was already answered\n\nYou responded with the same answer except less detailed, then added a passive-aggressive ellipsis\n\nSon is a bozo", "label": 1}
{"text": "No its not unless you are super rural. Use camp fire dum ass to join a meet up or host one", "label": 1}
{"text": "Was out for a walk and playing when I got the notification of my account being terminated. I had strikes years ago from spoofing admittedly.but have been playing legit since. Currently lvl 44, almost 45. So I'd be gutted if it was true. I immediately sent in a ban appeal, and got the generic bot reply saying I went against the terms of service\n But withing 10-15minutes, was able to get back into my account like nothing happened.", "label": 1}
{"text": "B+ trolling, nobody is spit shining corporate boots this hard unironically, but good effort. \n\nI’ll continue to complain and so will everyone else until it changes/even if it never changes (people still complain about remote raid changes to this day, for example), I’m not sure what you’re under the impression you’re accomplishing crying about other people complaining? What is the point of your post? Just because it’s a children’s mobile game doesn’t mean it is automatically shielded from criticism or complaints nor does it make it a waste of time. \n\nIIRC, mega energy was bitched about ad nauseam, we had a couple of morons bumming around telling people to stop complaining, and then it eventually got changed. I don’t have proof that the complaining helped cause change, nor do you have proof that it didn’t. \n\nI guess my point is that you’ll be ok if you don’t go out of your way to read and respond to posts about people complaining about the newest thing in the children’s mobile game, but be my guest :)", "label": 1}
{"text": "Based Niantic. Cope and seethe rural-cels.", "label": 1}
{"text": "Ahhh so you need to spoof to Seattle. Got it.", "label": 1}
{"text": "Where in dublin had that many people to do the raid?!?!?!?!?!", "label": 1}
{"text": "RIP backwoods pogo players", "label": 1}
{"text": "I wish you actually got invited to parties so we could see how fun you are at one.", "label": 1}
{"text": "Well at least I can was other people have fun. No one around here playing. I don't think I'd get 5 players together let alone 40. Think it's time to just start spoofing till I get banned and move on to a better game.", "label": 1}
{"text": "Looking at your pist history you're one hell of an unlikable person. Karma's gonna do it's job :)", "label": 1}
{"text": "Have you spoofed before? 😮", "label": 1}
{"text": "https://preview.redd.it/6zb7aen3jgxd1.jpeg?width=1080&format=pjpg&auto=webp&s=ff5ed5ea02d704e6484b72bf9d3b7f796c7a41b1", "label": 1}
{"text": "You're the only person ive seen do it, unreal dedication haha", "label": 1}
{"text": " I'll likely never have a gigamax.", "label": 1}
{"text": "I caught a shiny piplup and a shiny Pikachu, I'm glad I caught them", "label": 1}
{"text": "Oh! I feel like you could be talking about me except that it’s highly unlikely that you live in my neighbourhood (in Copenhagen, Denmark).\nMy daughter and I each have our own account but the trainer names are very similar.\nI carry her phone with me all the time (she’s 7 and only allowed to play at certain times during the week) to hatch eggs and if I takeover a gym, I will put one of her pokemons there as well (because free coins and more gym hours for platinum medal). Perhaps that’s also the case for the person you see? I must admit though that it’s bad manners shown by said person to take over a gym when the team hasn’t had it for 8 (ish) hours.", "label": 1}
{"text": "No it won’t be. This is a community based game, if you don’t have a community around you then it MAKES SENSE that you can’t get every single feature completed. \n\n\nIf you want the ability to unlock everything, go play a solo Pokémon title on your switch. This game is MEANT to have features that can only be done with decently sized communities, you are NOT entitled to everything if you only have three players near you. \n\n\nReddits sense of entitlement is insane", "label": 1}
{"text": "If you think the only data they gather is revenue you are 100% under the age of 18 and are talking out of your ass. Niantic does not make any balance changes because of Reddit posts, I’m sorry dude.", "label": 1}
{"text": "I did none of the Gigantamax raids and I am doing just fine", "label": 1}
{"text": "I see people posting their winning pokemon. I see people gather in groups of 100+. \n\nI see no problem. You’re making it a problem for you. Change is not admission of guilt.", "label": 1}
{"text": "What pathetic cope from an entitled moron", "label": 1}
{"text": "Only have the spirit mon so far..", "label": 1}
{"text": "I'm not too sure about this ( it might be outdated news ) but you might still get banned because of spoofing ( they concider it cheating )...I am so sorry about your condition and hope you recover fast!", "label": 1}
{"text": "I'm not too worried about the spoofed account being banned, I just wanna play while I can't walk for a few months. Have you any idea if my main account will be banned as it's on the same device?", "label": 1}
{"text": "Nah probably not first time they give u a 7day ban. Then 30 then permanent ban. But after the update they can check your device. But 3rd party apps on your device will get you instabanned. Got to use a laptop and spoofing software nowadays. Everywhere spawns the same stuff tho just fyi. Don’t really see a point to spoofing nowadays other than raiding but that mechanic is what gonna gets u banned the quickest. I used to just love playing in the other cities. Pretending to be there you can really learn a whole city spoofing lol", "label": 1}
{"text": "Tru if you follow basic spoofing rules you should be ok. If you try to use the auto throw or auto walk or joystick or raid you’ll get the 7day. Best to just catch spawns. I see people spoof raid all the time don’t know the ins and outs tho couple of the new mechanics might give you problems. Facebook got a spoofer page they can probably give you the deets", "label": 1}
{"text": "Didn’t bother. Would have liked to but no chance I’m getting 2 players to team up let alone 20+", "label": 1}
{"text": "No it is not. Definitely a child lmfao. Grow the fuck up and don’t bitch on Reddit about every small issue, especially ones you choose to perpetuate", "label": 1}
{"text": "Word...", "label": 1}
{"text": "Lol nice. I had to mod my go plus, ripped out the spinning vibrating part inside it. Drove me crazy, it’s sooo much better now. Pretty easy to do", "label": 1}
{"text": "Your submission has been removed. Please check the current **stickied megathread and/or megathreads on the subreddit's sidebar/menu** as well as **[in game news](https://pokemongolive.com/post/?hl=en)** and [this link](https://www.reddit.com/r/pokemongo/comments/pnlmhw/extremely_common_questionstopics_and_their_answers/#button) (both of these can found on the subreddit). This topic has been submitted and discussed multiple times.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pokemongo) if you have any questions or concerns.*", "label": 1}
{"text": "Oh buddy, lets switch it around. Grow the fuck up and let people enjoy things. I didnt say you are horrible, I said you are a sourass no fun police which i stick to.\n\nI also like how you just rolled over to play the victim card. You do not get that. Grow up.", "label": 1}
{"text": "Shut the fuck up.  Everyone else did too", "label": 1}
{"text": "Average", "label": 1}
{"text": "Dm", "label": 1}
{"text": "Here's a fact: you're being a bitch", "label": 1}
{"text": "Then again, you write like a goblin whose toy has been taken.", "label": 1}
{"text": "Bonnie and Spunky will always be with us in spirit. Happy walking!", "label": 1}
{"text": "Cavalier King Charles are such loving companions. You'll create new memories together!", "label": 1}
{"text": "Drops a picture of your Dynamx mons wanna see if you are actually relevant in the matter or just crying because everyone is doing it", "label": 1}
{"text": "This is really both heart-wrenching and adorable", "label": 1}
{"text": "Doggy will always smile under this beautiful sky. This is beautiful.", "label": 1}
{"text": "This is heartbreaking and also so adorable. Bless you and your dog...", "label": 1}
{"text": "In other Reddit’s people say they can fly or can’t fly so I’m hoping someone can or lives close to", "label": 1}
{"text": "Are you able to spoof ?", "label": 1}
{"text": "I'm sorry for your loss; this is really touching. This game can be frustrating, but every so often I see a post like this, and it makes me glad it's around.", "label": 1}
{"text": "No it doesn’t. You don’t have to think so deep into it", "label": 1}
{"text": "Bet your dog would love being part of your Pokémon adventures", "label": 1}
{"text": "your parents wish they never made you", "label": 1}
{"text": "This is peak Pokémon humor—love the creativity!", "label": 1}
{"text": "Niantic themselves came out a few days ago and admitted the ban wave was mostly mistaken. Don’t be an obtuse ass to the people this is affecting.", "label": 1}
{"text": "ShiNundo! That’s special!", "label": 1}
{"text": "Can someone send me an invite", "label": 1}
{"text": "wheres meowth haha", "label": 1}
{"text": "lucky!", "label": 1}
{"text": "meowth a professional cosplayer", "label": 1}
{"text": "awww this warms my heart", "label": 1}
{"text": "we applaud this kind of dedication!!", "label": 1}
{"text": "I have been playing since 2016. Had a couple years break but that’s genuine.", "label": 1}
{"text": "I didnt know so stop being a smartass prick", "label": 1}
{"text": "https://preview.redd.it/ucw9n20br9yd1.jpeg?width=1290&format=pjpg&auto=webp&s=7ff0ae272e726b7e6f7534d1b0cadf6be5bb5c83\n\nI’m not mad. But I wanted Rowlet so bad, green is my fav color", "label": 1}
{"text": "The more comes out about this stuff I tend to believe conspiracy theories minus believing D Trump is the saviour though. I still think he’s an idiot but it’s really getting quite weird with Hollywood and their friends now and LeBron said once that there is no party like a Diddy party on a FT call with Diddy so I don’t believe he didn’t know something or seen something but didn’t want to give up the fame and $$$$$$$ hence he kept quiet. I love Leo Di Caprio but he hung out with Diddy more than once and he dumps his gf’s when they reach their mid 20’s. It’s just plain weird for a 51 year old. They are all dodgy imho but this is really not the right sub to discuss this. Sorry admin pls delete this comment if not allowed", "label": 1}
{"text": "spewaddle", "label": 1}
{"text": "r/pokemongobrag", "label": 1}
{"text": "The fairy one", "label": 1}
{"text": "flex it because why not??", "label": 1}
{"text": "cats cats cats", "label": 1}
{"text": "![gif](giphy|UiH6lsIgUhZU7uNKFR|downsized)", "label": 1}
{"text": "how lucky!!", "label": 1}
{"text": "yes she issss!!", "label": 1}
{"text": "Congratulations! that's even rare that regular hundo.", "label": 1}
{"text": "They are shiny hunting to sell to other players", "label": 1}
{"text": "PoGo really just be making shit up 😂", "label": 1}
{"text": "Love that yours is smaller yet somehow only xs versus my xxs gimmighoul 😂", "label": 1}
{"text": "No we tied 😂", "label": 1}
{"text": "Transfer him", "label": 1}
{"text": "Please get a fucking life you idiots…", "label": 1}
{"text": "I wish one of these days I can be so lucky", "label": 1}
{"text": "That might be the best out of everyone so far. Congratulations on a unique catch!", "label": 1}
{"text": "138881427891 add me", "label": 1}
{"text": "Hey it seems like you pink-lovers attacked wobuffet. Leave him alone you monsters", "label": 1}
{"text": "That is just the previous level, not total.", "label": 1}
{"text": "Friend code", "label": 1}
{"text": "Yes. If you’re tanking don’t be an ass it’s not that hard. Thanks", "label": 1}
{"text": "It doesn’t make them more rare or anything, I’m not sure what exactly it accomplishes?", "label": 1}
{"text": "And you double down and get twice as immature and douchey.  Haha well done ", "label": 1}
{"text": "If anyone wants mine and wants to fly in a Rocket balloon to trade me for it, you’re more than welcome to.", "label": 1}
{"text": "WTF is that weight 😂😭", "label": 1}
{"text": "This is pretty bad ass!", "label": 1}
{"text": "Are u guys just catching like 5 pokemon a day lmao? The only reason to not be getting any shinys is just not catching enough or at least not clicking on enough pokemon. I may sound like an asshole because sure it’s all just RNG but I got like 24 shinys because I caught about 8k pokemon during the two weeks it’s definitely crazy if I did all that and got 0 shinys but if you are catching enough pokemon and playing enough at a certain point you will get a shinys", "label": 1}
{"text": "His computer and CNC are. He just likes to push buttons", "label": 1}
{"text": "I think China already does the same thing.", "label": 1}
{"text": "Buy the same things from China for less. He's not hand making these. It's all CNC and show", "label": 1}
{"text": "Higher than finding a stupid G bird. I'm totally not bitter. 😑", "label": 1}
{"text": "Sick ass family. 🫡💪🏼and alright 37. I’m almost there. 2 more levels.", "label": 1}
{"text": "Megumi ass post", "label": 1}
{"text": "Not to be an asshole but this is ur own fault lmao you had two weeks to collect one days worth of particles", "label": 1}
{"text": "You know at first it's funny. Now it's kinda fucking weird that mods are allowing jokes about donestic sexual abuse exist in a subreddit aimed at children.\n\nMakes you wonder about the mod team.", "label": 1}
{"text": "The comments do not disappoint", "label": 1}
{"text": "Heck yeah 💪good on you! I also have ADHD and for some reason the pandemic flipped a very similar switch inside me, so I definitely understand this, am inspired/motivated by it, and am proud of you for kicking ass", "label": 1}
{"text": "![gif](giphy|pUVOeIagS1rrqsYQJe|downsized)\n\nYall need Jesus", "label": 1}
{"text": "That’s lowkey a sick glitch, did it stay like that?", "label": 1}
{"text": "I wasted so many golden razzberries on that fucker. Finally on my last ball I closed my eyes and prayed to the Pokémon gods and by some miracle I caught it.", "label": 1}
{"text": "How's Niantic's ass smell? You're so far up their ass I bet you can smell their toothpaste.", "label": 1}
{"text": "I finished this a year ago. (Hey, if you can brag I can brag too!)\n\nCongrats though. The whole thing was a pain in the ass.", "label": 1}
{"text": "I just googled “sad ghost” looking for some generic ass picture but this kind of thing kept coming up, guess it’s a thing, hopefully no one cares I used this.. 😳", "label": 1}
{"text": "Do I need to draw this out with crayons? The poke-coins are free. No one said they aren't. The issue is that this is not a \"free $5.\" By this logic you would grind gyms for days and say \"I just earned $5\" which is psychotic", "label": 1}
{"text": "Kindly go fuck yourself. Everyone on this sub likes being condescending as fuck over a free to play Pokemon game.\n\nNo, I would not say I “earned $5”, but I would absolutely say I “earned $5 worth of free coins.” The devs are giving you free shit for a minor fuck up they did, and you’re on here bitching about it. Go hug your family or something, jfc.", "label": 1}
{"text": "Sorry, I wish the mods would have made a pin announcement.", "label": 1}
{"text": "My recommendation is to maybe make friends with a spoofer and map out a route with them there’s tons of discord groups out there you can ask about", "label": 1}
{"text": "Unless you bought something, no company is just going to give u money. It $5 worth of in game currency, if you can't get that in your head then maybe u were dropped as a child. Just stop replying and leave your idiocy away from my eyes.", "label": 1}
{"text": "I live with my big brother, him and his kids all play haha", "label": 1}
{"text": "Do you take every single word you hear 100% literally? Fuck off.", "label": 1}
{"text": "I hear they have chlamydia.", "label": 1}
{"text": "Garbodor doesn’t stand a chance against such a cute Pokémon!", "label": 1}
{"text": "Congratulations!!!", "label": 1}
{"text": "Murder is women's rights. I get it...", "label": 1}
{"text": "It's unfortunate you cannot comprehend banging makes babies. Those babies didn't ask for mom and dad to be tarded", "label": 1}
{"text": "Have you tried not murdering a baby? It's kind of normal", "label": 1}
{"text": "Anyone that votes Harris and sends me proof will recieve $50 on cashapp.", "label": 1}
{"text": "Ha!   Fuck you", "label": 1}
{"text": "Cuntmala.", "label": 1}
{"text": "Yeah Creepy Kid Sniffer Joe called the patriots of this nation garbage. I agree that did happen, and it shows how $h!+y of a person you are posting this GARBAGE in a PokemonGo group. I'm not in this group to deal with emotional democrats opinions. MODS take this $h!+ down.", "label": 1}
{"text": "classical American with a head up their ass. just so you know pokemon go originated in Asia. this is not an American sub reddit. and to top that off America isn’t the greatest country in the world i don’t want to constantly be hearing about their problems.\n\nhttps://preview.redd.it/9e75khjo03zd1.jpeg?width=3024&format=pjpg&auto=webp&s=041b1f5e2c627446c706663bea7e032d123ff1ef", "label": 1}
{"text": "once again typical american with a head up their ass. how about you go jerk off kamala and donald some more i’m sure they’d love you for it.", "label": 1}
{"text": "Trump 2024!!! Fuck harris", "label": 1}
{"text": "Holy fuck you love cherrypicking, don't you?\n\nJust to clarify what i meant, since obviously you have trouble with reading, i meant that political propaganda of any kind should not be allowed. Mods seem to keep rightist political propaganda out of reddit very effectively, yet allow American leftist propaganda consistently. That's a porblem as it shits up the site for everyone not indoctrinated into your stupid fucking cult, as rightist propaganda would, btw. Dumbass.", "label": 1}
{"text": "You stated multiple times that be given 500 pokecoins was the equivalent of receiving a free $5. Do you need me to go back and circle where you said that in crayon? Maybe you'd understand then", "label": 1}
{"text": "Wish some spoofers would come here and do a raid with me but no one here plays smh", "label": 1}
{"text": "Free to play?", "label": 1}
{"text": "Sex gay is betther than this shit bro", "label": 1}
{"text": "So you do need what you yourself said circled in crayons to remember? Not a good look, bud", "label": 1}
{"text": "Hey Trainer,\n\nLooks like you might be trying to share or find Trainer codes for the purpose of trading or sending gifts in PokémonGO.\n\n\n**For finding friends: /r/pokemongofriends**\n\n**For finding remote raids: /r/pokemongofriends**\n\n**For finding remote PvP: /r/pokemongofriends**\n\nIf neither, contact the mods so they can restore your message,\n\nTo find trainers for sharing gifts please delete your thread/comment and then go to /r/pokemongofriends to prevent the sub from flooded with trade requests and adding friends, thank you for your understanding.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pokemongo) if you have any questions or concerns.*", "label": 1}
{"text": "use an old phone", "label": 1}
{"text": "What are you teaching us?    Got an idea....fuck off with your politics", "label": 1}
{"text": "Just so we are completely clear here: you are a child playing at being an adult.  And you're doing it quite poorly.", "label": 1}
{"text": "I'd ask what the fuck you're talking about but I genuinely don't care to know.\n\n\\> So you agree?\n\nLiterally I do not. You said it isn't politics, I said it is.\n\n\\>  Agree that people should try to shitpost everywhere to mobilise anyone to vote\n\nThat does not follow from anything in this entire comment thread. But I don't agree- I don't think shitposting on a pokemongo sub is in any way an effective method at getting a message out and mobilizing last minute voters.", "label": 1}
{"text": "This isn't a politics thread, but since you brought it up, thanks for letting us all know you are inbred and gay.", "label": 1}
{"text": "Or you could just stop being an inconsiderate kunt. Try that on for size.", "label": 1}
{"text": "Kunt", "label": 1}
{"text": "How many assholes are there on here anyway??", "label": 1}
{"text": "We all know this is Kamala true form\n\nhttps://preview.redd.it/0n4eo20805zd1.png?width=1440&format=png&auto=webp&s=82da8e3b6984c3af55d9ddc329d1f5b86014d878", "label": 1}
{"text": "You can complete it solo that way", "label": 1}
{"text": "Oh they’re absolutely hateful, but knowing that they are regarded as hateful dampens your brazenness, which is why you’re asking for grace. \n\nYou showed your ass and you’re offended it got paddled. Suck it up.", "label": 1}
{"text": "Wow this post blew up! I started 7/1/2024. I use 1 phone lmao I live with my big brother, him and his kids all play. Im almost level 40, got 2 shundos, 154 shiny. I do spend quite a bit lol and just today used my only masterball for my first galarian articuno! I do multiple routes daily as well as a few meetups in my community! I grind very hard and definitely no spoofing, id cry if I lost my account. Hope that answers any and all questions!(:", "label": 1}
{"text": "Hello", "label": 1}
{"text": "Weiss heil", "label": 1}
{"text": "Alolan marowak, then final reward is flareon. The rewards are definitely not worth it lol", "label": 1}
{"text": "G-max battles really killed my community's interest. The beginning max battles? No one wanted to do them, nor did they want to invest into ANOTHER Charizard that they already have mega and level 50. Beldum came out and my community was just uninterested cause we just had community day and they have shinies + we managed to communicate a hundo in the area for multiple players to get. \n\nSo falinks came around and players tried to solo him just like beldum but couldn't. So they just didn't do any. Even during raid hour meet ups, no one wanted to do a falinks since we just had a raid day of him.\n\nThen G-max came around. We could not get a single player to have interest in them because they saw how difficult they were online. It also turned out, I was the only player out of our 40 player group to even grind and level up my Dmax pokemon. We even tried to get spoofers in our area to help but even they refused to attempt them. \n\nWhen Gengar came around, I wanted him so bad. I really wanted a shiny Gmax to be my mega and Gmax. With the added talk about the lowered difficulty, it actually ignited a little interest and had several players come out to try. We had a 15 player group on halloween, and the best we could do was half health. Players in our area left to go to other towns and join meetups there because we could not do them. \n\nIt's honestly saddening. I just got back into the game and have been playing for a year. Sword and Shield was also the game i returned to the series with. To see dynamax in Pogo be such a bad feature is disheartening. Weird to see my community can 6 man a mega rayquaza, but a Gmax gengar is too much for us. Now we have all these max dens in my area that no one can participate in. \n\nI might need to see another difficulty decrease before my community attempts them again. I don't think anyone in my community cares much for toxtricity here soon. Until then can Niantic give us the ability to hide max battle dens? They're kind of getting in the way of pokemon and stops i wanna catch/spin.", "label": 1}
{"text": "Yeah I’m 32 with like 4498 caught. Tho I’ve taken like massive breaks. 2-3 years sometimes. I’ve been trying to build up my friends list to level up faster.", "label": 1}
{"text": "7 hr late response but there he is", "label": 1}
{"text": "I agree. It’s sick. It needs to be traded in order for it to get better.", "label": 1}
{"text": "Calling someone bozo is aggressive ? Wow how soft are u lmao.", "label": 1}
{"text": "Your submission has been removed. Please check the current **stickied megathread and/or megathreads on the subreddit's sidebar/menu** as well as **[in game news](https://pokemongolive.com/post/?hl=en)** and [this link](https://www.reddit.com/r/pokemongo/comments/pnlmhw/extremely_common_questionstopics_and_their_answers/#button) (both of these can found on the subreddit). This topic has been submitted and discussed multiple times.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/pokemongo) if you have any questions or concerns.*", "label": 1}
{"text": "Die in a fire it is better than you deserve", "label": 1}
{"text": ".", "label": 1}
{"text": "Noob says what?", "label": 1}
{"text": "Oh man, this post NNNNEEEEEEEVVVVVVEEEEERRRRR gets old. 200,928,679,615,012 times someone posts this and 592,679,592,558,902,190,088 more times will it just be Great!", "label": 1}
{"text": "Yes of course you should use them.  Heck buy a pogo plus+ with the auto catch mod, it will soak those up in no time.", "label": 1}
{"text": "take care of him", "label": 1}
{"text": "catch em all", "label": 1}
{"text": "🧼", "label": 1}
{"text": "Or just use a vpn to set ur country to india and buy off the web store for a fraction of that cost", "label": 1}
