{"text": "i’m undecided.  if you don’t understand and care to know my thoughts, ask away", "label": 0}
{"text": "Wait! What! They are weaponizing the justice system!", "label": 0}
{"text": "Best description I’ve ever heard is that conservatives will let you shit in their mouth if they think a Democrat will have to smell it", "label": 0}
{"text": "He voted to impeach Trump and retired two years ago when his district was redistricted.", "label": 0}
{"text": "Maybe, he's an Engineer? I imagine he's got a lot of knowledge. But don't mistake that for my thinking he's some genius. He is not. \n\n- SpaceX keeps his ass at arms length from anything critical for good reason\n\n- Elon was a board member of early Tesla Motors, which was founded by engineers Martin Eberhard and Marc Tarpenning. Much of Tesla's early success can likely be attributed to those founders, and the continuation of projects started by said founders.\n\n- The sharp decline in design sense of subsequent Tesla vehicles leads me (and many others) to believe that Elon's influence on Tesla can plausibly be a series of small regressions until we eventually reach a point where the Cybertruck is an absolute joke of a vehicle.", "label": 0}
{"text": "anyone feel like republicans are ungrateful? they were so quick to get mad at us for the hurricanes but we aren't getting any thanks at all for the absence of clouds across the US for the past week,", "label": 0}
{"text": "Wow, look at the downvotes. A lot of people don't want to think about how the choices they made led to the political climate we're in right now. They'll just keep following the crowd while imagining they're so courageous.", "label": 0}
{"text": "These people aren't exactly working with a full set of socket wrenches.", "label": 0}
{"text": "That's three strikes", "label": 0}
{"text": "I'm paying plenty of attention, and in fact you bring up a perfect example of just how insane some of yall have gotten. You're fantasizing about his death over a completely unsubstantiated claim that he *may* have said something four years ago but was only (very conveniently) brought to light *now*, two weeks before the election, by a notoriously biased \"journalist\" with a history of fabricating anti-Trump hit pieces. Based on a couple of \"anonymous sources.\" Despite the fact that everyone in the room at the time - including folks cited (and deliberately misquoted) in the article - have come saying it absolutely did not happen. Despite the family members saying he was nothing but respectful and sympathetic through the ordeal and announcing they were still casting their votes for him.\n\nThat's wild.", "label": 0}
{"text": "4 children, 3 of them girls 🤮🤮🤮", "label": 0}
{"text": "That's part of what fascism's about. It's a cult-like groupthink, as described by Sartre in 1944. It's what Goerge Orwell was trying to warn us about in his novel *1984*.\n\nThe orange asshole can say anything, and the Republicans don't even care whether it's true. Believing all the random nonsense is what grants them membership in the fascist cult. They no longer believe that being right on the facts makes them strong. They believe their unity makes them strong. And in a way, they're right. It's why they're such a dangerous threat to American democracy.", "label": 0}
{"text": "I didn’t get to watch—is this outdoors?", "label": 0}
{"text": "This is the s tusk title to the article…", "label": 0}
{"text": "ev?", "label": 0}
{"text": "I said nothinf about race. \n\nFantastic job outting youself though. A+ proejection. No notes.", "label": 0}
{"text": "\"... and, when you're a celebrity, you can grab women by the pussy,\" said the known rapist.\n\nI wonder if he's literally the worst person to ever run for president... hmm, let me think.", "label": 0}
{"text": "The idiots are throwing a tantrum, are they? Well then, let them suffer the consequences--being regarded with contempt by BOTH the right AND the left.\n\nLaughable.", "label": 0}
{"text": "this rally gets sent to the producers", "label": 0}
{"text": "Trump never forgets he hates the media.", "label": 0}
{"text": "If I understand you correctly, that's even better for Dems and Harris by quite a bit, correct?", "label": 0}
{"text": "One thing you can take to the bank with Trump, the bad demographic poll that just came in is gonna be standing right behind him at his next rally lmao", "label": 0}
{"text": "And they wonder why the term weird is being applied to them?\n\nWTF!", "label": 0}
{"text": "Every accusation is an admission", "label": 0}
{"text": "One in the guise of the other for plausible deniability. Lotteries count as payment for the purposes of this law btw so the only legal shield here is that entering the sweepstakes is *totally* unrelated to voting, you guys.", "label": 0}
{"text": "And yet…", "label": 0}
{"text": "A story like what is suggested doesn't go and die.", "label": 0}
{"text": "This is stunningly ignorant about the challenges trans people face in the healthcare sphere.", "label": 0}
{"text": "This is what ate the brain of the GOP. Beware.", "label": 0}
{"text": "I would guess there are a lot of thoughts and emotions that you've compressed into that five-word sentence.\n\nTo be honest, even if you have read up deeply on how these groups feel about this election, I still feel uncomfortable about people attacking someone's voting choice. It cost Hillary in 2016 with her \"bag of deplorables\" comment, and I don't think it's going to encourage people to change their vote this time", "label": 0}
{"text": "Dude thinks Seattle is Kabul. Calm down. We’re good here.", "label": 0}
{"text": "Is he more popular or are the polls just not underestimating his support anymore? Because those are two very different things. Based on how close 2020 turned out, I'm wondering if the current 50-50 election probability is closer to what 2020 should have been and we were just lulled into thinking Biden had a notable lead.", "label": 0}
{"text": "That's 40 years in Trump Years", "label": 0}
{"text": "Early vote.", "label": 0}
{"text": "American intel says 3k training in Russia. Ukranian says up to 12k immediately to be added to the front lines. Nowhere does intel report what is planned (because they don’t know Russian plans). \n\nKnee jerk would have been writing off this contrarian rhetoric and moving on. \n\nOur world image is far more tarnished by not fully supporting an ally we convinced to disarm in exchange for a defense pact. The only people who dislike our potential reaction to NK invasion of Europe are our adversaries.", "label": 0}
{"text": "Seems false he deleted", "label": 0}
{"text": "In case you're wondering how fucked up our priorities are here in the U.S.- this is a **high school** sports stadium.\n\n(And I'm a sports fan!)", "label": 0}
{"text": "Don’t vote for old tired crap 💩", "label": 0}
{"text": "He did say if trump lost he was going to jail", "label": 0}
{"text": "You are tired?  My *family* is tired. The anti-trans rhetorix is followed up with hostile laws and mean spirited attacks on every level of our lives. If Republicans win, my family is in *danger*. How do I shake hands with someone who gives power to the people proudly proclaiming they will eradicate my \"ideology.\"  That is my *life* they are so excited to eradicate.\n\nI hope no one ever makes you feel like Republicans make me feel, but I also want Republicans to stop treating us this way. \n\nI'm tired.", "label": 0}
{"text": "MUCH more. Look at the violence of the Vietnam & Civil Rights Movement days. The country didn’t revolt and it was worse. 1,000,000+ Americans died from COVID. The country showed it didn’t really care. And then there’s all the strikes that were gunned down back in the day. It still wasn’t a revolution. ", "label": 0}
{"text": "yea the \"brats for trump\" seems very targeted", "label": 0}
{"text": "A reminder? For real? Do a crime, get a reminder.", "label": 0}
{"text": "Who?", "label": 0}
{"text": "Those were daily briefings, not classified info on our nukes and subs dummy.", "label": 0}
{"text": "Yep, and I was at 4chan when Q started to show.", "label": 0}
{"text": "In the midst of a housing crisis, I can take solace in knowing that as a trans person I'll always live rent free in rightoid heads ❤️", "label": 0}
{"text": "Friendly reminder that won't be actioned.\n\nJust like how there are no repercussions for earning 34 felony convictions.", "label": 0}
{"text": "The sound that you hear is envy! My soon-to-be wife's parents held education above all, then were surprised their children turned into liberal heathens. We're still working on convincing them that Obama isn't the devil.", "label": 0}
{"text": "[VP Harris](https://www.threads.net/@kamalahq/post/DBg_5AdCoUt): \"You have the choice of Donald Trump who will sit in the Oval Office writing out his enemies list. Or what I will be doing, which is responding to folks with a to-do list.\"", "label": 0}
{"text": "Which one ensured everything there was bombed into gray dust, including the people?\n\nLook, fellas. I know you all want to pat yourselves on the back thinking about how bad it's going to go for these people, but you don't get to pretend that the Democrats haven't screwed them over in every way that a group of people can be. Biden has supported the eradication of the people in Gaza in every way he could.\n\nI mean yeah: go ahead and gloat that the people your party cast aside like trash are going to suffer even more since they're not going to save America from itself.", "label": 0}
{"text": "> Answer: exactly what you'd expect. \n\nR/savedyouaclick\n\nHoly shit, that is the actual title.", "label": 0}
{"text": "Wear a sweatshirt or whatever. That’s a campaign slogan and you’re not suppose to campaign ", "label": 0}
{"text": "ARREST THIS CLOWN! Why do rich people continually get no consequences from repeatedly breaking the law?", "label": 0}
{"text": "they can’t use clear skies and sweltering humidity to politicize against dems so yes", "label": 0}
{"text": "lol I’m absolutely outta here. I’ll still not enjoy it, but I’ll be somewhere I don’t have to worry about being killed for protesting.", "label": 0}
{"text": "He has no idea how to get back at them though. He thinks he can revoke a license.", "label": 0}
{"text": "If it was illegal, they would have already pressed charges. This is just a scare tactic.", "label": 0}
{"text": "I don't feel like this is true. Seems like big news often comes out on Friday. Sunday seems like it'll be buried under football, so I continue to not think this is real.", "label": 0}
{"text": "Because we've had 3 weeks of being told Trump has momentum and is either 50-50 or leading in all the key states. We'll find out soon if that is actually true, but that message is having an effect.", "label": 0}
{"text": "Ah, thx.", "label": 0}
{"text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "Biden has nothing to lose by just having these insurrectionist conspirators killed, honestly.\n\nThe supreme court has given him the green light already.\n\nRest assured that Biden is aware of this.", "label": 0}
{"text": "He’s got an enemies list; I’ve got a to-do list. \n\nIt’s a killer line.", "label": 0}
{"text": "Thx.", "label": 0}
{"text": "I mean maybe if the United States and the Democratic Party didn’t alienate their voter base by doing stunts like barring Palestinian speakers at the DNC and sending in Ritchie Torres to assure people that Kamala isn’t listening to people advocating for a free Palestine, arms embargo etc., they might feel more inclined to vote democrat. Politicians are supposed to earn votes, people’s votes aren’t a given. 🤷🏻‍♂️", "label": 0}
{"text": "Americans must be shit scared four the next 2 weeks. This isn’t just I don’t like the guy in office this has the potential to be literally life changing for the majority of the country.", "label": 0}
{"text": "No, we don't.", "label": 0}
{"text": "Vote this low-life slime ball out , he’s more of the same old crap 💩", "label": 0}
{"text": "So glad they decided to ‘remind him’ rather than fucking charge him.", "label": 0}
{"text": "I agree with you but unfortunately we can’t just pick and choose like that.", "label": 0}
{"text": "They had white T-shirt Karaoke Man singing something.", "label": 0}
{"text": "Lock him up!", "label": 0}
{"text": "My guess is that there probably is something damaging coming out about Trump because of how his side has been acting the past couple of days, but the supposed CNN comment didn't happen - since I've not seen any evidence of it past that one tweet - and the Chili Dog guy is just talking shit.", "label": 0}
{"text": "Answers;\n\n\\- 4, or maybe 6\n\n\\- Not black, but distinctly orange; so: a person of color\n\n\\- Yes, for 15 minutes, but the McD's was closed, So there is that,", "label": 0}
{"text": "Space travel?", "label": 0}
{"text": "Smitten is also the past tense of \"smite\", not sure it applies here either though!", "label": 0}
{"text": "On social issues, they have been drifting to MAGA. So I think that plays a role too.", "label": 0}
{"text": "You clarify Israel killing people doesn't count because they are all bad, not worthy of life?", "label": 0}
{"text": "Ok, now will do the same with TFG who actually running for President?", "label": 0}
{"text": "... no, paying people for their vote is an election crime. You just made something up to pretend to be upset about to justify supporting a monster and alleviate your guilt.", "label": 0}
{"text": "That isn't how Viagra works... like at all.", "label": 0}
{"text": "Man, he looks so smarmy.", "label": 0}
{"text": "I typically love following polls.  I've stopped this year.  Things just seem too off - hard to gauge patterns or trends.  I'll just wait until game time and see how it plays out.", "label": 0}
{"text": "lol they are like \"you guys are being duped!\" and every top level comment about has primarily replies demanding evidence/proof. yes... so very duped... I too hoped the piss tape was real, but somehow never turned it into my personality or reason for existence like qanon", "label": 0}
{"text": "All political parties learn from their mistakes and do things different the next time - Same thing up here in Canada. Republicans from when you were growing up got burned by not adapting to social media and the internet - As a result, there was 8 years of Obama. His team ran a social media campaign unlike any other and Republicans were completely caught flat footed.\n\nConservative media learned from that - They adapted, and found a strategy that worked, appealing to bitterness simmering under the surface and pushing it hard like they learned from the democrats. It got them a surprise victory in Trump, and if he hadn't completely botched Covid, it would've likely gotten him a second term, which he'd be done serving shortly.  Democrats adapted to that, and got a Biden victory. Now we're back in contesting territory.\n\nNo matter what (No matter what people are trying to tell you on social media), you're not voting on \"the last election ever\", and you don't have to constantly doom when you think about politicians - \"You must vote or democracy itself will die\" is a really tired slogan that hopefully will wear itself out pretty soon, along with trump rhetoric. People are already tired of old candidates and wearing diatribes like Biden and Trump, neither of them were popular candidates early in the year at all.\n\nAs a kid growing up who had to hear that if you elected a conservative Canada as I know it would end, it gets really old, especially hearing it for 40+ years. \n\nStill hope you guys get a return to normalcy next term though.", "label": 0}
{"text": "Well are they not? How many times has trump talked about using the government as revenge if he gets elected this year? His own lawyer was arguing it’s perfectly ok to order the navy seals to kill political opponents on presidential order.\n\nPlus trump has talked about going after the media because they make fun of him. Saying he wants generals like Hitler had and even quoting Hitler. \n\nIf you compile everything trump has said about his next term it sounds fascist as fuck.", "label": 0}
{"text": "I feel like there's going to be a lot of this, this cycle.  Lots of trumpanzees fell to the COVID since 2020, and if their crookedly stupid family members can get, and submit, a ballot for them, they definitely will.  My fear is that in States run by republicans, they'll be allowed to.", "label": 0}
{"text": "It sickens me when I see young people/teenagers behind Trump at his rallies.  B/c they are brainwashed by their parents and the cycle just continues.", "label": 0}
{"text": "Must be nice that you are so rich that the DOJ gives you warnings, instead of pressing charges.", "label": 0}
{"text": "That's his platform though. \n\nAnd that's what his army of morons wants...until they get it, of course, and then it's the Democrats' fault. 🙄", "label": 0}
{"text": "I wouldn't risk it, personally. Wear something over it.", "label": 0}
{"text": "Lock him up.  Biden has presidential immunity. Supreme Court says so.", "label": 0}
{"text": "Sure thing, NYT. Sure.", "label": 0}
{"text": "\"Nice electric go carts. Nerd.\"", "label": 0}
{"text": "This just kills our school clothing budget.  They keep sending her home with different penis sizes. We have bought three sizes of jock straps and two bras sizes.", "label": 0}
{"text": "Yep. I met plenty of assholes who supported him in the Marine Corps, even after Jan 6.", "label": 0}
{"text": "That buys them what a days worth of insulin?", "label": 0}
{"text": "11,780", "label": 0}
{"text": "That was not his marching orders from the GOP.", "label": 0}
{"text": "Unfortunately for the rest of us, this man already lives in a fucking flesh prison. His life is fucking misery and he takes it out on the rest of us. Most of us just get hobbies or drink booze or some shit but this disgusting piece of shit and his ilk decide they want to watch the world burn.", "label": 0}
{"text": "Well it’s good to see we still give warnings to rich people that would have landed an average person in jail like yesterday. /s", "label": 0}
{"text": "Everyone’s gotta shit sometime, somewhere.", "label": 0}
{"text": "Sounds like a potentially interesting new fragrance", "label": 0}
{"text": "Nope", "label": 0}
{"text": "To hate them so much, he sure hired a lot of these people in his businesses.", "label": 0}
{"text": "Nah dog. If there’s gonna be a one state solution, it can’t just be Israel.", "label": 0}
{"text": "Someone be real with me, is this chili dog shit worth paying attention to at all? Seems like it’s just a random Shitter account saying stuff.", "label": 0}
{"text": "He’s been awake the whole time. He’s slowing everything down to crawl on purpose.", "label": 0}
{"text": "Yet in these same states you can be an armed poll watcher....", "label": 0}
{"text": "When he said that it made me think there were other things he did. He is one of the richest people on the planet. He could spend billions of dollars and not be phased. \n\nSo I don't think it is about unregulating any businesses like people think it is. \n\nI think he may have done some bad crimes that he knows people caught onto and gave Trump the old, \"I will give you all the $$$ you need and platform you on twitch if you give me a Pardon once back in office\". \n\nBecause no amount of money lost would him to thinking he is fucked. He could lost 99% of his wealth and still have over 2 billion dollars. He could lose 99.9% of his wealth and still have  243 Million dollars. The only way he sees himself as fucked is if he did criminal activity that could place him in jail.", "label": 0}
{"text": "Nope", "label": 0}
{"text": "I believe it is word salad to them, but it's their lack of understanding and not her lack of articulation", "label": 0}
{"text": "I mean, yeah. Their founder is Tucker “You’ve Been a Bad Little Girl and You’re Getting a Vigorous Spanking” Carlson.", "label": 0}
{"text": "[Cranky old Cruz](https://www.youtube.com/watch?v=G1hkI2TG7F4&t=539s) (clip starts @ 8:59)", "label": 0}
{"text": "I can’t fix stupid… and this comment is. GTFO", "label": 0}
{"text": "Okay it's for sure illegal this time.", "label": 0}
{"text": "I just don't get it. Trump calling this country \"a garbage can\" due to immigrants is just sick. How do people support this crap,", "label": 0}
{"text": "Your submission `Trump's Rambling Speeches Raise Questions of Cognitive Decline` was automatically removed because `youtu.be` is not on our [approved domains list](https://www.reddit.com/r/politics/wiki/approveddomainslist). r/politics has a number of conditions that domains must adhere to in order to be approved as an acceptable source. Domains must:\n\n* Be notable, as defined by our [**domain notability guidelines**](https://www.reddit.com/r/politics/wiki/approveddomainslist). Notable domains will consist of news organizations, research organizations, political advocacy groups, governmental agencies / bodies, and political parties. \n* Contain articles, videos or sound-clips relevant to current US politics\n* Contain original content that has not been stolen or rehosted from another source. \n\nIf you believe that you have a domain that is eligible for our approved domains list, please use the link at the end of this message to submit it to us. However please note that if you submit spam or rule breaking content to us via the form, we will match the domain against this submission and may take action against your account. If you submit a spam domain via the form, your account may be reported to the site administrators. To submit a domain for approval [use this form](https://goo.gl/forms/lRQikA1rI0bVbKCl1) and follow the instructions provided\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "Someone else posted a claim that the same Trump spokesperson said the same thing on Twitter, then they deleted the claim. Seeing coordinated misinformation like this makes me more confident the whole thing is bullshit.", "label": 0}
{"text": "Garland is so feckless.", "label": 0}
{"text": "This topic is about anti-trans rhetoric, pal.  Nice whataboutism.  But yes, against it across the board. \nWhat countries? You don’t know? You ought to if you’re advocating for the sterilization of innocent and impressionable children. Google is your friend.  Go on. Goodbye now.", "label": 0}
{"text": "I’m so sick of this shit, November better be a blue tsunami so we can take MAGA down, take the right wing propaganda machine, break up these news agencies and prevent billionaires from owning them. Oh did I forget something? TAKE down Donald Trump at the ballot box, the rapist 34x felon fascist insurrectionist fraudster lying sack of orange shit.", "label": 0}
{"text": "Who expects Kamala to be perfect?\n\nJust because trump is a bad dude doesn’t mean Kamala gets a pass on any criticism.", "label": 0}
{"text": "Fucking thank you", "label": 0}
{"text": "Sounds like consquences of direction change denial", "label": 0}
{"text": "How there isn't a clause to limit presidential power in this exact type of situation is a complete mind fuck. To think the nation's founders and 200+ years of amendments have happened, yet no one thought maybe a president should not have the power to shut down investigations into their own crimes?", "label": 0}
{"text": "Doesn't Murdoch own them too?", "label": 0}
{"text": "In plain sight?  No action?", "label": 0}
{"text": "Judges aren't supposed to be fans.", "label": 0}
{"text": "Bill is doing his job, go in front of a crowd, look 10,000 years old and then mention he is younger than Trump.", "label": 0}
{"text": "Lmao you’re a crackhead! 🤡🤡🤡", "label": 0}
{"text": "How is it worth paying attention to?", "label": 0}
{"text": "You're right if he was a normal person but we're talking about Bill Clinton here.", "label": 0}
{"text": "The DOJ's letter actually told him that his actions may be breaking the law and outlined the consequences. In reality they need to launch an investigation into whether this meets the criteria of \"paying people to register to vote\".\n\nThis warning letter should have gone out the second he proposed this idea and the DOJ should be wrapping up their investigation by now.", "label": 0}
{"text": "Right?  As a Democrat, the amount of willpower and stamina to keep the sky cloud-free is ridiculous.  I’m fucking exhausted.", "label": 0}
{"text": "It would be more Kentucky if it were a brush hog", "label": 0}
{"text": "They’re being paid.", "label": 0}
{"text": "All good on the left. NYT editors shaking in their boots at the thought of a boring administration.", "label": 0}
{"text": "When someone repeatedly says they're a fascist, believe them", "label": 0}
{"text": "So your big gotcha is that they ran two different clips of the interview on two different shows?\n\nScandalous...", "label": 0}
{"text": "Wow if it was 1996 I might give a shit", "label": 0}
{"text": "some of you are so gullible. You tell me you look at this webpage and you believe this is a trustworthy organization? get a grip, this is distraction \n\nhttps://malcontentment.com/senior-staff/", "label": 0}
{"text": "Maga isn't the average voter though. They are a minority of the Republican party. Most voters are independents.", "label": 0}
{"text": "Republicans just keep telling on themselves left and right.\n\n“I am offended for my fellow American citizens when a person is running for president of the United States, not on what she’s going to do for the American people, but on a bunch of petty grievances from years ago. Talk about the future Kamala Harris. Talk about what you want to do and shut the hell up about what happened four years ago,” Vance said.", "label": 0}
{"text": "I am afraid you lack the intellectual capacity to understand that every election cycle has a small level of fraudsters attempt shenanigans and get caught.  \n\nThe crazy right wing conspiracy is that there is mass election fraud that changes the results of a free and fair election.  \n\nWhat is true is that Soviet and Russian agents have been attempting to convince the American public that our elections are not free and fair.  And now they have found the useful idiot and his moronic followers who will believe and spread the Big Lie.", "label": 0}
{"text": "It’s all bs at the end of the day if it’s inaccurate, no matter who it’s about. I only care about accuracy (And I wasn’t trying to be biased, as I flip those two labels quite frequently and I think youd agree I’ve been fair here. Also, you’ve not been downvoted as our conversation is too deep in a subthread to be seen by passers by. So let’s be adults and just have a discussion about what you think? I bet you have some great ideas in there. Or I can respect your karma preservation goals and not engage. All good either way! Have a great night either way you choose.", "label": 0}
{"text": "No thanks.  I'd rather obsess about all the huge ways a Trump presidency will make my life worse .", "label": 0}
{"text": "No, he isn’t snorting meth, he’s clearly mainlining right wing bullshit media (and has a pre-existing condition as an ammo sexual extremist) \nHammer’s his favorite tool, so he’ll find reasons for driving nails. Fox and “friends” gives him that reason and validates him in it.", "label": 0}
{"text": "It seems Elongated Musk has now entered his Bond villain phase", "label": 0}
{"text": "This is a hypothetical if he wins the election..", "label": 0}
{"text": "The author sounds envious that Bill doesn’t go after dudes: “Hey, look at me. Please, look at me.”", "label": 0}
{"text": "Elise is such a clown. Shameful fascists, each and every one", "label": 0}
{"text": "Weird", "label": 0}
{"text": "Something more is definitely coming\n\n\nhttps://youtu.be/Y2raxrMSxjA?si=Eiy0GlOrUYxbkTLa", "label": 0}
{"text": "Uummm.... is this sarcasm cause... have you met them? Animal abuse, pedo, incest... the list goes on.", "label": 0}
{"text": "You know what? Yeah, any GOP member liking Harris is indeed suspicious, so I'm going to put my vote behind the fascist rapist who likes Hitler. Thanks NYT for highlighting this deep journalistic issue for me.", "label": 0}
{"text": "The CNN comment did actually happen, someone unearthed a clip of it. It doesn't sound as specific in the context of the clip though. https://www.youtube.com/watch?v=Y2raxrMSxjA", "label": 0}
{"text": "We should make the sky fall on the 5 reddest states as revenge", "label": 0}
{"text": "I can’t watch this ridiculous stupidity anymore. It’s maddening and pathetic.", "label": 0}
{"text": "This is my favorite conspiracy theory.\n\nI love the idea of Trumpers voting for Kamala to 'own the libs.'", "label": 0}
{"text": "It wasn’t before today, but now one of Trump’s campaign has confirmed that there is at least one “damaging” story about Trump coming soon, so it has gotten a bit more weight.", "label": 0}
{"text": "A lot of wrestlers from the past eras are super conservative due to the hyper macho locker room culture. There are some real crazy stories of backstage politicking and bullying, and of course sexual abuse. It's still a wild industry.", "label": 0}
{"text": "grabem by the pussy moment - i’m sorry if you grab someone by genitalia that’s a sexual assault - he won after that. i’m afraid his cult might be even more motivated if anything comes out.", "label": 0}
{"text": "Exactly this. At best, the answer is “it depends on the context.” A white woman is probably better off dealing with the cops than a black man, but if she needs to go to doctor for anything even tangentially related to reproduction…", "label": 0}
{"text": "I don't disagree that outsourcing all middle east policy to Netanyahu with no conditions is a disasterous strategy.\n\nI am just saying it will be objectively, undeniably worse supporting the guy who explicitly advocate for muslim bans, wants to deport Gaza protestors, pushes 'christian nationalism' and hangs around close associates who are heavily invested in replacement theory.\n\nWe can also talk about the comments of 'finish the job' or that he threatened to raze Iran, and ofcourse turning Gaza into nice property market for luxury beach resorts.\n\nSo... yeah, its a pretty fucking obvious choice, and third party is a scam in an inherently two party system.", "label": 0}
{"text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "I was watching the segment live and tbh I don’t think he meant anything specific.\n\nHis point was these women come out all the time because it’s a Dem party plot", "label": 0}
{"text": "Alice Roosevelt, Teddy Roosevelt’s daughter, drove an electric vehicle in the early 1900s.", "label": 0}
{"text": "Dammit I missed it…..", "label": 0}
{"text": "This is not the time or the place to be a pedantic.", "label": 0}
{"text": "The dem-party can plug n play anyone they want. Kamala swoops in and is going to face immense criticism since she was the one to take bidens place after politicians, celebs, and the general population all swore that Biden was fit to run for the last three years. It’s not Kamala’s fault, it’s the dem-party who threw her into the fire. She could be a good leader, just not right now.", "label": 0}
{"text": "His family is independently wealthy, if I'm thinking of the same guy. His wife is a marine, right? No I'm thinking it's because he accidentally shot himself, and he doesn't want to admit to it. \n\nHe and his wife went on a hike at one point, if I'm remembering correctly, and his \"war-injury\" didn't exist until some time after they returned. \n\nIt would be devastating for a former SEAL and his marine wife to experience an accidental discharge. Then again, who knows? It had probably been a while, they were all alone, and his wife is rather attractive...", "label": 0}
{"text": "Abortion is learned as a resident, not as a student. \n\nRegardless, several schools (most notably Georgetown, but also Loyola and Rush) have not exposed students to abortion at their main hospital for quite some time now. Has not affected applications and I think Georgetown is THE most applied to MD school ", "label": 0}
{"text": "Republicans are all about hierarchy. Everyone has a place in society. \n\nThing is, they're not into people in lower classes working their way up into higher classes because they believe people ultimately deserve to be wherever they are.", "label": 0}
{"text": "Surejan.gif", "label": 0}
{"text": "Our conversation was about precocious puberty \n\nNo country has banned puberty blockers as a treatment for that", "label": 0}
{"text": "They did, they “reminded” him it’s illegal.", "label": 0}
{"text": "Well sorry, I’m just a lowly citizen who knows shit about trans healthcare.   So maybe get off your high horse and enlighten me.", "label": 0}
{"text": "He’s still the Waukesha mayor but left the Republican Party after Jan 6th.", "label": 0}
{"text": "It is was one of us \"nobodies\" we would be fined or arrested just for advertising this type of election interference. But when the rich and powerful break the law, they just get a verbal warning.", "label": 0}
{"text": "If you're smart then your read-between-the-lines takeaway from this should be: this proves that special counsel Jack Smith is doing his job effectively and should absolutely be allowed to keep doing it.", "label": 0}
{"text": "Right. I should have been more specific when asking for a source because that's what I was referring to was the conspiracy, not the crash itself. ", "label": 0}
{"text": "5-6 months like my comment suggests. Does the month you speak of include a primary (or other party nominee process)? If so, then I’d feel even more terribly.", "label": 0}
{"text": "Almost certainly not.", "label": 0}
{"text": "Its considered a sweepstakes, not illegal. Nothing will happen. Reee more", "label": 0}
{"text": "They said the same thing about women reading novels and riding bikes.", "label": 0}
{"text": "All this chili dog talk made me realize I've never had a chili dog.", "label": 0}
{"text": "I think it easily could, at least slightly, in an election where every vote will literally matter this time.", "label": 0}
{"text": "Partly based in misogyny, or at least ambivalence to women. They don't have to care about choice, so why bother supporting it? Partly based on race. Most of that group is white. Why stand up for they peers of color? Won't affect them. They're hoping that being \"one of the good ones\" will earn them privileges, and it will. They'll be the last one in the mass grave.", "label": 0}
{"text": "he wasn't reminded unless he's in jail", "label": 0}
{"text": "With glee", "label": 0}
{"text": "Tim “49 out of 50” pool?", "label": 0}
{"text": "I mean yea it’s messed up I agree but the reality of the situation is since he’s a psychopath that lies and their message is hey we’re the opposite sane people that don’t lie anything they screw up is going to get magnified. We saw it 3 times already idk why people are surprised", "label": 0}
{"text": "I’m confused. What is the context?", "label": 0}
{"text": "But nothing will happen to this white rich man!", "label": 0}
{"text": "He is going to round up 15 million people then complain other countries won’t take them for deportation. At that point he will have a big problem paying to house and feed them so a final solution will need to be found.", "label": 0}
{"text": "[Michael Moore talked in his podcast recently](https://youtu.be/ow6jrG6ayJY?si=CqiUE0gn6xLWbFRQ&t=866) (warning: strong language) about how to get more votes among these groups in Michigan", "label": 0}
{"text": ">If they win this election and don't deliver. They're going to get absolutely destroyed in the mid terms, and we will have a more competent Trump ready to destroy Dems in 2028.\n\nThe presidents party almost always loses the house in the midterms regardless of performance. I don't know if trump will be alive in 2028,  always Jr though I guess they can wheel out daddy's corpse too.", "label": 0}
{"text": "Nah, the trump campaign guy said on CNN that he's expecting stuff to come out next week and that doesn't believe any woman who's accused trump of SA", "label": 0}
{"text": "Interesting. I did see something about the Trump campaign saying something about that to CNN. Why do they choose to tell CNN and other media about it?", "label": 0}
{"text": "Recall and court martial....lose his pension, he is on Russian payroll anyway.", "label": 0}
{"text": "I am finally seeing the Tucker Carlson clip about trumpdaddy. rip freud you would have loved this shit", "label": 0}
{"text": "there are a bunch of weirdos online who think that like every woman is trans. I don't think they're a large enough demographic to bother making ads for though. \n\nhttps://www.vice.com/en/article/a-wild-investigation-of-transvestigators-the-people-who-think-celebs-are-all-trans/", "label": 0}
{"text": "Simple, buy over time, you typical gun enthusiast, (not the militia type, the weened target shooter/hunter) buys ammunition when they find it cheap, usually cases which are generally around 1000 rounds.  and depending on the caliber of the rounds that will usually go for around $300-$400 per case.  by comparison. typical high quality handgun ammunition (not cheap range ammo, I am talking \"defensive ammo like hollow points by a know quality manufacturer) will often cost you $30 for a single box of 20 rounds.  (me specifically I choose Underwood Ammo as my chosen defensive ammunition. It is stupidly expensive to have much of that stuff versus the dirt-cheap stuff like soviet bloc 7.62x39 or 5.56 NATO surplus ammo often sold dirt cheap and also often isn't exactly high quality.\n\n  These rtypes will by this stuff by the pickup truck load pretty much every election cycle becaue \"them damn Democrats are gonna confiscate yer guns and ammo so ya better stock up and stack deep while you can!\"   Me personally , I consider 1000 rounds per caliber I own a firearm for to be considered minimum on hand. This  is so I have enough to practice and maintain proficiency with any weapons I own.  Generally I have 1-5 weapons on hand so if I had maximum I would have 5000 rounds . So yes 250K rounds stockpiled is friggin nuts", "label": 0}
{"text": "Good luck with that", "label": 0}
{"text": "They are betting on Trump making them Trillionaires.", "label": 0}
{"text": "Good question", "label": 0}
{"text": "Image and branding are the norm. The fascist policy leanings and admiration for full-on dictators and despots shouldn't be.\n\nAlso, this isn't the first time we've heard Hitler/Nazi rhetoric regurgitated by this guy. At what point should we take it seriously? This isn't normal, and isn't language that previous Presidential candidates have used, regardless of party.", "label": 0}
{"text": "Upton was one of the GOP Reps that voted to impeach Trump. This is not surprising since he lost his seat partially because he came out against Trump.", "label": 0}
{"text": "People will be kicked out of their homes, it's inevitable with the rising cost of housing.  The rich are just pushing the boundaries to see how far they can milk people.", "label": 0}
{"text": "That's how I describe Mitch McConnell too!", "label": 0}
{"text": "Yeah that whole \"rain, snow, sleet or hail\" thing is also a good reason to shovel a path and throw down some salt on cold winter days. Our neighborhood mail carrier is way too close to retirement for us to risk him wiping out while delivering us coupons, catalogs and other assorted nonsense.", "label": 0}
{"text": "Let's see how many current or former WWE fans are in this thread.\n\nKamala Harris is 2013-2014 Daniel Bryan.\n\nDonald Trump is 2014 Batista after the Royal Rumble win.", "label": 0}
{"text": "They keep framing people as babies but...I'm from the left and I don't feel wary and alienated? I can't possibly speak for everyone, but I'm pretty sure it's just whatever last pickups she can grab. I already voted for her, so she's done appealing to me.", "label": 0}
{"text": "Kamala’s here in Georgia", "label": 0}
{"text": "Musk, Murdoch, and Theil are the immigrants destroying our country", "label": 0}
{"text": "Oooh big boy Vance with the naughty words! Feeling bold today are we, Mr. Guyliner?", "label": 0}
{"text": "Apparently basic consideration for others when you’re sick = freak. Wild mentality.", "label": 0}
{"text": "lol wat. The Trump campaign is a perpetual airing of grievances.", "label": 0}
{"text": "Either that or the owners are genuinely in the tank for him.", "label": 0}
{"text": "And greed, a lot of media is outright holding water for trump. He gives rich guys tax cuts and makes the rest of us pick up the tab. Guys that own media conglomerates really dig that.", "label": 0}
{"text": "Policy, rights, the future of democracy aside—I’m just ready for a hot president again!!", "label": 0}
{"text": "Hahaha I assumed the link was a Rick Roll. I didn’t click it.", "label": 0}
{"text": "Pretty sure that Bill Clinton would be a dirty old man regardless of his ability to keep an erection.", "label": 0}
{"text": "To be fair, it let his garbage ancestors in.", "label": 0}
{"text": "Irony.", "label": 0}
{"text": "\\*laughs in nazi\\*", "label": 0}
{"text": "He was SPECIFIC that two negative stories are coming out and they're going to ignore them", "label": 0}
{"text": "Is it possible to create so much crime at the top levels of government and ruling class that it just becomes to expansive, in either cost or human resources, to investigate it all.  I think we're getting close.", "label": 0}
{"text": "If you vote for the MAGA agenda, you are MAGA even if you don't wear the hat.", "label": 0}
{"text": "I think they may have been aware but I don’t think he was as bad as what we saw at the debate. \n\nAnd yes, I do think he has declined rapidly. If you have gotten to know anyone with dementia, the decline begins slowly but can hit like a ton of bricks all at once eventually. \n\nAnd I also think the stress of being president while campaigning was absolutely accelerating his decline and exacerbating his episodes. \n\nI think we’re seeing this right now with Trump. He’s already way past the age of anyone who should be running for president, he’s often incoherent, and the stress of campaigning is breaking him. \n\nAnd personally, I don’t think future candidates should be able to run past the age of 70 or maybe 72 and Biden and Trump are perfect examples as to why. ", "label": 0}
{"text": "You can see how “tariffs are the best” happened…", "label": 0}
{"text": "So cathartic", "label": 0}
{"text": "Dancing dipshit muppet. \n\nElon isn’t a complete dumbass, he’s just socially inept and thinks it’s cool to act and say stuff like a 17 year old edge-lord.", "label": 0}
{"text": "Ok well he did it now punish him", "label": 0}
{"text": "They can “downplay” that shit all they want. A snake is still a snake… even if it wears a tuxedo", "label": 0}
{"text": "sorry, there was a fire at the library of time and dreams, and they have been busy trying to adlib all the history around this time! please bear with it until we can decipher what \"total annihilation\" means...", "label": 0}
{"text": "write in Biden as a form of quiet protest", "label": 0}
{"text": "I dunno, it sounded kinda specific. Guess time will tell.", "label": 0}
{"text": "This from the campaign trying to say \"weren't things so great 4 years ago?! Let's do that again!!\"", "label": 0}
{"text": "Some people in your valleys want to stay in the 50s unfortunately…", "label": 0}
{"text": "Not only do we not, we are more fired up then ever.", "label": 0}
{"text": "I will never forget the atrocities that Biden and democrats funded in Gaza. For them to get my vote in the future they have to irrevocably condem likud and pull funding.", "label": 0}
{"text": "Ohioian here. My parents live in a small town. Their neighbor has a 6 year old daughter. Last week she was excited to tell them about what she learned recently from the Bible. It was about Adam, Eve and the devil, describing good and evil.\n\nShe then decides to add in \"The Democrats are also evil.\"\n\nSo yeah, good luck with fixing Ohio.", "label": 0}
{"text": "Yeah, fixating on the Clenis is a golden oldie.", "label": 0}
{"text": "Even the greatest nation will have its faults, whichever nation you feel that may be. No country on Earth has a perfect history and being cognizant of our past transgressions allows us to improve and grow past them.", "label": 0}
{"text": "Are they trying to normalize it?", "label": 0}
{"text": "Lol, I didnt even know turtle was still with us!\n\nHomie has been laying low of late!", "label": 0}
{"text": "Go listen to Senator Obama’s speech during Roberts’ nomination if you haven’t already - it’s quite on point and his fears have been realized, and more. ", "label": 0}
{"text": "THEN DO IT\n\nThrow that pansy into prison", "label": 0}
{"text": "Wow.  I didn't think people this stupid existed outside of Russian propaganda farms.", "label": 0}
{"text": "That video made me SO upset. I'm trying to not get upset over something so ridiculous and stupid. But I really am upset about it. This is what MAGA thinks of people who disagree with them. It's so vile and degrading. (Not to mention sexist.)\n\nFor anyone who hasn't seen it yet... [https://x.com/IsaacDovere/status/1849243980648579189](https://x.com/IsaacDovere/status/1849243980648579189)", "label": 0}
{"text": "Trump is Ric Flair, trying to wrestle professionally at 75 years old and then having 2 heart attacks during the match.", "label": 0}
{"text": "The only garbage in this country are MAGA clowns", "label": 0}
{"text": "The way I’m starting to see it is that conservatives are able to overlook a lot more things they don’t like from a candidate to get the issues they care about. Yeah sure, some like Miller are truly repugnant individuals, but I’d wager most conservatives don’t like Trump, but they want Trump for one issue or another. And those issues range from disgusting to almost noble. Unfortunately the noble issues the GOP is mostly just giving lip service too these days (like actual fiscal conservatism).", "label": 0}
{"text": "Polymarket uses digital currency. And there are lots of tutorials (some made by them) about how to create an account. But basically, change your money to etherium then change that to a usd pegged digital currency then bet.   And reverse to get your money.   It illegal sure but nominally only. (I am not encouraging any illegal activity.)\n\nAlso Kalshi has a legal market that looks the same. There is definitely money there for the taking as Trump is getting propped up. Harris is only a 66% chance to win the popular vote. Republicans have lost the popular vote by 2 or more points since 2008. In 2004, W won by 2 points  but lost it in 2000.  66% is low.", "label": 0}
{"text": "To be fair, per wikipedia this is a stadium that serves primarily 2 high schools with enrollment of about 3,000 combined. It also serves the broader school district (27,000 high school students) as the home site for playoff games", "label": 0}
{"text": "You realize that 85% of Muslim Americans consistently vote for Democrats, right?\n\nThese articles are written so we blame minorities when in reality only white Christian men and women vote for Trump as a majority.", "label": 0}
{"text": "If the election was so in the bag they would be flaunting it full blown.", "label": 0}
{"text": "There is a BIG difference between being cocky and recognizing when you're being intentionally manipulated and gaslit. People who think they are going to win, dont resort to stuff like that.   \nYou dont see teams start blatantly cheating in the 4th quarter when they think they are winning, only when they start to think they are losing.", "label": 0}
{"text": "The way he leans into the words about spanking. Dude was fully torqued during that speech", "label": 0}
{"text": "We said the exact same thing. After yesterday, too, was the first time in my life I was like ‘well fuck you anderson what a terrible thing to say”", "label": 0}
{"text": "If Trump wins, it will be the greatest injustice in American politics. The rich convicted felon, who was found liable for sexual assault, beats the woman who is a public servant and worked hard to get to where she is.", "label": 0}
{"text": "And Dana Bash said something to the effect of “Maybe she’s held to a higher standard than he is, but that’s just the world we live in.” If only there was some group of people who regularly appeared on television and other media whose job it was to discover facts and report on them in an unbiased way. Too bad they don’t exist. A man can dream, though.", "label": 0}
{"text": "I hate putting Bolton in with them, because he sucks out loud, but the sentiment remains.  Bolton made sure to cash in with a book after the fact, but they all put up with Trump's bullshit while he was in office and didnt do much, if anything, to alert the public.", "label": 0}
{"text": "As a leftist I’m wary of those of us that refuse to stand up to fascism because of a single issue being shitty. It’s moronic, and I understand it has forced the Harris campaign to go after the middle, cause she can’t promise much about Palestine. She doesn’t run Israel.", "label": 0}
{"text": "I watched the Trump speech today and the supporters behind him were mostly only excited during the migrants topics. The mood completely died down gor the last 20 and the whole thing was only 50 minutes.", "label": 0}
{"text": ">When will this dipshit suffer real consequences for election interference?\n\nWhat are you talking about??\n\nHe's just been reminded by the DOJ that the crime he's committing would land a poor person in prison for 5 years. What else do you want to happen to him??\n\n/s", "label": 0}
{"text": "Eh rather some ‘tisim to blame intellectual failings/oddities than whatever you’re gonna say you have.", "label": 0}
{"text": "Watch to see if Tim Walz eats a chili dog at his next event. If he does, we know its \"go-time\".", "label": 0}
{"text": "The problem with Kamala is that in the last town hall, she sidestepped the Palestinian question, and gave full support to the Israeli terrorist sympathizer.", "label": 0}
{"text": "The flowchart goes:\n\nFirstly, the question must be asked: can any laws criminalizing this scheme be enforced in time to prevent the intended effect on the 2024 election? No, not even close to enough time.\n\nIf Trump wins, Musk never faces consequences no matter how illegal. Immediately the outcome is that Musk reaps massive benefits as his illegal campaign contributions to a presidential candidate are rewarded with a policy shaping position that cuts away any regulation on his business interests.\n\nIf Trump loses, then a million roadblocks exist to forestall justice. A Democratic administration would have to muster up the courage to enforce these rules. Musk will use his massive online soapbox to ratfuck an investigation. He'll cry persecution, Republicans in Congress will oblige him with hearings, and conservative media will gladly blast wall to wall coverage about this for years. Musk's private wealth and twisting of his corporate apparatus will arm him with the legal resources to delay this battle forever, as is the Trumpian strategy whenever he is challenged by the law.\n\nFinally, will this ever actually end with Musk facing criminal consequences? The sun is likely to swallow the earth in a thermonuclear fireball long before that happens.", "label": 0}
{"text": "Nah. Because Batista didn’t deserve those boos. \n\nI’d say more like Alberto when he eliminated Santino. ", "label": 0}
{"text": "She’s there for the Senate - internal polling must say it’s winnable for Allred.  That and campaigning in swing states isn’t getting the same coverage, Pod Save America talked briefly about this today.", "label": 0}
{"text": "Deportation is still a thing? The whole ‘go back where you came from’ thing?", "label": 0}
{"text": "No, we’re quite incentivized.", "label": 0}
{"text": "“When you’re a star they let you do it…you can do anything.”", "label": 0}
{"text": "State and Federal crimes ...\n\nI'll let this guy explain: \n\nhttps://youtu.be/waPngGP7Awk", "label": 0}
{"text": "What bullshit. Fuck the NYT. It's turned as shitty clixkbait as the rest these days. ", "label": 0}
{"text": "Such a depressing lack of integrity in the GOP", "label": 0}
{"text": "One is a minority and the other is not. If you’ve ever worked in Corporate America, this is nothing new.", "label": 0}
{"text": "Wyden and Raskin are consistently some real ones. I super appreciate their presence in our government as checks against corruption and the erosion of democracy", "label": 0}
{"text": "Visiting Tempe, AZ and bummed out by all the MAGA shit on University Dr. and (presumably) students rocking the “Save America” hat. Must suck to pay for an education and get nothing from it. Also, lots of weird signs with a camel full of COVID shots.", "label": 0}
{"text": "It’s really sad that statements like this have to be made to prevent chaos from happening. I hope to hell that everyone gets out and vote like their life depends on it.", "label": 0}
{"text": "What an amazing look into how brain rot removes your ability to think critically. The “proofs” or “evidence” listed is asinine. It’s like saying someone who claimed it’s raining cats and dogs must be a believer in UFOs. \n\nOh, this guy once said he went on a walk and also shaved, must be Bigfoot!\n\nPlease stop being so comfortable making such long leaps, you’re bound to twist an ankle.", "label": 0}
{"text": "AOC is not running for president. She's immaterial to my comment.", "label": 0}
{"text": "You don’t get it, if we fix that one, we fix the other. Citizens United is the legislation that allows billionaires to funnel limitless cash into our politics. It’s the head of the snake. Chop it off, and the snake dies.", "label": 0}
{"text": "So, Emerson is a good pollster. But that is just one poll. Trafalgar is poorly rated and usually off in favor of republicans. In fact, it’s interesting to me that all the polls are right alongside Trafalgar because I assume they haven’t changed their methodology, and they’re not typically very accurate. Redfield is low rated. I can check on Quantus and Morning Consult, but I think they’re low rated as well. FWIW, the last NY Times/Sienna polls (a very well-rated pollster) had Harris up by 3 or 4 in several polls. \n\nTrump has gained slightly, but it is really hard to tell if that’s a meaningful gain or just noise. Truly. Furthermore, the polls always tighten toward the end. It’s just much more noticeable and scary when Harris doesn’t have much of a lead. I didn’t worry when it happened to Biden, by the way. \n\nI totally agree that it’s horrifying it’s this close. The reality is that a significant portion of this country isn’t just okay with fascism; they want it. And they want it enough to enable it and make it happen. That’s a tough pill to swallow. I don’t have anything to say about that. I’m scared for my future and my kids’, honestly now more than ever.", "label": 0}
{"text": "Real nuns.  And those rulers they are whacking knuckles with? brass edges. I hope Leon is not taking blood thinners.", "label": 0}
{"text": "Why do you think deporting someone somehow removes his right to private property? You are the reason people believe in limited government. Tyranny at its finest.", "label": 0}
{"text": "If Biden was still running the headline would read \"Biden is declining fast.  Why is the DNC trying to hide it?\"", "label": 0}
{"text": "oh jeeeez I missed that D:", "label": 0}
{"text": "\\>And then the hands started moving, and they were on the, you know, on the side of my breasts, on my hips, back down to my butt, back up, sort of then, you know\n\nThat's EXACTLY how he gropes Ivanka in that one extra creepy video.", "label": 0}
{"text": "American justice is a fucking joke. If I was prez I’d appoint an AG and tell them it’s open fucking season, go after rich people openly committing crimes with the long dick of the law or I’ll find someone who will.", "label": 0}
{"text": "NYT stinks to high heaven these days. Jesus Christ, they're shameless.", "label": 0}
{"text": "I have a trans spouse who cares less about \"trans issues\" in the sense of talking about them less than the MAGA types. She wants to talk about d&d and her industry, Not spend all day debating that she is who she is.", "label": 0}
{"text": "Rudy Guilliani basically had to give up all his money and valuables in that defamation suit from the election workers in Georgia. \n\nI mean…. a drop in the bucket of absolute bastard millionaires/billionaires who need to face some kind of accountability… but it’s something.", "label": 0}
{"text": "Haha, it's like they're using an online Outrage Generator or something.", "label": 0}
{"text": "Luckily for us Harris is a fantastic candidate.", "label": 0}
{"text": ">  Trump hurts any Muslim or Arab in this country and any Muslim or Arab living anywhere else in the world more than Harris, and it isn't close\n\nThen why are they considering voting this way?  \nAnd if the best answer you can come up with is \"they're voting like idiots\" then you haven't done enough to try and see it from their point of view", "label": 0}
{"text": "I read this as incinerated on first glance and felt okay with that too", "label": 0}
{"text": "I was so relieved. A little later he clears it up and says he wears masks in airports (and was kind of making fun of himself)", "label": 0}
{"text": "This entire comment should be posted everywhere. Like written on the damned moon so everyone has to see it.", "label": 0}
{"text": "Yes we do lol.", "label": 0}
{"text": "This is NSFW fetish content 🤮", "label": 0}
{"text": "And they are white.", "label": 0}
{"text": "He won't spend 5 seconds in prison. \n\nMoney talks and bullshit walks.", "label": 0}
{"text": "oh wow cnn running the groping story front page, I thought it'd get buried", "label": 0}
{"text": "It was this way when John Kerry got painted as a flip flopper and dubya could barely string a sentence together.  The party that rages against celebrities elected the terrible actor ronald reagan and the reality television star as two of their most beloved leaders.  Republicans have no values and constantly shift the narrative, people give their opinion benefit of the doubt despite them NOT deserving it.", "label": 0}
{"text": "Name of the twitter user spreading it", "label": 0}
{"text": "Even if he was found guilty he wouldn't see 1 day in federal prison.", "label": 0}
{"text": "I like Kunce a lot. It's just so red here now. You leave the cities, and the GOP signs just seem to increase every day. That whole reporter injury story is making the rounds big time and has really taken over his social media presence too. \n\nIt's sad because Hawley an elitist asshole who spends no time here and brings the state nothing. At least even with Blunt you could say he was bringing federal money to MO. Hell, Blunt even cared a bit about mental health and would tour non-profits. Hawley is just an all-around piece of garbage.", "label": 0}
{"text": "The wheels turn for rich people?", "label": 0}
{"text": "Even Batista himself would hate to be compared to Trump.", "label": 0}
{"text": "So Harris has to defeat Putin in the opening match of the election to get to a three-way with Trump and Biden in the main event?\n\nWho's Kofi in this metaphor?", "label": 0}
{"text": "So ironic, Trump married two immigrants but spews immigrants are tainting the blood of Americans. Musk, an immigrant, is now interfering with our elections. Cult members are so fucking stupid.", "label": 0}
{"text": ">We will not be denied justice for your crimes.\n\n*all of* his crimes, because we have been definitely denied justice for almost everything so far.", "label": 0}
{"text": "Can someone help me here, please\n\nThe statement that he was medically unfit , does that not mean that he was discharged for medical reasons. Just asking as I am confused as to why they don’t mean the same thing and why there is a conflict", "label": 0}
{"text": "Cool, try reading what i write next time.\n\nBye.", "label": 0}
{"text": "I hope it’s a metric shit ton", "label": 0}
{"text": "I've vowed to never give CNN a click or view again, I've switched over to MSNBC and I'm having a waaaay better time.", "label": 0}
{"text": "Found someone from Cincinnati", "label": 0}
{"text": "And yet, billionaires with Wall Street investments have doubled their wealth under Biden. (Example, Steve Schwarzman of Blackstone doubled his net worth last 4 years to $50 billion.)", "label": 0}
{"text": "If you think that's bad don't go to Texas.", "label": 0}
{"text": "Disclaimer: I know I’m a dork\n\nI’m working on my sleeve and got a sword tattoo on my forearm so I can metaphorically fight my battles in life and punching that button at the polls to vote for Kamala is my way of fighting the monster that is MAGA.", "label": 0}
{"text": "He'll pardon himself from all his legal troubles and then he'll begin implementing all the shit in the Project 2025 handbook or whatever its called.", "label": 0}
{"text": "I’m resigned to the fact that we live in an America that prefers an incompetent, insane man to a more-than-competent woman. I was crushed in 2016 and can’t take it again. He’s gonna win, probably by electoral college again. My emotional energy has to go elsewhere. I’ll be pleasantly surprised if he loses.", "label": 0}
{"text": "\"Look how long ago he tried to steal the election, you're still talking about 3.75 years ago??\"", "label": 0}
{"text": "Let's see... incremental movement forward with a Democratic administration or a massive leap into a dystopian future with an avowed fascist? Decisions, decisions...", "label": 0}
{"text": "Look at you Mr. Moneybags", "label": 0}
{"text": "I will blame all of MAGA - less than human to me", "label": 0}
{"text": "It's just not fair, you spend 30 years of your life groping and sexually assaulting women and then people bring it up to try to sabotage your presidential campaign!!", "label": 0}
{"text": "They're also losing doctors and other highly skilled workers. I feel bad for the people who can't afford to leave though.", "label": 0}
{"text": "Is Kamala Harris a vampire? No, and trump has no idea that he’s losing.", "label": 0}
{"text": "And trash should know about garbage cans", "label": 0}
{"text": "Doesn’t he have the sense to run stuff through his lawyers before announcing them?", "label": 0}
{"text": "He became a US citizen in 2002. Also remember AOC said no person is illegal.", "label": 0}
{"text": "As the  NYT keeps printing bullshit clickbait, its readership grows weary and alienated. An", "label": 0}
{"text": "“Enjoy your fancy hotdog, *Madame President*”\n\nHannity seething", "label": 0}
{"text": "Injustice anywhere is famously a non-factor in regards to threats everywhere so it's probably gonna be fine. /s", "label": 0}
{"text": "Liberalism isn't leftism. You are not the left if you think a coalition with republicans and a candidate pushing for tough on crime + border shit is the left. I have not met a single leftist who actually thinks Kamala is going to be a good president, just better than Trump.", "label": 0}
{"text": "Steals.", "label": 0}
{"text": "How do we ignore them?  How do we, as a people, tell them to shove it up their butts and that we are not following their dumb ass rulings?  More than half the country thinks they are a joke, how can we break from their \"ruling from the bench?\". The same thing there was so much pearl-clutching about democratic judges?  They are now the very ones doing that exact thing, and badly.", "label": 0}
{"text": "That's right Jack!~", "label": 0}
{"text": "That’s insanely amazing.", "label": 0}
{"text": "Solid takedown haha. Important issues in the country? Right wingers: but trans people!!!", "label": 0}
{"text": "He is not our best", "label": 0}
{"text": "Donald Trump is objectively a fascist.  \n\nThere is no 'Both Sides', there is no 'But Kamala'.  He's a fascist, full stop.  \n\nAnything to the contrary is either lethal levels of ignorance or malfeasance, take your pick.", "label": 0}
{"text": "And you were responding to my comments discussing PRECOCIOUS PUBERTY", "label": 0}
{"text": "Let’s be honest, most Americans are more worried about Amazon reviews than threats to our democracy.", "label": 0}
{"text": "But they do have jobs. Deflation is associated with recessions because people lose their jobs and have no money to spend.", "label": 0}
{"text": "I'd feel a lot better about dismissing him as a dorky loser if I didn't feel like everything he did had insidious intent", "label": 0}
{"text": "20 years in prison should be a fair deterrent.", "label": 0}
{"text": "Huh? That's the opposite of true in regards to this topoc or in general.", "label": 0}
{"text": "I saw in a YouTube short somebody asked him what happens if Kamala wins, and he said IM FUCKED HAHA.\n\nAll the comments were about how Comrade Kamala would throw him in jail unjustly and now because you know, he’s committing crimes and attempting to sway the election (as an immigrant nonetheless)", "label": 0}
{"text": "I think it's funny that they declared war on me specifically and I'm still here and now I have a whole legion at my behest in defense of our cause. Like guys, you failed. I won. And I will continue to win.", "label": 0}
{"text": "You gotta give them credit though, didn’t take them too long to find this lowlife dipshit.\nGood job Blue, thank you, you probably saved lives.", "label": 0}
{"text": "He got a reminder. Should be enough right?", "label": 0}
{"text": "It's illegal to pay people to register OR to pay people to vote.\n\nYou have to be registered to enter his dumb lottery/get a payment, so he is very clearly paying people to register.", "label": 0}
{"text": "Harris should take responsibility if she loses this election. It’s her poor explanations of her policies and meaningless responses to real questions that’s turning off voters. She’s running a D- campaign.", "label": 0}
{"text": "Yeah there was definitely some relief but also just want to get to the results and the next two weeks are gonna feel like a long time", "label": 0}
{"text": "Just so everyones on the same page of why there is mental divide in this country.\n\nCertain right leaning places compare Bill Gates donating money to a party, to be equivalent to what Elon is doing with this.\n\nYou can't make it up", "label": 0}
{"text": "Also being a sex pest", "label": 0}
{"text": "Same goes for Instagram.", "label": 0}
{"text": "The media hid his condition until he had to appear on a public debate.  They had to fall over themselves to pretend to be objective, but really were trying to save face.", "label": 0}
{"text": "You gotta do better than that, DOJ.", "label": 0}
{"text": "Yeah, I haven’t ever seen any black Amish people, come to think of it. 🤔 ", "label": 0}
{"text": "I chuckled at the headline and was going to move on but I’m going to go check out the art just cause of your comment lol", "label": 0}
{"text": "Nope, but they did good on Charlize Theron.", "label": 0}
{"text": "Shitbirds of a Federalist Society flock together", "label": 0}
{"text": "I think he's betting on a pardon from all of the crimes he's committing right now from Trump, so he figures he might as well commit them all right now because he could very well escape punishment for all of it.\n\nVote Harris, by the way.", "label": 0}
{"text": "Meanwhile on the other side: a melting coked up pumpkin", "label": 0}
{"text": "Fair, just getting frustrated at the lack equally applied rules seemingly, I'm sick of rich people being above the law. I get it water is wet but still sucks", "label": 0}
{"text": "Saying words is fascist 😄😄😄😄😄\n\n\nMeanwhile, the current president at one time was forcing the citizenry to take a vaccine against their wishes or lose their livelihood.\n\n\nTrump did nothing comparable.", "label": 0}
{"text": "Left center Dem boomer here, we absolutely don’t. We become more encouraged that those republicans may help us rid the political and media scene of the orange menace. What was that saying…the enemy of my enemy is my friend. We can bash Cheney’s policies in 26 or 28, but if we don’t welcome her and her influence over voters now, 26 or 28 won’t matter because we’ll be fighting bigger demons.", "label": 0}
{"text": "Humping a flag doesn't make you pro-gay marriage. \n\nHis joining the republican party and his actions towards the LGBT community afterwards shows he was never an ally.", "label": 0}
{"text": "Abusive partners might demand a picture of the ballot, particularly conservative men who think women shouldn't have the vote", "label": 0}
{"text": "They may be for Harris because we brought in abortion and lived through women’s rights. We don’t want to see it all in the trash for our kids and grandkids. I wouldn’t take it as a red vote at all. We also saw our fathers in the Second World War and watched a maniac take over like Hitler tried. I am a late boomer and participated in the first 18 vote.. Nope we don’t want it.", "label": 0}
{"text": "Why is she coming forward now?", "label": 0}
{"text": "Sure but only if poor people do it…", "label": 0}
{"text": "John Roberts was part of Dubya’s legal team for Bush v Gore. It’s amazing that in 24 years he’s gone from partisan hack to the most moderate conservative justice.", "label": 0}
{"text": "Which is funny because Batista (and Daniel Bryan too, from what I hear) is a Democrat. He's already stated he's supporting Kamala in this election.", "label": 0}
{"text": "it's very psychosexually unhinged in general, but the fantasy old school paternalistic domination like that is just so fucking gross to hear. like I'm sorry that is a fetishistic daddy-daughter play fantasy, even if that's someone's kink how in god's name is it normal to talk about in public, especially as a way to treat the country? i need to ask the psychoanalyst sub about it.", "label": 0}
{"text": "Wouldn't trust some one that falsifies their whole childhood to appear as a certain etnicity for votes.", "label": 0}
{"text": "Charlamagne tha God off the top fucking rope on CNN lmaoooo", "label": 0}
{"text": "Fuck the Times, they love trying to cause issues where there are none. They might as well just endorse mango mussolini at this point", "label": 0}
{"text": "good point", "label": 0}
{"text": "Trump’s normal speeches raises questions of mental decline. The rambling ones are the proof.", "label": 0}
{"text": "Icp to Eminem to Taylor swift to Bruce Springsteen is quite the musical spectrum haha", "label": 0}
{"text": "This comment section is 90% Liberals who think they are the \"Left\" being referred to here, when your candidate is Center at best (Center Right on half the issues she's talking about a lot) and if you go to any place full of Leftists we think Kamala is not a good candidate. Tim Walz is like the only reason we have any hope, and for those of us who don't feel disenfranchised we are only voting because Trump is an extremely evil candidate.\n\nBut once Kamala is in office we are not buddies. Do not get it twisted.", "label": 0}
{"text": "Exactly!", "label": 0}
{"text": "Trump supporters are not good people. Therefore they do not care that their candidate is not a good person. Or a good candidate.", "label": 0}
{"text": "I'd slightly disagree, at least for the oldest members of that cohort. Back in their day classism and racism were purposefully made to be the same thing. \n\nWe tend to forget just how long a person, even one from that generation, can live when they have more money than God.", "label": 0}
{"text": "Running a sweepstakes without a license is absolutely illegal.", "label": 0}
{"text": "Sorry son, but you are not smart enough to effectively execute satire.  \n\nMaybe try your skit on Truth Social with all the other GEDers.", "label": 0}
{"text": "Wow, y'all watching CNN right now? Lol.", "label": 0}
{"text": "The DOJ sent him a warning, not an indictment for a crime he committed very publicly. I'd say his 'stay outta jail' card is just fine.", "label": 0}
{"text": "Boohoo, those poor starving colleges, how will they survive", "label": 0}
{"text": "Lol, ok, MAGA. They're so fucking weird, complete freaks of nature.", "label": 0}
{"text": "Agreed it doesn’t make sense to criminalize private influence when leftwing politicians sell out taxpayers in order to gain the same influence.", "label": 0}
{"text": "Why are you obsessed with Clinton's penis?", "label": 0}
{"text": "What did he say?", "label": 0}
{"text": "That's true. I was just thinking more \"past-his-prime and overpushed by the establishment\" over the clear choice of the people.", "label": 0}
{"text": "Should we maybe just eat them now?  As a treat?", "label": 0}
{"text": "Ask him why he is so obsessed with them? And it’s weird/creepy/telling when you focus on someone else’s junk all the time", "label": 0}
{"text": "Kamala: I will raise the minimum wage to 15, and raise the taxes for those making over 400k a year.\n\nTrump supporter: I can't understand what she is saying\n\nTrump: I saw a potato in the shape of my penis last night. It was very round BUT ALSO LARGE!\n\nTrump supporter: YES! THOSE ARE POLICIES, THAT'S WHAT THE COUNTRY NEEDS.", "label": 0}
{"text": "Ammunition keeps longer than food, and they do intend to use it eventually.\n\n\nFor things like shooting up the DNC headquarters or anyone they don't want to share a country with.", "label": 0}
{"text": "We need to tax billionaires for what they grifted from Americans.", "label": 0}
{"text": "That's a very weird thing to say...", "label": 0}
{"text": "The DOJ warned him once.  Part of what he is doing on this second effort also sounds illegal.  The government has endless money to draw on when prosecuting his ass.  Once he has been charged, his billionaire friends will head for the fucking hills instead of come to his aid.  Use a team of aggressive A-Team level prosecutors and if he is convicted, jail his ass and once his jail time is finished, deport him (he is not a native born citizen, he can be deported, as opposed to a person like me, who can only be given jail time).", "label": 0}
{"text": "Biden would have won", "label": 0}
{"text": "This infantilizing rhetoric is exactly why people directly affected by something as horrific as a protracted, one-sided war in which their relatives are slaughtered very logically do not trust either party to act in their interests. The current administration has done actively *less than nothing* to mitigate the mass civilian casualties in Gaza. By no means would Trump be better, but you're not convincing anyone who feels unheard by being an asshole and comparing their reaction to war crimes to a temper tantrum.", "label": 0}
{"text": "Real gangsta ass dudes don't flex nuts cause real gangsta ass dudes know they got em", "label": 0}
{"text": "Why the fuck is this reality? There are thousands of people cheering this shit as he says it. I'm so done.", "label": 0}
{"text": "Despite supporting leftist policies, I don't call myself a leftist because I'm so sick and tired of the obnoxious gatekeeping 'leftists' do. Especially when the criteria they put on those gates have absolutely nothing to do with economic policy.", "label": 0}
{"text": "Anderson is getting put in place right now this is amazing", "label": 0}
{"text": "Yall are you watching charlamagne tha god call out Anderson Cooper right now? Oof", "label": 0}
{"text": "But not from being president", "label": 0}
{"text": "Unless the story has the answer, and it's an interesting amount, I don't care.", "label": 0}
{"text": "You don’t have to convince me, I’m voting for Harris, I fucking loath Trump. I’m saying Harris has a problem with her messaging to the greater American public. ", "label": 0}
{"text": "All in on trump and getting pardoned? Otherwise (i hope) this doesnt end well for him.", "label": 0}
{"text": "They run in some weird circles don’t they", "label": 0}
{"text": "Yup. Easier to blame “The Others” than to face that no one can really control things like inflation. That involves admitting certain problems have no simple solutions.", "label": 0}
{"text": "Anderson trying so hard.", "label": 0}
{"text": "The called CNN out and the media’s double standards for Kamala and Trump.", "label": 0}
{"text": "Charlamagne the God is speaking straight facts right now about CNN lmao", "label": 0}
{"text": "Add a mound of shredded cheese on top.", "label": 0}
{"text": "I’m with you. She’s a better person than I am. Just earlier I was, jokingly, telling a friend that I’m about to vote for Trump so he will win and I can say “fk all of you, you got what you wanted, eat it”", "label": 0}
{"text": "it feels historic to me already and im def excited lol im making the hot dish and ginger cookies on election night", "label": 0}
{"text": "Lol I spent years minding my own business after I transitioned. Once the culture war came for me I declared war right back. THEY HATE IT. I can stand my ground harder than any of them can push.", "label": 0}
{"text": "No one hates the US more than Trump", "label": 0}
{"text": "Agent Jack Danger was on it", "label": 0}
{"text": "Lol, what a terrible fucking thing to do, but that's a pretty badass quote.", "label": 0}
{"text": "Anderson/CNN deserves to be called out.", "label": 0}
{"text": "Why is Huntingdon county the only “other” in the state? It’s super red there.", "label": 0}
{"text": "I think that's the way to go. People follow and idolise him because they think he is some supergenius who is right about everything. When they realise they are worshipping some awkward creep, it gets a lot harder to justify.", "label": 0}
{"text": "It is very clearly illegal. You have to be registered to qualify for his thing, and it's illegal to pay for registration, not just voting. It's also illegal to hold a private lottery of ANY sort, election related or otherwise.", "label": 0}
{"text": "I had this conversation with someone the other day. Capitalism has created incredible amounts of wealth for our entire society, however, that wealth is no longer going to our entire society. It is going to billionaires and shareholders.", "label": 0}
{"text": "No one should be able to hold enough power to fire their own prosecutor in a nation that claims liberty and *justice for all*.", "label": 0}
{"text": "After the devastating polls today in Michigan and Pennsylvania, the right is working overtime. They are going to push the stolen election narrative again.", "label": 0}
{"text": "Hes everything the right said Soros was.", "label": 0}
{"text": "This is just rude, and not relevant", "label": 0}
{"text": "He was but there were a lot of deliberate parallels in the story.", "label": 0}
{"text": "Are you sure they have the competency to understand that, though?", "label": 0}
{"text": "No, The Mail is its own special brand of evil, having been blamed for extending the Boer Wars unnessarily through its reporting, and a cheerleader for fascism in the 1930s.\n\nHowever, it is owned by a billionaire who lives and pays tax in France.", "label": 0}
{"text": "It's hilarious how much CNN and their hosts can *NOT* handle the truth and criticism. Same goes for NYT", "label": 0}
{"text": "Old article, wouldn't have been an issue if she just picked Shapiro", "label": 0}
{"text": "Something is bothering me about Arizona. Polling shows Trump at about a percent higher. Within the error margin basically tied. But Lake at -6 under Gallego for the Senate. Is this a low # of quality poll issue? Internal poll issue? Arizona is going to be fun to watch.", "label": 0}
{"text": "I decided to protest and the other guy won. And that guy fucked me over. WTF.\n\n\nThat's how it would go.  I hope your \"moral\" victory was worth it. So fucking dumb.", "label": 0}
{"text": "Let's get on with the feats of strength.", "label": 0}
{"text": "source: trust me bro", "label": 0}
{"text": "True. I just can't help thinking that a \"Yes!\" chant is going to break out at a Harris rally at any moment.", "label": 0}
{"text": "DNC isn’t far off", "label": 0}
{"text": "so CNN is having a self-deprecation week to compensate for last night? lmao", "label": 0}
{"text": "He has to get to the cybertruck owners pleading for help that are stranded on the side of the road first", "label": 0}
{"text": "What where the polls", "label": 0}
{"text": "Eh, nearly everyone in the airport in any of the big East Asian airports? Honestly there were a good number of people wearing them in airports there before Covid.", "label": 0}
{"text": "Bit more than that imo: they get to preemptively set up for “both sides are the same”; and, they get to bury one side’s awfulness in search results.", "label": 0}
{"text": "He's like an LLM that keeps trying to give info on current events/politics and you have to steer it elsewhere b/c of tier 2 reasons", "label": 0}
{"text": "Can’t or won’t??", "label": 0}
{"text": "lol. I just pulled the \"UN report\" they claim to be sourcing. \n\nThe only sources for the \"data\" they claim here are claims from rabid fringe anti-trans organizations, not actual data.", "label": 0}
{"text": "Usually it’s the hosts of a certain persuasion…their privilege comes blaring out.", "label": 0}
{"text": "Chili dog > whatever that cinnamon diarrhea they serve at Skyline is", "label": 0}
{"text": "Paying people to register is just as illegal as paying people to vote.\n\nHolding a private lottery is also separately illegal for any purpose/context.", "label": 0}
{"text": "It reminded me of my elementary school trip to a \"Kid's Museum\" where there was a fake grocery store and you could pretend to be a cashier or whatever.", "label": 0}
{"text": "As of now", "label": 0}
{"text": "Okay but who does this spell disaster for at Sacrifice?", "label": 0}
{"text": ">  I’m so disappointed in Anderson and his bullshit defensiveness and denials.\n\nIt saddens me to see how he's fallen. We read Dispatches from the Edge in High School (circa 2006ish) and I really looked up to the guy for years afterwards.", "label": 0}
{"text": "Worried we’re about to see something similar to the venezuelan election on election day", "label": 0}
{"text": "Not the common man tho!  They drop the hammer fast on us regular people!!", "label": 0}
{"text": "There are rules in place in most locations and sporting level that have requirements for transwoman competing in women's sports already.\n\nThat hormone called testosterone you are an expert on? They have to be on hormone treatments for at least a year before they are allowed to compete at the WIAA level, and many high schools have similar policies.\n\nAnd children should learn about genitals because, believe it or not, everyone has one kind or another. And kids are going to ask why James has a penis and Jaime has a vagina. \n\nConsidering how regularly Republicans bring up children and their genitals, I'm thinking this is projection on your part. Your political party wants genital inspectors in elementary schools, for example.", "label": 0}
{"text": "you definitely gotta hand it to him on this one", "label": 0}
{"text": "\"Reminder\"\n\nDidn't he ALREADY commit the crime?\n\nI might be wrong here, but do most people get a reminder from the DOJ when they commit a crime or is it usually, uhh, what's that called, punishment?", "label": 0}
{"text": "Damn; did I get popped to the 1990s while I was taking a shit or something? \n\nWho the fuck cares what Bill Clinton is popping?", "label": 0}
{"text": "Fuck off Donnie", "label": 0}
{"text": "I expect to see record numbers of GOP voters voting for Harris this election due to abortion and threats to democracy.\n\nThe real question is how many Democrats vote for Trump over inflation burnout.", "label": 0}
{"text": "trump never won the popular vote, unlike Gore and Hillary.", "label": 0}
{"text": "More and more if us are waking up from our Kool-aid induced comas to realize the deceptions we've been fed.  \n\nI'm among those, and I understand the humiliation and shame of being that gullible.  I can't shower enough to get the Trump stench off! \n\nI voted today, and now I feel like I can get a good night's sleep. God Bless the real America! 👍🗽🇺🇸", "label": 0}
{"text": "Kamala needs to do it; Joe promised the American people he wouldn't pardon Hunter and integrity is important.  That's if she wins.  IF Trump wins, I hope Biden pardons him and takes the entire clan out of this godforsaken country that he's served so faithfully for half a century.  Two fingers held high in the air is all he will owe us at that point.", "label": 0}
{"text": "By your logic, the last 40 years of republican politicians promising tax cuts for votes is illegal.", "label": 0}
{"text": "Don't worry about it. I'm a gay man in one of the theocracy states and got downvoted for telling the Evangelicals they can eat my taint instead.", "label": 0}
{"text": "The DOJ has sent him a letter asking him to please stop, you are making people mildly upset‼️😳", "label": 0}
{"text": " It for the undecideds, who also seem to suffer from mental decline", "label": 0}
{"text": "Fucking WEIRD!", "label": 0}
{"text": "Either \n\n\n1. split ticketing at levels unseen (possible since lake is shitty)\n\n\n2. Trump is being overestimated\n\n\n3. R senate candidates being underestimated", "label": 0}
{"text": "What are they saying?", "label": 0}
{"text": "The wealth he has is mostly investments and stocks. I’d be surprised if he could pull together a billion on short notice. He had to liquidate a decent amount of stock and borrow money to buy Twitter.  And there are plenty of indicators that Tesla is going to be fucked soon. \n\nAll they is to say, I think he very much cares about the money and the regulations. There’s undoubtedly financial crimes he’s committed that the appropriate agencies will get to sooner or later. \n\nBut a corrupt executive that owes a thing or two as well as corrupt mutual interest makes it a no brained of an investment. If I was the cartoonish robber baron that Musk is with no regard for ethics, morals or the future of America, I’d be doing the same thing.", "label": 0}
{"text": "MAGA is just jealous of Bill's boners, they wish they had boners, they wish anyone cared if they in fact had their desired boners. Boners.", "label": 0}
{"text": "Giuliani was all in for Trump the first time around. How did that end up for him?", "label": 0}
{"text": "Cooper has the squirms. Wow.", "label": 0}
{"text": "Roflmao, according to his PR firm, maybe.  His actions certainly don't show it.", "label": 0}
{"text": "Conservatives are very easy to manipulate. Ask sky daddy.", "label": 0}
{"text": "If Trump win he get presidential pardoned if Trump doesn't win he run away\nRemember he's not a US citizen \nThis is a foreign national actively interfering with our election", "label": 0}
{"text": "Add federal charges of voter interference. \n\nHe’ll be in longer than the Menendez brothers.", "label": 0}
{"text": "I think many in the mainstream traditional media have a lot to lose in this election. After so many years of \"both sides-ing\" and normalizing Trump whilst losing vast numbers of readers/viewers to online media, their only claim to being superior to online and independent media sites was that they were more \"credible\" and \"objective\". But at the same time they've clearly succumbed to the same clickbait and outrage culture that they've been claiming to be against for so many years.\n\nIf Harris wins by a reasonably comfortable margin, their entire credibility goes out the window and it's not at all unrealistic to say that they'll lose even more readers/viewers as more and more people continue to retreat into their own personal media bubbles and reject the mainstream even more.\n\nSo they have a real stake in trying to stoke doubt in the public even as they claim to be against what Trump stands for. They may say they're endorsing Harris, but they've spent so long preparing the public for a Trump government that any result that isn't remotely close to this could do serious damage to the future of mainstream media and legacy outlets like the NYT, CNN, Time Magazine, etc etc.", "label": 0}
{"text": "It’s kinda crazy how weird this subreddit gets sometimes", "label": 0}
{"text": "I agree with you, I do, but feel they could have done more.  It all seems so opportunistic and I am having a problem getting past that.  I know I’m jaded and I’m working on that.  We are safer for them being at their post but I’d like to think they could have down more.  Otherwise, I feel we’re doomed when we inevitably have another president like Trump and the bare minimum won’t be enough.", "label": 0}
{"text": "I'm enjoying watching Anderson being bullied.", "label": 0}
{"text": "And legacy media still pretends to not understand why Kamala would rather talk with people like Charlamagne than them?", "label": 0}
{"text": "He never noticed that *no one* gives away money for voter registrations, signing petitions? If that were legal, we would be seeing it everywhere. It's like he doesn't live in the United States.", "label": 0}
{"text": "Anderson is struggling", "label": 0}
{"text": "Anderson unfairly called Harris out last night. \n\nMaybe not entirely but to some degree.", "label": 0}
{"text": "Doubt.", "label": 0}
{"text": "Stop talking about that weirdo, MAGA don't care what a black woman says. Talk to America, go back to the early talking points, positive policies that effect middle and working class families.", "label": 0}
{"text": "Just get out there and vote fam.", "label": 0}
{"text": "Hate and fear have no place in \"balanced, inclusive discussions.\"\n\nRead up on the paradox of tolerance.", "label": 0}
{"text": "Charlamagne is making Anderson look like a fool right now.\n\nRunning circles around him mentally", "label": 0}
{"text": "My 2 cents is why would the John McCain state vote for Trump this time but not last time?", "label": 0}
{"text": "This. This is all it is for most of us. I don't know why people think this means we are implicitly forgiving him for being a complete and utter ghoul or that we want that brand of conservativism back either. But if this convinces those conservatives who do want that back to not vote for Trump at least, then let's just let it roll. \n\nThis insistence on ideological purity to earn a vote is why the election is remotely close at all. I don't know why such a large portion of the left is so pig ignorant to reality. \n\n(I was an Education MA major and the number of truly clueless people in that program who refused to accept economic scarcity as a base reason for why they would not simply be able to do everything they wanted was mind-blowing. You can't have everything Barbra, sometimes you just gotta make do. That's life.)", "label": 0}
{"text": "Right. She thinks she is losing, so instead of trying to shore up her own campaign in the swing states she is taking valuable time out to support Allred in Houston. Makes sense.", "label": 0}
{"text": "people may just hate lake more lol shes got the unfortunate disadvantage of being a woman on top of gross MAGA person. misogynists be misogynists", "label": 0}
{"text": "Putting cases together takes time. I don't know if they're doing that at all, but if they were, this would make sense just to scare him into stopping to stem the damage done, while they build a case. If he hadn't complied (it seems he has), then they could do a formal injunction and contempt of court as necessary too.", "label": 0}
{"text": "I've just stopped watching CNN entirely. Their content is trash, their panels are the worst I've ever seen, and Jennings is maybe the most annoying person I've ever seen regularly appear on television and that includes ESPN panelists.", "label": 0}
{"text": "Anderson on damage control.", "label": 0}
{"text": "I didn't say he deserved to die over it. I said that we won't be worse off when he's gone. Also, you're conveniently overlooking his long and infamous history of saying wild and grossly insensitive and messed up things. This would NOT be remotely out of character for the guy who said \"grab 'em by the pussy\" on tape, who cruelly mocked a physically handicapped person in front of a large crowd, or who mocked a rape victim in the press for not being attractive enough to rape. What WOULD be wildly out of character is for this person to react with quiet strength, calm decorum, and respect, because he's been in the public eye since the 1970s and we have never, ever seen it. I'm sorry, but the one not reacting to reality is you.", "label": 0}
{"text": "He’s such a little bitch. I didn’t know there was a man on this Earth I could respect less than Ted Cruz.", "label": 0}
{"text": "Didn’t Trump also insult Mitch’s wife as a cabinet member?  lol the GOP is full of cucks", "label": 0}
{"text": "Big Gov died with Reagan. It's never gonna get fixed.", "label": 0}
{"text": "People have the wrong perspective on this, and I understand why; it's very hard to be furious when something is so huge. But this isn't purely about double standards anymore, which is why we need to be *angry*. What this is about is absurdly rich people controlling the bulk of our media, and publicly, *in our face*, using their power to put their thumbs on the scales of this election.\n\nIn favor of a demented, old white rapist.\n\nWe should be tearing them apart. Not being sick of it. They should be *terrified of us.*", "label": 0}
{"text": "Kamala Harris is a former prosecutor, so better chance with her than most!", "label": 0}
{"text": "Typical.. a woman has to\nBe overqualified, good looking, perfect manners, and not seen as overstepping the line. Double that for black, brown, working class and disabled women! 🌊💙🌊💙fuck these misogynistic, racist, fascist, dipshits!", "label": 0}
{"text": "man trump is going to wreck his country what is he doing?", "label": 0}
{"text": "This is all a set up to ensure the Supreme Court can help Trump win after the election.", "label": 0}
{"text": ">But once Kamala is in office we are not buddies. Do not get it twisted.\n\nSo you'll go back to having zero political power?\n\nEver heard the phrase \"you can catch more flies with honey than vinegar\"?", "label": 0}
{"text": "that'd be based, but Jack Smith needs to stay focused on sending Trump's ass to prison.", "label": 0}
{"text": "Universities have been paper mills since the 80s sadly", "label": 0}
{"text": "For what it's worth I generally like Anderson, but this is hilarious as fuck", "label": 0}
{"text": "So...did he cancel the contest? I'm guessing not?", "label": 0}
{"text": "So former US marine becomes Russian asset trying to weaken America. Hope they throw your traitorous ass in jail after the election.", "label": 0}
{"text": "Dork MAGA", "label": 0}
{"text": "Can Merrick Garland please do something for a change and strip this traitor of his citizenship and government contracts and ship him to Guantanamo Bay?", "label": 0}
{"text": "Yeah I’m familiar with her… craziness… it’s just wild to have a split like that from AZ. That’s some Maine behavior.", "label": 0}
{"text": "I mean, one candidate has a cult behind him and they don't care about anything he does. So the media focuses on Harris.", "label": 0}
{"text": "It’s insane that it’s his own appointed people saying this. That should terrify all Americans.", "label": 0}
{"text": "No, you'd be fine, and you could do that. The goal of his is that by making it a petition about 2nd amendment rights, he's getting a disproportionate number of Trump voters.", "label": 0}
{"text": "Fuck Mel Gibson. Racist POS.", "label": 0}
{"text": "This entire convo on Anderson Cooper's show just continues to show why podcasts are so much better than cable news", "label": 0}
{"text": "The internet propaganda machine working hard before election day.\n\nThis year has been relentless especially", "label": 0}
{"text": "Yeah, but as a Bisexual myself, we in the lgbtq community might be “Allowed” into maga, but all of us in the lgbtq community are never Welcome… So yeah… Peter is only being Allowed in because of his money, otherwise these people would never go out of their way to support him at all…", "label": 0}
{"text": "I just don’t see the point…except from maybe a 4th grader’s POV. Weird!", "label": 0}
{"text": "I don't frequent bars or watch football so hearing this is actually really interesting and encouraging!", "label": 0}
{"text": "You've given a great example of why Dems are seen as untrustworthy by marginalized groups. If your concern for their wellbeing is contingent upon their utility in electing your preferred candidate, it's clear you don't actually care that their needs aren't being addressed in any way.", "label": 0}
{"text": "Didn’t Trump marry a couple of immigrants?", "label": 0}
{"text": "A gish gallop of crime", "label": 0}
{"text": "They absolutely do not care about bodily autonomy… for other people.", "label": 0}
{"text": "The better option would have been to ask: Why? Why do you \"have\" to vote for him? Please justify this decision to me.", "label": 0}
{"text": "That is the tucky part of pennsyltucky\n\nhttps://en.m.wikipedia.org/wiki/Pennsyltucky", "label": 0}
{"text": "me to john king: i wish i knew how to quit you", "label": 0}
{"text": "I'm sure Trump and his Republican cultists will respect these safeguards. /s", "label": 0}
{"text": "Northampton resident here, this shit ain’t gonna happen! Lots of Harris support popping up everywhere the last couple of weeks. I went from non-stop Trump and McCormick ads to what seems like 3:1 pro Harris Casey ads. Lots more Harris yard signs. I’m in a red section of Northampton and there are way less Trump signs out this time around.  \n\nFunny enough, I see a lot of Trump signs with blue tape over the Vance part 😂. Even they don’t like that freak", "label": 0}
{"text": "That implies some voters would vote for Allred for Senate and Trump for president. That makes no sense whatsoever.", "label": 0}
{"text": "Well, you went to some effort to convince me that you were right the first time around, so I don't really believe you now when you say it doesn't matter. I think we agree that it's important to get the point across.", "label": 0}
{"text": "Correct. In some states like PA the gulf is far higher than even the national average - [12.5% of Dems vs. a whopping 42.8% of registered Republicans](https://targetearly.targetsmart.com/g2024?calc_type=voteShare&count_prefix=current_eav_voted_count_&demo_filters=%5B%7B%22key%22%3A%22registeredParty%22%2C%22value%22%3A%22All%22%7D%5D&state=PA&view_type=state&vote_mode=1) who previously voted on Election Day in 2020 but have now voted early.", "label": 0}
{"text": "Looks more like a way back Confederate just “keeping citizen order” around the Plantation town. ", "label": 0}
{"text": "fictional threats are the best threats", "label": 0}
{"text": "Philadelphia vs. Pittsburgh beef", "label": 0}
{"text": "He could be dick-deep in a baby on live TV \nand they would still vote for him.", "label": 0}
{"text": "\"Please stop breaking the law sir. 😋😋\"", "label": 0}
{"text": "Staying away from the people is not hard to do in Wyoming.  It's the least populous state and has open range that rivals the ocean.  But yeah, I know what you mean.", "label": 0}
{"text": "They hate their country. They want authoritarian control by a charismatic \"tough guy\" to assuage their failure to achieve what they believe was their birthright. ", "label": 0}
{"text": "Well, they did vote for Democrats like that. As the fella stated though \"leopard, something, (their) face\" happened, didn't it? Now every lib place like this is spending all day gloating about what's going to happen to them next.\n\nDemocrats took their votes and turned them into free bombs sent to land on their people overseas. And look at this thread. Look at how liberals react when the people they fucked over as hard as they could reacted the only way they could.", "label": 0}
{"text": "Yes but her emails. \n\nNow it’s yes, but her genocide. \n\nThere will always be a single issue that voters want but have no problem allowing fascism to take over. For the love of God, please vote.", "label": 0}
{"text": "I'm sorry that your outrage prevents you from voting. I hope you recover.", "label": 0}
{"text": "Wow, a reminder. Is he okay?", "label": 0}
{"text": "Anyone got a stream for this cnn show?", "label": 0}
{"text": "This was my biggest gripe with the pro Palestine folks when Biden was the nominee.  He was the clear choice for a free Palestine, but nooooo, we gonna call him genocide Joe, when clearly Trump is WAY worse.", "label": 0}
{"text": ">Hawley’s longest trip home was between April 1, 2020, and May 1, 2020, around the start of the Covid-19 pandemic.\n\nIt took a global pandemic stopping travel for him to spend even one month in the state.", "label": 0}
{"text": "I don't know why anyone is even looking at polls at this point with the election underway in 43 states.", "label": 0}
{"text": "Truest words you ever wrote.", "label": 0}
{"text": "I honestly can't tell if you learned something since you posted the first comment, or if you meant to change alts. Either way, you seem to be arguing both sides. He's absolutely talking about Hitler's generals' obedience, not their competence.", "label": 0}
{"text": "What’s happening on cnn?", "label": 0}
{"text": "Anderson will never have Charlamagne tha God on his show ever again.\n\nMade a straight fool out of him.", "label": 0}
{"text": "Fake news.  Vote! vote! vote!", "label": 0}
{"text": "I live right near San Francisco and have met a lot of trans people and they are perfectly lovely, which is why I do not understand the fuss.", "label": 0}
{"text": "It's the best interest of a democracy to 'put away' these kinds of threats.\n\n\nThese 'kind men' are taking advantage of the leniency of the democratic institutions.", "label": 0}
{"text": "How is this not treason?", "label": 0}
{"text": "Go away, Politico.\n\nWe know your loyalty lies with Trump, not America.", "label": 0}
{"text": "That’s ridiculous", "label": 0}
{"text": "I don't know how the fuck there isn't far more constant noise about what nightmare people he and especially his dad are.", "label": 0}
{"text": "No we’re not. Although, what I am wary and alienated by is legacy media like NYT trying to force drama where there isn’t any to get clicks.", "label": 0}
{"text": "The Overton window needs to be moved substantially left before any democrat can win on true progressive values on the national stage.", "label": 0}
{"text": "https://x.com/Acyn/status/1849877892236443758\n\nHarris saying these things about trump and his trash can comments, are things I hope resonate with voters on the fence. Good press conference today", "label": 0}
{"text": "Ugh what a dick, [he deserves sarcastic bo burnham songs](https://www.youtube.com/watch?v=KN1BBFb8WbQ)", "label": 0}
{"text": ">Think\n\nYou lost us on the first step. God help us all", "label": 0}
{"text": "If you aren’t against him, you are voting for him. Fuck you Bezos.", "label": 0}
{"text": "Bye, Amazon. I can live without you. Simple as deleting my app.", "label": 0}
{"text": "jesus christ that title lmao \n\n  \nthought he was gone and it was a rule of three situation", "label": 0}
{"text": "These people are TELLING us what they want to do to the people of the United States, literally likening trump's goals to that of a abusive father - Establishing power, authority, and perverse physical dominance over their \"misbehaving children.\"\n\n>*\"There has to be a point at which Dad comes home. Yeah, that’s right. Dad comes home. And he’s pissed. Dad is pissed. He’s not vengeful. He loves his children. Disobedient as they may be, he loves them because they’re his children. They live in his house. But he’s very disappointed in their behavior and he’s going to have to let them know.\n'Get to your room right now and think about what you did!' And when Dad gets home, you know what he says? “You’ve been a bad girl. You’ve been a bad little girl and you’re getting a vigorous spanking right now. And no, it’s not going to hurt me more than it hurts you. No, it’s not. I’m not going to lie. This is going to hurt you a lot more than it hurts me. And you earned this. You’re getting a vigorous spanking because you’ve been a bad girl.\"* - Tucker Carlson\n\nThe people are not yours to do with as you please, you evil fucks.", "label": 0}
{"text": "Agreed and endorsing a candidate when you’re suppose to be an impartial news organization would be extremely biased", "label": 0}
{"text": "Billionaires see the writing on the wall.\n\nThey can’t pull the wool over the eyes of the younger generations and they know that accountability is coming.\n\nThe view the MAGA movement as their last chance at maintaining the status quo.", "label": 0}
{"text": "No fear.  Merrick is a mouse.  Kamala needs to replace him with someone with balls.", "label": 0}
{"text": "how their ass taste", "label": 0}
{"text": "That's why I am not voting for him this election season. Enough is enough!", "label": 0}
{"text": "Silver could be off by 20 points and say \"heh, the model always considered this possibility\" and people would be right back to dooming his midterm predictions in 2026", "label": 0}
{"text": "Also, electoral college and gerrymandering and dark money and outside interference, etc.\n\nJohn Lewis' Senate bill 1 election protection needs to pass.", "label": 0}
{"text": "I just canceled my LA Times digital subscription because of this. Guess I'll just find some ladder-based websites to help me read articles.", "label": 0}
{"text": "One subscription at a time: took 30 seconds to cancel.  Bye!", "label": 0}
{"text": "Yep it’s going to happen. I expect violence.", "label": 0}
{"text": "Just canceled. Oligarchs are running this country into the ground. That goes for you too Elon Musk!", "label": 0}
{"text": "Is Kate Cox expected to speak at the Harris rally today? I know she was at the DNC", "label": 0}
{"text": "Regardless, I stand by my assessment.", "label": 0}
{"text": "Because there hasn't been a presidential candidate that has been so closely compared to Hitler and Nazi rhetoric since then. Also the article is legit about comparing it to a Nazi rally, which actually happened there along time ago.", "label": 0}
{"text": "They aren’t asking his devout supporters to do so. They’re asking those with a shred of doubt.", "label": 0}
{"text": "The media has completely shown their ass for Trump this election. They haven't gone full pro-Trump propaganda machine like Fox, but there is definitely a finger on the scales and it's coming from the top.\n\nTheir problem is that Harris is a scandle free politician right now who has been running a tight campaign that sticks to her message and avoids gaffs. So they are having trouble drumming anything up to hammer her with besides \"sometimes her answers to pointed questions are a little vague\". The latest attempted scandal push is she said she agreed with Kelly's description of Trump as a fascist. And that is apparently just a bridge to far\n\nMeanwhile Trump is off saying all kinds of batshit crazy shit, insulting her constantly, calling her a communist maxist fascist all at the same time, talking about universal 20% tarrifs and abolishing the income tax, deporting millions of people, firing special councils, stripping CBS of the broadcast license because of 60 minutes, and I really can't even count everything else. And it just gets a few words of disapproval and an article on page 6 with a soft headline and then a \"well I guess that's just Trump being Trump, nothing to be done about him\", now back to the polls.\n\nAnd now all of the major newspapers are declining to endorse anyone, not because the editorial section decided so, but because the owners saw they were gonna endorse Harris and said no.", "label": 0}
{"text": "That's what we want to think\n\nLook at Fox news.\nThere are always gullible people willing to believe whatever is told to them\n\nWe humans are inherently lazy when it comes to finding the truth. It's far easy to take a reputable org and start turning it against truth. \n\nYou don't need to convince 100% of the population, just enough percentage to keep the system in turmoil.", "label": 0}
{"text": "Not reading this but Embarrassing", "label": 0}
{"text": "Their blatant misogyny is so gross.", "label": 0}
{"text": ">\n\n>How do you propose to do this?\n\nWe need to add an amendment to the Constitution to make public education a right.\n\nCurrently, there's nothing in the actual Constitution that says anything about public education. Because of that, it's a states rights issue under the Tenth amendment. States are the ones who directly control public education and what can and can't be taught; the only influence the federal government has is through the Dept. of Education, and that power is mainly through funding and doing its best to ensure that all students have an equitable education, usually by data collection and, well, controlling funds.  \n  \nWhen it comes to teaching critical thinking skills, there are Common Core standards. For example, Reading for Literature and Informational Standard 1 for multiple grades is citing textual evidence of what the text says explicitly as well as what it inferences. We have students learn this by, say, reading The Giver or various articles. The skill they're learning is to cite evidence if they're going to state a text says \\*insert claim\\*, and they're learning think critically about texts - what is something saying even if it's not outright saying it. Pretty important skills.   \n  \nExcept, there's nothing by law to enforce Common Core standards. Federal government can't make states adopt them. States that do aren't necessarily implementing them correctly. Common Core may not be perfect, but because there's no mandatory enforcement, there's no policies about making sure all teachers are trained in understanding and implementing Common Core correctly. Therefore, in some places Common Core is a failure - because the people using them don't understand *how* to use them. They're designed to teach skills that can be transferred outside of the classroom, but if districts and teachers don't understand how to pair the standards to curriculum and pedagogy, they're useless and confusing.\n\nIf there was an amendment about education, the Dept. of Education could actually force states to teach to standards where students learn to think critically and grow to become adults who can discern true from false information and analyze a politician's rhetoric to find the fascist undertones (or, you know, overt dog whistles). Until then, things like Oklahoma getting away with (for now) having Bibles in their classrooms can continue to happen. Hopefully that's struck down by the First amendment, but if education was actually controlled by the federal government, Oklahoma would probably have been stopped before even implementing the policy.", "label": 0}
{"text": "Maybe theres something to his unrealized gains tax after all", "label": 0}
{"text": "Yeah, and he ended up losing the popular vote by over 2.5 million votes in 2016.", "label": 0}
{"text": "Does this mean the DOJ will send him another sternly writen letter?", "label": 0}
{"text": "Yes.  We should be sending the Ukrainians everything they need, including relatively \"modern\" (production started in 1976) jets.  Most of the stuff we are sending is old inventory that would cost us more to dispose of than to ship to the Ukrainians.  The rest is new production that creates jobs here. \n\nThe way to end this war is to help the Ukrainians deliver a crushing defeat to Russia. Trump's idea of strong-arming Ukraine into a defeat to appease Putin is just going to make Putin want more later.  Russia will only stop when they see toppling Ukraine as an unachievable goal. I don't think we need boots on the ground yet, but if it comes to that NATO might want to step in.  Aggression cannot be rewarded.\n\nNote that this is not a change in US policy.  The USA often arms nations agains aggressors.  We frick'n did it for Russia when the Nazis invaded. It took a few years to deliver but without US assistance Russia would be a German speaking nation today.", "label": 0}
{"text": "She was wrong not to go Wisconsin a single time in the 2016 campaign. \n\nI don’t necessarily disagree with her nazi comment, but don’t think it's smart to say things like that about the voters either (see the deplorables comment).", "label": 0}
{"text": "Because he knows they will never happen. Trump will say anything he thinks will trick people into voting for him, most of which he will never actually do or be able to do. Unfortunately half the American public is generally stupid enough to believe his bullshit.", "label": 0}
{"text": "Damn skippy … about time too!", "label": 0}
{"text": "5 year subscriber here, just cancelled after I read this and I will not be going back.", "label": 0}
{"text": "NYT definitely went right wing.  Was just talking to someone else about it today : https://old.reddit.com/r/politics/comments/1gbfm28/opinion_the_double_standard_for_harris_and_trump/ltmj33n/\n\nI myself noticed it earlier this year when I saw this image the NY Times used in their story on 3/6/24 regarding the election: https://static01.nyt.com/images/2024/03/06/us/06themorning-nl-combo/06themorning-nl-combo-jumbo.jpg\n\nI don't think a more flattering photo of Trump and a more damaging photo of Biden exists.", "label": 0}
{"text": "Just what I needed -- Another reason to get rid of Amazon permanently", "label": 0}
{"text": "As disturbing as this is, I cannot keep it in my head and am going to give y'all nightmares about it.  \n\nTucker Carlson's fantasy is apparently being bent over Ol Donnie's knee, getting called a bad little girl.  Possibly with a magazine.", "label": 0}
{"text": "With Bezos he is afraid of retribution. He would have just endorsed Trump but he's definitely not doing that so it's no one. He is still an evil billionaire", "label": 0}
{"text": "Seems like they are preparing to launch Fanta in case the nazis get control", "label": 0}
{"text": "Whom do you mean, exactly, when you say that? The RW in France are still in power. Labour moved right, Starmer's basically Tory-lite—& the Tories only really lost out on being coalition leads because support for the *farther-right* party surged. AfD are exploding in Germany. Italy has Meloni...where are the right out of the picture in government, in Europe?", "label": 0}
{"text": "I don’t understand why they can’t endorse a candidate? One admires hitler’s generals, has several sexual assault allegations (and admitted it on tape), and wants to do away with our constitution, this shouldn’t be hard.", "label": 0}
{"text": "Kiss the ring", "label": 0}
{"text": "And we're taking heed of someone who calls themselves 'Charlamagne tha God' why, exactly?", "label": 0}
{"text": "Elon is proudly & Criminally buying an election by masquerading 1million dollar daily \"lottery\" winners in ONLY the Blue Wall states.. not open to all states\n\nWhile Kicking Trump opponents, such as journalists off of his X(Twitter) Platofrm, and simultaneously preventing additional followers to the Kamala Harris X handle\n\nWHILE having private discussions with the leader of a foreign enemy who has thousands of Nuclear ICBM's pointed at every hilltop, valley, pasture and City in the United States\n\nWHILE HE FUCKING is doing this all with Tax Payer funded tax-break subsidiaries and Government contracts\n\nbut internet meme conspiracy about a couple ex-boeing employees is the worst\n\nGreat priorities fellow redditor", "label": 0}
{"text": "They are talking about an Eiffel Tower with trump. ", "label": 0}
{"text": "There's more billionaires supporting kamala than trump. What's that motivational for.", "label": 0}
{"text": "How fucking long would that unbiased factual analysis take? “The real enemy is the radical left. Immigrants are vermin. People who say I’m a facist are the real facists.”", "label": 0}
{"text": "They really need to ditch the \"Democracy Dies In Darkness\" thing. They're just one more dark room in the hallway.", "label": 0}
{"text": "Democracy dies behind a paywall.\n\nCowards.", "label": 0}
{"text": "Cancel his contract.", "label": 0}
{"text": "Needs a constitutional amendment, which requires 75% of states", "label": 0}
{"text": "The article is over a year old so…", "label": 0}
{"text": "WashPo isn't Fox.  WashPo's audience would be a Harris endorsement.", "label": 0}
{"text": "Well you’re voting for someone who went to court for raping a child, playing sexual games with Epstein, and paid out a victim from sexual assault so you tell me.", "label": 0}
{"text": "It’s all calculated. It’s not messed up it’s on purpose and professionally evil", "label": 0}
{"text": "Polls still show a coin flip, but I'd much rather be Harris than Trump in these final weeks", "label": 0}
{"text": "It is most definitely in play. We have to wait to see how day of voting plays out.", "label": 0}
{"text": "My favorite Floyd album", "label": 0}
{"text": "Maybe it's because Washington Post is known to be owned by him and people see it as Liberal. \nI think that maybe helps her. Like look, she's not that liberal (and I believe she really isn't and that's okay)", "label": 0}
{"text": "putin? seems they’re all buddy buddy with him for some reason", "label": 0}
{"text": "I think he means On Paint politics, because this guy has been huffing SOMETHING. The numbers don't even make sense.", "label": 0}
{"text": "Republicans are going to hate this. Especially Trump. Never admit to any wrong doing, ever.", "label": 0}
{"text": "I totally *want* to believe this, but this article is bullshit and is this source even credible?", "label": 0}
{"text": "Seems like he needs to be arrested for violating election law!", "label": 0}
{"text": "It's the conservatives orange Jesus they are just happy he isn't Jewish.", "label": 0}
{"text": "70 Million voters cheer as their Messiah talks about exiling naturally born US citizens.", "label": 0}
{"text": "🚀[Ukraine Discovers Starlink on Downed Russian Shahed Drone](https://www.reddit.com/r/technology/s/JLgRpp6zSM)\n\n\n[Opinion: What does Elon Musk want? SpaceX CEO may pose a risk to national security.](https://www.usatoday.com/story/opinion/2024/10/23/musk-trump-threat-national-security-spacex-military-contract/75731489007/)\nSpaceX has taken unpredictable actions that could impact geopolitical events, raising national security concerns that a key defense contractor could be manipulated by Musk’s impulses.\n\n[Elon Musk Is a National Security Risk](https://demcastusa.com/2024/09/17/elon-musk-is-a-national-security-threat-follow-the-money/)\n\nMusk’s now-deleted post questioning why no one has attempted to assassinate Joe Biden and Kamala Harris renews concerns over his work for the US government—and potential to inspire extremist violence. “And no one is even trying to assassinate Biden/Kamala.", "label": 0}
{"text": "Why does criticism about a tone deaf comment translate to \"taking sides\"?", "label": 0}
{"text": "Electoral college isn’t going anywhere.  It would require a constitutional amendment.  That’s not happening.  It’s hard to envision a constitutional amendment of any kind ever passing again.  The only possible scenario where I could see enough momentum is if Harris wins the EC but loses the popular vote.", "label": 0}
{"text": "Basically yes.\n\nTrump's goons flood the zone with junk polls\n\n\nBillionaires start to believe he's going to win\n\n\nTrump threatens to kill or punish anyone he doesn't like, billionaires prefer to be alive and unpunished\n\n\nBillionaires help him win\n\n\nTrump sends the military after them anyway because lol you thought it was just gonna be other people? Silly rabbit", "label": 0}
{"text": "I’m not sure it works that way. \n\nIf the dollar collapses we might as well have Confederate money.", "label": 0}
{"text": "At what point in time do we question the ethics of allowing these people to amass this level of wealth? At what point in time will we simply seize their assets and force a hard reset on what should be an acceptable amount of money for a single person?\n\nThis experiment has failed. We are just watching it happen and doing nothing to stop it. The safeguards put in place are not functioning as intended.", "label": 0}
{"text": "As opposed to......what exactly?", "label": 0}
{"text": "Yes, Mitch McConnell is all of those things.", "label": 0}
{"text": "What are you talking about? I saw a video of trump throwing a roll of paper towels at people, are you going to sit there and tell me those rolls of paper towels didn't bring life saving/changing aid to them....", "label": 0}
{"text": "\nThis submission has been automatically removed because it comes from a domain that is deemed not appropriate/off-topic for /r/politics\n\n[More information can be found here](http://www.reddit.com/r/politics/wiki/filtereddomains#wiki_other_inappropriate_content)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "Oh look, yet *another* non-active account that just came back today after 8 months to start posting Trump propaganda. \n\nThey're not sending their best lol.", "label": 0}
{"text": "I wouldn’t be surprised if he was the new Epstein.", "label": 0}
{"text": "She always dominates her interviews! Kamala is running circles around them all!", "label": 0}
{"text": "\nAre these the same people who were selling “Democracy Dies in Darkness” shirts not too long ago?", "label": 0}
{"text": "Literally just the NYT poll. \n\nThe source of 99% of dooming this cycle has been NYT", "label": 0}
{"text": "Should the Christo-fascists get in power, they will only be too happy to seize his assets and throw him in with all the other “degenerates”.", "label": 0}
{"text": "It’s not. \n\nIt’s a single source, vs reporting from many rallies/from many different perspectives and angles. Your single experience doesn’t mean a whole lot when compared to an aggregate of information, nor should it be considered the absolute truth when we are being presented with so many other first hand accounts of these kinds of people at these rallies, with alarming consistency.", "label": 0}
{"text": "Shame on Bezos. A Billionaire many times over can’t stand up to pressure and threats. How many more Billions must a man need, before he grows a spine? A coward, period.", "label": 0}
{"text": "That was the LA Times. ", "label": 0}
{"text": "Or use Starlink", "label": 0}
{"text": "What a greater flex than if the Post had endorsed. I will always vote for someone billionaires don't like.", "label": 0}
{"text": "He’s rich and white and male.\n\nIf the question is “why so the fact that Trump said/did/endorsed/supported [insert horrible position or person]”, the answer will *always* be because he is rich and white and a man.", "label": 0}
{"text": "Elon needs Trump to get him out of hot water as he’s been subpoenaed to release all his documents relating to his relationship with Jeffrey Epstein 👀\n\n“In May 2023, the US Virgin Islands subpoenaed Elon Musk for documents related to his interactions with Jeffrey Epstein and JPMorgan Chase:\n\n-Any documents related to fees paid to Epstein or JPMorgan\n\n-Any documents related to Musk’s accounts or relationship with JPMorgan\n\n-Any documents related to Epstein’s involvement in human trafficking\n\n-Any documents related to Epstein’s procurement of girls or women for commercial sex\n\n-Any documents related to communications between Musk and JPMorgan regarding Epstein\n\n-Any documents related to Epstein’s role in Musk’s financial management \n\n\nThe subpoena was part of a lawsuit against JPMorgan Chase by the US Virgin Islands, which accused the bank of enabling Epstein’s sex trafficking. The US Virgin Islands believed that Epstein may have tried to refer Musk to JPMorgan as a client.”\n\n\n\nDid anyone else watch Elon’s interview with Tucker? \n\nTucker: “If he loses, man. What? You’re f*cked dude.”\n\nElon: “I’m f*cked. If he loses, I’m f*cked” …\n\n“Yeah. Yeah. How long do you think my prison sentence is going to be? ...Will I see my children? I don’t know.”", "label": 0}
{"text": "red states would never allow that to happen unless they got burned by the electoral college but hopefully she can get a trifecta to pack the courts and do something to take the right wing smear machine down a peg", "label": 0}
{"text": "Right now speed limits are mandatory. That mandate is enforced via fines. If we made the fine for speeding $0. Are speed limits mandatory?\n\nYou can't say you like the idea of mandatory voting if you hate the idea of penalties for not voting (or submitting a blank ballot, which allows people to not cast a vote in protest but avoid the fine)", "label": 0}
{"text": "Harris filled the same convention hall in Milwaukee that Trump did with the RNC, while also filling a convention hall in Chicago, during the DNC.  Trump has done nothing in WI to grow his base. The vote you don't see in the polls in WI, is the women who live with a Trump supporter vote. It is the demographic I think most polls are missing. \n\nTammy Baldwin is highly liked in WI, and on the ballot against a guy from California, who doesn't understand how important agriculture is in Wisconsin.", "label": 0}
{"text": "The hottest places in hell are reserved for those who, in times of great moral crisis, maintain their neutrality. Dante Alighieri.", "label": 0}
{"text": "So they are endorsing trump, but too afraid to say it.", "label": 0}
{"text": "Smedley Butler is needed again.", "label": 0}
{"text": "Just unsubscribed from the WP for this nonsense, after years of the Post being my #1 news source. There are plenty of news sources out there that won't pull this kind of stunt, that I can turn to instead.", "label": 0}
{"text": "It really gives you hope. They were never scared of Biden or Obama but now they fear Kamala might actually tax them and make them pay their fair share", "label": 0}
{"text": "2020 polls had Biden winning and basically never dipped the other way", "label": 0}
{"text": "The Oligarchs are really Oligarching", "label": 0}
{"text": "Elon Musk is just an absolute greezy pathetic alt right maga racist wannabe dicktator POS with a dirty car, Just an absolute Dipsht", "label": 0}
{"text": "No, he proves he’s just an asshole", "label": 0}
{"text": "> I’m not going to engage in a bullshit ‘conversation’ when people compare opinions each convinced there’s is correct. It’s a waste of time.\n\nBut you're making factual statements? France just installed a RW PM. How does that mean they have \"little power?\"", "label": 0}
{"text": "Donald trump????  Wait til you see what the Christians are doing.", "label": 0}
{"text": "Just canceled my subscription. I was even paying full price, because I believe in supporting journalism. Not this rag. Not anymore. Jesus wept. Slinking coward.", "label": 0}
{"text": "Well I'm glad someone came to their senses.  Only Kamala Harris gives Gaza any hope for survival.", "label": 0}
{"text": "I’ve seen him featured in a pro Trump commercial though.", "label": 0}
{"text": "> Trump being a ‘fascist’ could invite assassination attempt\n\nCorrected that for you, TheShill.com.", "label": 0}
{"text": "A vote for Trump is a vote for living under billionaire rule", "label": 0}
{"text": "But a person who went to court for child rape should be??", "label": 0}
{"text": "I have cancelled my Washington Post subscription. What happened to Democracy dies in darkness?", "label": 0}
{"text": "Ok, MAGA fascist.", "label": 0}
{"text": "Flawless except the part where she never earned a single primary vote this year and covered up for her boss’s declining mental state.", "label": 0}
{"text": "Feels like his campaign knows he is doing bad, and they have begun operation “election is rigged”", "label": 0}
{"text": "putin's perv..", "label": 0}
{"text": "First of all, how dare you for assuming I’m a non-billionaire!!!", "label": 0}
{"text": "that is an imitation of 18th century documents like the Declaration of Independence.", "label": 0}
{"text": "Mine is two weeks from renewing.  Perfect timing.", "label": 0}
{"text": "This is highly unlikely. Don't just hit that user with drive by copium for no reason.", "label": 0}
{"text": "Start charging these corporate press companies millions of dollars in subscription fees to cover WH press briefings. They get them for free and charge us for trying to read them. Define what The Free Press is and argue that the concept is not one that is within the Constitutional definitions and therefore cannot be protected by it any longer. Changes have come at all times in our history and now is one of them.", "label": 0}
{"text": "Yup. Rank-and-file Nazis don't get a pass.", "label": 0}
{"text": "Why? His supporters won’t card what’s on it. He’s already been convicted 34 times.", "label": 0}
{"text": "It should be. But based on a lot of the Gen Z chatter I've been seeing, I don't see her winning.", "label": 0}
{"text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "MAGA always thinks they're going to win until they don't, but you're right, if they were so sure Trump was going to win they wouldn't be desperately trying to purge voter rolls or steal EC votes.", "label": 0}
{"text": "What's the point of having fuck you money, if you never say Fuck you?", "label": 0}
{"text": "Trump didn’t crack 47% in either of the last two elections, and I’m supposed to believe he’s gotten MORE popular since then? \n\nWin or lose it’s wild to me that he apparently is just a huge, once-in-a-generation statistical anomaly", "label": 0}
{"text": "Harris will win. Early voting seems great in the blue wall states. \n\nPolling is herding to a tie.", "label": 0}
{"text": "The reason is that if you plan on voting early and something comes up, you have other chances. If you wait for Election Day, you could get sick, your car could break down, there could be a weather disaster, etc, and you might lose your chance to vote.", "label": 0}
{"text": "He's been talking to Putin for the last 2 years. Probably thinks trump will keep him out of prison", "label": 0}
{"text": "I can see it. At some point, their choice will fall between Oligarch and being shot, jumping from a balcony.", "label": 0}
{"text": "With a global population of 9 billion there's a 0.000033% chance a billionaire responded to me. That's better than six sigma reliability which we use to prove particle physics.", "label": 0}
{"text": "So your argument is that good guy Shokin needed to be silenced, and an international coalition of nation states and media figures, along wirh the IMF and World Bank and Ukranian Parliament, conspired together to make him look bad and get him fired, but they overlooked the NY Post, and couldn't just do something more direct about Shokin, and he's still walking around free saying nothing?", "label": 0}
{"text": "They are figuring that someone still needs to sell books to the fascists.", "label": 0}
{"text": "What? Dude a watched a video link of someone I never saw before and he was someone else I had never seen before. WTF", "label": 0}
{"text": "For what to be allowed? The whole report is about a phone call or two that allegedly happened between Putin and Musk. Are they not allowed to talk? I am sure they or even you could have a phone call with Putin. My guess is these were with the full knowledge of our intelligence agencies and quite likely at their urging to see what information Putin may reveal. If it were anything improper Biden would be leaking that information months ago. As Musk has security clearance I am sure there is protocol and disclosures when or if he communicates with Putin. \n\nThe people posting treason and crying are very low iq people. If Musk is so pro Putin why did he at Starlinks own expense support Ukraine? A move that Ukraine has said drastically helped them in the war. \n\nThe article disclosed no information that could be considered improper.", "label": 0}
{"text": "She can flip it", "label": 0}
{"text": "We need Ranked Choice Voting like Maine!", "label": 0}
{"text": "Biden didn't give NYT an exclusive they wanted, so they took him down.", "label": 0}
{"text": "She’s going to take GA and AZ too", "label": 0}
{"text": "Newspaper endorsements don't persuade anyone.", "label": 0}
{"text": "It would be funny if Fox News just pivoted to having left wingers on their because they found it drew higher ratings as right wingers enjoyed hate watching the spectacle", "label": 0}
{"text": "Apparently democracy is optional these days.", "label": 0}
{"text": "Me four", "label": 0}
{"text": "Yet, I will defend, until I die, that psyduck is, in fact, a duck.", "label": 0}
{"text": "Thanks, just canceled my WaPo and Amazon Prime subscriptions.", "label": 0}
{"text": "Paul Perez can fuck all the way off. \n\nTrump doesn’t care about the border or he wouldn’t have told Congress not to sign the border bill. \n\nAND …. he just now implied that Governor Walz didn’t actually serve in the military.", "label": 0}
{"text": "So I was there and the crowd fucking went crazy. They ALL thought it was hilarious. My buddy and I just kinda stared at each other in disbelief. Tucker called us all girls that needed a spanking from daddy and they loved it.", "label": 0}
{"text": "Amazon boy could never be allowed to come out publicly supporting his man Trump. It would tank the company. Liberals love Amazon.", "label": 0}
{"text": "That’s a lot of fries, Donny.", "label": 0}
{"text": "True true. But an authoritarian Trump regime isn’t going to be playing with kid gloves. \n\nAnd half the population will support everything he does just to own the libs who, in their mind, are pure evil vampiric pedophiles hell bent on brainwashing their kids into transsexual cats.\n\nI fucking wish I could put /s there.\n\nThis is to say nothing of the massive deleterious effects any type of uprising, civil war, or similar would have both at home and abroad.\n\nWe are STILL seeing the effect of the Civil War. Think about that. An uprising in America would negatively affect production, foreign relations, population, education, etc. I can’t think of a metric that wouldn’t be negatively impacted for generations. This is why it’s so important to ensure robust guardrails for our democracy. To vote. To encourage our representatives to engage in the most effective tactics for political domination.\n\nThe system CAN be changed. Recent conservative success proves that. We just have to be willing to play the system for maximum advantage.", "label": 0}
{"text": "I'll give him credit: He's revealing how 2-tiered the justice system is right now.", "label": 0}
{"text": "[Senate Minority Leader Mitch McConnell](https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-mitch-mcconnell-maga-republican-book-b2634795.html) and [House Speaker Mike Johnson](https://www.independent.co.uk/topic/mike-johnson) on Friday warned that Vice President [Kamala Harris](https://www.independent.co.uk/topic/kamala-harris) is “inviting” another assassination attempt against [Donald Trump](https://www.independent.co.uk/news/world/americas/us-politics/trump-harris-election-live-updates-polls-rally-b2635042.html) by calling him a [fascist](https://www.independent.co.uk/topic/fascist).\n\n“The man who was caught waiting in ambush in Florida left others with a chilling call to arms: ‘It is up to you now to finish the job’. Labeling a political opponent as a ‘fascist,’ risks inviting yet another would-be assassin to try robbing voters of their choice before Election Day,” the Republicans [wrote](https://www.mcconnell.senate.gov/public/index.cfm/pressreleases?ID=5CBC805B-A26E-4098-B09A-182D1EF4B193) in a joint statement.\n\n“Vice President Harris may want the American people to entrust her with the sacred duty of executive authority. But first, she must abandon the base and irresponsible rhetoric that endangers both American lives and institutions.”\n\n[Read the full story](https://www.independent.co.uk/news/world/americas/us-politics/mitch-mcconnell-trump-fascist-harris-b2635833.html)", "label": 0}
{"text": "By staying away from republicans.", "label": 0}
{"text": "Those EV values are so fucking wrong it is hilarious. \n\nThis dude has Nevada as having 32 fucking EV.", "label": 0}
{"text": "Do we know that he is actually paying this money out? It would not surprise me if the winners are all fake.", "label": 0}
{"text": "stops just short of including voters, but give it another day or two and  he'll start including them.", "label": 0}
{"text": "If you really believe there is any difference between the Conservative Party and the democratic then you are exactly the person they want to be in control of.", "label": 0}
{"text": "Amazing how he wrote that even before WW2.", "label": 0}
{"text": "Everything about Trump should be an immediate disqualifier", "label": 0}
{"text": "But you’ll vote for a child rapist like trump? Tell me how that makes sense again?", "label": 0}
{"text": "Honestly, I take comfort in knowing this country gets exactly what it deserves.", "label": 0}
{"text": "Just at the right time, before the election.", "label": 0}
{"text": "Trumps parents were German immigrants", "label": 0}
{"text": "Jeff bezos has bent the knee.", "label": 0}
{"text": "How fitting, the WAPO is firmly sticking to its slogan “Democracy Dies in Darkness”. Dark days indeed…", "label": 0}
{"text": "Billionaires in the US: I wish this country were more like Russia, then I wouldn't have to worry about silly things like taxes and employee safety.\n\nBillionaires in Russia: Please daddy, I didn't mean to doubt you, it's just that I lost most of my fortune in the sanctions, wait, please, not the windowwww aaaaaaaiiii^(iiiii)^^(iiiiii)^^^(iiiiiii)", "label": 0}
{"text": "McConnell is a fascist.", "label": 0}
{"text": "Technically, there are more billionaires supporting Kamala from what I saw on the PAC contribution list. However, the deranged ones are with Trump.", "label": 0}
{"text": "Did that person put these people in a basket? ", "label": 0}
{"text": "Aren't there laws against private citizens consorting with foreign leaders?", "label": 0}
{"text": "I mean I think at this point we have enough evidence to say that he is, for better or worse.", "label": 0}
{"text": "Some people are against genocide. Not all people, but some.", "label": 0}
{"text": "Scaramucc!", "label": 0}
{"text": "If we can even call them authors…", "label": 0}
{"text": "Yep. That's not the messaging of someone who believes that they're going to win the election.", "label": 0}
{"text": "Arrest him now", "label": 0}
{"text": "Anderson getting rattled like that said a hell of a lot. The game’s up and he, and most of Legacy Media, are in for a reckoning regardless of who wins.", "label": 0}
{"text": "Tax all billionaires out of all existence with extreme prejudice.", "label": 0}
{"text": "Bad day to come back my friend, just wait till after the rally see Harris speak does wonders.", "label": 0}
{"text": "> Secondly why isn't the media putting more pressure on Trump to detail out policies ?\n\nBecause, as CNN put it this week, the fix is in. It's two different playbooks.", "label": 0}
{"text": "Just fvck this ass hat.", "label": 0}
{"text": "Spot on.", "label": 0}
{"text": "umm.. Are his kids ok?", "label": 0}
{"text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "This submission source is likely to have a hard paywall. If this article is not behind a paywall please report this for “breaks r/politics rules -> custom -> \"incorrect flair\"\". [More information can be found here](https://www.reddit.com/r/politics/wiki/index/#wiki_paywalls)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "Fascist Fascist Fascist Fascist Fascist Fascist Fascist Fascist Fascist Fascist Fascist Fascist Fascist Fascist ...", "label": 0}
{"text": "Yep, lots of right leaning polls making this seem like a dead heat (or small Trump lead in PV) makes me think that the actual polls the campaign is running show a big Kamala lead, like most of the non polling data seems to hint to.\n\n\nThe coin flip narrative is necessary for them to cry foul if she does get a sizeable win.  Since they had to promote early voting this round, couldn't lean on an early Dem deficit like in 2020, so now they've moved to polling and betting sites.  So obviously it will be \"rigged\" if she wins big.", "label": 0}
{"text": "Because of course he did. Not only does he look like Alex Luthor, he increasingly behaves like him.", "label": 0}
{"text": "Yes the rich guy might be lying instead of the multiple people quitting. Time to override your training bud", "label": 0}
{"text": "you could find the blueprint for the Kennedy assassination on Trumps phone and it wouldn’t change one thing.", "label": 0}
{"text": "That’s actually worse than the take I was expecting! \n\nNo further questions.", "label": 0}
{"text": "Amazon is the worst company I have ever worked for. I did the holiday season as a picker in 2013 and they worked us for about 60 hours a week. I left home when the sun was down and came back when it was down and nobody there gave a single fuck about you or what it meant to work together as a team. The section of the warehouse I was in only has a single stall restroom. I do not exaggerate here at all, the other one was on the way other end of the building. I once had to sit and let my stats go to shit because I had to take a shit and it took almost 45 minutes of waiting. I left before the end of the season, this was my first job back from a deployment to Afghanistan for the army which was way better in comparison. I avoid Amazon like the plague, it’s a last resort that I hate having to purchase from. Screw this company, they openly shit on their bottom line employees who run it.", "label": 0}
{"text": "Hey undecided voters, I'm from Europe and as an outside observer I can tell you that this shit isn't normal, this guy is a clear fascist and electing him will jeopardize everything you have.", "label": 0}
{"text": "Ah so shocked", "label": 0}
{"text": "It is still pond scum.", "label": 0}
{"text": "All you folks who are mad because a massive member of the media is REFUSING to use their influence to publish a political preference is discussing. The hypocrisy of your disdain for media neutrality is unreal.", "label": 0}
{"text": "Trump will probably bring about the quickest conclusion to the war, I mean Israel will just kill everyone in Gaza, but it would be the quickest.", "label": 0}
{"text": "Trump's interviews always go so perfectly it must be hard for her to compete with such a genius.", "label": 0}
{"text": "> Kamala Harris has earned an eleventh-hour show of support from Palestinian, Arab, and Muslim community leaders.\n\nThis is very big, and very important news.  And of course they obscure it with a clickbait headline.", "label": 0}
{"text": "If the NRA is allowed to ban guns at their rallies and events...", "label": 0}
{"text": "Maybe Texas won't flip blue for POTUS yet, but I think Allred has a shot at the Senate. I'm in NC, and I feel a bit better about the odds of us flipping over TX, but it's possible we also may have some blue wins down the ballot and go red for POTUS.", "label": 0}
{"text": "Geez, Republicans, you don’t have to shoot him.\n\n Just don’t vote for him.", "label": 0}
{"text": "Can you tell me the difference at this point?", "label": 0}
{"text": "If you cancel your Prime subscription it makes it much easier.", "label": 0}
{"text": "How can anyone not see this man as just pure evil? He has more money than he could ever spend in hundreds of lifetimes, but refuses to endorse a candidate that would literally save Democracy from fascism because he doesn't want to pay his fair share in taxes.\n\nFucking insane.", "label": 0}
{"text": "And the last amendment to be written and passed was in the 1970's. The 1992 one doesn't count in my view, it was written in the late 1700's, and was forgotten about until a scholar found it in a metaphorical box", "label": 0}
{"text": "I think winning Florida and Texas is unlikely. 319-219 is completely reasonable given state polls.", "label": 0}
{"text": "The guy who literally calls his page \"hopiumchronicles\"? It seems decently solid but idk if I'd trust him to not miss something", "label": 0}
{"text": "Oh Jeff... you'll be okay with Harris...I think you'll avoid food stamps! Go kill the next B& M,  mall dinosaur maker!", "label": 0}
{"text": "Another Republican?  Well, that's a risk we'll have to take", "label": 0}
{"text": "Quote:\n\n>Some of the Republican women that Prime’s organization is talking to have requested that no mailers or ballots be sent to their home, she told me, because they don’t want their husband to find out. They plan to “go into the voting booth, vote their conscience, and never admit to it,” she said. When you talk to anti-Trump Republicans about this clandestine sisterhood, they will share stories about [sticky notes](https://www.nbcnews.com/politics/2024-election/harris-sticky-notes-women-restrooms-gyms-tampon-boxes-rcna172570) in bathroom stalls reminding women that who they vote for is secret. Back in 2016, pollsters identified the [“shy Trump voter” phenomenon](https://www.vox.com/2020/11/1/21544644/shy-trump-voters-polling-error-explained), which referred to the poll respondents who were unwilling to admit that they were voting for Trump—and thus went unrepresented in surveys. Prime and other anti-Trump conservatives are hopeful that a similar phenomenon happens again, but in reverse: the shy anti-Trump voter. “We could be surprised on Election Day and the days after that there’s a silent majority, a quiet groundswell” in support of Harris, she said.\n\n>The problem with a quiet groundswell, though, is in its name. All of these hopeful anecdotes are impossible to translate into hard data about voter numbers and behavior. And some on the left [are frustrated with](https://www.nytimes.com/2024/10/24/us/politics/kamala-harris-progressives-democrats.html) Harris’s closing strategy, partly, because it’s an appeal to Republicans. “She’s trying to win without the base,” as Naomi Klein, the progressive author and columnist, [put it this week](https://www.democracynow.org/2024/10/22/naomi_klein_2024_election_harris_trump).", "label": 0}
{"text": "His entire bandwagon of simple celled organisms have the same cognitive defect as him as well", "label": 0}
{"text": "> Sen. Orrin Hatch, R.-Utah, considered one of the U.S. Senate’s foremost scholars of the Constitution and the Supreme Court, told Newsmax Friday he felt President Obama would nominate a decidedly liberal candidate to succeed the late Antonin Scalia on the Supreme Court.\n\n> \"He could be headed in that direction,\" replied Hatch who has served as either chairman or ranking Republican on the Senate Judiciary Committee from 1993-2005, \"This [nomination process] is all about the election.\"\n\n> \"The President told me several times he’s going to name a moderate [to fill the court vacancy], but I don’t believe him,\" Hatch told us.\n\n> \"[Obama] could easily name Merrick Garland, who is a fine man,\" he told us, referring to the more centrist chief judge of the U.S. Court of Appeals of the District of Columbia who was considered and passed over for the two previous high court vacancies.\n\n> But, Hatch quickly added, \"He probably won’t do that because this appointment is about the election. ***So I’m pretty sure he’ll name someone the [liberal Democratic base] wants.\"***^^\n\nDoesn't that last line imply Garland is who the Republicans wanted. Get it now? Asshole!", "label": 0}
{"text": "Let’s walk the dog on this one… policies like shutting down states for way longer than needed, including *against* the federal government’s recommendations, came from governors of which political party?\n\nTake your time, I’m fine waiting.", "label": 0}
{"text": "Oh no!\n\nI think I left my curling iron on.", "label": 0}
{"text": "Maybe. It’s not like investigators let everyone know who’s being investigated and why the second they start out. We would only know about it by the time they were preparing to charge someone.", "label": 0}
{"text": "Billionaires have too much power over society.  We need to revive that 90% tax bracket to keep them up n check.", "label": 0}
{"text": "Hilary insisting that America is already great, everything is fine, you're wrong for complaining, etc...was a huge mistake then, and it's a huge mistake now.", "label": 0}
{"text": "A lot of the “bad” capitalism can be attributed to executive pay and option grants that are out of control.\n\nLook at executive compensation in Europe and you’ll see it’s not nearly as lucrative.\n\nI’m okay with capitalism, but not okay with greed.\n\nBetter money management has made it so generational wealth is protected and passed on. That’s also a problem.\n\nAnd taxes on the wealthy and corporations- there is little trickle down.", "label": 0}
{"text": "I want an interviewer to ask Tucker how he'd deal with a 15 year old hormone ridden son, coming home and flipping off his dad.\n\nWould daddy Tucker tell him to take his pants off because he's been a bad little boy and he's getting a vigorous spanking?\n\nWhy or why not, Tucker?", "label": 0}
{"text": "Sure, like those 2 who tried to assassinate Trump", "label": 0}
{"text": "Going off of Germany as a template, Canada would get annexed since \"we're basically the same.\" There will be some hubbub about how China and Russia are active in the newly-thawed arctic and how Canada lacks the might to stand against them. PP will sign whatever documents Trump puts in front of him. Canada will be in name only, a puppet of the US.\n\nOn the south side of the USA, the current border rhetoric will increase. The current state of Mexican cartels gives the fascists their narrative. Mexico will be declared a cartel-run failed state and all sorts of things will be blamed on them. To secure its southern border, they will claim they need to invade Mexico and the fascists will steamroll their way all the way down to the Panama Canal.", "label": 0}
{"text": "For someone who calls himself \"relentless\" all the time, this was a cowardly and stupid move. Nothing else would have been so likely to cause me to cancel my Prime subscription.", "label": 0}
{"text": "Nah. NASA should have never stopped cooperation with Russia and it should be cooperating with China. Make outer space a worldwide project and ditch the creepy nationalism thanks. \n\nAlso while we're at it you could have always chosen to KEEP NASA instead of outsourcing it to billionaires including but NOT limited to Musk.", "label": 0}
{"text": "I was proven wrong. And I can accept to be proven wrong. I learn and move on. Maybe I’m a good example for others.", "label": 0}
{"text": "You literally just did that by saying I was wrong and refusing to elaborate...", "label": 0}
{"text": "Harris will tax billionaires, remember?!?", "label": 0}
{"text": "I just canceled mine. I think I had been subbed for like a decade straight. Canceled my WaPo sub as well.", "label": 0}
{"text": "nah this editor dipped too", "label": 0}
{"text": "Well he saw first-hand the US involved with \"gunboat diplomacy\"", "label": 0}
{"text": "I am frustrated by people who never vote yet complain online about their struggles.  You don't get to whine when you don't even vote. /sigh", "label": 0}
{"text": "Exactly. If two unanimous sexual assault rulings by two separate juries didn't persuade them, nothing will. Throw it on the pile:\n\n[The 26 women who have accused Trump of sexual misconduct](https://www.businessinsider.com/women-accused-trump-sexual-misconduct-list-2017-12)\n\n[Ex-Wife Accused Donald Trump of ‘Violating’ Her; Spokesman Claims Marital Rape Is Legal](https://nymag.com/intelligencer/2015/07/spox-on-trump-allegation-marital-rape-is-legal.html)\n\n['You Can Do Anything': In 2005 Tape, Trump Brags About Groping, Kissing Women](https://www.npr.org/2016/10/07/497087141/donald-trump-caught-on-tape-making-vulgar-remarks-about-women)\n\n[Jury finds Donald Trump sexually abused E. Jean Carroll in civil case, awards her $5 million ](https://www.cnn.com/2023/05/09/politics/e-jean-carroll-trump-lawsuit-battery-defamation-verdict/index.html)\n\n[Trump Ordered to Pay $83.3M in Sexual Assault Defamation Case ](https://www.voanews.com/a/jury-begins-deliberations-in-trump-sexual-assault-defamation-case-/7458971.html)\n\n[Judge clarifies: Yes, Trump was found to have raped E. Jean Carroll](https://www.washingtonpost.com/politics/2023/07/19/trump-carroll-judge-rape/)\n\n[Donald Trump Fantasized About Having Sex With Ivanka](https://newrepublic.com/post/173968/donald-trump-fantasized-sex-ivanka-new-book-says)\n\n>Aides said he talked about Ivanka Trump’s breasts, her backside, and what it might be like to have sex with her, remarks that once led \\[Chief of Staff\\] John Kelly to remind the president that Ivanka was his daughter.\n\n[Teen Beauty Queens Say Donald Trump Walked in on Them Changing When They Were as Young as 15](https://people.com/politics/donald-trump-walks-in-miss-teen-usa-contestants-changing/)\n\n>“He just came strolling right in. There was no second to put a robe on or any sort of clothing or anything. Some girls were topless. Others girls were naked. Our first introduction to him was when we were at the dress rehearsal and half-naked changing into our bikinis.”\n\n[Trump told Stern he walked backstage when beauty queens were naked](https://thehill.com/blogs/ballot-box/presidential-races/300093-trump-confirms-he-walked-backstage-when-beauty-queens/)\n\n>“No men are anywhere, and I’m allowed to go in, because I’m the owner of the pageant and therefore I’m inspecting it. … ‘Is everyone OK?’ You know, they’re standing there with no clothes. ‘Is everybody OK?’ And you see these incredible-looking women, and so I sort of get away with things like that.”\n\n>– Donald J. Trump, 2005", "label": 0}
{"text": "I prefer this over the million dollar lottery stunt another billionaire is pulling.", "label": 0}
{"text": "I admire your psychotic optimism.", "label": 0}
{"text": "I think Jon Stewart would be great but he wouldn't touch that thingy with a ten foot pole", "label": 0}
{"text": "That simply isn’t true.  It’s because the experiment worked that they are trying to destroy it.\n\nThey want the Russian Oligarchs model.", "label": 0}
{"text": "I'm fine with all the people that broken the law, to be held accountable by the law and by a unbiased system of justice.", "label": 0}
{"text": "If she’d said that she would have been crucified in the media and the right wing would still be talking about it. She’s being treated very differently than Shitler is but his cult followers don’t care. At this point half the country would vote for Putin over a Democrat just to own the libs.", "label": 0}
{"text": "The issue is the owner overrode the editorial staff with a lame excuse.  Clearly Bezos and his lacky knew what the endorsement would be months ago and could have sleazed out with this excuse them.  No he waited to 2 weeks away and it is pathetic.", "label": 0}
{"text": "Well, at least these folks get it.", "label": 0}
{"text": "Jeff Bezos", "label": 0}
{"text": "If it wasn't for Roy Wood Jr and Fareed Zacharia, I would seldom watch CNN. Two lights in the darkness.", "label": 0}
{"text": "Thanks. It’s necessary. Should have done it a while ago. Connected with an old passion (baseball) as a distraction. It’s surprising what turning off for just a few days can do.", "label": 0}
{"text": "If Dems stopped writing off states like Texas as a loss, we'd have held the majority since Obama.", "label": 0}
{"text": "The battle between fascists and christo-fascists would be interesting to watch if it weren’t also terrifying.", "label": 0}
{"text": "I never heard it before and looked it up. I can’t think of a more descriptive word.", "label": 0}
{"text": "Because he’s part of the oligarchs. It’s wild to me that poor people are the one’s voting for who the billionaires want to win.", "label": 0}
{"text": "Who hears him say \"At levels never seen before in this country\" for the 500th time and thinks \"This is my man\"? It doesn't make me angry. It doesn't upset me. It doesn't trigger me. It makes me cringe. It gives me a ick. It's the sensation of something wet going in my ear or a mustard and strawberry sandwich.", "label": 0}
{"text": "I got my acronyms wrong, just fixed it. WSJ is actually conservative leaning, and if WSJ endorsed Harris would have actually had more of an effect.", "label": 0}
{"text": "So, lemme get this straight... \n\n--When the polls are for Kamala, polls are actually very accurate and we should trust them\n--When the polls are for Trump, we hate the polls because they're conservatively biased and can't wrap our heads around how this is possible\n--Anyone who expresses realistic worry about new statistics is a doomer \n\nwtf are we doing in here lol", "label": 0}
{"text": "Maybe it’s time to have the FBI and IRS put him under their microscopes while they still can.  🤷🏽", "label": 0}
{"text": "and Bezo's doesn't like Trump either. Money talks", "label": 0}
{"text": "And you think we don't already?", "label": 0}
{"text": "Billionaires have so much money, they can’t spent it all in their great great grand children’s lifetime. Yet they’ll ruin democracy so it’ll last 200 years instead of 150 years.", "label": 0}
{"text": "you can't get rid of electoral college without a constitutional amendment so we would need a dem landslide of epic proportions which unfortunately won't happen this year.\n\nHowever passing the voting rights act would help a ton, since Rs are making state laws which specifically try to rig elections suppressing certain voters.", "label": 0}
{"text": "Democracy dies in darkness. The billionaires don't even pretend to give a fuck anymore. They are full-on taking over unless the people can stop them.", "label": 0}
{"text": "“Democracy dies in darkness” is apparently a promise. If we’ve lost free press, we’re already closer to fascism than any of us should be comfortable with.", "label": 0}
{"text": "Stretch. I don't know of any General (who was active) who fell into knowingly lying about that.", "label": 0}
{"text": "No, it doesn't. There's just a huge disconnect there. She's encouraging people to not vote for him, she has not advocated violence in any way at all.", "label": 0}
{"text": "I think that's how much he thinks the final spread will be. Which is maybe more hilarious.", "label": 0}
{"text": "We already have that, but we're witnessing the slow roll the first amendment brought to you by the billionaire class.", "label": 0}
{"text": "America is already an oligarchy.", "label": 0}
{"text": "Don’t forget the anthem - “I’MA KEEP RUNNIN CAUSE A WINNER DON’T QUIT ON THEMSELVES”", "label": 0}
{"text": "It’s going to be pretty crazy to see Drudge Report as the last free press.", "label": 0}
{"text": "“Democracy dies in darkness.” Billionaires are killing America.", "label": 0}
{"text": "No you're not.", "label": 0}
{"text": "Honestly, I am not liking the early voting trends.  Democrats lead in PA, MI, and WI but are behind the GOP in every other battleground state (based on party affiliation of those who've already early voted.)  She will not win if this trend continues.", "label": 0}
{"text": "I’m telling you now, Trump’s password is 4547 and Vance’s password is 6116.", "label": 0}
{"text": "I guess Jeff Bozo needs a tax cut.  He's barely scraping by.", "label": 0}
{"text": "Nazism is alive and well in MAGA.", "label": 0}
{"text": "pretty dark in bezos' pocket lmao", "label": 0}
{"text": "No way he'd use sexycouch69. You have to care about your lover's needs to 69.", "label": 0}
{"text": "I enjoy reading his newsletter. But he's the ultimate optimist he sugar coats things all the time. He also only reports on favorable statistics. But that said I still hope he's right.", "label": 0}
{"text": "Sorry about that. It was for some project that I didn’t complete. All fixed.", "label": 0}
{"text": "I’m not sure, I’m only following Texas closely", "label": 0}
{"text": "This gets more and more dire.  \n\nFrom \"recused\" to \"investigated\" to \"imprisoned\", and now we're up to \"deported\" (to where exactly?).  \n\nWhat's next, launched into the Sun?", "label": 0}
{"text": "Cancel Amazon Prime!", "label": 0}
{"text": "Canceled mine too", "label": 0}
{"text": "We are also going to pretend that WaPO and the NY Times have not endorsed a Republican candidate in the last forty years.", "label": 0}
{"text": "None of the time travelers they caught from the future are Democrats.", "label": 0}
{"text": "And Republicans will never hear about this, or if they do, they're so irrational and partisan that they'll tell themselves something like 'Well, the Dems do it 10x as much!\" We're doomed. Humans are too stupid to resist propaganda.", "label": 0}
{"text": "She seemed to be fatigued and having difficulty answering questions. Maybe it’s best candidates  try to be well rested before they do interviews, because it becomes a permanent part of online scrutiny. \n\nI understand that is not always possible, but it is better to reschedule or cancel an interview than to do poorly.", "label": 0}
{"text": "That's what the Maga traitor fascists want to believe all right. But it's just more right wing delusional and anti american bullshit", "label": 0}
{"text": "We got all this, ya know, evidence. Judge should be like, bang, guilty.", "label": 0}
{"text": "The large cohort of traditional republicans, included elected officials, saying they cannot in good conscience support Trump in 2024, oh wait...", "label": 0}
{"text": "As a queer person, I don't take comfort in this at all. And I don't think I deserve what they have planned. ", "label": 0}
{"text": "What a wet wipe", "label": 0}
{"text": "I always found it odd that newspapers issue endorsements. i realize nothing is ever really neutral, but I think it makes it harder for people to trust news sources", "label": 0}
{"text": "Well yeah there aren't many times that legacy media can really stand up and shine vs the modern hyper focused digital content we all consume. \n\nDay to day we like to silo ourselves into the granular but this is nothing like the everyday. These couple of weeks are quite possibly existential and the big orgs have shown themselves weaker and meeker than the average youtuber with 5k subs.\n\nI'm not sure how they'd answer a question of \"why do you exist anymore?\" and I don't think they do either.", "label": 0}
{"text": "And the polls have generally been wrong for the last three elections so there‘s a reasonable chance they‘ll be wrong again. But that works both ways.", "label": 0}
{"text": "It makes sense when you think polls are systematically wrong by 5% like they were in 2012, 2016, and 2020", "label": 0}
{"text": "Maybe fatass should stop being fascist, if it's so goddam dangerous to be labeled one", "label": 0}
{"text": "You're right, let's try full-on fascism instead! Good one!", "label": 0}
{"text": "There's not a syllable that this man got wrong. And Anderson really needed to shut up and let the others talk.", "label": 0}
{"text": "Absolutely disgusting stuff. Fucked.", "label": 0}
{"text": "Good point, “Holocaust survivor rips Kamala Harris for boosting Trump-Hitler comparisons, says ex-prez is ‘a mensch’” is the actual title. Report the article. I would, but the moderators don’t want to hear from me", "label": 0}
{"text": "Don’t worry. Merrick Garland would never drop the ball.", "label": 0}
{"text": "can you elaborate on why you speculate anyone from death row is tied up in Diddy shit?", "label": 0}
{"text": "No. \n\nAnd, no. \n\nRespectively.", "label": 0}
{"text": "Top of the naked pyramid at Guantanamo for Elon.", "label": 0}
{"text": "Beyond owns the Apprentice tapes too. He bought MGM a few years ago. \n\nI knew there was a reason he hadn’t released them.", "label": 0}
{"text": "Starlink is a new level of fucked up, however.\n\nSeize Starlink.", "label": 0}
{"text": "He still seems to be at his normal ceiling, there's not any evidence suggesting he's breached it. FWIW, the vibes in conservative-world are up, but not nearly at the shrill fever-pitch of 2020 between the lock downs and the BLM protests.", "label": 0}
{"text": "I suspect this is different.  Harris wont certify an election with provable fraud if she loses.", "label": 0}
{"text": "actually those that know him like him.  it is people like you who do not know him that hate him.   and really have no valid reason to.  They just  live being part of the hive mind.\n\nAnd, way to not even address the OP.", "label": 0}
{"text": "> eminent domain and no recompense\n\nbest get that unconstitutional shit out of my USA 🇺🇸 🦅before I quarter soldiers in your house", "label": 0}
{"text": "These men were raping kids together, you’re disgusting for defending predators of the highest caliber \n\nWomen should be allowed to be invited places without being molested by disgusting perverted fascists", "label": 0}
{"text": "It’s the other way around\n\nAs Nate PVC says, when the polls move in Kamala’s favor it’s actually bad news for her 🤓", "label": 0}
{"text": "Any intelligence from the repuglicans is, by default, artificial.", "label": 0}
{"text": "They are aspirational lords. They want to be lords and lords require a king to give them titles and land. And serfs.", "label": 0}
{"text": "Cancel Amazon Prime!", "label": 0}
{"text": "I think your ideas are a good start for brainstorming.  I don't have the answers, but that doesn't mean smart people can't think of them (probably have already thought of them).", "label": 0}
{"text": "Political violence is dumb and should be avoided , but if he’s truly concerned perhaps he could consider being a little less fascist.", "label": 0}
{"text": "an early old.  happens to the best of us", "label": 0}
{"text": "Billionaires are legit going insane this cycle. Trump HATES Bezos too, what has been promised behind the scenes?", "label": 0}
{"text": "No he won't. He hasn't even put anything into mars orbit. Mars is like hyperloop. Just hype to drum up attention and (more importantly) investors.", "label": 0}
{"text": "You made the claim first, bub", "label": 0}
{"text": "Dude needs a serious reality check...", "label": 0}
{"text": "We need to make billionaires extinct", "label": 0}
{"text": "Billionaires don't need any protection from vengeance. They're untouchable in every sense of the word. They control too much of the economy, have too much money, too many ways to stop the rule of law or edict of Kings from ever touching them.", "label": 0}
{"text": "[Haha. well did I out my foot in my mouth. great timing 🤦‍♂️](https://www.reddit.com/r/politics/s/yCfDMIxSbR)", "label": 0}
{"text": "Republicans are fascists and Nazis", "label": 0}
{"text": "**PSA Reminder**:\n\n\nDo *not* confused \"cowardice\" with **avaricious corruption**.", "label": 0}
{"text": "And because Kamala Harris is a *normal politician*, he's making the calculation that there's no downside to not endorsing her if she wins. But if WaPo endorses her and then Hitler 2.0 wins, Blue Origin won't be able to win any contracts to build the space Volkswagens or whatever. (OTOH, Trump might just nationalize Blue Origin and Amazon on day 1 and hand them to Elon Musk regardless.)", "label": 0}
{"text": "Excellent catch", "label": 0}
{"text": "I am so in love with this comment. 🤯", "label": 0}
{"text": "Is there anything else it encourages? Say, things like moral clarity or not falling over the cliff into an authoritarian state?\n\nHere we go again with the logical fallacies. So much to rationalize away and so little time to do it…", "label": 0}
{"text": "So they can influence how people think and sway government.", "label": 0}
{"text": "Did you know it is full of the tired, the poor, and the huddled masses? They come here from other places (playing invisible accordion)  it is the garbage can of the world   - Trump (probably)", "label": 0}
{"text": "Jeff Bezos is a MAGA sympathizer or a Nazi sympathizer by any other name.", "label": 0}
{"text": "It’s amoral.  They figure Democratic officials will not act with vengeance as Trump clearly will.  Which is true, so it’s up to us people to enforce the consequences of collaboration with fascists.", "label": 0}
{"text": "It would be cowardly if he wasn’t a Trump supporter, but he totes is!", "label": 0}
{"text": "A fantastic war strategy that I’m sure he’s going to implement in Ukraine as well. :) Hell, death for everyone. Let’s start sending weapons to the Myanmar junta.", "label": 0}
{"text": "Fascists are always incapable of assessing risk", "label": 0}
{"text": "canceled Amazon Prime. I doubt anyone will follow suit because Amazon is as big a cult as Maga.", "label": 0}
{"text": "Here's an article warning that this would start happening: https://www.nj.com/politics/2024/09/political-strategist-heres-how-gops-phony-polls-will-help-trump-with-the-big-lie.html\n\nHere's a follow up article pointing at the signs that it did happen, as predicted: https://www.nj.com/politics/2024/10/harris-vs-trump-analyst-tells-panicky-dems-gop-is-creating-fake-polls-desperate-unhinged-trumpian.html\n\nHere's a 2022 article about how Republicans skewed polls to create \"red tsunami\" myth: https://www.nytimes.com/2022/12/31/us/politics/polling-election-2022-red-wave.html\n\nEven with the evidence, though, the most telling thing is now much Republicans and Trump in particular have been yelling \"FAKE POLLS FAKE POLLS.\" We know this M.O. from them. Every accusation is a confession. They accuse democrats of being pedophiles and then they get caught in pedophilia scandals. They say democrats are cheating in the election and then they get caught trying to overturn the election. They accuse democrats of being in the pockets of foreign countries and billionaires, and then get caught with ties to Russia across the party, and give tax breaks to billionaires. It goes on and on and on and on. \n\nIf Trump is talking about democrats using fake polls, we can know for certain that Republicans are using that tactic.", "label": 0}
{"text": "Maybe I'm jaded, but I don't think Harris will do anything to make this situation better.\n\n\nHopefully I'm wrong and she hires a pitbull AG and special prosecutors to reign in all the law breaking oligarchs that know they are above the law.", "label": 0}
{"text": "Hurrah for the choice of the nation! \nOur chieftain so brave and so true!   \nWe'll go for the bold Reformation,   \nFor Harris and liberty too!", "label": 0}
{"text": "Based.", "label": 0}
{"text": "We are now triplets.", "label": 0}
{"text": "Ya think?\n\nThey REALLY need to work on a plan B to not singular depend on Moscow musk.", "label": 0}
{"text": "He wants to control the speech on the platform he owes", "label": 0}
{"text": "...all of the times the predictive statistics about him have been wrong? How can anyone with eyes not think he's a statistical anomaly at this point?", "label": 0}
{"text": "Hey thanks for commenting.  After listening to the entire song, I feel like I’m missing some context to the origin of the song.  The poetic language of the lyrics put out some Billy Joel vibes so I’m have a tricky time grasping the message.  I’m am legit asking for some clarification, if you don’t feel like explaining. I get it, either way have a  great day", "label": 0}
{"text": "'They're saying it on TV'...", "label": 0}
{"text": "The old rule used to be the news room and the boardroom should never mix.\n\nTed Turner changed all that.", "label": 0}
{"text": "Welcome to my account.", "label": 0}
{"text": "Well we had two already and it was someone from the same side he is one.", "label": 0}
{"text": "What source has been blocked? Seems like every hair-brained nut-bar blog is on the approved list.", "label": 0}
{"text": "afternoon trolls/bots here...", "label": 0}
{"text": "He did, but I don’t have faith that Dems are willing to skirt or play by the same the rules the Republicans do.", "label": 0}
{"text": "That's interesting but trying to combine a poll and early voting numbers to get intel is really deep in the tea leaf reading territory.", "label": 0}
{"text": "Shit, I've been an old man most of my life :(", "label": 0}
{"text": "They are endorsing him for the tax breaks more so than the contracts. They know there will be tax reform on the Uber-rich when Harris wins.", "label": 0}
{"text": "I’m more surprised that most folks are surprised that a billionaire would do this", "label": 0}
{"text": "The timing of the endorsement.", "label": 0}
{"text": "Right. And knowing that that’s the only reason he’s too pussy to own it out loud makes it worse. Hard to have less balls than fucking Elon Musk, but here it is.", "label": 0}
{"text": "Still not a rapist.", "label": 0}
{"text": "I actually hope both him and TFG hang stiff next January 6th, to balance the scales", "label": 0}
{"text": "Yet another step in the anti governing movement.  The only movement Musk should be associated with is BOWEL! Stop buying the recall machines and maybe he'll become the 2ndc richest idiot in the world!", "label": 0}
{"text": "The fires were in Eastern WA.  We don't rake under the trees over here, we rake the sagebrush.", "label": 0}
{"text": "You can hear the cheering get weird, too. It gets less enthusiastic as he goes on and you can tell it's not coming from all around the room anymore. The laughs start to sound forced around the time he takes the spanking metaphor forward. It's like you can hear the \"wtf am I hearing, is this really happening?\" in the audience.\n\nI get that the audience doesn't contain people with \"normal\" standards for society, but they are still reacting the way most groups would, thank goodness.", "label": 0}
{"text": "“President Xi is a very fierce man”", "label": 0}
{"text": "You know they're going to use this and twist it into some weird conspiracy involving Walz as some mastermind pushing Chinese buttons.", "label": 0}
{"text": "https://theonion.com/the-onion-officially-endorses-joe-biden-for-president/\n\nFinally, some courage🥲", "label": 0}
{"text": "Wow, he's way scared of him.", "label": 0}
{"text": "If they're wrong like they were and in the same direction as they was in 16 and 20 then Trump is walking away with it. \n\nI don't buy that either. \n\nIt's way more likely Trump wins Arizona and Georgia and Harris keeps Pennsylvania. \n\nWhich is how I see it going.", "label": 0}
{"text": "I don't really bite down on conspiracy theories too much. Having said that, I feel that the mega rich in this country are going to try to pull off a soft coup.\n\nTrump is one of them. He has promised them power and money for fealty. They don't care about his fascist tendencies. They have and will always live under a different set of rules.\n\nDeep down, they know that they are better than us middle and working class. They deserve more than us.\n\nWhy do we get the voting power? The unions? The overtime pay? Minimum wage? They think we're leeches. Dregs of humanity. And Trump shall liberate them.", "label": 0}
{"text": "Don't think they can't win even more.  Just wait a week.", "label": 0}
{"text": "There was an article from The Times on here yesterday lol.", "label": 0}
{"text": "Dick Cheney is less of a ~~chicken~~ dick than Jeff Bezos?\n\nTime for Lauren Sanchez to explain \"what's good for you.\"  She knows what Abe Lincoln would say.  \"My Dear Jeff, if you're not using the newspaper, I should like to borrow it for a while.\"  And appoint that lady who quit the LA Times.", "label": 0}
{"text": "and?   You know Mitch you had your chance to stop this long ago.  You are to blame all the way down the line.  Meanwhile your actions made it possible for him to never get convicted for insurrection or stealing national secrets.   You are to blame for SCOTUS corruption.\n\nCalling someone what they are doesn't encourage anyone.  Its called speaking the truth.", "label": 0}
{"text": "Cruz can't pull off the strong-man act convincingly enough. He shares a lot in common with Trump, but it's also very obvious he has no spine. It has nothing to do with his politics, just the fact the media never tried to cover up his failings so everyone knows he sucks", "label": 0}
{"text": "\"That was strong reasoning, but in 1976 for understandable reasons at the time, we changed this long-standing policy and endorsed [Jimmy Carter](https://archive.is/o/PlgjS/https://www.washingtonpost.com/jimmy-carter/) as president.\"\n\nGee, were those \"understandable reasons\" that his opponent represented a morally bankrupt criminal party that just had their leader driven from the office?!?!?", "label": 0}
{"text": "But I'm a temporarily embarrassed billionaire", "label": 0}
{"text": "Meanwhile, Fox News is painting this as a conspiracy to encourage another assassination attempt.  The people who need to hear this message the most won’t hear it, because Murdoch is making too much money off the MAGA cult to ever wake them up. ", "label": 0}
{"text": "I’m telling you now, Trump’s password is 4547 and Vance’s password is 6116.", "label": 0}
{"text": "To a large degree, it only works because Republican voters desperately want any excuse, now matter how absurd, to continue voting Nazi.", "label": 0}
{"text": "Just make sure to wait until the flaming bag of dog s*** goes out.", "label": 0}
{"text": "Bro out here threatening to imprison anybody who worked on the Harris campaign and spelling skulduggery wrong while doing so", "label": 0}
{"text": "If billionaires hate your tax policies, you must be doing something right.", "label": 0}
{"text": "\"Biden\"? Do you mean GeNoCidE JoE?", "label": 0}
{"text": "Just canceled mine which ironically would have renewed on election day", "label": 0}
{"text": "This is why we are where we are right now. People think POTUS is King (or Queen).", "label": 0}
{"text": "That's WHY they want to hire Trump", "label": 0}
{"text": "(1) Coping with the fact that no one *actually* knows what will happen\n\n(2) Desperately hoping that Trump doesn’t win and turn us into Nazi Germany, this time with the most powerful military in the world.", "label": 0}
{"text": "We've never been more excited for a Presidential ticket than this year but we're scared to put any signs out because of our red town and the unhinged MAGAts who might retaliate. I don't need to fork over money to fix something that's avoidable in the first place, which is sad we're made to feel scared for voicing our 1A rights/opinions.", "label": 0}
{"text": "I’ll probably drop an edible that evening which will put me to sleep.  Then I’ll wake up to… whatever. ", "label": 0}
{"text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "This anarchist voted for the first time in 24 years for Harris.\n\nWhy? Because I know what’s coming if that man wins. What the real threats that support him are capable of. \n\nThat doesn’t mean that I don’t oppose the system. I do. But we need to start drawing the line in the sand. Here and now. Fascism cannot be allowed the keys to the state apparatus of this nation.", "label": 0}
{"text": "Is he saying that as a criticism or as encouragement? ", "label": 0}
{"text": "Billboards with Bezos, Musk, and Thiel images and in big font: Robber Barons against Harris. In some Michigan/Pennsylvania areas it might actually gain some traction.", "label": 0}
{"text": "But calling her a communist is just fine, right?\n\nJFC, I can't wait until this goddamn election is over.", "label": 0}
{"text": "op is \"concerned\" - lol!", "label": 0}
{"text": "Meh.", "label": 0}
{"text": "This is already trump's plan.", "label": 0}
{"text": "Yeah,  I hit the content radio button, hoping to get a comment box opportunity.  Anyway, they is dead to me now.", "label": 0}
{"text": "Why, so he can pass national security secrets to Putin?", "label": 0}
{"text": "Kind of. I was trying to the expected margins of victory (ie Alaska was predicted to be R+17 so I gave it 17 EVs) but I didn’t complete it. I made the map normal.", "label": 0}
{"text": "Jeff Bezos, yet another billionaire Nazi sympathizer, says \"no.\"", "label": 0}
{"text": "Get out and VOTE and try to get everyone you know to vote for the rational, sane, non-Russian asset candidate! Please!!", "label": 0}
{"text": "Me too, friend. In the same boat. Very afraid it’s going to sink. 😬", "label": 0}
{"text": "Live stream - The Trumpman Show !!", "label": 0}
{"text": "This isn't an editorial - this is the paper trying to endorse a candidate and their own board stopping that. Separately, the editorial editor quit because they didn't get their way.", "label": 0}
{"text": "He's not scared of Trump, he wants Trump to be president.", "label": 0}
{"text": "Who turned out the lights?\n\nJeff?\n\nJeff?", "label": 0}
{"text": "I’ll believe it when I see it. The media wants a close race for the ratings, I don’t think it’s as close as everyone wants to believe.", "label": 0}
{"text": "PPD + election depression is a hell of a drug", "label": 0}
{"text": "Dear Mitch you and your party are the only ones making that connection", "label": 0}
{"text": "Issue a warrant for his arrest.", "label": 0}
{"text": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*", "label": 0}
{"text": "This is what insider trading looks like on the worst level. They, the LA Times, and all the other news sources that will not speak out know something that we don't. If we survive this, they must all go.", "label": 0}
{"text": "No one is going after Catholics you stupid, lying pumpkin man.", "label": 0}
{"text": "So, cowardice.", "label": 0}
{"text": "There's also the owner of the LA Times who prohibited the paper from endorsing Harris.", "label": 0}
{"text": "What Elon will slather on Putin’s asshole before he eats it", "label": 0}
{"text": "Problem is the fact polls have been off since 2016…so people doubt them, even if Harris gets a good poll, some people doubt them too. Nobody knows for sure how it really goes…maybw Harris campaign, or Dumbs campaign, has experts that knows more than media polls does", "label": 0}
