{"text": "Maybe, if you try hard, you can be less of a condescending asshat. I don't think you're trying, though.\n\nLet's keep it real. You're not \"arguing for equality\" no matter how you try to spin it, but I'm sure describing it that way makes you feel better about it. Instead, you're championing it for no other reason than that your simplistic thought process leads you to believe that liberal = good and conservative = bad regardless of the actual issue. It's sports fan politics.\n\nAlso, not a conservative btw. But it's hilarious that you're able to decide that I am based on one issue. \n\nNow, as for the few *relevant* arguments you've made...\n\n>you specifically want rural voters to have more voting power than urban voters.\n\nThis only holds true in the national framework. Within a state, urban votes still win. It's as direct as you want nationals to be. \n\nThe difference (that you're deliberately avoiding addressing and in fact doing all you can to obfuscate) is that distance and states rights matter. California shouldn't be the unilaterally decisive voice about what happens in say, Vermont or South Dakota no matter how many people are in its borders.\n\nYou're also (disingenuously) ignoring that the EC system does account for population in assigning electors, which is why Texas has more in 2024 than it did in 2000 and California and New York have less, reflecting the shift seen in the most recent census.\n\n>Honestly, how do square that, from a personal morality standpoint? It's reprehensible, but you don't seem to care. I don't get it.\n\nYour hamfisted attempt to reframe this as a black and white moral issue where you're on the side of the angels is laughable, artless, and frankly, pretty fucking gross.", "label": 1}
{"text": "Gearhead, my foot.  It’s not a beautiful thing to keep polluting our environment.  Your opinion means nothing.", "label": 1}
{"text": "Democrats don't go to the gym?  What?\n\nNo idea what you mean about \"independent and decentralized.\"", "label": 1}
{"text": "Nah, understanding that not supporting Kamala means you are helping Trump and therefore making things worse. If you think not voting for Kamala is actually going to help people in Gaza you are a moron. But go ahead….help Trump get reflected if it helps your fragile ego.", "label": 1}
{"text": "And he sent slo Joe into the nursing home", "label": 1}
{"text": "Don't believe you, but since you wanna speak on a war between 2 OTHER countries that's been going on for DECADES, allow me to give MY take! I'm a black man in America and I can't afford to risk MY situation for A COUNTRY IN A WAR WITH ANOTHER COUNTRY THAT'S BEEN GOING ON FOR DECADES! I'm not stupid enough to commit political suicide like white leftists that will do just fine in America! The IDIOTIC Muslims with short term memory from a previous Muslim BAN can go to HELL ALSO!", "label": 1}
{"text": "You sound like a plant. So you mean to tell me that you failed to utilize the most basic logic when your friend said that?", "label": 1}
{"text": "Except that, in education, competition does work.  (It would work in medicine as well.)  We have a full voucher program here in Arizona and our student scores are improving as opposed to almost any other state.  I counted on the US News website and over 20 to the top 100 high schools in the United States are located in Arizona.  Not only this, but the voucher program saved the State over $600 million dollars compared to the same cost of educating these students in Government schools.\n\nBetter education and less expense.  That is a win-win.", "label": 1}
{"text": "Gee, the billionaire owner of the Washington Post refuses to allow his paper to make an endorsement in the most consequential election in the last 150 years, because HE doesn’t want it known that he’s actually hoping for a Trump win, so that he can pay even lower taxes….   \n\nSo much for the Editorial Independence of the WaPo…\n\nHey Jeff BOZOS… I thought “Democracy Dies In Darkness” or was that just a bullshit slogan to help you sell papers?", "label": 1}
{"text": "they can support the tyrant or the administration doing a genocide. ", "label": 1}
{"text": "WaPo is dead to me, blocked on my news feed along with garbage like FOX and Newsmax.", "label": 1}
{"text": "Yes, the courts are not the executive. You’re highlighting the absurdity of your own statement. \n\nOh so if your pet policy goals don’t get passed it’s not progressive? Hahahahahaha, you’re kidding right? \n\nThere is no genocide going on. \n\nGet a grip dude, there’s a reason nobody takes people like you seriously.", "label": 1}
{"text": "This has nothing to do with journalism and everything to do with appeasing a potential fascist President.", "label": 1}
{"text": "Why is it you’re so predictably dishonest?", "label": 1}
{"text": "Shameful disinformation and projection. The **right** has been attacking the mainstream media for not being their lapdogs since Nixon was first elected at the very least, and they’ve been bending over backwards since Clinton to win the whiny right back. GTFO with your bullshit causality.", "label": 1}
{"text": "Uh huh. You're a hypocrite. You and the entire democrat party are no different than Trump you just claim the high ground from the shadows.\n\nIf you really didn't feel that felon wasn't a malignant term you wouldn't use it at all. And you certainly wouldn't use it as justification to not elect someone.", "label": 1}
{"text": "Anyone who actually lets a newspaper's endorsement influence their vote is too stupid to have that right in the first place", "label": 1}
{"text": "I saw kid rock shoot a beer can once because he doesn’t like a woman with a penis. He actually looks like a woman with a penis,", "label": 1}
{"text": "they only use overwhelming force when the target can’t hit back. like, a school, or refugee camp.", "label": 1}
{"text": "I’ve been thinking about canceling my subscription for a while now and this finally pushed me over the edge.", "label": 1}
{"text": "That's not what I said. If you are someone who genuinely believes in the horror and atrocities committed by Israel, then abstaining from voting in protest is a vote for Trump, who'd be even worse for the advancement of Palestinian well-being. Tankies are morons.", "label": 1}
{"text": "bezos knows harris is gonna eat shit and doesnt want to be on trump's bad side", "label": 1}
{"text": "Clueless and simple minded.", "label": 1}
{"text": "Reddit suddenly wants the media to be in bed with the government\n\nBut the media wants to separate itself from the dumpster fire\n\nAmusing", "label": 1}
{"text": "And then there's us who never gave WaPo a penny of our money to begin with.\n\n*smug face of superiority*", "label": 1}
{"text": "I don’t vote and don’t think I ever will. Voting really doesn’t matter when both Democrats and Republicans only care about one thing themselves and their own agenda.", "label": 1}
{"text": "Why do y’all care billionaires are bad so Harris shouldn’t want his endorsement yet all of you and all of twitter democrats are crying about it.", "label": 1}
{"text": "You’re kidding right?", "label": 1}
{"text": "Well, WaPo uniformly endorsed Democrats.  So no one takes their endorsement seriously UNTIL now.\n\n  \nHmmm", "label": 1}
{"text": "Bezos is supports of Trump", "label": 1}
{"text": "I'm sure muslims are very keen on nuking their holy land they have cried about for 80 years", "label": 1}
{"text": "I'm also immigrant and I'm voting for Trump. Your answer is plain stupid!! People don't care about transgenender until you start pushing your agenda on everyone else. Your sibling can be whoever he wants, but stop pushing your views on me, because I don't push mine towards you. I have transgender at work, and I don't like her only because she is abusing work ethics. She is more off than at work, every day different stupid excuse to not show up at work, where other people work their ass off. She knows she can't be fired, do you understand now? California or NY will welcome your family with open arms. ", "label": 1}
{"text": "You are making that up. \n\nBut anyway, Israel is an apartheid state. It deserves the dust bin of history.", "label": 1}
{"text": "No.", "label": 1}
{"text": "No doubt.", "label": 1}
{"text": "Many people are too chimp-brained to agree with this take", "label": 1}
{"text": "You come across as a lying piece of shit in this exchange. You are an example of why it's important to not get brain worms.", "label": 1}
{"text": "he gets good response from mma crowds", "label": 1}
{"text": "Nice try comrade. Wrong thread.", "label": 1}
{"text": "The only group of people wrong more frequently than democrats calling a republican nominee hitler are climate change activists calling for the end of the world and I really hope you are just trolling and not actually stupid enough to think that republican voters think Trump is like Hitler.", "label": 1}
{"text": "if it looks like the GOP stole the election by mail in fraud (or whatever), and the consensus of the DEM and their voters is blatant fraud. How should the voters react on capitol hill the first week of Jan.?", "label": 1}
{"text": "Hey, so… it must be tough being this dumb. How’s life like? Honestly concerned…", "label": 1}
{"text": "Until they renounce Trump, vote democrat and apologize for the harm they have caused this country, I consider every Republican equally toxic as Trump.", "label": 1}
{"text": "https://www.dhs.gov/archive/news/2016/02/18/dhs-announces-further-travel-restrictions-visa-waiver-program", "label": 1}
{"text": "Anyone who decides to not use their right to vote because of polling is a moron and should rethink their life choices. \n\nGiven how close this race is though seems like theres a lot of morons in this country so honestly Im sure there probably are some people who will be influenced to not vote based on polling. However I also think given the stakes of this election democratic voters will be motivated to vote more and not less so I think overall net effect is fairly null", "label": 1}
{"text": "That's the dream.", "label": 1}
{"text": "Neither. I think Trump is gonna win but this changed nobody’s mind.", "label": 1}
{"text": "Discourage. \n\nTrump has 21 million views with Joe Rogan now. There are massive lines in New York, early voting. The steal will not be allowed this time.", "label": 1}
{"text": "Honestly you just sound like a a childish dick. If you can call a boat “she” you can extend that courtesy to a person, and I’ll bet you don’t have a problem with someone telling you their dog’s name or correcting a cat’s pronouns.", "label": 1}
{"text": "Because liken Kamala they both married a wife beater who sleeps with nanys and takes them to get abortions. It’s the sympathize with Doug strategy.", "label": 1}
{"text": "I BALK AT THE EMPTY SOULLESS EYES, FACES & WORDS/THOUGHTS OF RICK PEOPLE, I BALK AT THEIR DISGUSTING ARROGANCE & SENSE OF ENTITLSMENT.  FEW EXCEPTIONS.", "label": 1}
{"text": "You're talking about trans people being sensitive while admitting the basis of your discomfort is you being sensitive about your cognitive decline?\n\nI'm sorry the world is choosing to cater to their \"fifis\" and not your \"fifis\". I'm sorry you need a hug box and for everyone to act like they don't find your opinions bad and creating a harassing environment for normal people in the workplace.\n\nNo one is getting fired for accidentally misgendering someone on accident. That's propaganda you swallowed because you're a special snowflake who needs validation from outside sources because he knows deep down he's  insecure about his cognitive abilities and his beliefs. You believe in some all knowing being who tells you explicitly to be kind, but drop supposed divine wisdom the second it inconveniences the beliefs that assuage your discomfort? Explain that at the pearly gates.\n\nI'm trying not to be harsh dude, but come on. It's willful delusion to deal with a harsh reality about yourself. You can hide it behind platitudes of nebulous American ideals, whatever transient small meaning that may have in the grand scheme of things. But at the end of the day, you're also getting your panties twisted over pronouns because they make you feel bad about yourself if someone uses them in a way you don't like.", "label": 1}
{"text": ">Russia is still outpacing the US in manufacturing new shells, equipments, and military vehicles, \n\nUh...what the fuck? Russian is now relying upon North Korea to supply them with munitions. They aren't anywhere close to manufacturing enough to meet their own needs, let alone manufacturing more than we do in supplying ourselves as the largest military and plenty of other countries besides.\n\n>and they have successfully switched to a war economy with Russians satisfaction with the economy being almost the same as American's\n\nOkay, now you're just into bad comedy. Are you actually joking, or just cutting and pasting Russian talking points?\n\n>US is despretly trying to stop Russia, but it just doesn't have the will to fight.\n\nOkay, Ivan. Go to bed.", "label": 1}
{"text": "It's funny how you mention that I don't know what I'm talking about. Then, explicitly fail to understand the 10th Amendment.\n\nY'all are like dealing with children. Anything you disagree with is either unfair or doesn't exist. \n\nRoe vs Wade is over, your side lost. Now work on your baby murdering at the state level in accordance with the constitution.", "label": 1}
{"text": "Trump people are so weird and culty", "label": 1}
{"text": "Complete creep. Then there’s Stephen Miller. Nazis. Both of them.", "label": 1}
{"text": "dude you need mental help", "label": 1}
{"text": "I am leaving this comment here, so after the election I rub your nose in your failed horseshit analysis.", "label": 1}
{"text": "Trumps allies did 911. This is the end of the plan to bring America down. Of course he says that.", "label": 1}
{"text": "I do get a lot of \"stfu your problems aren't real\" in this sub.\n\nFrom conservatives.\n\nWho think that every single immigrant living in this country is a criminal.", "label": 1}
{"text": "You believe electing trump is going to help Palestinian people? \nAnd not voting for him equals a PRO GENOCIDE stance??????\nYour definitely displaying your ignorance", "label": 1}
{"text": "George Bush personally flew both planes into the buildings", "label": 1}
{"text": "Stupid liberal you don’t know anything about politics", "label": 1}
{"text": "Are you dumb???? You’re voting for Kamala???? Seriously you must love the cost of living right now go educate yourself", "label": 1}
{"text": "…except vote for Clinton in 2016.", "label": 1}
{"text": "So you're just intentionally regurgitating right-wing propaganda. Got it", "label": 1}
{"text": "The bullet grazed his ear.   Why does this offend the left so much?", "label": 1}
{"text": "So she wasn’t the border czar? As reported by CBS and several other stations?", "label": 1}
{"text": "\"Yes, you're right. Dick Cheney can burn in hell. But...\" LOLS!!!", "label": 1}
{"text": "Liz Cheney agrees with almost all of Trump's policy positions. Any criticism of Trump by other Republicans is not about policy; it's either personality, backroom elitist shit, or them trying to get more power for themselves.\n\n[https://www.forbes.com/sites/jackbrewster/2021/05/06/whos-more-loyal-cheney-voted-more-with-trump-than-possible-successor-stefanik/](https://www.forbes.com/sites/jackbrewster/2021/05/06/whos-more-loyal-cheney-voted-more-with-trump-than-possible-successor-stefanik/)", "label": 1}
{"text": "The Leahy law prohibits us from providing equipment and training to a foreign military unit or individual suspected of committing war crimes.  The Biden administration has actively suppressed reports of Israel committing war crimes.  And you're claiming there isn't proof? Are you taking the piss here?", "label": 1}
{"text": "I love the name calling from the party of inclusion. We both know she’s horrible at her job and she’s about to be unemployed. Get over it.", "label": 1}
{"text": "You: \" People shouldn't be allowed to have opinions unless they fall in line and agree with me!\"", "label": 1}
{"text": "Not to MAGA-paying no attention to \"commentators\" or polsters with their fake polls and agenda.", "label": 1}
{"text": "Are you going to congratulate Trump if he wins and not complain for 4 years?", "label": 1}
{"text": "The irony\n\n\nThe large majority of folks in this sub has pretty much dismissed every poll that has Trump leading", "label": 1}
{"text": "It’s not someone, it just another out of touch liberal who’s about to meltdown on November 6", "label": 1}
{"text": "Again, nothing but deflection here. \n\nWhy do you change the subject every time someone points out the massive flaws in your arguments? Is it because you’ve got nothing else?", "label": 1}
{"text": "I'm generally curious about what you're talking about and the receive the comment \"all of them\" and \"I'm done responding\" just makes your original point mute and that you're straight up full of shit.", "label": 1}
{"text": "Yes, sometimes there are caveats and nuance to a situation...? You seem to be pretty immature, so I'll leave it at that and let you contemplate. Just don't hurt yourself.", "label": 1}
{"text": "You're going to caveat and nuance yourself right into the Republican Party.", "label": 1}
{"text": "That just might be the dumbest comment I’ve ever seen. ", "label": 1}
{"text": "I don't know why you're trying so hard to look dumb. You should ask for a raise from whoever is paying you to write this", "label": 1}
{"text": "This from someone who hasn’t seen the worst from the rich people like Trump.  You poor, naive summer child.  If Trump wins, I can’t wait to say “I told you so” when you find out what restrictions the Heritage Foundation puts on men thru their Trump proxy.  The men of Afghanistan are getting a rude awakening with the Taliban.", "label": 1}
{"text": "It’s paid off every time actually, yeah. Biden discovered the hard way what a waste of time, money, resources and energy it was so yeah. You’re exactly right. Ignore the Bros completely because they’ll never be satisfied and want everything now despite stupidly unrealistic all their petulant demands are.", "label": 1}
{"text": "Yeah, but with that statement you kinda prove you are the type of person who, in another place, would be holding an explosive pager. No one cares what the extremist nut job feels is necessary for his ideological “other” to not be “toxic.”", "label": 1}
{"text": "Are you calling me a terrorist for asking for an apology?", "label": 1}
{"text": "If Trump wins, it's because he's an angry fascist, if Kamala wins it's because Trump's an angry fascist.", "label": 1}
{"text": "Because he has no redeeming qualities. Sorry that reality has a left leaning bias", "label": 1}
{"text": "Would you say it’s more courageous or less courageous then defending toro", "label": 1}
{"text": "Haha all I hear since past 2 weeks from Kamala and her campaign is that why not to vote for Trump, from calling him names like hitler and fascist to scaring people on his policies, but absolutely nothing about what her agenda is. In the last cnn townhall, she called out Trump name over 70 times and you think for Kamala and Waltz, Trump doesn't exist. What a joke!", "label": 1}
{"text": "You guys don't give a fuck about Arab lives and it shows. Innocent Palestinians being murdered right now in Gaza and the West Bank. Also Lebanese people as well. But also the Cheney family murdered a million Iraqis for no fucking reason. You can all burn in hell if you're gonna tout these genocidal, evil fascists. I put morals over anything else. Hope all of your names get put in a genocide museum in the future.", "label": 1}
{"text": "Do your own research.  Look at recent news in Arizona, Pennsylvania, and Mississippi", "label": 1}
{"text": "Google too hard for you to use?  Cant formulate a search?  Too bad but unfortunately you are not alone", "label": 1}
{"text": "I would say there’s a big difference between the candidates in their profile. \n\nOne candidate wants to round up 11 million immigrants and deport them. \n\nTo have a national ban on abortion, no exceptions. \n\nTo make the US a theocracy, essentially, by centralizing Christianity. \n\nTo jeopardize international relations (again!) by treating that as a zero sum game: if you win even slightly, it means I’m a loser.\n\nThat analogy with airplane food has never been truer: that you either get a plate of shit mixed with ground glass, and the other is  plate of chicken. If you then decide to ask how the chicken is cooked, you’re missing the (dangerous) forest for the trees.\n\nThat’s your choice. Neither is what you’d really want, but one seems a little less harmful.", "label": 1}
{"text": "you have no idea how ineffective your words are. have you gone outside the past four years?", "label": 1}
{"text": "If Trump loses, there will be.", "label": 1}
{"text": "Women care more about group consensus and fitting in then being correct.  Their natural empathy causes them to ignore the agency people have in their lives outcomes, so they vote Democrat.", "label": 1}
{"text": "Ok so let me translate your moronic statement here for people not paying attention\n \nYou are saying tyranny of the majority is bad. It's bad when the majority gets to be in control. And what you think is better is control by the minority. Tyranny of the minority. It's not clear why you think this, other than calling your side sheep. Which you are. At least that part is true.\n\nMajority control is better because at least more people get to be happy. And you keep some safeguards in place for minority rights. \n\nInstead of whining (like a true alpha male), why dont you try changing your party to be less shitty so you dont lose the popular vote?", "label": 1}
{"text": "Reddit in general and this sub:\n\nCheney endorses Kamala: “oh here’s why this is so great and good.”\n\nIf Cheney had endorsed Trump: “She’s an outdated neocon war mongering loser, etc etc etc .”", "label": 1}
{"text": "It's actually just that they hate you and the way you think.", "label": 1}
{"text": "Keep celebrating women losing their rights to their body.  It lets the smart women know who to avoid.", "label": 1}
{"text": "Texas will never swing blue! People remember—When a vaccine was developed it was democrats who forced workers in America to make a choice between getting vaccinated and losing their jobs. The vast majority of us believe in vaccinations and want to get them. The problem is that the pandemic vaccines were developed in a hurry and did not undergo massive testing before their release. Instead of heeding the worries and concerns of citizens, Democrats forced them to choose between their jobs and the vaccine.", "label": 1}
{"text": "Immigration. \n\nIf you can’t recognize the Democrats have shifted far to the right on immigration, then you are delusional.", "label": 1}
{"text": "I can do this dumbassery too, here ya go. Do you like that kamala is pro-fracking? Do you like the fact she's funded by big oil and big pharma? Do you like that she's pro war, pro-penal and justice system (and therefore longstanding systemic racism)? Do you like that she's pro-establishment, pro-lobbying, pro-business, and pro-genocide? Do you like that she has reverted to republican-aligned positions on some of the most poignant issues in the current zeitgeist? Do you like that the current administration has done next to nothing to improve the material conditions of average americans? Do you like the fact the current administration is headed by a man who literally said of israel didn't exist, we would have to create one to further our colonial and oppressive intentions in the middle east? Are you an npc? ", "label": 1}
{"text": "Don’t you have a job? You have been trolling me for three days. Look I understand that you are a lefty with your head in the sand. You believe the current administration has done a great job and that open borders and high crime are the way to go. I believe differently. I believe that America is smart enough to make the right choice on November 5. I believe that choice will be Donald Trump.", "label": 1}
{"text": "Maybe you'll all get what you deserve. ", "label": 1}
{"text": "Famous, infamous... the Menedez brothers are famous too, we should elect Eric Menedez for President!", "label": 1}
{"text": "I noticed you deleted that comment like pussy. Do you know what a democracy is or that dinosaurs did infact exist? Do you think the jews have space lasers? Your types usually don't know the correct answer to these. \n\n\nTo be serious, it doesn't even take 10 minutes to send what I did. Trolling you doesn't subtract from my work ethic.\n\nJust so you know. I don't like the current state of the dems or repubs. I just know who I'd rather go with.", "label": 1}
{"text": "Enjoy a second Trump presidency. I hope you're happy with yourself.", "label": 1}
{"text": "Don’t normally agree with? Jesus Christ you have no idea who Dick Cheney even is if this is your line of thinking.", "label": 1}
{"text": " It's called a representative republic. \nYou want mob rule. \nIllegal criminal immigrants could storm our border and vote illegally if the election was won by popular vote. \nThe treasonous Biden Harris administration has illegally gave criminal illegal immigrants citizenship in swing states to steal the election by EC. \nThat's what third world tyrannical governments do .\nCivil War is the only remedy if the treasonous left pulls off another election theft.  \nCovid 19 was used against America to rigg the last election w mass mailin voting fraud and the entire world knows it.  ", "label": 1}
{"text": "You need to take a break from the Internet. This feels like an unhinged copypasta.", "label": 1}
{"text": "Have fun basking in your own moral superiority while the world burns.", "label": 1}
{"text": "https://www.commondreams.org/news/harris-arms-embargo-israel", "label": 1}
{"text": "Absolutely not, only thing that gets white women out of bed in the morning is the right to kill their own babies. I jest but literally women seem to only care about abortion when polled. ", "label": 1}
{"text": "The people seem to like that instead of crying about Hitler", "label": 1}
{"text": "\"This is the endorsement of someone who disagrees with Harris on most policy, but believes that liberal democracy is more important than any single policy goal in 2024.\"\n\nAre you overdosing on stupid pills. Cheney, like the rest of the GOP, DO NOT GIVE A FUCK ABOUT DEMOCRACY! All they care about is pushing through their bullshit fascist policies, which grow more fascist by the year. By allying yourself with such assholes you legitimize those policies. The Dems are utterly fucking insane for choosing this hill to die on. With polls this close, you would think Harris would focus on shoring up her base. Nope! Take them for granted and go after conservatives, who do not give two fucks about the Dems, because moderate conservativism is an oxymoron. \n\nIf Harris loses the Dems will scream about how the Left failed them, like Hitler in his bunker at the end of WW2 complaining about Germany failing him.", "label": 1}
{"text": "I think very few American's actually care about this statement, as most don't even realized that Puerto Rico is a U.S territory or that Puerto Ricans are considered U.S citizens. For all most people know, Puerto Rico is a sunny tropical island to take vacations to.\n\nRegardless of this, Puerto Rico is a floating island of garbage. It is filled with slums, decrepit buildings, and immense poverty. Hinchcliffe was making a truthful point in a comedic way.", "label": 1}
{"text": ">This desperation isn't pretty\n\nCool story bro,\n\nIt isn't the fact that multiple presidents have had rallies at MSG.\n\nTo harken back to Bill Clinton's rally there: \"It's the rhetoric, stupid.\"\n\nBut you probably know that and are just pot committed to fascism.\n\nGood luck with all that.", "label": 1}
{"text": "Feeling comfortable saying that out loud and genuinely believing it is what makes him and you walking piles of garbage.", "label": 1}
{"text": "Want to know why Dems don't go as far left as you'd like? People like you. It is infinitely easier to get someone to vote for you than to cater to the crowd who are looking for a reason to not vote for you. You are impossible to please, wete never going to vote for her anyways, and when it is a binary choice you'd rather stay home and help the objectively worse candidate get elected.", "label": 1}
{"text": "After this Sunday’s rally with Trump promising young men retribution to punish young women…my warning isn’t jumping the shark anymore is it?\n\nWhen will women like you learn?  When?  This naïveté is adorable when you are 5 in this day and age.  Jesus, I was in college in the 1990’s and it never failed when women like you endangered everyone around you because of your inexcusable lack of self awareness and situational awareness.  And my dad wondered how come I was one of the few women who went to college who didn’t have a SA attempt.  And it wasn’t because I was ugly.  I was because I knew how to read a room.\n\nhttps://newrepublic.com/article/187419/trumps-promise-young-men-retribution-against-women", "label": 1}
{"text": "You sir are an obstinate moron. And it's parties. Not party. You may think that one or the other does it all based on your partisan beliefs, but as a political scientist I can tell you they both doing it for their own purposes. Now you may agree with one or the others causes, and that is totally fine electorally. But objectively both sides do it.", "label": 1}
{"text": "Is this account a Conservative BOT? 8 Months old, posts in spurts every day, conservative talking points, misinformation, both sides-ism's...\n\nPuerto Rican's living in states can vote... And I know it doesn't make conservative people happy, but Puerto Rican's are American Citizen's that can freely move to states that have electoral votes.... like Pennsylvania, North Carolina, Michigan, Wisconsin, etc...", "label": 1}
{"text": "Dude drop it. Go back to Goontok, Joe Rogan and WSB.", "label": 1}
{"text": "Where have you been the last 10 years?", "label": 1}
{"text": "Bezos don't give a damn about Trump dude. Any action taken by the Trump administration WaPo could tie up in court for years. Your clueless.", "label": 1}
{"text": ">way to give yourself away\n\nIt's called honesty.  \n\nYou obviously put a lot of effort into your response.  I didn't read anything past the quoted text because of the pretense that I was trying to hide something.  I spoke very plainly, and regardless of how strongly you feel whatever you said after that is true.... Everything I stated is even truer.  That's how opinions work.", "label": 1}
{"text": "Sure you haven't.", "label": 1}
{"text": "You poor beleaguered victim.\n\nClearly no one has it as bad as you with those mean liberals.\n\nI'm sorry they hurt your feelings with their pesky facts. \n\nMust be so hard for you.", "label": 1}
{"text": "You know what he meant. Don’t be a semantic weirdo.", "label": 1}
{"text": "I seen a lot of redditors make posts happily saying they were polled lmao. It was a big day for those losers", "label": 1}
{"text": "Taylor Swift caused the Titanic to sink. Wake up sheeple. Liberals and Dems have stolen your tax dollars for centuries so they could learn future time travel. They were waiting for the prophet Taylor of House Swift to finish the Wiccan ritual spell of Marxism  to act. The Titanic is just the beginning. The next step? Coming for your Costco membership. You have been warned. Vote Cthulhu 2024.", "label": 1}
{"text": "If Trump were to lose next week in what way would he be able to unilaterally overturn the results as a private citizen? Honestly I'm much more concerned about democrats and people on the far left trying to cause chaos than that. They have really been worked into a frenzy with this fascist, Nazi and \"saving democracy\" nonsense. I fully expect major violence from them if he wins. They've already tried to kill the man twice.", "label": 1}
{"text": "I definitely think that a final EV split of something like 389-189 electoral votes would do much better at putting The Big Lie Part 2 to rest than 274-264, and according to 538 both are reasonably likely outcomes. \n\nIt’s harder to plausibly cry fraud when you were roundly trounced, versus being able to focus on a few places like Antrim County and claim that but for a few instances of cheating in these little areas, Trump wins. \n\nOf course, Trump can never lie believably, so even if he wins but especially if he loses, he only lost California and New York because of the tens of millions of illegals immigrants flown in from Venezuela, etc. etc.", "label": 1}
{"text": "You are obviously a moron....", "label": 1}
{"text": "> 538 specifically mentioned a specific poll as an example that would only be given 0.1% influence in the aggregate. That doesn’t sound significant until you factor 20 of them into the aggregate, and now it’s moved it 2.0%.\n\nThat's not how it works? If you have 1x100% weight poll saying Harris 52-48 Trump, and 20x0.1% weight polls saying Trump 60-40 Harris. The aggregate is Harris 51.76 - 48.23 Trump.\n\nNo offence, but as I skim this sub, I can't help but feel the American Left is finding new and novel ways to cope with the polls shifting towards Trump every week. I mean, it will be neat if it ends up true, but I'm not holding my breath.", "label": 1}
{"text": "> subjugating the indigenous Palestinian population\n\n\nDo you spend a lot of time on tik Tok?", "label": 1}
{"text": "So you want the current administration to ignore the voters ", "label": 1}
{"text": "I doubt a fragile, woke Puerto Rican who watches the kind of left wing media that is selectively making a stupid joke a huge faux deal was on the fence about Trump Harris anyway.", "label": 1}
{"text": "Restricting medical treatment that could save women’s lives. What a dick. Your interest in bulking up vs her life. You must not have a wife or daughter.", "label": 1}
{"text": "So you come here to just spew cultish nonsense?", "label": 1}
{"text": "With the DNC’s proficiency for election fraud I would definitely be shocked if Trump wins at all let alone in a landslide.", "label": 1}
{"text": "Don’t waste your time parsing the words of a moron. There is nothing of value there.", "label": 1}
{"text": "It’s a damn shame to know I share a country with you.", "label": 1}
{"text": "You have no clue how horrible the left is. Trump is actually for the people. Stop being so ignorant.", "label": 1}
{"text": "Childish work. You don’t give two shits about Gaza. \n\nHard for me to take people like you seriously when you are totally fine with Trump turning Palestine to glass because you didn’t get 100% your way. \n\nHarris has asked for a ceasefire and given the opportunity will do everything in her power to stop the humanitarian crisis.", "label": 1}
{"text": "Enjoy your white supremacy then.", "label": 1}
{"text": "Your stupid protest vote is noted. \n\nAnd when President Trump enables Netanyahu fully leveling the Gaza Strip, I’m sure you’ll blame Harris for it.", "label": 1}
{"text": "There is no world where Trump does a concession speech.", "label": 1}
{"text": "Please do not submit low investment content. This subreddit is for genuine discussion: Memes, links substituting for explanation, sarcasm, political name-calling, and other non-substantive contributions will be removed per moderator discretion.", "label": 1}
{"text": "\"President Trump\" \n\nNO, NO, NO. Stop giving him a title he doesn't hold. This is part of the problem. \"Former President\", fine. \"Shitbag Nazi\" is what i prefer.", "label": 1}
{"text": "That's their problem. I'm not here to solve their problems. I don't think you are either. or anyone else. They are going have to take a LONG hard look at what their values are, what they were, and try to \"backpedal\" their way to some form of sanity.", "label": 1}
{"text": "Vance's favorite history subject was the ottoman empire.", "label": 1}
{"text": "Wow! Mods removing my comment because I asked the OP to not refer to him as \"president\". He's the \"former president\" and I'm removed for low investment content. The OP doesn't even refer to that shitbag Nazi using the right terms. Fuck you mods. Take that low investment remark and ban me for good. You're just as shitty.", "label": 1}
{"text": "The fact that you cannot acknowledge what I am saying makes my point for me. Well done.", "label": 1}
{"text": "America is a wonderful place to live. God bless all of you and I hope you get what you deserve", "label": 1}
{"text": "Well it wasn't actually a ban on Muslims so...", "label": 1}
{"text": "Thank you", "label": 1}
{"text": "OK, teenager.  Besides the need for you to go back to school and learn proper grammar and spelling, the word salads produced have no substance.  You're talking about discrimination against white people?  Seriously?  I'm a middle-aged white dude who sees much more discrimination and prejudice against women and minorities rather than myself.  Most of your talking points are straight off Facebook or right-wing media.  Trump's decisive rhetoric has already corrupted you, child.  News flash - Racism, bigotry, misogyny, and narcissism are not a good fit for our country in the long run.", "label": 1}
{"text": "I think the question should be, what are you a$$hats gonna do when Trump wins.  The mental institutions will be full once again.", "label": 1}
{"text": "You forgot option 3... he dies.... one way or another...MAGA will die with him.", "label": 1}
{"text": "Go back to astroturfing for the Harris campaign.  Make sure you log this comment in your spreadsheet.", "label": 1}
{"text": "ALL of Europe and Australia and other countries can get their elections done in one day. But you dipshits seem to think that we can't do it even though we've been able to do it for years prior to 2020 (recounts are not the same). \n\n\nYou know what would make it easier to verify votes? Verifing IDs before a person casts their vote.", "label": 1}
{"text": "I don’t care. They are garbage. They’re poisoning the blood of this country and living like vermin among us. It’s time to slaughter the enemy within. \n\nSound fucking horrifying? That’s what they’re saying about us. Time to stop being pussies.", "label": 1}
{"text": "This is the biggest nothing sandwich ever. Conservatives and their brittle egos can dish it out but can’t take it, just like a whiny 8 year old.", "label": 1}
{"text": "This election is over.  It was over before Biden’s stupid comments, but not it’s a lock.  Trump is the next president, strap in it’s going to get interesting.  ", "label": 1}
{"text": "And every other news outlet.  ", "label": 1}
{"text": "Lol.  Because of this?  GiVe me a break", "label": 1}
{"text": "It will be ignored by the media and dismissed as a joke be democrats.\n\n\nThose who agree with his statement will applaud and defend it", "label": 1}
{"text": "Yeah I guess.  Not like Trump wasn’t already a 2/1 favorite before these disastrous comments.  It’s over.  ", "label": 1}
{"text": "Comedian calls PR garbage and the left losses their mind\n\n\nPresident calls half the country garbage....fragile Republicans get upset\n\n\nFascinating", "label": 1}
{"text": "Why did he apologize then?   Don’t be like this.  ", "label": 1}
{"text": "> They have publicly asked for anyone but Trump.\n\nWho's \"they\"? Who speaks for Palestinians?", "label": 1}
{"text": "The Palestinian protest vote is going to one of the biggest self-owns in my lifetime.\n\nIf it plays out that Gaza war hold outs tips the scales to a Trump win, I for one, will have zero sympathy when protestors hit the streets and are suppressed.  I suspect many of the left will feel exactly the same.", "label": 1}
{"text": "It’ll be interesting to hear the cope when Trump actively encourages a genocide instead of just semi-tolerating it as Biden and Harris have, at least.", "label": 1}
{"text": "Did his pr people fix it off camera, so nice of them", "label": 1}
{"text": "Biden said\n\n\n* The only garbage I see are his supporters\n\n\nIf he wasn't referring to his supporters why did he say his supporters", "label": 1}
{"text": "Did you even bother reading the article?", "label": 1}
{"text": "Don’t be obtuse.  ", "label": 1}
{"text": "Exactly like trump", "label": 1}
{"text": "The one that was edited in after I posted my comment? \n\nNo, no I did not.", "label": 1}
{"text": "The people in this paywalled article OP’s posted that doesn’t appear to come from a known or reputable source at all, can’t you see", "label": 1}
{"text": "There is no both sides here\n\n\nA comedian made a bad joke vs the sitting president calling half of America's voters garbage.", "label": 1}
{"text": "18 Billion Dollars. In one year. In military aid for Israel to kill Palestinians. That is a fact. Now you say they’re “Doing the best to limit Palestinian suffering.”\n\nThe only way to reconcile those two things is to lie to yourself or just be really really really fucking stupid. Which is it? Delusional or dumbass?", "label": 1}
{"text": "If you aren't voting for Harris over *this* then, with all due respect, you're an absolute moron.", "label": 1}
{"text": "Do you hear yourself?", "label": 1}
{"text": "Biden… did not do that though? He called demonization of Latinos garbage. Is your point that all Trump supporters demonize Latinos?", "label": 1}
{"text": "Biden was actually probably just stuttering, cutting his sentence off on the way to saying something like, \"his supporter's rhetoric.\" He has a well known stutter and he's almost 80. However, it's valuable to note that the Trump half of America's voters actually are garbage, which makes calling them garbage a lot more acceptable than saying something like that about Puerto Ricans. These people are the ones who saw the \"grab 'em by the pussy\" tape and thought, \"yeah, there's the guy I want in charge of the nuclear codes.\" They're garbage by choice, and they deserve to be treated as such. But even Biden wouldn't be clumsy enough to call them that out loud except by accident through a misinterpreted stutter.", "label": 1}
{"text": "https://youtu.be/F54hZP_rWiU?si=G0INmoSR60x6vGNC\n\n\nThe video is right there\n\n\n* The only garbage I see out there are his supporters \n\n\nIs it your claim the video is doctored?", "label": 1}
{"text": "https://youtu.be/F54hZP_rWiU?si=G0INmoSR60x6vGNC\n\n\nAt 40 seconds\n\n\n* The only garbage I see out there are his supporters", "label": 1}
{"text": "You know you could always just not be garbage. Nobody's making you support the guy who wants to put an anti-science loon in charge of the Department of Health and Human Services. Nobody's making you support somebody who obviously doesn't understand any aspect of policy beyond the second grade level. Nobody's making you support the guy who wants to restrict civil rights at every turn for everyone except people who don't want to face social consequences for saying racist things. You can always just NOT be a fucking moron. It's so easy. Just reject Trump. That's all there is to it. It's the most obvious and intuitive thing in the world. If you can't figure that out and choose to remain garbage, that's all on you.", "label": 1}
{"text": "All I need is to link the video\n\n\nhttps://youtu.be/F54hZP_rWiU?si=G0INmoSR60x6vGNC", "label": 1}
{"text": "Actually,  he called the demonization of Latinos \"unconscionable\". He called Trump supporters garbage. \n\nIs this sub not above just misrepresenting reality for convenience?", "label": 1}
{"text": "I mean I've read takes like yours from a lot of Dems. Which sure makes me believe he meant it since apparently it's a common dem belief?", "label": 1}
{"text": "Hey, you proved my point, thanks!", "label": 1}
{"text": "See, like I said, performative.", "label": 1}
{"text": "I gotta be honest, you may want to just disconnect from TV and internet for a week.  This isn't a normal reaction.", "label": 1}
{"text": "It's not a normal situation. If Obama had lost to Romney, that would have been a reason to be upset about the expected tax code changes and other policies, but we could still rest assured there would basically be sane adults in charge of the most powerful organization in the world. Now we have complete lunatics on the brink of almost unchecked power, and it's crazy not to be both worried and extremely pissed off at the fuckwits who created this mess.", "label": 1}
{"text": "Dumbest take of the night. Only possible from someone with extreme privilege or no stake in the game at all. \n\nas 20 million immigrants are being carted off in cattle trains I wonder how proud you’ll be of your puritan beliefs. If there is a god, I hope they put you somewhere far away from a swing state.", "label": 1}
{"text": "Cope harder. Biden just rescued Trump from an October surprise that was going to define the final days of election, and stupidly raised him tenfold.", "label": 1}
{"text": "As soon as I found out Kamala is a Christian, she lost my vote. I’ve fucking had it with those people.", "label": 1}
{"text": "She didn’t call them Nazis, that was JD Vance", "label": 1}
{"text": "Thats literally what you’ve been doing. \n\n“Don’t be obtuse.”\n\n“Do I need to draw you a picture?”\n\nWhat argument have you actually made in this exchange?", "label": 1}
{"text": "No.  The people who don’t have family in Gaza and yet still consider it their top issue just care about their feelings of moral superiority.  They dgaf about women.  They dgaf about the humane treatment of refugees.  They don’t even gaf about Muslims.  They just want to feel that they’re better than pragmatic progressives and liberals in the West.  It’s just tankie bullshit and they’re kind of shit people.", "label": 1}
{"text": "Agreed with every point, but now is not the time to press the issue.  After Kamala wins and we throw Man Titler in prison, we can protest the fuck out of unconditionally supplying weapons to Israel.", "label": 1}
{"text": "I fail to see how this is low investment content.  It’s short, I’ll grant you that, but it’s nuanced:  agreement with caution for proper action.  It certainly doesn’t fit into any of the categories that you want us to avoid.  Rather, the action taken—without adequate justification—leads me to believe the discretion of the moderator is biased against the perspective of the content; it should not be removed.", "label": 1}
{"text": "“How dare they care about people being murdered if they are not their direct family” is something shit people say.", "label": 1}
{"text": "Kind of seems like the democrats are imploding. All of the insults and rhetoric is backfiring and actually driving more support for trump. It's like every time you call him a nazi he gets another voter.", "label": 1}
{"text": "You're making zero sense.", "label": 1}
{"text": "You’re responding to people constantly in this thread. You don’t get to pull the “tOuCh gRaSs bRo” bullshit", "label": 1}
{"text": "> No we don’t know that. \n\nWhat exactly don’t you know? That there’s war in Europe and China isn’t trying to invade Taiwan? Are you for real? Read a newspaper.", "label": 1}
{"text": "Nakba denial is crazy. You’re a Zionist loon. If you care  about Kamala winning though:\n\n60% of independents disapprove of Israel’s actions in Gaza\n\nhttps://news.gallup.com/poll/642695/majority-disapprove-israeli-action-gaza.aspx\n\nHarris has a better chance at winning if she supported an arms embargo. There are multiple polls for this, but here’s a yougov\n\nhttps://zeteo.com/p/poll-harris-democrats-gaza-ceasefire-arms-embargo?ref=use-these-numbers.ghost.io", "label": 1}
{"text": "Watched the full video he's definitely talking about the Puerto Rico thing.", "label": 1}
{"text": "You are okay with me and my children dying", "label": 1}
{"text": "So many Iranian propaganda talking points come from y'all that I'm not sure you even see the irony.  Everyone likes to call out Russian misinformation for influencing the right, but do yall realize Iranian misinformation is doing the same on the left.", "label": 1}
{"text": "Your comment has no content.", "label": 1}
{"text": "Read what I said again", "label": 1}
{"text": "So it's not a big deal the president of the United States just called half the voters garbage \n\n\nI'm sure denial will work wonders for you", "label": 1}
{"text": "It doesn’t need an argument.  Like how stupid can a person actually be?  \n\nHere, let me explain it for you guys.  There are these things called undecided voters and people who may not have voted but now will.  Oh my god, my mind is blown.  Wow how could a person think of something so amazing, my brain never could have come up with something so nuanced and smart like that.  ", "label": 1}
{"text": "Trump has quite a mountain to climb to undo what Biden did with only a stroke of a pen. He has gathered a stronger group around him this time around and should be able to repair most of severe damage done by the failed administration of Biden/Harris. He isn't interested in jailing his political enemies because that's what the Dems do. In reality they are the fascists. The Dem's employed the main stream media, leading publications and the DOJ to ruin him and failed at every turn.\n\nWhat self respecting Fascist (if indeed there were one) would allow those entities to oppose him?\nAnswer: NONE\n\nSo take your inverted fascism, extreme hatred and ridiculous conspiracies and go shove them up your leftist arses. \n\nSee, I'm able to make my point and remain mostly civil toward those who have a far differing opinion about our Constitutional Republic. \n\nAmerica will be great again for a short while.\nPolluted minds will eventually prevail in the long run. So if any of you are still around, you'll be able to say you were correct. \nWhat an achievement!", "label": 1}
{"text": "Yeah when conservatives were freaking out about it I thought it was bad..\n\nThen I saw the full context and was surprised how people get offended over that. He didn't even say Republicans. Just people who supported and laughed at the joke.", "label": 1}
{"text": "you clearly don't care about these children either", "label": 1}
{"text": "Democrats should do the exact same thing republicans are planning on doing. \n\nDeclare they won on election night. \n\nSend fake electors from every red state, including Florida and Texas. \n\nHave the current VP certify them as real. \n\nWhat are they going to do, storm the Capitol building?\n\nUse the army against the “enemy from within”…\n\nUse their planes against them…\n\nIt’s only fair 🤷‍♂️", "label": 1}
{"text": "God y’all are dishonest.", "label": 1}
{"text": "Trump says a lot of crazy shit, but it is hyperbolic to think anything like that would ever happen. Feel free to downvote me, someone needs to say something sensible in this subreddit.", "label": 1}
{"text": "False. But what do I expect from a Canadian monarchist telling here", "label": 1}
{"text": "It’s going to be bad whoever wins.  ", "label": 1}
{"text": "They hyperbole on this sub is just exquisite.  Guys..... democracy will not end because the dems have a bad election cycle.  It just that, unfavorable conditions for electoral success, nothing more or less.", "label": 1}
{"text": "Vibes matter more than facts. Thanks for being the perfect encapsulation of the problem with modern U.S. politics.", "label": 1}
{"text": "Lol who’s coping? I have zero doubt in my mind that Harris will win the popular vote by millions. What I am not sure of is if some unreliable elector is going to refuse to certify the election under false pretenses to get Trump into office. Because that is the only way pumpkin spice palpatine is winning.", "label": 1}
{"text": "You people are ridiculous. Always talking about Qanon conspiracy and how ridiculous they are( and they really are ridiculous). When you legitimately think trump has the power to do any of that? Pot calling the kettle black much? Trump and Harris can say and promise whatever they want. They don’t have the power to fulfill any of those promises without the house and senate. I can’t tell if you people are fear mongering of truly ignorant to how separations of powers work. It’s so funny to see political discourse when you’re indifferent to politics. One idiot accusing the other idiot of something he did a week ago.", "label": 1}
{"text": ">We have yet to hear how it was a joke.\n\nIt was a **comedian** who got paid to make some **jokes**. Do you not know what a comedian is or something? If you're really that stupid then I'm not going to bother replying to you, but here you are since you asked:\n\nhttps://www.theenvironmentalblog.org/2024/10/puerto-rico-trash-problem/\n\n>Trump still hasn't apologized for the rally\n\nWhy should he apologize for the rally?\n\n>Biden corrected himself immediately within hours\n\nKamala still hasn't apologized for the remarks of her boss. Let's stop pretending they're the same.", "label": 1}
{"text": "Doesn't matter as long as we have an electoral system where our elections are decided by a few dipshits in Wisconsin.", "label": 1}
{"text": "...Yeah nothing wrong with discussing. But Belostoma seems like they are having a panic attack.", "label": 1}
{"text": "Okay Hoss check back in a week and we can see how your supply of copium is doing", "label": 1}
{"text": "Cry harder, the future voting generations are all left wing", "label": 1}
{"text": "Maybe because people like you keep replying to me to argue about this subject? If people ask me about it I reply to them. I mentioned him here because the two cases are very similar, yet there is astounding hypocrisy from the people deflecting from Biden's remarks here saying \"he's not on the ballot\" but criticizing Trump for a comedian's remarks, when the comedian is also \"not on the ballot\". That's why I don't buy that argument. You either care about both incidents, or you care about neither incident. If you only care about one but not the other, you're a hypocrite no matter what side you're on.", "label": 1}
{"text": "That's great, but we're specifically talking about voting in the presidential election right now and you're trying to focus on anything else.", "label": 1}
{"text": "Well at the very least you should understand how Trump supporters view the outrage everytime the media doesn't look at the full quote\n\n\nMedia has done this to Trump for 9 years", "label": 1}
{"text": "Your very obvious bias is apparent in your reply.", "label": 1}
{"text": ">In what other way do you think someone could express dissatisfaction with the Democratic party using their vote?\n\nThis is what YOU wrote. It says nothing about only this vote now and the person asked was talking in generalities. I answered your question. Im sorry you dont like the answer. You want to change the question after telling me I didnt answer to your liking Im going to stop talking to you because you are not interested in a good faith conversation.", "label": 1}
{"text": "Yes. When you ask a specific question, the words you use matter especially since the prior people talking were talking in generalities about all elections so your response appears to follow that conversation. Im sorry you dont understand that and clearly your response to me shows you dont want to have a conversation because you didnt clarify or continue, you chose to become oppositional. Because you are here for a fight not to converse. \n\nI answered your question. If a voter comes to you a week out from the election who has done nothing to add their voice prior - not talking to reps, forming coalitions, VOTING IN THE PRIMARIES, and are mad all they have left to express their opinion is their vote, you tell them to vote and become more involved next time because they failed to take the situation seriously and get involved in a timely enough manner that their voices outside the final vote matter. \n\nWhen you wait til right now to say this is my opinions its too late. You have 2 choices and one will be closer aligned to you than the other so suck it up, put on your adult pants, and vote for one of them. \n\nIm done responding to you", "label": 1}
{"text": "Whenever this guy would like to do something in Congress and no just rename post offices that’d be great lol. Thanks for repeating what he has already tried to get into their tiny brains! Once a terrorist, always a terrorist! We’ll win without their votes!", "label": 1}
{"text": "So then prove it. Why can’t you? \n\nAlso, as a note: Biden is the de facto leader of the Democratic Party right now. That’s how it works for having the president in office.\n\n>they ran Biden as unopposed\n\nGod you’re a joke. No, actually, they didn’t. Dean Phillips ran. But when you have the sitting president, you typically don’t do a primary. Hence why there wasn’t one in 2020 for the Republicans or 2012 for the democrats.", "label": 1}
{"text": "Trump is on the ballot, has he disavowed himself?", "label": 1}
{"text": "I saw the video. I don't disagree with you. I'm just saying Trump supporters are, by and large, mentally ill garbage. When you support someone that vile, there's clearly something wrong with you. And by the way, since math is challenging for you--it's not \"half the country.\" With 60% turnout and 47% of the votes, it's maybe a quarter.\n\nThe reality is that only one candidate gives a shit about women's rights, democracy, the climate, and the LGBT community. I'm sorry that for you, cutting taxes for the rich is all you care about.\n\nYou're definitely a Trump supporter, that's for sure.", "label": 1}
{"text": "Let's take it even from your view of what he said.\n\nPolitical views are a choice, unlike where you are born.\n\nIf you object to Biden calling you garbage, you can stop having garbage political views. If you object to that comedian  calling you garbage, you can't stop being Puerto Rican.\n\nRepublicans have always touted themselves as the party of personal responsibility. They should take responsibility for their own shitty decisions and how other people view them as a result.", "label": 1}
{"text": "Democrats and Puerto Rican are outraged that a comedian dare call PR trash.  Not \"playing victims\"\n\n\nRepublicans outraged the president of the United States called roughly half the voters garbage.....\"playing victims\"\n\n\nPolitics are fun", "label": 1}
{"text": "Give an example of me making an excuse for racism\n\n\nBiden called roughly half the voters garbage.  And you are arguing over the pedantics of half.  ", "label": 1}
{"text": "What’s your agenda, mods? Guy submits AI-generated research, I use the same AI to critique it (to critique *itself*) and you waggle a finger at ME for low effort posting? Are you in fact OP, mods? Or do you just have an ironic sense of humor? …Get over yourselves.", "label": 1}
{"text": "They'll run to their therapists. LOL  I can't wait! Proud MAGA Garbage right here!", "label": 1}
{"text": "I love women! They're good in \"Some\" leadership positions. But not the presidency.", "label": 1}
{"text": "There are fine people on both sides....and I'm not talking about neo Nazis or white supremacists they should be condemned totally\n\n\nParse it out for me", "label": 1}
{"text": "> Lol who’s coping?\n\nYou are. That’s why the comment was directed at you, in reply to your comment. And it’s also why you responded to it, and no one else did.", "label": 1}
{"text": "What a telling response.", "label": 1}
{"text": ">He also wants to kill everyone in Gaza and turn it into valuable beachfront property.\n\nOBVIOUSLY this is hyperbole\n\n>He also wants to revoke legal status and protections from immigrants he doesn't like\n\nOBVIOUSLY this is more hyperbole\n\n  \nTry again", "label": 1}
{"text": "Didn't he already scold them telling them how to vote because of their color", "label": 1}
{"text": "You seem to have an issue understanding simple concepts, sweetie. Redevelopment is key to rebuilding - that is not a tacit call to \"kill everyone in Gaza\"\n\nAnd the Haitians are here under TEMPORARY protected status - a program that Harris watered down to essentially provide permanent residence status for people who have simply applied for TPS. Trump has said the permanence of the Harris policy will be rescinded. Which isn't a call to revoke legal status from immigrants he doesn't like. \n\nLike I said - if you have to engage in hyperbole to try to get your point across - then your point isn't likely valid. \n\nTray again.", "label": 1}
{"text": "Your patience is legendary.\n\n\nI couldn't even bother with these insufferable hot takes.", "label": 1}
{"text": "I mean, it’s just so dumb.  I’m embarrassed that I kept engaging.  ", "label": 1}
{"text": "No a riot as in a riot. Stay hysterical my dude. What are you gunna lose your mind over when Trump loses? Are you going to be able to cope without having something to be terrified about?", "label": 1}
{"text": "This whole site is going to be in shambles Tuesday night...", "label": 1}
{"text": "> To most of the nation \n\nWrong. As First Lady from 2009-2017, Michelle Obama is a widely-known public figure in American culture.\n\nBetween this and all your other mistakes, you’ve completely fucked up.", "label": 1}
{"text": "I will be entertaining either way.  I don’t really have a dog in the fight, but the meltdowns over Trump do bring me great joy.  ", "label": 1}
{"text": "> No one cares about a woman being in charge. \n\nI feel like you might be full of shit. Let’s check:\n\n* In the latest YouGov poll, 57% of respondents said they think America is ready to elect a woman to the White House, while 23% said the country is not ready and 20% were not sure.*\n\nYep, you’re full of shit.", "label": 1}
{"text": "Same. I didn't vote for him.\n\n\nBut smug liberals need a reality check, and I think it's coming.", "label": 1}
{"text": "American figures aren't the same as politicians. Do you think Americans know whether Jon Stewart would be a good politician? lmao \n\nDo you contribute anything to conversations other than specious falsehoods?", "label": 1}
{"text": "Why is it homophobic for us to jerk each other off? Explain in your reply.", "label": 1}
{"text": "Look my friend, it’s okay to out yourself even if it’s on accident, and it’s okay for you to not have worked through all of your feelings regarding this situation. All you can do is give yourself some grace, take a step back and really think about the internalized biases that lead you to make that comment. I accept you and am willing to help you grow and learn from this, but you have to learn to accept yourself and your own growth first", "label": 1}
{"text": "But you think homophobia is \"okay\". What a hypocrite.", "label": 1}
{"text": "Congrats on becoming what you claim to be against \n\n\nI don't use socialism/communism fear mongering.\n\n\nWhy do you use 2025 fear mongering?", "label": 1}
{"text": "I understand gay people. I **am** gay. The only fear is the bullshit lies the left have pushed. And before your claim I'm lying, I've sucked more dick than every girl you knew in school. I'd send you a pic from Provincetown Bear Week, but I'm not risking getting doxxed again.", "label": 1}
{"text": "love that you so quaintly admitted in the follow-up the difference in a traditional open primary, versus when the governing party this time around rallied around a lumbering corpse and protected him to the extent that his true cognitive state was hidden away in the name of clinging to power instead of doing the right thing by the american people.\n\ntoo bad that backfired for them at the end of june, and we saw something remarkable happen in august.", "label": 1}
{"text": "Dude, YOU are delusional to think this will change Dems AFTER working to get Trump elected AGAIN!", "label": 1}
{"text": "Always hilarious seeing tankies insisting that they somehow own the left, often arguing with award winning research and dictionaries to do so.\n\nSorry bud, both the average person on the left globally supports capitalism.", "label": 1}
{"text": "Saying “no u” would have been faster.", "label": 1}
{"text": "> person points to a chart showing conservative/liberal differential in policy stances of gop/dems in an effort to obfuscate liberalism and leftism as being one and the same.\n\nLiberalism is by definition on the left.  You keep arguing with science as if you think it helps your cause.\n\n> i point out succinctly the top-level disparity in american liberalism as practiced in modern times versus leftism.\n\nWhile failing basic poli-sci about what \"left\" means in global/US politics.\n\n> insinuates defining things is bad argumentation\n\nInsinuates your definitions are wrong and you're embarrassing yourself.\n\n> im not sure what else that retort was supposed to mean\n\nYeah, i guess tankies would have a hard time understanding that they're being mocked for arguing against science.\n\n> i ask for engagement based on my argumentation.\n\nAnd got it, but refuses to actually look at factual information.  Typical tankie behavior.\n\n> got it. eats ice cream\n\nMost productive thing you will do today.\n\nFunny seeing Mr. \"Always hilarious\" trying to get the moral high ground lol", "label": 1}
{"text": "But nonsensical. The answer to \"who’s coping?\" is \"no\"? That doesn’t make any sense. I answered the question you asked.", "label": 1}
{"text": "Hillary is the most guilty person alive. Go watch those trials. It's so much evidence that you could call Trump corrupt for not throwing her in jail.", "label": 1}
{"text": ">It’s up to Democratic primary voters\n\nIt's cute that you believe that.", "label": 1}
{"text": "What's your point? Muslims supporting a man who implemented a Muslim ban. They're morons.", "label": 1}
{"text": "Yes, your video is doctored. It's missing the last HALF of the statement. Yall are SO FRAIL. ", "label": 1}
{"text": "What odds did you get and who did you bet on?  Genuinely curious.", "label": 1}
{"text": "Sorry, states rights only apply to subjugating African “immigrants” and women of reproductive age.", "label": 1}
{"text": "You mean all the people standing around watching the spectacle?", "label": 1}
{"text": "So it's not doctored\n\n\nYour argument is that we should ignore those words directly but I stead allot all the context \n\n\nCurious if you see the uriny", "label": 1}
{"text": "Are you OK?", "label": 1}
{"text": "The hyperbole is real, what exactly are you fearing", "label": 1}
{"text": "Trump calls Dems the enemy within at every rally and interview.", "label": 1}
{"text": "And Dems call Republicans fascists and Nazis, are we pretending they aren't calling them enemies from within our border when they do that?", "label": 1}
{"text": "They aren’t paying you enough", "label": 1}
{"text": "So in your opinion all the times Trump references the people there to debate the statue were just him hiding his real meaning so we have to ignore his actual words\n\n\nYou have a nice day", "label": 1}
{"text": "Comments like this makes me wonder if they live in a basement with a tin foil hat on", "label": 1}
{"text": "Are you kidding? They want to get rid of department of education, hud, FEMA, doj, CDC, DHS, TSA, etc. and if they don't outright shut them down they want to privatize them so they are no longer government entities and therefore have no authority over the president or their policies. As government agencies those agencies can enact policy and hold other agencies accountable, Including the president. \n\nYou are completely commenting on bad faith and attempting to gaslight. None of this information is new. Do you work in a Russian troll farm? Some ai script I'm interacting with? Or just genuinely want the downfall of America into an authoritative regime?", "label": 1}
{"text": "Sounds like you've heard of her being a criminal and never dug into it to see if it's true. Why?", "label": 1}
{"text": "So, how much is Kamala's campaign paying you?  We know her campaign is astroturfing on Reddit with shills.  Kamala is a joke.  What has she accomplished over her term the last 4 years, other than raise prices 20% and make the border more permeable for gang members and fentanyl?", "label": 1}
{"text": "I knew what you meant from the outset so I will engage honestly.\n\nI really don't think there are that many of these people. Undecided voters? Of course. Undecided voters that will be moved, to be honest, either way because of this comment? Very little. Most reasonable people can sus out he misspoke.\n\nYeah, if Harris said it she'd be cooked. But tbh I don't think a lot of people are paying attention to what Biden says in this stage of the game, he even got shelved by his own consistency, and I say this with respect.", "label": 1}
{"text": "behold the tolerant left.", "label": 1}
{"text": "Oh, I’m sorry. I didn’t realize you don’t understand figures of speech. Let me break it down for you. \n\nWhen I said “lol who’s coping?”, what I actually meant was “I don’t have to convince myself that Harris is going to legitimately get more votes than Trump.”\n\nWhen I said “saying no u would have been faster” I meant that your response was horribly inadequate and essentially boiled down to “I’m not coping, *you’re* coping”.\n\nI hope that illuminates our conversation for you, terribly sorry it went over your head.", "label": 1}
{"text": "Oh “student of history” please educate us all on a time when a third party vote has affected change? I’ll wait.  \n\nFunny how you “students of history” get all your talking points from right wing and Russia backed attack ads. Free thinker my ass.", "label": 1}
{"text": "To be honest project 2025 is a new edition of previous republican policies. Reagan implemented a lot of the original edition without any real push back. \n\nA lot of the stuff in there are pretty decent things. I understand the abortion topic is a hot topic. The ability to kill babies is always at the forefront of every blue voters agenda. \n\nOther things like securing the border (Kamala wants to implement this as well, the same plan Trump championed before actually.)\n\nSmaller government (that should be easy to agree on) less oversight is always better. Big government ends with a 1984 dystopian type society at some point. \n\nGetting rid of DEI policies.. also good. That’s just reverse racism and as a black man I don’t agree with it at all. Hire me because I’m the most qualified not because you need a token black guy to up your numbers. \n\nThe rest are pretty much common sense topics… it’s just a red policy otherwise blue voters would be all about it. \n\nIt’s time to get Trump back in office and get this country back on track.", "label": 1}
{"text": "Respect your username ", "label": 1}
{"text": "Have you even read any of it? Or know what the 10th Amendment is?", "label": 1}
{"text": "I will make sure my entire 6 state region secedes before the feds can ban abortion and birth control in my nation.\n\nF\\*\\*\\* fundies and f\\*\\*\\* America.", "label": 1}
{"text": "* the only garbage I see out there are his supporters \n\n\n--Joe Biden, President of the United States of America ", "label": 1}
{"text": "The proof is that no one, no one, is leaving the USA now nor did they when Trump was President. In fact, people from all over the world are leaving their homeland and breaking the laws of the USA to get here.\n\nYou think anyone was dying to get into Germany in the 1930s? \n\nIn fact, many left. There was a brain drain which led to the US splitting the atom, when it could have been Germany.\n\nYou and others like you have nothing to offer but fake fear mongering.\n\nIf you really believed the BS you're spouting, you'd be preparing to leave.\n\nAnother example is Venezuela. They have no immigration problem. They have an emigration problem. Venezuelans are coming to the USA. Not one American is leaving to go to Venezuela.\n\nIn order to get on your good side, I'd have to pretend to believe your nonsense. The price of your good side is too high.", "label": 1}
{"text": "“… the only garbage I see out there IS his supporter’s his his his … demonization of latino …” \n\nwasn’t “ …ARE his supporters…” \nThe first HIS refers to Trump, The second referred to the comedian.", "label": 1}
{"text": "The comedian didn’t call anyone garbage. He called PR a pile of trash floating in the ocean. Living in a pile of trash is a choice. If you object to that comedian calling your country a pile of trash, you can clean up the trash.", "label": 1}
{"text": "Holy shit, reading through this post it’s very clear you guys are larping some dystopian fan fiction.", "label": 1}
{"text": "Not reading all that. Can you summarize", "label": 1}
{"text": "Jesus  Christ, you people are nuts.", "label": 1}
{"text": "Bravo. They are old, as is their primary audience, you. \n\nCNN, MSNBC, and CBS aren't watched nearly as much as Fox News. Ergo, they are not mainstream. They are also small channels that peddle truths that America doesn't want to hear. \n\nI am sure Trump will win on Tuesday and we'll all watch our economy crash with Elon's plan, and see half of us in camps. Exactly what you want for us all\n\nGood luck, don't die.", "label": 1}
{"text": "That’s not what he said. Why are you leaving out the rest of the paragraph, and only latching onto that one part, which he immediately corrected himself about?\n\nIs it because you’re cherry picking?", "label": 1}
{"text": "It’s hilarious the person you’re replying to claims to care about “burden to welfare” when bragging about taking fat checks from the government for his “disability”\n\nTaking 2 mins to look at this guys profile tells you not only is he a nut he’s one of the reasons why Idiocracy is becoming more of a documentary vs fiction.", "label": 1}
{"text": "We do live in the dumbest possible timeline.", "label": 1}
{"text": "None of the things I indicated are baseless if you look father than the media that is in the tank for Democrats. But you do you.", "label": 1}
{"text": "lol keep being delusional. Fact is, Putin only invaded during Bush, Obama and Biden years, he never made a move during Trump so you can keep telling yourself such BS", "label": 1}
{"text": "You mean the media has been sanewashing Trump for 9 years by trying to explain what he means in normal human words instead of just taking his world salad at face value?", "label": 1}
{"text": "No, not even close", "label": 1}
{"text": "He hasn't corrected himself nor apologized for what he said\n\n\nAnd it's exactly what he said \n\n\nDemocrats have spent 9 years quoting Trump's exact words ignoring what was said before and after, but when Republicans do it, it's not allowed?  Why?", "label": 1}
{"text": "My bad\n\n\n* The only garbage I see is his supporters \n\n\nHe is talking about Trump then said this, he wasn't talking about the comedian.  \n\n\nBut you keep supporting a president who calls Americans garbage. Seems on brand for democrats", "label": 1}
{"text": "When someone calls a whole area, city, region, island, etc (Puerto Rico is part of the USA, btw) a \"pile of garbage\" in the context of complaining about an \"open border\" and immigrants coming into \"our county,\" during a campaign event for a man who has as a central tenant of his campaign that the rest of the world is letting its criminals and worst people free to invade the US, and we have to protect ourselves from the worst people the world is giving us, that's a very offensive and, yes, racist thing to say. \n\nI don't care if you think there is a meaningful distinction between calling the island \"a pile of garbage\" and calling the peoppe on that island \"garbage,\" because the context means he's targeting - as the butt of the joke - Puerto Ricans themselves. That's the context, that's the point. \n\nIt's also pretty offensive to call Puerto Ricans \"immigrants,\" or to refer to them in the same breath as immigrants, because they are in fact US citizens - Puerto Rico is a US territory.", "label": 1}
{"text": "Are you always the stupidest person in the room?", "label": 1}
{"text": "History is deep and your knowledge is shallow.", "label": 1}
{"text": "> Believe whatever you want, but Democrats already knew they were going to lose the hose to gerrymandering and the undemocratic nature of the system before passing the ACA. And \"Republicans will complain about good policy\" is a very poor reason for avoiding more good policy.\n> \n> \n\nYou have no idea what youre talking about and rewriting history.   Gerrymandering wasnt even as bad till 2012 because the census is every 10 years and redrawing of maps after.  This was so catastrophic to lose the house for 8 years despite higher population.\n\n>No, Im not. Democratic politicians, and US politicians in general, don't care what you or I think. We aren't their donors.\n\nGot it youre an idiot.\n\n>Im pretty sure the millions suffering medical debt and hundreds of thousands who have died from lack of healthcare even under the ACA are happy that Democrats will say \"but the ACA!\" to ward off progress until the heat death of the universe. Or more likely, the climate cataclysms they will help cause by saying \"but we passed the IRA!\" to ward off any new climate legislation until the East Coast disappears.\n\nGot it, youre an idiot.", "label": 1}
{"text": "Why do you keep forgetting to include the rest of what Biden said?\n\nIs it because it undermines your argument?\n\nYou keep cherry picking and forgetting to include the context and the complete statement.", "label": 1}
{"text": "So to be clear....the left spends 9 years taking Trump quotes out of context stating \"we are just quoting exactly what he said\"...that didn't have folks upset about context\n\n\nBut when the right quotes exactly what Biden said, that is a problem ", "label": 1}
{"text": "No, he really wouldn't. Thank you for showing that you are at peak delusion. I can't debate someone so out of touch with reality.", "label": 1}
{"text": "The only thing I will absolutely enjoy if the traitor wins is watching the Palestinians that voted for him get deported to a war zone refugee camp.", "label": 1}
{"text": "Their not lol, they all support Harris except for musk and now buffet", "label": 1}
{"text": "\"against dangerous bigots\" who's entire shtick seems to be the super duper dangerous position that males should not compete against females in sports. \n\nCope more.", "label": 1}
{"text": "Nothing in that article says gun store owners will not sell to LGBTQ+ buyers. \n\nTry again.", "label": 1}
{"text": "That's not a gun shop, sweet pea. \n\nTry again.", "label": 1}
{"text": "That's not a gun shop, sweet pea. \n\nTry again.", "label": 1}
{"text": "That's not a gun shop, sweet pea. \n\nTry again.", "label": 1}
{"text": "No, sweet pea - it's not ok to discriminate against anyone. \n\nTry again.", "label": 1}
{"text": "Well you said it’s ok to refuse to sell guns to Biden voters and generally not serve gay customers fr religious reasons. Or at least you agree with the discrimination in those articles", "label": 1}
{"text": "You've gone from inventing something to whine about - to lying about what I've said. \n\nBe more desperate.", "label": 1}
{"text": "Oh my bad it was another guy that’s making the same argument as you that is making excuses as to why the discrimination in the articles I posted is ok. It’s hard to tell your arguments apart since they are so similar", "label": 1}
{"text": "Buddy - I don’t know how to tell you this, but uh, Donald Trump was ALREADY the president.  And people like you told me in 2016 that he was hitler and that democracy was over.  Yet, here we are, still having elections.\n\nYou’ve lost your mind.  Donald Trump broke you…", "label": 1}
{"text": "People are done with useless cynics like you. Try to help or go away. We don't need anybody telling us what's possible and what isn't.", "label": 1}
{"text": ">Holy shit, reading through this post it’s very clear you guys are larping some dystopian fan fiction.\n\nStar Wars meets Revenge of the Nerds", "label": 1}
{"text": "Listen you Liberal fools,  this is an air headed woman who is a complete fool !!  The only solution is MAGA !!!", "label": 1}
{"text": "No one has said violence against trans folks doesn't exist. But to ascribe the violence to just \"right wiping\" (whatever that's supposed to mean) is just to ignore basic facts. \n\nCatch up, bud.", "label": 1}
{"text": "All of  you left wingers here in the Reddit echo chamber can take solace in Robert Conquest's three laws of politics.\n\n1. Everyone is conservative about what he knows best.\n2. Any organization not explicitly right-wing sooner or later becomes left-wing.\n3. The simplest way to explain the behavior of any bureaucratic organization is to assume that it is controlled by a cabal of its enemies.\n\nLaw #2 is now ascendant. The left is winning. Oh, even if Trump wins, its just a speed bump on the way to progressive nirvana.  You are winning. Tampons in the boys rooms, abortion up to the 9th month, globalist open borders, Orwellian biometric databases, cameras tracking your every move, no more cash, every thing digital, everything monitored, stored, and retrievable in the guise of preventing \"disinformation\"  --  the Orwellian utopia you dream of is well on its way, and the Davos elites jetting in their private planes are counting on you to mask up. vaccinate up, and become the good little sheep for the all knowing shepherd who will herd the flock.", "label": 1}
{"text": "Arab for Trump, all of you are a truly void of humanity, how about somebody come kill your family and ask you to vote for her, Genocide Kamala will never win Michigan, we are 300,000 votes and we will deliver Michigan to Trump, Kamala can ask her war criminals friends to vote for her from Israel", "label": 1}
{"text": "Yes that's why it's both at the same time you dingus.", "label": 1}
{"text": "Your ideological purity tests are an absolute drag on the party", "label": 1}
{"text": ">Phone calls? Talking to your reps? Finding like minded people who also voted for that politician and going as a group to get them to change their voting stance? \n\n\nis this a joke lmao. like are you doing a bit right now", "label": 1}
{"text": ">No, it isn't.  Genocide is a very specific intent and action, neither of which is supported by the Israeli military campaign in Gaza.\n\n That's for the ICC to decide dipshit", "label": 1}
{"text": "As if they aren’t talking about banning gun sales to trans people already", "label": 1}
{"text": "Your a Trumper your just too much of a coward to admit it and for your information the majority of the authors of Project 2025 WERE members of the prior Trump administration and/or allies outside of the administration, to say Trump disavowed it is putting lipstick on a pig", "label": 1}
{"text": "I'm so sorry I spent my 20's earning three history degrees instead of majoring in business like a good little corporate drone. Clearly I deserve your mockery and insults for attempting to learn something here, asshole.", "label": 1}
{"text": "> Great, so we're doing the \"but the analogy is flawed because...\"\n\nNo, I'm pointing out that the analogy is stupid, *because that's not how the system works*. If you want to make a point, you should at least be assed to do the bare minimum of understanding how shit works", "label": 1}
{"text": "Great, now read the other part of my comment.\n\nI'm not here for pedantry.  Discuss the point, or fuck off to my block list.", "label": 1}
{"text": "Biden would’ve absolutely lost if he was still running lol", "label": 1}
{"text": "I mean you people as in you people who spread this fear porn nonsense. I’m over it. I’m not wasting any more of my time. Live in your terror fantasy all you want.", "label": 1}
{"text": "I'm scheduled to do heart surgery on a child who's barely hanging on.  No I see that the \"ethical move would be to do a little research\" now instead, so I cancelled.", "label": 1}
{"text": "Hey since you don’t seem to be exhibiting the cognitive discrimination to evaluate things well… maybe in your case it’s best to skip the vote, and just focus on your heart surgery.", "label": 1}
{"text": "I'm sure you will enjoy life under a single party state.", "label": 1}
{"text": "There are none, because it's bullshit.  This election is going to be tighter than an ant's cunt.  ", "label": 1}
{"text": "Have you been reading to much reddit? This would never happen.", "label": 1}
{"text": "Legally no practically speaking yes.", "label": 1}
{"text": "Are you really this ignorant? Most Americans are against the progressive movement. You can’t define what a woman is but you want to run a country lol?", "label": 1}
{"text": "[https://www.youtube.com/watch?v=-cQ9sdkSF5s](https://www.youtube.com/watch?v=-cQ9sdkSF5s)", "label": 1}
{"text": "This is evidence it was reported in the news at these votes were duplicates", "label": 1}
{"text": "Maybe we shouldn't include funding for Ukraine in it. There were Dems that helped kill it too. Just more political theater.", "label": 1}
{"text": "I don't think Trump knows he's Trump.", "label": 1}
{"text": "that boarder bill was not wonderful, I am happy that crap was killed on the floor. for the following reasons \n\n1) [nearly 400-page bill](https://www.appropriations.senate.gov/news/majority/murray-releases-text-of-bipartisan-national-security-supplemental) with little time to actuarlly read it before discussion, this screams red flags to me. \n\n2) the bill gave money to ukraine, \n\n3) The Lankford bill boosts family-based green cards by 32,000 a year for five years, and employment-based ones by 18,000 a year.\n\n4)  automatic work permits to the relatives of certain temporary workers and others, speeds the issuance of work permits to illegal aliens seeking asylum (thus increasing the incentive to come), and provides taxpayer-funded lawyers to certain illegal aliens, which is currently prohibited by law.\n\n5)That’s why, for instance, even when the border is “shut down” by the new emergency power the bill creates, it mandates the admission of “a minimum of 1,400 inadmissible aliens each calendar day” through the ports of entry\n\n[https://cis.org/Oped/Border-bill-terrible-and-way-Biden-dodge-blame-not-enforcing-law](https://cis.org/Oped/Border-bill-terrible-and-way-Biden-dodge-blame-not-enforcing-law)", "label": 1}
{"text": "My thoughts are that a significant percentage of our population are utter morons.", "label": 1}
{"text": "First time I've felt hope in a couple months.", "label": 1}
{"text": "Iowa is the Nick Fuentes of electoral college math. Lose here it's a long day for Agent Orange.", "label": 1}
{"text": "So the US voters don't trust when their team loses\n\n\nOther countries with laws like voter ID laws do trust when their team loses.\n\n\nTell me more about how we don't need to fix the distrust in our elections", "label": 1}
{"text": "Can't wait to come back to this post after election night", "label": 1}
{"text": "It's Joever", "label": 1}
{"text": "> Do you think he would have won against Biden.\n\nNope.", "label": 1}
{"text": "Well, I can think of one order that he could give that'd vacate a seat...", "label": 1}
{"text": "y'all cats love to throw around the term \"plenary power\" like you're a toddler that just learned a new word.", "label": 1}
{"text": "Harris is rightfully losing votes.  Any smart person knows that the Biden Harris foreign policy has the world in fire.   The wars going on now is Harris fault.   BRICS is getting very aggressive and dangerous because of Harris.   VOTE TRUMP", "label": 1}
{"text": "sycophants are basically brown nosers", "label": 1}
{"text": "Just glad we are almost there!", "label": 1}
{"text": "Obama style assassination of an American citizen?", "label": 1}
{"text": "What the hell does that even mean?", "label": 1}
{"text": "Oh you're using far-right outlets as your source. Might as well throw some Breitbart and 4chan in there too while you're at it. This conversation is going nowhere, have a good day.", "label": 1}
{"text": "**Trump wasn't in political office at the time --how did he kill it**....Wake up folks .", "label": 1}
{"text": "Obama authorized a drone strike on an American citizen. I think his name was Alwaki. That means that the citizen wasn't given due process.", "label": 1}
{"text": "I understand reddit is a kinda delusional crowd. But anyone who's dumb enough to take any of this seriously is...what can I say? Hahaha. 100EV for trump? He'll probably hit 300. Man, i don't know how people can be so deluded. Oh boy, i'm gonna have a really fun day after election on reddit reading all the meltdowns. \n\nImagine expecting 100EV and watching Trump just wipe harris off the floor. The shock. \n\nAnd the republicans ran a terrible campaign too. Trump, despite being a very charismatic president, he only appeals to a niche crowd. He is VERY easy to beat nationaly. Add in the whole abortion thing, he's ripe to be defeated. Literally any decent candidate would beat him. But you guys just had to go with the worst candidate possible. Lol. Kamala harris....really????? Hahaha. \n\nMan...america truly is a joke. Looks like another glorious 4 years of trump memes incoming.", "label": 1}
{"text": "Lol none. She’s losing states.", "label": 1}
{"text": "Anyone seeing Trump say Amen in any of those sessions where religious leaders (?) Are praying over him?  No", "label": 1}
{"text": "It's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "It's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "It's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "It's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "We're on the wrong path if we're Christians and voting this year.  Don't fall in the trap, look after yourself and loved ones.\n\nIt's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "We're on the wrong path if we're Christians and voting this year.  Don't fall in the trap, look after yourself and loved ones.\n\nIt's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "We're on the wrong path if we're Christians and voting this year.  Don't fall in the trap, look after yourself and loved ones.\n\nIt's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "We're on the wrong path if we're Christians and voting this year.  Don't fall in the trap, look after yourself and loved ones.\n\nIt's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "We're on the wrong path if we're Christians and voting this year.  Don't fall in the trap, look after yourself and loved ones.\n\nIt's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "We're on the wrong path if we're Christians and voting this year.  Don't fall in the trap, look after yourself and loved ones.\n\nIt's the road most traveled, unfortunately.   Many perfer to buy stuff they don't \"need\", or swearing, getting drunk, kill (even through abortion or morning after pills), partying, having sex outside marriage, worship of anyone or anything but Christ.   It's so sad and I often pray for everyone, who's of this deceitful world to find their true path... to God.  Denying it brings hardships, if not now.. then later, cough (hell). The truth is we ALL sin every single day.  We ALL miss the mark of perfection to get into Heaven... So, we need saving (to become reborn) to have our sins forgiven.  There's only one way that happens.  One heartfelt, not fake (God can tell) prayer to Him.\nHere's what to pray to him... mix up the wording to make it in your own words, but pray with your mouth when you do it... and mean it.\n1) Tell him you're a sinner and you need a savior. \n2) Tell him you know he died on the cross and shed his blood... blood you know that will wash away all your sins and purify you.\n3) Ask him to put the Holy Spirit in you.\n4)  when you end your prayer. End it with not just \"Amen\" but with... \" In Jesus's name, I pray, Amen\"\n\nThen watch as your life starts to transform for the better.  You'll feel convection to be a better person and you won't know what happened to you.  It's called rebirth. \n\nAt that point you'll see clearly, and your name goes into the book of life... which means you will go to heaven for eternity.   Instead of hell for eternity. \n\nBut the people who choose their own path or not humble themselves... there's unfortunately only one direction for that group.  I feel pain in my heart for all the lost souls we'll likely witness in our lifetime.   The world is spiraling downward in a hurry.   If you've seen destruction increasing, haters hating, sexual abuse increasing. Earthquakes and \"natural\" disasters increasing like crazy since Covid,  increasing prices of food, gas, rent, everything... AND SO MUCH MORE... then don't kid yourself, this is NOT sustainable folks.  Wake up, get saved.  Stop sinning,  stop giving into those fleshly desires that evil wants you to crave.  The very evil you won't escape soon, but don't let it be too late for you.  If you're luke warm on Christ today, time to repent and turn to Him... time IS running out.  I know you're tired of false teachers in churches, God will deal with those who misrepresented them.  Look after you and your families though.   I'm not going to give you dates or feed you full of false doctrine, or claim to know it all... I just know He loves you but there's only one narrow path, it's not an easy path in this test we call life.  But the rewards don't have words for it.   All good though, I have faith in that.  Join us in faith, through your own private worship of the only savior WE all need or we've all denied at some point in our lives.  Love Jesus today my brothers and sisters.   God Bless", "label": 1}
{"text": "What do you mean if?\n\n\nIt's literally happening before your eyes\n\n\n* Democrats/Republicans have switched sides on getting involved in foreign wars and entering police actions\n\n\n* Democrats/Republicans have switched sides on international trade\n\n\n* Democrats/Republicans have switched sides on deportation of illegals", "label": 1}
{"text": "It's a troll account that was created less than a month ago. It's not worth arguing.", "label": 1}
{"text": "Trump is the way forward...I wish I could have said she did a good job she was head of the border that she not only failed at but didn't even visit 1 time in 3 years.. another thing kamala was head of was a $42 billion dollar internet foe rural areas no 1 has been hooked up. Shit give me $1  billion. I will hook up personally 1,000 people with Star Link. Another one of her failures is the economy it's just horrible what she has done with letting in all these immigrants they have bankrupted cities all across America, which funds should be used to help with hurting Americans. Another huge downfall is that she was not elected by 1 person she was installed by democratic elites. The big one is she fails to secure are country from WAR and young Americans know that they are on the chopping block if she is elected they are the ones going to war to fight because her administration cannot and will not have meetings with world leaders that we have conflicts with. So if you can look at you kids, your grandkids and say I'm willing to send them to war, then vote for kamala", "label": 1}
{"text": "You are helping me make my point.  In that entire post you didnt once point to the constitution to claim the SCOTUS ruling is wrong.  Just more broad claims of activism based on not liking the results\n\n\nAbortion is the biggest and should be the easiest.  You are not just some layman.  You know the constitution well so in your own words show me where in the constitution it protects or denied a fetus rights", "label": 1}
{"text": "I told a friend of mine i would not feel comfortable sleeping next to woman in the same bed after having voted to turn her into a second class citizen.", "label": 1}
{"text": "You haven't been paying attention then.\n\nHarris is the one who can't stop talking about Trump.  She can't answer a single god damn question about policy, having to resort to \"Word salad\" responses.\n\nHer campaign has been a disaster.  So much so, that FEMA has sent her several $750 checks.", "label": 1}
{"text": "Are you for real? You made a baseless claim that his wife had a more promising career (as a fucking corporate lawyer so what does that mean besides more $$$) and then accuse me of judging everything by how much money one makes? Yall are impossible.", "label": 1}
{"text": "Amen.  I agree.   But are we being deceived?  Only time will tell.  The whole abortion crap happening is indeed disgusting satanic witchcraft bs.  God Bless", "label": 1}
{"text": "Too bad brother.   I hope you find your way to the Truth, it's not in this world.   Good luck and I'll pray for you.", "label": 1}
{"text": "In the lack of choices and if I had a gun to my head to vote, based on your sound response and wisdom... yes, I'd have to vote for him.  But isn't voting for the lesser of two evils still contributing to supporters of evil?  As a reborn Christian, I would just not vote.  Just such a tough position... neither will bring peace. That I know.", "label": 1}
{"text": "Please forgive me ignorance but is a partial abortion ban so critical when compared to world war 3?", "label": 1}
{"text": "If your daughter wasn’t your daughter, perhaps you’d be dating her.", "label": 1}
{"text": "> Not once in the entire segment did they mention that no law actually prevented her care and that she died of untreated sepsis.  No conversation was had about how Drs aren't following the laws in place.\n\nCan you provide a source for these claims?", "label": 1}
{"text": "Thete is EXTENSIVE pretrogative and precedent for putting him up against a shooting squad for treason.\n\nI wonder what democrats will do if they come out vitorious in the election", "label": 1}
{"text": "You are the one gaslighting the rest of this thread with your nonsensical answers. Just stop while you're ahead.", "label": 1}
{"text": "It is when that’s the only issue that works for you.", "label": 1}
{"text": "This isn't 2020. Was at the gay bar last night and we all talked about the election. It was close to 50/50 last night for Trump. The discussions I have during Tea Dances are the same. Gays are increasingly tired of the trans movement being associated with the LGB crowd. Many feel they are dragging us backwards in public policy. \n\nHe probably won't win 50%, but I wouldn't surprised for him to get 35-40%. Maybe half of gay/bi men. I imagine lesbians are less friendly to him.", "label": 1}
{"text": "I hope Ted Cruz loses.", "label": 1}
{"text": "Reading this forum… You really think female voters pick candidate by his gender? I hope people are driven by research about every candidate instead of DEI propaganda.", "label": 1}
{"text": "What kind of delusion are you living in?", "label": 1}
{"text": "I respect your opinions, thank you.  A differing opinion is healthy indeed.  There are saved followers of Christ, then there are many who claim to be \"Christian \"  unfortunately the latter outnumbers the former.   I'm not saying anything to Judge, but simply help summarize what is truth.  I question, with discernment, any religion \"leader\" ( which I am not ) who influences politics in any way ( vote, don't vote, who to vote for )... they have no right to support or criticize.  Any mixture of religion with politics is Apostacy.  Careful my friends,  God Bless you all on whatever decision you make.  Talk and pray to God first, he's your leader.... not the church ministry whose persuading... this is to be kept from Christianity at all levels of belief.   Believe in God, he'll guide us.", "label": 1}
{"text": "You are part of the problem", "label": 1}
{"text": "DEI stands for “diversity and inclusion”, belief that that’s something that should drive everything. For instance, “Diversity Hire” means that someone was hired because he is gay, as opposed to be the best professional. \n\nVoting for president basing on sex is a very bad idea.\n\nUnited we stand, divided we fall.", "label": 1}
{"text": "My God the amount of comments talking about how we need to eliminate the conservative mindset is mind blowing.\n\n\nImo this is just another example of the real problem, no self reflection, no acknowledgement that anything needs to change but the other side", "label": 1}
{"text": "They didn’t ban abortion. Women still have right to abortion, it’s not forbidden but it’s up to states now to decide", "label": 1}
{"text": "if abortion is not banned, why is it a big deal?", "label": 1}
{"text": "/u/itsdeeps80 redditor since 10/29/2019 (5 years)\n/u/serpentjaguar redditor since 01/04/2007 (18 years)  \n\nYeah, sure, this is my \"first day on the internet.\"  \n\nSon, it's pretty obvious that I'm a lot older than you and that I was using the internet back in the 90s before you were even born or were still shitting green.  \n\nYou've been schooled, now take it like a bitch and learn to show a little humility.", "label": 1}
{"text": "See. Even that statement shows how much you’ve drunk the left wing propaganda Koolaid. The Republican Party are not Nazis.", "label": 1}
{"text": "Amazing how many of the comments complain about a lack of critical thinking, but then settle on a solution that comes down to simply \" there wouldn't be a problem if everyone just agreed with me.\" The arrogance on reddit is boundless, especially this sub.", "label": 1}
{"text": "Lol. I'm going to assume you're purposely misunderstanding what I said. Makes perfect sense. Did you watch the videos?", "label": 1}
{"text": "Your entire post is based on misinformation.  You don't even know what the actual complaint was", "label": 1}
{"text": "that's not a reputable source, that's far right propaganda. downvoted.", "label": 1}
{"text": "With that logic we need to extradite every muslim from America immediately. In which case you should support voting for trump.", "label": 1}
{"text": "Risky clicks and a random youtube video.  That \"random\" youtube vid is the primary source. \n\nYou can go on youtube, search \"full measure with sharyl attkisson trump interview\"  skip to timestamp 22:55 to get your information from the primary source. \n\nThen you can go on the \"The Hill\" X profile, click on the search bar, and then type in \"If lose to Joe Biden\". It will show primary source of the article you linked. \n\nIt appears you're anti-context and pro-secondary source. Inferior sources of information.", "label": 1}
{"text": "If you had a valid point to make, you’d be able to express it. Instead, you’re trying to get me to click on some video link. \n\nWhy can’t you express your own thoughts?", "label": 1}
{"text": "This thread started because you claimed that Trump will not run again if he loses the presidential election for a second time. I pointed that that he has said that before and it turned out to be a lie, because he lost in 2020 and here he is in 2024, running again. He has a proven track record of lying about this specific issue.\n\nIn response, you want me to click on random YouTube links, or do some kind of elaborate procedure to search for info you claim exists. \n\nYou have also so far failed to explain how these links would support your argument in any way. That’s not the way any of this works, my friend, but it’s an interesting strategy. \n\nIf you have a decent point to make, do it.", "label": 1}
{"text": "And the context behind those statements are in the primary sources of information. The only excuse you have is \"I don't want to watch it\". You're literally refusing to get a more accurate picture. Watch the videos.", "label": 1}
{"text": "It seems as if you’re not willing to explain your position here, so I guess until that happens this won’t move forward much.\n\nIf you had a valid point to make, you’d be able to express it in words. After all, you didn’t start this conversation with a video, did you? You started it with words, and have apparently run out of them.", "label": 1}
{"text": "Ted Cruz losing to Collin Alred", "label": 1}
{"text": "The poor can enjoy a healthy meal provided to them by the tax payers.\n\n\nYou can scrounge up to buy some cake mix on your own dime", "label": 1}
{"text": "Cool, so you’re full on “fuck the poor”, because you don’t think that they should be able to use SNAP for things you don’t like. Good to know", "label": 1}
{"text": "Roe, Roe, Roe the vote!", "label": 1}
{"text": "They’re gullible, which I associate with stupidity.", "label": 1}
{"text": "Well for a start maybe not banning people with normal takes from this sub Reddit", "label": 1}
{"text": "Of course they are. Have a problem with it? Don't get pregnant. Your feelings or convenience don't give you a right to *murder babies*, you fucking psychopath. Honestly this is against the thread, but the kind of people that make up modern liberals really are disgusting and horrible - and you are a poster example.\n\nDon't get me wrong. I don't oppose abortion, because I don't believe fetuses are people. But if I did, this argument would be completely crazy.", "label": 1}
{"text": "Everyone who doesn’t agree with me should go to prison. They deserve to rot for voting for a fascist and trying to ruin the democracy they should not be able to vote again or they will destroy denocracy", "label": 1}
{"text": "Because we all know that republicans hate minorities", "label": 1}
{"text": "[https://www.reddit.com/r/AskConservatives/comments/1gjfi8k/if\\_the\\_economy\\_is\\_in\\_good\\_shape\\_sources\\_within/](https://www.reddit.com/r/AskConservatives/comments/1gjfi8k/if_the_economy_is_in_good_shape_sources_within/)\n\nCan anyone open this link to [](https://www.reddit.com/r/askconservatives/)? There was a fantastic discussion on the economy with 80+ mostly good faith comments that might have just gotten deleted.", "label": 1}
{"text": "He has absolutely nothing to do with project 2025 and none of us want that. Pedophile? I think not. There are always money hungry hoes out there. That’s why people are not believing women more and more. What’s Kamala going to do? She legit has zero policy. She has no idea what she’s doing. I don’t care who gets in, but surely yall could have done better than Kamala", "label": 1}
{"text": "We keep up the fight because you’re gonna realize you voted in a Hitler socialist regime and then all you Gen Z and all you real Democrats and not socialist will join the Republican Party and overthrow these assholes next time around", "label": 1}
{"text": "\n“You don’t get to speak for conservative men”\n\nlol. You think I’m trying to speak for a herd of useless sheep? \n\nCope harder.", "label": 1}
{"text": "It’s not going to bother me at all who wins. But damn, yall riot at the slightest inconvenience. Talk about coping? Yall can’t handle the wind blowing the wrong way lol", "label": 1}
{"text": "Are you confusing me with all of those conservative snowflakes? They seem to be the ones who bitch and moan about every little thing under the sun.", "label": 1}
{"text": "works fine for me?", "label": 1}
{"text": "I just love your completely unrepentant commitment to know-nothingism.", "label": 1}
{"text": "Jesus dude, that's unhinged", "label": 1}
{"text": "This is about America. Leftism won't exist after tomorrow except as a tiny minority.", "label": 1}
{"text": "It’s ok to admit that you hate people for their personal choices, opinions, standings, backgrounds, and that you think that people should not have freedoms to make their own decisions.", "label": 1}
{"text": "They should listen to what he said to Jewish Americans. \n\nhttps://youtu.be/aCR8R8UEeyA?si=CupvaV55rZ5DCxB8", "label": 1}
{"text": "Come on, this is giving her staff to much credit. That butch bitch and her staff are at home praying to Donald Trump that Kamala doesn't win.", "label": 1}
{"text": "Yep, that was the point, good job.\n\nYou're also not a worthwhile person to continue this conversation with and I should have tapped out above when I could sense that your contribution was meaningless. Have the day you deserve.", "label": 1}
{"text": "Less than 24 hours until election day and between 30-80 hours until the bulk of votes are counted ... nobody is going to be able to tell you shit one way or another until then. \n\nSmoke up, take a drink, and crank off that nervous load. We're in for the ride until then.", "label": 1}
{"text": "All I got is nicotine pouches and scale models", "label": 1}
{"text": "Total Chad behavior.", "label": 1}
{"text": "And the nervous load. Don't forget that.", "label": 1}
{"text": "It could be worse.  We could be waiting for Key Race Alerts from Broward County", "label": 1}
{"text": "Then let us build minis together, brother.", "label": 1}
{"text": "Put me in the screenshot.", "label": 1}
{"text": "Really what an intelligent response. Not funny, not factual , an low IQ. Is that your mom calling you out the basement keyboardist? Find a purpose.", "label": 1}
{"text": "Putting you back on the block list now, try not to fuck over too many people as you seek to implement your terrible politics via the law. And maybe think about not being a lawyer anymore, you're too bad of a person to do it.", "label": 1}
{"text": "https://en.m.wikipedia.org/wiki/Ur-Fascism\n\nThe current conservative movement in America ticks all 14 boxes.  Is not a good look for you", "label": 1}
{"text": "So you’re sayin’ you’re in the Cult of Trump? Bless your heart you smooth-brained Neanderthal. Shhhhh just look at the rabbits, this is for your own good…", "label": 1}
{"text": "Just say she’ll enforce the law. Neutral and unobjectionable. If that upsets the Zionazis they can seethe and cope.", "label": 1}
{"text": "I build airplanes & tanks! But minis are cool too. I’d wanted to get into them but I’d probably want to play WH if I was going to build em", "label": 1}
{"text": "All the same. Anything to distract us from the nonsense outside.\n\nIts a shame that [Aeronautica Imperialis](https://www.warhammer.com/en-US/shop/aeronautica-imperialis-horus-heresy-rulebook-2022-eng) didn't catch on more. Good mix of the two.", "label": 1}
{"text": "Yeah that’s look awesome", "label": 1}
{"text": "This was a surprise to you? Have you not been paying attention since 2016?", "label": 1}
{"text": "Ridiculous.\n\n\nSo after all those facts you just jump to more nonsense instead of admitting you were misinformed.\n\n\nAnyway, Trump does believe they are still guilty of holding her down when she was raped.   \n\n\nMany women will tell you that being raped kills who you are.  \n\n\nBut whatever man.  If that breakdown of facts isn't enough to convince you were misinformed, there are no number of facts that will get you to acknowledge fake news is a real issue.\n\n\n\n\nYou have yourself a wonderful day", "label": 1}
{"text": "instructions unclear: smoked a load, cranked a drink, and took an up. things aren't looking good.", "label": 1}
{"text": "> because Harris, Walz and Biden are honest and squeaky clean\n\nTake the blinders off. This is the most evil, corrupt group of politicians in American history", "label": 1}
{"text": "You are equating killing a baby as a human right\n\n\nDo you not see how ridiculous that is?", "label": 1}
{"text": "Can I join you guys and build gunpla?", "label": 1}
{"text": "We call that a Columbian white out.", "label": 1}
{"text": "It's even their cake day, neat!", "label": 1}
{"text": "All kits are welcome. Only two rules:\n1: Don't be a dick. \n2: You gotta help look when a piece goes skittering under the table.", "label": 1}
{"text": "I've been working on my Star Trek Galileo scale model myself. Just bought some new paint today", "label": 1}
{"text": "He was already president. Is that what he did the first time? Fucking think before you write some dumb shit like this.", "label": 1}
{"text": "The Character and Eligibility of Donald Trump: A Critical Examination.\n\nThis paper examines Donald Trump’s character and constitutional eligibility to serve as president, focusing on the disqualification clause in the 14th Amendment of the U.S. Constitution. A central argument is that his impeachment by Congress unequivocally establishes his ineligibility, as he engaged in insurrection on January 6th, 2021. He conspired with others to have Vice President Pence reject state-certified electors and incited his supporters into rebellion. Under the Constitution, such actions disqualify him from holding public office, mirroring historical precedents where Congress or governors have refused to certify the elections of individuals deemed by them to be insurrectionists. America’s most esteemed presidents, like George Washington and Abraham Lincoln, are celebrated not only for their leadership but for their unwavering integrity and commitment to democratic principles. Washington’s humility and dedication set the foundational values of the nation, while Lincoln’s moral conviction preserved its unity during its most perilous times. In stark contrast, Trump’s conduct—both during his tenure and specifically on January 6th—reveals a profound deficiency in character. His reckless and divisive actions pose a direct threat to the very fabric of democracy. This paper argues that, based on constitutional mandates and the essential qualities required of a president, Trump’s character and actions categorically disqualify him from the presidency, irrespective of policy positions or partisan affiliations.\n\nhttps://www.researchgate.net/publication/384473246_The_Character_and_Eligibility_of_Donald_Trump_A_Critical_Examination/stats", "label": 1}
{"text": "The Character and Eligibility of Donald Trump: A Critical Examination.\n\nThis paper examines Donald Trump’s character and constitutional eligibility to serve as president, focusing on the disqualification clause in the 14th Amendment of the U.S. Constitution. A central argument is that his impeachment by Congress unequivocally establishes his ineligibility, as he engaged in insurrection on January 6th, 2021. He conspired with others to have Vice President Pence reject state-certified electors and incited his supporters into rebellion. Under the Constitution, such actions disqualify him from holding public office, mirroring historical precedents where Congress or governors have refused to certify the elections of individuals deemed by them to be insurrectionists. America’s most esteemed presidents, like George Washington and Abraham Lincoln, are celebrated not only for their leadership but for their unwavering integrity and commitment to democratic principles. Washington’s humility and dedication set the foundational values of the nation, while Lincoln’s moral conviction preserved its unity during its most perilous times. In stark contrast, Trump’s conduct—both during his tenure and specifically on January 6th—reveals a profound deficiency in character. His reckless and divisive actions pose a direct threat to the very fabric of democracy. This paper argues that, based on constitutional mandates and the essential qualities required of a president, Trump’s character and actions categorically disqualify him from the presidency, irrespective of policy positions or partisan affiliations.\n\nhttps://www.researchgate.net/publication/384473246_The_Character_and_Eligibility_of_Donald_Trump_A_Critical_Examination/stats", "label": 1}
{"text": "The Character and Eligibility of Donald Trump: A Critical Examination.\n\nThis paper examines Donald Trump’s character and constitutional eligibility to serve as president, focusing on the disqualification clause in the 14th Amendment of the U.S. Constitution. A central argument is that his impeachment by Congress unequivocally establishes his ineligibility, as he engaged in insurrection on January 6th, 2021. He conspired with others to have Vice President Pence reject state-certified electors and incited his supporters into rebellion. Under the Constitution, such actions disqualify him from holding public office, mirroring historical precedents where Congress or governors have refused to certify the elections of individuals deemed by them to be insurrectionists. America’s most esteemed presidents, like George Washington and Abraham Lincoln, are celebrated not only for their leadership but for their unwavering integrity and commitment to democratic principles. Washington’s humility and dedication set the foundational values of the nation, while Lincoln’s moral conviction preserved its unity during its most perilous times. In stark contrast, Trump’s conduct—both during his tenure and specifically on January 6th—reveals a profound deficiency in character. His reckless and divisive actions pose a direct threat to the very fabric of democracy. This paper argues that, based on constitutional mandates and the essential qualities required of a president, Trump’s character and actions categorically disqualify him from the presidency, irrespective of policy positions or partisan affiliations.\n\nhttps://www.researchgate.net/publication/384473246_The_Character_and_Eligibility_of_Donald_Trump_A_Critical_Examination/stats", "label": 1}
{"text": "The Character and Eligibility of Donald Trump: A Critical Examination.\n\nThis paper examines Donald Trump’s character and constitutional eligibility to serve as president, focusing on the disqualification clause in the 14th Amendment of the U.S. Constitution. A central argument is that his impeachment by Congress unequivocally establishes his ineligibility, as he engaged in insurrection on January 6th, 2021. He conspired with others to have Vice President Pence reject state-certified electors and incited his supporters into rebellion. Under the Constitution, such actions disqualify him from holding public office, mirroring historical precedents where Congress or governors have refused to certify the elections of individuals deemed by them to be insurrectionists. America’s most esteemed presidents, like George Washington and Abraham Lincoln, are celebrated not only for their leadership but for their unwavering integrity and commitment to democratic principles. Washington’s humility and dedication set the foundational values of the nation, while Lincoln’s moral conviction preserved its unity during its most perilous times. In stark contrast, Trump’s conduct—both during his tenure and specifically on January 6th—reveals a profound deficiency in character. His reckless and divisive actions pose a direct threat to the very fabric of democracy. This paper argues that, based on constitutional mandates and the essential qualities required of a president, Trump’s character and actions categorically disqualify him from the presidency, irrespective of policy positions or partisan affiliations.\n\nhttps://www.researchgate.net/publication/384473246_The_Character_and_Eligibility_of_Donald_Trump_A_Critical_Examination/stats", "label": 1}
{"text": "Grateful to live in Colorado in moments like this. My biggest decision is which flavor of gummy shall I have?\n\nBLUEberry, I think.", "label": 1}
{"text": "Wow that's so interesting!", "label": 1}
{"text": "The Character and Eligibility of Donald Trump: A Critical Examination.\n\nThis paper examines Donald Trump’s character and constitutional eligibility to serve as president, focusing on the disqualification clause in the 14th Amendment of the U.S. Constitution. A central argument is that his impeachment by Congress unequivocally establishes his ineligibility, as he engaged in insurrection on January 6th, 2021. He conspired with others to have Vice President Pence reject state-certified electors and incited his supporters into rebellion. Under the Constitution, such actions disqualify him from holding public office, mirroring historical precedents where Congress or governors have refused to certify the elections of individuals deemed by them to be insurrectionists. America’s most esteemed presidents, like George Washington and Abraham Lincoln, are celebrated not only for their leadership but for their unwavering integrity and commitment to democratic principles. Washington’s humility and dedication set the foundational values of the nation, while Lincoln’s moral conviction preserved its unity during its most perilous times. In stark contrast, Trump’s conduct—both during his tenure and specifically on January 6th—reveals a profound deficiency in character. His reckless and divisive actions pose a direct threat to the very fabric of democracy. This paper argues that, based on constitutional mandates and the essential qualities required of a president, Trump’s character and actions categorically disqualify him from the presidency, irrespective of policy positions or partisan affiliations.\n\nhttps://www.researchgate.net/publication/384473246_The_Character_and_Eligibility_of_Donald_Trump_A_Critical_Examination/stats", "label": 1}
{"text": "Isaiah 3:12\nAs for My people, children are their oppressors, And women rule over them. O My people! Those who lead you cause you to err, And destroy the way of your paths.”\n\n1 Timothy 2\n11 Let a woman learn in silence with all submission. 12 And I do not permit a woman to teach or to have authority over a man, but to be in silence. 13 For Adam was formed first, then Eve. 14 And Adam was not deceived, but the woman being deceived, fell into transgression.", "label": 1}
{"text": "I mean.......if Harris wins, and presidents have immunity........I hope they do find \"other ways\" to handle it.\n\n/s", "label": 1}
{"text": "The Character and Eligibility of Donald Trump: A Critical Examination.\n\nThis paper examines Donald Trump’s character and constitutional eligibility to serve as president, focusing on the disqualification clause in the 14th Amendment of the U.S. Constitution. A central argument is that his impeachment by Congress unequivocally establishes his ineligibility, as he engaged in insurrection on January 6th, 2021. He conspired with others to have Vice President Pence reject state-certified electors and incited his supporters into rebellion. Under the Constitution, such actions disqualify him from holding public office, mirroring historical precedents where Congress or governors have refused to certify the elections of individuals deemed by them to be insurrectionists. America’s most esteemed presidents, like George Washington and Abraham Lincoln, are celebrated not only for their leadership but for their unwavering integrity and commitment to democratic principles. Washington’s humility and dedication set the foundational values of the nation, while Lincoln’s moral conviction preserved its unity during its most perilous times. In stark contrast, Trump’s conduct—both during his tenure and specifically on January 6th—reveals a profound deficiency in character. His reckless and divisive actions pose a direct threat to the very fabric of democracy. This paper argues that, based on constitutional mandates and the essential qualities required of a president, Trump’s character and actions categorically disqualify him from the presidency, irrespective of policy positions or partisan affiliations.\n\nhttps://www.researchgate.net/publication/384473246_The_Character_and_Eligibility_of_Donald_Trump_A_Critical_Examination/stats", "label": 1}
{"text": "the Russian bots are out today I see", "label": 1}
{"text": "Worked fine for me\n\n\nGreat sub\n\n\nShame it's mirror....not so much", "label": 1}
{"text": "He's not going to loose! Too many people have woken up to reality to see that Kamala Harris is a fraud! Who nobody wanted to be president in 2020 and still nobody wants the woman who fakes her identity to try to obtain the black Americans to vote for her! This Indian, Irish, Syrian Jew woman who perpetrates herself as a black woman will never become president of the United States!!! I think Hillary Clinton had a better chance than Kamala Harris 😂😂😂😂😂 someone who based her whole election off of lies like her trying to say that Donald Trump is going to abolish abortions that's not what was going on what he was doing was taking it out of the federal government's hands and leaving it up to the states to be able to make their own laws!!! On top of that project 2025 sorry Donald Trump has absolutely nothing to do with that it is the heritage foundation and it's funny thing is the same heritage foundation that came out with project 2025 actually endorses Kamala Harris!!!! them saying Donald Trump is a racist Donald Trump has never been a racist never was a racist they only started putting that lie out there when he was going up against Joe Biden and everybody knows Joe Biden is a well-known documented racist!!!! Other countries do not respect Kamala Harris nor will they with her being president if that would remotely even happen but I highly doubt it!!! People need to wake up and realize that the Democrats who started the ku Klux Klan but yet scream about racism and white supremacy they scream about Donald Trump being for all the millionaires but yet aren't all the celebrities endorsing Kamala Harris hmm that looks kind of fishy to me huh???!!!! People need to wake up!!! And I'm not talking about that woke BS talking about oh if I want to be a woman I can be a woman or if I want to be a man I could be a man get the hell out of here!!! If that's what stupid people base their platform on to become president of the United States then I truly feel sorry for this country as a whole!!!! ", "label": 1}
{"text": "Pennsylvania is for Donald Trump!!! ", "label": 1}
{"text": "Found the Russian.", "label": 1}
{"text": "That's not going to happen Pennsylvania is for Donald Trump!!! ", "label": 1}
{"text": "Thank God that's never going to happen!!! ", "label": 1}
{"text": "Stop spreading lies!!!! The reason why the border security Bill did not pass is because there's actually several Democrats who voted against it as well as the fact that they were trying to assign billions of dollars to Ukraine and other countries!! You people really need to get your act together and work on facts don't work on your feelings!!!! ", "label": 1}
{"text": "Nope- not today or tomorrow , Trump lost his campaign is already aware.", "label": 1}
{"text": "Donald Trump is going to win!!!! ", "label": 1}
{"text": "I think his party collectively throws him out to dry.  They will each start to distance themselves from him now that he is of no use.  He is not running in 4 years lets be honest.  And he's getting sentenced at the end of the month.  I see his party realize the maga route is a losing proposition and they rebuild from the ground up without him.", "label": 1}
{"text": "And telling women you'll take care of them after you brag about sexually assaulting them!!! Hail Emperor Oompah Loompah!!", "label": 1}
{"text": "Oh look more misinformation \n\n\nTrump saying he isnt against building more detention camp but doesn't think we will need them as his goal is to deport illegal immigrants does not equate him saying he will use the military to put them in camps \n\n\nSeriously the left cannot criticize Trump honestly for some reason \n\n\nIt's fascinating ", "label": 1}
{"text": "Without Trump I think they lose their power to speak their radical and exclusive views.  I feel they go back into the shadows until the next Trump like figure if ever.", "label": 1}
{"text": "I hear you go again commenting on something else you know absolutely nothing about!!! Stop watching the programming on television pick up a book!!! It may help you!!! Praise Yahuah!!! ", "label": 1}
{"text": "We will see now won't we! Are you going to leave America if Trump becomes president??? ", "label": 1}
{"text": "And go where guy?", "label": 1}
{"text": "Not a cult at all", "label": 1}
{"text": "So Trump didn't say what you claimed, you are just assuming that's what will happen\n\n\nThe irony of you talking about facts", "label": 1}
{"text": "I will hit you up late tomorrow night when the election is over to rub the poo in your nose", "label": 1}
{"text": "This guy’s a Russian", "label": 1}
{"text": "I can only imagine what he's doing now to prepare for his giant tantrum.", "label": 1}
{"text": "I don't know what you mean by losing? He'll win, but he'll be robbed of the election and Cackles will rob the election. I mean, the gov't won't let Trump beat another Democrat woman twice in a row", "label": 1}
{"text": "Only reason kamala harris is vp because of her gender and race! Joe biden needed a color women vp to win the election ", "label": 1}
{"text": "Kamala harris became vp mainly because of her gender and race!! Joe biden pick her to not look racist ", "label": 1}
{"text": "She probably will thank willie brown if she wins", "label": 1}
{"text": "Just like all democrat politicans did when they lost the election... Oops forgot that didnt ya", "label": 1}
{"text": "Just like democrats said the election was stolen when they lost, oops you forgot this fact?", "label": 1}
{"text": "The following courts noted potential issues and concerns regarding the 2020 election process:\n\n* **Michigan Courts**\n* **Arizona Courts**\n\n* **Nevada Courts**\n* **Pennsylvania Courts**\n* **Georgia Courts**\n\nThey did not rule  in favor of trump due to not having enough concrete evidence, but they noted that there are potential issues and concerns in regards to his claims of voter fraud with the ballot. For those that don't understand, this means that trumps concers are VALID, but not proven by all 5 courts. \n\nWhy are progressives the most dishonest people.", "label": 1}
{"text": "Trumps winning this.", "label": 1}
{"text": "The sad thing is that these courts found Trump's concerns about voter fraud VALID but not CONCRETE. Yet you people act like the courts found his concerns INVLAD. So dishonest or lack any critical analysis skills:\n\n* **Michigan Courts**\n* **Arizona Courts**\n* **Nevada Courts**\n* **Pennsylvania Courts**\n* **Georgia Courts**\n\nThose courts...", "label": 1}
{"text": "What models?", "label": 1}
{"text": "Currently a 1/48th scale mig29!", "label": 1}
{"text": "Why are progressives so deluded in a fake reality? Do you not understand trump has massive amount of citizens supporting him, half of the's he nation supports him, thats more than 100million supporters. Yet you say he's fighting for self-preservation... So intellectually dishonest... Understand he has many supporters because he speaks for US, half of the country. You progressives are so lost in your bubbles of liberalism, that you never  interact with half of the other people living in your country. \n\nRepublicans at least talk to progressives, progressives never have open discussions and its why you think these wild crazy untrue claims.", "label": 1}
{"text": "I'm so pissed I have to work tomorrow. I'm so anxious I feel like throwing up and dealing with screaming customers and shit is not gonna help", "label": 1}
{"text": "5 courts favored that his claims of voter fraud is VALID but did not RULE in favor due to lack of concrete evidence. Understand that, they didnt say he had no claims at all, he did have some validity to those claims COURTS RULED! in 5 dif states.", "label": 1}
{"text": "You guys are so intellectually corrupt. Progressives are the most divisive group, you insult us republicans for even liking trump, refuse to have open discussion and simply call our presidant hitler. No logical debating, no critical thinking, no fact checking but simply rich elites that own all mainstream media say JUMP, you say JUMP HOW HIGH! Why not discuss your differences with us.", "label": 1}
{"text": "Half of the country wants to vote for a candidate, and you're wondering why he isnt disqualified? Why not talk to your neighbours and ask why they actually want to vote for him, instead of listening to what mainstream media says and portrays to you about it. 100million people are voting for him, and you progressives refuse to have open discussion about things without personal insults. Where is  the intellectualy honesty here.", "label": 1}
{"text": "in 2020 5 courts  in different states agreed that his claims of voter fraud had SOME validity, but not enough proof to make them rule in favor, meaning that he isnt simply fighting against election because he is unhappy, there are SOME VALIDITY to his claims from what the courts said, simply not enough evidence to rule in favor...", "label": 1}
{"text": "What a horrible thing to say, he is speaking for half of the country. Are you saying half of the country deserves to die in prison? What a horrible and hateful comment, no care, no kindness, no empathy for those different from you... Simply tribalistic hate, instead of hating on race, you hate on political views. What is the difference, hate is  hate. Try talking to some republicans and you'll realize we arent what the mainstream media which is owned by rich elites say about us.", "label": 1}
{"text": "It ssad that you call it Trumpism. Half of the country votes for trump because he's on the side of Freedom Of Speech, Freedom Of People.", "label": 1}
{"text": "You do know your side tried to assassinate him twice.... He was already presidant and didnt opress any of you guys... Yet you are so crazy in your delusion to state that he's the crazy one?? WAKEUP!!!", "label": 1}
{"text": "You guys lack so much critical thinking, it's not TRUMP that is the republican party, it's what TRUMP represents, THE CITIZENS WITHOUT A VOICE! We have no say in the education department, no say in the government as we are the minority, no say in mainstream media because its run and funded by rich democrats, no say even in the street because we get abused by crazy democrats for having a HAT, a hat that simply says who we are voting for... Your side, the democratic fake progressives are the most vile, hateful people that future generations will look back at and side with us republicans. We are simply being opressed by you guys, being bullied and we are fighting back and not accepting it anymore. We wont stop even if you kill him. You are not the rulers of our lives.", "label": 1}
{"text": "Thats not what the courts said, they said his claims had some validity. Do your research.", "label": 1}
{"text": "While many courts did not rule in favor of Trump’s claims of widespread fraud, some did recognize potential irregularities that raised concerns. For instance, courts in Michigan and Arizona acknowledged procedural issues that could warrant further investigation, indicating that there were signs that something could be amiss, even if they didn't find sufficient evidence to overturn the results. This nuance suggests that while the claims were not fully validated, there were enough questions raised to merit concern.\n\nFor example, in Michigan, a judge pointed out procedural irregularities, and in Arizona, the court noted issues with the election process that deserved attention. This doesn't mean the accusations were baseless, but rather that the evidence presented was not enough to prove widespread fraud.\n\nIt's crucial to engage with these discussions respectfully and focus on facts from credible sources. For more detailed insights, you can refer to articles from sources like [NPR]() and [Politico]().\"", "label": 1}
{"text": "While many courts did not rule in favor of Trump’s claims of widespread fraud, some did recognize potential irregularities that raised concerns. For instance, courts in Michigan and Arizona acknowledged procedural issues that could warrant further investigation, indicating that there were signs that something could be amiss, even if they didn't find sufficient evidence to overturn the results. This nuance suggests that while the claims were not fully validated, there were enough questions raised to merit concern.\n\nFor example, in Michigan, a judge pointed out procedural irregularities, and in Arizona, the court noted issues with the election process that deserved attention. This doesn't mean the accusations were baseless, but rather that the evidence presented was not enough to prove widespread fraud.\n\nIt's crucial to engage with these discussions respectfully and focus on facts from credible sources. For more detailed insights, you can refer to articles from sources like [NPR]() and [Politico]().", "label": 1}
{"text": "😂😂😂", "label": 1}
{"text": "Political views aren’t something you’re born into you absolute moron.", "label": 1}
{"text": "Kamala harris doing hard work on her back while willie brown on top of her!!", "label": 1}
{"text": "Trump did not lose in 2020.  The democrats cheated in 2020 and 2022 Arizona.  Democrats are already cheating again.  This will not end well for democrats.", "label": 1}
{"text": "What book would you recommend?  Cause I've got [this one](https://www.govinfo.gov/content/pkg/GPO-J6-REPORT/pdf/GPO-J6-REPORT.pdf) and it appears to reflect very poorly on Trump and his actions leading up to January 6th.", "label": 1}
{"text": "Because trumps margins were too big to rig by october. Even the polllsters couldnt keep it up. The only reason why its 50/50 is because they are still trying to give harris a fighting chance.  Its not 50-50. Not even close lol. If you didnt live in a deluded bubble you would know that. \n\nNevermind. You'll know in a few hours anyway. Lol. Imagine thinking its a 50 50 race.", "label": 1}
{"text": "This", "label": 1}
{"text": "I'm sure it will go back to a boring Mitt Romney good ol' boy conservatism like you Liz Chemey liberals miss dearly.", "label": 1}
{"text": "My source is that I made it the fuck up", "label": 1}
{"text": "fake right wing polling and other propaganda", "label": 1}
{"text": "Good. That means no more billions and billions of dollars going to the comedian Zelensky lol", "label": 1}
{"text": "Nothing will come back stronger next time with Robert Kennedy Jr and Tulsi gabbard", "label": 1}
{"text": "He is losing - \n\n\nHim and his followers will be tried for treason and executed. \n\n\nCan't have a Nazi living this long. ", "label": 1}
{"text": "I just spoke to Democrats who said the same shit. And realistically think Kamala is sweeping all 50 states and that's the only true victory. You people and your anecdotes are tiring.", "label": 1}
{"text": "Lol what? Importing immigrants into swing states?\n\nYes. There's a form people fill in at the border asking them if they are willing to move to Arizona, Pennsylvania or North Carolina so that Democrats can get their votes.\n\nThen they are all put on buses and sent to their assigned locations in order to ensure Republicans can't win.\n\nAfter that as a reward, they each get trans surgery. And a lollipop. \n\nDo you hear yourself?", "label": 1}
{"text": "If we went your way, slavery would still be alive and well in North America. That is such a stupid take.", "label": 1}
{"text": "As long as everyone is cool with California making all the decisions for the entire country then yes we can do away with the electoral system.", "label": 1}
{"text": "I can't wait until the end of Trump's second term, when we are all voting on the next President, and people on this sub will have convenient amnesia about saying \"democracy is over.\"", "label": 1}
{"text": "You're just babbling nonsense now.\n\nSince you made me do it, I looked it up.\n\nHuman longevity will decrease both directly and indirectly, due to climate change. In fact, the rise in temps that has already occurred will decrease longevity by more than half a year. It's that well studied.\n\nI find zero sources that support your nonsense--coincidentally the same amount of sources you've managed to provide.", "label": 1}
{"text": "> Its irrelevant anyways.\n\nIt's pretty relevant when even your correction is ludicrous on its face.\n\nIt means you're not serious and your arguments aren't, either.", "label": 1}
{"text": "[https://cis.org/Bensman/Government-Admission-Biden-Parole-Flights-Create-Security-Vulnerabilities-US-Airports](https://cis.org/Bensman/Government-Admission-Biden-Parole-Flights-Create-Security-Vulnerabilities-US-Airports)\n\n**\"The Biden administration’s legally dubious program to fly inadmissible aliens over the border and directly to U.S. airports has allegedly created law enforcement vulnerabilities too grave to release publicly.\"**", "label": 1}
{"text": "honestly its kinda rich coming from the party that the candidate was installed and no one voted for", "label": 1}
{"text": "I dedicate my vote against Kamala to you for being so judgy and moral superior complex", "label": 1}
{"text": "If thet aren't citizens they don't vote.\n\nHow is that hard to understand?", "label": 1}
{"text": "So you would blindly walk into fascism just because of the law and possible future implications? Thanks, your opinion is thrown immediately into the trash", "label": 1}
{"text": "They're passing laws so you don't have to show ID to vote in many states. \n\nAmerica is actually quite the anomaly, we have inconsistent voter ID laws. \n\nBut yeah, just so you can see California is lost:\n\n[https://perkinscoie.com/insights/update/new-california-law-prohibits-localities-imposing-their-own-voter-id-requirements](https://perkinscoie.com/insights/update/new-california-law-prohibits-localities-imposing-their-own-voter-id-requirements)\n\n\"California Governor Gavin Newsom signed [Senate Bill 1174](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB1174) into law on September 29, 2024. SB 1174 prohibits local governments from requiring voters to present identification when casting their ballots at the polls. \"\n\n[https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill\\_id=202320240SB1174](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB1174)", "label": 1}
{"text": "Ah. Stated in the rules. What a beautiful world we live in eh? Lol. I wish i had a heart as pure as yours. Big boys sold a long time before covid was announced to public. They always know. We are always the last to get the news. The key is to follow the money and the big boys. Maybe we might get some scraps. \n\nCrypto and stocks are pumping like crazy already.if harris was winning, they would go down.  Gambling odds are widening. Trump almost at 70% now. \n\nInsiders already know and they've already made their bets. You'll see. In a few hours. Just dont be so shocked. Reddit is a propaganda bubble. The moderators remove my post as long as you post anything positive about the other side. Its really dystopian.", "label": 1}
{"text": "Jesus. You're a full on conspiracy nut!\n\nThe Heritage Foundation. The most conservative of organizations, has studied voter fraud extensively. And found statistically insignificant amounts, going back to the 1980s. Like maybe 20 a year.\n\nIt's a non issue. You pretending it's happening or going to happen is ridiculous. There are so many points at which it gets caught. From registration, to casting the ballot to counting.\n\nIt's not a thing.\n\nPretending it is, is just the latest right wing boogy man.", "label": 1}
{"text": "Love how you ignored the fact it's now illegal to ask for voter ID in California.", "label": 1}
{"text": "I'm an immigrant. In California. I know exactly how it works here.\n\nI, as a non citizen, could go to cast a provisional ballot. As I would not be a verified registered voter, when they checked that provisional ballot, that would show and my vote wound not count.\n\nIt's really that simple.\n\nPretending it's not is ridiculous.", "label": 1}
{"text": "What crimes has musk committed outside of disagreeing with your politics? Sorry am I allowed to even speak out from the looks of this sub it's a liberal echo chamber hive mind ", "label": 1}
{"text": "why are you so obsessed with a two party system? the entire world knows and understands how close that is to dictatorship. hi Europe and you're efficient political systems \n\nthe way you speak of this, is too stupid to respond to or analyze fully. \n\nrooted in philosophies and values? my brother in christ there wouldn't be two sides if they had ethics and values", "label": 1}
{"text": "Correct. Had he even been on the ballot in the south, which he wasn't, the calculus of the white vote in the south might have shifted to \"the best chance to beat Lincoln\" instead of the fractured vote they had.\n\nCritical thinking is not something you often engage in, is it?", "label": 1}
{"text": "Strawman. That was not the argument and you know it. Again, you lack the ability to think critically. Seems to be a consistent issue with lefties.", "label": 1}
{"text": "you dems would be screwed without Cali and New York. if the electoral college voted based on how the population voted in those states, you'd never have another democrat president. 51% could vote dem in cali and get all 55 votes when that's not even close to representing how the population feels or votes. It wont matter though. the country has had enough of you morons. TRUMP 2024.", "label": 1}
{"text": "I would insult you but you are a protected class", "label": 1}
{"text": "That's what fascists do: it's just a joke bro! Sometimes you just can't discuss shit like this with them because they're fucking slimy as shit and will fucking wiggle out of any kind of responsibility. Yes, it's okay to punch a neo-Nazi.", "label": 1}
{"text": "Blah blah blah... What part of Biden/ Harris don't you understand? You only care because you wanted Biden to be Orange Fatty's opponent, so save your faux outrage. You didn't vote for J.D Vance, but if trump was in office and died or dropped out, Vance would take his place. Would you screech about that?", "label": 1}
{"text": "He wont do anything to hurt democracy, those are lies by the extreme left communists in the democratic party! The true threat to American democracy.\n\nTrump is for the people!\n\n  \nOn December 21, 2018, President Trump signed into law the First Step Act (FSA) of 2018 (P.L. 115- 391). The act was the culmination of a bi-partisan effort to improve criminal justice outcomes, as well as to reduce the size of the federal prison population while also creating mechanisms to maintain public safety.  \n  \nOf the nearly 30,000 people released under the First Step Act, only 12.4% have been re-arrested or returned to federal custody. This is far lower than the general federal recidivism rate of 43%. Below are descriptions of the First Step Act's sentencing and prison reforms, why they matter, and who they benefitted.  \n  \nAccording to data from the Sentencing Project, a significant portion of individuals released under the First Step Act were Black men, with reports stating that roughly two-thirds of those benefiting from the Act were people of color, indicating a substantial impact on the Black community", "label": 1}
{"text": "I have no problem with people earning their citizenship.  I would have an issue with a one party country.  \n\nI know citizens can vote for whoever they want, i never said otherwise.  I never said someone will make them vote a certain way.  \n\nIf you want to reply to what I said, first read what I said.", "label": 1}
{"text": "Hopefully it is people using common sense.\n\nTrump is for the people!\n\n  \nOn December 21, 2018, President Trump signed into law the First Step Act (FSA) of 2018 (P.L. 115- 391). The act was the culmination of a bi-partisan effort to improve criminal justice outcomes, as well as to reduce the size of the federal prison population while also creating mechanisms to maintain public safety.  \n  \nOf the nearly 30,000 people released under the First Step Act, only 12.4% have been re-arrested or returned to federal custody. This is far lower than the general federal recidivism rate of 43%. Below are descriptions of the First Step Act's sentencing and prison reforms, why they matter, and who they benefitted.  \n  \nAccording to data from the Sentencing Project, a significant portion of individuals released under the First Step Act were Black men, with reports stating that roughly two-thirds of those benefiting from the Act were people of color, indicating a substantial impact on the Black community", "label": 1}
{"text": "You speak lies. Here is some factual reading material for you. John Quincy Adams and Andrew Jackson to name a few historical facts, about court blocking. \n[Senate History, Seat Stealing](https://www.smithsonianmag.com/history/history-stolen-supreme-court-seats-180962589/)\n\nBeing that I’m supporting my claim with facts. What do you have to refute you biased misinformation?", "label": 1}
{"text": "Sir, this is Wendy's.", "label": 1}
{"text": "You are not smart enough to understand.", "label": 1}
{"text": "Don’t bother trying to explain anything to these failures. ", "label": 1}
{"text": "The ones who have been abusing their States of Emergency have, by and large, been the Democrats.", "label": 1}
{"text": "If this is the last night of our democracy I take solace that I have two children. Which means I had sex at least 2 different times.", "label": 1}
{"text": "Voted Jill Stein almost immediately she has a big chance to win this", "label": 1}
{"text": "No matter what happens, I predict that reddit will undergo a massive, life-threatening sodium overdose over the next week.", "label": 1}
{"text": "The meltdown the losing side has will be one for the ages I agree", "label": 1}
{"text": "r/irony", "label": 1}
{"text": "My vote should count twice because I'm so intellectually superior ", "label": 1}
{"text": "I've followed every election since 1776.  History is important ", "label": 1}
{"text": "Mom?", "label": 1}
{"text": "I've heard there's been massive voter fraud as a result of cyborgs from the future", "label": 1}
{"text": "LET'S FUCKING POKEMON GO TO THE POLLS\n\nEVERYBODY IN HERE WE'RE GOING COUNTING", "label": 1}
{"text": "I heard it was Daleks.", "label": 1}
{"text": "Anyone else drinking heavily yet?", "label": 1}
{"text": "I think Mondale is gonna take it this year \\*finally\\*", "label": 1}
{"text": "Erin Burnett lookin too sleepy this early in the evening", "label": 1}
{"text": "Can't wait for all of this to be over and it was all just a big prank and the house of representatives break into a festive choreographed dance while Trump and Kamala take turns being the lead singer as they dance around each other displaying joyful and platonic mannerisms.", "label": 1}
{"text": "I exercised my civic booty", "label": 1}
{"text": "I predict that either a Democrat or Republican candidate will win ", "label": 1}
{"text": "Let’s Pokémon GO to the polls!", "label": 1}
{"text": "Jill Stein is surging I'm hoping her path to the White House is clear", "label": 1}
{"text": "My wife promised to make love to me tonight if Kamala wins so I’m getting fucked one way or another.", "label": 1}
{"text": "Get out and Vote Palpatine!", "label": 1}
{"text": "I fucked up my ballot. Rfk was on mine and I had filled in the wrong ballot so I had to ask for a new one I'm so dumb", "label": 1}
{"text": "No blue, no matter who!", "label": 1}
{"text": "Lol. How are you guys still even shocked? Here comes the pikachu face lol. Unbelievable, literally everyone knows that Trump will wipe the floor except propaganda reddit.", "label": 1}
{"text": "Can't wait to see all those 26 year old white liberals who hated Joe Manchin see what Jim Justice does lmao.", "label": 1}
{"text": "i picked the wrong day to quit drinking", "label": 1}
{"text": "Picked a great day to start drinking.", "label": 1}
{"text": "I have a bottle of jameson and both my dogs on the couch with me. What are your plans for the evening?", "label": 1}
{"text": "It's over.  Get ready for four years of Trump.  The sooner you accept reality, the better off you'll be.", "label": 1}
{"text": "What's Happening?!!!!", "label": 1}
{"text": "Why are people downvoting me for voting for jill stien? And asking how shes doing? This is political discussion and I want to know?", "label": 1}
{"text": "It’s because Jill stein is a known Russian asset who’s only running to be a spoiler for Harris to help Trump win", "label": 1}
{"text": "This sub hates 3rd party candidates because it takes away from votes they think their candidate is entitled to.", "label": 1}
{"text": "That was a Kamala-level non-answer.", "label": 1}
{"text": "because you are doing russia's work. Go say hi to daddy putin", "label": 1}
{"text": "You said you voted for her in PA and wanted to know how she is doing.  \n  \nI responded and told you that I had heard that she got 1 vote in PA.  You're up to date!", "label": 1}
{"text": "> 199.0k Comment Karma\n\nMakes sense", "label": 1}
{"text": "Thank you, been working on it for years", "label": 1}
{"text": "So far she has .4% of the popular vote. \n\nBut you could’ve googled it just like it did.", "label": 1}
{"text": "jill stein is a fraud", "label": 1}
{"text": "He literally said he wants to jail his political opponents. Sounds pretty fascist to me.", "label": 1}
{"text": "Open border, move migrants to swings. They’re already doing it", "label": 1}
{"text": "George Floyd was a felon.", "label": 1}
{"text": "Who's the chick on CNN? She's really fine.", "label": 1}
{"text": "Yall are some seriously delusional individuals.  You really can’t fathom that someone has a differing opinion than you.  Right, wrong, or indifferent.  Just as you can’t change someone’s mind, no one can change yours nor do we want to.  We really want everyone to just live a happy successful life. ✌🏼❤️.   Social media is absolute evil.", "label": 1}
{"text": "Could people be tired of Tik Tok/cancel/woke/trans culture and would like to go back to simpler times????\n\nWill the silent majority elect Trump VS the loud medias/artists/democrats????", "label": 1}
{"text": "Democracy is a joke.", "label": 1}
{"text": "Flibberdy flee. Flabberdy floo.", "label": 1}
{"text": "She’s losing, how do you feel about that?", "label": 1}
{"text": "Is it Joever?", "label": 1}
{"text": "all other accounts and percentages would beg to differ", "label": 1}
{"text": "UPDATE: 67% CHANCE OF TRUMP WINNING VIA NYT", "label": 1}
{"text": "UPDATE: NYT NEEDLE SHOWING 68% CHANCE OF TRUMP WINNING THE ELECTION\n\nLETS GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "label": 1}
{"text": "You people deserve trump for comments like this.", "label": 1}
{"text": "Such nice confirmation that americans love genocide", "label": 1}
{"text": "UPDATE: NYT NEEDLE SHOWING 69% CHANCE OF TRUMP WINNING THE ELECTION\n\nLETS GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "label": 1}
{"text": "Just rename this thread to leftist crying about Trump.. but then again what else is new? thats all of reddit.", "label": 1}
{"text": "UPDATE: NYT NEEDLE SHOWING 70% CHANCE OF TRUMP WINNING THE ELECTION\n\nLETS GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "label": 1}
{"text": "And you’re crying about leftists. What’s the difference you moron", "label": 1}
{"text": "I swear redditors are low key autistic.\n\nMost of NC is rural and country as fuck. There are confederate flags the moment you leave Charlotte. You cannot be this brain dead.", "label": 1}
{"text": "Here’s how Bernie can still win", "label": 1}
{"text": "Remember folks, reddit is not real life", "label": 1}
{"text": "Please do not submit low investment content. This subreddit is for genuine discussion: Memes, links substituting for explanation, sarcasm, political name-calling, and other non-substantive contributions will be removed per moderator discretion.", "label": 1}
{"text": "UPDATE: NYT NEEDLE SHOWING 73% CHANCE OF TRUMP WINNING THE ELECTION\n\nLETS GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO", "label": 1}
{"text": "Good economy? Yea.. youre definitely a democrat. With an IQ that reaches the floor.\n\n\nAnyway, I guess the made up boogeyman destroys democracy in some made up way in your made up world. Just let everyone else try to recover from the destruction you and your people left", "label": 1}
{"text": "I‘m a 20 year long independent, voted blue 2020 and 2024. I‘m not happy if the trajectory stays like this, but the absolute collective meltdown Reddit would have does give me some joy ngl.", "label": 1}
{"text": "I genuinely don't know how you can say this at any point any time other than the last 1-1.5 hours.", "label": 1}
{"text": "Ideology aside, it's professional-class types who've the most glaring hubris, while the Democratic Party is at its strongest when it's stabilized by a multi-ethnic working-class base. And, suffice to say, they've lost their way in that respect, focusing too much on niche cultural shit and Reaganite macroeconomics rather than people's day-to-day, bread-and-butter, meat-and-potato, kitchen table microeconomic concerns. From groceries to housing to wages, Democrats need to ditch the bourgeois bullshit and put in the fucking word to stem bleeding among minorities, young men, et al.; these people are the backbone of society and should thus be treated with a modicum of fucking respect going forward.", "label": 1}
{"text": "The upvote/downvote system naturally leads to an echo chamber.", "label": 1}
{"text": "Reddit is always smug, though.", "label": 1}
{"text": "I am. This is fucking scary.", "label": 1}
{"text": "Uh oh reddits gonna have a meltdown soon. All the shitty pictures and clickbait headlines of President Trump and fluff pieces for Kamala didn’t work. USA has chosen to reject you. The matrix lost.", "label": 1}
{"text": "Sure, whatever, but how does Trump help those people? I really just don’t get it.", "label": 1}
{"text": "Yup Harris sucks.", "label": 1}
{"text": "Absolutely. Can't believe Kamala thought she'd win. Trump was always the correct choice.", "label": 1}
{"text": "Virginia was great actually.", "label": 1}
{"text": "We're doing it. Make america great again man. Trump stands for freedom and good morals that are realistic and not catered to the mentally unwell.", "label": 1}
{"text": "Maybe stop being so corrupt?", "label": 1}
{"text": "If you think a president can make changes that affect the rest of your life in a matter of 4 short years, you need to take some medication or something and get off the internet", "label": 1}
{"text": "I mean you dumbasses have constantly been wrong tonight whereas prediction markets have been right.\n\nSo okay, keep laughing I guess??", "label": 1}
{"text": "Yea it's going to be so awesome. Can't contain my excitement and pride for Trump.", "label": 1}
{"text": "Keep Kamala and lose the electionala.", "label": 1}
{"text": "You forgot you won't be able to kill your kids anymore :D, that too", "label": 1}
{"text": "He’s the reason women are dying from not being able to get medical care during pregnancy. Get your head out of your ass. ", "label": 1}
{"text": "I know right? It's like they know they belong in the kitchen or something. Can't believe it.", "label": 1}
{"text": "Kamalama ding dong.", "label": 1}
{"text": "Go where? Shut up.", "label": 1}
{"text": "Name one thing Ukraine has ever done for me.\n\nIsn't that what you say? \"Voting against your own interests\"? Ukraine has zero interest for me.", "label": 1}
{"text": "Hey guys keep believing in Kamala!", "label": 1}
{"text": "Shamalama bing bong.", "label": 1}
{"text": "Kamala?", "label": 1}
{"text": "White dominance!", "label": 1}
{"text": "Let's gooooooooo!", "label": 1}
{"text": "Hey guys don't give up hope in Kamala!", "label": 1}
{"text": "How's that bet looking for ya?\n\nI know you didn't have the balls to make it. Good thing you talk a big game behind a keyboard. \n\nSadly this election is gonna end up being a painful lesson that you really don't know what the fuck you're talking about and when the party listens to people like you, we lose.", "label": 1}
{"text": "Aww don't be sad.", "label": 1}
{"text": "Did you not read it?", "label": 1}
{"text": "not underestimated, undermined.", "label": 1}
{"text": "Well, obviously the majority of Americans are black and Latino Nazis. I think that's become clear now.", "label": 1}
{"text": "Decision desk call Georgia for Blompf", "label": 1}
{"text": "Welcome to you too!", "label": 1}
{"text": "I'm actually an AI bot from the Trump campaign. We don't care about healthcare or any of that gay stuff. All we care about is Nvidia and the wealthy.", "label": 1}
{"text": "\\>Women being randomly attacked in the streets\n\nBy who", "label": 1}
{"text": "Watching Trump pass 80% on the NY Time projection made me pop a rod so hard I went blind for about five minutes.", "label": 1}
{"text": "Trump is going to cut all government programs. I can't wait. I'm getting so aroused right now.", "label": 1}
{"text": "we're not letting you guys cheat this time tho", "label": 1}
{"text": "Never stop believing in love.", "label": 1}
{"text": "You got a boner too?\n\nBro we're boner brothers. Let's grab each other's boners and unite!", "label": 1}
{"text": "Hey guys don't lose hope in Kamala. Keep Kamala and thinking positivelyala!", "label": 1}
{"text": "Feminists: This is on you.  If you keep demonizing men, men don't stick around on your side.  \n\nBears don't vote.", "label": 1}
{"text": "And what did I say DIRECTLY AFTER THAT DENSE MF.", "label": 1}
{"text": "Yes! Keep blaming each other!", "label": 1}
{"text": "You got this. I believe in you!", "label": 1}
{"text": "So we can look forward to ethnic cleansing and trampled rights for decades", "label": 1}
{"text": "It's not the educated who vote left, it's the entitled.", "label": 1}
{"text": "Lmfao wtf is this sub right now.", "label": 1}
{"text": "Or maybe stop being so corrupt?", "label": 1}
{"text": "Holy shit and you think Trump isn't going to make it worse?  You deserve Trump lmao.  Thank you for that.", "label": 1}
{"text": "nah Kamala won't win so don't worry mate", "label": 1}
{"text": "I know right?\n\nEven though you guys are a corrupt bunch of sore losers. We will still gladly take your tax revenue!", "label": 1}
{"text": "Five dollar. Five dollar. Five dollar footlongggg", "label": 1}
{"text": "at least i will be settled in the vindication that we are not in fact making america great again, we are perhaps going to make it far far worse, and frankly thats hilarious. fuckin idiots lol", "label": 1}
{"text": "They thought they could hide the corruption.", "label": 1}
{"text": "\\>we are not making america great again  \nCorrect, YOU're not, WE are.", "label": 1}
{"text": "Oh (they) were busy controlling the media.", "label": 1}
{"text": "No joke, I meant landslide for Dotard Blompf.", "label": 1}
{"text": "You very obviously did not LOL. [Receipts pal.](https://www.reddit.com/r/PoliticalDiscussion/s/cUNcOdIuIw)", "label": 1}
{"text": "It's not possible that Selzer was wrong. \n\nI was told by thousands of leftist redditors that she was the gold standard. \n\nThey were confident. Convincing. And slammed anybody who wasn't.\n\nI believed them. \n\nHELP ME.\n\nHOW COULD WE BE SO WRONG ABOUT THE AMERICAN PEOPLE. \n\nAGAIN. \n\n:((((((((", "label": 1}
{"text": "i want to kill ksyelf right now i hate this", "label": 1}
{"text": "reddit having an absolute meltdown", "label": 1}
{"text": "Kamla was delayed by a bland white man. Biden should have stepped down much earlier and given kamla the space. She didn't have a level playing field", "label": 1}
{"text": "Maybe Obama if he could run again", "label": 1}
{"text": "Good to see trump-haters crying in the comments. MAGA.", "label": 1}
{"text": "Do you guys feel dumb now? Hope this sub is humbled", "label": 1}
{"text": "Consider the trump win an opportunity for this sub to embrace humility.", "label": 1}
{"text": "Good, mexican here, nobody likes kamala.", "label": 1}
{"text": "NYT says 89% Blompf", "label": 1}
{"text": "Sometimes when you lose a right, someone else wins another.  \nIn Mexico, we have a saying, \"El respeto al derecho ajeno es la paz\" which can represent many things, one of which being that your rights end the moment someone else's begin.\n\nThink about it.", "label": 1}
{"text": "\\>a black woman  \nis she now", "label": 1}
{"text": "that's already the best case scenario", "label": 1}
{"text": "A successful assassination attempt perhaps?", "label": 1}
{"text": "Put this person on a list", "label": 1}
{"text": "a last favor for his minecraft buddy", "label": 1}
{"text": "Basically this. Except the fundamental problem with the guy is the finance capital behind him. If he disappeared then you have JD Vance as president, who is essentially a live action puppet of Peter Thiel and that crowd of people. I'm not opposed to it but the problem is much bigger than one person, it's a figurehead in front of a figurehead with the real danger and strategy behind both of them.", "label": 1}
{"text": "Let the democratic meltdown commence.", "label": 1}
{"text": "Tough to see him losing.", "label": 1}
{"text": "so good to see woke tears XD", "label": 1}
{"text": "i went to university and graduated as a software engineer, worked hard for it too, while they basically gifted degrees to women and minorities.\n\nWouldn't call them educated, specially now that i gotta work with them.\n\nAnd this is Mexico, btw, can't imagine how bad is it in the states.", "label": 1}
{"text": "I have a sneaking suspicion that you are one of those people who thinks they are a lot smarter than they actually are. ", "label": 1}
{"text": "Another possible Trump assassination attempt", "label": 1}
{"text": "then we have 8 years of vance hell yeah", "label": 1}
{"text": "\\>stop making outrageous and baseless claims that have no merit to anything at all\n\ni know rite, like saying you're black now or that you can change your gender", "label": 1}
{"text": "Fine, congratulations.  Do the same thing over and over again, and keep losing.  Keep running rightward as the fascists take over your country, and the Democrats become fascist-lite.  That is literally what your suggesting.  So..... Good luck.  \n\nLiteral insanity.", "label": 1}
{"text": "i wanna vomit every time i refresh ny times", "label": 1}
{"text": "i think you're at the wrong rall- i mean, party", "label": 1}
{"text": "Small brain populations that would rather vote party for a orange convicted felon than someone that isnt in their party.", "label": 1}
{"text": "They won’t be here if we can actually kick them out and stop them from coming. It’s not inevitable that we can’t control the border. We literally can stop non legal, uh, aliens from coming here.\n\nI had to put the word non legal in there because the mods automatically delete anything using the word illegal followed by the word alien.", "label": 1}
{"text": "Pretty much this whole sub has been wrong for the past few months. The only way to get intelligent insights has been to sort by controversial. So much false confidence and ignorance in top comments", "label": 1}
{"text": "you live in a bubble and likely spend your time in echo chambers, that is why you are so surprised by this.", "label": 1}
{"text": "Maybe that's her plan so they can cheat in peace like last time", "label": 1}
{"text": "yeah no, people like you who keeps insulting otheres and putting democrates down, let me collect some of your tears for my daily tea", "label": 1}
{"text": "The meltdowns are glorious. Keep going", "label": 1}
{"text": "> I am so sick\n\nGreat!", "label": 1}
{"text": "The tears are delicious in this thread.. I appreciate everyone’s honesty… please don’t stop", "label": 1}
{"text": "would you like to drink with me? I got an extra cup and collecting the tears", "label": 1}
{"text": "We are truly in the dumbest of times. The intelligent will forever be tormented by the ignorant.", "label": 1}
{"text": "Do you know how to count?", "label": 1}
{"text": "You have a lot of females to blame for that.", "label": 1}
{"text": "This Sub should change to r/EchoChamber", "label": 1}
{"text": "Lots of tear drops here\n\nlemme put my teacup out to collect\n\nthank you all for my daily tea", "label": 1}
{"text": "Anyone who wants a beer with a convicted felon and rapist really shows what kind of person that they are", "label": 1}
{"text": "Maybe Harris can give Trump the old Willy Brown special and secure herself a cabinet post", "label": 1}
{"text": "Jfc my argument was all about dehumanization, and then you literally compare us to dogs. Straight up dehumanizing bigotry. Are you so fucking dense that you can't even see that that kind of language is insulting and turning men away from the left? \n\nI'm a human, not a fucking pitbull.", "label": 1}
{"text": "Look democrats are a dangerous freak show. Forced vaccines, open borders, end of free speech, fakes news, no one can afford food or a house. No thanks.", "label": 1}
{"text": "Are u on drugs?", "label": 1}
{"text": "Lmaooo reddit is coping so hard", "label": 1}
{"text": "Harris fans throwing their toys out of the cot of course", "label": 1}
{"text": "The absolute meltdown in this thread is exactly what I needed.", "label": 1}
{"text": "What I've learned from this is that you can insult latinx people in the worst ways possible and they'll be ok with it", "label": 1}
{"text": "Apparently it’s okay to rile people up to the point of storming government buildings now", "label": 1}
{"text": "This is amazing. The world needs this chaos. Im all in on the downfall of humanity.\n\nLFG!", "label": 1}
{"text": "What color is your hair?", "label": 1}
{"text": "Gonna cry?", "label": 1}
{"text": "Have you guys noticed this sub is very pro democrat? I guess you guys just like to spend too much time on the internet while the working class is out there doing their shit and getting by. ", "label": 1}
{"text": "White supremacy reigns. When white people eradicate white supremacy we all will be free.", "label": 1}
{"text": "Let’s remind the dems that they were sore losers in 2016", "label": 1}
{"text": "Looks like you got your wish.", "label": 1}
{"text": "Soooo this thread is majority dems. Ok.", "label": 1}
{"text": "As a non American you know nothing about the average American. So please stfu and keep your nose out of our politics", "label": 1}
{"text": "r/TwoXChromosomes is literally crumbling right now.", "label": 1}
{"text": "What I gather from this thread is Dems still don't learn? Why do you hate straight white men? ", "label": 1}
{"text": "Cause they’re evil. I am a straight white male.", "label": 1}
{"text": "White supremacy reigns. When white people eradicate white supremacy we all will be free.", "label": 1}
{"text": "Fuck Joe Biden for not being a one term president like he said he would. Fuck the DNC for being corporate slaves who refuse to try to win. ", "label": 1}
{"text": "Oh look MSNBC cares more about the people living in other countries than they do America", "label": 1}
{"text": "Trump is gonna make this country even more of a shithole lol the US deserves it tbh", "label": 1}
{"text": "If you hate everyone else in the country that much just leave. Dems republicans say that every cycle and 99% of the time they’re full of shit and the least productive people in country. Just fuck off then", "label": 1}
{"text": "She should consider fucking off out of politics. Arguably all social media too.", "label": 1}
{"text": "Oh nooooo we might not be able to trans the inmates :(", "label": 1}
{"text": "God damn it! The military and intelligence services are going to be pull a coup after this!\n\n  \nAt this point, we don't deserve democracy.", "label": 1}
{"text": "Lol cope dems cope", "label": 1}
{"text": "I'm not really melting down.\n\nJust honestly impressed you're dumb enough to think you'll end up benefiting from this lol.", "label": 1}
{"text": "To be fair, they won because liberals don't understand why the reaction was so strong + a weak candidacy.", "label": 1}
{"text": "> Insane amounts of money we dont have to fund wars\n\nYou’re repeating a bullshit talking point in claiming that we just cut checks to Ukraine. The vast vast majority of that $66 billion is in **equipment** that was paid for well before Joe Biden was president. Trump too. The ukriane war adds nothing to our national debt. \n\n> Regardless, ive always thought foreign goods should be severely taxed to incentivize american manufacturing.\n\nYou ignorantly think American manufacturing *can* replace foreign manufacturing. That’s profoundly uninformed. \n\n> Short term hard inflation of goods for a long term benefit\n\nAnd how long is “short term,” genius?", "label": 1}
{"text": "You “people” ruin everything you touch.", "label": 1}
{"text": "lol the conservatives also don't understand that trying to humiliate the libs by using this wording is just wasted effort.  No one cares about this invisible humiliation you're pointing to.  They care about the effects of governance.", "label": 1}
{"text": "Who said he was a Trump supporter? That’s the other problem with dems, instead of asking questions, you just assume things about people. Original commenter could be a libertarian, centrist, etc. But instead of asking things, you’d rather berate the guy. I’m honestly here for the meltdowns as well. I hate Trump. I hate Kamala. But like I said, dems pushed those who were in the middle away by simply being arrogant.", "label": 1}
{"text": "Wow it's so fun here after looking leftist meltdown.", "label": 1}
{"text": "Here for the lib meltdown", "label": 1}
{"text": "Meltdown, nah, just disappointed as usual with the uneducated American citizen in an age of easy access to all the information in history. And the stupidity of people who come to post childish comments like this.", "label": 1}
{"text": "I'm just here for some copium", "label": 1}
{"text": "If any of these old government dogs and crazy orange farts can run for office…then dammit! So can I!!", "label": 1}
{"text": "[It was joever before it even joegan](https://x.com/EricAbbenante/status/1854056504044744735)", "label": 1}
{"text": "You are very dramatic.", "label": 1}
{"text": "The people yearn for social security and medicare to be destroyed and for tariffs,  and for rfk jr to outlaw flouride and pasteurization", "label": 1}
{"text": "LOL my comment on Trump got hidden. I guess they don't want people to get triggered and upset. This is just creating a generation of snowflakes.", "label": 1}
{"text": "Because she is an idiot that hasn't done anything and can't articulate what she'd do in the future. Sad!", "label": 1}
{"text": "While you covered two Is, inflation and immigration, you forgot the most important one.  Fucking ignorance.", "label": 1}
{"text": "AINT NO DOUBT I LOVE THIS LAND! GOD BLESS THE USA", "label": 1}
{"text": "For fuck sake Reddit, can you at least try to not be so biased, stop hiding and covering up literally any post being critical of democrats.", "label": 1}
{"text": "Censorship is a big reason why people voted against dems", "label": 1}
{"text": "Yeeeaaaahhhh trump won!!!! \nCheap gas, groceries, no income tax, extra money for having kids lower intrest rates annnnddd tax credits on car payments. \n\n\nFuck the democrats the real facists and the crazies who run reddit. Ur all irrelevant. Crazy that ud actually vote for kamala. ", "label": 1}
{"text": "Trump won! I know damm well them liberals are real quite", "label": 1}
{"text": "Looking forward to the next 4 years of salt mining.", "label": 1}
{"text": "It's a sad day....\nUSA elected a predictable unreliable Hobo for President. A disgrace off the United States. It will take a very long time before America get's great again.", "label": 1}
{"text": "Waaaa waaa waaaaa", "label": 1}
{"text": "Good lord it looks like this nutter is gonna win", "label": 1}
{"text": "Wait…that is laughable. Not the same censorship but all those trash hos going to school hard meetings about books with lgbtq characters…all Republicans. Your little Nazi party is gonna show you some censorship and you’re not going to like it.", "label": 1}
{"text": "Came here to get talked down to by democrats more. Please, continue with the arrogant and divisive rhetoric. Please keep calling conservatives racist and sexist. People absolutely love having conversations with you...it's super productive and will only improve your chances next time!", "label": 1}
{"text": "I'd like to say a personal fuck you. I called it months ago. And I'm upset that some fuck like you would even question it.\n\nThank you Reddit hive-mind for fucking up this election. Thank you.", "label": 1}
{"text": "I'd like to say a personal fuck you. I called it months ago. And I'm upset that some fuck like you would even question it.\n\nThank you Reddit hive-mind for fucking up this election. Thank you.", "label": 1}
{"text": "I'd like to say a personal fuck you. I called it months ago. And I'm upset that some fuck like you would even question it.\n\nThank you Reddit hive-mind for fucking up this election. Thank you.", "label": 1}
{"text": "I'd like to say a personal fuck you. I called it months ago. And I'm upset that some fuck like you would even question it.\n\nThank you Reddit hive-mind for fucking up this election. Thank you.", "label": 1}
{"text": "If I shoot you in the chest you can tell me gun control is a huge problem and \"I told you so\" bettwr make that gun wound feel WAAAAY bettwr. \n\nCause short sighted idiots just got the entire country shot.  Let's hope \"I told you so\" makes this whole dictator thing feel much better. I hope everyone with a below 20IQ gets black bagged", "label": 1}
{"text": "I'd like to say a personal fuck you. I called it months ago. And I'm upset that some fuck like you would even question it.\n\nThank you Reddit hive-mind for fucking up this election. Thank you.", "label": 1}
{"text": "One person had ovaries and too much pigment.", "label": 1}
{"text": "You’re ridiculous.", "label": 1}
{"text": "What is with you liberals typing out these middle school girl level paragraphs to just say \"I disagree with his promise to lower Cost of living\". You are such a stupid person.", "label": 1}
{"text": "My god you type way too much just to say something that could be said in 1 or 2 sentences. Do you do this in real life? Do people even take you seriously?", "label": 1}
{"text": "People in this thread are downvoting every comment they don’t agree with, yet are surprised when that same candidate wins the election.", "label": 1}
{"text": "For pointing out reality? Look, if you're dumb enough to believe 20% tariffs are good for your wallet than you're unfortunately an idiot. Politics isn't about teams, it's about plans, goals, and results. The result of a 20% tariff is a price increase. If you can't figure that out and voted for him either you are dumb enough to not know or dumb enough to think it won't apply to you, but either way you're stupid", "label": 1}
{"text": "People are so fucking stupid. Uneducated morons. Media “both sides” bullshit. They deserve it if he goes after them now. He said he would.", "label": 1}
{"text": "Trump handed Biden 1.8% inflation. It peaked under Biden at 9%. Real wages are down under Biden. Gas is more expensive under Biden. Your goofy opinion isn’t a fact little guy.", "label": 1}
{"text": "Aw Trump is your president", "label": 1}
{"text": "isn't that the purpose of the upvotes and downvotes? downvoted btw", "label": 1}
{"text": "actually no, it's supposed to be based on if you think the comment adds anything to the discussion", "label": 1}
{"text": "reddit echo chambers tends to be shocked when they realize reddit isn't representative of the entire country", "label": 1}
{"text": "And that comment added nothing. Damn it's great to see how mad people are", "label": 1}
{"text": "I think this is a pretty great comment.\nOne potentially irrelevant thing I'll add, I think it's important to be exploring space and when I heard that Elon can build a rocket faster than he can get approved I realised the US needs some serious change. \nI think that really helped sway the election, who else is aiming for Mars? FFS just let ambitious people do their thing without so many constraints.\nIt's the only meaningful universal goal I can think of. Okay, so I'm alive and fed and can be what I want. Then what? We need an fascinating goal. Life is an adventure.", "label": 1}
{"text": "I was just giving you the legitimate reasoning behind the voting system, I'm not even the person you replied to lol", "label": 1}
{"text": "So basically theres nowhere for the immigrants to go? Are they supposed to go to the fucking Moon or something?\n\nTypical racist NIMBY shit, \"they can die for all I care, just don't let them in here\"", "label": 1}
{"text": "L bozo also bahaha Liz sees it going the wrong way with Trump?? do you mean towards peace bahaha enjoy that warmongering horrific family and hold this L one more time", "label": 1}
{"text": "He isn’t a convicted felon. Go get a law degree. No wonder you people lost.", "label": 1}
{"text": "The free ride is over for Ukraine.", "label": 1}
{"text": "True", "label": 1}
{"text": "1) never underestimate racism. The illegal immigration issue is one that stirs up a frenzy in even a large portion of the democratic base. Had they shown any sort of control on border control, they'd have won. I am bewildered by their insistence on ignoring how critical this is. It doesn't make logical sense bc it isn't logic, its stupidity. Americans are by and large just idiots. \n\nThe economy- you needed to be training Americans fir four years to hate trump bc his rock bottom interest rates wrre naturally going to cause inflation. You needed to be very very vocally pushing legislation to limit price gouging and greedflation. Harris was vp, this wasn't done, why would anyone support her unless they already understood the things they never explained?\n\nAbortion is a major issue, it's not as major as democrats think. Look at any election map. Click each state. Everywhere you look even in \"blue states\" its red everywhere. The vast majority of placed where you can live in the US geographically, are red. And most of that red is made up of religious conservatives. A LOT of women are FOR BANNING ABORTION. How many articles of leopards eating their faces have come out where they didn't realize how utterly fucked they were on e they needed an abortion desperately only to be denied and even hunted for daring to go out of state? People WILL vote to kill themselves for religions sake and racism sake. People are that stupid.\n\nBiden sticking around and the democrats failing to go through the correct process to get a candidate was a huge failure, a missed opportunity to, god forbid, genuinely build up support for a candidate and put the best one out there. I don't know a single person on earth who thinks kamala is the best and brightest Democrat that could've run. Never understood the vp choice other than the idiotic hubris of thinking that making history was at all important to a mostly dumb, racist, sexist America that votes against its own rights and survival.\n\nDemocrats utterly lost the plot, Republicans lost their party to a cult and America lost massively. Here's to hoping the damage isn't as devastating to our future as it was last time", "label": 1}
{"text": "You're a conspiracy theorist.", "label": 1}
{"text": "About that…", "label": 1}
{"text": "Didn’t have to count on it after all", "label": 1}
{"text": "> They are terrible at promoting themselves. \n\nIf you're number one problem is inflation, I'd really love to hear how you'd explain how that operates to a moron in a way they'd understand it.", "label": 1}
{"text": "Relative to the 1980 election (Jimmy Carter vs Ronald Reagan), as I previously explained. \n\nEither you can't read or you are a massive troll", "label": 1}
{"text": "\" Trump did a better job appealing to working class Americans which is why he won\"\n\nall trump does is tell people what they want to hear. not what is realistic. that he will wave a magic tariff wand and poof inflation away. the hard truth is our problems are large and would take multiple presidents working for the same goals to fix. but the gullible idiots of america don't want to hear that. they want a big strong man to come in and just get shit done instantly. they want all their problems solved yesterday. which is not going to happen.\n\n trump is just a con man telling morons what it takes to get himself into power.", "label": 1}
{"text": "Defensive alliance is now imperialism? \n\nAre you high or just dumb?", "label": 1}
{"text": "Dems will (and must) pivot to the right on social issues. Specifically issues around gender, identity, and gender fluidity. It is an act of courage to stand up in a room of Democrats and say that transgender women should not compete against biological women in sports. The left doesn’t understand this, but 85% of the country (per MSNBC this morning) believes that women’s sports should be off-limits for transgender participants who transitioned from male to female after puberty. This is a slam dunk, no question issue. Except Democrats keep stepping in it.\n\nMany Americans, including college, educated folks in the suburbs, are fed up with the pronoun police. If you walk in with a busty chest and long hair, but insist that your name is Brad, and you are a male, and that mistaken, you for a woman is deeply offensive… Most of us find this to be bullshit. We are happy to use whatever pronoun you want, but you have to give us some grace because we simply do not understand gender, identity, and gender fluidity.\n\nOn another topic, Democrats need to find a way to communicate with working class in a way that does not sound like a lecture. When someone says that the economy is bad and that they feel the effects of prices rising, the response cannot be an economics 101 lecture about how the United States has handled inflation better than any other developed country in the world (true), how inflation has come down over the past four years (true), that unemployment is down (true), and how Harris deserves the opportunity to carry on the Biden Legacy. Because all you’ve told that voter is that “what you were feeling is wrong, and I know better than you.“ And that is not a winning message to make friends and influence people.", "label": 1}
{"text": "Thanks for your input. Now you can go back to your irrelevant life in your irrelevant country. Cheers!", "label": 1}
{"text": "Abandon left wing reddit talking points. All the low IQ people on reddit that comment on this subreddit. Find the most upvoted comments. Laugh at how stupid and misguided it is. But they won't. And I'm happy for it. Vance Vivek 2028!!!", "label": 1}
{"text": "Oh, Birch, as someone who has to run from putting and now have to run from trump, as someone whose friends are jailed for their views — I know what fascism is. You'll know it soon, too.", "label": 1}
{"text": "Not everyone, just a majority. It is stressful being so much smarter than people like you. If I were dumb as shit I could just enjoy this shitshow until the consequences actually hit.", "label": 1}
{"text": "Oh, I'm *soooo* looking forward to another 4 years of stupid, off base attacks about how the left are the *real* degenerates. You accuse Democrats of supporting some nebulous rape cabal, and turn a blind eye to Trump being buddies with Epstein and leaving a trail of sexual assaults allegations in his wake, or your beloved moral church authorities shuffling around priests and elders who rape men, women and children rather than grappling with the way a culture of unquestioning deference to your superiors provides cover for the worst elements of it. Shit, Trump is on record as thinking that they did *Harvey Weinstein* dirty. Get out of my face with that bullshit: you don't care about rapists, you just care about being able to smear the people you don't like.", "label": 1}
{"text": "In the garbage.", "label": 1}
{"text": "You will never learn. This is why you’re in loser exile.", "label": 1}
{"text": "Listen. Your trolling bullshit must be lots of fun for you today, but I'm not in the mood. I wish you everything you deserve. Now please kindly fuck off out of my life.", "label": 1}
{"text": "Convicted in a kangaroo court that had to bend the law to even charge him. He runs plenty of successful casinos but I couldn't care less about that. \n\nSure, run with Cheney whom is among the swampiest, swampswomen whom has ever swamped. Yes, quite the flex. \n\nYou people will never get it. You are incapable of ever having ANY introspection as to why your world view maybe doesn't appeal to everyone. I may never vote D again if you keep this shit up.", "label": 1}
{"text": "No shit, any black man here could've told you that 😂😂😂😂😂😂", "label": 1}
{"text": "We had a 4 year warmup. Now expect it to be supercharged.", "label": 1}
{"text": "You spend your day looking at thousands of images of dead children? wow, you're more of a weirdo than i thought", "label": 1}
{"text": "y’all are mentally ill holy shit, he was already in office for 4 years, or did you forget?", "label": 1}
{"text": "This sort of rhetoric makes you look foolish.", "label": 1}
{"text": "LBJ? You mean LeBron James?", "label": 1}
{"text": "Its not a diversity pick you racist cock sucker.\n\n\"if only they put up a white man they we wouldn't have voted for a russian asset hell bent on destroying the constitution and murdering his political opponents while trying to enact 2025 then we wouldn't be in this mess'\n\nThat argument is so fucking beyond stupid that any American that truly believes that deserves to fuck off", "label": 1}
{"text": "I really hope the Trump voters suffer under his administration. Well, we all will. In fact, the whole world will suffer. But every time this country suffers I'm going to find a Trump voter and remind them constantly 'you did this'.", "label": 1}
{"text": "Reddit is fullness weak ass liberals in an echo chamber. Fuck reddit and fuck you losers. Cry for 4 years you fucking losers.", "label": 1}
{"text": "Because the young people have too much PTSD from their Mommy yelling at them to get out of their beds and vote. \n\nBecause the Hispanics care more about Jesus than they do themselves. \n\nBecause Black men don't respect black women.\n\nBecause all women are threatened by, and therefore hate, all other women. \n\nBecause white men are inherently racist and can't help but love it when another white man calls them special. \n\nMost of all, because ALL people are fucking stupid. Especially spoiled stupid Americans. \n\nHave fun idiots. I'm old and rich enough that  it doesn't matter to me. You fools are the ones who are fucked. \n\nI can't wait until you pussy fucking victims spend the next 4 years whining and bitching while I make fun of you the entire time.", "label": 1}
{"text": "Notice how it's not really anyone's fault here.\n\nThis is setting up your attitude for the next 4 years. That way you can play victim. \n\nIt is your fault. \n\nDonald Trump is president because you are dumb and lazy.", "label": 1}
{"text": "Americans really love racism. They can't get enough of it. Pair that with the fact that America is incredibly anti-black but Americas, generally hate Black women. So yeah... Americans hate Black people which is the reason Trump is elected yet again.", "label": 1}
{"text": "Typical democrat.  Self absorbed and can't see beyond their own little bubble.  They think they're so special and entitled.  \"The whole country must be the problem, but nooo not me and my beliefs. I'm right.\"   Grow up. You're not the only person living in the United States.", "label": 1}
{"text": "If that's the extent of your analysis it's no wonder your side lost. You really don't understand America at all.", "label": 1}
{"text": "A populist", "label": 1}
{"text": "Ehh trump voters should get a 1 day free pass to gloat. We ate your crud for years you can't cry now\n\nAlso mods your complicit in all this. You outright do not allow anti democrat or Harris questions to this sub.  It's all circlejerks on what if trump eats babies post\n\nMods of subs like this should represent the voting demographics\n\nCensorship and bans just ensure you lose in 2028", "label": 1}
{"text": "This take hits home.", "label": 1}
{"text": "The boy who cried wolf surrounded by Christin Nazis...\n They will go after the 22nd amendment within 18months.\nThis is a shitshow.", "label": 1}
{"text": "There won’t be a Democratic Party. You MF’ers weren’t listening to Trump and his cronies on the campaign trail, and even more obvious you haven’t read Project 2025.", "label": 1}
{"text": "Haha. Wow you sound like an insane person. My mistake, I thought I was having a discussion with a normal, balanced adult. \n\nJust, never mind. Pretend I’m not here and go with your life. ", "label": 1}
{"text": "Thank you lyingliar", "label": 1}
{"text": "Yeah I'm not sure who thought passing people off was a good strategy", "label": 1}
{"text": "The \"joke\" is talking about fucking Lyndon Johnson you goofball, nobody's denying the Democratic candidate losing by a sizable margin yesterday. You're talking about a completely different topic to the comment you replied under.", "label": 1}
{"text": "It was positive but empty. Her messaging for how she was going to change the status quo gets a big blank for me, and I think for most other people too.\n\nShe represented the status quo, and whether or not you think it's justified, Trump represented major change.", "label": 1}
{"text": "Except for the fact that it literally was. What is wrong with you? Why are you so hell bent on denying an objective fact?", "label": 1}
{"text": "You’re not making sense, for real. I gave you a legit example about how a measure I voted on would directly affect me. Go ahead and stick your head in the sand, ignorance is bliss I guess.", "label": 1}
{"text": "Oh nooo... anyways ", "label": 1}
{"text": "He's a.  Dem.He had a mangina.", "label": 1}
{"text": "The Democratic party will become increasingly irrelevant until they stop running women candidates and bring back white male candidate.\nA women will never be president", "label": 1}
{"text": "It wasn't a silly question in retrospect. And the sad part is, I was fucking right.\n\nEnjoy the next four years because I definitely won't.\n\nIf more people on Reddit had been included like myself, maybe we wouldn't be in this shithole we are in today. But you chose to stick your fingers in your ears and be like the rest of these numbnuts.", "label": 1}
{"text": "No, software. And you?", "label": 1}
{"text": "Harris was the threat to ending democracy. You lefty loons need to wake up and not be woke.", "label": 1}
{"text": "The Reich-wing speaks.", "label": 1}
{"text": "Are you still botting for free? Dude, you got your ass handed to you and there aren't anymore Venmo payments coming. \n\nYou can stop now. Nobody is listening to this shit anymore. Go take a shower and get some rest.", "label": 1}
{"text": "Keep makin excuses,  you stupid fucks will never figure it out", "label": 1}
{"text": "We're not talking about flat earth, we're talking about a difference in political opinion. You are a fool for being unable to even begin to understand the people you disagree with. I'm not saying you should change your beliefs, but screaming into an echo chamber doesn't actually help anybody.", "label": 1}
{"text": "Most definitely so Trump supporters can be stronger in their convictions for voting in Trump", "label": 1}
{"text": "There is no such thing as a productive political conversation in this brainwashed idiocracy MLM scene of a country. If you want progress, then get off your ass and help tear down this piece of garbage country before the fascists do.", "label": 1}
{"text": "You people are insane", "label": 1}
{"text": "Fortunately I'm W.H.I.T.E so that doesn't bother me one bit ", "label": 1}
{"text": "Peak delusion here.", "label": 1}
{"text": "Less cheating.by left.    Intimidated by jail.", "label": 1}
{"text": "The real question here is, how do we get all those thousands of bottles of lube from P Diddys house out of evidence we're gonna need to shove all those unused tampons that were supposed to go in the boys bathrooms up Time and Kamala ass after that massive, massive, massive RED ass kicking??", "label": 1}
{"text": "Dems should.have.picked.  r Kennedy  Jr.   Big mistake.   He will.make.republicans.much stronger.   From now on...", "label": 1}
{"text": "I think she’s done if you lose to agent 47 that’s basically the kiss of death for you..Hillary has fucked off completely only making surprise cameos and I feel like Kamala is gonna hang it up and the dnc will run straight white men for the next 20 yrs.", "label": 1}
{"text": "Your delusion is fueled by leftist propaganda, rather than source material. Get a grip", "label": 1}
{"text": "I’ve been saying it for 3 years. \n\nThe Hispanics that Dems have been importing en-mass will backfire. The lefty hostility towards religion, nuclear families, and masculinity is not compatible with their culture. A Hispanic immigrant family is ideologically far more aligned with a white rural or even suburban conservative family than they are with a coastal liberal.\n\nBlack males are not down with trans and gay stuff. Hopefully we can nudge them towards embracing their role in a nuclear family while they are in our camp. \n\nUnion rank-and-file are not receptive to the green agenda and they don’t want their 8 yr old daughters in the same locker room as a 50 yr old trans at the YMCA. Also every time a liberal, with a sneer, talks about the non-college educated voter,  they notice.  (Union teachers shut up. You guys are a lost cause)\n\nThe Dems totally jumped the shark in the last 4 years and handed us a base that will keep us dominate for the rest of my life. ", "label": 1}
{"text": "It doesn’t hurt me, lol. I’m just calling you out for saying untrue things. Biden and the DNC absolutely want what’s best for our country, no matter what the insane BS people like you make up. \n\nYou can invent whatever reality you need to help you feel better. Tell it to your therapist.", "label": 1}
{"text": "I bet we have to join your Party.", "label": 1}
{"text": "Because you guys are losers and you need to touch grass. Potential WW3, gas prices, house prices, the american dream literally dieing in front of our eyes, trying to put children on hormone blockers, the economy that effects peoples jobs and stocks, immigrants, yeah you weirdo, those are more important than abortion", "label": 1}
{"text": "Okay sugarplumbuttfluck", "label": 1}
{"text": "Tell me, how many migrants actually recieved any surgery? A number would be good.", "label": 1}
