{"text": "One day you might grow self-awareness and be able to say “yeah, fair enough” instead of having to always pretend you are right\n\nBut I doubt it", "label": 1}
{"text": "Did I say routinely?  See you can’t argue honestly even if you try\n\nThe reason I’m like this is because you folks are tiresome and predictable \n\nThe reason why I’m sure I’m right and you’re wrong is that it is incredibly obvious\n\nI know why you think the way you do and why it is wrong\n\nModern liberals have been sold a bill of goods that distills down to “believe these things and you will be a smart and good person without ever doing anything” and so you all walk around so smug while often making little sense", "label": 1}
{"text": "You’re a joy of a wife I bet. Thanks for sharing", "label": 1}
{"text": "lol I'm not reading your paragraphs, save it loser", "label": 1}
{"text": "Why do you guys hate the blackpill so much? Genuinely what’s wrong with it? A lot of the ideologies shared here around the importance of looks in dating, the realities of building attraction with women, women being biased against unattractive or low status men etc., are already heavily discussed here, what would be the issue with allowing directly blackpill talking points when a lot of people here, including some mods, agree with blackpill talking points so long as they aren’t called blackpill overtly?", "label": 1}
{"text": "[detailing specific physical traits that are genetic that cause failure e.g. facial aesthetics, dick size, height, balding, race, etc.](https://media3.giphy.com/media/5OQQxLxmLffyg/giphy.gif?cid=6c09b95296t9mxfinpsvc31udba2mkq8j35126ijmkfzl94q&ep=v1_internal_gif_by_id&rid=giphy.gif)", "label": 1}
{"text": "lol says the almost 50 year old subhuman who has never and will never experience mutual attraction in his life.", "label": 1}
{"text": "I love all the comments here. Take your L and buy some catfood 😂", "label": 1}
{"text": "You didn't answer the question imbecile.", "label": 1}
{"text": "welcome to red pill", "label": 1}
{"text": "this OP has major issues", "label": 1}
{"text": "Game all depends on how good you look\n\nThe better you look, the less hard you need to try to get women to talk to you", "label": 1}
{"text": "Your argument doesn’t change the biased favoring women I’ve stated.   That’s stupidity on your part, not mine.", "label": 1}
{"text": "It sounds like you have only ever had sex with one woman. You don’t sound very attractive yourself.", "label": 1}
{"text": "You’re coping. You know normal adults have sex.", "label": 1}
{"text": "You’re not normal. Many people would consider this weirdo flags.", "label": 1}
{"text": "She’s normal. She’s got a normal life path perspective. You’re the weird one.", "label": 1}
{"text": "Nice cope.", "label": 1}
{"text": "Petition to rename “black pill” to “true pill”", "label": 1}
{"text": "[removed]", "label": 1}
{"text": "Oh and another thing - complaint about this when most of you have blamed women on here for sexual assault - you are the epitome of trash.", "label": 1}
{"text": "That’s exactly why I’m not listening to you you loser.", "label": 1}
{"text": "Lmao you’re the first one that resorted to calling others losers. You just have thin skin and can’t take it like you dish it. Like most losers.", "label": 1}
{"text": "Aren't you single?", "label": 1}
{"text": "What's your point?", "label": 1}
{"text": "Nah I mean we got enough info thanks", "label": 1}
{"text": "You didn't get any info, you just asked me a question you already knew the answer to", "label": 1}
{"text": "Cope", "label": 1}
{"text": "Nah I was guessing but what a guess right", "label": 1}
{"text": "So you just decided to randomly ask if I was single for no reason, when we were talking about something else entirely? \n\nLike I said, jibberish", "label": 1}
{"text": "I've never been more at peace", "label": 1}
{"text": "Doesn't seem like it", "label": 1}
{"text": "Because I debate on a debate sub?", "label": 1}
{"text": "No ur angy bruh", "label": 1}
{"text": "Okay 👍🏾", "label": 1}
{"text": "> If women were more honest about what turns them on, guys would have a more reliable blueprint of what they need to do without going all sciency/redpill on the subject.\n\nAnd that would make the Black Pill grow out of control.", "label": 1}
{"text": "Wow dude, you should chill with the blackpill content.", "label": 1}
{"text": "> disagree. it's meant to be lost.\n\nThe fact that you have to tell someone this and it's not innately known, is proof that Idiocracy is finally here.", "label": 1}
{"text": "The redpill comes from a myriad of different observations, theories and other people's experiences. Redpillers compare eachother's notes all of the time, and diagree on matters regularly. \n\n\nCase in point the redpill is nothing like scientology. There are no \"leaders\", no chain of command, nor are they governed by a set of principles. You are being intellectually lazy.", "label": 1}
{"text": "> I do not understand how you all don’t see this.\n\nWe see it we just like to complain about it, and I will continue to complain about it", "label": 1}
{"text": "Yeah no, not everyone gets those opportunities. Not everyone grows up in loving stable homes, or goes to schools with the opposite gender, or is free of mental illness, or has a family who knows enough to get him help, or is free of health issues. When all those things are solved for, then sure it might be his fault. Until then, no. And his frustration is justified then.", "label": 1}
{"text": "Do women want to be treated equally or not?\n\nIt’s that simple. If you want to be treated like a princess then you should be feminine.", "label": 1}
{"text": "It's never been something I've heard a good argument for. The best some people can come up with is:\n\n\"The person asking the other person out should pay\" - *person who conveniently doesn't ask dates out*.\n\nThe absolute extreme of this is when you go out with someone who didn't even bother to bring their purse/ wallet. It's not the fact that I'm going to pay, it's the sheer fucking entitlement and ego behind it. I've always believed that if you can't even be bothered to offer to pay your share, or say you'll get the next one, you weren't taught right.\n\nYou're not a child, you're an adult.", "label": 1}
{"text": "I was browsing redpill/blackpill content on yt and patreon around when it fucking started with all the hardcore censorship. Before they even allowed women on they panels. Waaayy back in 2015. I was especially in tune with the black manosphere. Bet nobody up here actually knows who created that? Nah, it wasn't Kevin Samuels...", "label": 1}
{"text": "Bruh I don't give a shit about Rollo. He's and old pick-up artist who's been married for a long time now. A lot of redpill/mgtow/blackpill don't even mess with him like that lol. See you keep lumping us all in with these people that aren't even in touch with what's actually going on. \n\n\nI started with the black manosphere, under dudes like Blackram, Tito, and Angryman valdez. Oshay. That shit. Mr research. Even certain white dudes like \"Sandman\" who was a little more popular.  \n\n\nThey don't care about none of that pua shit lol. We about dispelling false narratives and telling harsh truths. ", "label": 1}
{"text": "You're still utterly spineless but I guess your ok with that.", "label": 1}
{"text": "[https://np.reddit.com/r/Vent/s/uH5YH0zYQa](https://np.reddit.com/r/Vent/s/uH5YH0zYQa)\n\nFemcel says the planet will go extinct: aww poor baby take my sympathy\n\nInkwell says the planet will go extinct:\n\n![gif](giphy|TvDYX3oGVvGKcuGttY)", "label": 1}
{"text": "i snorted", "label": 1}
{"text": "I told niggas Obama was the worst president for us and now they wanna say kamala", "label": 1}
{"text": "She's a woman, so it's okay for her to be a bigot.", "label": 1}
{"text": "Should men help women or not? If they should why would men help if they are going to be prosecuted? Life isn’t a Disney movie princess.", "label": 1}
{"text": "You can't correct men since they're always right\n\n![gif](giphy|d3mlE7uhX8KFgEmY)", "label": 1}
{"text": "This seems like a conflict of interest.\n\n\nI do t think you should get to mod a thread you are involved in.\n\n\nIt can be perceived as abuse of power.\n\n\nAt least make it look kosher", "label": 1}
{"text": "Your own words aren’t specific huh? You are that stupid I guess", "label": 1}
{"text": "I'm starting to see an alarming number of this \"just start fucking gay men\" comments and it's incredibly fucked.\n\nIf this is where your rhetorical argument game has led you, grow up.", "label": 1}
{"text": "I don't fucking care", "label": 1}
{"text": "Y'all really rock some small dick energy on this. Maybe I'm just refusing to associate with the wrong kind of people, but I'd know 90% of the people at the party due to the whole *shared social circle* thing most normal couples have.", "label": 1}
{"text": "[\"Y'all really rock some small dick energy on this\"](https://www.dictionary.com/e/wp-content/uploads/2018/05/soyboy-2.png)", "label": 1}
{"text": "I'm un stacy widowable", "label": 1}
{"text": "Why is your default response body shaming lol", "label": 1}
{"text": "Vs when you're a woman\n\nhttps://preview.redd.it/qfssxolqe6xd1.jpeg?width=1033&format=pjpg&auto=webp&s=2a7b4debeab086b049cb2987361d84f427e7bbf4", "label": 1}
{"text": "Why did you ask if she was single? I'm missing the relevance of that to the conversation.", "label": 1}
{"text": "The context is you're a man asking if someone is single, clearly more of a personal attack than a woman calling someone an incel or saying c word", "label": 1}
{"text": "🤢🤢🤮🤮🤮🤮🤧🤧🤧So you compare loving and appreciating your boyfriend or husband to going with a whale....  women are selfish and disgusting, just become a lesbian and don't get close to any man if you hate them so much.", "label": 1}
{"text": "You do understand that your comment was personally directed at the commenter? This other comment is about a group.\n\nThat's not so much of a man vs women thing and more about a woman following the rules and a man committing a foul.", "label": 1}
{"text": "Damn, that is unfair. What fun is there if we can't poke fun at each other??", "label": 1}
{"text": "Only women are allowed to talk shit. The most minor tiny infraction from a man is uncivil 😂", "label": 1}
{"text": "She’s not really insulting anyone directly though. So I get why the comment is still up", "label": 1}
{"text": "Used cope... lol", "label": 1}
{"text": "The rules only apply to men on here", "label": 1}
{"text": "Cringe af from our femcel overlords", "label": 1}
{"text": "Mods don't context.", "label": 1}
{"text": "Where was the personal attack though?", "label": 1}
{"text": "True but it would be annoying if any form of \"you\" was prohibited. Will I get banned by a \"you \\*point a flaw in their reasoning\\*\"", "label": 1}
{"text": "If I said that no one would care yayy", "label": 1}
{"text": "It is annoying but it is what it is. There's always a way to phrase it differently.", "label": 1}
{"text": "Lol I still feel for me; they are taking enjoyment away from us cause it's not a proper victory when your opponents have their hands tied behind their backs", "label": 1}
{"text": "that mod has a notoriously frail ego and downvotes you for lightest of banters", "label": 1}
{"text": "Yeah I'm not surprised with that flair lol", "label": 1}
{"text": "It made her personally the topic of the conversation in a way that many people would feel attacked.", "label": 1}
{"text": "That kind of censorship on men is also a hindrance, how else am I supposed to sustain resentment", "label": 1}
{"text": "If someone asked me arent you a virgin and I reported it do you think mods would act on it? I highly doubt it. \n\nAnd the person above also said the c-word which is not allowed and still has the comment up. The mods have a clear bias", "label": 1}
{"text": "Damn you know its bad when even women are saying its dumb", "label": 1}
{"text": "It would be fine if it was consistent. I've seen and experienced far worse comments directed at people and was never removed. He makes a slight jab and it gets deleted? Most mildest comment I've seen on here.", "label": 1}
{"text": "They'll just remove everything 😂", "label": 1}
{"text": "Built dumber", "label": 1}
{"text": "Lol if that was true all fem subs wouldn't be full of the fallout of you dummies fucking liars all the time. Women desire fiction more than reality it's well known", "label": 1}
{"text": ">Lots of morally good people are total jerks.\n\n\nHahahahahahahahahahahahahahahahahahahahahahahahaha", "label": 1}
{"text": ">will make it extra hard to find someone to find someone they like \n\nFixed it for you. \n\n>contrary to popular belief desperate men will not settle for ugly girl, they want somone slighly above their league\n\nDumbest shit I've heard all week in the sub. \n\nThis isn't up for debate. This is an objective fact. Women have it easier than man relatively speaking to date, have sex and dare I say life in general contrary to belief. It's not complicated, accept it and move on.\n\n  It's ten times harder for me to get a date or sex than any woman here on this platform. All of you can log off and find a date, sex, or relationships today if you weren't picky, I can't.  My life is way harder than yours.  You're not a victim and  you don't know what hard is. Hard is being all alone for years, decades,  months, with no viable options only to be mocked and belittled by society.", "label": 1}
{"text": "Hey Caillou", "label": 1}
{"text": "Yeah, and nobody is fucking like that...\n\nYou're fucking retarded if you actually believe that shit", "label": 1}
{"text": "Q4A: Which pair of PPDers are like Jekyll and Hyde? I was just thinking that u/FunEducation2025 is the Jekyll to u/Flame-of-Recca ‘s Hyde.", "label": 1}
{"text": "Men swipe on everyone. That's the default strategy.", "label": 1}
{"text": "Stop promoting your business.", "label": 1}
{"text": "Do yourself a favor, swipe on every man and see how many match with you.\n\nYour delusion will break open.", "label": 1}
{"text": "Yes all the attractive guys ain't finding the women they match with attractive. They just talk to ones who match with them, later they get bored after a week or so.", "label": 1}
{"text": "Yes, going out with someone for them is better then going out with no one\n\nMen will plan elaborate dates for someone they find attractive, unattractive ones get Netflix and pizza data - simple.\n\nThe amount of money a man is willing to spend on a woman gives away how much he wants her", "label": 1}
{"text": "Men understand.\n\nBut they just don't pay much mind to it since women also don't understand that not being top 5% doesn't give them much options to begin with.\n\nIf women were willing to understand, men would also understand.\n\nBut it's heartless market of hearts.", "label": 1}
{"text": "Swiping on Robbie Margot and profile being shown to her doesn't guarantee a match.\n\nSo men swipe on waitress, janitors, bartenders, single moms and other low status women all time.\n\nI know a city mayor who had such a dry spell, he matched with a female janitor and slept with her lmao.", "label": 1}
{"text": "Doesn't work, East Europe and Japan got same social media bruh.", "label": 1}
{"text": "How can they be swiping on everyone and overlooking average woman?\n\nDo you read yourself? Or just based on your feelings?", "label": 1}
{"text": "Neither stats agree with you, nor the strategy. Please stop.", "label": 1}
{"text": "You've limited swipes.\n\nBut if you try to limit them to attractive women. It's unlikely they'll match back with you.\n\nIt's mostly women who ranks 2-3 point below you with makeup on get to your level and try to match with you", "label": 1}
{"text": "They was back in time when men used to be respected.\n\nAs the reward has disappeared, those who are still taking risks are dumb.", "label": 1}
{"text": "when you're best pickup lines aren't working tonight bros, it's time to switch to [plan b](https://zzcartoon.com/contents/albums/sources/1000/1339/8571.jpg)", "label": 1}
{"text": "Unless you provoke, nobody comes for you.\n\nDon't stand in the way of karma.", "label": 1}
{"text": "If they had tried, they'd have got \"I can do it myself, didn't ask for your help\".", "label": 1}
{"text": ">Redpill men often talk about how women should be fine with splitting the bill or coffee dates.\n\nWomen who split bills usually are aiming much higher in male physical characteristics.\n\n>So if women want to be with men who like them they shouldn’t go on inexpensive dates?\n\nDoesn't it make sense to you? Imagine if you are a rich woman, and there are 5 different guys who are into you. Who would you spend more? Obviously the guy who you love right? \n\nAnd if you want attention, probably you would go on dinner dates with those guys and take their attention but not give them any presents etc...\n\nUsually a man who takes a woman for coffee date, is the same man who throws lavish involved experiences for the woman he desires and loves.\n\nMen these days want bill splitting coz a woman can leave them anytime, which isn't fair to them but a man who loves a woman also is ready to die for him, which is also not fair to him (because it's unlikely any woman will fall in harms way to save him)\n\nMen will do unreasonable and unfair things in love. If they are calculating everything, they don't love you as simple as that.\n\nRedpill is all about reducing cost on males, and getting max reward off the the least efforts/cost.", "label": 1}
{"text": "Hardly matters.\n\nThose attractive women will never display much interest in you.\n\nI get matches from very attractive women occasionally because I swipe selectively. I've always swipped on all.\n\nI hide my wealth and fame and I get virtually zero interest from women.\n\nThe moment a woman realises I am actually rich then it changes but then it all seems fake to me.\n\nI am the the only one who experienced this.\n\nHere's a very famous man saying this:\n\nhttps://youtube.com/shorts/T7ngJmIioJg?si=R3Dg11d021-gAHeB", "label": 1}
{"text": "Yes I won’t be changing because I’d rather be single than compromise what I want in a parter.", "label": 1}
{"text": "Nah you're right. This is like getting mad at not giving a platform to white supremacists and Nazis. It has nothing to do with freedom of speech bc these ideas they have can't be reasoned with. \n\nIts like trying to explain to schizophrenics that lizard people aren't real or that Jewish people didn't deserve the Holocaust if theyre Nazis. \n\nLet them be someone else's problem.", "label": 1}
{"text": "The idea that “men want women more than women want men” is a huge oversimplification.\n\nTake a closer look at the life of a woman who says she’s alone. You’ll often find a handful of men in her friend circle who are far from just “friends.” There are guys who’ll pick her up late from the club, help her out when her car breaks down, or lend a hand when she needs it—all without expecting much in return. Some women have even told me they keep different men around for different favors, giving just enough attention or casual flirtation to keep them interested.\n\nAnd it’s surprising, honestly, how little some guys expect back. Many are “nice guys” with the quiet hope that maybe, one day, she’ll notice their efforts and let them in. They’re driven by the idea that persistence will be rewarded, convinced that if they keep helping, they might earn a shot at being something more.\n\nThe truth? Often, they’re just one of several. Even if she does end up dating one of them, what happens to the rest? For most of these men, it’s like playing a lottery—the odds aren’t based on effort but often on sheer attraction. And typically, it’s the most attractive man who wins out, not necessarily the one who’s invested the most.", "label": 1}
{"text": ">women are the ones who pick, men are the ones who approach.\n\nThere are atleast 4 women who picked me and were aggressively pursuing me and i didn't have any interest in them. Most women cannot really pick anything, the guys who's more attractive, has more resources, has his own life goals isn't falling for them if he knows what he wants in life and they clearly cannot provide that", "label": 1}
{"text": "I'd think they are sent by my business rivals or social circle rivals to get intel on me.\n\nI'd reject her and move on with life. I can't risk this.", "label": 1}
{"text": "You're a special kind of stupid if you think Katt only has 2 million dollars after having like 5 net flix specials and selling out theatres for almost 20 years.", "label": 1}
{"text": "He's probably 3-4 points more attractive.\n\nOtherwise no woman will be with someone who makes less.", "label": 1}
{"text": "Post a photo of you with him or DM me. Lemme see if it's all virtue signalling or you are really the kind of woman who is virtuous.", "label": 1}
{"text": "This only applies to women - an arse-faced sub-five fatty can declare that no man is good enough for her unless he possesses the 6-6-6 and a host of other absurd requirements, and the response here will be: “YASSSS QUEEEEEN!!!!!”\n\nConversely, if a man expresses the slightest hint of frustration at his dating woes, then the response here is: “Nobody owes you a relationship, you fucking incel creep! Why don’t you shower and wash your ass, you dirty fucking piece of shit! And lower your fucking standards - you should be grateful that any woman would consider dating you, you disgusting cunt!”", "label": 1}
{"text": ">I wouldn't attribute it to \"hypergamy\". \n\nI attribute this to unchecked \"hypergamy\" in society.\n\nThe societal judgment and the pillars of patriarchy were once essential for providing long-term stability. Today that structure has eroded. The world envisioned by feminists is far less stable, characterized by rising rates of antidepressant use among women, declining birth rates, and plummeting marriage rates. We witness rampant infidelity, betrayals, and divorce as a means of financial exploitation and paternity fraud - men are suffering and in turn women too.", "label": 1}
{"text": "good morning to women with aids", "label": 1}
{"text": "its called egalitarianism dummy", "label": 1}
{"text": "No, in my circle people have assets worth millions of dollars. They aren't struggling for anything, yet we see the same issues.", "label": 1}
{"text": "It depends on the type of intelligence!\n\nThere are many different forms, but the most agreed upon categories are as follows, with some more useful for romantic pursuits than others. \n\n* visual-spatial - Not very used. \n\n* verbal-linguistic - EXTREMELY useful, as this is the intelligence involved in having (and steering) a conversation \n\n* musical-rhythmic - can be useful if you’re at a place where people meet by dancing.\n\n* logical-mathematical - not very useful; math is generally a one-man sport.\n\n* interpersonal - very useful as it helps you understand how to read a room\n\n*intrapersonal -more subtly useful, as it helps you understand yourself and what would actually make you happy in a relationship \n\n* naturalistic - somewhat useful, but just in the Occam’s razor kinda way, in that humans follow the same logic as the rest of nature. \n\n* bodily-kinesthetic. - somewhat useful if you’re in an environment to showcase skills like a sports event or a climbing gym", "label": 1}
{"text": "Peterson himself explicitly pointed out the exception in a talk.  I went something like \"Engineers are the only men who can't turn social status into mating opportunities\".  \n\nI'd sweep Math under Engineers here, look at my username, I include myself in the generalization here.  \n\nThe problem is that as competent, intelligent, and productive you are, no one can tell. Walk down into the Engineer department, and they all dress like hobos, so no one can tell visually.  No one can tell your genius through conversation either, because they don't can't wrap their heads around what you do.", "label": 1}
{"text": "This isn’t capitalism; it’s using capitalism as a shield for a lack of ethics and a disregard for the values that allow society to thrive.\n\nMoney has been part of human history for thousands of years, yet society didn’t collapse as it is now. Even when almost everything was for sale with minimal regulation, people upheld certain values that kept communities strong and resilient. The difference today is not just capitalism but the erosion of these guiding principles, replaced by a culture that prioritizes profit over the well-being of society itself.", "label": 1}
{"text": "\n\n> Of course, women don’t want men who have nothing to offer them—that would just be a burden.\n\n\n\nOne day, you’ll be old and perhaps unwanted too. I hope no one will look at you as a burden then. That’s where empathy comes in.\n\nMaybe you want every advantage in life, but I hope you don’t end up choosing someone who feels the same way.\n\nYou sound young.\n\n> Men don’t want women because they see us as equal humans with thoughts and emotions—they want what they can get from us. Welcome to Earth.\n\n\nYou’ve convinced yourself of that lie, but there are many men who would go to great lengths, even sacrifice for you. Perhaps you just can’t see them as “not evil.”", "label": 1}
{"text": "I am rich so I don't see capitalism to be problem. We've large enough house, dozens of cars, and all the cool toys - so how is lack of money affecting us?\n\nIt's actually hypergamy left unchecked, no morals or ideals which help flourish society at large.\n\nMen today have little desire or need to safeguard interest of this society.\n\nThat's why we see young men asking \"how can I dodge draft\", and 90% of them want to dodge draft, no one left to protect you and your sisters", "label": 1}
{"text": "Exactly. Intelligence is valued for the benefits it can provide, not for its inherent quality. If you aren't turning your intelligence into tangible benefits that she can experience, then she isn't going to care about it. Intelligence can be turned to humor if you have the social skill to go with it, or be used to solve her problems if you are sensitive enough to notice them and offer solutions in a way that she is receptive to, or it can be turned to wealth and status if you monetize it. However many of the \"higher\" stem fields have a much worse input to output ratio, so a guy who puts less of his limited energy and focus into his work but makes the same or only a little less, is gonna be much more attractive.", "label": 1}
{"text": "Past a threshold they get upset with it. If the high IQ is associated with ADHD or Autism in men, then it works against you heavily. The smartest guy I know - valedictorian in HS, went on the Ivy League and found great success - he never dated because he was way too autistic.\n\nWomen select for socially adjusted men first. IQ is a distant consideration. It can help you if you’re socially adjusted, but all the IQ in the world won’t help you if you’re socially awkward.", "label": 1}
{"text": "No you don't match in looks untill I see a couple photo of you.\n\nIf you really have a boyfriend why afraid to DM me a pic.", "label": 1}
{"text": "Let's be honest, it's because in today's society women are handheld through every interaction by simps on social media and girl's girls, and are extremely spoiled/coddled at least compared to how men are treated/dealt with", "label": 1}
{"text": "Nope", "label": 1}
{"text": "It doesn't really merit anything else but you can try if you want", "label": 1}
{"text": "You do realise you have made yourself look stupid.\n\nMy 3rd link you refuse to look at is in fact the data link from my second link which shows you didn't read it properly.\n\nBut like so many feminists you aren't interested in reading the data and working towards equality you just want to shit on men.", "label": 1}
{"text": "Oh god YES!! \n\nThis is EXACTLY what I think. Women shame men for getting too sexual on the apps, for approaching, for even flirting or hinting about sex. On the other hand, men who are sexually successful are portrayed as heroes. When was the last time you saw a protagonist in a story that DIDN'T get the girl?", "label": 1}
{"text": ">They’re hot, seductive, flirty, extroverted, and command the room. \n\nIf you can see them, they aren't orbiters.\n\n>Bonus points if she’s a little bit of a “damsel in distress” and needs your help.\n\nI agree here.\n\n>They’re hot, seductive, flirty, extroverted, and command the room. \n\nI've plenty of female friends who are neither hot, nor seductive, nor overtly flirty, nor extroverted or room commanding yet they've orbiters. You can barely see those orbiters, how do I know about them? They tell me about who did what for them.", "label": 1}
{"text": "Believe me. The reaction women had toward me when they knew I was a virgin changed completely once I had some success.\n\nSexual success does help.", "label": 1}
{"text": "Except some men are just sexy because they’re sexy and there’s nothing else to it", "label": 1}
{"text": "I HATE YOU", "label": 1}
{"text": "Omg seriously? Do you really not understand the difference in sexual attention seeking behavior of women and men? Yes it is equivalent to your boyfriend going on Tinder, to engage in at least emotional cheating. Stop gaslighting. You trying to have your cake and eat it too, and everyone understands it.  \n\nBut then again I suppose he made a mistake when he got into the relationship with town bicycle in the first place.", "label": 1}
{"text": "Speaking the truth and noticing the differences in group behavior is homophobic now, apparently? Goodbye.", "label": 1}
{"text": "Because they aren’t subject to the draft idiot", "label": 1}
{"text": "You need to improve you reading comprehension.", "label": 1}
{"text": "I'm more familiar with the black manosphere side of the redpill/blackpill. Which is slightly newer and always had more motion on youtube/patreon especially after that Ibmor shyt came about. \n\n\nMaybe y'all shyt is different 🤷‍♂️. I don't have a problem admitting I'm wrong on something. .", "label": 1}
{"text": "In the 60’s the equal rights act was passed yet men were still being drafted. \n\nCombat is extremely physical. More so than mere sports. Ask any veteran what it’s like to carry dozens of pounds of weapons and equipment all day. \n\nYou’re actually fucking dense.", "label": 1}
{"text": "You fucking retard this is saying that everyone gets it except men who don’t register. I personally fucking know women working federal jobs and they obviously didn’t register for the draft", "label": 1}
{"text": "Stop murdering infants 🙏", "label": 1}
{"text": "Getting pregnant just to have a post birth abortion just for you 🥰", "label": 1}
{"text": "Stop bragging about your relationship", "label": 1}
{"text": "Eloquently put.\n\nThe irony is some societies have already gone post nice-guy. These are shithole countries. In such places the stakes of dating bad boy are high. You'll end up with a baby and a weak government that can't enforce child support. Or you'll end up killed by some drug dealer.\n\nI recalled a hooker telling me that she likes nice guys because \"bad boys\" usually try showing how macho they are by slapping around women. Of course she had to sink to that level for her attraction to change. It was like an instinct that kicked in.", "label": 1}
{"text": "Men are more redpilled (even blackpilled) than ever nowadays. Lots of men who would have become beta providers in the past now understand they're getting some bad boy's sloppy seconds and that it's just his turn anyway  \nThe future is gonna be very interesting.\n\nWhat's even more interesting is that an old redpill blog predicted today's dating landscape 15 years ago!!  \n[https://heartiste.org/2010/06/17/the-end-of-beta-providers/](https://heartiste.org/2010/06/17/the-end-of-beta-providers/)\n\nThe whole article is golden but allow me to quote this :\n\n*If the economic empowerment of women means men have to work three times harder just to get the same old, now rapidly fattening, pussy they got in the past for less effort, then maybe they’ve figured out that the system is rigged against them. Maybe they’ve made a very rational decision to get access to this pussy by other means. And let it be said that there is more than one way to stroke a kitty. Remember, women don’t get wet for a paycheck; they get wet for the alpha demeanor that a man who is good at collecting paychecks exudes. And as any reader of this site knows, that alpha demeanor can be learned and applied.*\n\n***When financially self-sufficient women turn away from beta providers as a source of sexual arousal, they substitute other alpha male qualities in its place. That is why Rosin’s article would have been better titled “The End of Beta Providers”. It’s a brave new world, and the answer is*** [***more game, more players, more sexual healing***](https://web.archive.org/web/20141227031134/https://heartiste.wordpress.com/2009/06/01/sexual-dystopia-a-glimpse-at-the-future/)***. It’s win-win for everyone… except modern society.***", "label": 1}
{"text": "Women just want all men to be masculine confident and bold, not a soft spineless pussy. Idk why that’s so hard to understand. \n\nYou never see a masculine confident bold NICE man struggling, only the NICE spineless can i have a crumb of pussy men are struggling. \n\nThis is just a big cope really.", "label": 1}
{"text": "Y'all rationalize anything. It's no shocker why women end up in abusive relationships🤷", "label": 1}
{"text": "I’m only gonna explain this one more time.\n\nMen often treat women their with better based on their attractiveness.  This is BS.\n\nWomen often display submissiveness based on a man’s resources. This is also BS.\n\nIf you’re ok with one and not the other it shows your hypocrisy.  I’m guessing you’re trolling, this is Logic 101.", "label": 1}
{"text": "For fucks sake this is what I was saying earlier. Stupid people who think they can read statistics. \n\nIf you use any sort of AI to make an argument it's not my fault when I think your stupid. \n\nI was an Academic specialist for a university. It is literally recommended that you NEVER USE AI for research articles bc they don't summarize well, it's out of date (ai usually gets updated with new information once every year as it gets updated) and two you use reputable sources. \n\nLike idk pubmed. Like come one.", "label": 1}
{"text": "I think you’re missing it.  The point is women pushing conditional femininity/submissiveness are often triggered when a man displays the same behavior.  You’re going into extraneous detail on a hypothetical. Let’s try to bring it back home, here.", "label": 1}
{"text": "Did Shaq shit in your cereal this morning? The fuck", "label": 1}
{"text": "Zip it up when you’re finished too", "label": 1}
{"text": "Repeating the same thing he just said? Really? Not as cool and lame. 😪", "label": 1}
{"text": "It’s funny how they don’t understand this concept but do AF/BB on the regular .", "label": 1}
{"text": "You don’t know what bright skinned means?", "label": 1}
{"text": "You could lie to yourself about it. You’re pretty good at that.", "label": 1}
{"text": "I agree with you. This thread is about to be gaslight central though. Most men's preferences are very similar and practically the same. In western societies it's blonde blue eyed and skinny. Where I'm from it's lighter skin and long hair. The body is flexible but most prefer skinny. \n\nMen rarely prefer darker where I am. Their preferences definitely vary less than women. Women like it all from dark to light. From skinny to muscular. As friends we never agree on each other's types and it's funny because I can never predict what type of guy my friends will like. I even have a friend who says she likes \"ugly\" guys. Guys which other people find ugly but she finds hot, lol. The only place where most women tend to not differ is height. But ya men's preferences are generally the same it is what it is. \n\nThey just generally tend to settle for what they can get and some will be happier than others. Men have specific preferences but when it's obvious they won't receive what they prefer (or can't afford what they prefer) they're willing to not be picky or willing to settle depending on how you see it.", "label": 1}
{"text": "I am providing quotes with sources showing where the information comes from. You are not saying anything. You are just sabotaging the conversation with emotionally charged words. It is not the first time I argue with a woman. If this was the real world, you would be screaming abuse, crying, or throwing a tantrum trying to silence the conversation. You are the ones making things taboo.\n\nNo I think about women's mental health all the time. I think about how your persecution complex is always affected by your mental health. How any form of criticism is viewed as hatred, because you don't really want the problems solved. You just want to talk about it in a way that benefits you.", "label": 1}
{"text": "Then you aren't reading which is a reflection of poor reading comprehension. \n\nMaybe I should dumb it down to 5th grade level because you're struggling. \n\nYou: women are more mentally ill and sad now than they were in the past. \n\nMe: no they are not. The stigma of women reporting mental illness is not as socially detrimental. So they seek help more. \n\nWomen reporting & asking for mental health services does NOT EQUAL \"women are more mentally ill than men or in comparison to the past\". \n\nYou: Bing AI said from these research articles I never bothered to read the discussions & methods say this about women. \n\nMe: as a one time academic specialist in the past,  AI is not a good tool to look up research articles bc AI is machine learning and gets updated once a year bc it has to be fed information & then tested on its responses (it is not always accurate) even Ai companies will tell you to do independent research. which is why universities do not recommend it for students to use AI as a source to find research articles. \n\nYou: well this one study said lesbians and bisexual are the most abusive. \n\nMe: the study in question asked if women who are bisexual or lesbian have ever been in an abusive relationship. \n\nIt did NOT ask what the gender of their ex partner was from that abusive relationship. Notably because bisexual women overwhelming date men. Bc lesbians are still a minority. \n\nSo it is not accurate to use that study that lesbian and bisexual are abusive. Bc it doesn't specify if they were in relationships with men prior. Just ask if they had experienced domestic abuse.\n\nYou: well liberal/leftist women report 51% on being on anti-depressants. \n\nMe: yes bc these political ideologies enable and foster a space to openly about mental illness. \n\nConservativism/right wing does not foster a space to talk about mental health issues as it is seen as a moral failing. So they are less likely to come forward when talking about mental illness. \n\nIn conclusion you simply do not have the capacity to understand what you are reading bc you do not understand confounding factors and you mistake correlation for causation and use bing ai as a reputable source for your misguided attempts at low level thinking to justify that women are unhappier now then they have ever been but only because they are coming forward with their issues, seeking help and there is less social stigma on depression and other mentally illnesses. \n\nIf you still continue to struggle I suggest you seek help with a special needs tutor (genuinely not an insult) bc you seem to be struggling with fundamental reading comprehension basics.", "label": 1}
{"text": "You just agreed with him.", "label": 1}
{"text": "Bro you're dumb as fuck and lazy if you need AI for the stupid comments you've made lmao\n\nHow embarrassing", "label": 1}
{"text": "Hahahahahaha you're so emotional", "label": 1}
{"text": "Cry more pussy", "label": 1}
{"text": "🥱", "label": 1}
{"text": ">But, do you value emotional connection and intimacy from someone who fits into your life?\n\nWhere you appearing weak will make her lose respect for you? Same emotional connection where you need to take your strength all the time?", "label": 1}
{"text": "Richard Feymans wife didn't like him much despite him being attractive, charming and super intelligent.", "label": 1}
{"text": "Yeah and I'm a millionaire who owns a yacht. Send pics and I'll believe it. \n\n\nBut even if I did believe you, it still doesn't change the fact that the average 30-year-old woman is generally much less desirable than the average 20-year-old woman. The opposite is true for men. That's what the Wall is. I don't care how many hot 35-year-old women you dig up videos of.", "label": 1}
{"text": "The funny part is that I don't actually doubt that women would enjoy having that right...", "label": 1}
{"text": "I'm literally agreeing with you\n\n![gif](giphy|Wgb2FpSXxhXLVYNnUr|downsized)\n\nwho are you arguing with????", "label": 1}
{"text": "Clearly you've already suffered a lobotomy to come up with such a moronic idea", "label": 1}
{"text": ">So, it can never ever be the type of woman YOU pick, right? It has to be the actual women themselves.\n\nWe rarely come across women who are different.\nAnd maybe we aren't even prepared to deal with her because of lack of experience.\n\nAlso she might not even be friendly to you.", "label": 1}
{"text": "I maintain they aren't a seven. But they aren't overweight, colored hair clown either.", "label": 1}
{"text": "ah ok very cool. i had a similar experience with another dating/lifestyle “philosophy”. youtube is great.\n\nhow does your black pill perspectives and beliefs impact your dating life?", "label": 1}
{"text": "All men think this just that you'll call them insecure if they are honest with you.\n\nThen you will come and claim how men wear a mask, you guys simply do not accept any critisism.", "label": 1}
{"text": "It doesn't really effect my dating life because I don't have a dating life lol. I suppose the black pill doesn't encourage cold approach but it doesn't encourage anything really. But I guess it does play a role in why I don't say ask out 100 women aday.", "label": 1}
{"text": "So you dance in strip club because you like that? Or because you like the attention?\n\nWhy not dance in your bathroom then? Or dance while cooking food.", "label": 1}
{"text": "That first sentence could use a comma. You definitely make it harder as a reader to respond to. \n\nThat’s cute, you’re trying to take steal my insult. Would’ve been better if you said it first. Imitation is the sincerest form of flattery.", "label": 1}
{"text": "You talking to yourself again? You have a tendency to own yourself a lot.", "label": 1}
{"text": "You act like an attention seeking prostitute", "label": 1}
{"text": "The huge range of porn categories empirically bears this out to be true.\n\nI don't get all the crying about skinny women when there's a huge (and usually overlapping) group of men who are just as crazy for curvy women.", "label": 1}
{"text": "Then dance in hall full of women only. After dance is over, weak your hijab again then step in a car and drive home.\n\nThis meets your dancing naked kink while not making man feel bad about his relationship with you.", "label": 1}
{"text": "You view life through rose colored glasses, you'll grow up eventually", "label": 1}
{"text": "Unfortunately, male feminists and the spouses of feminists are often too far gone to see reason.", "label": 1}
{"text": "Thanks for clarifying that you don't understand the legalities of discrimination and that you don't believe men should be accountable for their abuse. \n\nIt's always interesting to see how people misinterpret things they don't understand.", "label": 1}
{"text": ">Lol. What? This is too funny. Thanks for the laughs. Going to dinner or brunch or the klerb with your friends doesn't mean someone is incapable of loving someone. \n\nWe know what kind of kebab you eat with friends :) we really know!\n\n>The real issue is thinking imaginary scenarios are reality.\n\nStay with your man then, make him believe in your love and do things with him rather than with others who will disappear with time, a man who loves you will stay forever even when you get old.\n\nUnfortunately, most women cannot reciprocate even 10% love men have for them.\n\nIt's genuinely sad how God can make such creation which cannot love back.", "label": 1}
{"text": "Yes, being married to a feminist makes him too far gone.", "label": 1}
{"text": "Thank you for clarifying that you have been 100 percent brainwashed by feminist indoctrination.", "label": 1}
{"text": "I got rich to support my family but I got six packs to become attractive mostly for female attention.\n\nI like dressing simple and for comfort but sometimes I wear something fancy to get female attention.\n\nSix packs and above average muscle mass has nothing to do with health or fitness. Yet we do it for attention of females.", "label": 1}
{"text": "That's what onlyfan women say.", "label": 1}
{"text": "Nice admission lol.", "label": 1}
{"text": "What is wrong with your partner? And if it’s just you and a toy you’re not really being smart playing with yourself. I’ve done this multiple times with partners with good care and I am hung ( thicker than long ) and even first time was the strongest orgasms they’ve had. Just let a real man help. Pain isn’t actually pleasure.", "label": 1}
{"text": "Neoliberal brainrot \n\nBecause society wants healthy not in poverty kids, dumbass", "label": 1}
{"text": "From my extensive research on talking to over 2000+ women.\n\nHere are my findings\n\nWomen only count serious relationship in body count.\n\nSo she will say most likely 3-5 range (that's what average 25 yo woman says)\n\nShe will never count the one night stands or other \"it just happened\" moments towards her body count. She will pretend to forget them.\n\nAverage European chick's real body count is over 15 by the time she's 26", "label": 1}
{"text": "Take this profile as an example. There is nothing to say to women who are so far gone on the other side of directly causing isolation and blaming men for how they respond to you.", "label": 1}
{"text": "It’s clear: if you're a stable, grounded man, your life is set on a steady, predictable path, moving toward your goals with consistency. There’s no chaos—everything is planned, with clear milestones along the way.\n\nIn contrast, \"trainwreck\" men live in constant instability. Relationships with them are risky and chaotic, often leaving a woman's efforts feeling wasted. These men invest little in stability and often don’t care if they lose her, projecting a sense of independence or even power that can be intriguing.\n\nStable men, however, might unintentionally come across as dependent or controlling in relationships. Since losing a partner feels like losing an essential piece of their long-term plan—like marriage, kids, and a happy life—it can make them appear vulnerable or even clingy. For many women, this dependence can feel restrictive, as if it's pushing them toward a life defined by societal expectations, at the expense of their freedom and independence.", "label": 1}
{"text": "Lot of women look sick, depressed without makeup.\n\nTheir skin is not clear giving away their shitty lifestl and poor life choices.\n\nTheir under eye circles give away their internet addiction.\n\nTheir fat mid section (which looks like it's 100lb rice bag) tells you they are addicted to dopamine via food so their life has nothing rewarding, no goals no dreams nothing.\n\nWomen will go to long efforts to hide their imperfections, but they'll never make sane choices.\n\nMost women are ghosted in the morning because the man felt like as if slept with a transwoman that night lmao.", "label": 1}
{"text": "You're fucking weird. And that sub is also filled with severely depressed and abused people so it kinda tracks. \n\nBut to have so much hatred for life that didn't ask to be here and that have little to no autonomy on how they take care of themselves? Little humans by calling them crotch goblins? \n\nDoes not make you cool or edgy. It's why you say this rubbish from anonymity. \n\nIts just makes you a fucking weirdo. You're not special. Just damaged.", "label": 1}
{"text": "Wow. Holy manosphere word vomit Batman!  Are you trying to get every single incel talking point into one comment ?🤣🤣🤣", "label": 1}
{"text": "This isn't every man, he's a rare man so I told you his story.", "label": 1}
{"text": "Consent to sex does not equal consent to parenthood … well, unless you happen to be a man. \n\nIt is fundamentally wrong to force a woman to become a mother of a child she does not want. Likewise, it is wrong to force a man to become a father of a child he does not want.", "label": 1}
{"text": "Only dishonest people wear makeup and then compare themselves with men who are wearing none.", "label": 1}
{"text": "Later I asked the woman, she said \"atleast he wasn't a boring man, I am proud to be his baby mama\".\n\nSo no she doesn't hate him, she still loves him to this date.", "label": 1}
{"text": "She drives a forklift now, and during a heated argument online, someone asked her to show her photo. The next thing you know, he pulled a Houdini! People say she’s still debating him to this day.\n\nAt least they have a few things in common!", "label": 1}
{"text": "No one is raging. We are telling how it appears to majority of people watching that clownshow.", "label": 1}
{"text": "I don't just \"say so\"...\n\nhttps://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F9mk1ki7kx9ud1.jpeg", "label": 1}
{"text": "She woke up looking like a cross between a raccoon and a rebel—eyeliner smudged from last night’s ‘one more episode’ decision. Her under-eye circles were practically national monuments, and honestly, who needs concealer when you can just call them 'mystery shadows'?", "label": 1}
{"text": "Nah I'm with you. The people I disagree with are the ones who BOTH want to have \"financial abortion\" AND not assist families via the government - that's just cruelty to children who didn't ask to be born. As long as we're ensuring the mom and child are getting the support they need I'm good with letting men walk away if they want. Probably save some money not having to go after them legally anyway.", "label": 1}
{"text": "Envy does not become you.", "label": 1}
{"text": "Women come into relationships via sheer dishonesty of their makeup laden face\n\n\nNo wonder they get pumped dumped. They deserve it.", "label": 1}
{"text": "Only women are obsessed with baddies.", "label": 1}
{"text": "Completely false \n\nThe difference is huge.\n\nIt's the difference between someone who is sick vs someone who is healthy and fertile \n\nLead by dishonesty and get pumped dumped.\n\nMen do not want sick women with health issues. Women use makeup to hide the marks on their faces, the spots, the wrinkles, the dark circles the eye bags.\n\nYou've to be real dishonest person to say makeup doesn't change that much!\n\nMakeup can make meth addict look like fitness model.", "label": 1}
{"text": "Followers don't mean anything.\n\nIt's just for entertainment. We go to circus to watch clowns, and laugh at them not take them home to our beds.\n\nMehhhh", "label": 1}
{"text": "The quick answer about boring, and the complicated answer about abusive is the weird perspective that completely don’t understand. Abusive is physically and emotionally dangerous. Boring is just whatever, like, none of that. Idk why y’all choose to stay with a dangerous situation but leave one that only probably takes you being a little more exciting yourself.", "label": 1}
{"text": "Just vote for makeup ban.\n\nMakeup is made by child labor in Africa.\n\nIt fills your skin with toxins. When the stuff is taken out from the earth, it always contains the toxins.\n\nWhy risk it? Why can't you guys do without makeup if it doesn't change appearance that much?\n\nWhy waste money and time in it? When you can help out at local homeless shelter by saving that precious time.\n\nNo guys will not because you benefit from dishonesty that makeup is.\n\nKarma wil make you reap what you sow. You'll be pumped and dumped when you'll walk in with makeup on and the next day man sees you without makeup and pulls Houdini on you, then you'll know dishonest people.", "label": 1}
{"text": "He didn't make anything.\n\nWomen can trick men into having baby.\n\nSo he has no control over this \n\nWomen alone should foot the bill of what they get themselves into.\n\nIf they can secure resources from the man on their own, they can go ahead with pregnancy.\n\nOtherwise goverment shouldn't get in way of this", "label": 1}
{"text": "People aren't allowed to lead with dishonesty.\n\nYou are fooling people. You look like you are sick but with makeup on you look healthy with good lifestyle \n\nThat's a huge dishonesty and it's unfair to men who look at woman's face to judge her health and hence outcome for their baby \n\nWomen are causing our future generate to be weak and sick \n\nMen want to select women with meaty thighs and  breast and bright young face without spots, dark circles.\n\nYou are throwing wrench into this selection", "label": 1}
{"text": "Envy for *what*? If I wanted to be needlessly loquacious I wouldn't be so succinct and direct, unfortunately the only kind of waffle I'm interested in involves blueberry compote and lemon cream.", "label": 1}
{"text": "I stated my 'reward pro-social behavior + punish anti-social behavior' in my first post.", "label": 1}
{"text": "How are you such an expert on abusive men? Are you one? Have you experienced one?", "label": 1}
{"text": "Make up companies have vested interest in destroying a woman's skin.\n\nSo that her dependence on makeup grows.\n\nThey'll never give you clean makeup which is also not harmful. That's why not using it is the best policy in the first place \n\nIf a man need to feel excited about by the fakery that makeup is. Choose one with higher testosterone who didn't kill his erection watching too much porn", "label": 1}
{"text": "Most violent men in prison cells all have girlfriends and wife's and several babymamas.\n\nWomen are no judge of anyone's personality. They choose selfishly males who help them get ahead in life. Doesn't matter if they are evil or good or anything.", "label": 1}
{"text": "I watch women who wear makeup.\n\nAre you related to trump btw? You've eye region like that of Trump.", "label": 1}
{"text": "When woman is in love with you and highly attracted to you - you are perfect gentleman \n\nWhen her love fades or new man shows up who she has interest in - suddenly the man is abusive and misogynist \n\nThings they tell themselves to justify their breakup and clear their conscience for destroying a man's dream.", "label": 1}
{"text": "Men like you are good for little else tho...", "label": 1}
{"text": "What if she says it and he secretly keeps doing it. All your comments have this naive worldview that nobody lies and it’s so easy to discern and just leave. Have you ever dated a woman? She’s going to gaslight you, probably unintentionally about some misbehaviour that you don’t like eventually and you cant just definitively say when it represents something you’re not ok with and something you are.", "label": 1}
{"text": "People lie, and if you find out, you leave them. Without any evidence of lying, assuming is just complete and utter paranoia.\n\nI'm happily married, and you lack braincells, so i won't be discussing anymore. As if men didn't lie too, women are the devil, i know, right?", "label": 1}
{"text": "It’s not hard to hide lies. You probably get tugged around by your wife and don’t even realize it lol.", "label": 1}
{"text": "So is best friend energy good or bad to a woman?", "label": 1}
{"text": "Why don't some like it? Do most women like it?", "label": 1}
{"text": "Does best friend energy dampen the lust?", "label": 1}
{"text": "Well you’re a superslut so only cucks would be cool with it. No alphas will tolerate it tho.", "label": 1}
{"text": ">Women are not required to facilitate men's desire for intimacy.\n\nThat's where your wrong, women do have to facilitate men's desire for intimacy, because we are the one taking all the risks for a potential rejection.", "label": 1}
{"text": "“The conversation was decent, you saw the word “Maslow”, you got triggered and started name calling. No need to prove anything to such an emotional person. Just using you for entertainment”", "label": 1}
{"text": "Please, try not to say stupid things. Men already can evade responsibility, so we're spending tons of money to get barely a few guys to fork over a few hundred dollars.", "label": 1}
{"text": "Daily reminder that life is meaningless without sex, your life as man doesn't start until you get laid for the first time, a women's 20's is a sexual playground, being 100% bald \\*AND having a weird head shape is a sexual death sentence and to take your vitamins for the day if you hadn't already.", "label": 1}
{"text": "You’re weird.", "label": 1}
{"text": "Black pill types should be welcomed here with open arms. I believe in loving incels into rehabilitation, not telling them they are not welcome on reddit. Poor form from so called compassionate progressives", "label": 1}
{"text": "Bro, I’m black pilled and always talking about how I need to improve my looks, and what surgeries im goin to get. I know I make “it’s over” jokes, but that’s all for shits and giggles.", "label": 1}
{"text": ">That's honestly the real original Matrix Red Pill or Blue pill question, would \"you\" rather live in the fantasy, fabricated world of the matrix or know the truth. I'd rather be told a harsh reality and decide from there, but I don't think either option is necissarily wrong for anyone to choose for themselves.\n\nI honestly think both red and blue pills are fantasy to some degree and black pill is the closest to the truth which is why I lean that way. If I could go back and unlearn everything I did I would with 0 hesitation\n\n>Personally, I'd rather be one person's five and everyone else's 1, than be just \"average\" to everyone. \n\nI agree but to go back to your original point what persons 5 is going to be a short or fat man? Next to none. Yea for faces what you said is true but its not for everything else", "label": 1}
{"text": "Yeah.  “What is beautiful is good.” This is a well documented finding in the field of psychology.  Men and women tend to have this bias to varying degrees.", "label": 1}
{"text": "https://incels.wiki/w/Blackpill?searchToken=dj3g3a9wf1cj24xynh0m33s2j", "label": 1}
{"text": "I mean at the end of the day race determines appearance and appearance determines attraction.  So I think it’s fair to talk about it but I can see why it can get offensive.\n\nAre there any races you find particularly attractive or unattractive?", "label": 1}
{"text": "this guy gets it. no tolerance for hypocrisy here.", "label": 1}
{"text": "asian men deserve a free pass to heaven for the intense tribulations their women put them through", "label": 1}
{"text": "Bald white men who are struggling, yall might just have to date outside your race. AW are always available. And there’s plenty of BW willing to give an oofy doofy the so called “black wife effect”.", "label": 1}
{"text": "Wow you must be quite desperate that you have to simp so hard to make him stay", "label": 1}
{"text": "Wow this is contentless rhetoric.  \n\nWhat none sense propaganda from a woman who only chased hot guys who face palm here to play XBox. \n\nAnother *you-know-who* chaser.  \n\n\nAlso associates female love with gold digging.  Classic.", "label": 1}
{"text": "I’m sorry that you are too broke to feed yourself hun. Try selling some feet pics.", "label": 1}
{"text": "Is this a thinly veiled transphobic joke? I think someone is going in the icebox.", "label": 1}
{"text": "What's transphobic about acknowledging men's drop in testosterone and decline of masculinity? Its fine to not want to play the male role and be more of a feminine they/them like yourself. Own it queen.", "label": 1}
{"text": "Where did i say I'm living to do that? Im never having kids with a man because no man deserves me making that sacrifice unless he's paying for everything. \n\nYour wife is a loserrr who does everything for nothing in return. I hope she loves her mom bod and stressed appearance since she juggles everything and has to be with a guy who's feminine. I actually bet if you were with an actually attractive women you loved you wouldn't have any trouble providing.", "label": 1}
{"text": "This is precisely the quote they are debunking. Did you fail reading comprehension tests at school?", "label": 1}
{"text": "They saying they still see this in the case if heart problems idiot", "label": 1}
{"text": "If men’s feelings are not women’s responsibility, then women’s feelings are not men’s responsibility. Your fragile femininity is your problem.\n\nAnd, as a pathological lying subhuman, “discomfort” is a mercy compared to the pain and humiliation you deserve.", "label": 1}
{"text": "I haven't made any children in my relationships lmao. Nice try. Where's the mod warning for this little insult?", "label": 1}
{"text": "I wonder if you will ever stop playing financial games because you're deeply insecure hahahaha. I hope you drown in your selfishness when your wife desires a generous man (something you will never be).", "label": 1}
{"text": "25 is a full grown adult. Sounds like you were an overgrown child, as are most women.", "label": 1}
{"text": "Marriage makes men lesser. Submitting and swearing fealty to a weak, lying subhuman with an undeveloped sense of justice and an impulsive desire to maximize its pleasure is nothing but vain weakness.", "label": 1}
{"text": "Exhibit A. You believe that making money is a sign of maturity. Most women are in fake email jobs, with the highlight of their careers being a middle management people shuffling job rather than solving actual problems or doing real work.", "label": 1}
{"text": "> My dad didn’t know you brush children’s teeth.\n\nAnd your fuck monkey of a mother threw her nasty pussy at an idiot. Sounds like you inherited that level of sound judgment and intelligence.\n\n> Women make up half the workforce.\n\nAnd contributed directly to the hard devaluing of labor that has been well documented since the 1970s. If they were generating wealth, that value would not have shrunk.\n\n> However let’s point out that raising children is also labor. Unpaid labor when it’s your own children, and men don’t seem to like providing that labor at the same rate women are expected to.\n\nTake note, gentlemen. The “empathetic gender” views mothering your and her children as unpaid labor. Next, it’ll start discussing friendship in terms of “emotional labor.”\n\n> Thinking abortion is murder is so sentimental and emotion driven. Who cares about a fucking embryo? It can’t feel. It doesn’t have the capacity to even deploy consciousness. Do you also get upset about removing brain dead people from life support? That get you all in your feelings?\n\nYou sound much more emotional on the subject than me.\n\nAnd if helplessness and a lack of higher thought were grounds for justifiable murder, it would be morally defensible to slaughter women wholesale.", "label": 1}
{"text": "I can’t imagine what kind of weak, morally vacuous “man” enjoys giving things to the weak, subhumans, lying fuck monkeys known as women. Most men I know view said provisioning as a tax on the pussy they crave.\n\nThere is nothing admirable or enjoyable about being someone’s credit card.", "label": 1}
{"text": "Speaking of n count, how high is yours after getting fucked as hard as you did in your dry wedding thread?", "label": 1}
{"text": "> I don’t gaf if men find my made up face attractive or not, I just enjoy having long, pretty lashes and full lips. I like looking feminine, I like looking quite different from men.\n\nVanity and a lack of character are common in cum guzzlers. You are no exception.\n\nAnd if your vanity was not validated by the approval of others, even implicitly, then you would not indulge in it like a subhuman.", "label": 1}
{"text": "You are asking a bull if he was a female bluebird, how would he fly. I'd simply refer you to the book of Genesis.", "label": 1}
{"text": "If that fuck monkey was born in 1997, it’s barely older than 25.\n\nAnd it may have a lot more life left, so hopefully it has time to rectify that lack of “too much hurt” with more hurt.", "label": 1}
{"text": "> I’m a nurse\n\nAnd just like that, I can stop caring what you have to say.", "label": 1}
{"text": "Not very uncommon here lmao", "label": 1}
{"text": "Good one", "label": 1}
{"text": "Watch a sextape of your wife with a prior partner and tell me you wouldn’t feel gross", "label": 1}
{"text": "Women don’t love men. They view them as resources, take the wealth they generate, and redistribute it through their family and community (i.e. by donating or volunteering in church functions, etc.). They extend this view of men as walking wallets to their political alignment, which largely favors the redistribution of wealth and the widescale violation of individual rights.\n\nWomen must be coddled and treated like overgrown children. They are pampered, worthless subhumans with no character, and men must be performative in order to maintain their interest. This creates natural resentment, as the man cannot be genuine, lest he be accused of presenting a “false image” when he lets the mask slip.\n\nOverall, cum guzzlers do not feel love for men. They feel impulsive bouts of infatuation and attraction. Nothing more.", "label": 1}
{"text": "This is a moron’s perception of business models. Like saying that grocery stores don’t make money if people are well-fed.\n\nTinder et al want you to find someone using their service. The extra pocket change they get from you by keeping you single is peanuts compared to their broader income and the positive reputation said income necessitates.", "label": 1}
{"text": "If you’re going to ask stupid questions, I’ll treat you like the stupid cum guzzler you are.", "label": 1}
{"text": "Aw, a cum guzzler. Go suck cock.", "label": 1}
{"text": "Cum guzzlers really can’t insult for shit.", "label": 1}
{"text": "Baby every post doesn’t need a response. If nothing in what was highlighted interested you, you could have kept scrolling and saved the essay I didn’t read.", "label": 1}
{"text": "I don’t know what half this post means.\n\nWhoops, you just exposed what a loser you are.", "label": 1}
{"text": "Nobody cares when a dude picks the wrong girl and they blame him rightfully so. But with women we’re all supposed to kneel and coddle them", "label": 1}
{"text": "It is normal to enjoy the idea of a subhuman piece of shit dying, yes.", "label": 1}
{"text": "Why do cum guzzlers have to inject their fetish for being aggressively hate fucked into every interaction with a man?", "label": 1}
{"text": "Yes, cum guzzlers hate being spanked, choked, and used like fuckable meat.", "label": 1}
{"text": "> LMAO yes they absolutely do\n\nBlack Twitter doesn’t count. Try again, dipshit.", "label": 1}
{"text": "By making fun of your embarrassing sexual fantasies. Try to keep up, baby girl.", "label": 1}
{"text": "Stop trying to create sexual tension. You’re repulsive.", "label": 1}
{"text": "Now say it without crying.", "label": 1}
{"text": "Ultra bad take. You're much more likely to get murdered as a single woman than a married woman. Very few men are psychopathic and those traits would be easily detectable by your dad and brothers. In fact, the number 1 cause of murder for woman is EX lovers, not their current husbands. So, getting married as a virgin and not divorcing is the safest choice with the best outcomes across the board from an objective point of view.\n\nYou could say there's opportunity cost in a lack of sexual diversity, or lack of disposable income if the husband is tight with money, but I think these are WAYY less important than a girl having kids in a nuclear traditional family where SHE raises her kids instead of sending them to daycare to be raised by minimum wage gen Z adult children. \n\nSo there is a tradeoff between better outcomes in family and social relationships, and having more financial independence. If I were a woman, I would choose my loving husband that my father approved of and my nuclear family over my corporate boss who doesn't give AF about me and would lay me off if he could make 2% more profit next quarter.", "label": 1}
{"text": "Yes, I’m aware that your advice is terrible. You didn’t need to remind me.\n\nThere is zero benefit to making friends with women in the context of dating. It will not make you “more comfortable” with flirting, as flirting is an escalation that makes it clear that platonic friendship is off the table. “Increasing your social circle” can just as easily be done making friends with men, who, unlike women, make good friends.\n\nYou are incredibly stupid, and any young man reading your posts needs to be warned away from your terrible, dogshit advice.", "label": 1}
{"text": "Lol you’re Here 24/7 doing the exact same thing.", "label": 1}
{"text": "That's very true, on one hand yes people naturally like attractive people better and treat them better (It's questionnable but it's the reality of life and we can't bend the fabric of it) on the other hand no I would say it's not ethical at all to base your judgement on someone fully based on how attractive that person is, and women do that all the time, exa : if you are a good looking guy and approach women chances are you'll get their numbers or at least won't get rejected right off the bat wheras if your less attractive they will label you as a \"creep\" instead which is wrong.", "label": 1}
{"text": "What a mind numbingly stupid assumption. Holding conversations isn’t difficult for men. Finding women that are receptive to flirting is. Absolutely nothing is gained for those men by suppressing their urges and befriending a lot of women to “get comfortable” with their performance as a social eunuch.\n\nAgain, you show that you have no business giving advice to any young men struggling with dating.\n\nI accept your vocal departure from this engagement as a concession.", "label": 1}
{"text": "What I can resist and what I choose to resist are very different things. I make a conscious choice to alienate and antagonize as many “people” as possible.", "label": 1}
{"text": "I'm kind of seeing why you're 30 and unmarried.", "label": 1}
{"text": "Yes, 12 year olds love using a shitty astroturfed website like Reddit to discuss gender differences.\n\nThe female brain, cum guzzlers and gentlemen.", "label": 1}
{"text": "Cognitive dissonance is the discomfort a person feels when their behavior does not align with their values or beliefs.\n\nYou’re pathetic dude. Go cry in your mom’s basement you emotional baby.", "label": 1}
{"text": "Feminized, low testosterone behavior in your father. Typical cum guzzling tendency to keep doors open from your mother. Nothing unusual here.\n\nYour parents are mediocre losers, and it will be funny when the first one dies and the other has to cope.", "label": 1}
{"text": "What reading comprehension? You want to be hypergamous but claim you’re not because you deserve it. What is there to misunderstand? You’re just jumping around trying to be cool and elusive but you just look dumb.", "label": 1}
{"text": "You must have missed the memo. Lots of men have reported in on the difficulty of being a stay-at-home-dad ever since women pulled the plug on their homemaker monopoly. It’s piss easy, and more boring than anything.\n\nTry again.", "label": 1}
{"text": "[removed]", "label": 1}
{"text": "> Well...she's right about it, isn't she?\n\nMy fucking sides.\n\nCum guzzlers and their “ocular pat downs.”", "label": 1}
{"text": "Must be a chad Adam lol 😂", "label": 1}
{"text": "Or the better looking one lol 😂", "label": 1}
{"text": "A cum guzzler having a woman moment and using the internet to make friends. What a fucking loser.", "label": 1}
{"text": "Ok but you would go for the more attractive guy right lol 😂", "label": 1}
{"text": "Omg, I'm definitely seeing why you're 30 and unmarried.", "label": 1}
{"text": "You're a big baby. I wasn't even trying to say anything about you initially, but since you decided to make it about you idgaf anymore. You suck at having an objective conversation.", "label": 1}
{"text": "Defeating an argument by demonstrating its absurdity is not an endorsement of said argument, you drooling moron.", "label": 1}
{"text": "Ooh, is this the part where a cum guzzler quietly reports me instead of fighting its own battles?\n\nI love when the weakness inherent to cum guzzlers is made self evident.", "label": 1}
{"text": "😂😂😂", "label": 1}
{"text": "Yea you’re right I conducted the study and made an excel graph this morning, troll.", "label": 1}
{"text": "You do realize you’re arguing with a beta who women don’t show sexual interest in?", "label": 1}
{"text": "I agree 110% but for different reasons.\n\nWomen need convincing to have casual sex. Men don’t.\n\nMen who want casual sex bad enough put in a ton of work on their appearance, living arrangements, and often lower their standards to get it. They get good at it, and they find women that are at an emotional point in their lives where casual sex may be on the table if the stars align. And then the men make the stars align.\n\nTherefore it makes perfect logical sense that more women have occasional casual sex with fewer men who have the game down.\n\nMost women rarely have casual sex. But rarely is NOT NEVER. Women go on vacation, have flings, go through “hoe phase(s)”, just got out of relationships, etc.\n\nMen either can’t get it 100% of the time, or they do the work and then cash in on the rewards… often lowering their standards to do so.\n\nAsk me how I know…", "label": 1}
{"text": "Love how all the women and beta males are triggered. Truth hurts", "label": 1}
{"text": "yeah, I have 8 nieces and nephews. I take them out a lot whenever they come over my house. Strangers will literally come up to me and hand my good looking nieces and nephews free toys, candy, gifts etc. Like it legit is so common and there's a striking difference between when im with my more attractive nieces and nephews and my average looking ones. It really does blackpill you to how humanity works and its from such a young age. The crazy thing is we are all operating this stuff subconsciously. Like I bet the people giving my pretty niece gifts or compliments probably just genuinely believe they are good people or being polite/kind. I find it depressing tbh.", "label": 1}
{"text": "You're voting for Trump aren't you?", "label": 1}
{"text": "Yeah, yeah you are.", "label": 1}
{"text": "Chad is just a fictitious scrote men desire to live vicariously through. Which is why they invented the harem idea.", "label": 1}
{"text": "ur a boy not a man", "label": 1}
{"text": "the problem of \"delete all inc3l talk/inc3l subs = all inc3ls just go to fucked up places like inc3ls .is\" is very real. that actually just literally happened to me as, in the wake of most of my irl friends getting laid, I wanted a relatable and consistent community for my dating struggles, only to realize they've all been nuked besides .is. I went and didn't last long because those guys are just a tad more psychopathic than me, but now there's nothing. tbh I don't belong there either because I got laid once, but honestly if you dig deep enough most of their mods have gotten laid too", "label": 1}
{"text": "Would", "label": 1}
{"text": "still patiently waiting for the inc3l uprising that the feds are trying to warn us about", "label": 1}
{"text": "You delete your comments bro. It’s one thing to be embarrassing online, it’s another to be aware of it. God you’re such a loser.", "label": 1}
{"text": "![gif](giphy|DhrZnPBCmX9yo)", "label": 1}
{"text": "Just smart", "label": 1}
{"text": "Yet you do know in most countries you are in a de facto relationship with the same ramifications?", "label": 1}
{"text": "I did have an \"argument\" with you today where I asked why it was relevant to point out that a man started the man vs bear thing and your \"winning\" argument against that was \"Because it’s often characterized as a witch hunt which it wasn’t.\"", "label": 1}
{"text": "Then why don’t you respond there to my last two points instead of bringing it here? Seems like something a loser might do", "label": 1}
{"text": "I wonder if manic_scat_core stans any make kpop idols. Why would you watch Korean dating shows if you’re not into that type of boy", "label": 1}
{"text": "My experience is probably different from others because I'm older (64) and widowed (married 33 years)\n\nI have thought about this and ... no, when I  meet a woman with dating intent I do not think we're going to end up as \"friends\" if we don't become lovers.\n\nFor most of my life, being married and faithful of course, I did not have women \"friends\" who were not my sister, sister-in-law, spouse of one of my guy friends, or a female workmate with whom our friendship was only while at work.  It would have been inappropriate for me to do so, I think.  (*And I'm sure my late wife would agree!*)\n\nBeginning with the first date, if a woman does not show a continuing similar level of romantic interest in me as I have in her, I break it off.   I'm looking for a steady girlfriend at minimum (*the idea of remarriage is an open question for me\") - not a hookup.  Not a friend.   How's it going to look to future women I might date if I hang out with a woman I previously dated and had a romantic interest in and tell her \"*Oh, she's just a friend\"*?   I'm guessing that's not going to play well.  Other than my wife and future significant other, I don't really need women \"friends\" with whom I do not have some other platonic connection with as described in the previous paragraph.", "label": 1}
{"text": "man needs this, that, needs to be like this, behaves like this, dresses like this\n\n\n\n\n\nwoman needs:", "label": 1}
{"text": "It's crazy how men have to do 501 things to be even a little attractive to women.", "label": 1}
{"text": "yeah it really sucks that in so many countries, men can’t leave their house without a female escort or have to cover their heads and can’t speak in public or access education and healthcare \n\noh wait", "label": 1}
{"text": "Nice strawman. It is a pity it has nothing to do with the index or my post.", "label": 1}
{"text": "For the life of me, I can’t understand why this isn’t common sense. I think it’s because most people have less than 5 partners and don’t know how casual dating and hookups work between 2 people that didn’t know each other prior.\n\nWomen are way more often choosing who they want to have sex with, they can usually hand pick. You ever see a woman on a dating app, if she’s halfway cute it’s an entire catalog of choices to her. There’s too many guys that are too easy to stop women from having who they want casually. So they pick guys that have more sex, because players are more desirable.", "label": 1}
{"text": "Repeatedly posting the same stuff isn't a series", "label": 1}
{"text": "So you're mad that women have babies and men don't, but women's stats surrounding pregnancy and birth are good indicators of a woman's status within a society in relation to men.\n\nI say this because nothing you presented actually refutes the metrics as good indicators, you just don't like that there's nothing to put against the fact women have babies...", "label": 1}
{"text": "Different bullshit, same bullshit", "label": 1}
{"text": "Tell me you are a feminist without telling me you are a feminist :D", "label": 1}
{"text": "Most of this data is biased to favor women. The same thing happens with \"women doing better in college, having more education\" when you investigate well you will see that the massive amount is in nursing courses, teachers or Human Relationship Course... at the end of the day, a delivery man without higher education will earn the same as these women. \n\nSuccessful women such as wealthy businesswomen, doctors and CEOs are as scarce as men of the same power.", "label": 1}
{"text": "Again, nothing you presented actually refutes those as good metrics to gauge how women rank within a society compared to men\n\nIf you want to pretend to be an intellectual, you're going to have to actually show data that using those metrics is leading to a bad result. The lack of a comparable metric for men just shows an inherent difference, but doesn't at all equate to the data and results being inaccurate.\n\nYour response is further evidence that you're just big mad that women having babies is a good indicator and that this indicator makes a strong case for inequality.\n\nYou tried to buy the pot, by throwing the data and links in there, don't get salty I called your bluff...", "label": 1}
{"text": "I did read it.\n\nIt's the same stuff, regardless if the index is different \n\nSame woe is me, women are awful tropes you always post", "label": 1}
{"text": "Most short guys get black pilled when they get rejected by the homely girl they have a lot in common with\n\nand the tiktok caption says it all\n\n\"gave a chance\"\n\noh so now im indebted to you because you \"gave me a chance\" \n\nso kind. i guess i better step in line because im so fortunate to be given a chance!\n\nhonestly this is why i cant anymore, im way too old and tired for that weird power dynamic game, from now on bitches are lucky im tolerating THEM.", "label": 1}
{"text": "The metrics used to compare men and women don't have to align perfectly to get an accurate result. This is a more complex concept than apples and oranges in a bag, which may be the problem here for a lot of y'all.\n\nIf you believe the results aren't accurate, you would have to demonstrate that the metric themselves are bad beyond them simply not lining up all neat and pretty for y'alls spectrum locked brains\n\nWomen have babies, men don't. To not include that data because it's not a straight across comparison would result in inaccurate results.\n\nThat is unless you believe that metric ( maternal mortality and adolescent age pregnancy) is not a good indicator of the quality of life of women in a given country. At which point you would present data to back that up. \n\nThat has not happened, of course...", "label": 1}
{"text": "You follow the exact same copy of any dumbass who thinks that [ insert any group ] are sheep. You dumbasses are just losers who can't come to terms with it. So you try to create these scenarios where you are better than whoever you are jealous of. Which is extremely cute.\n\nFor example, me pointing out the incredibly obviously makes you believe I am karma farming. Because I shit on a group who is popular to hate. Instead of what is really going on, which is me shitting on a group who shits on others and are insanely obnoxious and delusional. Which makes them a incredibly fun target.", "label": 1}
{"text": "Women in Sudan are literally killing themselves just to avoid rape. That tells you all you need.", "label": 1}
{"text": "What!!!!\n\n\nYou got to he kidding me, OMG, LMAO!!!!\n\n\nAre you stupid?", "label": 1}
{"text": "U a weirdo bruh", "label": 1}
{"text": "You’re an idiot. You’re acting like he’s handing her bread or something. Sex is an exchange of both partners having the agency to speak up about what pleases them equally. \n\nWomen HAVE to start being active agents in their own sex lives. Instead of star fishing/ and mute mode and being upset they didn’t enjoy it.", "label": 1}
{"text": "You definitely trollin", "label": 1}
{"text": "It’s not that I don’t have an argument it’s just the fact that you’re incredibly weird When the guy says dead fish he doesn’t mean a literal motionless being, he is exaggerating it’s that simple idk how you resorted to rape you just fucking weird bruh", "label": 1}
{"text": "Yup. Swap the levels of average attractiveness around, maybe the libido as well, and the dating landscape looks the exact same but the other way around. Men and women aren't anywhere near as different in behaviour as they are in starting positions.", "label": 1}
{"text": "Ye you a troll", "label": 1}
{"text": "I thought I had you blocked.", "label": 1}
{"text": "I have no problem being friends with unattractive women.\n\nThe main usse I think, is that female friends often end up demanding as much of my attention, time and closeness as a partner, despite not being one. Its hard to set boundaries to the level of friendship you want to engage it, unlike sex where everybody understand that no means no.\n\nMany times, I have been in the awkward situations where I was single, friends with a woman, and had to explain to her that while I DO like her as a person, she is asking too much of me. We are close, but not THAT close, unless sex is involved. THere is a whole host of things Im not doing for a woman, unless we are sexual partners.\n\nAnother thing is; if she and I are just friends and not fucking, then she is a dude to me. I do not beleive in treating women in any special way, different from the way I would treat a fellow man, unless she and I are intimate, and intimate a lot.\n\nThe whole \"treat her like a princess\" nonsense feels like moronic sexism to me, but I can do it if the \"princess\" turns into a cock hungry nympho in the evening. Nobody else gets the special treatment otherwise, no chivalry etc, but everyone gets the same respect I would give another dude.", "label": 1}
{"text": "Based.\n\nMy only nitpick is that the current situation punishes men a bit more, and thus is creating a form of social imbalance. This imbalance will have a lot of social, cultural, economic and populational repercussions. It will ultimately also lead to the culture swinging towards the other extreme.", "label": 1}
{"text": "And you will keep seething here hoping that she does it just because you can't accept consenting adults in a relationship.", "label": 1}
{"text": "And mind your oen business. Why are you white-knighting for this man? You his boy toy or what?", "label": 1}
{"text": "And you are the lesbian lover of his girlfriend? I'm here doing the same as you are. And i'm entertaining myself with you raging over a normal relationship.", "label": 1}
{"text": "You're a black pilled loser who wants other people to be as toxic and miserable as you are. Now get the fuck out of my inbox.", "label": 1}
{"text": "Simply agreeing with one of the most niche, censored, and hated theoretical positions on possibly, the entire fucking internet is not sheepish in the slightest.\n\n\nThe redpill/blackpill isn't a \"group\", remedial fuckhead, saying that implies slowness. Tired of explaining this shit.\n\n\nYou being an easily impressionable follower makes you a sheep not me. The fact that you have sooo much karma shows that you clearly value the validation of other easily impressionable soys and big brother zog bots. \n\n\nTargeting people who are \"inferior\" to you merely based on lack of social/sexual standing is pathetic as fuck, and feminine as fuck nonetheless. ", "label": 1}
{"text": "We are talking about matters of the heart here. Do you have actual human feelings or are you a selfish robot?\n\n\nAnd dude I don't care about your answers. You are a bad person and I'm telling you that. You are ruining another person's life to flatter your own ego and you should have remorse and stop doing it.", "label": 1}
{"text": "Look how easy it is to trigger you. It's almost like you believe the bs ur saying lmao.\n\nAnd you are surprised why it is so fun to mess with losers like you?\n\nI love that you take people agreeing with what I am saying occasionally, as me caring that they do lmao.\n\nAnd no one cares about people punching down when they ask for it. If you can't handle the heat get out of the kitchen.", "label": 1}
{"text": "Your obsession with \"losers\" is just pathetic as fuck simple and plain. I know guys who get way more ass than probably everybody up here and they definitely not doing none of that corny lame bullshit you're on.\n\n\nFor critical thinkers, it's quite easy get banned on this shythole, and downvoted to hell, especially if your point of view doesn't align exactly with the expected dogmas from society/the status quo. If you thrive, well good for you.\n\n\nAsking for it? Yeah because nikkas who have been through bullshit from \"people\" like you are supposed to kiss ass or something. Nah, fuck that. ", "label": 1}
{"text": "And why should I care about that in the slightest?\n\nAlso critical thinkers? Buddy you couldn't even if your life was depending on it. You are just bitter that you can't get your dick wet. And angry that people downvote you for being a toxic and unlikable loser lmao.\n\nOhhhhhh sorry my bad, critical thinkers censor them using the n-word 😂", "label": 1}
{"text": "You clearly do care, that's why you been on my dick so hard, for the past 2 days, goofy. Bro go do something productive.\n\n\nI don't give a shit about downvotes. If I did, I'd be like you typing a bunch of bullshit. ", "label": 1}
{"text": "Yeah I clearly care about it instead of laughing at you. Also 2 days? Damn you really are brain dead.\n\nFor someone who doesn't care about downvotes you sure talk about it a lot.\n\nAnd what is there to worry about? That it has only seen your right hand?", "label": 1}
{"text": "I used downvotes as a mere talking-point. Stop being a simpleton.\n\n\nYou're weird and gay.", "label": 1}
{"text": "I knew it would bother you and your little friends", "label": 1}
{"text": "You are obsessed with reddit karma. Which is beyond pathetic lmao.", "label": 1}
{"text": "I talked about \"karma\" because you're a sheep. Really no much to it.", "label": 1}
{"text": "Why? You literally mentioned it every other message you sent me lmao.\n\nIt's clear that for some reason you care 😂", "label": 1}
{"text": "I talk about karma since it relates to the argument.\n\n\nIf I actually cared, I could easily go shit-posting and trolling virgins like you do, simp.", "label": 1}
{"text": "Reposting this in the new thread.\n\nHonestly I think average men and women both have it bad when it comes to modern dating. Hear me out, it's the millennials and late Gen Z that seem to have really been hit with a lot of factors that just making dating hard for both of them.\n\nThe first being that average women do have access to casual sex with attractive men who won't date them and while it may be better then having no options it still leaves many women unhappy, not saying certain women aren't happy with just hookups but at least from my personal perspective most want to be in relationships or married to men they are attracted to.\n\nThe next is that the biggest reason many young women don't find men attractive is that young men don't make enough money due to how badly the economy is for new grads. If a man wants to have a good salaried job, house, good car(0-5 years old), and no debt that is a lot of work and only those who went into good fields at the right time or had parental support will be on this track and typically it takes longer for men to hit their stride with most of my older male friends only fully moving out and into their own houses in mid to late 20s and often with support for a down payment or some other support measure.\n\nThe next issue is that third spaces have been eliminated and their is now a lack of grace when it comes to young men showing interest. I'm not talking about guys who are cat calling or sending unsolicited pictures on social media or dating apps, many guys are pretty awkward since they don't have experience with approaching/talking to women and I don't really know how to address this problem but I still think it exists.\n\nAny disagreements or things people would like to add?", "label": 1}
{"text": "The answer is seek therapy.", "label": 1}
{"text": "When did I it means zero sex lol", "label": 1}
{"text": "It matters when guys don't pass look threshold .It is something they compensate with", "label": 1}
{"text": "“men are romantics pretending to be realist's and women are realists pretending to be romantics”", "label": 1}
{"text": "![gif](giphy|3oz8xLd9DJq2l2VFtu)", "label": 1}
{"text": "Make yourself desirable enough, and most of the bullshit other guys have to deal with won’t apply to you.", "label": 1}
{"text": "Generally speaking, married people tend to be happier than single people. This is regardles of gender or sex.\n\nThe most damaging thing that is causing so many problems with younger generations is believing they don't need a partner to be happy. That's one huge thing is damaging relationships.", "label": 1}
{"text": "Well those things are requirements I agree. I meant more for hobbies, lifestyle, values, communication and conflict resolution styles we are more compatible. Whenever I didn't match in those areas with men the expectation was *i* would be the one to compromise.", "label": 1}
{"text": "Or they could just not bother us. Like I said, what you're describing is behavior I'd only tolerate from a child.", "label": 1}
{"text": "But you don’t need a partner to be happy.\n\nIronically, one of the best things you can do to make yourself a better dating prospect is finding out how to be happy on your own.  People like being around happy, fun, content people.", "label": 1}
{"text": "I would argue that as a man in today's world the moment you start chasing desirability and being enough, you're ripe for getting abused and manipulated.", "label": 1}
{"text": "Lol", "label": 1}
{"text": "![gif](giphy|MZQkUm97KTI1gI8sUj)", "label": 1}
{"text": "That's why I said married people are *happier*. That's a well-stablished fact.\n\nThe mentality that we're creating for relationships is more damaging that most people think it is.", "label": 1}
{"text": "You really don't need a partner to be happy. Your own happiness and worth should come from within. A partner is a great inclusion into your life. But getting with someone for the sake of I JUST NEED someone is ultimately more damaging. And perpetuates a lot of harmful things in relationships. And some of the stuff I put up with because I thought I needed a partner was absurd. The disrespect was hardly worth it. And finding that worth within yourself that you deserve better and someone who adds to you instead of takes away is way better but you may be alone longer. \n\nThere's definitely nothing wrong with treating chemical imbalances in your brain? I think our work til you die hellscape is more depressing than not having a man.", "label": 1}
{"text": "Spot on.", "label": 1}
{"text": "Most studies done show otherwise, go ahead and google it, people are happier married and there's nothing wrong with acknowledging that.\n\nI believe that denying that is more damaging than people think. \n\nSome types of depression can be the outcome of lonelines. You're not going to fix loneliness with a drug.", "label": 1}
{"text": "I share this experience. Women don't put effort into relationships.", "label": 1}
{"text": "I’m sure there are some — I just don’t think the quality of companionship I’m looking for is easy, common, or convenient.", "label": 1}
{"text": "What mentality is that?", "label": 1}
{"text": "I like the things you say.", "label": 1}
{"text": "Yep, it seems to be a pattern that increasingly young woman have less interest in being “locked down” to a relationship or marriage. \n\nEvery time I see “men want sex, woman want commitment!” Or that men are outraged about being “forced” to trade commitment to get sex I wonder if they are beating an increasingly dying horse. \n\nI don’t necessarily think it’s about emotional or mental health though, I think it’s simpler than that: \n\nI think if you consider a life path as a set of stepping stones where you just hop from one to another, then the range of stepping stones on offer to jump to next simply got bigger.  The factors forcing you to jump at all also decreased.   A lot of young folks are choosing to not jump, or take an alternative route, or circle back around and jump on that stone later.", "label": 1}
{"text": "In other words \"relationships and the maintenance are now mostly based on how women **feel** about it.\" They're happy to wait until the FEEL like choosing the one they actually want.", "label": 1}
{"text": "Individualism and egoism.\n\nI believe If you've reach a certain age where you still are \"holding\" and all potential partners are not \"up to your standards\", there's some narcisism and egoism going on with you aswell, which eventually leads to unhappines.\n\nMental issues will only get worse and worse with future generations.\n\nAnd again, this is regardless of sex or gender.", "label": 1}
{"text": "A relationship takes two to get into, not just a woman.", "label": 1}
{"text": "That’s a lot of words to say you’re shit in bed.", "label": 1}
{"text": "Women blame men for desensitizing themselves with “death grip” and then go home to use their earthquake vibrators and Pringle’s can size dildos", "label": 1}
{"text": "Your body your problem.\n\n\nIt's funny but last time I checked, women don't say that erectile dysfunction is because of them. So why should men be blamed for women unable to orgasm? \n\n\nWomen numb themselves with their toys or just expect men to do everything in bed then blame men if it doesn't result in what their want.\n\n\nMen make themselves come even when many women just starfish so women should do the same and be responsible for their own orgasm.\n\n\nBut no: if she can't come it's his fault, if he can't come it's his fault too. Typical avoidance of personal accountability by women.", "label": 1}
{"text": "Women that have numbed themselves with vibrators is on the list of not relationship material for me. No one could imagine a guy that is told do this, and he says no. Men very much enjoy giving women orgasms, but it’s not a high priority for women every time. There’s a big orgasm gap, but it’s working at peak efficiency.", "label": 1}
{"text": "Ha yea, not that many women but yes def.", "label": 1}
{"text": "that's not entrapment that's you wanting to be a hypocrite and not being called out for it.\n\n>Sex produces children, transmits STD’s\n\nif you are stupid about sex then yes it will\n\n>lowers a woman’s SMV (according to red pill men, not to me)\n\nwhich is also why I also say lie\n\n>the woman already spent a few hours of her time with a full face of makeup for that meal.\n\nfor every added millimeter of makeup a woman adds increases a man's happiness. lol what is this?\n\n>At most, you lose like $50. You won’t have a surprise baby from this. You won’t get an STD from this.\n\nI think you need to brush up on your biology here\n\n>Also, in your story in OP\n\nyeah I was responding to you. no one wants to be used, no matter how you try to phrase it. rather than be a normal person and recognize using someone for a free meal or sex is wrong you try to justify one.", "label": 1}
{"text": "So she isn’t a stay at home mom. \n\n*which is why i would not want to date you and my method worked*. \n\n\nYou trying to be all anime rage doesn’t mean anything. You got what you wanted. I get what I want. It works out. I have my filter. It isn’t bad to filter out people with opposing values.", "label": 1}
{"text": "You sure talk a lot.", "label": 1}
{"text": "This was my experience dating women late 20s-30s mid. They all complained about men not committing. All complained about bad exes. Yet none of them wanted a serious relationship. They all had no issue sleeping with me. No issue being used for sex. No issue being in situationships even if the men were married. Demanded my time and attention. Even after ghosting me come back wanting sex or dates. But all cut me off the moment I started being more serious. Brought flowers? Ghosted. Planned dates that were more than just sex and required more effort? Gone. Talk about being exclusive? Gone. They constantly went back to the exes as well. Or they would go off with some fuck boi bartender that was using them for sex.\n\nIt didnt matter if these women were educated. Didnt matter if they were liberal virtue signalers. Didnt matter if they were clubbers or anime nerds. The moment you start to date with Intention all these women just up and vanish. And continue to complain about men not wanting to commit. Women even complain about men not wanting to get to know them while at the same time not wanting anything serious. Like why would a man invest in a relationship that wont go anywhere?\n\nOne date I wont forget was a woman who started dating because her Ex wanted an open relationship and she didnt. So her solution to that? Was to reject me after our first date because I said Id rather date with intention and treat her with respect from day one. Build good habbits from the get go. But she just wanted to date and sleep around. Which begs response... Why break up with your ex? She couldve stayed with him and did EXACTLY shes doing now. She tried to hook up with me that night and I turned her down and went home.\n\nOver that timeframe of dating I went from wanting to get to know people. Going on actual dates and doing activities. Doing hobbies together, planning nice things. Taking the time to reply and make time to spend with them. To just going over for sex and not really even talking to them. Not caring about their lives because it was all meaningless conversation. And doing so I was rewarded 10 fold when it came to getting laid.\n\nI stopped dating about a year ago because i got tired of bothering. Tired of shallow sex. Tired of getting STD testing done everytime these women ghosted me because none of them could stay consistent. Tired of faking like i cared about their BS drama. Life improved for the most part. And these women still randomly reach out for hookups but I dont even bother replying anymore.", "label": 1}
{"text": "You don’t have a good answer so you keep trying to come up with clapbacks.", "label": 1}
{"text": "Oh…. I thought that is what the fine traditional red pill men wanted.", "label": 1}
{"text": "CMV: The obsession certain men have with body count and single mothers is rooted in male insecurity. Why should it bother you that a woman had her \"fun\" with someone else? She's with you now and you can enjoy her company for a longer period of time. The only reason that would be off-putting is if you know she could do better and are worried that she might do so. It's better to be the prince at the end of the road than the frogs she only spends time with temporarily...", "label": 1}
{"text": "The only thing ridiculous here is that you think and project that unattractive men have any options looking for them in western society.", "label": 1}
{"text": "A preference for dick, yes.", "label": 1}
{"text": "Saying “you sure like talking a lot” is trying to make a clapback.", "label": 1}
{"text": "100% agreed. Not only are you the smartest man on this sub, but you are the smartest man here on Reddit. You might even be the smartest modern man to exist right now in 2024. \n\nWarning: The autists here are going to argue with your comment. \"How dare you ask men to be protectors and act like men!\"", "label": 1}
{"text": "You think I’m AI because I’m speaking facts wow our society really is doomed", "label": 1}
{"text": "Congratulations. You are one of the very few self-aware ones. Consider yourself lucky. \n\nMost of the autists here on Reddit will continue to bitch & moan arguing why they should have to \"do this and that\". \n\nIf they don't want to act like men, then those same men should find a loud mouth, dominant, controlling woman with a butch haircut to date. Except...most of them do not even want those women. They want the exact opposite.\n\n But yet they still cannot figure out why most feminine women are attracted to masculine men.", "label": 1}
{"text": ">Stop calling women sluts and more women would be willing to risk orgasmless sex for men that could potentially decide to kill her after for funsies.\n\nNo they won't, they'll make it even more exclusive for the top guys. Slut shaming is the reason why average guys have somewhat of a chance if they wait long enough. And the chances of getting murdered reduces vastly if you actually started to care about personality and not rationalize your attraction to just looks.\n\n>Like yeah, if a women is risking: bad sex, being slut shamed, pain, humiliation, rape or other unpleasant things\n\n>Would you risk it with the super sexy hot guy with a huge dick who your friend told you made her nut 5 times?\n\n>Or average joe shcmoe who will also pump and dump you but you get the added insult of not being able to show ur girlfriends pictures of him and going : but look at him tho and them nodding in agreement.\n\nCongrats on such convenience and lack of better options lol. And isn't it pretty shameless to expect the \"average joe shcmoe\" to not slut shame. I sure hope he does more legally wrong to women who disqualified him and his sexuality.\n\n>crazy but she's so hot I'm cool with it is a thing\n\nYou've already said that women don't choose \"average joe shcmoe\", so this quote is definitely from the chosen ones. You reap what you sow.\n\n>I for one am alll for dismantling the patriarchal, white supremacist, colonial based ideas of beauty, but I don't think that's something most of the men complaining want\n\nAre you brown guys, small dick guys and short guys exclusive? if yes, then I'm sorry for being rude above. Else you're a hypocrite like most anti patriarchy feminists. Majority of the men on this planet aren't white, why wouldn't we want to be perceived as attractive lol.", "label": 1}
{"text": "One can figure it out and still complain. Plenty of women complain about mere existence of male heterosexuality, what men want and how men act.", "label": 1}
{"text": "Why are you forcing him to do oral if he doesn't want to? And what's this homophobic insult that if he doesn't like eating pussy then he must like dick.\n\nIt's his preference. He can't force her partner to do oral on him and if he does she's free to leave.", "label": 1}
{"text": "Wtf? Why does it make you wanna kys?", "label": 1}
{"text": "Awww did chronically unfuckable hit a lil too close to home?", "label": 1}
{"text": ">Men very much enjoy giving women orgasms\n\n\nOnly if he cares about her. If not, then no man gives a shit and rightfully so since most women think that allowing sex is all they have to do, hence the common starfish and other pity sex.", "label": 1}
{"text": "that's one of the things i find hilarious the most. guys say they like being \"chased\" but forget that they need to present themselves as something worth chasing to the ladies that are actually willing to make the effort to initiate conversations.\n\neg. i like to arrange group events sometimes. but if anyone spends that whole time acting grouchy, i'll get the \"hint\" not to bother to invite them to future events.", "label": 1}
{"text": "You think these guys have hobbies besides video games and porn? \n\nOr friends and family they regularly go out with?\n\nTheir at home on a computer all day eating cheese puffs, making up new ways to dehumanise woman. \nThat’s why their profiles look like that. They want to do minimum effort, not change anything about themselves or their lifestyles but still expect a 10/10 Stacy one day because of *natural male superiority*", "label": 1}
{"text": "> I dont know why guys have empty accounts or just say “HMU about anything”. Most of them are not hot enough to pull that shit off. Some women will have hundreds of guys liking them, how about you something to stand out?\n\nI REPEAT\n\n> Most of them are not hot enough to pull that shit off. ", "label": 1}
{"text": "They won't. They treat it like a penny slot machine. They put in minimum investment/effort and pull the lever. So taking better pics, more thought into their bios, doing things that appeal to ladies would be a lot of work. When they are only putting pennies in. And then they wonder why they aren't getting matches or hits. \n\nThey have this power fantasy of being masculine and showing that masculinity. The muscles, the car, the deadpan facial expression while holding a wad of cash, a dead animal of some sort (hunting pics/fish pics), gym photos. Is going to entice some woman because it's what they think is attractive for women. Being nonchalant about bios and prompts. \"HMU just ask\" \"My greatest talent is getting my hoodie back after you borrowed it\" \"I would really like... .to get off this app\". \n\nYou hear it here all the time. That ladies all want a 666 man. It's like the ultimate men's fantasy. The \"Chad\" is another character made up by men. He is appealing to men. He's what men see attractive men like. And it's so much more diverse than that. I think breaking away from the uniform cookie cutter idea of what \"women like\" and instead showcasing who YOU are as an individual would come in handy a lot more. Than just oh look at my car. Look at this sweaty grainy hiking photo where my face is covered.", "label": 1}
{"text": "THANK YOU! Some men have the communication skills of an 8 year old. Never asking you questions back about yourself or doing anything to keep the convo going, it’s like what are you even doing here?", "label": 1}
{"text": "You can misconstrue words all you want, half of women love love love rough sex with some force to it. You start acting like a pussy orgasm magician and they’re likely to get turned off.", "label": 1}
{"text": "Can you say more nothing please? It’s fascinating.", "label": 1}
{"text": "You’re quite upset it seems.", "label": 1}
{"text": "> Indiscriminate swiping definitely trains the algorithm to drop them down the ranks\n\nNo, it does not. This is a myth perpetuated by morons regurgitating what they read on the internet. Morons like you.", "label": 1}
{"text": "Just because you think black pill rhetoric disgusting, doesn’t mean it’s not true.", "label": 1}
{"text": "Repulsive. I can’t imagine how worthless your dipshit fuck monkey of a brother is it it needed help from a cum guzzler to curate its profile.", "label": 1}
{"text": "I don’t give cum guzzlers “chances.” They’re lying, worthless subhumans. I’ve fucked a few, and younger cum guzzlers are usually easier to deal with. Older cum guzzlers are riddled with ego problems, usually after they get a promotion to manager and believe their “big girl job” shuffling people around at paper companies entitles them to the cream of the crop.\n\nAvoid these cum guzzlers except to fuck with and humiliate them.", "label": 1}
{"text": "> By the algorithm, yeah it does harm their situation.\n\nNo, it does not. You are basing this on false information, or the low probability that dating programs will flag your profile as a bot. This is easily circumvented by swiping left on obviously fake profiles.\n\n> It also gives indirect harm in allowing them to be lazy, and not actually work on themselves.\n\nDraw me the causal map your room temperature IQ developed where an approach to dating which, in your view, results in less success, somehow enables laziness. I’m dying to see what you come up with, dipshit.", "label": 1}
{"text": "I haven't laughed on this sub since the day I came here. This is gold. 😂😂😂", "label": 1}
{"text": "Why you would assume a virgin guy can't figure out of his own what he needs to do without you teaching him?", "label": 1}
{"text": "“OMG! I JUST FOUND OUT SUGAR DATING EXISTED! IM BLACK PILLED FOREVER!”", "label": 1}
{"text": "Usually virgins are not like you have described them. Usually they are good men. Most arrogant guys have no problems in attracting women imao.", "label": 1}
{"text": "Really low IQ answer. You use the exceptions to prove the overwhelming trend which is just silly. You know a few anecdotes while the overwhelming majority of the people you know got together in a different way. It's called confirmation bias or survivor bias. Look it up & learn something new.", "label": 1}
{"text": "I didn't generalised anything and your point it's null. They usually are good men that are just awkward, shy, introvert, etc. That has nothing to do with your stupid comment. Btw, I don't have a hatred towards women. That arrgument is just pulled out of your ass. ", "label": 1}
{"text": "They don't owe you sh*t.\n  You are not a prize. It's not 19 century.\n   If you list them out solely based on \"they not hot enough\" you destroying your own chances meeting your actual partner.", "label": 1}
{"text": "Back when I used Match I swear half the guys hitting me up looked all sad and pouty in their pictures, or they were in some nasty public bathroom looking like they were hiding from the police. Then they'll match me and open a chat and not say anything. Has this ever worked on any woman?", "label": 1}
{"text": "Bruh. It will change nothing for most. He still will get 1-3 matches week/month/year.  Do you believe he will behave healthy on this \"all or nothing\" dates? You have to broaden net, but you have to be attractive.\n  He will have nearly no one to choose from and have to settle for less if he will aiming to target audience, while not being hot.", "label": 1}
{"text": "I don't see how anyone can disagree with this.", "label": 1}
{"text": "Who cares, besides these guys and government that will lack manpower and loyalty. Women seems to be happy with the current state", "label": 1}
{"text": "This tracks with my experience and observed experience amongst friends, peers, co-workers, and strangers on nights out/traveling.", "label": 1}
{"text": "You mean about them wanting to gain experience with different women, not only one? If yes then they're losers because cheat their partner, not because they will remain with a single woman. Some virgins will do that shit, but fortunately most virgins won't.", "label": 1}
{"text": "i asked chatgpt to interpret this post. to sum it all up:\n\n\"Overall, he comes off as someone who feels ignored or undervalued in the dating world and is coping by framing younger women as naive and older women as desperate—both narratives that conveniently make him the reasonable one in his own story.\"", "label": 1}
{"text": "You're crazy if you think anyone is going to read your text wall after you've been so hostile and rude. This is the last comment you'll see from me. Peace out, cunt.", "label": 1}
{"text": ">I don't know any women who wanted to have kids and didn't\n\nMost women settle. Most men also settle, but that's another conversation.\n\n>You just sound bitter that women under 25 aren't interested in you\n\nHaha, typical. \"Grr you don't get any pussy you misogynist!\" Nice try, but tons of women under 25 literally constantly ask me to come and see them. I've already got a hookup with a 22-year-old scheduled for next week. College chicks eyefuck me every time I hit the club. \n\n\nMany young women aren't into me though, and that's okay. Some of them give snarky judgy attitudes however and that part is not okay and I will make fun of them for that.\n\n\nYou'll call me a liar though because you don't like the idea that I can criticize women's actions and still get laid whenever I want lol", "label": 1}
{"text": "I’m hoping you realize referring to random people in a sweeping assumption as “autists” is super ableist and gross. \n\ndo better for yourself.", "label": 1}
{"text": "I personally don't put too much cachet into a woke feminist biased robot's opinion on male-female sexual dynamics, but you're free to believe what you want.", "label": 1}
{"text": "It’s healthy for a man to be in a relationship and/or sexual relationship with a woman.  Men need to know the dynamics of dating and evolutionary psychology because dating has changed.  Since we can understand these dynamics we can easily tell which woman will most likely be attracted to us and receptive to us and understanding the mating habits of female human primates we can make better judgments and decide if we need to get a passport or go to another tribe.  (Hold on im gonna give my human male primate mating call) ok I’m back - my mating call didn’t work because all the other females were looking at their phones at other alpha chad male primates.  Ok, so yes it’s actually healthy to know modern day American female human primates mating instincts and rituals - it’s definitely not easy but the female human primates in the Philippines know where all the food and beta females are so I’m a gonna find a tree to swing on 🤣", "label": 1}
{"text": "> He’s a butterface in your opinion\n\nOh so attraction IS NOW SUBJECTIVE. Then wtf was the point of this black pill bullshit?", "label": 1}
{"text": "Then stop defending it:", "label": 1}
{"text": "> you have no argument\n\nThe pot calling the kettle black.\n\n> no point did I defend any blackpill bs\n\nYou did by interjecting into this convo.", "label": 1}
{"text": "It does cause harm. If I ever found out someone had sex with me with no interest in me that would severely damage my mental health, my self worth and Id question whether men were worth trusting at all. Men also hold negative views around women who have causal sex and they encourage other men to use those women. I have overheard these conversations at frat houses, work and even amongst people I considers friends. I’ve intervened physically when women were trying to commit suicide because of the actions of men lying to them for sex. She had a shoe string tied around her neck and I couldn’t even get it off with scissors as her face was turning blue. You thinking you don’t cause damage lacks empathy for women and I’m disgusted. You don’t have a dam clue what you’re talking about.", "label": 1}
{"text": "Lol nope I called you out [because the other poster *did* address your point about Pete Davidson](https://np.reddit.com/r/PurplePillDebate/s/hVLWjHYLre), [you just tried to act like he ignored it](https://np.reddit.com/r/PurplePillDebate/s/3cwRRc0w3P) but he didn’t. If your case was so strong you’d have no problem defending it but instead you act like this", "label": 1}
{"text": "Do you need proof that you're alive? How do you know you're not an AI simulation? Your challenge is just that silly. Next you'll tell me that pretty women get the same male attention as ugly women.", "label": 1}
{"text": "They all said was “ Most men aren't celebrities” if anything that showed there was more to it than ugly face, such as being in a similar subculture.\n\n>  If your case was so strong you’d have no problem defending\n\nI did. You guys didnt like my defense.", "label": 1}
{"text": "Indeed. The amount of *utter shite* spouted on this sub is something else", "label": 1}
{"text": "Telling someone you wouldn’t want to date them because they have opposing values and calling them out for being hyper angry as a result is not uncivil.", "label": 1}
{"text": "You're IRRELEVANT.\n\nGet it through your thick fucking skull.\n\nI'm tired of fucking female shut ins with their obscure, bullshit standards trying to speak for the female species. If you're above 30, and aren't at least a 6-7/10 **men do not care about your opinions on what is attractive.** \n\nThe vast majority of young men want to know what catches the attention of young, attractive women. A feminine/e-boy/anime lover IS NOT that. Jesus.", "label": 1}
{"text": "Indeed. I have some autism.  Everyman knows or should know a women wants to feel protected. Maybe there's a few that don't, but these aren't exclusively autistic folks. Not even sure why this category was mentioned. Autism doesn't make you a stupid person.", "label": 1}
{"text": "It is a need for me to be happy.\n\nIt is a need for me to consider society a thing worth participating in in a constructive way instead of taking as many as I can with me before I go.\n\nIt is not a need if you are speaking about need in order to remain alive.", "label": 1}
{"text": "Good, your bad genetics and mental poison will fade from the world. I award you, the darwin award, antemortem.", "label": 1}
{"text": "How so? I'm trying to tell these sad pathetic boneheads what's what, because obviously they never learned a fucking thing from their parents. Most of you here want to baby them, which is how they got to this point in the first place. Like I've said in other threads- If you went to public highschool, you should have learned all this shit years ago. I mean, I did. It ain't rocket science.\n\nAs far as \"gross\". Many of these guys believe that \"R*pe isn't that bad\". Also most of them would be disgusted if any overweight or ugly women approached them. \n\nYet I'm the gross one? Ok.", "label": 1}
{"text": "I was much more miserable, even suicidal before I knew blackpill. I believed all the \"personality\" gaslighting and wasted so much money and years improving myself lol. I'm mostly at peace now and blame those responsible rather than the innocent victim.", "label": 1}
{"text": "The  so called ''empathetic'' gender", "label": 1}
{"text": "The redpill shows you the true nature of reality, the role of evolutionary biology and sexual selection in mate selection, and the importance of height, looks, status and money in being attractive to women\n\nIt sets men free. It reveals the truth and gives peace of mind.\n\nThe redpill is the antidote to modern day woke feminism and misandry. Every man should learn about the redpill in my opinion to avoid being the beta male simp she settles for as she grows older and her looks begin to fade.", "label": 1}
{"text": "Cunning linguist said that he's a white knight. Do you think it's true", "label": 1}
{"text": "No he’s not. \n\nTo be honest, that guy seems very sensitive and he will call people femcels and white knights seemingly at the drop of a hat.", "label": 1}
{"text": "Don't worry you'll slowly expose them to it and soon you'll have them all saying \"foids\" \"Stacy\" \"betas\" \"it's over\" on the regular", "label": 1}
{"text": "[https://youtu.be/4uTgYemcP7w](https://youtu.be/4uTgYemcP7w)\n\nreal", "label": 1}
{"text": "> The men that you refer \"don't put in effort\" are the same ones that are putting effort in things like looksmaxxing.\n\nSo the post wasnt read, got it.", "label": 1}
{"text": "I'm just showing you're desperate for attention, you can keep doing whatever you like, i'm going to keep pointing it out, because the RULES OF THE SUB disavow ranting.\n\n> You just ignore the replies of men\n\n>Me: Replies to the majority of them.\n\nThis is what you quote\n\n>You just ignore the replies of men that say they did what you suggest, it failed\\[...\\]\n\nThis is what i wrote.\n\nThank you for proving my point, you are dishonest.", "label": 1}
{"text": "> I'm just showing you're desperate for attention\n\nThen WHY would you give me attention? When I think someone is desperate for attention, I paid them no mind. If anything, this looks like the pot calling the kettle black.\n\nSo bye.", "label": 1}
{"text": ">“Women having any sort of standard is a problem.”\n\n>You’re also proving my point by adding in muscles. \n\n>Also, the vast majority of people’s bodies are normal, so idk why you guys wanna talk about people with disorders/defects/disabilities.\n\nI never said it is a problem, lol.\n\nYou are just either immensely dishonest, or you have the most terrible reading comprehension of all time.", "label": 1}
{"text": "> Your posts have no point so it's impossible to debate them\n\nThen stop commenting. All this is showing is that I’m hitting a nerve.\n\n> I'm explaining that just because you gave up on trying to achieve something it doesn't mean that it's not a need\n\nIts not a need. Btw, most people in those situations die due to long term starvation. They are finding food to eat, it’s just not enough and their bodies breakdown. So I don’t know why you’re bringing up suicidal people who are tired of living in suffering.\n\n> And sex from gold diggers isn't fulfilling.\n\nr/ChoosingBeggars ", "label": 1}
{"text": "it isn't the first time, they will most likely never respond.", "label": 1}
{"text": "It's all looks. 99% of couples you see are looksmatched. I've been online dating for absurdly long and all the dates I've had were roughly my looksmatch. Never was any of us much more attractive", "label": 1}
{"text": "haha yeah I know, can't gaslight if you acknowledge it", "label": 1}
{"text": "I did. Be happy single.", "label": 1}
{"text": "Yeah, thanks for admitting you are gaslighting and bullshitting for the sake of relentlessly hating men", "label": 1}
{"text": "Why do you list these as debate? I demonstrated in your first post that your own data was saying the exact opposite of what you were claiming and in the second post you made the bizarre claim (among others) that statistics from Afghanistan didn't take into account that they were from Afghanistan. Yet you haven't updated either post to reflect these points.", "label": 1}
{"text": "I was wondering if this was the same guy as before.", "label": 1}
{"text": "In my series of rants where I whine about women....\n\nSecond verse same as the first", "label": 1}
{"text": "Of course it is, this sub is full of red pillers who hate women at all costs. That doesn't make your argument correct, nor your flair.\n\nAs I said, I pointed out in your first post that the statistics you provided said the exact opposite of what you claimed, yet here you are still perpetuating the lie. I was just curious why.", "label": 1}
{"text": "You keep saying that, but you have never done anything other than claim that you are right and I am wrong.   \n  \nI thought you were a troll, but if you are not, link me to your argument and I will try to explain what you don't understand.", "label": 1}
{"text": "> Why is it all about impressing women?\n\nThen they can STFU and be happy single.\n\nI don’t know why you guys bother commenting on posts you clearly don’t read.", "label": 1}
{"text": "Yes I did, right here.\n\nhttps://np.reddit.com/r/PurplePillDebate/s/UFL4ZPOsGT\n\nAnd I pointed it out directly to you.", "label": 1}
{"text": "My point is they have received criticism before, had their arguments proven wrong *with their own statistics,* and they continue to lie and say otherwise. This isn't meant to be a debate or informative discussion, it's just a rant where they spread misinformation.", "label": 1}
{"text": "No, poorly reasoned for arguments that are lies, like statistics that say the exact opposite of what is claimed or saying statistics from Afghanistan don't take Afghanistan into account.\n\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "label": 1}
{"text": "I quoted them in their respective threads and even linked one above. You can go check that out.\n\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "label": 1}
{"text": "How is this braindead cum guzzling fuck monkey able to posts its insipid arguments repeatedly and go unchecked?", "label": 1}
{"text": "Sure, right after you respond to the arguments I previously made that you requested the locations for.\n\nSurely you weren't just arguing in bad faith?\n\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "label": 1}
{"text": "> If youre really desperate and make enough money, you can definitely get a loose woman digging for copper. \n\nYes, men that work hard get the consolation of occasionally attracting whores that don’t love them. Any man that isn’t happy with this cultural arrangement is just lazy and entitled.\n\nFurthermore, money is less attractive to cum guzzlers than status. Your dipshit doctor uncle had a career that women consider high value, hence the easy marriage. Trust fund babies aren’t all that appealing to cum guzzlers, in my experience, except those who are also trust fund babies.\n\nEarning your way is more attractive than being a lottery winner.\n\n> I notice alot of guys ignored when I wrote that to just complain some guys didnt have to make profiles, so Im theorizing that the non-hot guys dont want to acknowledge they have to actually rely on their personality (or atleast being interesting) to get women.\n\n“I noticed a lot of guys refuted my easily disproven thesis on men being punished for laziness in dating, so I moved the goalposts to a different argument about how laziness is irrelevant, and ugly men just need to brainwash themselves and be performative to attract a below average woman who is ready to settle down. Or something. Good luck with following my arguments with how often I pivot and deflect, tee hee.”\n\n> “Women are shallow.”\nMaybe stop chasing shallow women?\nThere’s plenty of non-shallow women…your personality has to actually appeal to them.\nWomen are not shallow for wanting men who do the bare minimum of not seeming like a neckbeard.\nNow, I did see some guys claiming theyre tired of peacocking and being a dance monkey……\n\nWomen will remain shallow no matter how men treat them. They are the most privileged, pampered class of people in human history. This is like suggesting that Paris Hilton would’ve become an insightful feminist icon instead of a valid whore if men hadn’t “chased shallow women” in the early 2000s. There is no incentive structure in place to inspire depth in women.\n\nAnd spare us the “bare minimum” argument. Cum guzzlers shift their standards on a dime depending on how attractive a man is and how they’re “feeling” on a given day. I’ve gotten my cock sucked and fucked by bleeding heart leftist women after they insisted they would “never touch a Trumper’s dick.” Cum guzzlers have no actual standards. They are emotional animals and nothing more.\n\n> The keywords being Happy and Content. Not that MGTOW bs where guys are being sour grapes about women.\n\nPlenty of MGTOW guys are happy and content. You don’t know that because you don’t interact with anything but curated rage bait cherry picked from their increasingly fringe Internet forums, which became fringe in part due to feminists attacking the MGTOW subreddit for “spreading hate.”\n\n> Women do put effort into being appealling to men. YOU just dont care because you're shallow and/or desperate.\n\nAnd it’s much less effort than any men put in for about 10% of the return on investment. Neither you nor any woman alive can dispute this, no matter how hard you try.", "label": 1}
{"text": "Here, I’ll draw the logic map, since you’re extremely unintelligent.\n\nYou rebutted someone’s judgment of your behavior with an angry paraphrasing of the religious proverb, “judge not lest ye be judged.”\n\nThis is a fine proverb, but you cannot use it in defense of your behavior, as you yourself judge others. Therefore, it is fair game for them to judge you.\n\nIf you’re still confused, I recommend treatment for your learning disability.", "label": 1}
{"text": "Me neither, i also dont disagree. \n\n\nSo safe to say, you are charity whore then?", "label": 1}
{"text": "You misunderstood what the negative value means, but I explained it to you. How come you still don't understand it?", "label": 1}
{"text": "Meaning that you not only risk detriment to your psyche by engaging in casual sex which is only for your pleasure, you also consequently remove yourself with your virtues and morals as good partner. \n\n\nIf its a detriment it means you cant possibly bond for longer periods of time, which means you will not be good mother or partner for the family. \n\n\nBut of course you dont need that. \n\n\nIm just failing to see how men should be happy with that.\n\n\nHow is that any different than willing prostitution for free?\n\n\nIf you want to fuck chads, thats fine. All women can do that. \n\n\nBut you need families and people to keep doing that, otherwise, no people - no economy - no Tinder to meet chads on. \n\n\nBut i honestly think women didn't think that far about this. \n\n\nThe only luck women have that there is enough cucks and weak men that are willing to make families with women that were fucked every weekend by another man. ", "label": 1}
{"text": "No, I didn't, firstly because there are no negative values and secondly because I directly cited what the values represent and they represent the exact opposite of what you claimed.", "label": 1}
{"text": "Women are cowards who only want to invest in someone that’s been “vetted” by other women. A man with no sexual or romantic history sets off their warning flares, especially if said man seems to have his shit together.\n\nMy first few girlfriends were shocked at my lack of experience, especially with how effortlessly they claimed I “did all the right things” compared to other men they dated. Cum guzzlers are stupid.", "label": 1}
{"text": "Who says I have casual sex? Personal attacks not needed boss", "label": 1}
{"text": "> no u\n\nCum guzzlers are absolutely terrible at insulting someone directly.", "label": 1}
{"text": "It’s rape and murder and you’d whine and complain if it was a woman. Stop your bullshit.", "label": 1}
{"text": "No they didn’t. They got tons of funding from government to do so. \n\nThey didn’t build shit. \n\nGovernment funding for male centers.  Oops. Feminists block that. \n\nStop the lies and propaganda for your little cult", "label": 1}
{"text": "Just because a man says he’ll worship your pussy or take a bullet for you doesn’t mean he’ll pull his weight at home or in bed", "label": 1}
{"text": "You may as well ask who's going to reshape modern society. It's not going to happen. If it happens at all, it will happen tangentially from something else, much bigger. No I'm not advocating revolution or violence. I'm saying shit will work itself out in the end ", "label": 1}
{"text": "Wait, I'm sorry. So your genuine thoughts on this is that women advocating for rape victims are doing it to gain power???? \n\nAre you fucking serious?", "label": 1}
{"text": "Preach. \n\nI hate hypocrisy. \n\nI know I'm a medium ugly woman and so I go For medium ugly men, but it's amazing how many of them are so shallow and think they deserve supermodels.", "label": 1}
{"text": "Someones mad", "label": 1}
{"text": ">He \\[Silverman\\] died as a warning of what happens to men who try to help other men. That's definitely something, and it's far less of a disservice than what the people who killed him are doing (smearing other men for not wanting to be bullied to death, like you are doing here).\n\nThis is you, claiming that the lesson we should take from Silverman's death is to not help men because it leads to suicide.  Unbelievably disgusting.", "label": 1}
{"text": "Bro you have no standing. I called you out and the others that use earl as a way to be victims. Be compassionate and care about earl not use him as a pawn for your stupid online arguments, which you’re just bad at anyways.", "label": 1}
{"text": "17 women who hate that men they want don't want them\n\nafter our lil discussion you nd your online supporters will continue to be unwanted (in fact, your unwantedness grows more by the day), and I will continue to want younger, less used up versions of yall \n\nyou seethe, hoe. 😆", "label": 1}
{"text": "You forgot to say BLACK", "label": 1}
{"text": ">He [Silverman] died as a warning of what happens to men who try to help other men. That's definitely something, and it's far less of a disservice than what the people who killed him are doing (smearing other men for not wanting to be bullied to death, like you are doing here).\n\n>This is you, claiming that the lesson we should take from Silverman's death is to not help men because it leads to suicide.\n\nGood thing that is not me \"literally tell(ing) men not to bother trying to help other men because doing so will make you want to kill yourself.\", because explaining what the moral of a story is =/= telling anyone it is a moral they should live by.\n\nAnd you say my reading comprehension is bad? Is English your first language? This is sub-remedial grade comprehension you have shown here dude.", "label": 1}
{"text": "But this is not about race", "label": 1}
{"text": "I don't want or need 'standing' from anyone like you kiddo, run along back to whatever mother figure you prefer to hide behind.", "label": 1}
{"text": "Standing, have a point. Which you’re only reinforcing with your child like comments. As soon as you start losing you go to lame phrases. Be original at least.", "label": 1}
{"text": "If you want to get owned with creative originality you can earn it one of two ways:\n\n1. Write something worth my time.\n2. Pay me.\n\nPick one, and notice that \"whining\" is not an option. 👍", "label": 1}
{"text": "I don’t come to this sub for originality. I come to trigger sensitive men like yourself. Thank you for making it another successful story.", "label": 1}
{"text": "Always happy to disappoint losers, reply to me again if you want more.", "label": 1}
{"text": "I’m so sorry for you.", "label": 1}
{"text": "You really do lack reading comprehension. It’s the only way you can ever tell yourself you’re right. By simply being ignorant.", "label": 1}
{"text": "Don't need to read past the title.\n\nLmao how much of a loser do you need to be to want an AI gf.", "label": 1}
{"text": ">*Women fundamentally are attracted to men who are a danger to themselves and others….*\n\nNo.", "label": 1}
{"text": ">You never see men put two women side by side, tell them to fight to the death, and pick the winner and his mate.\n\nWhen have you ever seen this play out irl? Are you a vampire from ancient Rome?\n\n Go outside and get some fresh air OP. Youll feel better.", "label": 1}
{"text": "By \"loser\" you mean not 6'7 blonde ,blue eyed top 10% man?", "label": 1}
{"text": "https://preview.redd.it/i2edsfvo8eyd1.jpeg?width=960&format=pjpg&auto=webp&s=9220c23e7a581f54d95dddf3770bf740f9f1acb7", "label": 1}
{"text": "It is always used to refer to men, stop lying.", "label": 1}
{"text": "Be less dumb.", "label": 1}
{"text": "The truth hurts, wear a cup.", "label": 1}
{"text": ">*The truth hurts, wear a cup.*\n\nI’m sorry do you think I’m a dude? Even you cannot be that stupid. 🤣🙈", "label": 1}
{"text": "Lol. Enjoy your robot! 🤖", "label": 1}
{"text": "You're underestimating these guys. Its Reddit. Half of these dudes don't even leave the house. It'd be a miracle if they even change into clean undies everyday.", "label": 1}
{"text": "Which is why their robot girlfriend obsession is so funny to me.", "label": 1}
{"text": "Let these antisocial idiots have their robot girlfriends. Then they can continue to not shower, not change into clean clothes, and not creep out or terrify some poor unassuming woman irl. I know half the men here don't even wash themselves more than once a month.", "label": 1}
{"text": "Lol. \n\nSo just say I’m right next time.", "label": 1}
{"text": ">do get frustrated by how defeatist they often are though. They use their looks or height as an excuse to avoid introspection, improvement and putting themselves out there. Entirely blaming something you can't change is easy and safe.\n\n\"Defeatist\" = Telling the uncomfortable taboo truth that free will doesn't exist, life is suffering, and life is predetermined.", "label": 1}
{"text": "You wanted that to sound more clever than it sounded.", "label": 1}
{"text": "All women are \"toxic,\" then because they all actually like the same men and they are rotting my brain.  They only tolerate the others for resources. While you're busy self improving making money she's busy getting  fucked by the guy she actually desires. Not to mention many men actually genuinely like women and are willing to cooperate unlike women who only like most  men as utility. \n\n  You know why I've been single, utterly alone, painfully devoid of affection for all 29 years of my rotten life? It's simply,  because I'm not one of the genetic, animalistic, scumbag, macho, brute  neurotypical men they actually love. No woman has ever said they liked me or genuinely cared for me in any respects instead rejecting me and  treating me like I'm  trash . So I guess I'm the villain then for being the good average guy in society all my life.", "label": 1}
{"text": "it's litreally just ur logic thrown back at u, justifiably \n\nif it's stupid then so is the original source \n\nI'm just being silly, y attack \n\nu attack because you defensive because chords were struck when bells were rung", "label": 1}
{"text": "No, I’m pissed because I don’t have a lot of time for vague cowards who come in and make passive aggressive attacks they bow-out of when someone presses them over it. It is weakness cloaked as strength and I can smell it from a mile away. \n\nGo play tag with your momma, not me. I’m not chasing you around the bend. Say what you need to say, be clear, or stfu. I’m not playing Assertion-Whack-A-Mole with you. See, I think you’re a coward. That was unequivocal, concise, and clear. That’s how I want your next response to be, or I won’t respond, you understand?", "label": 1}
{"text": "ok, didn't read but from what I gathered you want me to stomp on you.\n\nsigh, fine\n\n..actually, I won't\n\nI've stomped enough today\n\njust chilling and talking shit\n\nI said what I said, bitch. idc if it applies to you or not, it is what it is - its a bitch view that stems from a bitch mind, one that I am capable of emulating, I did, and other came up with such views: if you also come up with such views then it must follow that you have a bitch mind, u bitch.", "label": 1}
{"text": "get some psychological help before you dive deeper into incelhood and start doing horrible things.", "label": 1}
{"text": "What makes you think an older, smarter more mature woman would be EASIER game for basement dwellers like y'all", "label": 1}
{"text": "You know barely anything about men here, it's such arrogant projecting.", "label": 1}
{"text": "early 20s", "label": 1}
{"text": "both crash the app because you count them individually", "label": 1}
{"text": "swan", "label": 1}
{"text": "I've noticed that people who say they look like celebrities are often really average looking people haha, also i just looked up Ryan Reynolds and he looks cross eyed! funny to compare yourself to someone who's not very attractive.", "label": 1}
{"text": "😂😂😂😂😂😂", "label": 1}
{"text": "Learn to make your points better. \n\nYeah they sound stupid. I don’t care if you fucked a rocket scientist dude.", "label": 1}
{"text": "😂😂😂😂😂😂😂", "label": 1}
{"text": ">Some men have kids with trash women\n\nToo bad, so sad; maybe he should have vetted better.", "label": 1}
{"text": "You’re unhinged.  \n\nWhen will you and people like you realize that the vast, *vast* majority of men never had any power to change things? That the “patriarchy” your screech about is a *minuscule* subset of *wealthy* men. (I don’t know why the Left went all culturally Marxist and dropped its class analysis — at least they were right about that.)  \n\nNo, men are not “doing it to themselves”. Like women, they are at the whims of society’s powerful and wealthy elites.", "label": 1}
{"text": "I'm 5'7 I'm an inferior subhuman, she will never think anything else of me.\nshe will stay with the same thought in the back of her head, of having been with a high tier guy to then settling with worthless garbage like me. \nHer friends will question her about the other guy while laughing at a midget like me, her parents will wonder why she decided to ruin the families genes with trash like me.", "label": 1}
{"text": "Throwing ad hominem and just world fallacy is pretty much the women on this subreddit. The \"debate\" aspect is pretty much gone. What medal should we give to OP BF?", "label": 1}
{"text": "> Throwing ad hominem\n\nPot calling the kettle black.", "label": 1}
{"text": "You fool. I don’t pay for sex work. But I do feel for the men who are exploited by women through sex work and even the transactional pseudo prostitution dating culture your gender has created. Unlike you, I have empathy for BOTH genders and see how they BOTH get exploited. Keep being a bitter misandrist/feminist though. You are adding SO MUCH value to society.", "label": 1}
{"text": "Lol. That's a cute insult. \n\nI've got no empathy for people who willingly pay for sex work. 🤷‍♂️", "label": 1}
{"text": "I don’t give a fuck what you have empathy for and I don’t give a fuck whether you think you’re right or wrong. I KNOW you’re wrong. Why are you still here?", "label": 1}
{"text": "I haven't had the same extreme experiences as you but I do agree that women are dating multiple guys at once now. \n\nIt's too time intensive for me and I get bored of conversations quickly but you have to compete to be Option #1 among a couple of options.", "label": 1}
{"text": "I say looks do matter quite alot", "label": 1}
{"text": "Yikes, 🤢, yuck 🤮", "label": 1}
{"text": "Last two girls I went on a date with, I sort of figured out that there is technically another guy they are branching out swinging from.", "label": 1}
{"text": "Bitter, girly,🐱", "label": 1}
{"text": "No. Fuck off, absolutely not.\n\nYou have a responsibility to your spouse and children. ITS NOT ABOUT YOU, MOTHERFUCKER!\n\nYou brought life into this world, and took a vow to do it with the man YOU CHOSE. You have to see it through now.", "label": 1}
{"text": "Hahaha I’m laughing so hard at this", "label": 1}
{"text": "Why is it so satisfying for people to call guys unemployed incels online. That’s like the go to, haha so funny.", "label": 1}
{"text": "takes will power and pride to stave off", "label": 1}
{"text": "It's one of those gut things: Don't run with scissors, don't stare at the sun with bare eyes, don't drive drunk, etc.  It's just a scenario you've seen played out plenty of times. Might I emerge from the aftermath unscathed.....possibly, but I'm also not an idiot and know that it's better to just....not do that then to, for some unexplainable reason, to go, \"lemme try my luck and see how this goes.\"", "label": 1}
{"text": "Lesbian IT bitch?", "label": 1}
{"text": "I love what you wrote. The transgressions that you have encountered are the types of thing that will constantly happen to second- and third-rate men. Wise \"losers\" tend to accept their station with time.  But it is liberating. We are invisible. We can do anything and go anywhere and no one cares so long as we don't bother them. No responsibilities. The world is our monastery.", "label": 1}
{"text": "That poster has either never debated before coming here or is purposely bad faith. It's best to ignore her.", "label": 1}
{"text": "You're talking. So obviously you haven't gone through what she did. Even given all the advantages you claim she got, she is gone. You're still here.", "label": 1}
{"text": "Lowkey encouraging self delete", "label": 1}
{"text": "I didn't call you a unemployed incel, O called you a unemployed (by your own admission) wannabe grifter!", "label": 1}
{"text": "Don’t mind this alcohol", "label": 1}
{"text": "I’m not unemployed. I have my own business, my employees handle the day to day. When you have a business the hardest decision many times, is what do I do now? You can’t force the decision, sometimes you need a vacation.", "label": 1}
{"text": "Then just kill yourself. ", "label": 1}
{"text": "How the fuck did you get that from what I said you blackpilled fuck? I said she suffered more. Hence she is gone. \n\n\nWhat am I encouraging asshole?", "label": 1}
{"text": "Sure dear..........", "label": 1}
{"text": "You said his problems are less valid because he didn’t do the same thing she did. Now if he believes his problems are indeed valid theres only one thing left to prove it to you, not saying you directly told him to off himself but that’s literally the implication here no matter how mad you are about it", "label": 1}
{"text": "I don't understand you assholes. Don't die pls. Don't think dying is noble. It just happens. Fuck off. I didn't tell anyone to die", "label": 1}
{"text": "Not saying you did.", "label": 1}
{"text": "What the fuck are you saying then bitch", "label": 1}
{"text": "That you encouraged it it’s literally what I said you could read it in the first comment", "label": 1}
{"text": "Do you speak English? I don’t understand why you are so mad it’s literally what the words you wrote imply nobody said dead people should be ridiculed why you changing the subject from your initial stance now?", "label": 1}
{"text": "No one called you an incel.", "label": 1}
{"text": "Don't be a simp", "label": 1}
{"text": "It would be greatly appreciated, you moron.", "label": 1}
{"text": "Don't engage with this one.", "label": 1}
{"text": "Yet another bitch whom this post is tailored towards\n\nYou don’t know me at all. All I want is to meet people, but you fuckheads take that as me wanting to fuck everyone I meet on Snapchat. Guess what? I’m not sex-crazed. I don’t even flirt with women, but you generalize and stereotype, exactly what I say women do.", "label": 1}
{"text": "I’ve read through half this post and can easily tell you are a pretty sad woman. I’m sorry.", "label": 1}
{"text": "They won’t have a marriage. Your daughters end up single later in life. That’s one of the most vulnerable positions any woman can be in.", "label": 1}
{"text": "You are. Sorry", "label": 1}
{"text": "![gif](giphy|nTE6nHdPzsO26VbrYh|downsized)", "label": 1}
{"text": ">It’s as if women go out of their way NOT to be approached by men\n\nGlad I am not the only one that has noticed this trend. I want to add that that is only in my age-group, mid 20s. I have less issues whenever I approach women in their 30's or even 40's. Older women are usually very friendly and approachable in my experience. \n\nAlso, my dude, you need to not fixate on women being paranoid. That is a \"them\" problem and not yours. The #1 thing you are doing wrong is *social media*. Social media is not a fucking substitute for actually socializing. Women in particular are hard wired to read a guy *in person* and not through a screen.", "label": 1}
{"text": "Sure bro", "label": 1}
{"text": "Typical male hatred from FL4411", "label": 1}
{"text": "> promiscuous woman\n> woman\n\nopinion rejected", "label": 1}
{"text": "It doesn't you can always just lie lol, it's not kike women can really tell the difference. Just agree with them when they go on their lil political rants and it's fine.", "label": 1}
{"text": "It warms my heart to see the good-faith discussion, empathy, and charity on this sub 🥰", "label": 1}
{"text": "why are you such a white knight in your every comment?", "label": 1}
{"text": "  Cry more", "label": 1}
{"text": "I have a friend who is a bum, doesn’t have a job, can’t speak properly, isn’t hygienic, doesn’t play any sports or goes to the gym. He has no ambition and quite frankly stinks. He doesn’t know what Red Pill or Blue Pill is and has no idea about game, rizz, calithe watch, status (he doesn’t have status to begin with).  His personality is dogshit too.\n\nBut he’s super successful on Tinder and with girls in general. And I even talked to women once through his account and since he isn’t a good talker (he doesn’t know the language properly). He’s also very shy and introverted. He’s not good at flirting, doesn’t lay on the compliments with enthusiasm, doesn’t mirror their attitude and interests, doesn’t actively create sexual tension early consciously. \n\nI just don’t understand how he’s so much more successful than me? We’re both blonds and I wore the same clothes as him and still no success? Is it my watch? I have an expensive watch and he wears a poor watch so maybe I thought that was the reason and I bought the same as him but still no success? I just don’t understand I tried everything you can possible think of, I have a lot of money, he makes women pay for the dates and then has sex with them afterwards?\n\nCan someone explain why this is? I tried to do everything he did and also the opposite. Tried to do all the options yet still no success? Maybe it’s my watch, a calithe watch will surely get the women.", "label": 1}
{"text": "That’s pure cope. I don’t believe age turns women off but I also don’t believe attractiveness increase with age on men neither. Men just have more money and become less inhibited as they get older.", "label": 1}
{"text": "Is this satire?", "label": 1}
{"text": "Not at all, maybe the calithe watch thing at the end was to poke fun at some people online but this is actual.", "label": 1}
{"text": "He's tall and handsome, and there's nothing more to it.", "label": 1}
{"text": "Nope there must be some insignificant tiny detail that bars me from getting into relationship. This comment reeks of Inkwel rhetoric. MOOOOOODS!\n\n(He’s 6’4” and 8/10 and I’m 5’6” and sub3)", "label": 1}
{"text": "nice bit haha", "label": 1}
{"text": "Just because you don’t like it doesn’t make it “ male hatred”. Also personal attacks are against the rules of this sub Reddit.", "label": 1}
{"text": "> women are allowed to have choices in relationships.\n\n\nSo do men. Men don't want older women who can't have kids. Why do women get to have choices but men do not?", "label": 1}
{"text": "I didn’t attack you. Stating a fact. Your post contained hatred for men. Your posts typically do that. I never called you any ad hominem or any insults whatsoever.", "label": 1}
{"text": "No it didn’t. Again it’s not hatred it’s the truth YOU just don’t like it and are trying to shame me to get me to stop posting. Your tactic isn’t going to work.", "label": 1}
{"text": "And you sound like a smug, condescending and ignorant twat. I’m expressing frustration, both at the women who block me for no reason and at the feminists and pick-mes who think I’m some serial rapist niceguy.", "label": 1}
{"text": "Oh shut up. You people are never interested anyway.", "label": 1}
{"text": "Nobody said men cannot have ”choices”.  They can choose who they want to pursue all they want.  They just also often cannot get what they want— it is normal in life to not get everything you want.  In this case, it’s just a simple fact that basically all men want pretty young women, but comparatively few of those pretty young women want much older men.  The competition for young women among men is extremely fierce, and it’s even fiercer for the few women willing to date more than a few years older.  As a result, most older men will lose out.\n\nYou can only choose people who will choose you back, at least in places that aren’t absolute woman-enslaving shitholes like Afghanistan.\n\nSo now, for a third time: *Why are you so angry that some women have “left it too long”? And why don’t you have a wife and kids yet?*  ", "label": 1}
{"text": "Im not, Im angry at the projection.\n\n\nI dont have a wife & kids because I have the option of leaving it this long. I have a date with a woman who's 31 on Satutday, and a date with a woman who is 29 the week after. \n\n\nWhy are you so angry that I can do that? \n\n\nAnd if you're not angry why are you even having this conversation?", "label": 1}
{"text": "Less inhibition is attractive lol", "label": 1}
{"text": "Why?", "label": 1}
{"text": "> Oh shut up. \n\n And there it is....", "label": 1}
{"text": "So what if I’m frustrated because you people never show interest? Is that a fucking problem to you?", "label": 1}
{"text": "Clueless.", "label": 1}
{"text": "\"Men know what the female body looks like.\"\n\n\nHow do they know that smartass? Or you want them to jack off thinking of their mother, you sicko?\n\n\n\"They don't need to watch endless hours of BJs, bukkake, painal, etc. to imagine a naked female form\"\n\n\nMajority of men does not do that. Its like me saying that women watch bestiality, when only smart portion of them watch it. \n\n\nI watch anal all the time because its my kink and i have done it with others. \n\n\nYou want to shame me too? \n\n\nRidiculous.\n\n\nMens sexuality is not inherently evil and disgusting. \n\n\n\"They don't need to watch endless hours of BJs, bukkake, \"\n\n\nAnd why do you have problems with that? \n\n\nDo you want aggresive rapist men who watch vanilla porn or normal citizens who watch their own kinks?\n\n\nAnswer is obvious.\n\n\nHonestly its baffljng to me.\n\n\nYes, if you will have sex with me, i will go all out. And such porn is to satisfy my urges, something which YOU cant satisfy. \n\n\nDo you control your impulses? No. You do whatever you want as long as it doesn't hurt anybody.\n\n\nLet other people do the same. ", "label": 1}
{"text": "> Mens sexuality is not inherently evil and disgusting. \n\nIdk about that chief, you’re kinda making a good argument to the contrary…\n\n> Do you control your impulses? No. \n\nOfc, bc that’s part of being a rational human adult and having a developed frontal lobe. Impulse control is essential.", "label": 1}
{"text": "https://preview.redd.it/lcsqls8drpyd1.jpeg?width=640&format=pjpg&auto=webp&s=9f92769d6191527bea796ecb771942806d11b4df\n\nMost of the guys with black pilled flairs future. Not me tho, you stay safe", "label": 1}
{"text": "I've known hundreds of small business owners.  I was one myself!\nDo you know what I've never heard coming out of their mouths? \"I don't have to work because my employees do it all\".\nI do however know this idea is a common idea amongst young people who haven't been in the real world yet!\n\nThat, combined with you accusing me of calling you an incel, not a wanna be grifter leads me to the conclusion that your life experience is extremely limited, and does not yet include you having to support yourself, nevermind having had long term relationships.", "label": 1}
{"text": "They have point or reference, women.\n\n\nWhen they made sculptures, their reference were men or women, standing there for hours, while they were sculpting.\n\n\n\"Men write, draw and create ai smut all the time with just their imagination.\"\n\n\nImagine being smart person then. It apparently doesn't work for you.", "label": 1}
{"text": "Are y'all wilfully being dense here or something? Use ya fucking eyes for a minute and take note of the following:\n\n* The decorations\n* The area\n* The general skin tone of the people in the video\n* The music (need ya ears for this one)\n\nAnd now that you've used your senses, use some damn sense: this isn't a case of women seething at men for no reason, it's more than likely a case of a conservative community seething at perceived homosexuality you fucking dolts.\n\nIf you're gonna pick something to seethe over at least make it something worthwhile.", "label": 1}
{"text": "I guess I've always been an overachiever, but real talk for a second sex is waaaay more than just penetration. \n\nMy sympathies to your wife.", "label": 1}
{"text": "women mad", "label": 1}
{"text": "Almost as mad as you, apparently.", "label": 1}
{"text": "less words equals less mad", "label": 1}
{"text": "Fuck you", "label": 1}
{"text": "i love you", "label": 1}
{"text": "Too many words", "label": 1}
{"text": "Learning these sorts of truths when you previously believed in the fantasies we are all taught will never be easy. Also its better to learn it abruptly becuase the lies are so pervasive in society that if you aren't forced to accept the truth immediately and upfront, you will just come up some cope and rationalise a way to deny them.   \n  \nLook at all the blue pill push back to just the ideas RP talks about, ignore all the podcasts and interviews etc. The avg BP man or woman will literally call you an incel for even mentioning basic truths or talking about statistics. That same tendency is within you and you would employ it on yourself while being spoofed.", "label": 1}
{"text": "Huh, you only learned you were inferior at age 19? I figured that out when I was 5. That's what shocks me about your post.", "label": 1}
{"text": "Went through the same thing dude, except at 15. Never really gotten over it. Wish the Internet didn’t exist for that reason…", "label": 1}
{"text": "Brother please listen. \n\nI’ve been going to the gym a few years now and even though I’ve made great gains, I was fooling myself the last two years completely. \n\nIt wasn’t until I got a personal trainer did I realize how my muscles could burn and fatigue again. How tired I could be. See after a while I had gotten used to DOMS and the muscle ache. I thought at some point you stop feeling the workouts naturally and just have to keep going. I was wrong. \n\nMuch in the way of women, red pill has a way of inducing rage in you as you come to grasp with the shattering of the ego. You start to look at the almost insurmountable wall of standards women have raised the bar to. This has come through generation of generation of hypergamy. Women of today are extremely hard to please. It is a truth. \n\nHowever the mountain is still climbable. You can spend years doing akin to what I did in the gym, never really making any progress and doing it all on your own. Or you can take their coaching/explanations and start to win. \n\nNothing but the best physiques, finances, genetics, and charisma is winning women nowadays. You can train up all of those areas to the best you can do. There is no point raging at women as they can’t control their nature. You have to take ownership of the work atp and move forward regardless. Just like I had to realize fuck how much time I’ve wasted in the gym and not eating right and how many gains I’ve missed out on. \n\nOnce you actually get the hang of those categories, you will be met with a long range of options in women and likely will not have to work as near as hard for them as you are now. Som embrace it", "label": 1}
{"text": "I think a lot of the confusion for this is around women saying that this doesn’t exist while also saying it obviously does 🙄", "label": 1}
{"text": "I wish the manosphere was around 25 years ago when I first started  dating women. I was raised to be a gentleman and that women are all lovely and deserve your respect. Got my ass handed to me in the dating world, I mean just totally devastated by cheaters, liars, and gold diggers. Not a single relationship that was any good. Back then, you had no way to learn about female nature so you had to learn it by experience instead of somebody teaching you about it. Really makes you feel like something is wrong with you, until you get older and start to observe the patterns. Then, when the old school mgtow and red pill were created, it was your validation that it was not because anything was wrong with you.", "label": 1}
{"text": "The distance between online and reality anymore is debatable.", "label": 1}
{"text": "One thing I will give the black pillers,  I do agree that us as women aren't the most honest about our standards. \n\nThis isn't malicious women just fear retribution from men and judgment from a patriarchal society.", "label": 1}
{"text": "I was talking about everyone else in this thread you dense fuck. And besides - that bit about me not caring about women - I do care about women, but I should not be expected to tiptoe around the truth. Women are paranoid. Fact. There’s some people here who think men can fucking kill women with a single punch. Fact. Sure, most men can beat women in a fight, but it’s not like men can donut women. Fact.\n\nBesides, whatever callousness I have towards women’s issues, you clearly give less of a shit about men’s issues.", "label": 1}
{"text": "I meant WOMEN should use a gun, you cherry-picking prick. \n\nWeapons exist. Women should use said weapons if they really can’t let go of their paranoia.", "label": 1}
{"text": "Plz get out of that Black pill hell hole", "label": 1}
{"text": "Schizoing with blackpill call outs because you know its the exact same shit.\n\nJust the good old fantasy that the bullied ones will be exalted once they get older, the pretty girls will give up on the jocks, the nice guys will give up on the popular girls.\n\nFantasy, not reality.", "label": 1}
{"text": "> we had you pegged\n\nNo. You didn’t, you fucking doorknob. I can provide screenshots of interactions I had with women where I wasn’t reacting to a strawman.\n\n> Opinion\n\nIt’s not just an opinion - look at the amount of men who are afraid to approach women for fear of being accused of something.\n\n> You finally conceded\n\nNo. I did not. It’s not spam. The fact that you think it is says more about YOU and YOUR misandry.\n\n> women used to be lobotomized\n\nOk? Yeah, they did used to he lobotomized for stupid reasons. I’ll give you that. But this feels like you’re trivializing men’s issues (which include more than just getting rejected, btw, and getting rejected is NOT a men’s issue so don’t even try to take THAT out of context) by bringing up a women’s issue that doesn’t happen anymore.", "label": 1}
{"text": "The only register 6ft+ handsome white men as worthy of romance. All other men are worker drones. In a woman’s ideal world those men would also be castrated", "label": 1}
{"text": "Yeah I know what you mean. What pushed me to have these views weren’t even RP influencers. I don’t watch or listen to any of them. No red pill stuff, no dating coaches, no MRAs, nothing. I never fell down the alt-right rabbit hole like Jordan Peterson or Ben Shapiro.\n\nWhat convinced me were seeing the way women acted irl and the things they posted online.", "label": 1}
{"text": "Lots of talk, no substance. You are just spending your time ignoring the women here who very much calls your bullshit saying that this, just like the women's side of the fantasy, is nonsense.", "label": 1}
{"text": "1. Be white\n\n2. Be 6ft+\n\n3. Be conventionally handsome\n\n4. Don’t be too sad. You are only allowed to feel negative emotions on her terms. If your emotions make her the slightest bit uncomfortable, you’re a disgusting misogynist pig who feels entitled to women’s attention", "label": 1}
{"text": "The problem is when you go out and confirm the hypotheses. That’s when depression hits. Until then, you can blame it on the algorithms. There’s not much one can do. Just get used to it, hit the gym, etc…", "label": 1}
{"text": "This is a tactic to make your point less important and your response less intelligent.", "label": 1}
{"text": "This doesn’t take into account the body dysmorphia younger men also experience with height and **** size in real life and online. Equalizing men’s issues with women’s is why so many guys don’t feel listened too.", "label": 1}
{"text": "No\n\nNo, I don't think I will", "label": 1}
{"text": "It took me until 20 yrs old and a huge glow up and getting hot guy friends to open my eyes on women. Half these single girls running around and having way more fun with guys than the average guy can comprehend.\n\nLot of single women living male fantasy. Once you see it and experience it firsthand you say to yourself, “of course, why wouldn’t single women be like this?”", "label": 1}
{"text": "What is your opinion on how the internet has affected younger men’s expectations of themselves vs younger women’s?", "label": 1}
{"text": "People are not necessarily convinced to follow anything that doesn’t relate to them in some way. If more men are choosing redpill or mgtow, what is your perspective on why that is happening more often?", "label": 1}
{"text": "Yeah, men are to dumb and gullible to the internet. Duh. That’s why they’re sad. Send them to class!", "label": 1}
{"text": "I don’t care about your pet grapefruit. I’m talking about normal people.", "label": 1}
{"text": "Your attitude towards men’s health and minimizing it to being uneducated and unaware is very typical and common. “Empathy literacy” is something you need more than your weird push for men’s “media literacy”.", "label": 1}
{"text": "You Americans are a pathetic lot, huh?", "label": 1}
{"text": "Thank you for being honest, and unfortunately I do agree that reason is a legitimate fear to have. Thats why I think it's best for blackpill talks be for men 21 and up. Fitness and socializing should be the focus for boys as it will work for most.", "label": 1}
{"text": "This is very interesting. But it is not really an equalization if more men follow these groups than women following radical female groups. Why do you think the manosphere world is so much bigger and growing?", "label": 1}
{"text": "Most women don’t deserve the standards they have. It’s mind blowing how so many men make these fugly women think they’re high value.", "label": 1}
{"text": "> Citation Needed\n\n\nExactly. Let me know when you stop making things up.", "label": 1}
{"text": "True, that's why we're notorious for suing people because they called us names. Wait no, that's someone else. \n\nFuck outta here with the pussy shit, we hear something we don't like we talk to a cunt and resolve it direct.", "label": 1}
{"text": "I'd like to see how your soft ass handles having something repeatedly rammed into your throat.", "label": 1}
{"text": "As a millennial woman, your ignorance and apathy to is not strange to me.\nWhat you typed here is a lie.", "label": 1}
{"text": "A short, angry murderer with a terrible hairline?", "label": 1}
{"text": "Not racist just an observation. White people have it easy, especially white women. Most of the gripes men have about women here are about white women.", "label": 1}
{"text": "So you are racist, got it👌🏻", "label": 1}
{"text": "Lol stay ignorant or delusional, I guess.", "label": 1}
{"text": "The truth is rarely if ever easy. But it is the truth. And we men aren’t afforded the same luxury of believing in comforting lies. We have to live in reality because no one shields the reality of female nature (and male and human nature) from us. We’re not the gender that has that privlege \n\nJust like how being an adult means accepting truths such as: you can do everything right and still wind up in the gutter, no guarantees in life, there are people inherently better than you, there is such thing as a clear winner or winners and rarely does anyone but the top get the trophy…\n\nBeing a man means accepting female and being a modern man means recognizing how bad it may take an entire generation if not sooner a trip to a new continent for men to get members of the opposite sex that are good and decent again", "label": 1}
{"text": "Just like you feel cheated when you don't get commitment from the ideal man you totally deserve.", "label": 1}
{"text": "I think a lot of boys… especially in the middle class and below… are raised to basically see themselves as pay pigs.  \n\nSuccess brought me out of that mindset and showed me how much of it was beaten into my mind through a female dominate public school system.  I feel like this is just an enormous system to destroy the lives of boys and men.", "label": 1}
{"text": "You basically sound like a 400lb fat chick with terrible skin disbelieving that losing weight and getting rid of the acne will make men desire you more.\n\nIt’s dumb… like epic level dumb.", "label": 1}
{"text": "“Many men know that if they don't spend money on a woman, sooner or later she will lose interest in them, and this is actually a sad commentary on women and their state of consciousness because for many of them it's all about money and material things”\n\nIt was always that way nothing will change that lol", "label": 1}
{"text": "You tease", "label": 1}
{"text": "100% fact.", "label": 1}
{"text": "Women see the majority of men as nothing but laborers and cannon fodder. When women see male suicide statistics they wish they were higher", "label": 1}
{"text": "Capitalism, not society.", "label": 1}
{"text": "TBH whilst this is true, its also culture specific. \n\nYes, men are expected to sacrifice themselves for women...but thats meant to be complimented by women who nurture, cook, clean and support their partner. Women dont want to do that anymore, but then cry that men also arent upholding their side of the bargain. This phenomenon is also more pronounced in America (where the bulk of this english language gender war discourse seems to be emanating from). I'm in the UK and whilst things are absolutely not perfect here, there definitely isnt the same patriarchal expectations for men. You want find people crying if men here don't pay for dates or pay for a womans lifestyle. \n\nAmerica though? Y'all seem fucked up. I see so many women with **insansely** toxic expectations of masculinity whilst bringing absolutely nothing of value themselves. And it translates in the data too. America has one of the highest rates of divorce in the developed world, higher rates of STDs, partner counts. There seems to be crazy mentality over there when it comes to intense expectations of men coupled with absolutely zero behavioural standards for women. I kinda feel it helps contribute to the fruitcake state of politics and social issues.", "label": 1}
{"text": "Source \n\nTrust me bro", "label": 1}
{"text": "Comment\n\nNo substance \n\n(So no reason to respond)\n________________________________________________\n\nFor clarification\n\nTermaggravating8043: \n\n“Source\n\nTrust me bro”\n________________________________________________\n\nSource for what?\n\nTrust a survey or statistics for why?\n\nYou can’t use your brain?\n\nSometimes you need to think before you send a comment\n________________________________________________\n\nIf you’re not going to refute or challenge or point flaws in my op\n\nYou are just talking\n\nWhich I’m above atp\n\nAs that would be pointless to respond to\n\nSo next time try harder", "label": 1}
{"text": "Why are you playing into this. No. Most men are not worshipping women. We are providing because it feels good to do nice things that usually cost money. I don’t pay for dates because I feel like I have to. I have and will again gladly walk away from a dinner I don’t like and leave her to pay for anything she ordered and mine. If you act wrong. Too bad. Take the check. Women got jobs now.", "label": 1}
{"text": "You’d think feminists would not only tell women to be self sufficient but also spread this message to men\n\nThat they generally don’t is why I consider modern feminism to only be a female lobbying group", "label": 1}
{"text": "Pay pigs is a gross term but your point is valid. Success showed me how fragile women’s rules about men are when they see your bank account.", "label": 1}
{"text": "Women say this exclusively. Not society.", "label": 1}
{"text": "Not really ", "label": 1}
{"text": "I dont think we as a society use the words conditioning and grooming enough when we discuss the raising of our boys.", "label": 1}
{"text": "Capitalism! Like in socialism women magically want the farmer or construction worker without government provided housing or property! Exactly. Capitalism has influenced women’s behavior towards men. What an uncommon and totally educated idea 🤪", "label": 1}
{"text": "Totally dude", "label": 1}
{"text": "Another point is that society tells men they can work for and get anything they want if they work hard enough. Fast reality is that this isn’t true. No woman will care about your work ethic or job as long as you’re tall enough, rich enough, or your **** is big enough to overshadow those two. When women choose single and supporting themselves over bisexuality or relying on their dad I’ll believe they can actually do anything for themselves long term.", "label": 1}
{"text": "Men don’t think this. Ughhh it’s men’s fault because they pursue women. Of course. That’s why we view you the way we do. Of course. It’s got nothing to do anything women are doing or saying to men at all whatsoever. It’s because we pursue them we are sub human. Don’t even think about the expectations to approach women cause that isn’t true either", "label": 1}
{"text": "An educated man here.", "label": 1}
{"text": "We view you as women who have super weird and confusing behavior that comes off disrespectful and rude while you back it up with you deserve to act however you want. Men want to see you as people so stop acting like walking cliches and contradicting yourself beliefs constantly", "label": 1}
{"text": "Dude please come over and tell these girls they got it so good. They listen to foreign dudes about anything quicker than they will listen to any of us.", "label": 1}
{"text": "Why do women always equalize stuff that isn’t even. Animals… really.", "label": 1}
{"text": "Life", "label": 1}
{"text": "This is kinda stupid and reaching too far for comparison", "label": 1}
{"text": "We’re not jealous of women. Literally ever. It’s the opposite. Sigmund Freud found the answer.", "label": 1}
{"text": "Oh no, you’re halfway to impressing an American woman by calling her masculine. They all have hpv and are angry bisexuals as a plus. Watch out!", "label": 1}
{"text": "There isn’t a way to communicate throughly with a girl who only understands words from a child’s perspective. But again this is common.", "label": 1}
{"text": "Most men only have 2 options. Beta bucks or remain single.", "label": 1}
{"text": "I was just saying that most women these days don't offer much besides sex. Even as friends. In fact most often women treat their guy friends like low tier boyfriends in other words simps or betas. Once those simps are no longer useful for a woman she often tosses them away. Because of this most often friendship with a woman is worthless. \n\nYou just got hyper focused on mean words like worthless or useless. No offense but maybe you should try to thicken your skin. World can be quite mean place sometimes", "label": 1}
{"text": ">As a millennial woman, your ignorance and apathy to is not strange to me. What you typed here is a lie.\n\n....\n\nhttps://preview.redd.it/ct3lyy02cwyd1.png?width=1080&format=pjpg&auto=webp&s=f440ec1ec81ad4da44205813e328d56166a4ed0e\n\nMore like r/AsABlackMan, am I right?", "label": 1}
{"text": "Whatever helps you cope babygirl😘", "label": 1}
{"text": "And women in previous generations weren’t working the same amount  current generations of women are, hence they usually handled childcare and housework.\n\n[“There aren’t enough hours in the day for any one person, man or woman, to do it all.”](https://np.reddit.com/r/PurplePillDebate/s/51SQpdZi12)\n\nGood lord are you dense", "label": 1}
{"text": "Just because you and a bunch of shitty loser dudes are single, doesn't mean most guys fall into that category. The majority of guys are in relationships. The majority will marry and have kids. \n\nJust because women won't fuck you, doesn't mean they are monsters. Sounds like they have standards, especially since you think it's worse not to get laid than being beaten or killed by your spouse. \n\nIt isn't me who's toxic.", "label": 1}
{"text": "Ew, what a creepy thing to say.", "label": 1}
{"text": "Funny how you managed to ignore entire post and didn't say even a single word on woman behavior which is very consistent to your whiteknight mentality which you display more often than not but continue ranting about RP which lives rent free in your head lmao ", "label": 1}
{"text": "Look at your original comment and get help. I'm not the one victim blaming. Wish you the best.", "label": 1}
{"text": "Find a tall and good looking dad and be born through his wife", "label": 1}
{"text": "Unhinged rambling, sexism and racism. Did you get lost on the way to 4chan or something?", "label": 1}
{"text": "What’s considered low body count and what’s considered high? I’m 20 so what I considered low is anything ranging around being a virgin and 2-3. High would be anything above 4-5. Remember I’m 20. \n\nI would be disinterested in a woman my age(fortunately I am not usually attracted to them ahaha), if she were a bisexual who slept with more than 3-4 guys. It would be a turn off for me.", "label": 1}
{"text": "Would you pick a girl who slept with 15 girls or a girl who slept with 5 guys?", "label": 1}
{"text": "It depends more why they're doing it than the number tbh\n\nBut if you're kind dating around in college, and say sleep with somebody once every 2-3 months, that = 10-12 by 20 and it doesn't sound that terrible", "label": 1}
{"text": "At my age i consider anything above 10 somewhat high. It only gets really iffy after 20 tho", "label": 1}
{"text": "Above 7 it starts to fall in high category . Low would be 0-3", "label": 1}
{"text": "According to the CDC the average lifetime for both men and women is 4-7\n\nhttps://www.cdc.gov/nchs/nsfg/key_statistics/n-keystat.htm\n\nAnd it’s stayed pretty consistent over the decades \n\nhttps://www.cdc.gov/nchs/data/ad/ad384.pdf", "label": 1}
{"text": "Absolutely!", "label": 1}
{"text": "It's like looking into a schizophrenic's mind.", "label": 1}
{"text": "What a way to give constructed comment. Calling me schizo.", "label": 1}
{"text": "At 20 10-20 isn’t normal. That’s on average high for most. Only a few percentage have a body count over 10 at the age of 20", "label": 1}
{"text": "You didn’t get to ride the cock carousel", "label": 1}
{"text": "![gif](giphy|IE5sC0qIX5bqo6xBZf|downsized)\n\nBitch you only 20. \n\nAs conceited as it's gonna sound I totally get the intelligence thing - I rarely meet people I don't have to slow myself down for and that gets beyond tiring, not to mention woefully boring. Finding people on a similar wavelength is basically down to pure chance; any hobby you might have is guaranteed to attract people from all walks of life and levels of acuity, and even if you do find someone who can actually challenge you they're pretty likely to not be available/attractive/amicable. \n\nIt sucks a bit, but you eventually learn to cope.", "label": 1}
{"text": "not when you have no romantic love ever but your dream is to start a family so you become suicidal. That's like saying to an African kid who has no food 'well at least you got water buddy\"", "label": 1}
{"text": "Yes and 18 year old boys are simultaneously predators and virgins who can't get laid; as exclaimed by western women. By the same boys they need to help them vote blue", "label": 1}
{"text": "Voting for a rapist and pedophile is pretty fucking weird dude. Hope he sees this and spanks you for being a bad little girl.", "label": 1}
{"text": "Oooh, very bad girl. You really need a spanking. Get up to your room, this is going to hurt you a lot more than it hurts me. \n\nI've seen what you guys cheer for at your rallies. Lock me up daddy with your other political enemies, immigrants and degenerates.", "label": 1}
{"text": "You’re brianrotted, go outside make some friends", "label": 1}
{"text": "Sounds like you’re chronically online more than anything", "label": 1}
{"text": "I flex on real people not internet losers", "label": 1}
{"text": "Not all of us are doing sexual favors for the mods like you are, lil buddy.\n\n\nBut I won't deny that the answer lies within your list.", "label": 1}
{"text": "Lmao earlier today I was actively arguing with a mod over them being a disingenuous prick.\n\nYou can deflect all you like dude, it's doesn't bother me or change anything. At the end of the day you'll still just be an angry little coward who's incapable of standing behind his own statements.", "label": 1}
{"text": "Let me put it to you like this: You're weirdly obsessed with me and possibly homoromantic. Stop typing so much and go talk to your friends, assuming you have any.", "label": 1}
{"text": "Go get help. Seriously", "label": 1}
{"text": "> And you're spending all your time here because...\n\nCareful. You’ve outed yourself as a bitter cum guzzler, on top of being a pathological liar that collected information on online men’s groups for the federal government, and feels zero remorse for your reprehensible actions.\n\nStones and glass houses, liar.", "label": 1}
{"text": "> My life and its outcomes are dictated by conflict theory rather than my own actions.\n\nWoman moment.", "label": 1}
{"text": "The fact that, in the ten years since this subreddit gained traction and attracted increasingly worthless Redditors, it spawned a Facebook wall daily thread for subhuman dipshits to make friends with words on their screen, is repulsive. Hopefully every man and cum guzzler that uses this thread for social fun endures a painful, miserable ”life.”", "label": 1}
{"text": "Strip the right to vote from anyone that isn’t a landowner.\n\nThis resolves 100% of modern first world issues overnight.", "label": 1}
{"text": "Deaths from workplace hazards in the most critically vital trades say you're self deluded.", "label": 1}
{"text": "I’m sure those words meant something scathing to you, but if you’re going to be angry at me, do it coherently, shitstain.", "label": 1}
{"text": "This isn’t an image board, cum guzzler. Use words or fuck off.", "label": 1}
{"text": "I don’t know what “glazing” is, but it looks like I found a petty, vindictive specimen.\n\nDid it make you big mad when Bad Rich Man bought your favorite website, dipshit?", "label": 1}
{"text": "Never talk to me again, you mouth breathing cum guzzling waste if blood, bones, and shit.", "label": 1}
{"text": "Holy fuck you’re mad.", "label": 1}
{"text": "Do you pose and admire yourself in the mirror, monkey?", "label": 1}
{"text": "And a hairless fuck monkey with nothing resembling an interesting life story or a moral compass.\n\nYou are not human, and you never will be. Drink some cum and have a good cry.", "label": 1}
{"text": "It’s so inspiring to see a diaper shitter with a learning disability use Reddit.", "label": 1}
{"text": "Better. Now make a point or fuck off, cum guzzler.", "label": 1}
{"text": "Reddit mods are a special race of humorless half-human. It takes some getting used to.", "label": 1}
{"text": "> Mankind can only do one thing.\n\nNot a lot of wrinkles in your brain, are there, shitstain?", "label": 1}
{"text": "Now say it without crying, front hole.", "label": 1}
{"text": "> no u\n\nLook at the raw intellect of the modern cum guzzler. It’s no wonder things like this are so proud of their professional achievements.", "label": 1}
{"text": "Did you start queering because you’re weak?", "label": 1}
{"text": "Don’t involve me in your fetish, cum guzzler. That’s rape, since I don’t consent.", "label": 1}
{"text": "Look at that. A cum guzzler with an opinion.", "label": 1}
{"text": "To continue something requires it to have been started.\n\nYou would know that if you were as smart as a normal person.", "label": 1}
{"text": "How easy it is to mindbreak some cum guzzler that “comes here for fun.”", "label": 1}
{"text": "Try again, speaking like a normal human and not a mentally ill deviant.", "label": 1}
{"text": "Mental illness in queers is common, as is self harm. Your illness should be kept to yourself until the inevitable suicide, though. Normal people don’t want to talk to you.", "label": 1}
{"text": "Is this what a cum guzzler who comes here to smile and have fun types like?", "label": 1}
{"text": "\"So we all know that both men and women express frustration with dating apps, frankly, they suck.\"\n\n\n\nI agree with your ideas, but a photos-first, text based app IMHO is not the best way to meet new people. I switched to Spontaneous-Hour, a voice-first social experience where I join small groups for an hour of fun, hosted conversation. It's like being at a relaxed happy hour with new friends, but from home. The host guides us through thought-provoking topics that create opportunities to connect.  \n\n\n\nIt's audio-only at first, which takes pressure off appearance and lets personalities take center stage. I find people open up authentically when focused on listening rather than scrutinizing looks initially. It allows real, unfiltered interaction.\n\n\n\nIf I vibe with someone's conversation style, I can \"like\" their profile after. Mutual likes unlock video chatting, so we evaluate physical attraction too. But no pressure – some connections stay platonic, expanding my social circle.\n\n\n\nIt feels a natural way to form connections based on personality and chemistry first. I meet multiple intriguing folks in one casual hour, skipping repetitive small talk. The voice-first approach allows me to be myself without worrying about perfect photos or bios. I enjoy the experience more than swiping on looks and profile text alone.", "label": 1}
{"text": "> want to make you happy \n\n\\^ LMAO Yeah, men are also pathetic servants whose entire purpose is to make your life better, sure\\~ /s", "label": 1}
{"text": "Just celebrating another misandrist not inflicting herself on men. Does you husband knows about your reddit activities? Or do you keep your hateful side hidden?", "label": 1}
{"text": "I'm not going to engage you in discussion. You've demonstrated that you're only here to argue and you're exhausting.\n\nId simply block you if it weren't against the rules of the subreddit.", "label": 1}
{"text": "It's always sad, when someone goes too deep into some shit, be it red pill, blue pill, black pill or any other cultlike \"structure\". I feel sorry for you", "label": 1}
{"text": "Black pill or blue pill?", "label": 1}
{"text": "What, you think your pissy little tirade is masculine?\n\nSuch grand and intoxicating innocence.", "label": 1}
{"text": "I don't understand why you feel the need to defend women so much. Is it because you're an ENTP? Even then I don't understand why it's such a white knight personality type.", "label": 1}
{"text": "https://preview.redd.it/4d28bibpe3zd1.jpeg?width=1140&format=pjpg&auto=webp&s=f882184ec32550f884ce76f4faa8066596aea0e2", "label": 1}
{"text": "Good post. Explains why many women like to generalise men. Most of them are traumatized and mentally unwell. They need to cope with the fact that they're choices have consequences.", "label": 1}
{"text": "100 percent correct- the average western woman has a high body count (similar to a prostitute) while the average man does not. ", "label": 1}
{"text": "I'm in a relationship with a woman 16 years younger and I don't really notice a gap in equality compared to other dating experiences I've had.", "label": 1}
{"text": "Amount of sexual experience in both genders averages out as the same, but the amount of sexual experience the average male has compared to the average woman is less. Everyone generally acknowledges women get get sex much easier (“dick is free”, “men fuck anything) but can’t admit to this for some reason", "label": 1}
{"text": "Even if that at all had any semblance of truth to it, so what?\n\nPlenty of other women have no experience into their 20s. Plenty of other men have had sex with dozens of women before he's even gotten to college. People aren't a monolith.", "label": 1}
{"text": "You can read the last paragraph of the post and use your head and your own thinking skills, you’re just being argumentative, don’t call it a loophole, but that’s how women date out of their league.\n\nWomen don’t make themselves attractive so they can sleep with as many men as possible, that’s what guys do.", "label": 1}
{"text": "Someone should get Lilith routine wellness checks.", "label": 1}
{"text": "I second this.", "label": 1}
{"text": "You've posted threads near every day for a month, in long, rambling fashion.\n\nI genuinely don't believe that you're well.", "label": 1}
{"text": "It's dripping with general misandry. No one in their right mind is going to take the generalizing advice of a man hater.", "label": 1}
{"text": "This is cope. Women will get into situationships and hook up with guys on tinder I don’t know what world you’re living in.", "label": 1}
{"text": "Cool story bro", "label": 1}
{"text": "I think you're just coping", "label": 1}
{"text": "I know what I am do you know what you are ?", "label": 1}
{"text": "I’m ‘black pilled’ myself and I genuinely want to help other men who are misguided but I feel as though the majority don’t want to better their situation.", "label": 1}
{"text": "You mean becoming blackpilled will better their situation ?", "label": 1}
{"text": "I've slept with enough women to know that there's truth in the black pill", "label": 1}
{"text": "You’re welcome, friend!", "label": 1}
{"text": "And how old are you? Does this topic pertain  to you? Yall are just losers who cant get pussy from women your age..as a 22 year old now i can easily go convince a bunch of 18 year olds im better than the men in their circles..lack of pride.", "label": 1}
{"text": "So under 18?", "label": 1}
{"text": "I have no obligation or a written contract to like \"woman of this age, this race, this social status, this city, this country etc\". I can love or like any woman i want.\n\nIf a white boy dates a black girl, would you say \"HEY you date a black girl because you cant find a white girl\"? See how stupid it sounds!\n\nAnother brainwashed age-gap zombie who is conditioned to like woman of his age only.", "label": 1}
{"text": "You can. No shit. Its just loser shit that on  out loser men can fathom because they are LOSERS. Beggars can’t be choosers.\n\n\nIve dated white women as a black male myself and it wasn’t on purpose. I just like women and she was one of them..i dont date white women because they are easier to control than black women or less experienced or something ..thats what YALL crowd does (theres so many fine ass older women/women your age, you just know you have to actually put effort) . Dating sb and they just are younger is different from actively trying to find sb younger and less experienced than yourself… imma ask you this why arent women YOUR AGE WHO ARE HOT NOT IN YOUR PURSUIT OF HAPPINESS????? BECAUSE MFS LIKE YOU..think these young females will be easier to turn out..im alot more confident around 18 year olds than fellow 23 year olds because i know they know better and wont just listen to me. \n\n \nI find women of all ages(19 and up) attractive. But i put the younger ones in the little sis category…more likely to be friend them and try they older sister who IS my age..im 22 just got the ability yo go to bars and shit…Yall be so desperate youll work 2-3x as harder to go home to sb doing homework..and y’all ignore the absolute stunning women your age because they intimidate you…i hate that cowardly ness..\n\n\nYour the same guy as the guy who used to be picking up hs girls well into college. You can use that same confidence and urge on hot women your age and be successful..i just don’t personally understand it. All i can think of is the teen category thats mainly filled with 28-37 year old women 8/10. Which is the irony.", "label": 1}
{"text": "MFS, its futile to talk to you. You cant even pursue a civil debate. And i know what your problem is.", "label": 1}
{"text": "Sex is the be all and do all for you degenerates. No wonder you guys have no idea about your dads.", "label": 1}
{"text": "Point to where I said I view women as less than men\n\nDo you understand your delusion now?", "label": 1}
{"text": "This is like your 67th long ass post whining about how men don’t act the way you want them to, you’re not noticing patterns, you’re just angry. Get off Reddit babygirl", "label": 1}
{"text": "Man shut your simp ass up my god", "label": 1}
{"text": "It’s the male equivalent of stupid bitches doing sex strikes.", "label": 1}
{"text": "Vampires", "label": 1}
{"text": "Misogyny? I'm into traditional general roles. I am also petite.  I do not date men who either cant *or* wont protect me. If you want to be a wimp that's your choice, and you are entitled to it. I just won't get involved with a man such as yourself. \n\nLol good luck with finding a feminine woman because it isn't happening for you. Like, never.", "label": 1}
{"text": "Which vampires? The Lost Boys version, Lestat, the Salvatore brother, Twilight, Spike?\n\n![gif](giphy|26uflkSpLxBKvJbdC)", "label": 1}
{"text": "![gif](giphy|knVLsGuizHcMo)\n\nUgly ones", "label": 1}
{"text": "Yes Lilith we know you’ll keep whining about it, you always do", "label": 1}
{"text": "[https://www.youtube.com/watch?v=mLHG4IfYE1w](https://www.youtube.com/watch?v=mLHG4IfYE1w)", "label": 1}
{"text": "Why haven't I blocked you yet? My fault I suppose. Judging from your replies, you aren't the kind of man that I would be trying to attract irl anyway...You aren't a masculine man and never will be, so your opinion means zilch to someone like myself.\n\nHave fun with your robotic A.I girlfriend.", "label": 1}
{"text": "Did I reply to you instead of the worthless man? Sorry, I will delete it and make sure he sees my comment.", "label": 1}
{"text": "This is why I'm friends with Wesley Snipes", "label": 1}
{"text": "Be careful y'all. The mods don't like funny people.", "label": 1}
{"text": "Lol figures a stereotypical wimp like yourself is from Seattle. Stay in your liberal hell hole. Have a nice night!", "label": 1}
{"text": "Sad as hell that height was wasted on a straight up 🐱 like you.", "label": 1}
{"text": "I wish I could use the c word so badly right now", "label": 1}
{"text": "Re read my comment again and you will realize it was a mock comment, no one mentioned killing, I don’t help randoms, only people I know, end of story and now go post in Ocd", "label": 1}
{"text": "That's how the black women teachers were to me when I was in high school.  Although one of them that I particularly disliked at first did save my life.   Then she went right back to being a bitch.   \n\n\n\nAll the other teachers were mostly chill.   I went to high school in Texas though so maybe that's why", "label": 1}
{"text": "The cope is strong with this one", "label": 1}
{"text": "Hispanics voting for trump is hilarious. Nobody hates immigrants more than ones who get their green card. \n\nhttps://preview.redd.it/orib87q2k8zd1.png?width=733&format=png&auto=webp&s=da15ee89a9e2adabb5bc3d9234266c30840a7227", "label": 1}
{"text": "\"nobody has given a shit about women … ever\".\n\n\nIf men would not rally for feminism, you would still be sitting in the house as a slave, not knowing what freedoms you have today.\n\n\nYou are absolutely unhinged.\n\n\n\n\n\"but when men feel a disruption to the status quo \"\n\n\nWHAT STATUS QUO?!!!!????\n\n\nEVERY BOY OF EVERY MOTHER IN US IS ALREADY BEHIND GIRLS!\n\n\nYou know what? To hell with you.\n\n\nYou are just some lonely looser fucking woman who needs to be bitter to everyone for no fucking reason.\n\n\nIm blocking you.", "label": 1}
{"text": "ahaha, downvote a response because you're triggered?", "label": 1}
{"text": "Why would i ever believe your words? You are a woman.", "label": 1}
{"text": "You still listening to women?", "label": 1}
{"text": "Women won't last.\n\n\nRemember covid during lockdowns?\n\n\nThots were going stair crazy because the hasn't had their dixl appointment in 2 weeks.\n\n\nSingle guys are used to going months without sex.\n\n\nWe'll see who caves first.", "label": 1}
{"text": "Those women are lowkey admiting that the only thing they can offer to men is their pussy, its not a loss for us, but a reflection of their low value.", "label": 1}
{"text": "They just have to realize that we’re in it together and a good place to start is by not belittling men’s issues and struggles. Even if you think yours are more important here are the consequences.", "label": 1}
{"text": "\\> Sex is not reward for good behavior!  \n\\> Men behaved bad? Let's punish them with no sexytime!", "label": 1}
{"text": "Dont talk to her. Shes making up problems in her head. \n\n\nShe was never a slave. She has no reason to say \"now add the freedom to be left alone\".\n\n\nThey are just toxic waste", "label": 1}
{"text": "This tactic isn't even unique to the left. In 2012, in a last-ditch effort to shore up her unpopular campaign, Josefina Vázquez Mota, then presidential candidate of Mexico's conservative, anti-abortion National Action Party (PAN, which, ironically for a right-wing party, means \"bread\" when said as one syllable) made the following cringe exhortation:\n\n\n\"All you ladies, go out to vote, but don't go alone, go with 15 or 30 other votes, go to the polls early before anyone else, invite your children, your friends, and your partners; woe to any partner who doesn't go because we won't give him hanky-panky for a month!\"\n\n\nBy the way, in Mexico this year in June, there were three major candidates, two of whom were women. Men actually voted one of the two female candidates slightly more than women did (90% vs 88%), and 62% of men voted for the winning left-wing candidate, Claudia Sheinbaum Pardo, as opposed to 56% of women. In other words, men—even those in a country that's still much more old-school on gender roles compared to much of the West—will happily vote for a left-leaning woman with a genuinely populist agenda whose party doesn't consistently scold and bash men.\n\n\nMaybe the Democratic Party will finally learn that treating men as horrible sinners who need to grovel and beg for forgiveness for the original sin of maleness is not a winning strategy (nor is enabling a genocide). It didn't learn this lesson in 2016, and now it's paying the price.\n\n\nBy the way, I'm a proud hardcore leftist who despises Trump. I am appalled by the overturning of Roe v Wade. However, I'm also appalled by the fact that the first reaction among the feminist left was to blame men, despite the fact that polling consistently shows that men and women have practically identical views on abortion, and that these are determined entirely by one's political orientation and not at all by one's own gender. The issue is certainly not going to be solved by scolding sympathetic left-leaning men and giving right-leaning women a pass.", "label": 1}
{"text": "https://www.politico.com/news/magazine/2024/10/17/harris-campaign-strategy-men-00184062\n\n\nRead it and acknowlegde how stupid you are.", "label": 1}
{"text": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "label": 1}
{"text": "A growing amount of men weren’t having sex anyway. When will feminists learn that you can’t nag men into voting for your side? If I wanted to get nagged id talk to my mom", "label": 1}
{"text": "Only ideologically possessed sore losers are writing things like this.  Normie men and normie women are going to do what they’ve always done.", "label": 1}
{"text": "Ignore them, Elon is bringing the sex bots anyway. Then they will really be screwed when their car breaks down.", "label": 1}
{"text": "You see how entitled they themselves act? Everything is always about them and what they want. They honestly believe men went to vote with the idea in mind to fuck them over. Even those that don't believe that are so entitled they feel they can tell men how to vote, and it doesn't matter what other issues there are involved in that vote...\n\n\"Were women though so you have to do what we tell you or it's misogyny!\"", "label": 1}
{"text": "they should've been doing that this whole time and only having sex once married anyway 🫥", "label": 1}
{"text": "Of course there isnt.\n\n\nNormal women acknowlegde that men are behind and now need help and women have advantage. Dont waste your time on someone who wishes you would be dead.\n\n\nhttps://www.politico.com/news/magazine/2024/10/17/harris-campaign-strategy-men-00184062\n\n\nRead this and also read a book by Richard Reeves \"of boys and men\"\n\n\nFeminism has created a generation of ungrateful, cynical, malicious, disgusting women who should not participate in society as they are now.", "label": 1}
{"text": "WRONG!!!!!!\n\n\nFreedom to autonomy - men are hooked on child support, whereas the woman is free to do with consequences what she wants. \n\n\nIf she gets the baby and man dont , he pays.\n\n\nIf she doesn't want a baby and man does, bad luck for a man.\n\n\nAll of the issues listed men dont have the same.\n\n\n\"The article doesn't say anything about revoking any of the freedoms mentioned in the OP:\"\n\n\nOP didn't say anything about revoking any freedoms, only that women have it better, alongside other laws.\n\n\nSHAME ON YOU FOR TWISTING WORDS! SHAME!", "label": 1}
{"text": "Is op sane", "label": 1}
{"text": "I'm not gonna say anything back.\n\nYou've made 177 comments over the last 3 hours.\n\nMaybe you should get some sleep.", "label": 1}
{"text": "Well yes. While women dont. \n\n\nNo one forces them to be a mother, to work hard or to be a slob.\n\n\nAll of it is accepted for women.", "label": 1}
{"text": "\"i try my best to give everyone grace\"\n\n\nSo... No grace?\n\n\nLmao", "label": 1}
{"text": "Fix your boys first. Then we can talk about your opinion", "label": 1}
{"text": "How would you know? Are you fucking 1000 years old?\n\n\nWhen will this shit stop?\n\n\nAre you insane?", "label": 1}
{"text": "Yeah she needs to relax a bit", "label": 1}
{"text": "Ah yes, teach men to vote red again. Works every time", "label": 1}
{"text": "\"It is not a punishment towards men; that is by far the least of our concerns. It's just that sex isn't worth the risk that comes with the abortion ban. It's not to be a petty bitch; it's literally just self-preservation and protection\"\n\n\nNobody cares what you want.\n\n\nYou have 42 types of protection. If you are scared, dont fuck and rot alone.\n\n\nNormal women who are not batshit crazy know that you spew entitled bullshit.\n\n\nSelf preservation and protection?\n\n\nSo you will stop being promiscuos only because your rights have been taken away? \n\n\nThats a good start! Less whores! \n\n\nIm happy for it!\n\n\nI sincerely thank you from bottom of my heart and wish you a nice day.", "label": 1}
{"text": "Who even says this? Bro...", "label": 1}
{"text": "Lies.\n\n\n\n\n\"You should be able to understand the concept of an abortion ban, right?\"\n\n\nYou should be able to understand the concept of men failing out of the society, right?\n\n\nIts far more requiring attention.\n\n\nStop whining and man up.\n\n\nOh wait. I already heard that phrase. Thousands of times.\n\n\nFrom you.", "label": 1}
{"text": "\"If we wanted to withhold sex as a punishment, why would THIS be the last straw? \"\n\n\nBecause you are insane?\n\n\nYou clearly know men love sex and they would die for their women if in love. \n\n\nYou did jack fucking shit for men and i saw through your comments.\n\n\nI have an advice for you:\n\n\nNow you need to carefully think about to who you spread your legs to.\n\n\nLike in the old times and like men do it.", "label": 1}
{"text": "What a bs response. Please. Dont make me loose even more respect.", "label": 1}
{"text": "\" Abortion bans killing women.\"\n\n\n40000 men kill themselves every year. \n\n\nYour argument is bullshit. What is more worrying issue?\n\n\n\"Femicide becoming an even more pressing problems. across the globe. most of the world isn't the USA. The vast majority of women still don't have rights\"\n\n\n\n\nMen dont have parental rights in US. \n\n\nWhat is more worrying issue? Helping men in your own country having THE SAME FUCKING LAWS or helping women in other countries?\n\n\nYou traitor.\n\n\n\"1900-1950's nearly 60% of American lobotomy patients were women. many women in the 1950s took medication to help them cope with being a Sahm, Barbiturates: Also known as \"mother's little helper, Anti-anxiety medication and antidepressants: These drugs were commonly used by housewives in the 1950s. Miltown was one of the first and most popular drugs of this type. \"\n\n\nAgain, shut up with century old information. Nobody fucking lives anymore from that time and if they do, they are almost dead.\n\n\n\"All of the worst things know to happened to women in the past 100 years. that we know of. When will this shit shop ?\"\n\n\n\n\nListen here. \n\n\nI will be expecting a son.\n\n\nhttps://www.politico.com/news/magazine/2024/10/17/harris-campaign-strategy-men-00184062\n\n\nHere are the issues which has been talked and pleaded with women for YEARS for them to join us and help the boys. \n\n\nI will not fucking help women, until they fix the education system and give the same rights to men and boys.\n\n\nYou hear me?\nYou understand me? ", "label": 1}
{"text": "The women are emotional again. Don’t take anything that they say seriously when they are in this state", "label": 1}
{"text": "there's no point in trying to fear-monger votes anymore. you lost. go to twoxchromsomes and cry into your echo chamber. its all you can do now. back to  your hole.", "label": 1}
{"text": "I think you should leave this sub.\n\n\nYou are blaming men for the past sins.", "label": 1}
{"text": "Haven't had sex with the GF in a couple months and I feel fine. Actually might break up with her.\n\nBeen single most of my life. Why care now?", "label": 1}
{"text": "Looking forward to seeing how white women overwhelmingly voted against their rights again", "label": 1}
{"text": "Yes, just stop whining.\n\nYou don't deserve to have sex if you can't even afford to get an abortion. \n\nGet your shit together first, I don't wanna hear excuses like I didn't have the money to go to another state.", "label": 1}
{"text": "“Sex isn’t a reward!”\n\n“Uses sex as a weapon” ", "label": 1}
{"text": "We fix our own cars and hope the sexbots keep you away from real women who find you gross and creepy.", "label": 1}
{"text": "Since ivf is next to be banned, I looked up stats.\n\n\nWhy are men trying to have kids with older women? If she's over 30, she's too old to have kids with.\n\n22-26 is peak years for women, preferably with a 35+ year old man.", "label": 1}
{"text": "woof", "label": 1}
{"text": "![gif](giphy|L3X9GvVhP1nY23Ah6u)", "label": 1}
{"text": "Red pills aren't brave enough to say this IRL.", "label": 1}
{"text": "If that user is a woman your flair no longer checks out", "label": 1}
{"text": "It's just a terminally online minority of foids malding. Nothing's going to change, if you're chad they'll fuck you and if you're ugly they won't.", "label": 1}
{"text": "\"your help is not needed nor wanted. Traitor ???? for wanting to help people ???\"\n\nIf a man has his arm cutoff and is bleeding or a woman has her nail broken who do you help first.\n\nI bet you will help woman first, right?\n\nYou are blatanly sexist towards men and you dont care to even hide it. \n\nBlocking your ass.", "label": 1}
{"text": "Then hopefully my hard work won’t go to waste", "label": 1}
{"text": "Show me legislation then. It seems to me that you are just spamming nonsense and nothing else.\n\nSupport your claim or i will report your for spam and contentless rhetoric.", "label": 1}
{"text": "Well if you believe the hags on this thread that’s in peril (they’re sadly wrong)", "label": 1}
{"text": "So you're saying they're asking for it?", "label": 1}
{"text": "Thats not how it fucking works. Show me where its stated that men are legal guardians just the same as women.\n\nYou keep pulling nothing out of your thumb.\n\nEarth is flat.", "label": 1}
{"text": "Boo hoo. You can't murder your unborn child. Suck it up.", "label": 1}
{"text": "This is a load of mental gymnastics and a poorly veiled attempt to say \"I don't know how to express love to someone without having sex with him.\"\n\nAnd yes, something is wrong with you if you think that way", "label": 1}
{"text": "Uh huh, says the hysterical loon who thinks President Trump is basically the Taliban or the American Nazi Party, when really it's just going to be more or less a continuation of the same American regime we've known over the past 20 years. \n\nTake your meds, ma'am.", "label": 1}
{"text": "No idea about political struggles, but withholding sex might fix a problem with angry incels, that will show them. /s", "label": 1}
{"text": "I speak for all the older mothers, women, and people you accuse me of seeing as \"human garbage\" in my family and community when I say we don't care if *you specifically* bleed out and die. \n\nI don't think women are human garbage. But democrats come very close along with socialists, communists, and anybody who believes in natural equality ideology.", "label": 1}
{"text": "Lol, fucking loser. I'm European. You're genuinely getting a power trip out of being an actual fucking creep because you think you have more power over me now. Fortunately, I wasn't born in the cesspit that is the US. Abortions are legal and free where I live. \n\nAnd no, I don't know men would die for their women. I wouldn't even want my man to do that, lol. \n\n>You did jack fucking shit for men\n\nWhat is this even supposed to mean. \n\nOnce again, that last bit is actually just fucking creepy. I don't know what went through your head to think it was okay to type that. It's embarrassing and really, really weird. I literally have a boyfriend so what the fuck is it even supposed to mean?\n\nAnd bro, please be a bit self-aware. You're some awkward dude on Reddit having anime/4chan villain monologues on a red/purple-pilled sub. Why on *earth* would I take advice from you?", "label": 1}
{"text": "The biggest problem with this is women's ill treatment of men is probably the main reason things went the way they did. Doubling down is a dumb idea.", "label": 1}
{"text": "Women who say they won't have sex are already democrats and feminists, the ones who will suffer from this are their male partners, who are democrats. \n\nDo feminists sleep with conservatives? No. \n\nDo feminists sleep with incels No.\n\nDo feminist sleep with redpillers? No.\n\n So I agree with you that it's useless.", "label": 1}
{"text": "LMAOOOOOOO this is so ridiculous. Women throw a tamper tantrum like teenagers because trump won.", "label": 1}
{"text": "Ive always hated white women so that tracks", "label": 1}
{"text": "the best would mean men having 6 packs unfortunately that requires a level of training that eats up a lot of time so plenty of men forgo.\n\nso now what, poor women?", "label": 1}
{"text": "\"Can men not get mental health help in all states? Because women can’t get healthcare in all states? So these aren’t even the same thing\"\n\nhttps://aibm.org/commentary/mental-health-with-men-in-mind/\n\nWorlds very first mental health program FOR MEN. Yes. Very first. \n\nYou are so out of touch with your reality you didnt even know that mental health support that women receive is NOTHING like men. Which havent been receiving at all.\n\n\nDo you have no shame? How old are you?", "label": 1}
{"text": "I think you’re out of touch considering you seem to spend all day spouting hatred for others from your mommy’s basement. Have you ever thought about getting a job? Learning a hobby? Making a friend? All would serve you better than whatever you’re doing on Reddit all day long.", "label": 1}
{"text": "You have 65 thousand karma. \n\nBe silent.", "label": 1}
{"text": "Im screenshotting this lol.", "label": 1}
{"text": "I'm a lot more informed than you are. I read both sides. You only read your echo chamber.", "label": 1}
{"text": ">Men could vote because they were drafted for the war.\n\nNo.  Originally, rich men could vote because they owned land.\n\n>Oh, you didn't know? You didn't know that men dont have any official parental rights?\n\nMen do have legal rights to their children.  It used to be that men only had rights over the children of their woman they married.  More recently, men have had equal rights to any child they are the purported father of.  They have the right to challenge and establish paternity to legally be the father of a child they sired out of wedlock— I have a cousin who did this.\n\n>Men earned voting by sacrificing their life for your ass so you can argue with us about your problems on your phone.\n\nThe same goes for you.  You have not sacrificed anything.  You are living off the sacrifices of others so you can argue with us about your problems on your phone.  You are not one of those men simply because you also have a dick.  How dare you claim their accomplishments and sacrifices as your own!  You have no more right to claim you did those things than any woman does.  You are a spoiled internet little boy, yelling into the void about women not obeying you in exchange for your offers of nothing, not a valuable family man who fought for freedom or justice.  ", "label": 1}
{"text": "Feminists had it coming with all the apathy and bitterness they had been sowing across not just the US, but all of the Western world.", "label": 1}
{"text": "Wow, they didn’t recoil in horror because you’re bald at 26?", "label": 1}
{"text": "Shame on you.", "label": 1}
{"text": "You’re actual scum.", "label": 1}
{"text": "You're in need of another type of pills rn. ", "label": 1}
{"text": "The thing is that women are NOT logical... most will do whatever makes them \"feel good\"! ;)", "label": 1}
{"text": "I never said women weren't people or less than. Stating differences which are real and tangible is not sexist, that is absurd. \n\nLook you might be able to put words into your husband's mouth to control him but it's not gonna work with me. You are a very manipulative woman and I wish your husband had self respect.", "label": 1}
{"text": "What insult?", "label": 1}
{"text": "I believe you probably aren't happily married, you're a piece of work hahah I do not envy any man who gets into an argument with you, you lack any and all rationality and leverage social manipulation to convince others of fictional things you have made up in your mind", "label": 1}
{"text": "Over the last 50 years, Democrats have held power in Washington at various points. They easily could’ve put in stone laws permanently protecting abortion. They did not. So blame your own party for scamming you", "label": 1}
{"text": "Your perspective is warped from consuming too much echo chamber propaganda. You need to broaden your horizons. You will quickly learn that the sky is not falling and that you have been lied to.", "label": 1}
{"text": "I don't have an agenda, you do. I'm not even american nor do I like trump. I'm just telling you that all the chicken little crying is the same histrionic bullshit that was said last time he was elected. He was going to start a nuclear war, lock up all the LGBTQ people, deport second generation citizens, etc. \n\nYou need to learn the difference between democrat election propaganda and reality.\n\nWhat is the balance of media you consume?", "label": 1}
{"text": "They're the ones who are legally obligated to support the baby, their bodily autonomy is on the line.\n\nTherefore men have fewer reproductive rights than women, glad you agree and backed up my point.", "label": 1}
{"text": "Something like 45% of women voted for Trump. That’s like 25 million women in the US \n\nThey’ll continue to fuck and lust after hot men because of biology lol. Women are extremely shallow, superficial, kinky and sexual with Chad lol\n\nWomen are extremely shallow and superficial just like men.", "label": 1}
{"text": "I really don't get how they expected to win after that debacle. First they act like the whole admin wasn't a dumpster fire. Then they want you to believe he is competent and in charge. Then they coup his ass and act like they loved Kamala the whole time. \n\nI really don't care if people want to be delusional but I draw the line at forcing your delusions on me. I'd have voted D if they could ever run someone worth a shit.", "label": 1}
{"text": "Women withholding sex? Sure until Chad comes along 🤣", "label": 1}
{"text": "Yes. Tell me WHY lesbian couples are notorious for beating the heck out of eachother on a consistent basis.\n\nMen are to blame...somehow here.", "label": 1}
{"text": "There’s no shame in telling you that you’re just stealing the honor of better men.  If gen z women don’t deserve rights for not dying in WWII or Vietnam, you don’t either.  You didn’t do anything.", "label": 1}
{"text": "Who would want to have sex with a fat feminist? \n\nHahahahaha", "label": 1}
{"text": "Ngl very feminine response. Ad hominem. Very feminine", "label": 1}
{"text": "its more like 'i think op might not be well'", "label": 1}
{"text": "I like that they always threaten chastity from the left as if that's not exactly what the far left wants. No wonder you all lost. I'm dying.", "label": 1}
{"text": "As someone whos good looking - wont be an issue for me lol :D \n\nAlso, this trend seems to come from this site, right? \n\nSoooo, after lurking for few years in niche subs and whatever - I can surely say thay average reddit woman is not really that desireable anyway ;D \n\nWho you want to take to restaurant - reddit woman (you know what I talk about hehe) or classy nice girl. \n\nAaaaaand you know the classy loves to be cuddled and have honey poured in her ear, nahz sex wont be any issue mate.", "label": 1}
{"text": "You are throwing personal attacks because you dont like his opinion..weres the “be civil” mods at???? Is this not a personal attack?", "label": 1}
{"text": "If you are into the ugly dudes lol", "label": 1}
{"text": "Im concerned more for his mental wellbeing????", "label": 1}
{"text": "When the post is about punishing men (yes, there are many of those), it's just sad to think they understand the only thing they can provide is sex, and they think it's that valuable.", "label": 1}
{"text": "Lots of women voted Trump and against abortion, this “protest” will most definitely fall on deaf ears.", "label": 1}
{"text": "Cope lil bro", "label": 1}
{"text": "Women right now are only having sex with a select few guys. Right now. Under Biden/Kamala. They have zero leverage.", "label": 1}
{"text": "No you are calling him names under the banter of “he needs help”. The most feminine insult possible to have plausible deniability. We aren’t stupid. You can only pull that on people you are smarter than.", "label": 1}
{"text": "Okay? I have no idea who you are I don’t follow your life story on here. You were comfy w a rapist getting power. You’re one of the bad men.", "label": 1}
{"text": "I see women on twitter saying this is what they need to do. I just think wow they haven’t been paying attention. There’s more and more guys talking about things like redpill, nofap, semen retention, etc. Men have been getting used to not having sex readily available for a while now. So thinking withholding sex is going to force men to do what you want is kind of shortsighted.", "label": 1}
{"text": "OP is about as smart as a box of rocks. He only goes for looks with women. \n\nHe never screens them, and \"accidentally\" has gotten involved with married or taken women where their spouses have chased him out of the house. He's a moron who deserves everything he gets.", "label": 1}
{"text": "You sound like 2015’s retarded basement dwelling product of incest relative.", "label": 1}
{"text": "And yet still more electable or influential than the prosecutor with the charisma of a wet fart and her brigade of seething neckbeards on reddit. Cope and seethe.", "label": 1}
{"text": "You’re practically a trained monkey. Go lick Nick Fuentes asshole.", "label": 1}
{"text": "You don't have that much pull. The women signing up for a boycott weren't wanted anyway or were exclusively Chad's cum rag.\n\nThis isn't going to work for the ladies who want to do this. If they even last a month.", "label": 1}
{"text": ">You seem desperate for some way to force me to date\n\nPlease don't, date. Women like you have been polluting the dating pool. We're just here to tell you that women like you will realize that they're undesirable and, unfortunately, be back to dating the low value men they deserve but don't want.\n\nCiao", "label": 1}
{"text": "Part of me doesn’t believe abortion is so much about a woman’s future as much as it’s about hiding her past.\n\nWomen are delusional because married women will still fuck. And as for the unmarried ones, this is what men wanted anyways. Checkmate, ladies.", "label": 1}
{"text": ">I’m not broken or miserable\n\nYour words say otherwise. I can feel the bitterness exude from you from behind the screen. And piss off. My family neither needs nor wants your pity. If you think I'm already being hateful towards you, then you wouldn't like my mother. She came to the US to escape from communism, and in her words and not mine, anyone who votes for socialism or any kind of leftist policies may as well face the firing squad.", "label": 1}
{"text": "If my partner was ignorant enough to boycott sex with me then they would instantly be replaced by a woman that would not boycott sex with me. There are an estimated 4 billion women in the world so if you are having issues with your partner then just replace them.", "label": 1}
{"text": "Exactly women will still take the risk to have sex with attractive men and they were never fucking LVM anyway 🤣", "label": 1}
{"text": "In relation to this, here is my Blackpill take..\n\n\nwomen are \"Hardwired\" to go against their own interest, when it comes to \"higher order logical reasoning\". This is because, first of all, because of the countless amount of  brainwashing from the machine, that is the far-left, made womens nature more negatively affect the future of the human race  of a better future. \n\nWomen select\n\n1. Aggressive/sociopathic traits- I dont really need to explain this one. Look at true crime and worship of violent criminals/womanizing assholes etc..\n\n2. Height- they will select height to an extreme, even above other traits like intelligence,kindnjess,and other virtues\n\n3. Brawns over brains\n\n4.Brain wiring- their brain wiring is designed to process emotions more than logic. I am not saying a woman cannot be logical but even within a margin, that's how their brains operate. They are about what's makes them \"feel\" instead what makes \"logical sense\".\n\nI can keep going on and on, but in general, this is accurate. \n\n if women where given absolute power in every from of governance, the only positive would be probably, I mean probably, less violence but that's a big iff. We will basically be like bonobos", "label": 1}
{"text": "\\>Nobody healthy or happy talks like you do, especially not in supposed victory— how can you be so bile-filled even when you are given what you want? It’s like the tantrum of a toddler.\n\nLol says the self-righteous liberal twat accusing strangers on the internet of hating all women because her candidate didn't win. Definitely the behavior of a well-adjusted and happy person you're putting on. Cut the act and stop accusing other people of being what you are.", "label": 1}
{"text": "I finally have returned from my temporary Reddit suspension. I came to browse this subreddit first thing after it was done, since I wanted to see how you women were reacting to the election results, and I saw you here.\n\nI just want to say this: HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA", "label": 1}
{"text": "They don't exactly make it a hard sell with how annoying, like 80% of them are.", "label": 1}
{"text": "Right. It's insulting that we're asked to vote for this amorphous concept of \"abortion\" like we don't know how state governments work. Kamala can't overturn a supreme court ruling and the fact like I'm supposed to pretend I don't understand 8th grade civics is insulting.", "label": 1}
{"text": "Ok good for you. Your state and city is almost completely run by Dems and it’s a top performing state. So you are actually an idiot buying into propaganda.", "label": 1}
{"text": "I think we may have witnessed the first \"incel\" election. And by that I mean Incel men may have finally become a political force worth reckoning by the elites similar to how feminsit women changed the political discourse in the post war era", "label": 1}
{"text": " Men don’t ever, and will never, have the right to have sex with women just because they want to and unfortunately for the people who actually care about issues that disproportionately impact men, the loudest voices in the manosphere are the men who are mad about that.", "label": 1}
{"text": "It's rather amusing that you don't like it when I give you the same energy you've been giving me from the moment you began writing emotionally contrived word salads towards me accusing me of hating all women because your poster child didn't win. You don't get to call anyone pathetic when you've been doing nothing but behaving like a hysterical twat accusing random men of hating you with a victim complex and being insufferable and annoying just because your feelings are hurt. \n\nI'm not your therapist. Go there.", "label": 1}
{"text": "Damn, thank you for being a real one.", "label": 1}
{"text": "The same energy?  More lies. I have not once called you anything like “twat” or “skank”.  You’re still getting so bent out of shape over things you are purely imagining to rile yourself up.\n\nAgain.  It’s pathetic.  ", "label": 1}
{"text": "You accused me of hating women including everyone in my family like a typical conniving rat and now you're trying to gaslight me by accusing me of being guilty of your own behavior. That's not a lie. That's a fact. \n\nAnd you want to know what's pathetic is you letting me live rent free inside your head because your feelings are hurt. Like I said, go to therapy.", "label": 1}
{"text": "More wild insults, and more lies. You’re still acting like a triggered lil’ snowflake.  It’s still as pathetic as it was 10 comments ago when you called me other nasty names.\n\nI accused you of not caring about when women die in childbirth because you are the one who said you don’t care.  You launched into me with your “bitch I hope you die” energy when I shared a vulnerability, and now you’re nothing but bile and piss because I called you out on it.  You had nothing but hate for mothers and women, and you call me a fucking skank for not wanting my children to be motherless.  Insanity.\n\nIf you actually loved your family, then my quoting the very words you said wouldn’t piss you off so much you start slinging mud left and right like a rabid dog.  Clean yourself up.", "label": 1}
{"text": "I don't hate women. I hate socialists, communists, and democrats. If you can't tell the difference that's your own damn problem and I couldn't care less. And it's hilarious how much shit you're trying to smear me with while simultaneously accusing me of being angry while you're seething at the keyboard bastardizing my comments as if in pure agonizing rage you've forgotten how to speak English. If you think any of that is an accurate recount of what I wrote, then my dog understands English better than you. \n\nAnd you're the one who initiated this engagement, you terrible excuse of a woman and sorry waste of oxygen. Don't dish it out if you can't take it.", "label": 1}
{"text": "Blatantly hating the other gender just makes you look bad as a person. If it's widespread enough it means we're failing as a species", "label": 1}
{"text": ">Misandry hurts women\n\nHatred hurts those who spread it once people get tired of their shrieking. \n\n>Feminism has given feminists a kind of moral authority \n\nIf they had any moral authority then Trump would not have won. The reality is Reddit liberals lived in delusions that people actually agreed with them when all the conservatives were banned for speaking up in a liberal squawk box.\n\n>Because men vote and you can alienate, demonize, insult men so much before they would rather make it a lose lose situation than support you.\n\nMen’s vote wasn’t the only problem. MAGA women cared about the children and men being ignored by this countries hatred of men which does effect kids. The encouragement of medical transitioning of children by using the same drugs used to sterilized sex offenders.. Also a lot of us saw this sexual revolution as something predators would use on children or for sex trafficking and it happened (look who was making the music your kids listened too, P-diddy, Jay-Z, R-Kelley and USHER).\n\n>if feminists had shown humility and worked together, then things would be different.\n\nCorrect.", "label": 1}
{"text": "I care about people besides myself 🤷🏻‍♀️\n\nAnd I'm 38, so if you're that old it sure explains you as a human being lol", "label": 1}
{"text": "Not a democrat but you are super pissed at anyone that dared to not vote for the democrat candidate. Twisting up that logic pretzel with each reply. \n\nAlso I'm not american and didn't vote for Trump so that is another fail at a soundbite attempt. \n\nYou aren't very good at this you know.", "label": 1}
{"text": "This isn’t a debate.\n\nIt’s just OP whining because some women have standards and he doesn’t meet them.", "label": 1}
{"text": "Men chose between a bear and a woman. Sorry ladies, bear seems less dangerous", "label": 1}
{"text": "If you want to enjoy some unhinged people check out the 2 X Sub. My god the people their aren’t doing okay", "label": 1}
{"text": "Only cause that bear rapes woman, not other men", "label": 1}
{"text": "“All these women are lying, and lying so significantly that the number 4 is GROSSLY INACCURATE by not just like 1 or 2 sex partners but DOZENS!!!!”\n\n\n“SEXLESS MEN ARE HAVING THEIR REVENGE!!!!  You are lying about having reasonably moderate partner counts!!!! ALL OF YOU ARE SLEEPING WITH DOZENS OF MEN!!! And all of the sexless men are deprived victims and this is their revenge because women aren’t sleeping with them!!!!!”\n\n\nBro. This sounds like an angry anime character. And before the mods say it’s uncivil to say that, saying “do you not realize” in three different ways and talking about saying “fuck you to women” for a lack of sex is angry anime character esque. \n\n6 partners across a lifetime. 4 for women.", "label": 1}
{"text": "Add AskWomenOver30 to the list", "label": 1}
{"text": "LMAOO", "label": 1}
{"text": "Go date a bear then and don t complain about the male loneliness epidemic or sexlessness lol", "label": 1}
{"text": "Is this sub mostly women? Confused at the downvotes.", "label": 1}
{"text": "You'd have no sympathy for men regardless, as any woman. All of what you said is just a reversed version of what men say about women.", "label": 1}
{"text": "I think it is in the best interest of men to not date or marry women.\n\nMale loneliness should be fixed by male friendship", "label": 1}
{"text": "So what?\n\nWomen explicitly tell men to gtfo with their issues. Why should men care about misogynistic brown bear that harms women?", "label": 1}
{"text": "I'm sorry the men in your life have only valued you for one thing. I know the day I meet a woman whether she goes into the box of relationship potential, casual sex potential, or just friends. I don't know enough about the way you've treated men in the past, but I'm not really all that surprised with your jaded outlook that you quickly get weeded our as a potential partner", "label": 1}
{"text": "Good for you, men dont have in group bias so good luck.", "label": 1}
{"text": "Did you just 'so-what' the guy you voted for being a rapist?", "label": 1}
{"text": "People are going to ask how trump is going to help men but conveniently forget that kamala couldn't/refused to name a single law that disproportionally affected men during one of the few interviews(call her daddy) she did(relative to trump) which immediately made her worse for some men than trump.", "label": 1}
{"text": "You'd have no sympathy even if the guys here were perfect whiteknight feminists. Nobody insists someone is a whore with 1 body count, you don't have to exagerrate like that.", "label": 1}
{"text": "Because you made your issues by putting a rapist in charge. \n\nThanks for confirming btw", "label": 1}
{"text": "Life doesn’t seem worth living anymore\n\nNot sure if it *ever* felt worth it", "label": 1}
{"text": "It seems you never learn. Your attitude already caused you to lose country to a scarry orange clown, but you double down on your mistakes", "label": 1}
{"text": "Life is not worth living if you will never have a girlfriend\n\nLiteral children are more successful than me.", "label": 1}
{"text": "Being born as a male in the 21st century is one of the worst things that could happen to a person\n\n😔", "label": 1}
{"text": "No place in this world for men\n\nOnce you realize this it is very hard to see any purpose in life. Things you once enjoyed will feel pointless until eventually even being awake becomes a chore.", "label": 1}
{"text": "Lol fag", "label": 1}
{"text": "The mistake of trying to protect myself? \n\nThe only mistake here is underestimating how many men hate woman", "label": 1}
{"text": "men hate women back. You do it, and you get symmetrical response", "label": 1}
{"text": "So men attack woman, woman try to protect themselves and men hate them for it. \n\nYup, makes sense", "label": 1}
{"text": "nah I don't think I will, the mods will probably smite you again for like the 6th time soon enough.\n\nat least you tried building a backstory this time though", "label": 1}
{"text": "Cry me a river", "label": 1}
{"text": ">Woman do care about mens issues.\n\nAAAAAAAAAAHAHAHAHAHAHAHAHAHAHAHAHAA. Omg where did you pull this joke out of? A Christmas cracker? Holy shit you need to go on stage. This is comedy golf, omfg! 🤣🤣🤣🤣🤣", "label": 1}
{"text": "Stay single dude", "label": 1}
{"text": "you fucking ball of slime subhuman -45 iq inbred, you derailed the whole conversation with this shit take ad hominem, OP actually had some fire points and i was hoping some people would engage. blow me fucker", "label": 1}
{"text": "Only savages resort to violence \n\nThanks for the threat though, your really telling on yourself today", "label": 1}
{"text": "lol, you started with calls for violence just a comment above. Then you immediately forgot it and tried to play a victim card.\n\nThis is exactly why your team loses - you fail to understand consequences of your words and actions", "label": 1}
{"text": "\"Get a divorce now!\" \"My husband won't agree to a vasectomy it's ww3!\" (Literal words) \"Just goes to show Reddit women are as unhinged as incel men, just in their own way.", "label": 1}
{"text": "You've reduced yourselves to the level of prostitutes. But hey, atleast you get free food and money 🤣\n\nWhat sane man do you think would respect a woman like this?", "label": 1}
{"text": "I don't care if it's abandoned. Women are in hysterics over losing the election, so I'm calling it hysteria. Simple as. \n\nYou lost. Get over it. Enjoy 4 years.", "label": 1}
{"text": ">Looks at all your whining in this forum alone\n\nTo you it has to seem like whining because since you've reduced yourself to being a prostitute for free food (sad), my post are essentially about women like you. So you calling it whining is inly natural.\n\nAnyway, good luck with prostituting yourself for free meals. Must be really fulfilling and worthwhile.", "label": 1}
{"text": "Well, at least the Force is still female!", "label": 1}
{"text": "Guess those women were right all along about you.", "label": 1}
{"text": "By the way you ever seen this [video](https://www.youtube.com/watch?v=uI5WRxknOqA)?", "label": 1}
{"text": "I mean... I don't ever want anyone to suffer for any reason, but they have spread hatred against men for more than a decade now. They are literally part of the problem.", "label": 1}
{"text": "Seeing the answers, and women not getting the point of OP's post, I see a schism between sexes the size of the Grand Canyon\n\n\nEither we help eachother, or it will be selfishness for all. Men actually were too generous, but it's never enough", "label": 1}
{"text": "I don't know what you are talking about. I just like the song! Catchy tune! In any case it was made by [Unicef](https://www.unicef.org/) so you should be more respectful. There's dying children in the world and Unicef helps make them not dying by giving them water and shit. Fucked up that you are against Unicef. What are you? Racist?", "label": 1}
{"text": "It's by scmp not unicef lol. You fell for propoganda like you did with Trump. Also don't act all clean.\n\nhttps://www.madhousemagazine.com/california-enacts-alternate-side-of-the-street-pooping/\n\nYou got dirt too or should I say shit in streets lol. So much for first world country. LOL", "label": 1}
{"text": "Then show me the archive of the unicef link? Even the watermark in the video doesn't have unicef logo but the scmp. \n\n>Are you saying that as an American I'm not allowed to be clean?\n\nYou shit in thw streets too. I never said you aren't allowed to be clean. Are you dumb? oh I forgot you are an American so it's implied. I forgot, my bad.", "label": 1}
