{"text": "Braces and all, she looks like 1/3 of the girls I saw working at a job that requires you to be 18+ to be hired. If somebody made me put money on the age of the girl in that picture, I would say 17, and that's me being conservative", "label": 0}
{"text": "it's an 18+ anime convention themed around hentai. for example the badges all have a picture of a big titty cow girl doing ahegao. and all the panels are about kinks. there's a fighting game room though, that's normal", "label": 0}
{"text": "Check in with me when she gives you her review next quarter - I see areas you could improve. In your coach now - trust me, you need it", "label": 0}
{"text": "Ask him to bring two", "label": 0}
{"text": "Im in shape right now and am lean but I work out. I am trying to a gain more weight. I am black. Seems like we are seen as more attractive when we do follow the stereotypes both looks wise and the way we act.", "label": 0}
{"text": "Ngl it would be hot if she really wanted it\n\nBut probably no", "label": 0}
{"text": "Okay we'll see if these last 4 years were a fluke. Thanks.", "label": 0}
{"text": "Lmao on what planet is 21 \"ancient\"\n\n\nThe irrational fear of aging that zoomers have is so silly", "label": 0}
{"text": "no offense but i would not want to associate myself with that", "label": 0}
{"text": "I don't understand what you think these are supposed to prove in your mind... this is weird.", "label": 0}
{"text": "buy a dildo i guess bc no more sex", "label": 0}
{"text": "Women don't lower their standards willingly. Men will lower their standards if the girl matches a lot of non-physical traits that they value. This is also one of the reasons men confess their love for their female friends. Not because they are being dishonest but because slowly fall in love with the person as they get to know better. But women act as if that's the worst thing a man could ever do. It is also true that men will lower their standards for sex because unlike they don't get laid as often or as easily women get laid.", "label": 0}
{"text": "I do not have anything to lose. more importantly they paid me", "label": 0}
{"text": "What was the point of this - you one of those study-savers I was mentioning?", "label": 0}
{"text": "hate speech???\n\nhttps://preview.redd.it/zzvac55xrswd1.jpeg?width=1080&format=pjpg&auto=webp&s=d3cda0c97d14c42f8e2d99705eab3ebf7774a626", "label": 0}
{"text": "You’re right definitely sounds like a pokeball situation 😂 “Go! Girlfriendeon!”\n\nAnd thank you very much! I am just focused on school in the moment though ☺️(college)", "label": 0}
{"text": "I would go one step further and say that society insiting that women's emotions be everyone's problem has taught many women to behave as though they are entitled to make their emotions everyone's problem. And this entitlement is what people are really referring to when they say women are more emotional. \n\nMen are emotional but the message they get their entire life is that their feelings are inconvenient for other people and/or make other people uncomfortable and that is more important than their feelings.", "label": 0}
{"text": "Not sure what's to debate, there's plenty of studies about how women overrate various aspects about their looks. It probably applies to their rating of personality and other traits. Or their success as a mid level corporate drone making them an independent woman... that'll work in a cubicle for life.", "label": 0}
{"text": "gen z men look so fucking old and worn down to me and im in my mid 30s", "label": 0}
{"text": "So you proved my point \"here's a study, men are worse!\" Delayed maturity.", "label": 0}
{"text": "I've never known anyone that has been taught or taught others that BS. I've seen many and I mean *many* men that are taught they need to provide for their women. That they need to have a good job in order to be valuable at all.", "label": 0}
{"text": "It is the same and you need to stop fooling yourselves.", "label": 0}
{"text": "Complete sarcasm. You didn’t pick it up in the last sentence? 😂\n\nWomen on one hand claim marriage is this awful institution then keep pushing for it. Odd huh. 🤔", "label": 0}
{"text": "Are you a woman?", "label": 0}
{"text": "i have an old soul /s", "label": 0}
{"text": "Marilyn Monroe was literally a renowned sex symbol with men. Basically all of the women that I listed are sex symbols.\n\nMegan Fox and Rihanna, at least, are very popular with men. So were Pamela Anderson and Angelina Jolie.", "label": 0}
{"text": "She did an edit after you commented that.", "label": 0}
{"text": "Being a millionaire is very altruistic to your family. Ever heard of nepotism?\n\nWhich is exactly the point. Men are expected and taught to provide for theit family and women are taught to be independent.", "label": 0}
{"text": "Dude at least wait until ai becomes sentient before you bring the government into it damn", "label": 0}
{"text": "some things are really down to lifestyle. if you eat terribly, smoke, drink a lot of alcohol, don’t exercise, etc then you are going to start looking old earlier. some people also have unfortunate genetics", "label": 0}
{"text": "You’re a gym guy right? Buy a lot of protein powder in bulk. That might be a good idea.", "label": 0}
{"text": "I'm not questioning your right to say anything.", "label": 0}
{"text": "Most tradwife influencers are rich. And they have a job - their social media crap.\n\nAnd when it goes wrong, it’s awesome /s\n\nhttps://msmagazine.com/2024/04/10/tradwife-feminist-divorce-women-home/\n\nWe had teadwifery. It sucked. That’s why women went to work outside the home ", "label": 0}
{"text": ">Men commit most violent/irrational crimes. (Not saying that most men are criminals, obviously, but the majority of criminals are men.) How many female mass shooters/serial killers are there?\n\nWhile I agree that men are more likely to act-out violently, I don't think that's the full picture if we're talking about being emotional. I think a lot of female antisocial behavior goes under the radar because it's relational aggression - like gossip, ostracizing, emotional games, character assassination, and lies. I've heard some stories about groups of women who suddenly ostracize one of their members. For example, I've heard stories about women in high school who's entire group of female friends just stopped talking to her one day. Or another one where a woman in college got kicked out of her sorority. Neither of them knew why. Just seemed like \"mean girl\" kind of stuff. Personally, I've seen quite a few cases of women suddenly ostracizing their best friend.\n\nI've generally found women to be more prone to unpredictable changes in mood. For example, a few years ago I had a friend I'd occasionally hang-out with. At one point, she just stopped returning any of my text messages when I asked about meeting up. \n\n>Men are usually the ones who start wars for (seemingly) stupid reasons. Most war crimes/atrocities and genocides in history were committed by men. Hitler and Stalin were pretty emotional/irrational. (The vast majority of world leaders have been men, to be fair.)\n\nThere was some historians who went back and looked at wars. What they found was that female leaders (i.e. a Queen when there was no King) was more likely to start wars than kings were. He wondered if maybe these female leaders were seen as weak, and attacked by other kingdoms more, but that wasn't the case. It appears that female leaders actually start more wars than men. Probably the reason we rarely see wars and genocides by women is because female leaders are rare, not because female leaders are peaceful. Here's an article about it: \n\n>After sifting through historical data on queenly reigns across six centuries, two political scientists have found that it’s more complicated than that. In a recent working paper, New York University scholars Oeindrila Dube and S.P. Harish analyzed 28 European queenly reigns from 1480 to 1913 and found a 27 percent increase in wars when a queen was in power, as compared to the reign of a king. “People have this preconceived idea that states that are led by women engage in less conflict,” Dube told Pacific Standard, but her analysis of the data on European queens suggests another story. [https://www.thecut.com/2016/01/european-queens-waged-more-wars-than-kings.html](https://www.thecut.com/2016/01/european-queens-waged-more-wars-than-kings.html)", "label": 0}
{"text": "You stated it’s not men saying men will fuck anything, yet I show you in one single reddit thread, with multiple men stating, yep…it’s pretty common knowledge that men will fuck anything.  Some saying “I will fuck anything”. Is it weird that you fail to recognize that this idea comes directly from men?", "label": 0}
{"text": "“Degrade themselves” how? \n\nAlso he impregnated a woman. So him fucking someone unprotected and then probably doing that to her is all gravy I guess? Lmao", "label": 0}
{"text": "Lmao true", "label": 0}
{"text": "Correct and she also has the final say each time too. \n\nso dont have sex with women who aren’t on the exact same page as you and whos choice you fully trust. \n\nits not rocket science.", "label": 0}
{"text": "Coping with what?", "label": 0}
{"text": "you can't buy an american, not since 1865", "label": 0}
{"text": "those arent the same level and you know it", "label": 0}
{"text": "Idk. I feel that way at 23. Doesnt seem young at all", "label": 0}
{"text": "Average romance novel/movie lol", "label": 0}
{"text": "How can you easily compare your wants and needs to strangers?", "label": 0}
{"text": "I do agree wholesale that many feminist preach being needlessly hostile to men for no good reason and that is cringe", "label": 0}
{"text": "Women say their league is who is willing to take them on a date and not who’s requesting to be in a relationship. Women easily date up, or have casual sex up. You tell them that and that just insults their ego.", "label": 0}
{"text": "It just bewilders me as a man that a generation ago the majority of women had the ability to OPT OUT of corporate slavery and gave it away. \n\nthe meme that pre 1990 women werent allowed in the corpo world is ridiculous too, there were female lawyers in the 40's", "label": 0}
{"text": "Men don't really fall in love with female friends they weren't attracted to initially. They build a little more attraction just enough to beta buxx them in a relationship or use them for a fwb. Women are more likely to fall for someone they aren't initially attracted to. Many studies show even in a LTR men weigh attraction more. It's a larger part of their pie chart of what they require for LTRs.", "label": 0}
{"text": "Just curious, what is your argument here? Are you saying that men don't rate corpses or are you saying that it's not that often?", "label": 0}
{"text": "I try to avoid protein powders because of the artificial sugars", "label": 0}
{"text": "That’s a result of the patriarchy. And you use it to claim that women are better than men, even though it’s a result of the very same patriarchy that oppresses you.", "label": 0}
{"text": "You know I absolutely love how the article you sent has absolutely no facts or real statistics. It's essentially just a really long opinion piece.", "label": 0}
{"text": "It is [more common](https://en.wikipedia.org/wiki/Homosexuality#Demographics) for men to be monosexual than women. That is, attracted to only one gender, whether men or women, but not both.", "label": 0}
{"text": "Depends on what kind of lifestyle you're pursuing. If you're fine with having little, you can pull off having only one working partner. \n\nRight now I bring very little money, because I'm concentrating on my studying, so husband basically supports both of us. We can pull it off by limiting our spending and not having kids right now. Theoretically if I was okay with being a SAHM, we could have a kid instead of me studying...but no, thanks.", "label": 0}
{"text": "that would be quite litty but no just standup", "label": 0}
{"text": "im bald!!!! but I will have a wig for cosplay so we'll see", "label": 0}
{"text": "The whole point of vasectomies is to cause impotence. That’s literally the whole point of them, to not be able to get someone pregnant. Holy fuck. You clearly don’t know what you’re even talking about anymore", "label": 0}
{"text": "lol what \n\nMy cake? What are we even really talking about rn why don’t you say what you mean", "label": 0}
{"text": "Childfree all the way", "label": 0}
{"text": "How many times should I say how I feel? Who is mad?", "label": 0}
{"text": ">What I’m getting at is that economics plays the biggest role in creating any cultural trends. With wealth inequality at an all time high, and women (low income POC women especially) still shouldering the majority of the unpaid and undervalued child rearing duties and other labor in the domestic sphere, you cannot be surprised when upwards socioeconomic mobility becomes a huge motivator for low income POC women to seek out wealthier men.\n\nWhy is them wanting money seen as better than a guy dating a woman he thinks is attractive?\n\n>Exactly. For the most part, this is true. So if financial practicality is removed for those POC men to have plausible deniability in that they don’t have racist dating preferences, doesn’t it make lot more sense why women give each other more benefit of doubt in their interracial relationships?\n\nNo. It is just attraction. Wanting someone for financial reasons should be the one that is seen as weird. One is genuine and the other isnt. They gain nothing and still date them. And I doubt finances are the main reason for women. They just find those men more attractive. \n\n>Not because I believe that women are somehow magically less capable of racism than men are, but because there are strong socioeconomic reasons for POC women to seek out wealthier (white) men, especially as wealth inequality everywhere gets worse. And sure this also grants plenty of women plausible deniability in their secret racist preferences, but the fact still stands.\n\nWhy is that acceptable? Like I said before most people end up with those on their same economic level. So the women most likely will not end up with her idealized version of a rich white man. He will be in her income range. Its blatant pedestalization", "label": 0}
{"text": "Sure, but there needs to be some experience otherwise it doesn’t really make sense. I’ll take your analogy, let’s say people wanted to discuss working and that sort of thing. People with bad jobs and good jobs would both have experience and can talk about it. What has happened is that a bunch of people who have never had a job want to come in and talk about what working is like. Not only that but they are insane and belligerent. And the all the people who have worked even if they initially disagreed are annoyed by the non-workers. What we need to do is remove the non-workers from the discussion.", "label": 0}
{"text": "Oh boy. Spicy one. I have no skin in this game. I'm here for the fireworks.", "label": 0}
{"text": "One day he’ll take off that hat", "label": 0}
{"text": "🤦‍♀️\n\n\nShe’s also splitting the bills with you. So that doesn’t make you immune to doing housework. \n\nYou reach for heavy things or far away things, how often? Like once a month? Once every couple months?\n\n\nAnd what exactly do you protect her from that a gun can’t do better?\n\n\nSo basically, your argument is that because you occasionally grab stuff or move heavy things, you’ve improved her quality of life so much that you’re exempt from housework. \n\n\nThe way men here behave and speak. Then you guys claim to be blindsided when abandoned.", "label": 0}
{"text": "My philosophy is that I don't deserve extra treatment just because I'm a woman. It's lowkey offensive to me and I feel awkward accepting grand expensive gifts if I don't give something in return.\n\n\n\n>Better yet, he's had a history of giving tons of money to female webstreamers,\n\nI don't want to know things like these about him, why would he ever tell me this wtf. I would not date someone who does this _right now_ so it would be great if he matured and stopped doing that.\n\n>giving all his emotional validation \n\nIf he doesn't give me the emotional validation that I want I wouldn't be with him.\n\n>you make all the effort for him in terms of cooking for him, cleaning for him\n\nI believe in equal partnerships, I'm not the one who is going to clean and cook for him while he doesn't do the same for me, regardless of his past relationships.\n\n>it's not so much money in itself but rather the effort he puts for you\n\nAm I satisfied with the effort he's putting in? If yes, cool, if not, bye. I don't care and don't want to hear about his past relationships.\n\nIt would hurt me if he found me less sexually appealing than his ex, I'm too insecure to deal with that, I couldn't stay with him in that case. But if he tried something with his ex and didn't like it, I'm not going to make him do it again with me.", "label": 0}
{"text": "Being short is a demerit.\n\n\nIt is not some random quirk that thewoman might live independently. As would be expected if  women truly had a huge variation in sexual attraction for.\n\n\nShort men can be loved but they are loved inspite if their shortness rather than because of it.", "label": 0}
{"text": "i'm not 100% up to speed with US law but i'm pretty sure abortion is legal to some degree in the majority of states, isn't it?\n\n[https://edition.cnn.com/us/abortion-access-restrictions-bans-us-dg/index.html](https://edition.cnn.com/us/abortion-access-restrictions-bans-us-dg/index.html)", "label": 0}
{"text": "I think the dynamic between men and women can be fairly labeled as awful without specifically saying one or the other is awful", "label": 0}
{"text": "If you’re more efficient with chores, why not do more chores?", "label": 0}
{"text": "man this is gonna be kinda mean, but.....\n\n[https://www.instagram.com/nicolee.wongg/](https://www.instagram.com/nicolee.wongg/)\n\n[https://www.instagram.com/\\_libbyyx/](https://www.instagram.com/_libbyyx/)\n\nlook at the girls in these profiles. \n\nlack of a visible eyelid crease due to a prominent epicanthic fold(\"monolids\") is basically universal among them, it seems small but it makes a big difference IMO, they're much less expressive. additionally this often makes the eyes much smaller and/or positively tilted which are also unattractive imo. and notice how they try to hide this with HEAVY eyeliner, very common in east asian women IME. \n\nalso the facial profile tends to be flatter. the eye area, where the eyeballs are more shallow in relation to their orbital bones. in some side profiles you can see the round outline of the eyeballs physically bulging out of their face. as well as the jaw, most of them have very little forward growth(this one is far from exclusive to E asians just more prevalent). \n\nlastly many of them have overly prominent cheekbones and their faces are just too \"big\".", "label": 0}
{"text": "\"get a hobby\" so it said Lucy, 31 years old, whose Tinder bio is:\n\n\"I like to travel, Netflix and chill. I hate lies\" with no hobbies at all and has +99 matches even with only one picture on her Tinder", "label": 0}
{"text": "Saving this. Thanks. Been looking for this data.", "label": 0}
{"text": "For months if not years lol", "label": 0}
{"text": "![gif](giphy|LGMs59sZyaK6A)", "label": 0}
{"text": "Most people have zero understanding for my career, so I never expected that.", "label": 0}
{"text": "https://preview.redd.it/qjl15lfs7ywd1.jpeg?width=601&format=pjpg&auto=webp&s=55e1b1e4d58f97896793ebc73f64c612800e2b44", "label": 0}
{"text": "You literally told me that because you grab for heavy things and split the bills (that she is also splitting), that you’re entitled to never do chores. Her assumption is not one bit “pathetic” because you explicitly state that you don’t do chores.", "label": 0}
{"text": "i think you guys are being overdramatic tbh", "label": 0}
{"text": "Yeah this guy isn’t even close to someone I’d date in the first place lol.", "label": 0}
{"text": "Did you not know a tavern environment would be like this? Or did you know you would have a bad time but went anyways?", "label": 0}
{"text": ">What percentage of Blue Pillers are gay? \n\nLol just lol", "label": 0}
{"text": "The virus is Hypergamy LOL. Jokes aside, you make a good point. It's odd that's the only takeaway they could think of.", "label": 0}
{"text": ">I can’t believe most people here are white\n\nThis is only true if the demographics of the daily are the same as the main sub.", "label": 0}
{"text": "No", "label": 0}
{"text": "Or Purple. Or no flair.", "label": 0}
{"text": "Because OP said she is. She didn’t say “a shit woman”.", "label": 0}
{"text": "There is my brother but grasshopper it comes by saving your money and going overseas to the Philippines and or eastern Europe to meet woman.  It’s not this man’s fault he is a generation Z male who is probably the most oppressed category in our country.    He doesn’t know that in other countries there are woman who like average and below average men.  There are normal women in these countries.  Many generation Z males are sexless like maybe 20-30%", "label": 0}
{"text": "Yes, 1/3 of women in the us have had their right to abortion taken away in the last few years.", "label": 0}
{"text": "I remember a thread on here once upon a time about a woman who had gone on a trip without her boyfriend and absolutely refused to pay for him or wait for him to save up the money to go on the trip.\n\nThinking that you're above generosity or reasonable obligations to your partner is a good example.\n\nAlso, the women I've known have tended to tie a lot of their self-worth to their degrees and education. They genuinely feel like it makes them different people and they're worth more because of a piece of paper.\n\nI have never met a woman that was philosophically capable of fully seeing themselves as an equal with someone that did not share their accolades because they've internalized that their place on the hierarchy is directly tied to them.\n\nA good man isn't a good man unless he's got a good job and good money, thinking.", "label": 0}
{"text": "I think most people can.  I think TRP speaks to dudes who believe “but I’m the good guy.  I’m special” types who think they should be getting the girl just like it always happens to the “good guy” in movies and tv.", "label": 0}
{"text": "Why would I not refuse to cohabit instead?", "label": 0}
{"text": "So you have no dv charges, no back child support, and no other reason why you have zero custody?", "label": 0}
{"text": "just debate dating without talking about \\~95% of dating", "label": 0}
{"text": "Me", "label": 0}
{"text": "It's not an \"easy instant fix\" when you live together, let alone have kids together, and literally no one thinks it is. \n\nIf your longterm partner went to the trouble of a breakup and a move and you're telling yourself a silly little story about how you were unfairly jettisoned due to her unhappiness with other aspects of her life... no you weren't. Move on. She might miss your support but she doesn't miss you, and you'd be way madder if she stuck around using you while not actually liking you.", "label": 0}
{"text": "I love turning post wall women into single moms as well", "label": 0}
{"text": "That person is stupid and has never read TRP. That reads like leftwing kook conspiracy theories.", "label": 0}
{"text": "Why do women fear the wall tough?", "label": 0}
{"text": "No. But back child support would be irrelevant anyway because custody would have been denied before there was ever even a child support order.", "label": 0}
{"text": "Address the question:\n\nBeyond occasionally picking up heavy things and grabbing stuff. Let’s say once every few months:\n\nHow are you adding value to her life? \n\n\nAnd why wouldn’t she leave? You just provide extra work. She would still need to split bills anyways. She can get a roommate instead.", "label": 0}
{"text": "Honestly, I’ve noticed that female friends tend to care about a man’s feelings way more than other men. A lot of women will comfort you and support you, while most men will just make fun of you or ignore you in my experience.", "label": 0}
{"text": "Aka confident and secure women are less likely to put up with my shit", "label": 0}
{"text": "Re read that 2nd sentence of yours and really think on that.", "label": 0}
{"text": "There’s a guy here in this thread saying that because he splits the bills and grabs heavy things from time to time, he is adding value to a woman’s life and therefore exempt from housework. Considering that so many men have this mentality, why wouldn’t it be reasonable to assume she was justified in leaving?", "label": 0}
{"text": "So yes, you are begging the question because you are just automatically assuming the answer. And the answer you are assuming is men bad, women good. Shocking.", "label": 0}
{"text": "The truth", "label": 0}
{"text": "Added.", "label": 0}
{"text": "English is my first language and you’re getting really seemingly upset about obese women fucking that you’ve now resorted to ad hominem. \n\nBye now", "label": 0}
{"text": "Just because someone is unemployed, doesn't mean they can't talk about job market or they don't reflect it. Maybe there is an economic jobs and jobs are very hard to find. But honestly, look at that single male graph. Let's say a tiny part of them is spinning plates and others had some experience before. That's still a lot of bodies to remove, isn't it?", "label": 0}
{"text": "One thing that ruined DB was the power-scaling for sure specifically god-ki \n\nIt so wild that any random character with normal ki like Friezs,Broly,Gohan can outright match the power of SSG/blue goku or vegeta \n\nThey completely ruined that concept", "label": 0}
{"text": "havent you posted about hating similar environments before? cant you do an activity that one of you wont shed tears over?", "label": 0}
{"text": "I always thought 5.) for the redpill was always “Become like ‘them’ and then you’ll get what you want.” \n\nThat’s what all the gurus sell online anyway.", "label": 0}
{"text": "I will also add that I think peceptions of E asian women are disproportionately influenced by E asian female celebrities, and while I also find many of them attractive I think they are far from representative. \n\nthe beauty standard in E asia is specifically to not have exaggerated asiatic traits, especially not \"monolids\". and those women achieved that with some combination of genetics and plastic surgery.", "label": 0}
{"text": "Men are the ones who envy those who cheat and have multiple women. 🤷‍♀️", "label": 0}
{"text": "I get what you’re saying and it is annoying. I know this because that’s how some men act on here as well. When they talk about what men like or how men act, they talk about “we,” as if men were a monolith. But I have enough common sense know they’re not. \n\nI also think it’s annoying how someone will talk about their OWN preferences/experiences but then someone will chime in and go “but but but this one girl on TikTok” as if it’s supposed to disprove something. Only thing it does is further prove that people aren’t a monolith.", "label": 0}
{"text": "You have good female friends and bad male friends.", "label": 0}
{"text": "You are partly right but mostly wrong. Women have very little understanding of men and say stupid wrong things all the time. This is why female friends and family are *genuinely* surprised when they try to help a close man with online dating. Women aren't a collection of evil masterminds. They are a bunch of stupid, misinformed animals running mostly on instincts, just like the men.", "label": 0}
{"text": "Hard agreement to all of this. I have never once regretted a breakup and in every case wish I had done it sooner.", "label": 0}
{"text": "there’s definitely a reason and the court is fully aware of it. people are typically always biased in their own favor.", "label": 0}
{"text": "rlly?", "label": 0}
{"text": "What? Regardless you're the same type of fatness.", "label": 0}
{"text": "Ding ding ding, your correct, ugly hot means you have 1 small imperfection and women start feeling gracious, that there expecting any flaws whatsoever.\n\n\nexample ur very facial attractive, built, have money and great hair so a women feels she's doing you a favor by overlooking the fact that ur like 5'8 or something", "label": 0}
{"text": "The RP is always “become like them with our secret we can sell in this self published book or by keeping watching our podcast and subscribing!  Or superchats and Patreon directly!”\nAnd then the masses buy and read and discuss online.   Not actually becoming anything.", "label": 0}
{"text": "https://preview.redd.it/mft8jm2o9ywd1.png?width=549&format=pjpg&auto=webp&s=a7ec62944aaa2fa1fd7e89b03228158e72319d38", "label": 0}
{"text": "Nooo I can’t know! Boooooo", "label": 0}
{"text": "No but I read your first post about it and I truly am happy you were able to recover your work.", "label": 0}
{"text": "Okay...?", "label": 0}
{"text": "I just want to be left alone, lol. I studied this stuff to dunk on women when they don’t leave me alone. Like if you’re going to make me play this stupid game I’ll give you a damn stupid prize. ", "label": 0}
{"text": "Then I'm surprised you've never heard that saying. I've never used an ad hominem on you. Do you even know what that means?", "label": 0}
{"text": "So you want a man that's skinner than you. That's the point.", "label": 0}
{"text": "It’s because white people here don’t talk about their race as much. I talk about it (I mean within the rules) but yeah", "label": 0}
{"text": "![gif](giphy|Z5xk7fGO5FjjTElnpT|downsized)", "label": 0}
{"text": "This is the endgame. The misandry will be the last topic to be banned.", "label": 0}
{"text": "It’s easy to find decent female friends and hard to find good male friends as a guy. I genuinely don’t know why. This has just been my experience.", "label": 0}
{"text": "I grew up in shithole conservative Texas where woman have always been pretty pick (at least in the big city). But my brother the KEY 🔑 to your confidence is going to meet real woman and they aren’t in urban America they are mostly in the Philippines.  Trust me you meet these woman you will be healed", "label": 0}
{"text": "What does awaiting moderator approval mean for a posts removal?\n\nI reported it last week. Why wasnt it dealt with then? Was it ignored? I dont care about it now I just want to know why it was handled that way and if reporting them is pointless since nothing will come from it", "label": 0}
{"text": "I have no idea who you’re talking about tbh", "label": 0}
{"text": "I have mixed feelings about it. Height in men is linked with some life outcomes like career earnings. Taller men tend to end up in higher-paying roles. CEOs for example are predominantly over 6 feet tall, with most exceptions being founders of their own company. So if someone offers you a treatment to resolve that, I can see why some might opt into it. Height does matter for women as well, but far less so. \n\nAt 5'6\" you're below average in the US, but still taller than most women. I think once a guy hits the 5'0\"-5'4\" range where they're the size of an average adult woman, it starts to get harder, as you are now closer size-wise to a typical woman than a typical man.", "label": 0}
{"text": "Right, but the goal is to become them, not usurp them— even if they’re doing a poor job at it. I think the reason why lots of these men don’t actually want to be ‘them’ whether or not ‘they’ actually exist. The character of Chad is not a human being I’d want to be— and I think if you actually did want to be him, you would be already.", "label": 0}
{"text": "I am glad to not have this part of autism. I love taverns and most crowded places.", "label": 0}
{"text": "Nope", "label": 0}
{"text": "thanks lol", "label": 0}
{"text": "Yeah and some of the children who grew in orphanages became *great*. How many did not though?", "label": 0}
{"text": "what is public here? these are inappropriate topics for the workplace so you obviously wont hear it there, but i dont think theres going to be much effort to hide the fact that some women like hot/tall/whatever it is they like guys. you barely need much social contact for that.", "label": 0}
{"text": "Yea but the women who are next gen feminism encarnate who can always bring up men in a neagtive light and frame every failing of women as a failing of men arent really helping in fanning out that victim complex flame", "label": 0}
{"text": "I’m sorry to hear about your experience with men, and happy to hear you’ve had a good experience with women. I lucked out— almost all of my male friends are from highschool. I got a good group early.", "label": 0}
{"text": "A good idea for new subreddit.", "label": 0}
{"text": "bruh lol I just can't", "label": 0}
{"text": "Going to Halloween evil maze in an amusement park (so there are rides as well)", "label": 0}
{"text": "Women that think they are hot af in their 30s and who \"dont need a man\" and want to create their family without a male partner. These are the women I enjoy the most to impregnate. Its really wonderful.\n\nReality of course is that they are no longer beeing seen as viable marriage options and just passed around as sex tools so in order to get a child, they resort to sperm donors as their only viable alternative lol", "label": 0}
{"text": "Neither does pointing out anything ever.\n\nPointing out systemic racism doesn't make it go away.\n\nPeople still like to point out that things exist to either prove themselves right or be able to do something about it one way or another", "label": 0}
{"text": "Whatever you do don’t go to bars it’s useless in America unless it’s a cowboy bar in a rural area\nAnd Jesus helps guide you", "label": 0}
{"text": "Males didn't evolve to be hypergamous. If your view isn't changed by understanding that evolution is real, it won't be changed.", "label": 0}
{"text": "Did you miss my other comment? I posted another photo and said that guy looks just fine. \n\nAlso, the photo you shared definitely looks like he has a waist size larger than 32 lol", "label": 0}
{"text": "i’m not even disagreeing that rules are strict but you guys are whining like you’re in nazi germany.", "label": 0}
{"text": "•be a reddit moderator\n\n•have braincells\n\npick one", "label": 0}
{"text": "There are five or six extremely decent men here. He’s one of the best, very self aware but way too hard on himself.", "label": 0}
{"text": "> Yes now her bills also double so she has to work more hours.\n\nOr not. If the rent and utilities are split 50/50 and he moves out, my bills obviously increase for rent and utilities. But since I always live well under my means, I do not need to work longer hours, I just pay everything myself. My car is always my own problem anyway. If I own a house, him moving out just means I need to rent out a room. The fact that more and more wives are happier and less stressed when divorced should be a wake up call for men to not slack off so much.", "label": 0}
{"text": "I would never choose a freelancer if I decided to become a single mom by choice bro 😭 and the only reason why I would become a single mom by choice is if I don’t find the loml", "label": 0}
{"text": "It’s so awe-inspiring how quickly children pick up new skills once they get the hang of something.", "label": 0}
{"text": "that's not very bluepill of you", "label": 0}
{"text": "He’s European he has some normal woman there - he’s lucky he got like 10-30 countries he can fly to easily", "label": 0}
{"text": "Not to mention - there is zero reason to do more research because abortion laws are simply about control and nothing more. Pro life people typically immediately stop caring for kids once they can’t afford school lunches.", "label": 0}
{"text": "I did. Reddit app is shit.\n\nI have to recheck once I'm in front of a computer. Will look for an authoritative source like some hospital or government site.", "label": 0}
{"text": "it’s exactly as i said. \n\n> survey results for [last] year put demographics at 60% white.\n\n> nonwhite users who choose to reveal their race via their pfp stand out\n> minority users seem to be more likely to bring up their race\n> several “popular” and more “known” users are minorities, and very vocal, so they stand out", "label": 0}
{"text": "This place is notoriously bad at accepting information they disagree with", "label": 0}
{"text": "You really think the dudes that can pull are trying to pull “next gen feminist incarnate”, whatever that is?    \nSo why are dudes so concerned with the opinions of the women they don’t wanna fuck?!   \n“I hate men”  understood, don’t date us.  What’s your roommate up to tonight?”", "label": 0}
{"text": "> because if you look at almost all high profile cases like this... it's much more common that the husband is the one putting up with abuse and toxicity.\n\nCrime stats say otherwise. DV stats say otherwise.", "label": 0}
{"text": "I almost wonder if it’s not lack of social skills and a phenomenon of realistic learned helplessness", "label": 0}
{"text": "Oh u seem to be very interested since you're snooping my profile", "label": 0}
{"text": "Not all junkies are homeless or don't have cars. A lot of heroin and fentanyl dealers who are addicted to their own supply are able to afford cars, long-term motels and hotels, and even crappy apartments. Not to mention that even some well-off, professional people like doctors (who have access) and lawyers are functioning addicts.", "label": 0}
{"text": "That is not female average. I'm almost done with my mortgage, have 1.5 more year to go, but I don't pretend that majority of men get to live for free.", "label": 0}
{"text": "Can't be discussing n-counts, looks, loneliness nor any struggles or problems. It's not Nazi Germany, it's North Korea where everything is going great.", "label": 0}
{"text": "Hypocrisy relates to conduct and beliefs. If you believe being a virgin is a moral stardard other people should aspire to, but you don't think it's virtuous for yourself to be a virgin, thats hypocrisy. If you're just more attracted to virgins than not-virgins, it's not hypocrisy.", "label": 0}
{"text": "No they don’t - women need to be comfortable with being single so they can keep their standards wherever they want them and avoid shitty men.", "label": 0}
{"text": "I mean we had a president and the most powerful person on earth raised by a single mom \n\nWe’ve had cultural icons raised by single moms \n\nShitting on single moms and blaming them for raising shitty boys is pathetic", "label": 0}
{"text": "I’m not asking why it’s appropriate to post in this thread, I’m asking why it matters so much to you. Like even when he’s saying that he’s subjectively comfortable with his lifestyle, you’re telling him that he’s wrong to be content where he is and I have no clue why.", "label": 0}
{"text": "Look, the real question is women, would.tou stay with a man who wholeheartedly loved his ex girlfriend, but is with you because he couldn't keep her, finds you unobjectionable and useful. And I suppose makes life easy. Then if not, why the hell are you telling men that your belated cursory and regretful modicum of attention is her \"true desire\"?", "label": 0}
{"text": "https://www.tiktok.com/t/ZTFqFj4eE/\n\nI think these are my favorite Tik Toks. It's just some young woman who picked up therapy words and now can't stop jerking off to how smart she supposedly is.\n\nI can't find any man who is attractive because they're just so much lower intelligence than me 😩.", "label": 0}
{"text": ">So why are dudes so concerned with the opinions of the women they don’t wanna fuck?!\n\nmight as well ask all the women here the same question while youre at it", "label": 0}
{"text": ">Males didn't evolve to be hypergamous\n\nWhy?", "label": 0}
{"text": "wait aren't you the central asian guy? and you're slaying white chicks in college? \n\nhopefuel ngl i could honestly larp as a churka as a last resort to get away from the ricecel stigma\n\nwhat i said previously about your kind still applies though.", "label": 0}
{"text": "First of all, given your uncharitable interpretation of one comment in this thread already I'm not going to take you at your word on another comment, I would need to see the full quote and context.\n\nSecond, I don't think one stupid comment in a reddit thread is evidence of what the general consensus of the thread is.  It seems like most people here recognize what reasonable obligations are in a marriage / LTR.", "label": 0}
{"text": "![gif](giphy|3o7TKF1fSIs1R19B8k)", "label": 0}
{"text": "You just snooped mine. When did I snoop? I said I think it’s repulsive to be a hypocrite based on the shit you’ve been saying to me today. You said I was bad faith for saying I believe men who have a high bc and women who do are equal. Sorry I extrapolated from there? You have multiple accounts because I’ve seen your name multiple times in different versions…:but yeah you have def peaked mine", "label": 0}
{"text": "Probably both.", "label": 0}
{"text": "I read the first six words of the title and thought this post was gonna go in a very bad direction lol", "label": 0}
{"text": "I never implied it has anything to do with you- at all, its always been \"women\" and my experience with these \"women\" and not \"EqualSea\" :)", "label": 0}
{"text": ">If you're just more attracted to virgins than not-virgins, it's not hypocrisy\n\nEven if the person who prefers a virgin is not a virgin themselves?\n\nSo the question now is, is there no such thing as a line to you? A point where you'll say that person A cannot have a certain attraction because they don't possess the standard?", "label": 0}
{"text": "Because single mothers are often vilified by society and I was indicating I don't care about social norms which don't violate my internal morality", "label": 0}
{"text": "A lot of 28 year old guys would date a 21 year old woman. I don't know any 28 year old woman that would date a 21 year old guy", "label": 0}
{"text": "Nowhere in America does a bio parent get zero custody for no reason.", "label": 0}
{"text": "According to pornhub yes ", "label": 0}
{"text": "The whole point of the sub is to debate, but they have made that impossible. i just have a really low tolerance for bullshit", "label": 0}
{"text": "I have witnessed this with some men when I was friends with more men (as a young tomboy). Some men are just not very nice to their friends and/or make them feel bad about doing things like caring for mental health. But whenever you say this on PPD (relating to the male loneliness epidemic) people lose their minds and call you a “victim blamer”.", "label": 0}
{"text": "> put an end to the high obesity rate.\n\nThis will do nothing to change the obesity rate, they'll just be obese with muscle instead of/in addition to fat.", "label": 0}
{"text": "> (11) No Incel/Black Pill Content\n\nAs is, can't be discussed in depth (or I'll get banned).", "label": 0}
{"text": "How does that negate my comment? Grown adults pay their bills, and?", "label": 0}
{"text": "Males aren't hypergamous because of loyalty?\n\nWait what do you think hypergamy means?", "label": 0}
{"text": "You're a fresh acc, probably gonna get banned soon anyways", "label": 0}
{"text": "The PPD Demographics survey, probably.", "label": 0}
{"text": "Are you saying that because this sometimes can happen, women are always justified in withholding their feedback?", "label": 0}
{"text": "I think some are genuinely trying to help dudes by saying “listen I’m a woman and I don’t think act or talk like any of these archetypes RP claims AWAL”\n\nAnd then others I feel like are going “ha!  You think that’s trigger bait?!   Let me show you some real trigger bait!”   And then post something to trigger dudes. \n\nThere’s a lot of playground “boys against girls” antics in PPD.  \n\n(You really should think on my questions tho)", "label": 0}
{"text": "\n**Attention!**\n\n* You can post off topic/jokes/puns as a comment to this Automoderator message.\n\n* For \"Debate\" and \"Question for X\" Threads: Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* If you want to agree with OP instead of challenging their view or if the question is not targeted at you, post it as an answer to this comment.\n\n* OP you can choose your own flair [according to these guidelines.](https://www.reddit.com/r/PurplePillDebate/wiki/flair), just press Flair under your post!\n\nThanks for your cooperation and enjoy the discussion!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": "I know a 28 year old woman who has dated a 22 year old little boy.", "label": 0}
{"text": "I left my first marriage because he was a dick. I then co parented with him till they went to uni 50/50.\n\nHe claimed I was the problem no one would want me etc etc. I have since been married for ten years, very happily. He can’t stay with anyone more than a few years but it’s never his fault.\n\nMy sister left her husband after years of begging him to be present for her and their daughter. She now has a long term boyfriend and they are very happy while he can’t hold down a relationship.\n\nWhen a relationship ends it’s very important to be very honest with your self and learn from it even if you are the one who left. We both have had therapy etc and improved ourselves learnt from our divorces.", "label": 0}
{"text": "Of course that comment was coming", "label": 0}
{"text": "me when i was in high school and i had to write an on demand essay about the side of an argument i didn’t agree with and didn’t know anything about lol", "label": 0}
{"text": "If you buy her dinner after a hookup is  that considered a date?", "label": 0}
{"text": "I sincerely doubt your account will last longer than a week if you keep that up", "label": 0}
{"text": "Ah alright. That’s ok then", "label": 0}
{"text": "> wait aren't you the central asian guy? and you're slaying white chicks in college?\n\nJust hang out w more white ppl\n\n> hopefuel ngl i could honestly larp as a \nchurka as a last resort to get away from the ricecel stigma\n\nPeople still largely assume I'm east asian\n\n> this is not an retraction of what i said previously but still i appreciate the insight\n\nOk mr neanderthal", "label": 0}
{"text": " the closest thing youll get around here acknowledging toxic behavior from women is \"yea but we do that because of men\"\n\nmakes debates really boring", "label": 0}
{"text": "Disagree.  My happiness is my responsibility 10000%.  It’s actually super toxic to believe that you are responsible for your partner’s happiness, because sometimes they are unhappy about things that have nothing to do with you.  When you believe that you’re responsible for your partner’s happiness and they are unhappy, you can decide that they’re ungrateful for the ways you try to make them happy- that won’t work, because an external force is making them unhappy in that moment.\n\nIt then puts pressure on the other person to be happy all the time, lest they upset their partner who takes it personally whenever they’re unhappy about something.  They get to a point where they just pretend to be happy all the time no matter what because it’s easier to fake happiness and cry alone in the bathroom then it is to ever express anything other than sheer delight no matter what’s going on in their life.  Then their partner starts to suspect that something is up because no human can be happy when their partner is cheating on them and smacking them around, so then they accuse her of being fake or of cheating on him because what else would be making her so happy?\n\nYes. This is specific.  Yes, I experienced this.  Ughhh\n\nSo awful.  So exhausting.  So happy to not be living that way anymore!", "label": 0}
{"text": "so there are some super hoes out there?", "label": 0}
{"text": "Nobody meets their own standards for kindness and loyalty", "label": 0}
{"text": "Does it count if you lie abt your age", "label": 0}
{"text": "like 75-80% black births are OOW compared to like 26% ( i think) white", "label": 0}
{"text": "What?\n\nThat scenario almost seems like he became desperate for a way to pay for their kids \"expensive medical treatment\"", "label": 0}
{"text": "My dude does all of our laundry!  Score!  My ex had me doing *everything*.", "label": 0}
{"text": ">To safely do this, you'd have to require STD testing pretty much every time you have sex with these women.\n\nThere isn’t a male HPV test. Reminder to get the vaccine, nerds.", "label": 0}
{"text": "People already realise it, they just pretend they don't. Read my entire comment, the Blue Pill is a game we are all playing to make the society function, but we all know it is a game and not a reality. Blue Pill is an illusion everyone knows is an illusion, but plays along for the public benefits.", "label": 0}
{"text": "Ah that makes sense, thanks!", "label": 0}
{"text": "That's manic post-breakup behavior, do not get your hopes up for anything to come of it", "label": 0}
{"text": "I'm younger than 28 and I wouldn't date someone who's 21 knowing how much men like women younger", "label": 0}
{"text": "my previous accounts all got done for autodetected slurs and im careful to avoid those now.", "label": 0}
{"text": "Don't know wtf she was talking about, but I find her attractive in the face.\n\n\nBut look how unsymmetrical it is. One eye is higher than the other and her chin points to the side.\n\n\nThe \"symmetrical face is more attractive\" is bullshit, ain't it? She should take out those piercings, but she kinda cute.", "label": 0}
{"text": "What if her new partner happens to be more attractive, wealthier, and has a higher status job?", "label": 0}
{"text": "there are weekly threads for that. some of yall wanna feel oppressed so bad 😭", "label": 0}
{"text": "Because it doesn’t add up to me as poverty is objectively bad (for example, because it lowers life expectancy by 10 years) so I am curious to learn how this person thinks so I can understand.", "label": 0}
{"text": "Oh ok but is it guys who mostly think other guys are compromising too much or do other women think that too?", "label": 0}
{"text": "Yeah, I'm imagining a Walter White scenario in my head.", "label": 0}
{"text": "okay well, smoke a joint, have a snickers and lighten up a bit", "label": 0}
{"text": "So men are more predatory than women", "label": 0}
{"text": "I agree, which is why they aren’t banned simply for being jobless. It’s the fact that they are jobless and want to promote joblessness or complain about joblessness and not something like working conditions, which would be on topic.", "label": 0}
{"text": "Why tf should I care about being “uncharitable” when men here literally say the foulest things about women?", "label": 0}
{"text": "I agree. Average people ARE attractive.", "label": 0}
{"text": ">I mean it’s not even her husband.\n\nNot to psychoanalyze you or anybody else, but a rigid approach to titles usually goes hand in hand with those attitudes I mentioned.  \n\nIf you need a title to determine how you treat someone, then you undermine the entire point of  the title. I can only speak for me. But the woman I marry will be the woman who treats me like her husband, not the woman I hope will change overnight with a ring and a ceremony. \n\nThat's just me. And considering how many women aren't on the same page with this approach, I should probably learn to breadcrumb my commitment and consideration, since that's apparently a reasonable thing to do to people you love. \n\nPersonally, I just don't neglect is a tool that should be used in a loving relationship. If you're comfortable icing out your partner, then what grounds is there to trust someone like that. \n\n>“Boyfriend” could be a few months of dating so that’s not much info.\n\nI'm pretty sure they were living together, but I could be wrong. \n\n>I honestly don’t get traveling only w your partner so this might not be the right example for me!.....Similarly if my partner wanted to go on a “trip of a lifetime” backpacking across Asia I’d wish them well on their own bc I have zero interest in doing that.\n\nI'm pretty sure the guy wanted to go. Nobody's saying that you should hold up your plans for people that don't even want to accompany you. \n\nThe problem in that scenario was being unwilling to compromise **any** on their partner's account when the only constraints on the partner's end were financial. \n\n>Like how I think real housewives is better than football or dark chocolate is better than milk chocolate.\n\n...you don't like milk chocolate?\n\n>I’m just trying to get into the details bc I wonder to what degree some of this is “you think you’re better than me?” Insecurity from people who assume all rich/educated people are looking down on them.\n\nWomen treating men differently based on what they think of them is a fact of life, there's nothing imagined about that. \n\nAnd classism is very real. It's a social force and it exists everywhere. \n\n>But like, I think a blue collar man who reads more than I do is wayyyyy more impressive than me. I have an ex like this and he is way cooler and smarter than me. Like good will hunting lol. If you can get the education I have from a public library instead of paying for instruction that’s significantly more impressive.\n\nThat's a wholesome take and I can respect that. Nothing unreasonable here. Unlike your chocolate preferences.", "label": 0}
{"text": "If it’s two separate events yes", "label": 0}
{"text": "She sounds horrible. My husband isn't as social as me, and I'd never force him to go anywhere.", "label": 0}
{"text": "> Welcome to the chaos.\n\nThat's my point. You can't treat it like a maths equation, you have to accept the chaos, but there are still things you can do to move the chaos in your favor.", "label": 0}
{"text": "We not discussing here individuals, we talk about gender relations in genera. Oh and **rational** adults aim to improve their lives which, that is to say get more for doing less, which for women, on average means, cohabiting with men even if they have to do all the cooking and cleaning. Of course there are exceptions and outliers to that.", "label": 0}
{"text": "We don’t blame woman we are merely putting the spotlight on you and your true nature.  In reality, it’s a little scary because the roles have reversed lol", "label": 0}
{"text": "Going out, meeting ppl and getting to know them is fun. Socializing in general is fun.", "label": 0}
{"text": "Idk if you care but tiktok shares your username when you post links", "label": 0}
{"text": ">Do you not think needing plasma/blood/organs is looking after the general well-being of your child?\n\nNo. I was referring to food, clothing, and education by general well being. Those are things parents have to provide, or CPS literally gets involved past a certain point. CPS is not taking your child away from you because you refused to donate your own organ to them.\n\n>What if the condition is genetic? They absolutely caused that. \n\nNah, I wouldn't place the blame of that on the parents. We don't control our genetics or how they're inherited, and blaming people for creating children with genetic conditions is kind of a wild take. Especially because not everyone even has access to genetic screening or education of how genetics work.\n\n>Again, it’s absolutely a manufactured consequence because we have the safe means to end pregnancies. Banning it is manufactured. There is no getting around that so you may as well just admit it.\n\nBy your logic:\n\n-Murdering the homelessness is an easy way to end homelessness\n-Therefore if you don't support murdering homeless people, you support the \"manufactured\" problem of homelessness existing.\n\nThat analogy may not hold up in your mind because you don't see a fetus as a living thing that deserves rights (like homeless people are). The analogy absolutely holds up in the mind of pro-life people.\n\n>No, I don’t think YOU know what responsibility means because the concept of responsibility doesn’t render abortion unjustified at all. Feel free to explain to me why you think otherwise though?\n\n-the fetus is a person therefore it is entitled to life and protection of that life\n-it's reasonable to hold the mother personally responsible for the fetus's life because she willingly engaged in the act that she knew could create it\n-taking responsibility for the life in this case is carrying it to term, therefore this is what the mother should do.\n\nThere's a pretty obvious and logical flow between those concepts, regardless of whether or not you're capable of comprehending it.", "label": 0}
{"text": "You can keep denying this all you want to based on gender biases but you’re very wrong.", "label": 0}
{"text": "ok, i dont care if men approach or what they do or why. i am personally repulsed by unmasculine men. I'm sorry, that's reality. i dont want harm to befall them and I wish them well in life.  there is no time in history shy/anxious men have been attractive to anyone. this isn't one of your sad animes. why don't you all get your heads out of your asses", "label": 0}
{"text": "I posted some of my matches on my profile, I pretty much only date latina and asian women. I don't seem to mind monolids? But the jaw thing seems like... not real?", "label": 0}
{"text": "Hey it’s all good. I don’t have grudges or anything but I am a firm believer that friends male or female should help you when you’re low. I really don’t have anything to complain about lol.", "label": 0}
{"text": "> Just hang out w more white ppl\n\nwell you still need to be attractive at minimum. i know plenty of asian guys that are social with mixed/white friend groups that still get no play, not even from asian women. \n\n> People still largely assume I'm east asian\n\nI doubt you look that similar to the average east asian, personally I'm pretty good at identifying central asians when I see them. \n\nHave you seen uyghurs? Do you think you look similar to them?\n\n> Ok mr neanderthal\n\nthe virgin baby homosapien phenotype vs the chad robust neanderthal phenotype", "label": 0}
{"text": "Because they’re evil", "label": 0}
{"text": "I need to shut your computer off just for a sec to check something.", "label": 0}
{"text": "vastly greater choice of clothing, in terms of form, style, but also SIZES.\n\nI swear, all the male clothing I can find seems to be made for guys who are either made of rectangles, of have pot bellies. Apparently the stores, in stark contrast to their adverisements, only catter to short dadbod dudes.\n\nTHe ironic part is: the clothing shown in the commercials or even on the clothing store websites is perfectly  wrapped over male models with broad shoulders, flat stomach and narrow hips... and these sizes DO NOT EXIST in actual stores. I am a broad shouldered, narrow hipped, flat abs motherfucker, and cannot find pants  or shirts that fit my body. If pants fit my thighs, calves and ass, then they will be so oversized in the waist that I could stuff a turkey in there. If a shirt is form fitting in the stomach, there is no way it will fit in the shoulders.", "label": 0}
{"text": "> The \"symmetrical face is more attractive\" is bullshit, ain't it?\n\nI'm pretty sure this is basically fact. It's not that asymmetry can't be attractive, but more symmetry is better. They tested this with mirrored faces.", "label": 0}
{"text": ">Men don’t care who women are. They don’t care about her knowledge, her experience, the joy she finds in her hobbies or her work, the purse she takes in her accomplishments, nothing. Men don’t give a flying fuck about a woman’s identity or happiness\n\nDitto for women\n\n>Men care how she looks and what domestic service she provides while he enjoys his life and his hobbies and takes pride in his talent and accomplishments. \n\nWomen care how he looks and what financial service he can provide while she enjoys her life and her hobbies and takes pride in her talent and accomplishments. \n\n>A man doesn’t want a person to marry. He wants an accessory to his life. Her wants and needs are utterly irrelevant and unimportant to him\n\nA woman doesn’t want a person to marry. She wants an accessory and financier to her life. His wants and needs are utterly irrelevant and unimportant to her\n\n\nWomen do exactly what you accuse men of. Men arent the ones pretending to be all holier than thou about it.", "label": 0}
{"text": "Is this number 2 guy ? Or the third or something", "label": 0}
{"text": "Literally everyone is loved despite some trait and because of it. Not unique to short men.", "label": 0}
{"text": "The first step in enlightenment is understanding ignorance and the 4 noble truths", "label": 0}
{"text": "And that’s pretty much what the guys are saying just in reverse.  \n\nThis place was never actually going to be a debate because every dude here thinks he’s the “average Joe” and thinks women are all a collective. \nAnd flip that for the other side. \n\nNo one want to admit they are below average and it’s considered rude to boast if you are above.", "label": 0}
{"text": "I have a friend whos 30 and shes acts like its over all the tine.Shes dating a dude whos 24 and shes so insecure that hes living his best life. Its fucking wild.", "label": 0}
{"text": "wtf dude lmao", "label": 0}
{"text": "wdym jaw thing? lack of forward growth or protruding teeth? the latter is definitely not the majority but it's not rare either. \n\nmaybe you're only pursuing asian stacies lol.", "label": 0}
{"text": "Are you resorting to trying to rage bait now?", "label": 0}
{"text": "Sums it up!", "label": 0}
{"text": "I don't think this is a good question to ask on this sub.", "label": 0}
{"text": "Sure man whatever have a good day with your fat girt studies", "label": 0}
{"text": "That's kind of my point, though - because people are so unwilling to move past the apparent unfairness of the dating market, they are a) hurting themselves, and b) not solving anything. \n\nI'd feel the same if anti-racist advocates sat around concocting increasingly more insane theories about why racism exists.", "label": 0}
{"text": "Having sex with multiple women is no more meaningless than having sex with a single woman who ends up cheating on you.", "label": 0}
{"text": "I think to show it's hypergamy you have to be able to show that she only left her partner for her new partner for those reasons.", "label": 0}
{"text": "As a 21 year old male, I would never go near a 28 year old female. That's a whole 3 years past their expiration date.", "label": 0}
{"text": "Your description sounds like a womans", "label": 0}
{"text": "*because they don't actually learn how to lose weight.* \n\nSucceeding at something is obviously going to be hard if you don't actually learn how to do it correctly.\n\nEasting at a calorie deficit itself is not difficult.", "label": 0}
{"text": "You didn’t. You literally said:\n\nYou protect (a gun can do this better)\n\nYou split the bills (**she is splitting the bills too, LMFAO 🤣 **)\n\nYou occasionally lift heavy things and grab hard to reach things\n\n\nThis is absolutely not a fair trade off for her doing **all or most of the housework and childcare**.\n\n\nYou moving heavy things once in a while is NOT the level of convenience and support that a car provides to others over a horse drawn carriage. A car vastly improves daily life. Occasionally picking up heavy shit only improves life for like a few seconds once every so often. The equivalency is horrible.", "label": 0}
{"text": "Lol", "label": 0}
{"text": "I think we are in agreement.  Except here’s the hair split (I think) thing it’s not going to work on “women” but it’s going to work on a woman.  Or two or three, or a dozen, etc.  you get the idea. \n\nAnd that nuance I think is too often lost", "label": 0}
{"text": ">If you tell a guy that no matter how nice or hard working he is he may never get a girlfriend, maybe he wastes less time and energy\n\nBut whatever will we do without the cogs in the machine after we stop dangling the carrot infront of them? /s", "label": 0}
{"text": "It’s not generalization. You’re just taking it personally because you feel attacked by it. Probably cause you’re part of the group of men that can’t communicate. Anger and rage is a quick response to those type of men that can’t participate in a decent conversation.", "label": 0}
{"text": "You should ask her instead of getting all gassed up about your imagination.", "label": 0}
{"text": "preying on 21 year old children", "label": 0}
{"text": "pursuing a sexually mature woman who's been a legal adult for 3 years is \"predatory\" now?", "label": 0}
{"text": ">Even if the person who prefers a virgin is not a virgin themselves?\n\n\nYes. Attraction cannot be negotiated, so being attracted to someone can't be hypocritical. It's involuntary.\n\n\nTraditional relationships kind of blur the lines because both sexes have expectations of the other that they are not willing to fulfil themselves. But the reason they have those expectations is because they serve a purpose: to have predetermined roles and a shared responsibility of running the family. Men want a nurturing mother for their kids, not because men couldn't be nurturing, but because that's the division of labor they seek.\n\n\nThe reason why that doesn't apply to virginity is because virginity doesn't serve a purpose for the future. If it's to do with judging someone for their past choices, then it's hypocritical to not make the same judgement about your own choices.", "label": 0}
{"text": "Oh sorry I thought we were talking about movies where women get revenge on men for dating scenarios not violent felony scenarios.", "label": 0}
{"text": "Honestly, this is pretty spot on for some teenage males. I remember my teenage GF of 4 years at the time literally took 4 years of convincing to purchase me a video game as a gift. I’ve noticed over the years, most women hate video games. I think this is why they’re trying to LGBTQ the gaming realm so badly. ", "label": 0}
{"text": "K, but like... how does that help you? The most elaborate theories about women's true nature a) sound insane; b) don't score anyone any dates.", "label": 0}
{"text": "He pretty clearly explained his lifestyle and how he is happy with it. You didn’t respond by asking a question to delve deeper into his mindset, you combatively tried to refute him, and it’s probably what led to him disengaging from the conversation.", "label": 0}
{"text": "Why are you deciding what’s an appropriate amount of sex? \n\nI probs go way more than 1-4 times a month, but men who only really want sex 4 times a month exist also.", "label": 0}
{"text": "not all of us", "label": 0}
{"text": "> Nobody in this sub would last a week in a phallocentric society. \n\n\nI recall there are some guys who served in such for way longer than a week.", "label": 0}
{"text": "Then perhaps instead of defending a guy saying “lay off the ham sandwiches”, provide nutritional classes.", "label": 0}
{"text": "[Example 1.](https://www.np.reddit.com/r/PurplePillDebate/comments/1eak7db/women_who_say_i_prefer_guy_friends_because_theyre/)\n\n[Example 2 (in which both genders are called out on).](https://www.np.reddit.com/r/PurplePillDebate/comments/mzsrdo/where_have_all_the_good_men_gone_is_just_the/)", "label": 0}
{"text": "Maybe you don't care, that's on you.  But the reason why most people want to be charitable in their interpretations of other people's statements is because it's more convincing and more honest.", "label": 0}
{"text": "Yeah it’s the best choice. I remember when this place got me so worked up I was getting literally headaches that kept me up at night.", "label": 0}
{"text": "We're having a fundamental disagreement on the meaning of being blackpill. And that's okay.", "label": 0}
{"text": "Ah ok, I guess I misunderstood", "label": 0}
{"text": "How do you suppose people learn? Learning can be trial and error. OR it can be learned via 'tricks' --in other words, tools that help you absorb the information better but it's not a 'one and done' thing. It's a process. Once that process is nailed down, the 'trick' or tool becomes muscle memory. \n\nIt doesn't mean that the tool is discarded and that you stopped using it. No. The tool has morphed into memory. So you're still using it but it's now in a different form that you don't even notice 'consciously'. \n\nIt's funny that you equate folks using these 'tricks' as low quality organisms because that would mean that we're all low quality organisms since we all use these tricks but no longer notice that we're still using it on a conscious level.", "label": 0}
{"text": "If you lose then you didn't do everything right you made a mistake or missed some important information", "label": 0}
{"text": "They most certainly are relevant. You provided an metaphor. If it collapses from a simple suggestion of \"communication is good,\" then either the metaphor is a bad one, your your philosophy is.\n\n> instead of showing criticism for someone else's way of doing things a way you view as suboptimal, to instead show appreciation for them taking a responsibility off your plate.\n\nAgain though, pointing out a wrong turn isn't criticism. It's helpful. You can point out a mistake *and* be appreciative that they're driving. These aren't mutually exclusive actions", "label": 0}
{"text": "Yes I presented an objective reason poverty is bad to see how he rationalizes it/is okay with it.", "label": 0}
{"text": "Now that is an ad hominem lol", "label": 0}
{"text": "she's okay. bit too much upper eyelid exposure, and I think eye area asymmetry looks worse with big eyes like hers. \n\n[https://www.tiktok.com/@grace.ciarmello](https://www.tiktok.com/@grace.ciarmello)\n\nthis girl also has slightly asymmetrical eyes and i find her very attractive.", "label": 0}
{"text": "There’s another guy who is saying he doesn’t have to do any housework at all because he splits the bills 50/50\n(She also splits them) and occasionally carries in heavy boxes or grabs hard to reach things. \n\nSoooooo", "label": 0}
{"text": "Oof. I can't imagine dating someone that much younger or older. My limit is like a few years. Like 2-4.", "label": 0}
{"text": "beta males with low T\n\nI could get sex from a new woman every week if I wanted to. No point in having a relationship with less sex than that", "label": 0}
{"text": "Cool, how is she a good woman exactly? What is the mistreatment?", "label": 0}
{"text": "Below average women think they are gods gift to men.\nI think the extent of the wish fullfillment fantasy for men is just for women to be humbled a bit. Thats why the wall is such a tantalizing concept.", "label": 0}
{"text": "What you're really asking is not for standards to be lowered, but for preferences to be changed, which is impossible to do voluntarily.", "label": 0}
{"text": "like i get things can be a bit frustrating but at the end of the day, ppl gotta keep things in perspective. when i find things on here that start to get to me a bit ik it’s time for me to disengage a bit.", "label": 0}
{"text": "to assume it’s predatory is a reach", "label": 0}
{"text": "How is censorship not oppression?", "label": 0}
{"text": "> be PPD user\n\n> be able to read\n\nAlso pick one", "label": 0}
{"text": ">What is there to lie about\n\nThe checklist women have for how to get their ideal man.\n\nYou know, the one you called me a liar over when I said it didn't exist. The one you've failed to prove exists.", "label": 0}
{"text": "![gif](giphy|rQzNOhGQS22Sk|downsized)", "label": 0}
{"text": "No, I just don't have a lot of sympathy for failed normies who would rather complain than commit to the grind.\n\nI have sympathy for guys who were born really short, really ugly, or with mental/social/emotional conditions that prevent them from having normal social lives.  I genuinely feel bad for those guys.\n\nI just think that the majority of guys without success are failed normies.", "label": 0}
{"text": "I don't think so, the jaw thing also seems to happen in white women as well, I just would attribute it to a weak jaw.", "label": 0}
{"text": "Wow, now I'm smug and dishonest as well as lacking self-awareness? Why is it so hard for you to debate someone without resorting to insults, negging and unfounded speculation about a person  who disagrees with you?\n\n Even if you take the routinely out, my point still stands. Women in general do not tell their men that they had frequent and better sex with their exes. And you have provided no evidence to show that they do. Unless maybe your only \"evidence\" is your negative view of women, which isn't evidence at all.", "label": 0}
{"text": "TIL some people prey on elderly people. There isn’t an age limit.", "label": 0}
{"text": ">claiming that you can't get a partner unless you are in the top X% physical attractiveness\n\nThat's like ... half of the posts on here.", "label": 0}
{"text": "No “woe-is-me”, black pill, or incel content.", "label": 0}
{"text": "It’s not blaming and it’s also not something they can’t change now. Knowing you can still develop and grow as a person in an area you haven’t should drive to you to change it. Not become defensive of your inability to be open and vulnerable. \n\nJust like anything else in life should we be okay with ignorance and be upset at those that are simply pointing out a weak point? Men can change but it’s also men that hold each other back. Most men’s social circles are mostly men so they are doing it to themselves as well. \n\nHow to change that, take steps towards that change. Try being open. Try asking your male friends about themselves in vulnerable circumstances and be open to them being vulnerable. If you do have women friends you can be more emotional and not as stoic. \n\nCan there be some push back and mockery from men and women for that, yes. But those are shit people, it’s not that all men and all women suck. You should want to improve emotionally since it will help with your quality of life.", "label": 0}
{"text": ">Because a person’s career, educational background, and social standing are all important aspects of their life and who they are. \n\nThese things have NOTHING to do with core compatibility.  \n\nI mean we don't care about a woman's accomplishments to a greater degree.  What use is a highly accomplished woman who is a quarrelsome asshole?  A woman with zero accomplishments can offer just as much compatibility as one with lots... and is actually less likely to be an asshole because accomplishing things usually requires traits that make you bad.  Like that saying \"All the great men of history were also bad men\".  That's just true.\n\nMost guys really can't understand why women focus so hard on traits that don't matter in terms of what makes a great long term relationship.", "label": 0}
{"text": "Really?", "label": 0}
{"text": "I think u/marcatop had gotten a 30 day for posting about looks….in the weekly looks thread. Can’t make it up.", "label": 0}
{"text": "I think there’s stuff you’re not telling us.", "label": 0}
{"text": "Okay, so as long as I stick to complaining about how hard is to get a decent job, I won't get kicked?", "label": 0}
{"text": "Power dynamic is in every relationship not just age gap lol ", "label": 0}
{"text": "Yeah I'm not surprised that you agree with her.", "label": 0}
{"text": "Or, she’s just not into guys that like your music, or she’s not over her ex, or she’s already decided she’s going home with that other guy who actually isn’t as good as you but she’s decided and your aren’t him \n\nIt could literally be anything.  That’s what the whole “free will of the individual” is all about", "label": 0}
{"text": "Not even then, there's many stories of PPB being fleeced for their assets or  the woman decides to leave for a better man anyways.", "label": 0}
{"text": "Its not for how to get the man. Its of traits the want/require their ideal man to have. You know exactly what I mean. Ive never heard that interpretation of a checklist in my life", "label": 0}
{"text": "I just don’t understand people who are deliberately unkind and selfish and do it _just because_. Like does it ever bother them when they know they’ve hurt someone or it doesn’t even cross their mind? People like that deserves whatever bad luck that comes to them.", "label": 0}
{"text": "The point is they’re not obligated to get into a relationship they don’t want to. Don’t want to be married or in a monogamous relationship? You don’t have to. You can be single forever. Want a FWB? That’s fine too.", "label": 0}
{"text": "No idea, I don't hang around those spaces often enough.", "label": 0}
{"text": ">Its not for how to get the man\n\nSo then you lied.", "label": 0}
{"text": "women mature faster than men, so a woman pursuing a man her same age is predatory", "label": 0}
{"text": "There’s literally nothing I’m not telling you. I have no criminal record. I have a stable household. I’m a survivor of domestic violence and narcissistic abuse. Part of the reason I stayed so long and took the abuse is because I knew this would be the outcome.", "label": 0}
{"text": "Pretty sure below average women are the ones going “please please let me come with you guys to the Halloween party tonight!”  To their friend  \n\nNot all of them get to go.", "label": 0}
{"text": "what \"power\" would older men have unless they were cohabitating and she was financially dependent on him?\n\n????\n\nand even then that's only applicable to teens, if you're in your 20s and seeking that you're just a gold digger, most people are supporting themselves or at least moving towards it.", "label": 0}
{"text": "What did I lie about", "label": 0}
{"text": "Good, because I am also right.", "label": 0}
{"text": "> well you still need to be attractive at minimum\n\nI'm not exactly conventionally attractive, facially I look like a young vin diesel\n\n> Have you seen uyghurs? Do you think you look similar to them?\n\nSee above I have an interesting look", "label": 0}
{"text": "Average man doesn't need to split bills in order to achieve desired standard of living. We are happy to live simplistically. Women want more, for god sake just google spending/debt levels of single women vs men.  \n\nGun or no gun additional protection is additional protection. \n\nI already addressed heavy/tall argument it is a lot more frequent then you willing to acknowledge. \n\nAs for chores I gave you financial detailed breakdown, also don't bring childcare into this, since statistics I brought in do not take it into account. Sure childcare needs to be split. That aside it is more then a fair trade, you just refuse to acknowledge it. Also if you don't understand difference between roommate and boyfriend I'm not even sure what more to say.", "label": 0}
{"text": "For the title and first paragraph, it would depend on why. I’ve never had that happen though so who knows, maybe I would change my mind if it did.\n\n>Better yet, he's had a history of giving tons of money to female webstreamers, giving all his emotional validation etc whereby essentially rewarding them (despite them not giving a shit about him as a person or treating him as a disposable object).\n\nThis is a no go regardless of how he treats me, assuming you mean like a titty streamer or camsite or something.\n\n>In turn, you make all the effort for him in terms of cooking for him, cleaning for him but you get only a bare fraction of what others got for free.\n\nHuh? Why am I cooking and cleaning for him at his place? I’m not a maid. \n\n>This isn't as hypothetical, there are some women on the retrospective jealousy sub who lament being given the lesser treatment. So my question is how would you feel as a woman on this subject if your man did certain things for women that he wouldn't do for you?\n\nIf you’re posting on a retroactive jealousy subreddit, you almost definitely have mental health problems. If I didn’t like the effort he put in, then I would just leave. ", "label": 0}
{"text": "would you say the women you've been with were conventionally attractive?", "label": 0}
{"text": "Black pillers use blue pill, purple pill, red pill, and black pill to identify. I would suspect that most black pillers not tagging actually use purple pill.", "label": 0}
{"text": "![gif](giphy|10JhviFuU2gWD6)\n\nThe key is once you understand and accept your fate you can work on enlightenment and progress through an intellectual understanding of human nature and the psychology of woman.  Once you get this you eliminate simp behaviors which is holding you back.  Then and only then will you see the truth which is enlightenment but men will have to lower their standards and expectations to make progress", "label": 0}
{"text": "Lmfao beggars can’t be choosers in your position.", "label": 0}
{"text": "wtf are you talking about, why wouldnt they get to go? whos determining whether they go or not.\n\nbelow average women still see play. source: im a man who knows other men.", "label": 0}
{"text": "yeah but it's not the same sd, I think she's trolling or on drugs", "label": 0}
{"text": "When you accused me of lying saying I have yet to see a woman with a checklist of how to get her ideal man.\n\nYou just agreed that it doesn't exist.\n\nErgo, you're a liar.", "label": 0}
{"text": "i think its just mean to put someone down like that, so the comparison to a fatty wont be there, but they will tell you they find people hot, without you needing to be besties with them. theyll mention features, hair, abs, height, etc.\n\nsure, theyll talk about non-superficial features they like too, but its not really taboo to talk about physical stuff other than not in front of kids, not at work.", "label": 0}
{"text": "Men are just significantly hornier on average.", "label": 0}
{"text": "Men don’t see women as humans - they see them as their labor and sex being a man’s right they shouldn’t have to earn \n\nThey are happy for a woman to suffer if it’s to their benefit, and most think women deserve bad things that happen to them", "label": 0}
{"text": "You need to end these with \"got it\" in order to stay on brand.\n\n>So men are more predatory than women. Got it.", "label": 0}
{"text": "Feel free to report them. If it’s general attractiveness then it will be allowed, it’s the lookism that is banned.", "label": 0}
{"text": "He probably always had a tendency for developing addiction and poor stress management, but it wasn’t obvious until he got into that situation.", "label": 0}
{"text": "There is some of that too but more like when dating goes wrong lol", "label": 0}
{"text": "most of the time he wears a bandana. a fucking bandana. does he think hes axl rose?", "label": 0}
{"text": "Can you tell him that please", "label": 0}
{"text": "I don’t care if women want to hoe, ultimately if they want to abort, why should I care. They were here first, same applies to basically every generation. That’s why old men send the young men to war. Women instead of sending babies to war are sending young women into the nether. ", "label": 0}
{"text": "I wouldn't say it's predatory but men always make it weird\n\nI think nothing of that age difference when it's two men or two women", "label": 0}
{"text": "Yeah that’s screwed up. I haven’t been in a whole bunch of relationships before so I can’t comment on women leaving their man for crying or opening up (I’ve never been in a relationship long enough to cry in front of them). But when I was younger, I had only 2 guys ever try to comfort me for my problems. I had quite a few women who comforted me when I was going through a breakup or something similar though. I think too many guys just try to tough it out and think others should do the same. But that’s just my experience.", "label": 0}
{"text": "It's a genuine question", "label": 0}
{"text": "No, even in my extended friend group I don’t know any single moms. ", "label": 0}
{"text": "In other words, women are incapable of being the problem in a marriage. They just never make mistakes. Always the man's fault, even in hypothetical situations. Delulu.", "label": 0}
{"text": "If you are currently working, and not simply not working and never holding a job because you don’t like your job prospects then I imagine it would be allowed.", "label": 0}
{"text": "https://preview.redd.it/31qxve5rgywd1.jpeg?width=1080&format=pjpg&auto=webp&s=33fda67648fc8a02574ecc87abcbbc6a18f26a9f\n\nThat is what the post showed when it was 1st removed\n\n>I don’t why they weren’t dealt with, that’s why I said to bring it up in modmail. I would still report comments that violate the rules though.\n\nIts most likely because it was ignored. Ive had comments taken down within minutes based off of tecnicalites or posible interpretations of the rules because someone reported them", "label": 0}
{"text": "And she knows that dude is just there to have easy access to sex. Tough life but they had years to find suitable mates, years.", "label": 0}
{"text": "Yes but did you just hear what you said, your guy friends are pulling them.  \n\nSo unless you’re saying your bros are only pulling below avg, which kinda judgy there, but if that is the case then are they really?    I mean if you could pull hot a lot wouldn’t YOU start going “maybe I’m not below then?”", "label": 0}
{"text": "Women eventually divorce most men because they aren't chad.", "label": 0}
{"text": "lemme guess, pursuing a housewife is predatory and any relationship with a man is predatory because he has an insurmountable physical strength advantage and \"might use it on her\"", "label": 0}
{"text": "Good explanation!", "label": 0}
{"text": "For sure, complete symmetry is best. But really, it's not that important. \n\nMost people don't have hideous disproportional faces that make you puke. You can be cute and have an obviously unsymmetrical face. It's another one of those weird things people get caught up on.", "label": 0}
{"text": "Male version of “gynocentric” is “androcentric.”", "label": 0}
{"text": "Sounds like you need a new girlfriend.", "label": 0}
{"text": "😂 Does it matter? Point is, she was with him long enough to taste multiple flavors of verbal and emotional abuse that she now carrying and will act out on normal guys.", "label": 0}
{"text": "Men always say this about being blindsided but not only do you often just not pay attention you also don’t listen. You usually are more concerned with you and your wants than others.\n\nThis is simply weaponized incompetence 99% of the time.", "label": 0}
{"text": "Men loudly talking about their preferences for big boobs or butts for generations in popculture. There is no need to start a ‘movement’ on fair or equal treatment in this regard.", "label": 0}
{"text": "Sounds like you're pulling teeth in that relationship, and I can tell you, it's not supposed to feel like you're pulling teeth.", "label": 0}
{"text": "men should only date women who can physically overpower them (i am fine with this)", "label": 0}
{"text": "Yeah, I don’t see that view. So I’m not sure what happened.\n\nAgain, I don’t know what happened to your report, if you want to sort it out, then bring it up in modmail. If you want to speculate nonsense about it, I’m not interested in entertaining it.", "label": 0}
{"text": "Well most people in the daily thread are black from what I’ve noticed", "label": 0}
{"text": "7.5, 6, 7 (but never saw w/o makeup), 4 (face) with 8 body (<-- this is sorority girl), 6.5", "label": 0}
{"text": "If we remove the webstreamer part. Still no?", "label": 0}
{"text": "Brazil is the country with the most Japanese people after Japan", "label": 0}
{"text": "probably 5pointtakedown. He was sure something.", "label": 0}
{"text": "I have an example for this. Earlier this year I matched with someone on dating apps who was basically my exact equal and opposite counterpart. Same age, same cultural background, from the same city, similar dating history. On paper, a perfect fit, right? Not so much. It just didn't work. She was polite enough but there was just no spark, no impetus for me to go, \"wow, I really can't wait to meet this person\".\n\nI imagine that's how I came across to previous women I dated. Just 'fine'. Nothing more.", "label": 0}
{"text": "Youve never seen a woman talk about a checklist of traits she wants her ideal man to have? Everyone interpreted it that way but you lol. I assume it was intentional", "label": 0}
{"text": "A lot see it as a form of revenge and taking control. They believe they’re protecting their honor, when they’re really protecting their ego. Also most people will unfortunately take advantage of others who don’t know better because it’s easy. It’s like a wolf hunting a paralyzed sheep.", "label": 0}
{"text": "I dont know why its so hard for women to understand that even ugly women have it better than ugly men. Yeah sure you are in a worst position compared to beautiful men but thats like 20% of them. In reality it goes like: Beautiful women > beautiful men > ugly women > ugly men.", "label": 0}
{"text": "[https://x.com/YellowFlashGuy/status/1849807538037895195](https://x.com/MeleeGames/status/1849530254013891064)\n\nthis got onto my timeline today and I thought \"prince will like this\"", "label": 0}
{"text": "Young people don't have the same definition of censorship as the old fogeys and not feel the same way about it.", "label": 0}
{"text": "Or, you could stop being lazy and just read the nutritional labels of the food you put into your mouth.", "label": 0}
{"text": "they are the primary single mothers, who care about one celebrity. being an intentional single mother is almost exclusively lower class, this is not my fault", "label": 0}
{"text": "Men will straight up know they aren’t treating you well but feel like they’ve done enough to deteriorate your confidence to get you to stay.\n\nMore often than not men choose to break you down via manipulate vs actually improve. It’s easier to be a dick to make a woman insecure so she stays because one again - men are ok with benefiting at your detriment.", "label": 0}
{"text": "I feel like many men fantasize about this. They want Chyna from the wwe to sit on their face. Idgi.", "label": 0}
{"text": "It doesnt say that now\n\n>Again, I don’t know what happened to your report, if you want to sort it out, then bring it up in modmail. If you want to speculate nonsense about it, I’m not interested in entertaining it.\n\nSo you want me to re-report it?", "label": 0}
{"text": "I edited it prior to seeing you had replied.\n\nI don’t do the internet etiquette that isn’t real.\n\nIf I wrote something and then think better of it and the person hasn’t replied yet, then I change it.\n\nBig deal.", "label": 0}
{"text": "Ive rejected women that some dudes havent, and those dudes were objectively more  generally succesful with women than I am. They just accepted every oppurtunity to score while I still had standards despite not getting as much play. \n\nAnd nobody is holding my hand to a party? That whole scenario you painted makes no sense. As a dude I have to figure it out all by myself, poor ugly betty her friends dont want her to come with them boo hoo she has to deal with what every man has to", "label": 0}
{"text": ">Not if you can pull up a relaxed grin and make small talk when necessary. I just don’t feel that you are doing yourself any favors by forcing yourself to behave so far out of character. \n\nI do this now but I dont think its enough honestly", "label": 0}
{"text": "I agree that leaving an abusive relationship isn’t an example  of hypergamy in action.   Leaving a relationship to “upgrade” or to obtain the wealth of the ex might be examples of hypergamy.  \n\nNo cherry picked example is really hypergamy in and of itself.   Hypergamy is when a large number of individual practices get to the point they represent a social norm.", "label": 0}
{"text": "🤢🤮", "label": 0}
{"text": "I want to be a better girlfriend and person in general after years of being a bad girlfriend and person", "label": 0}
{"text": "its because its hot thats why ", "label": 0}
{"text": "Hello", "label": 0}
{"text": "Nah, he's probably just poor people seething in private for a little while.", "label": 0}
{"text": "It was on a post about male attractiveness actually lol. It think it was asking women if they found their husbanda attractive or something", "label": 0}
{"text": "All people see each other as objects.", "label": 0}
{"text": "https://preview.redd.it/xkdchuyxhywd1.png?width=949&format=png&auto=webp&s=4453b42dfeeeafd6d84b0c22fd5eaed3c3a5e51c\n\nMilk and cookies as a friday night treat", "label": 0}
{"text": "🪧 The next man to leave 🪧\n\n🪧 will let us know, indeed 🪧 \n\n🪧 just like the men who buy 🪧\n\n🪧 the shave cream we supply 🪧\n\n🪧 Burma-Shave 🪧", "label": 0}
{"text": "I could easily manipulate my 21-year-old self. I was taken advantage of by bosses and dating partners in my 20s in ways I never would now that I have more life experiences, money, education, confidence, etc. even stuff like negotiating prices I can do now but couldn’t do then. \n\nThere are endless stories of women in their teens/twenties falling for situations they later realized were abusive or predatory. It happens to men too.", "label": 0}
{"text": "https://preview.redd.it/e3fxklj4iywd1.jpeg?width=1280&format=pjpg&auto=webp&s=442106459ed8a71435a626b9b6701a326648eb79\n\nShe was only 21 years old you sick fuck", "label": 0}
{"text": "They arent it just that black people are more likely to make their race known I think", "label": 0}
{"text": "And you complied with all directions from court and were able to make reasonable coparenting compromises?", "label": 0}
{"text": "A well though out gift that shows that she's been paying attention to what i like. For example if she bought earings, or a bracelet, or a Star Wars comic book- I would consider that to be a well thought out gift. To me, 'submissiveness' just means affectionate.", "label": 0}
{"text": "Debunked", "label": 0}
{"text": "Define \"really good women\" and define \"treat them poorly\".", "label": 0}
{"text": "I don’t necessarily\n\nOne reading of the idea she’s talking about is “women better/women have evolved past men”\n\nThe reading I gave is “since we all agree gendered socialization exists, we can see how we are socialized to be incompatible”", "label": 0}
{"text": "They probably wouldnt even date a 25 year old guy", "label": 0}
{"text": "\n**Attention!**\n\n* You can post off topic/jokes/puns as a comment to this Automoderator message.\n\n* For \"Debate\" and \"Question for X\" Threads: Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* If you want to agree with OP instead of challenging their view or if the question is not targeted at you, post it as an answer to this comment.\n\n* OP you can choose your own flair [according to these guidelines.](https://www.reddit.com/r/PurplePillDebate/wiki/flair), just press Flair under your post!\n\nThanks for your cooperation and enjoy the discussion!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": "Most people aren't Roger Federer or Messi that doesn't mean good athletes don't exist. \n\n\nMost men who cold approach will get rejected anyway.", "label": 0}
{"text": "Dude you are talking to a guy who only takes women side lol ", "label": 0}
{"text": "\"If I pull that hat off, will you die?\" \n\n\"It would be extremely painful.\"", "label": 0}
{"text": "No, I have never heard a woman talk about the checklist she had for how to get her ideal man, which is what I repeatedly said.\n\nTry addressing the argument I actually made and not the one you wish I made.", "label": 0}
{"text": "Sure. Obviously a varying orders of magnitude.", "label": 0}
{"text": "> But you don’t want a girl you’re dating to ASSUME lifelong commitment and then be shocked when you aren’t on the same page.\n\nYou know what, fair. \n\nAnd depending on what the situation was with that woman with the trip, there should have been a conversation about expectations. No way to know if there was or if there wasn't, but you're right. \n\n>Milk chocolate is so nasty.\n\nIt's *unhealthy*. But that's why it's *goood*. And I say this as someone who doesn't have much of a sweet tooth. \n\nWhat kind of chocolate bars do you like?\n\n>They were out of my dark chocolate protein shakes last week and I had to get regular chocolate and could barely get them down 🤮\n\nSo you work out? That's interesting.", "label": 0}
{"text": "I would appreciate the true statistic. I'll take either one tho", "label": 0}
{"text": "It doesn’t have to be predatory but my assumption isn’t that it’s wholesome or neutral", "label": 0}
{"text": "Ok this feels like it’s off the rails. \n\nNo one’s saying you can’t reject anyone you don’t want.  That doesn’t make them above or below avg tho.\nI’ve turned down girls my bro has gone “are you stupid and blind?!”    \n\nAnd to the 2nd paragraph. Yes: women tend to be more social than dudes. \nBut also dudes don’t have to figure it out alone.  A lot of us were learning together in our crews since kids.", "label": 0}
{"text": "I fucking cackled LOL.", "label": 0}
{"text": "Why does he treat me to cheap coffee dates? Why does he make me split cheap coffee date bills? I would not even do this to a friend, much less a romantic interest. It communicates that he does not like me...so what am I doing with a man who does not like me?", "label": 0}
{"text": "Tell me about it. I don’t disagree", "label": 0}
{"text": "I think you meant “ women will always find a guy who would sleep with them”", "label": 0}
{"text": ">What you are seeing now is natural selection in action. Everyone already knows that fittest and most attractive is favorable, because that’s who is popular and desirable.\n\n\n\nThen why are you blue-pilled 🤣", "label": 0}
{"text": "Yeah there were tons of studies done on it due to the pandemic. [This](https://news.harvard.edu/gazette/story/2023/10/how-social-isolation-loneliness-can-shorten-your-life/#:~:text=Those%20who%20were%20more%20lonely,percent%20more%20likely%20to%20die) is just one of the top search results.", "label": 0}
{"text": "A good part of being attractive is your personality.", "label": 0}
{"text": "Lmao no it’s not.\n\nAnd lmao at eat pray love - she is literally the bad guy no one thinks he was because man - she says it’s her fault an SHE WAS THE RICH ONE\n\nYou are such a lil brat", "label": 0}
{"text": "My husband likes to play evil storylines in his games, and I can never bring myself to 🤣", "label": 0}
{"text": "The thing that bugs me honestly, is that if everything repillers and blackpillers said was true, you'd see a lot more lonely, short men with ugly faces but killer muscular bodies.\nLike people treat \"being attractive\" as being a purely genetic thing, but when you actually take a look at the guys saying it, the vast majority of them are out of shape, have no muscle definition and have terrible looking skin.\nFor every truly unfuckable dude with physical defformities and stunted growth there are three or more perfectly average dudes who simply love food more than they like women. \n(And for the truly deformed guys and girls, I unironically support government sponsored plastic surgery).", "label": 0}
{"text": "For me it’s chocolate bars. I wish sex was a Friday night treat as well though :(", "label": 0}
{"text": "I usually get sea salt dark chocolate covered almonds but since it’s Halloween I just got butterfingers and suckers. I would LOVE a bougier butterfinger w dark chocolate. Not huge into sweets either.\n\nProtein shakes are bc I HATE eating before like 2pm lol which is really bad for you so protein shakes mitigate that cause I can drink one right away in the am. But I do usually do some kind of exercise everyday, walking, rowing, yoga.", "label": 0}
{"text": "Yes, you mean like in America.  lol.  Trust me a lot less than in America I got an American ex wife lol 😂", "label": 0}
{"text": "Wow -this is super interesting - thank you for the link!", "label": 0}
{"text": "I bet if I looked through your profile, I could easily find multiple accounts of you talking down on women who are “post wall,” including your own clients. So I could maybe take the question seriously if it was coming from someone else.", "label": 0}
{"text": "This is the real answer to what the OP is getting at.  Society is hypergamous rather than hypogamus because men don’t seek a partner to provide for them the way women do.  Men are seen as providers in most societies.", "label": 0}
{"text": "People are a science. The problem is the average person is a moron that doesn't actually understand themselves or anyone else so it's frustrating when you aren't a moron and are actually trying to make things make sense, only to realize there aren't enough people around for sense to exist; So you're just stuck in purgatory.", "label": 0}
{"text": "Most do not.", "label": 0}
{"text": "Again, you simply don't understand.", "label": 0}
{"text": "My biggest gripe is that for women, accountability is entirely optional. No matter how terrible they are, they're at least somewhat attractive they'll find someone to shack up with.", "label": 0}
{"text": "Sure. It's also easy to take psych meds btw.", "label": 0}
{"text": "What about pink pillers?", "label": 0}
{"text": "\n**Attention!**\n\n* You can post off topic/jokes/puns as a comment to this Automoderator message.\n\n* For \"Debate\" and \"Question for X\" Threads: Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* If you want to agree with OP instead of challenging their view or if the question is not targeted at you, post it as an answer to this comment.\n\n* OP you can choose your own flair [according to these guidelines.](https://www.reddit.com/r/PurplePillDebate/wiki/flair), just press Flair under your post!\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": "Good afternoon ", "label": 0}
{"text": "Idk maybe", "label": 0}
{"text": "Bro you weren’t here for like a month or two and I was starting to miss you. I was starting to get scared some crazy older woman tied you up and was harvesting your sperm.", "label": 0}
{"text": "man that sounds good", "label": 0}
{"text": "Yes humans can be studied and are studied. That’s not the point though. As stated in OP ppl don’t end up being friends and having relationships because they reduced each other to a science project.\n\nAlso, the majority of ppl that socialize don’t do this. Suzy and Mark that’s going to the bar tonight doesn’t have a 5 page thesis about how to meet ppl. They just go and do it.", "label": 0}
{"text": "I had a feeling you like being tied up", "label": 0}
{"text": "I really only have one guy friend and I don’t explicitly tell him why im not going out to eat with him as often. I just tell him I’m busy.\n\nI don’t think it’s werid. I was raised that your partner’s needs come first. My own mother has told me that she would never put her moms feelings (my grandmother) over mine and my fathers. Before I consider a friends feelings I consider my man’s feelings.", "label": 0}
{"text": "I don’t think you understand. The circumstances do not matter. No one can ever take from someone else’s body. If you personally deliberately hit me with your car, I need a kidney transplant to live and you were the only donor who would suffice… you STILL could not be compelled to donate, and if you agreed to donate you could withdraw that consent right until you’re unconscious in surgery. \n\nEven if you were *dead,* no one could take that kidney to save me unless you had already signed off on it — despite you being the cause of the problem. \n\nSurely we all agree a living woman has at least as much bodily autonomy as a corpse.", "label": 0}
{"text": ">Many men around here seem motivated by justice.\n\nThey want to play by the old rules that approval from other men = access to women. To them, catering to female desire is the injustice despite them admitting themselves how badly they want and need those women compared to the reverse. They want and need it more and have more competition from men including older men, but piss themselves if there isn’t “equal” effort from women they want to date. \n\nThey can stand the idea of putting in more effort than women if that effort is directed at the approval of men higher in the dominance hierarchy. What they can’t stand is the idea of catering to women because that may make them lower than women on the social status/dominance hierarchy. This is where the outrage comes from, and why it is directed at women and not “Chad.” They are fine being lower than Chad in the dating sphere, but not women.", "label": 0}
{"text": "Yes mental gymnastics with statistics and facts./s You ladies are far too spoiled and cuddled, that is why when men ask you to do your fair share to justify a relationship with you you react with hostility. Too the privileged justice is oppression.", "label": 0}
{"text": "I’m just not hungry at all when I wake up and food repulses me. Other people have the same experience so it’s a thing lol. I do also just like to dive into work right away. Once in awhile I’ll wake up hungry, or if I sleep in on the weekends. And I’ll eat an omelette for dinner. Just bought mushrooms to do that this week!", "label": 0}
{"text": "When people say \"We don't care\" We are not saying that we don't support our partners careers and accomplishments. We are saying that it does not *matter* in terms of our mate selection. Lets say a photographer and a laywer looked exactly the same, had the same number of hours worked, and made the same amount of money a year. I would have absolutely 0 preference for one woman over the other.", "label": 0}
{"text": "No new N count or looks posts. Make your post as a comment in the weekly thread if it’s the applicable topic for this week, otherwise wait until next week.", "label": 0}
{"text": "No, I wish.", "label": 0}
{"text": ">which studies?\n\nResearch into attraction is incredibly common because it's an interesting and complex topic.The one I'm thinking of is 2009 study into attraction and differential preferences. Basic conclusion is that men's preferences tend to converge, women's preferences tend to diverge.\n\nWhich is to say, my illustration is pretty representative of women's preferences. If I were to do a male one, there's be 5 circles around a cluster of 4 or 5 dots.\n\n>i haven't looked into scientific evidence\n\nI know\n\n>because it's been clear as day to me just by observing behavior while living my life out in the real world\n\nAnd nothing is more accurate than the experience of N=1 POV observation with no controls, no hypothesis, no methodology, no data gathering, no data analysis, etc.\n\nGreat work.", "label": 0}
{"text": "https://preview.redd.it/v0tzf7yimywd1.jpeg?width=720&format=pjpg&auto=webp&s=663270d897efd06f1aefa49755686cfb763e84c1", "label": 0}
{"text": "https://preview.redd.it/igx7v34jmywd1.jpeg?width=1170&format=pjpg&auto=webp&s=59dcb054a358935144c79358f60db3fd2f356d7c\n\nHow are the ladies feeling about this?", "label": 0}
{"text": "Can you describe what that is for me please?", "label": 0}
{"text": "Good morning from the future", "label": 0}
{"text": "The 🫢 implies I won’t elaborate.", "label": 0}
{"text": "I was a virgin until 24 and men didn’t like it so yeah I just didn’t tell the person I lost it to (but he also just kinda stuck it in without asking so it wasn’t a conscious choice).", "label": 0}
{"text": "😳", "label": 0}
{"text": "In my country, abortion is free and easily accessible. We also get a lot of sex education. \n\n\n1)\nThere is no such thing as an abortion after 24 weeks, its a premature provoked birth **because from that time on, the fetus can survive outside of the womb,** and killing the fetus when it's able to survive is of course murder. Mind you, abortion between 17 and 24 weeks is very rare and usually only done when the mother or child is in danger. \n\n\n2)\nFurthermore, i use medication (chemo) that can trigger an abortion. In some USA states like Missouri, women who have auto immune disease like me, or have cancer, need to stop their treatment when they get pregnant. \nI litterally cannot use my hands or walk when i dont take this chemo, and would need to be on heavy painkillers instead. Other **women die of cancer because they cant get their chemo, leaving behind their other kids**. Is that really worth it?\n\n\n3) allowing only abortion in case of rape, what do you think is going to happen? More false rape claims. Is that constructive? I dont think so\n\n\nAre these arguments rational enough? Abortion should be a non issue. It's just health care. I dont understand the USA, or Poland or Malta in this.", "label": 0}
{"text": "I don’t know actually know", "label": 0}
{"text": "Mike Pence must have funny feelings right now. He put his life on the line to defy Donald, and then like half of Americans saw that and thought *mmm let’s try it again*", "label": 0}
{"text": "No, it means into choking/spanking/being held down, hair pulled, shit like that", "label": 0}
{"text": "Lol\n\n![gif](giphy|3ohhwCCEhh8DLiP7eo|downsized)", "label": 0}
{"text": "Do you think women are a different species?", "label": 0}
{"text": "Pink pill is female equivalent of Red pill . It is about male nature ", "label": 0}
{"text": "Strawman post", "label": 0}
{"text": ">food repulses me. \n\nBefore you can love a person, you must first love your stomach. But I won't judge. \n\nI'll fight my southern instincts to backseat chef you on the omelettes and shrooms.", "label": 0}
{"text": "Its because most men get rejected for asinine things, like their height, income,apperance, social status, etc...\n\nBy default, men have absolutely no choice because of the modernity, it hacked womens brains of their hypergamous nature to an exponential degree. Think how women selected mates in tribal times and their scrutiny, times that by 10 to 100.. \n\n\nBlame social media and dating apps.", "label": 0}
{"text": "Pink pill for women is what red pill is for men . Red pill talks a lot about female nature and pink pill talks about male nature ", "label": 0}
{"text": "Because personality is largely innate and not so easily changeable as people would make you believe?", "label": 0}
{"text": "True. Daily thread seems to have more POC in general.", "label": 0}
{"text": "Maybe but it’s always better to improve in some way.", "label": 0}
{"text": "That’s pretty normal. I feel like we all start off super generous then bills etc catch with us and we can’t do that anymore. Good, he learned to budget! Proud of him. His finances probably aren’t a mess anymore. This is good. \n\nI don’t really expect princess treatment. I’m a mid at best married 30 something woman. Some nice dates sometimes are fine and dandy. I’m a grown lady anyway, I have my own money.", "label": 0}
{"text": "See my above comment why that is.", "label": 0}
{"text": "https://preview.redd.it/bbnhog1dnywd1.jpeg?width=1170&format=pjpg&auto=webp&s=43c352f5ca487db69ce69d1ba86d2c8102bf0cf9", "label": 0}
{"text": "Your assumptions are yours to make", "label": 0}
{"text": "Yes the vast majority of the time it’s a man randomly announcing “I hate fat women, Margot Robbie is mid, single mothers are whores” that people take issue with. \n\nNot men privately using preferences to decide who to date or explaining them when asked.", "label": 0}
{"text": "Accept it will never happen and go jack off or something", "label": 0}
{"text": "“The people who believe it are the most detached from reality”\n\nSince when was believing your genetics and attractiveness are a highly important determinant in your ability to successfully form romantic relationships with the opposite sex “detached from reality”?", "label": 0}
{"text": "snack time's sweeter when you share it with somebody sweet", "label": 0}
{"text": "You didn’t list any facts and stats that seem like a worthy trade off for adding extra work. Being an extra mouth to feed, body to clean up after, and don’t forget having sex with. It sounds like a horrible trade off. I am not sure if you’re trolling or seriously believe picking stuff up sometimes justifies doing no housework.", "label": 0}
{"text": "Sounds like you felt the urge to be snarky and make a half assed rebuttal because I held you accountable for contradicting yourself.", "label": 0}
{"text": "They’re gonna hate on you but this is true. It’s not about having LTR preferences it’s about being disgusting when expressing them.", "label": 0}
{"text": "In the south mushrooms don’t belong in omelettes? I’m gonna do mushroom, onion, spinach, cheddar cheese. My fav is prob just onion and cheese.\n\nWhat do they do in the south? Holy trinity?", "label": 0}
{"text": "Since it’s so clear to men, what does society as a whole mean if it doesn’t include jobs and employment?", "label": 0}
{"text": "...Sounds like a-holes are just being a-holes?", "label": 0}
{"text": "Is a 20 year old dating a 23-24 year old acceptable in your eyes? Just curious", "label": 0}
{"text": "> Single males are fine, black pill is not\n\n\nThere could be some overlap.", "label": 0}
{"text": "https://preview.redd.it/vx5eqvk5oywd1.png?width=940&format=png&auto=webp&s=a600e4e58a0a25a9e983988e57492be1f9edb2b4\n\nSO this woman is married, 100 ncounts but she also struggles with dating\n\n🤔🤔🤔🤔", "label": 0}
{"text": "Directions from the court? There were no directions. Just that I can only be an every other weekend father most the year except for the summer where I ham have him biweekly from Father’s Day weekend until Labor Day. The amount of child support she receives is based on the amount of overnight visits I’m allowed. She won’t budge on that because she needs the child support money to support her alcoholism and cigarette addiction. With joint custody, there would be no child support.\n\nAnd before you counter with the expenses of raising a child, do know that I pay for most of this stuff out of pocket so he can have clothes, school supplies, haircuts, cell phone, etc because she won’t buy him anything.", "label": 0}
{"text": "Because face sitting is hot?", "label": 0}
{"text": "I assume future BF will just be your mount and you'll hang off his back all the time.", "label": 0}
{"text": "Again with the cope\n\nAs if families with stepkids from different people was some alien phenomena", "label": 0}
{"text": ">>>based on the anecdotal evidence that...... your local uni has \n\n>>his reasoning is anecdotal too.\n\n>Its really not though.\n\nI like how you talk out of both sides of your mouth.", "label": 0}
{"text": "No “woe-is-me”, black pill, or incel content.", "label": 0}
{"text": "Because this conversation was wrapped up several comments ago. You've been dragging it out for god knows what reason. If the ham sandwich comment triggered you that badly, you shouldn't be on Reddit. it's clearly not good for you.", "label": 0}
{"text": "That’s to be the uninteresting and thought crushing portion of it. Once black pillers get into details it’s generally more insane.", "label": 0}
{"text": "If the pink pillers in question are femcels and engage in lookism/man-bad/woe-is-me, then no.", "label": 0}
{"text": "Idgi!", "label": 0}
{"text": "https://nypost.com/2024/02/04/lifestyle/59-of-women-share-this-sexual-fantasy-but-what-does-it-really-mean/\n\n\nThoughts on this? In a comprehensive study, psychologist and sex researcher Justin Lehmiller found that 59 percent of women fantasize about sex with other women.", "label": 0}
{"text": "I’m 5 months older than my bf so I guess I like younger guys", "label": 0}
{"text": "Yeah but 19 is dicey", "label": 0}
{"text": "Not a problem at all.  My husband wasted a lot of money on his ex wife.  She took advantage of his income to spend it on frivolous shit.   After he dumped her he learned from his mistake of prioritizing HOT over stable/decent looking/makes good money.   We are both better off for him having learned that.  Just like women can change what they want in a partner as they get older/more experienced.  \n\nWe created such a stable, two income partnership that we are now in a financial position that either of us can spend money on whatever frivolous shit we want now.", "label": 0}
{"text": "A man telling me im bitter and have a bad attitude because i explain my perspective - what do my emotions have to do with the topic and also why must i be told what i feel?", "label": 0}
{"text": "Keep up with these studies. I’m highly skeptical about them but they only mean one thing: I keep winning 🤝", "label": 0}
{"text": ">In the south mushrooms don’t belong in omelettes?\n\nI meant that more as a \"I'm not going to tell you how to diet\". Mushrooms can absolutely go in an omelet, but it's not usual. At least I don't think it is. \n\nI'm more of a chicken, spinach and a Mexican blend for the cheese. (which includes the cheddar, I just like a mix) Sometimes I'll throw on some mozzarella cause it burns nice. \n\nMost of the flavor in my eggs comes from the seasonings and spices, any hard ingredients I add are kind of an afterthought. \n\n>What do they do in the south? Holy trinity?\n\nLol. \n\nSome mix of ham, tomatoes, onions, spinach, bacon, sausage, and cholesterol.", "label": 0}
{"text": "Correction: men find attractive women attractive even if they're wearing sweats and have their hair tied up.", "label": 0}
{"text": "Yeah that math isn't mathing. Tell you what, i will be pro life under the condition that DNA tests are done on every citizen, that data gets stored into a data base, and that way they can always match the dna of the child to the father. That way, they will forced to pay for that child they created, instead of the tax payer. \n\n\n... Which is of course ridiculous, i hope you can see why 🙄 idk whats more important to Americans, lower taxes or their freedums.", "label": 0}
{"text": "nah I disagree men are like this because women specifically say not to talk to or approach them, so the only people who actually have said social skills in that regard are those before the Me2 era which basically discouraged any and all close contact with women when a mans alone with her, and now you're at a stage where women dont even wanna be approached by random men because they think their intentions are purely sexual add in the fact that not to long ago you had the man vs bear topic which is polarizing in its own right because it basically told all men that women think all men are violent rapists and when you have young people who are still easily impressionable it creates  rift and makes it so they dont wanna socialize with the opposite sex so they never build them social skills.\n\n  \nSo no this isn't mean isolating themselves its men reacting to what women say, could also throw in the fact of the trend on social media of women complaining about the dude not even fighting for her when she says she wants to break up an then they wonder why he didn't even try and convince her or fight to keep her. Young men see this shit and say fuck that, no one wants to be emotionally manipulated just so she feels validated and wanted. \n\nYou want men to starting getting this experience again, tell women to stop playing stupid fucking mind games cause their bored and be direct when communicating their needs and wants not this he should just know bullshit", "label": 0}
{"text": "Idk, if she was getting pumped and dumped all the time and racked up a 100 n count instead of getting the ring.\n\nAlso, the struggle could be current or past tense, like if you previously struggled, so this could check out.\n\nBut yeah, idk, could be some outliers or people fibbing.", "label": 0}
{"text": "Reread my previous comments. I included statistics on hourly compensation and savings by living with a man for a woman. A man creates additional 2.5 days of work for a woman, 20 hours per month, if we by average numbers, and by splinting costs she saves $1100 dollars a month, which is $55/hour for her in compensation. Medial female earnings is $15/hour in the workforce, so she would have to work 73 hours extra to compensate for missing a man in her life. That is almost an extra week.\n\n You just choosing to ignore all of it. Also food cost is split, cleaning after extra person is easy, it doesn't double workload, I know it from personal experience, assuming person in question is not super messy, and are you saying that women don't enjoy sex and it exists purely for men's benefit?\n\nLook you always free to stay single and make your life worse. Personally I will just laugh in response.", "label": 0}
{"text": "Just unlucky", "label": 0}
{"text": "Yes, that’s listed as one reason for lack of custody, like if you were ordered to produce documents or get a psych evaluation and didn’t. \n\nThe other is if you can’t coparenting together like refuse to agree on a school or other decisions in a way that harms the kid.", "label": 0}
{"text": "Women are too lazy to lean into their gay side. They want someone else to initiate everything.", "label": 0}
{"text": "Quote me where I said that.", "label": 0}
{"text": "Can you give an example of what about it is insane? I agree that some blackpillers are mentally ill people who are just lampshading their crazy beliefs about the world and depression through ideology, but some stuff like say oofy doofy theory, betabucks, the general disinterest younger women seem to have in men their attractiveness level or lower, and society’s vitriolic hatred of sexless men definitely has a point.\n\nI’m not saying this to make a “woe is me” or “it’s over” argument so don’t ban me, but where do we allow these discussions if anything resembling blackpill talk is indiscriminately banned?", "label": 0}
{"text": "Its not what you think, it's notyour bitterness. It's because you live in a complete different world of dating. Your a woman. Try this out. Imagine if you create a dating profile on tinder or bumble, and pic a average looking man, taking average pictures. Come back to me.", "label": 0}
{"text": "So handsome. Goddamn.", "label": 0}
{"text": "How about a woman who is kind, loyal, faithful, positive, hard-working, keeps herself in shape, never says no to sex, cooks, cleans, takes care of the kids- and a man who cheats on her, calls her names, picks fights, puts her down, and hits her?", "label": 0}
{"text": "I am asking you. I didn't say you said this. I am seeking clarification.", "label": 0}
{"text": "Conditions like BPD aren't present or not. They are really on a sliding scale. She probably has a minor case.", "label": 0}
{"text": "We should STOP trying to invert everything in the world. We don't need to teach women to become men.\n\n\nLet's try and avoid complete clown world please ", "label": 0}
{"text": "Has nothing to do with bravery. It’s their right.", "label": 0}
{"text": "There were never any orders like that. As for school? I live in his district. She does not.", "label": 0}
{"text": "Nobody gives a fuck about virginity unless they're creeps. I cannot imagine any reasonably-minded woman thinking less of a guy because he's a virgin.   \n  \nHonestly, the last time I heard the word virgin used disparagingly, I was in 8th grade.", "label": 0}
{"text": "Would you go on date with a 26 year old bald guy? Not me specifically just in general.", "label": 0}
{"text": "Diet as in mushrooms are unhealthy? Sorry for not getting what you’re saying. \n\nBut yeah almost anything can go in an omelette and be good!\n\nI also honor my Scandinavian heritage by putting ketchup on my omelettes 😂", "label": 0}
{"text": "i won’t be like that girl i hung out with a few times over the summer though that needed her boyfriend to go everywhere with her. that situation was weird", "label": 0}
{"text": ">crappy colors google\n\nI know it wasn't you, but I felt pointing it out ruined the joke a bit.", "label": 0}
{"text": "I am a 37 year old virgin, I don't really see a reason to lie about it though most even if women don't find it attractive they don't seem to think you're immoral for it and it doesn't seem right to start a relationship on a lie (especially if they figure out the lie later)", "label": 0}
{"text": "Not gonna bother since i live in another world 🤦‍♀️", "label": 0}
{"text": "😂", "label": 0}
{"text": "I hope your spaghetti gets cold", "label": 0}
{"text": "100%. That is how I feel about both men and women.\n\nEven though my brain is slow so I get angry when I see paragraphs, I am a superior being. Everybody else is lesser. They have to prove their worth to me before they can have an opinion. Until they prove their worth, there’s ~70% chance I will get mad at them.\n\nLife would be a lot better if people were like dogs, only listening to me.", "label": 0}
{"text": "My boyfriend and I are egalitarian. I have always been this way. Never once have I dated a man who treated me unless I treated him to the same level. I even do this for friends and family, so the cheap weirdos on PPD who get angry over paying for meals confuse me. Who doesn't treat their loved ones to dinners?", "label": 0}
{"text": "We were raised  beliving that sex is supposed to be meaningful\n\nthat first times are supposed to be meaning full and that if you see a future or want to move in that direction, we should be honest.\n\nIf i was with a woman who was a virgin i would go at her pace, make sure she felt safe and loved, i would do my bet to let her knwo tat hr first time s with someone who loves her even if we never cross paths again. I would try to make it special so that at the very least she associates positivity and light with sex.\n\nI would hope most men would want to do the same\n\nAs it turns out most women are simply unwilling or incapable of doing this for men, seeing it as a nuisance rather than as something special.\n\nIt necessitate men to give on the dream of a non judgemental environment to lose their virginities short of paying for it\n\nIt results in two things womne say they hate. \n\nIt on a small level is a point in favour of sex work\n\nIt sets up a system where men having to live upto the action kero like ideals of women create a layer of artifice for them prventing the formation of a real connection that they say they desire\n\nThey probably dont, even if they say they do.\n\nMen just have to live with the fact that the opposite sex is largely disappointing. \n\nWomen will probably say that they find the opposite sex frightening. Whatever\n\nWe deserve the world we live in", "label": 0}
{"text": "Every man I've ever met demands meal that is mostly protein. Apparently, carbs are feminine.", "label": 0}
{"text": "I’m aware lmao - I’m talking about white women who are behind Kamala and then don’t go vote or change their vote cuz their husband hates women \n\nI am not as simple minded as someone who thinks I need this advice thanks", "label": 0}
{"text": "Your suggestion to people disabled by autism is they should “suppress all symptoms” of their disability, and now you’re saying that those disabled people should just “adapt” to society.\n\nAmazingly ableist. We don’t treat other disabilities that way.\n\nPersonally I want autistic people to be themselves. Maybe you don’t, but like I said, I’ll push back on ableism wherever that kind of ignorance is being spewed. \n\nMaybe keep your opinions about autism restricted to your own personal preference, hm?", "label": 0}
{"text": "Mate, that's not changing one's standards. It's just settling. \n\nChanging one's standards is a difficult and intentional task that generally requires a lot of awareness about what you want and deserve (as a result of your character and value). \n\nI had to come to terms with the fact I did not deserve the most beautiful, kind and thoughtful woman until I cultivated similar traits and value within myself. As a result my standards changed. Then I cultivated myself and reevaluated my standards once more. \n\nUltimately my reevaluations came from a place of humility, and most people are quite narcissistic about dating. Most people don't actually realize what they're worth (Not anything special).", "label": 0}
{"text": "Well yeah, your using your emotional experience as objective truths. Your a woman... duh.. your going to have it easier and you will NEVER experience the hardships of an average man. Period.", "label": 0}
{"text": "Well lesbian sex and dom/sub stuff (or CNC for that matter) are literally the most common fantasies", "label": 0}
{"text": "Does anyone play league of legends? Let’s play together", "label": 0}
{"text": "You're talking about American,canadian,and british women my dude, they legit been conditioned by social media and hollywood  to only want those things, it also has to do with the fact none of these women now days have had to face any actual hardship like a world war or the great depression so they get to pick and choose who they do what with, but if something like that ever occurs again you would see that attitude change real quick cause tall and handsome dont put food in your belly", "label": 0}
{"text": ">women are more emotionally intelligent\n\nI'd like to see your evidence on this one.  I've seen plenty of stunted individuals of either gender", "label": 0}
{"text": "I **am** interested in a woman who I'm attracted to's hobbies and passions. If those hobbies and passions intersect with her job, then I care about her job as a factor of getting to know her. Her knowledge stimulates conversation, and I listen because I want to know more about the woman I am attracted to. Her knowledge does **not** make her more attractive to me. I care about a woman's accomplishments because it is something she worked towards, and I will be there every step of the way as she works on her goals and cheer for her when that hard work pays off. Her accomplishments do **not** make her more attractive to me.\n\nWhat makes a woman attractive to me is how she looks, and how she treats me. What maintains a connection is our shared values, interests, and banter. A girlfriend to me is a friend who I am attracted to and want to share a life with- and like any friend, their occupation, income, and ambition are meaningless to the desire for connection. And yet, I care about those things *only* as a function of my friendship. I find social climbers who befriend people because of their social or financial status deplorable, and I walk that same path in my dating life, too. \n\nI'm interested in who my partner is and how she makes me feel. The other things don't matter, because she could be *anything* and I would care, because I care about her.", "label": 0}
{"text": "Well, in this case we are communicating on reddit so our communication is entirely verbal and I have no clue what you're on about lol", "label": 0}
{"text": ">Sorry for not getting what you’re saying.\n\nThe being repulsed by food thing. \n\n>I also honor my Scandinavian heritage by putting ketchup on my omelettes 😂\n\n*Ooooh*, you just reminded me, hashbrowns go great with omelets and the ketchup just brings it all together. \n\nYou know what, I'm done on reddit today, I'm gonna go eat.", "label": 0}
{"text": "It’s literally the clearest example of a generalization.", "label": 0}
{"text": "No", "label": 0}
{"text": "its not assumptions these stats are on google, and men who are good with money dont invest in things with a 50/50 return rate", "label": 0}
{"text": "Jesus fuck I spilled my drink 🤣🤣🤣🤣🤣", "label": 0}
{"text": "Assuming I find all other aspects of him attractive, absolutely.", "label": 0}
{"text": "Then learn how to read information and use it to develop opinions using critical thought \n\nWhenever yall do this you just say “I literally cannot think critically”", "label": 0}
{"text": "Kamal haris was the original Hawk Tuah girl", "label": 0}
{"text": ">Reread my previous comments. I included statistics on hourly compensation and savings by living with a man for a woman. A man creates additional 2.5 days of work for a woman, 20 hours per month, if we by average numbers, and by splinting costs she saves $1100 dollars a month, which is $55/hour for her in compensation. Medial female earnings is $15/hour in the workforce, so she would have to work 73 hours extra to compensate for missing a man in her life. That is almost an extra week.\n\nThis is boy math.\n\nShe can get a roommate. \n\nShe can live with her family. \n\nShe can live somewhere cheaper. \n\nShe doesn’t need dead weight. \n\n\n>Also food cost is split, \n\nMen eat more and get all resentful if the woman cooks quick food. \n\n>cleaning after extra person is easy, it doesn’t double workload, \n\nWhy clean after an extra person though when you don’t need to clean up after a roommate?\n\n>Women don’t enjoy sex and it exists purely for men’s benefit?\n\nWomen don’t have daily porn star sex the way men demand. Most of us are good with once a month or so. \n\n\nYou listed no ways you make life better. You openly admitted that you would be adding extra work and refusing to do your fair share.", "label": 0}
{"text": "21 and 28 is not that bad my dude", "label": 0}
{"text": "Playing league of legends is almost as detrimental as being 100% bald and a virgin when it comes to being a pussy magnet in your 20's.", "label": 0}
{"text": "No thanks.", "label": 0}
{"text": "do you support abortion bans after 12 weeks?", "label": 0}
{"text": "\n**Attention!**\n\n* You can post off topic/jokes/puns as a comment to this Automoderator message.\n\n* For \"Debate\" and \"Question for X\" Threads: Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* If you want to agree with OP instead of challenging their view or if the question is not targeted at you, post it as an answer to this comment.\n\n* OP you can choose your own flair [according to these guidelines.](https://www.reddit.com/r/PurplePillDebate/wiki/flair), just press Flair under your post!\n\nThanks for your cooperation and enjoy the discussion!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": "It's not that big of an age gap though....", "label": 0}
{"text": "Sometimes it seems men like to announce their standards because they think it'll affect the behavior of women. If they were worth changing for, they wouldn't be struggling.", "label": 0}
{"text": "Are you talking about in real life, or on the internet? I don't see why anybody should have to censor themselves on the internet and speak in casual niceities. We're all anonymous here. The internet, reddit in particular, exists for us to express our thoughts in the most raw, unfiltered way possible (within reason, of course). \n\nI don't believe that you've ever heard anybody say any of that cringe shit in real life.", "label": 0}
{"text": "nah its high priority for most women now days, considering most are happy to share tall handsome dudes or sit sinigle until one becomes available.", "label": 0}
{"text": "I don’t play it often. Once every year", "label": 0}
{"text": "**Attention!**\n\n* You can post off topic/jokes/puns as a comment to this Automoderator message.\n\n* For \"Debate\" and \"Question for X\" Threads: Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* If you want to agree with OP instead of challenging their view or if the question is not targeted at you, post it as an answer to this comment.\n\n* OP you can choose your own flair [according to these guidelines.](https://www.reddit.com/r/PurplePillDebate/wiki/flair), just press Flair under your post!\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": "Hi OP,\n\nYou've chosen to identify your thread as a Debate. As such you are expected to actively engage in your own thread with a mind open to being changed. [PPD has guidelines for what that involves.](https://www.reddit.com/r/PurplePillDebate/wiki/rules#wiki_cmv_posts)\n\n>*OPs author must genuinely hold the position and you must be open to having your view challenged.* \n\n>An unwillingness to debate in good faith may be inferred from one or several of the following:\n\n>* Ignoring the main point of a comment, especially to point out some minor inconsistency;\n\n>* Refusing to make concessions that an alternate view has merit;\n\n>* Focusing only on the weaker arguments;\n\n>* Only having discussions with users who agree with your position.\n\nFailure to keep to this higher standard (we only apply to Debate OPs) may result in deletion of the whole thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": "hey !! gald to see the misogyny dector is working as it should. Just a quick question< seeing as you have this devine ability how did you end up in a relationship with one such asshole? asking for a friend. Thanks bye", "label": 0}
{"text": "Reddit and age gaps 🤣🤣🤣. It's always a clusterfuck", "label": 0}
{"text": "It means that people don't care about you. I've already told you I can't explain it. Do some research if you care.", "label": 0}
{"text": "because he likes it", "label": 0}
{"text": "Do you see morality as irrelevant in other subjects or just the ones that benefit you personally?", "label": 0}
{"text": "I thought you were bluepill, what changed?", "label": 0}
{"text": "The problem is that a guy doesn’t have to be doing anything inappropriate to be considered creepy.   “Creepy” these days is anything a woman isn’t interested in.   It’s about how the man is perceived.  \n\nIf guy A and guy B behave the same way but the woman is interested in guy A but not guy B, then guy B is being a creep but A isn’t, despite the fact their behavior was the same.     \n\nIt’s the same issue we see with harassment policies which often define harassment by whether or not an action is welcome or not which again is about the woman’s perception rather than the action itself.   Again, two men can say or do the exact same thing but one is a harasser and one isn’t based on how the woman feels about each.", "label": 0}
{"text": "Yeah can’t say I’d expect anything less, ableist *and* obstinate. Thanks for demonstrating why men should never change a woman.", "label": 0}
{"text": "Here we go again", "label": 0}
{"text": "Ugh, gross", "label": 0}
{"text": "Once a year is still too often for League.", "label": 0}
{"text": "The assumption I did is an example and I don’t know you. You’re trying to make me feel insecure as if I could only come to this conclusion if I was in bad relationships and I need to take accountability for a piece of shit man which is exactly my point. How about this - I’m smarter than you.", "label": 0}
{"text": "He's doing more for a woman who doesn't give a shit about him than his own partner who's doting and loving towards him.", "label": 0}
{"text": "Your missing out", "label": 0}
{"text": "If they’re saying these things in forums in which these topics are discussed then does it matter if “nobody asked”? Technically nobody “asked” you to post this and yet here you are. People can voice their opinion regardless of if someone “asked” or not. That’s a ridiculous reason to have an issue with them voicing their preference. Now if you just don’t like how it’s said that’s different. Still though generally nobody is walking up to women and saying these things. I’m a black man and I see women (mainly black ones) say disparaging things online about black men and why they won’t date them. Nobody tells them “nobody asked”. I also don’t have to consume such content if I don’t like it….. Feel free to respond OP and make sure not to quote me out of context in your response this time and ask to clarify if you’re confused. And Don’t ask questions with statement I didn’t make.", "label": 0}
{"text": "It seems like he's hunched over...?", "label": 0}
{"text": "You don’t get face sitting?? 🧐🧐🧐", "label": 0}
{"text": "No", "label": 0}
{"text": "I don’t understand why there’s so much negativity around it. Is it because of the type of people who play it? Because it’s definitely a fun game.", "label": 0}
{"text": "We can try again if you'd like.\n\nThe question I asked is whether women would be justified in withholding communication about their needs to their partner, given that there is a risk that their communication will be misconstrued as nagging?  \n\nYou responded by pointing out that sometimes men don't listen to criticisms, which is true, sometimes that happens, but do you see how that isn't an answer to my question?", "label": 0}
{"text": "I would use the term crybullies. Because its more like assholes who pretend theyre victims.", "label": 0}
{"text": "Average league of legends fan:\n\nhttps://i.redd.it/mt092g38sywd1.gif", "label": 0}
{"text": "So true.", "label": 0}
{"text": "Thanks for telling me how i am to feel", "label": 0}
{"text": "It's not black and white, men have valid preferences that make sense. Voicing those preferences helps to correct women's bad behaviour. \n\n  \nMen are just expected to have zero standards and women act surprised when men with options play the field or go for a better woman after getting to know her. In fact, men are always told to lower our standards while women are never told to do so.", "label": 0}
{"text": "I'm no trump supporter but fuck me the left wing narrative of victim/oppresor is scary as fuck... like it permeats so many levels of society today and it's so damaging to the overall human mindset.", "label": 0}
{"text": "A man being an adult virgin is a warning sign that there's something wrong with you.\n\nSomething wrong with you means that you're weak in some regard(s).\n\nWomen are not attracted to weak men.\n\nIt's not about *teaching*. Everyone's first time is awkward, but sex isn't so complex that you need lessons.", "label": 0}
{"text": "Why? The vast majority of abortions happen before 12 weeks so it certainly wouldn't decrease the amount by much?", "label": 0}
{"text": "\\>  I don't see why anybody should have to censor themselves on the internet and speak in casual niceities\n\nThe issue is when they expect niceities from other people. Be an asshole and proud of it. Dont acr like a victim when being an asshole has consequences.", "label": 0}
{"text": "oh wait. i didn’t even notice those sus objects in the picture", "label": 0}
{"text": "Young women dont stay young forever.", "label": 0}
{"text": "no no. I just expect all womne everywhere to take accountability for the womne who claim that they can sense the misogyny of lvm like me through the screen and that was why we lack any king of sexual or romantic success.\n\nAs long as they keep saying that, i am gonna keep prodding at any woman who had been in a relationship with a shitty boyfriend", "label": 0}
{"text": "I already clearly stated, in detail, which parts i thought were difficult and which part weren't. It's only a contradiction because you seem to want a black or white answer and ignore everything else i said.\n\nThe act of losing weight itself is easy. Learning how to lose weight can be difficult. However, this difficulty can be overcome with some effort, just like the original comment stated. That's as close to a black and white answer as i can give you.\n\n> It sounds like you just want to get a last word in to “win”.\n\nIf it was about winning, i won 50 comments ago when you implied a women eating 1400 calories was an insurmountable task despite me, as a man, eating 1500 calories per day at one point without great difficulty. I even broke down my diet for you to show how simple it is.", "label": 0}
{"text": "Bro, no men just blurts these things out lmao (online or irl)…\n\nIt’s always in the context of a discussion. In which case yes, everytime these preferences are stated, it was always a valid self-expression.\n\nStop being “stuck-up”.", "label": 0}
{"text": "So the user known as steakman has recently said on the post asking which of us is going to be getting a relationship next that he knows something we don't about a user here. In addition to this, I've noticed that two users here have been getting really flirty. Through my detective work, I feel like I figured out who he was talking about.", "label": 0}
{"text": "I think what it sounds like is black pillers think looks should matter more than they do. They actually have a looks morality. I mean even the obsession with looksmatch and comparing men and women in this regard is kind of an odd comparison. It’s starting with the assumption that looks are ultimately important just to end on it. But really it’s just ultimately important to them, so they dig deeper, but really it’s just their feels, not really an attachment to reality.\n\nThe issue is that this thinking becomes terminally disruptive, I think the only thing I’ve seen that compares is like when racists complain about the Jews, it’s that kind of idee fixe. And this also ruins communities.\n\nI mean sure, you can say looks matter, everything matters, and it is almost entirely uninteresting that this is the case. It doesn’t even really need to be brought up, red pill and blue pill both did not discuss looks for a decade because they both agreed some manner of looks is important. It’s just how black pillers talk about it that is incorrect and doesn’t really matter.\n\nAs for where to discuss it, I don’t know, those places often get shut down on Reddit. Part of the reason we don’t even want to enable the lighter shades of black pill if you will here.", "label": 0}
{"text": "So you said learning can be difficult then you said women are lazy for not reading labels. You constantly contradict yourself.", "label": 0}
{"text": "why do you always use so many emojis, that's like early/mid 2010s culture. is romania a decade behind on digital norms or something?", "label": 0}
{"text": "I would like to know more why you think men are more shy these days?", "label": 0}
{"text": "The recent survey showed who is the real deal here. Single Man and proud.", "label": 0}
{"text": "Yeah that’s a symptom of “low value” men who make hating women because they can’t get laid their entire personality.", "label": 0}
{"text": "Funny how you point this towards men when the issue of tact is a much bigger problem among women. Can't say I disagree though.\n\nAmericans were never known for our refined etiquette and cultured taste, however around the time of reality television's debut it's become a clinical deficit in society.", "label": 0}
{"text": "SO it's morally questionable to fantasize about people who aren't your partner especially if they are in proximity/people you know? Right? RIGHT?", "label": 0}
{"text": "Yup.", "label": 0}
{"text": "Real", "label": 0}
{"text": "OK. You seem really emotional.", "label": 0}
{"text": "Without sounding like a full blown \"misogynist,\" is giving woman full agency necessarily a good thing though. More choices mean woman more can choose the person they want to marry and more can abstain altogether but there's also more single mothers who are overworked and need to fill 2 roles instead of one, more juvenile delinquency because there's either no father figure in the household to keep them in check or non - biological fathers who are not allowed too. And that's not even getting to the whole pumping and dumping scenarios and widespread cheating due to no fault divorce being a thing for a while now. I'm not asking to roll women's rights back and I'm not offering any better suggestions so take it how you will but please don't misconstrue my words.", "label": 0}
{"text": "Damn not even that body at 55 is aging well...it's over.", "label": 0}
{"text": "Are you a part of that 59% Ms. Moshi?", "label": 0}
{"text": "What pill are you?", "label": 0}
{"text": "Hey hey where are the results 🤣🤣🤣", "label": 0}
{"text": "![gif](giphy|S2glR7YI3QG9dZdKNR|downsized)\n\nEveryone deserves a sweet treat", "label": 0}
{"text": "All the data shows that a man's appearance doesn't correlate with marriage satisfaction. This means better looking men aren't actually better husbands than average looking men. So yes, women do need to lower their standards.", "label": 0}
{"text": "Let’s do chocolate cookies", "label": 0}
{"text": "I AM SO READY", "label": 0}
{"text": "\n**Attention!**\n\n* You can post off topic/jokes/puns as a comment to this Automoderator message.\n\n* For \"Debate\" and \"Question for X\" Threads: Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* If you want to agree with OP instead of challenging their view or if the question is not targeted at you, post it as an answer to this comment.\n\n* OP you can choose your own flair [according to these guidelines.](https://www.reddit.com/r/PurplePillDebate/wiki/flair), just press Flair under your post!\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": "This post has been removed for being designed as a circlejerk and to induce rhetoric. Please resubmit your post flaired as a “Debate” where you expect to have your view challenged or “Q4” flaired to the respective group to have the mods approve it.\n\nIf you post is flaired “Debate” make sure it is a statement or declaration or topical category, NOT a question.\n\nAdditionally, we do not allow users of the same group to ask those groups questions i.e. M4M, W4W, RP4RP, or BP4BP, please do that in your respective communities, this is a place for groups outside your own to challenge your beliefs. Any further questions should go to modmail.", "label": 0}
{"text": "Interesting it seems like you don't mind if a guy is bald lol you have been pretty consistent with your answer.", "label": 0}
{"text": "That was a dismissive response to your offhand comment that i should provide nutritional classes.", "label": 0}
{"text": "PPD COUPLE?", "label": 0}
{"text": "Really? Who gives a shit how many emojis a person uses? You a grammar nazi reincarnation or something?\n\nTo answer your question: that's just how I write. Got a problem?", "label": 0}
{"text": "IT'S THOSE DARN VIDEO GAMES I TELL YA!!! No wonder all the kids these days are so violent too.", "label": 0}
{"text": "me (atheist sigma) reminding european christcels (betas) that christ wasn't actually born in the winter and most aspects of \"christmas\" akshually come from pagan germanic and roman winter festivals\n\nhttps://preview.redd.it/b3z63youtywd1.jpeg?width=1500&format=pjpg&auto=webp&s=1794af2aade6c3d8049ef9f808158e4f8a85bdcf", "label": 0}
{"text": "She wants to fuck her female friend or summat", "label": 0}
{"text": "yeah. atleast this way i dont have to sit and cower wondering why i was never wanted while trying to be a \" good guy \" giving myself complexes in the process.\n\nAs fucked up as it is, being a woman hater is a personal improvemnet", "label": 0}
{"text": "I played the new expansion and got to endgame PvP, then realized one afternoon I was doing napkin math of gear I’d need and I gave myself the ick 😂", "label": 0}
{"text": "Yeah in the same way some men shouldn't have daughters some women shouldn't have sons.", "label": 0}
{"text": "Ah ok interesting. I ask because that was my initial age gap with my partner. \n\nTo be honest it is a complicated topic but it seems people online generally think some age gaps between early 20 somethings are fine, but then when that gap gets larger it’s not. I’m not really sure what I think anymore tbh apart from old men/women seeking out barely legal people is a bit suss sometimes.", "label": 0}
{"text": "I can almost guarantee whoever you are thinking is not who I was talking about", "label": 0}
{"text": "I used to be blue pill but idk now. Maybe some blue + pink + no pill", "label": 0}
{"text": "I think it is more about women using men for free meals. Every man has experienced that so there is reason why this is a bit of a raw area.\n\nPersonally the worst one was a woman who literally bolted when the check came, chair falling over and all.", "label": 0}
{"text": "Yikes. Great way to have a discussion.", "label": 0}
{"text": "How literal is  the \"any abortion\" part?", "label": 0}
{"text": "Cool I’m glad your mother birthed you so that you could justify your mental illness with woman hating.", "label": 0}
{"text": "Yea", "label": 0}
{"text": "My mother can go fuck herself.", "label": 0}
{"text": "Say names bro. My mind isn't working at all rn ", "label": 0}
{"text": "The n-count graph I don't get. So the average numbers are 4 for women and 2 for men?", "label": 0}
{"text": "People can have different - some people are just late bloomers and sexual development begins later. I didn’t lose my virginity until my 20s - I’m a woman and I wouldn’t care if a guy was a virgin tbh.", "label": 0}
{"text": "Bruh", "label": 0}
{"text": "Ok then if you ask what a person preference is and they tell you don't ask why.", "label": 0}
{"text": "Brother it is the gym people are going to wear skintight clothes and it's pretty normal, granted I'm desensitized to it at this point but don't shift your gym schedule due to being scared of a chick who has a sports bra on, just go do your workout and you'll be good.", "label": 0}
{"text": "> Every man has experienced that so there is reason why this is a bit of a raw area.\n\nI have no idea how widespread this is, but is the meal hundreds of dollars? Why is this such a grudge? If I got ripped off for a twenty dollar meal I would figure, Oh Well. If I got someone who bolted when the check arrived, I would wonder how I missed the obvious signs.", "label": 0}
{"text": "It’s from the movie “Naked Gun” 😂", "label": 0}
{"text": "Yikes you’re the one saying “nobody cares”. If you don’t care then you don’t have to say anything.", "label": 0}
{"text": "Any age gap CAN be fine (as long as it’s legal) it’s more like when do I start to get suspicious when I learn about it. And other factors make it more/less suspicious like does the older person always date near the age of consent? Did they seek it out or did they meet before knowing each others ages, is the older person conscious about not steamrolling their partner or are they a “well they could have said no if they didn’t like it” type, etc.", "label": 0}
{"text": "Hannah…🙄", "label": 0}
{"text": "glad to see you mellowing out somewhat", "label": 0}
{"text": "Ah ok. Pink pill I guess makes sense. I sometimes find pink pill stuff irks me a little ngl but you seem pretty sane. \n\nI’ve come to the conclusion I’m probably purple pilled. I thought I was blue pilled, but then I realised I don’t think I agree with them enough", "label": 0}
{"text": "Wow. How rude", "label": 0}
{"text": "I already addressed roommate part. To compare obligations roommates have to one another with a relationship that two people supposed to have is ridiculous. Family ages and dies, boyfriend/husband is the person who is most likely to spend a live with you, if you treat him well of course. Oh and women as a general rule don't want to live in less safe, less expensive place, with less amenities. Again you ladies aim for higher standard of living, especially if you want kids. And if a man helps you achieve any/all of that then he is not a dead weight. \n\nAs food, yea imagine that men want to benefit from relationship as opposed to just pay and pay. You want to only take, judging by comments and never give. Maybe it is better for people like you to stay single after all. \n\nAs for sex, women endlessly scream here that women also enjoy sex and in any case if both of you care about each other you will be able to negotiate something that satisfying to both of you. But if you only interested in your own pleasure again just masturbate and have ons once a month, whatever. Also what the hell is \"porn star sex\" is supposed to mean?", "label": 0}
{"text": "i was just focusing on the text lol", "label": 0}
{"text": "I don't wanna hurt anyone's feeling. When silly sheila was saying she was going to leave this sub because I hurt her feelings by saying her and steakman were flirting, it actually made me feel really bad. I don't want to repeat that, but in the same breath I had to mention it to you all.", "label": 0}
{"text": "I’m sure she wishes she did that night.", "label": 0}
{"text": "1) she is attracted to him or curious about possibly being attracted to him physically\n2) she is compatible with him \n\nIt can’t get any more specific than that because it varies from person to person", "label": 0}
{"text": "You are more pink pill ", "label": 0}
{"text": "Well it’s obviously someone on the daily I was talking about because that’s what the question was about", "label": 0}
{"text": "![gif](giphy|LKTTAzGboJGzC|downsized)", "label": 0}
{"text": "Differences in strength, height and endurance don't change with age.", "label": 0}
{"text": "If you think you're likely to change your mind then you're just \"childless\". \"Childfree\" implies a strong desire to exit the gene pool.", "label": 0}
{"text": "You’re definitely getting your computer turned off again", "label": 0}
{"text": "I get it .Np", "label": 0}
{"text": "I see no problem with asking why. Just dont give a creepy answer.", "label": 0}
{"text": "Literal", "label": 0}
{"text": ">  There are a lot less abortions here than in many other countries\n\n\nAre you adjusting for births or population?", "label": 0}
{"text": "Yeah, in a way doing that helps me deal with the reality of being those two things. But I thought you were a lesbian?\n\nAlso I have been meaning to ask you which women on here would you say is most your type? You can dm me if you don't wanna drop any names, though I will be disappointed you didn't just say it here.", "label": 0}
{"text": "> possibly\n\n\nOh no.", "label": 0}
{"text": "I'm about your height and have yet to notice an issue. Sure, there are some women on tinder who are upfront about a height standard, but not even 1 in 10. And when I'm out in the world, I don't see only 6-footers managing to date.", "label": 0}
{"text": "But you are....pre-marital sex, etc increase the likelihood of single mothers, spread of STD's, etc.\n\nA human requires good parental support from both financially capable, mentally healthy, and emotionally present PARENTS which are most of the time ABSENT from those born from unwanted pregnancies, etc.\n\nPlease....I hope any good, virgin woman won't cross your path. \n\nCan't believe someone 25+ would say this SMH", "label": 0}
{"text": "maybe\n\nbut then I read that pink pillers lean trad\n\nand I'm definitely don't trad, not even remotely", "label": 0}
{"text": ">European christcels \n\nSo, like mostly people from Poland and Italy?", "label": 0}
{"text": "You've personally told guys what preferences they should and shouldn't have on here.\n\nMost of your posts come off as an attempt to gaslight an entire sub.", "label": 0}
{"text": "what an evil thing to wish upon me", "label": 0}
{"text": "too bad she gave in and gave birth to a kid  9 months later who questions his existence and its value 31 years later\n\nwouldn't that make all of this her fault\n\nNah. still my fault.", "label": 0}
{"text": "How's your mom doing Patrick Bateman?", "label": 0}
{"text": "> Bro, no men just blurts these things out at random lmao (online or irl)\n\nThats a lie. Especially one popular example of this was on twitter when the daenerys actress post something innocent on IG and a guy posted how she hit the wall. \n\nSame with the twitter example I gave. Who told that guy to talk about Taylor Swift fertility?", "label": 0}
{"text": "Coffee and cookies was my breakfast this morning", "label": 0}
{"text": "![gif](giphy|MCGbKRgIbgJxu)\n\nI'd rather you say nothing then tease us", "label": 0}
{"text": "I’m only joking. We are not actually aha. \n\nMost of my type? None really. I’ve not seen any other than two", "label": 0}
{"text": "Yeah but cmon man you aint fooling nobody.", "label": 0}
{"text": "> People can voice their opinion regardless of if someone “asked” or not\n\nThen they should STFU when they get backlash for it. I’m tired of assholes, acting like victims.", "label": 0}
{"text": "Men who demand anal sex from their partners should first shove a dildo up their ass without lube or foreplay", "label": 0}
{"text": "If you're looking for the internet to be kind and courteous you're going to have a bad time.", "label": 0}
{"text": "I feel like you’d punch one of the scare actors", "label": 0}
{"text": "for the 865467th time this q has been asked: I do not care about anything a man did in the past, I would not accept a man not spending money on ME to the level *I* require in a relationship (which is zero for me i have supported most of my bfs or they were very poor). I would never accept less than I want or need sexually, financially or love wise \"as long as they didn't do it for anyone else\". I don't care what happened with anyone else, I care what happens with him and me.\n\n this whole line of thinking is alien and bizarre to me i can't understand why men here keep trying to get women to understand the weird circumstances of dating someone who doesn't want to do sex things with you they supposedly did gleefully with exes. don't be with them what do you want. dont be the dull bore she doesn't want to blow 🤷‍♀️", "label": 0}
{"text": "I think... you're using two words that have similar meanings but aren't the same and are incorrectly using one to directly represent the other. \n\nTo use an excuse as a means to an end is one thing. In this example, it is a reason to make contact with someone.\n\nTo use a trick to learn the act of doing something is quite a different thing altogether. \n\nDon't confuse the two.", "label": 0}
{"text": "For me it was like I could see the person who she was underneath, but she is a mix of good and bad. And you just think to yourself that you can put up with this or that occasional bullshit if it means you get this hot and amazing person in return.\n\nI've seen both men and women put up with worse, so why not tolerate their rare crazy outbursts? Also you genuinely feel for this person. Just out and dumping someone over some faults feels wrong if you truly love them. \n\nJenny wasn't manipulating forest, she liked him but he was just too dumb to marry and she had the wisdom to not scar him for life by telling him the truth. It would have been like her marrying a child because that's where Forest's brain was at.", "label": 0}
{"text": "lol shush", "label": 0}
{"text": "League of Legends is truly one of the worst games I have ever played in my entire life. I would rather huff galaxy gas and overdose on black tar fentanyl behind a dirty dumpster than play that game.", "label": 0}
{"text": "> The problem is that a guy doesn’t have to be doing anything inappropriate to be considered creepy. \n\nGuys will say this and never give you an example of why they were called creepy. \n\nAlso. When people try to give advice on what is considered creepy, a lot of these guys will just say “Fuck you, I do what I want”", "label": 0}
{"text": "Nah. I actually usually just scream and then laugh", "label": 0}
{"text": "It's basically the same, what an adult and a child need is the same.", "label": 0}
{"text": "This.", "label": 0}
{"text": "> It's not black and white\n\n“Dont be an asshole” is very simple.", "label": 0}
{"text": "I am", "label": 0}
{"text": "https://youtu.be/YudHcBIxlYw", "label": 0}
{"text": "The problem wasn’t that you ever mentioned it. It’s that you continued to keep mentioning it like you are still doing now when Sheila made it clear she did not like what you were saying", "label": 0}
{"text": "tilly might not even like future bf. that could be an issue 😣", "label": 0}
{"text": "Go cry about it! Not everyone is like you.", "label": 0}
{"text": "Seems pretty fair!", "label": 0}
{"text": "For example? ", "label": 0}
{"text": "I didn’t realise there are so many…army bases? Buildings?? Shaped like boobs in the US", "label": 0}
{"text": "....at this point I can say this person is the canon seeker of this sub now I can say that right?", "label": 0}
{"text": "It feels like, when someone treats you badly it feels normal. And when someone treats you nicely, it feels weird. Abuse is what makes us feel normal.", "label": 0}
{"text": "So it IS an asshole answer.", "label": 0}
{"text": "Gives me hope not gonna lie.", "label": 0}
{"text": "purple is blue + red no?\n\nwhich part od the red pill  you agree?\n\nwe need more colors lol because purple could be blue + pink\n\nhttps://preview.redd.it/enfo28dzwywd1.png?width=472&format=png&auto=webp&s=928f03617ba1ae73ad117da69f27d62071825d46\n\nthis is blue + pink + no pill lol", "label": 0}
{"text": "Is Tilly protective of you? I think most socialized dogs are pretty chill.", "label": 0}
{"text": "Do you know how to read? I never said I don't care. I said people don't inherently care about men.", "label": 0}
{"text": "Yeah it's weird. If you look through his post history he's basically telling other men they are losers/or going on a rant about redpill.\n\nOr he claims none of this stuff exists, and everything is ragebait.\n\nQuite literally he's a broken record, just thousands of comments saying the same thing.", "label": 0}
{"text": "Subscribing to a false premise is not ''missing out''", "label": 0}
{"text": "Context matters chances are:\n1. He was being an asshole and didnt want to admit it.\n2. He cares way too much about what blue hair feminists tell him.\n\nI get called the manhater constantly on this sub and you hardly see me giving a shit", "label": 0}
{"text": "Most men have dates and have sex.", "label": 0}
{"text": "Hmm OK I disagree.  I think communication is really important in a relationship, I think if your needs aren't being met it's really important to communicate that with your partner.  But to each their own I suppose.", "label": 0}
{"text": "To be fair it also appears she cought him by surprise with the photo. I myself had some pics where I have the urge to self delete 🤣", "label": 0}
{"text": "It's the hypocrisy really", "label": 0}
{"text": "she’s not aggressive but she’s really standoffish around people she doesn’t know/like. she will also stand in front of someone that doesn’t know and bark at them lol", "label": 0}
{"text": "Low testosterone.", "label": 0}
{"text": "no who cares about that, live streamers is a personal interaction", "label": 0}
{"text": "Men have better cognitive abilities on average, so the maturity ceiling for women is still lesser than that of men's. Therefore, men dating older women is predatory", "label": 0}
{"text": "For a *sex* *worker*, which brings a very different kind of connotation to this discussion than doing the same for a standard romantic/sexual partner", "label": 0}
{"text": "What's the pink pill btw? Like what does it promote?", "label": 0}
{"text": "If [she](https://np.reddit.com/r/shortguys/s/FUE11joxCZ) was with a short dude making him pull all the luggage they’d still bitch how she’s using him as billy beta and how good for nothing short guys are other than being simps.", "label": 0}
{"text": "> Women talk shit all the time and get away with it\n\nNo they dont. They get huge backlash too. I just did a post about how plenty of men get away with talking shit about women when it is clearly deserved.", "label": 0}
{"text": "Today I have spent more time on here than I have ever done. I need to spend less time on here tomorrow. I believe I only accomplished 3 hours of straight work today.", "label": 0}
{"text": "When I think about my top ten fears, the wall is not one of them. \n\nI think when women fear it, it is not the age itself, it’s worrying them that they’ve not hit certain milestones by that age. I’m at the age where a lot of people here would consider me “too old”, but I don’t care because I’ve met a lot of my interpersonal goals, and I’m in a relationship. Women who secure a relationship by the age where there are less people in one are generally happy, even if they get old. \n\nI would argue this actually happens to guys as well. Maybe not on the same scale, but men start to fret too when they realise they’ve gotten in years and not achieved the life they wanted. \n\nBut yeah, just my two cents.", "label": 0}
{"text": "Some religious women still find that repulsive internally it seems.", "label": 0}
{"text": "Well I guess that's good news since nothing will change from red pillers.", "label": 0}
{"text": "Depends if there’s anything you can really do. If not, all you can do is cope.", "label": 0}
{"text": "How does a relationship being complex make it unbelievable that women skew towards hypergamy?\n\nWouldn't the complexity not just mean they could for one reason or another believe that they infact did find a superior partner?", "label": 0}
{"text": "As a stay at home mom, I think you overestimate how much free time you’d actually have. It’s honestly more emotionally draining than most jobs.", "label": 0}
{"text": "You're the one who decided to whine to other people about it, clearly you care enough ", "label": 0}
{"text": "That's why it's best to get your passport, and they might if ww3 starts but something tells me you're young enough to still be drafted", "label": 0}
{"text": "Final predictions for Ilia - Holloway. I will go for 3rd round Ilia KO", "label": 0}
{"text": "Is her pussy that good", "label": 0}
{"text": "Respectfully, you don't even perceive most men.", "label": 0}
{"text": "Shitposting on the daily thread is an honorable hobby.", "label": 0}
{"text": "I'm a childfree guy, which is why I made sure to specify \"househusband\" Instead of SAHD. Having no kids + living in a smaller living space (so I don't have much space to clean), would mean a relatively easy and responsibility free life. Like I just have to cook and clean. I can do laundrry once a week.", "label": 0}
{"text": "Dude get a job", "label": 0}
{"text": "Lol yeah they do. Look at insa, tiktok, Twitter, irl at work. Come on.\n\nThis girl was talking about my d in a room of like 12 people and nobody said anything because it was considered a flirt. At my current work I can hear them talk about who they like/don't like and they can be insulting as hell.", "label": 0}
{"text": ">No. I'm serious\n\nI can translate for you. Their degree or high powered job doesn't matter. What matters if they're attracted to me, do they have time for me in their life, do they want me in their life, and the most important question do they want to date me. Women tend not to date down so it's a fair bet that a higher educated, ambitious, athletic woman wouldn't want a man who's the opposite or less impressive.  Basically you always have to do some mental math of how likely is any given woman to say yes to a date. When I think of high achieving or upper class women the answer is always extremely low.", "label": 0}
{"text": "Yeah same . She's one of my fav ppd posters", "label": 0}
{"text": "Couldn’t someone tell you the same thing though?There are people who think you’re an asshole and should STFU when you get backlash for your post. So why wouldn’t you? And don’t say it because you don’t act like a victim. Just the other day you acted like you were a victim of trolling when I simply wanted to have a discussion.", "label": 0}
{"text": "Man this shit junobote sword isnt selling, need those 400 lucents to trait my lequirius daggers.", "label": 0}
{"text": "Very cute.", "label": 0}
{"text": "I care about it 🤷‍♀️", "label": 0}
{"text": "no looks posts", "label": 0}
{"text": "I assumed your username refers to a line from “Disposable Teens”. \n\n\n\nNah, the misrepresentation of a personality and attitude is fraud.  Totally actionable.", "label": 0}
{"text": "\"When you cut out a man's tongue, you are not proving him a liar, you are only telling the world that you fear what he might say.\"\n\nBlack pill minds can be changed by discussion. They will only be galvanized by censorship. We've seen this with basically every ideology in history, you can burn all the books you like, but their writers will still hold the same beliefs, and you can't change those by force. By censoring groups you see as \"toxic\" you're just sticking your fingers in your ears and pretending they aren't there, but it doesn't change anything, they don't go away, and I wonder how many people actually realize this; PPD mods apparently don't.", "label": 0}
{"text": "Because being an asshole typically works and getting called out sucks.", "label": 0}
{"text": "\"Being invisible has downsides, too. It's not limited to not being noticed on a street. But as a woman you clearly can't imagine what it entails\".\n\nLiterally nobody knows what it is to be invisible. As a man, you can't imagine what it entails either, because you literally are not invisible, nor can you be. To imply that my gender is the reason your point isn't getting across is, in fact, attacking my intelligence. To imply that my gender is the reason your point isn't getting across also implies that it somehow impacts literal invisibility, it does not.\n\nYou're leaning into the literal definition as it suits you, and straying away from it when it doesn't. As the original comment wasn't talking about literal invisibility, it was clearly talking about invisibility as \"not getting harassed/approached by men on the street\". You're just trying to discount someone else's experience.", "label": 0}
{"text": "that is so backwards", "label": 0}
{"text": "[Here ya go!](https://np.reddit.com/r/PurplePillDebate/comments/1g23a8g/comment/lrl0gpp/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "label": 0}
{"text": "Only when im desd", "label": 0}
{"text": "what do you think \"hypergamy\" means?", "label": 0}
{"text": "By your standards yes. Because it would be a moral judgment based upon her choices.", "label": 0}
{"text": "Nope. I care very much about a man’s personality and experience, about his accomplishments and his talents. I don’t regard him as a thing, but a fully realized person worth knowing.", "label": 0}
{"text": ">for the 865467th time\n\n🤣🤣🤣", "label": 0}
{"text": "Get a job", "label": 0}
{"text": "calm down we had microfilm", "label": 0}
{"text": "So your original point was that men aren't hated for their preferences, and when given a reasonable rebuttal to that, you shifted the goal posts to say men care about what blue haired feminists think too much?", "label": 0}
{"text": "![gif](giphy|13JMrJBqZvhjZC|downsized)", "label": 0}
{"text": "I don’t necessarily agree with a lot of it, it’s just I don’t agree with some blue pill stances. Like I don’t agree people should not be able to have standards on how many partners the people they date have. I also think that when people first meet, generally speaking, looks are more important than personality. In a relationship they become equal, but in a situation you’re meeting someone? No. \n\nI still lean blue, heavily, but I hesitate to call myself 100% blue.", "label": 0}
{"text": "It's median so if you selected a woman at random from the dataset the most likely n-count she'd have is 4, and if a man it'd be 2. The mean (average) is 11 for women and 8 for men meaning somebody in each category probably threw in a humongous number", "label": 0}
{"text": "https://np.reddit.com/r/Marriage/comments/1c5khqj/fantasizing_about_other_women_while/\n\n\nAcceptable or not?", "label": 0}
{"text": "Damn only two have shown themselves? Lammmeeee. \n\nThat dress was cringe but yeah she was pretty. Did you see what saraimarsena looked like?", "label": 0}
{"text": "Women don't leave a good man? Ever?", "label": 0}
{"text": "why do you include yourself with the short guys i'm talking about?\n\nshort guys are not a monolith. i never get posts from the short sub only short guys which is let's be a honest an incel sub.", "label": 0}
{"text": "He has 4 moods . Short men bad , Virgin men bad , John bad and All women good ", "label": 0}
{"text": "So these cultural changes only took place in counties where the sex ed was? Which would indicate that the sex ed was part of what did it\n\nThat's a reach", "label": 0}
{"text": "Wdym 👀", "label": 0}
{"text": "Lmfao", "label": 0}
{"text": "Been meaning to make this exact post but im lazy", "label": 0}
{"text": "Look man I don’t really care if you want to make some joke about me being a thing with someone here if that’s what you’re thinking of doing. But if you’re going to be weird about it, then people aren’t going to appreciate it. And if whoever you mention shows that they aren’t comfortable with how you’re talking about them, then you need to drop it right away", "label": 0}
{"text": "Major holidays of all organized religions are modeled on ancient pagan celebrations, intentionally so that the masses could be gradually converted without really noticing it", "label": 0}
{"text": "You dont know what gaslighting is", "label": 0}
{"text": "I have - again not really my type. I have a preference but I don’t know if I can without sounding bigoted ahah", "label": 0}
{"text": "Dude you always say all short men are this or that .You don't actually mean what you are saying rn", "label": 0}
{"text": "Did you get magic underwear delivered to your manger?", "label": 0}
{"text": "10% luck\n\n20% skill\n\n15% concentrated power of will\n\n5% pleasure\n\n50% pain", "label": 0}
{"text": "Are you sure you’re not a 7th grade girl Larping as a 26 year old man?🤔", "label": 0}
{"text": "People don't like noobs. It seems to be an universal thing.", "label": 0}
{"text": "What is the amount that a person, adult or child, with developmental disabilities cost per year?", "label": 0}
{"text": "i mean as a guy, I have heard other men blurt out things like this. we could be playing a game and someone is just like \" I WaNT SoME fAT tIITieS ON My GIRlz\"\n\nI can't go 5 mins online without someone talking about their preferences. You'd think it was from boys but holy shit.\n\n   \nthere are plenty of grown ass men just saying shit without discussion. it is rarer in real life but ive had moments with other guys. its weird.", "label": 0}
{"text": "So fucking disgusting", "label": 0}
{"text": "What", "label": 0}
{"text": "You brought up the 12 weeks thing. So I was curious if you gave a shit about the 12 weeks.", "label": 0}
{"text": "Sry", "label": 0}
{"text": "What actually amazes me is how much better writing without a computer is how big of a pain in the ass writing on computer actually is. Yes, computers are much better than typewriters. But all the mess of writing happened before typing it up. And you would flay your mind over entire rooms to organize and reorganize your ideas.", "label": 0}
{"text": "Chop off their pen/s", "label": 0}
{"text": "Yeah and what about that Washington Monument", "label": 0}
{"text": "/s ?", "label": 0}
{"text": "If I talked about gay men would you include yourself?\n\nYoure banned yet go there daily. You cherry pick posts on purpose. The 1st rule literally says no incel content and that its not an incel sub. This sub is more of an incel sub than short guys is", "label": 0}
{"text": "One thing that certainly costs money is raising children so what’s your point?", "label": 0}
{"text": "Why are you sorry? I was talking about the post", "label": 0}
{"text": "> men care about what blue haired feminists think too much?\n\nYes. Stop conflating a certain type of women with women in general.", "label": 0}
{"text": "True lol", "label": 0}
{"text": "I respectfully disagree with part of what you're saying, but I feel like your general idea is overall sound.\n\nI personally encourage everyone to have standards that fit what they want, and to only date people that meet them, even if that means being single for longer. I don't know if men are really encouraged to lower standards that much, but I'll take your word for it, there's a plethora of bad advice out there so it's not that much of a stretch that that's just a bit of bad advice I missed out on. \n\nI disagree with the statement that voicing those preferences helps to correct \"bad\" behavior, because what behavior is bad is subjective. Your \"badly behaved\" woman might be my ideal partner for all you know. By encouraging all women to fit into the box of you're preferences, your forgetting about everyone who prefers things in other ways, and trying to encourage people to hide who they are and how they really want to behave.\n\nAll standards are subjective and based on personal preferences and taste. It's not someone's job to fit yours, it's your job to find or wait for someone who fits them. If someone asks why you're not into them, go ahead, but if no one is asking for your opinion on how they should be, just shut the fuck up and live your own life. Trying to correct people's behavior so they are more likely to fit your standards is shitty. You want to be yourself in a relationship? Your partner deserves the same consideration. Stop trying to fix people's behaviors and find other people who think and feel like you do. Find your community.", "label": 0}
{"text": "If a woman had sex because she wanted to and got pregnant, it is her responsibility. In extreme cases of rape or serious illness, which are the minority, society may end up paying for the abortion. If a woman gave her pussy and got pregnant, all the responsibility for the bills to take care of the child is the woman's, or in this case, if she wants to have an abortion, it is hers. There is no reason for the taxpayer to pay for abortion out of women irresponsibility. Modern women, especially white feminist women, are addicted to abortion. They abort as if it were nothing. If they want to have an abortion as a sport, they should pay for it.\n\nsee that at no time do I want abortion to be banned, just that everything is clear to the taxpayer, I don't want to pay for white women's vagrancy.", "label": 0}
{"text": ">.>", "label": 0}
{"text": "what are you doing hanging around subreddits like shortguys. im a short guy and even i cant take the pity party over there", "label": 0}
{"text": "from time to time it's normal but for it to be the go to whenever they're having sex that's fucked up.\n\ni would much rather us introduce roleplay into the mix instead of fantasizing about other people.", "label": 0}
{"text": "Downloaded the video rn to see what it is about and that's not good . Extremely bad comment ", "label": 0}
{"text": "Yep because mine are rather low for women, just don’t have a dealbreaker\n\nLike don’t be mean and crazy\nDon’t be obese etc", "label": 0}
{"text": "It honestly depends on the man's age. If he's still young- Then I don't understand why young women would be giving him shit for it. I know they still do it, but that doesn't make it right.\n\nI'm in my 40s, and a 40+ year old man being a virgin is a huge red flag for me. \n\n A few years ago, I actually could sense one guy I worked with (my age) most likely was a virgin. I mean, I didn't know for sure and I'm not about to ask. But..he was extremely weird, awkward, didn't know how to interact with us women, unkempt, ect.", "label": 0}
{"text": "> The N count thing is mostly gross.\n> What should be said: “Im saving myself for marriage” OR “I dont sleep around and I prefer having a woman that has a similar life style.”\n\n> What is actually said: FUCKING ROASTIE! No one wants damaged goods! No one wants a used car! I only want Ch*d’s leftovers!", "label": 0}
{"text": "(https://news.feinberg.northwestern.edu/2003/06/01/sexuality/)[Three decades of research on men’s sexual arousal show patterns that clearly track sexual orientation—gay men overwhelmingly become sexually aroused by images of men and heterosexual men by images of women. In other words, men’s sexual arousal patterns seem obvious. In contrast to men, both heterosexual and lesbian women tend to become sexually aroused by both male and female erotica, and, thus, have a bisexual arousal pattern]", "label": 0}
{"text": "God you guys are so dramatic.", "label": 0}
{"text": "https://preview.redd.it/0q6e02ue1zwd1.jpeg?width=320&format=pjpg&auto=webp&s=155bbd45b9705449cfb203c8ab095785dbf197fa\n\nMinutes before posting", "label": 0}
{"text": "feminists 🤝 blackpillers \nagreeing the new moderation rules are retarded ", "label": 0}
{"text": "It’s a radical feminist pill position, kind of about male nature. Some of them are also FDSy (but some aren’t which is confusing)", "label": 0}
{"text": "It’s Friday so I’ll probably end up staying up on here like the sore loser I am😁", "label": 0}
{"text": "I’m not saying the stats are good I’m just pointing out the racism inherent to what you’re saying so that you could approach this topic with more nuance and acknowledge the intersectional factors that may be influencing these outcomes.", "label": 0}
{"text": "Since it’s allegedly so common on those sites and the mods don’t get pissy when you post links from there, give me an example.\n\nI bet you the only women who don’t get a lot of backlash hardly gets any comments on her post.", "label": 0}
{"text": "none of these words are in the bible", "label": 0}
{"text": "Women always change the original topic so they can say \"look here, I'm right\".", "label": 0}
{"text": ">So all I need to do is have a very happy disposition towards them and then I should be able to get a girlfriend.\n\nThat’s what I thought", "label": 0}
{"text": "AWALT", "label": 0}
{"text": "We literally do not care. No one believes you are more right by not being given a platform to be insane. If you choose to radicalize because of that, other people will deal with you elsewhere as they need to because you are not doing it here.", "label": 0}
{"text": "[Three decades of research on men’s sexual arousal show patterns that clearly track sexual orientation—gay men overwhelmingly become sexually aroused by images of men and heterosexual men by images of women. In other words, men’s sexual arousal patterns seem obvious. In contrast to men, both heterosexual and lesbian women tend to become sexually aroused by both male and female erotica, and, thus, have a bisexual arousal pattern](https://news.feinberg.northwestern.edu/2003/06/01/sexuality/)", "label": 0}
{"text": "> Couldn’t someone tell you the same thing though\n\nWhen have I acted like a victim? Even when I’m constantly called a man hater, I just asked for evidence.", "label": 0}
{"text": "You specifically told men to not care about the notch count unless it was \"high\" which you based on reported averages. No one was saying Roastie in that chat.", "label": 0}
{"text": "She wouldn't cause she's a woman, therefore lacks accountability.", "label": 0}
{"text": "My theory is he dislikes them because women also dislike them and hence he always wants to show them in bad light . You won't see him shitting on bad boys though ", "label": 0}
{"text": "I won’t go that far. I’m actually here to figure out her “logic”.", "label": 0}
{"text": "No. If a woman told me she did that Id leave her. That 1st comment is brutal", "label": 0}
{"text": "Cute woman nice", "label": 0}
{"text": "It seems like the common theme of today besides being 100% bald and a virgin is a recipe for disaster is that a lot of women are secretly sexually attracted to women. Even some of the women who are here claiming to not be.", "label": 0}
{"text": "Says the women who clearly is denying all scientific research about the topic. You are a science denier.", "label": 0}
{"text": "i watch a lot of straight porn. sometimes threesome mmf porn. doesn't make me bi and i would rather die than be with a woman even if it's mmf or whatever.\n\nfantasies are just that. fantasies.", "label": 0}
{"text": "Hitting the game pipe.", "label": 0}
{"text": "Don't throw rocks if you're in a glasshouse darling.", "label": 0}
{"text": "i dont care enough about this place for it to matter to me", "label": 0}
{"text": "I live in a small Northern New England city and I don’t know a ton of younger single moms either, of course I’m 45 so I don’t know a whole lot of younger women very well in general.\n\nI got close to one much younger woman last summer, she was my neighbor, and she had been a single mom before she met her boyfriend and she had 2 more kids with him before the age of 25.  She’s doing pretty well considering she was born to a 15 year old drug addict.", "label": 0}
{"text": "I don't think it's that bad.", "label": 0}
{"text": "Agreed, I’ve lurked there before and it’s boring because it’s the same post recycled to the nth degree.", "label": 0}
{"text": "Wait if you think crypto harms the environment and still shouldn't be banned does that mean you also don't think societal harm matters also?\n\nOr is your point that laws are made a group and therefore the only thing that matters is the will of said group and nothing else?", "label": 0}
{"text": "One time months ago I approached this chick at the bar who was kind of cute. Like a 6.8/10, but she entered my vicinity so I took that as a slight IOI and decided to try to talk to her hoping for a relatively easy lay. But as soon as I spoke to her she was all like \"My boyfriend's right over there!\"\n\n\n\nLike alright, trick. You could've just said \"I have a boyfriend\" but you had to emphasize that he's within my vicinity with the implication that you could try to get him to whoop my ass. As if that's supposed to intimidate me. I looked over at the dude a few yards away and he was just awkwardly standing there, tall and scrawny. Clearly this trick must not know that I've dealt with dudes way more intimidating than this fellow, when I was younger.\n\n\nAnyway, I walked up to him and dapped him up and then continued about my business. No man or woman intimidates GreatSmashPlayer.", "label": 0}
{"text": "You should go that far unless you want to waste a year for figuring her \"logic\" out.", "label": 0}
{"text": ">If I talked about gay men would you include yourself?\n\nif it applied to me yes. if not then no. hell i shit on gay dudes if it's valid.\n\n>The 1st rule literally says no incel content and that its not an incel sub.\n\nthey just say that to not get banned by reddit and you and i know this.\n\nread any posts there and tell me it doesn't have incel energy, hell they're literally involentary celibate.", "label": 0}
{"text": "I would love to see current photos of the guys here who say this stuff and line them up to assess their looks. I've been told on here for *literally years* now that I don't deserve a decent guy my own age (40s) because I'm \"old\" and I probably \"look terrible\". Yet they never say this to middle aged men who are seeking a partner. \n\nIn real life, men never say this to me. I am told often that I'm attractive and that I don't look like I'm in my forties. It's mostly younger men pursuing me. \n\nLet's be real- This is Reddit. Most of the single men on here are autistic as f*** and probably unfortunate looking as well.", "label": 0}
{"text": "It’s basically this.\n\nhttps://imgur.com/consideration-AYXYXp2", "label": 0}
{"text": "> We don't need to solve the problem if we can ignore it and let it fester without any gauge on it until it becomes completely out of control\n\nOk, enjoy your power trip while it lasts", "label": 0}
{"text": "What are the new rules in question", "label": 0}
{"text": "Women don't have hobbies to begin with. All they do is Netflix and being on Instagram.", "label": 0}
{"text": "It’s not our problem.", "label": 0}
{"text": "That one aunt...ugh", "label": 0}
{"text": "That song goes hard", "label": 0}
{"text": "Then we need to get a beer 🍺 together sometime lol", "label": 0}
{"text": "It obviously is or you wouldn't be so obsessed.", "label": 0}
{"text": "Maybe join forces on the female relationship dynamics in real\nLife lol 😂", "label": 0}
{"text": "Umm, you sound like a full blown misogynist when you question if giving women full agency is a good thing.   Is it a good thing to give poor people full agency? Is it a good thing to give gay people full agency? Is it a good thing to give black full agency?  If you believe all adult humans are equal, then definitionally, all humans, including women, deserve full agency. \n\nAll the rest of your statement has to do with individual choices that a person with full agency is allowed to make.  Mistakes and all.  Just like men have full agency in abandoning their children to become delinquents.", "label": 0}
{"text": "Gloom’s porn posts are so hilarious", "label": 0}
{"text": "Is it still a red flag if you met a guy your age that is a virgin, but he *wasn't* extremely weird, awkward, or unkempt? Maybe he is shy around the ladies though.\n\nI guess I'd have to ask you why it is a red flag for you. The average man does not have as many relationship opportunities as the average woman does, it's entirely possible for a man to get preoccupied with life and not ever bump into that opportunity. Especially if the man isn't interested in something casual with someone he's not attracted to.", "label": 0}
{"text": "Tbf, there's only so much you can talk about when it comes to being a short guy. A topic like that doesn't really have much variety in discussion.", "label": 0}
{"text": "It was detailed for the people who matter, incels and black pillers can get bent. Any further questions about the rules can be taken to modmail.", "label": 0}
{"text": "https://np.reddit.com/r/PurplePillDebate/s/ythPRFjOCo I simply wanted you to show proof of AWALT being a common sentiment in this subreddit. Especially since you’re someone who likes to ask for evidence so clearly you’re a person who likes proof of any statement made. Cool. I’m the same way. I’m relatively new here and haven’t seen that sentiment often. And yet you acted like you were a victim of trolling.", "label": 0}
{"text": "https://youtu.be/qbJOLq5wXwk?si=9l7MRR9IlU23rEhG", "label": 0}
{"text": "I mean, as much as the women in this sub like to act like \"blue haired feminists\" AKA radical feminists are some small niche group of women, they really aren't. They are actually a pretty significant number of women that is only growing larger.", "label": 0}
{"text": "It's your heart and personality 🥰", "label": 0}
{"text": "\\>Cold approach sucks.\n\nI agree, I'm 37 and have been both cold and approaching for about 20 years now, I can say from my firsthand experience that while I've never gotten a date either way (well I did get a 'friend-date' thing once about 11 years ago from warm approaching) I can say that people were far less receptive to cold approaching than to warm approaching", "label": 0}
{"text": "> No one was saying Roastie in that chat. \n\n So your only reference was THAT CHAT?", "label": 0}
{"text": "Negative material/worldly consequences is not a release from moral obligations, and honestly to other humans is a moral obligation.", "label": 0}
{"text": ">they just say that to not get banned by reddit and you and i know this.\n\nThe sub is literally being watched daily by incel tears members. If it was truly and incel sub it would be banned. The mods delete comments from people who talk like that unlike here\n\n>read any posts there and tell me it doesn't have incel energy, hell they're literally involentary celibate.\n\nYou hate that sub but love this one which is 100 times worse. Make it make sense. Like I said you just hate short men. You talk about height more than short men do on this sub. I dont even bring it up anymore but it seems to be one of your favorite topics", "label": 0}
{"text": "high five ! 🖐️", "label": 0}
{"text": "That's true for some women for sure.\n\nbut the same could be said about men who just want constant sex and can't get it anywhere else so they mask it with love and relationship when it's just about sex.\n\nboth marriages for money or sex only don't have the longest life spans.\n\nbut not all men or women are like that and the goal is to find someone to love you and you love them.\n\nbut both genders could be used just for different things.", "label": 0}
{"text": "Yea that makes sense. I dont think most dislike us they just arent attracted. I do think gen-z women spefically are the ones who dislike us though", "label": 0}
{"text": "Didn't play much Smash 64, I grew up on Melee. SSBU is my favorite now. But yeah Kirby sucks in every game after 64 (though I do like playing him)", "label": 0}
{"text": "> radical feminists are some small niche group of women, they really aren't\n\nWhy do you only know blue haired feminist? I hang out with liberals and even most of them hate blue haired feminist.", "label": 0}
{"text": ">I had a lower bar for “tidy” \n\nThis too, was a fact I accepted early on about my partner. That I would have to accept ‘tidy’. As opposed to ‘organised.’ I’m a very much an ‘everything has a home’ guy. Makes life simple, and more importantly easy. If however things are ‘put away’, that for my partner is sufficient. For example if all the kids toys are ‘put away’ each day, that’s sufficient. Doesn’t matter if all the Lego, is mixed in with the matchbox cars. It used to be frustrating, but I simply just took responsibility over it. Makes it easier for her, whilst it’s no big deal for me.", "label": 0}
{"text": "Partly true.\n\n\nBut, there are plenty of men, who have perfectly normal dating approaches and still get rejected over minor defects in their methodology. Like for an example. Tom approaches a girl he likes in a bar. He is confident, maybe isnt as muscular as the other men and is soft spoken, meek guy. The girl still gives him a chance. He has a stable job, but,  let's just say the women start to sober up a little, and notices that he a little nervous and starts to notice another man who is more muscular,taller,and has tattoos, he exudes intensity. Tom is DONE,finish, over... The girl dismisses him and goes for that guy..\n\n\nYou see, Tom wasnt being creepy. Nervous, yeah, perfectly normal as Tom isnt a psychopath who has fear deficits. A long time ago, just by Tom being cordial,respectful,polite,and just normal, he would've gotten the girl\n\n\nYou see how dating has changed substantially, especially with radical feminism and the advent of dating apps and pornography?", "label": 0}
{"text": "do i have to write a sociology dissertation to make some reddit comment explaining who has all the out of wedlock children and how because of my OWN intersectional identity i have no knowing contact with people like that in any meaningful way", "label": 0}
{"text": "This is pretty ironic because I got a reddit temp ban for listing my preferences a few days ago, I appealed it and they reversed it of course but the fact that I got a reddit ban is crazy", "label": 0}
{"text": "Not suprising at all lol", "label": 0}
{"text": "But they're not though...Not really. Education doesn't mean that the person has good morals. Their job doesn't give me inkling as to whether they argue with a sense partnership or a sense of antagonism. \n\nNow that I think about it, I believe that because when go for these things and place a priority they tend go glaze over things that would lead them to ending up with abusive partner.", "label": 0}
{"text": "i've been saying this for ages but the thing is virgin men make it their whole personality and can't go one second without disclosing it.\n\n\"oh but i can't start a relationship with a lie\"\n\nDON'T TELL THAT'S NOT LYING.\n\nThe point of a virginity is to be lost but most of these men want to be accepted FOR their virginity. it doesn't work that way.", "label": 0}
{"text": ">Maybe he is shy around the ladies though.\n\nYes, mostly because i can't stand shy or passive men. I am shy and passive myself, so I cannot see that working out. Anyway, I'm not about to teach any man how to f*ck me. \n\n I like the dominant loud mouth types. Lol sorry, but it's my preference.", "label": 0}
{"text": "You’ll just have to monkey branch", "label": 0}
{"text": "I was literally called creepy in front of everyone in class for accidentally making eye contact with some girl back in high school. I was just minding my own business.", "label": 0}
{"text": "He gets joy out of the despair of others", "label": 0}
{"text": "Bro an elderly man will still need help and assistance", "label": 0}
{"text": "Sounds like you grew up with a single mother and projecting the control she has over you on other women", "label": 0}
{"text": "Did I say NEVER? No!\n\nBut in general men are polygynous and women are not.", "label": 0}
{"text": "I am 37 and can say from personal experience it was never hot", "label": 0}
{"text": "People should really stop attributing wanting a sexually willing partner or an unusual sexuality to \"porn brain\" or whatever - just because you can't imagine doing something for someone doesn't mean no one else can or it's some misfortune that they end up doing so", "label": 0}
{"text": "People are a science. If they weren’t psychology wouldn’t exist. Basic communication skills with a lack of knowledge on how to communicate isn’t gonna do anything for anybody. \n\nI used to be a person that was liked by few and ignored by many. I learned communication skills from a youtuber and he also taught me why they were important. Next year I had more friends than I ever had in my life. I was already good at talking, but lacked knowledge on how to maintain eye contact, proper posture, gesturing, and why these things were so important, not only to women, but men too. \n\nIf you’re gonna date someone, you need to understand them. If you’re going to marry someone, you’re gonna need to know how they operate. It’s common sense. Some men get it early, others it takes well into their forties/fifties to figure it out. Everybody should go out and talk to people and get to know them, but they need to do it the right way. Work smarter, not harder. \n\nOnce you understand how the opposite gender works. You’ll have more success with them.", "label": 0}
{"text": "Constant sex sucks with the exact same person without love being in the equation.", "label": 0}
{"text": "People marrying for love is relatively new. In the past you would get married because it was expected of you, for you to have kids, and to fulfill some function of passing on inheritance. Pragmatism came first, with the assumption that you could grow to love your partner. For both men and women. \n\nIn Westernized countries, there is even more emphasis on marrying for love than ever before. I do not understand how you all don't see this. Women are requiring that men be lovable and are opting out of dating otherwise.", "label": 0}
{"text": "With issues where societal benefit or harm intersect with critical personal freedoms, I prefer incentives and structural changes to things like bans. I think it’s best to look at what we can do to prevent the need for choices we’d rather people not make, and ways to leverage those choices to counterbalance harm. \n\nI would support higher taxes on crypto earnings, for example, while I would not support a ban. \n\nLikewise I support free birth control, comprehensive sex education,  and a robust social safety net, all of which reduce the need for abortion in the first place.", "label": 0}
{"text": "I think some aspects of blackpill should be allowed (because funny), and we should be able to discuss looks in regard to attraction. Seems stupid that we can’t bring up female oppression either. ", "label": 0}
{"text": "Really? I would have assumed it would have been much higher than 60% given this is reddit", "label": 0}
{"text": "yessss", "label": 0}
{"text": "Yes they are.", "label": 0}
{"text": "Why?", "label": 0}
{"text": "Be civil. This includes direct attacks against an individual, indirect attacks against an individual, or witch hunting.", "label": 0}
{"text": "Is this sub mostly incel men? Coz i love debating relationships but most posts by men here seem incelly. Women marry because of social pressure. They don't want to be spinsters blah blah. Men gatekeep relationships and marriage; women sex. If your theory was true, there wouldnt be so many poor men marrying all the time.", "label": 0}
{"text": "Are you on insta or tiktok or only reddit? Do you not gossip? Women love to gossip and they talk shit when they do so. Women talk shit on other women, famous people, not famous people, beautiful people, ugly people, the list goes on and on. I'll have to make a new insta account later.", "label": 0}
{"text": "the fact that I want a step brother and a washing machine doesn't make me pornsick OK", "label": 0}
{"text": "Oooooh a cute woman? Spill spill", "label": 0}
{"text": "**Attention!**\n\n* You can post off topic/jokes/puns as a comment to this Automoderator message.\n\n* For \"Debate\" and \"Question for X\" Threads: Parent comments that aren't from the target group will be removed, along with their child replies. \n\n* If you want to agree with OP instead of challenging their view or if the question is not targeted at you, post it as an answer to this comment.\n\n* OP you can choose your own flair [according to these guidelines.](https://www.reddit.com/r/PurplePillDebate/wiki/flair), just press Flair under your post!\n\nThanks for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": "Hi OP,\n\nYou've chosen to identify your thread as a Debate. As such you are expected to actively engage in your own thread with a mind open to being changed. [PPD has guidelines for what that involves.](https://www.reddit.com/r/PurplePillDebate/wiki/rules#wiki_cmv_posts)\n\n>*OPs author must genuinely hold the position and you must be open to having your view challenged.* \n\n>An unwillingness to debate in good faith may be inferred from one or several of the following:\n\n>* Ignoring the main point of a comment, especially to point out some minor inconsistency;\n\n>* Refusing to make concessions that an alternate view has merit;\n\n>* Focusing only on the weaker arguments;\n\n>* Only having discussions with users who agree with your position.\n\nFailure to keep to this higher standard (we only apply to Debate OPs) may result in deletion of the whole thread.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PurplePillDebate) if you have any questions or concerns.*", "label": 0}
{"text": ">1. Most men don't do these things.\n\nI never said they did, and clearly this particular exchange is about the *ones who do*\n\n>2. The few that do have more success than the ones that don't.\n\nNo, I don't think dick cold-calls are more successful than other ways of finding a partner.", "label": 0}
{"text": "Nah my guy is a 10/10. Monkey branching is cowardly and I’d be stupid to give up an incredible relationship.", "label": 0}
{"text": "Where's the mods automatic comment? Why does it only show when I post but not on others' posts", "label": 0}
{"text": "I completely agree. \n\nI also don’t think male virgin = incel. I think in practice incel is used to refer to men being radicalized into misogyny online through dating content.", "label": 0}
{"text": "Don't worry the person who you replied won't read/will forget this because it doesn't fit into their narrative.", "label": 0}
{"text": "🤢", "label": 0}
{"text": "> The biggest issue is that guys will blurred out their preference when no one asked.\n> \n> Nobody:\n> \n> Men: I hate single moms!\n> \n> Nobody:\n> \n> Men: Younger women are better!\n> \n> Nobody:\n> \n> Men: I like (insert race)!\n\nThat nobody is an old black single mom complaining on social media\n\n> What should be said: I prefer not to date a woman with kids.\n> \n> What is actually said: Stupid bitch that fucked a loser and wants other guys to raise their burden. In the animal kingdom, lions would kill cubs that arent theirs.\n> \n> What should be said: Im not heavy set myself, and Im not into heavy set girls.\n> \n> What is actually said: Fat bitches think theyre worth a damn just because Ch*d pumps and dumps them!\n> \n> What should be said: I prefer youthful women.\n> \n> What is actually said: Old women have less value and young women are at their peak SMV. Young women are far more fertile.\n\n\"What is actually said\" are all facts. But feel free to call them out for being \"hurtful\". However even when it's said nicely it's still called out.", "label": 0}
{"text": "We don’t have to divine it. We can just read what you write lol.", "label": 0}
{"text": "I don’t know, I think it’s kind of hard to tell someone to not do that when they’re alone. I just think that’s not really worth worrying about because you can’t mind control someone. \n\nDuring sex—maybe I’d argue it’s good to be present in the moment.", "label": 0}
{"text": "Ah, so it’s ok for you to be shy and passive, but us men have to be performing chimps who constantly dance for your amusement? Women like you make it easy to hate women.", "label": 0}
{"text": "Q4W: Why do you all lie so much? When’s the last time you actually told the truth?", "label": 0}
{"text": "Abortion is murder. Murderers should spend the rest of their lives in prison. End of story.", "label": 0}
{"text": "Why would you not want to make sure the person you are dating has the same overall life and dating goals that you do? Why waste time dating someone and getting attached if you are just going to have to break up in the end? The sooner you find the reason to end it the easier ending it is.\n\nMost marriages are between 2 people who both work and it is financially beneficial to both parties. It's hard as hell to afford more than just your bills when you are living on your own these days. Married people split bills and afford more. They not only have more assets but they also have more assets that earn money like home equity. When a marriage splits up both parties walk away with assets. Married people also tend to earn more which is a benefit. \n\nIf you are concerned about supposedly losing money in the case of a divorce marry someone who earns somewhere in the general ballpark of what you do. Alimony is only paid out in 10 percent of divorces and almost exclusively where one spouse doesn't work at all or works significantly less. Just don't marry someone who doesn't work. Considering that is less and less common every year it shouldn't be all that hard. \n\nI just don't understand why more men don't give a fuck about the finances of people they date or marry. Marriage requires more than just love, love doesn't pay the bills, love doesn't get you through hart times, love doesn't feed the kids.", "label": 0}
{"text": "Good for you! Hope it all works out!", "label": 0}
{"text": "And men good", "label": 0}
{"text": "I wouldn’t even go that far. I’d say “good woman” is your typical working mom who handles house and home, children, relationships maintenance, mental load and all of the other stereotypically “feminine” things and the “”bad man” goes to work, comes home and does fuck all until bed. You don’t have to be abusive to be dismissive of your wife. You don’t have to be abusive to be a selfish asshole. You don’t have to be the epitome of the perfect wife to be worthy of having your needs met.", "label": 0}
{"text": "I haven't read the new rules but I am guessing more bans for me ", "label": 0}
{"text": "Yet the loneliness crisis for young men is on the rise and it’s not just a lack of relationships with women, it’s a lack of friendships", "label": 0}
{"text": "I wonder if it is possible to learn this power ", "label": 0}
{"text": "completely agree 💯", "label": 0}
{"text": "![gif](giphy|kDAwE7A0KqHhQylxd6|downsized)", "label": 0}
{"text": "My friend, she is allowed to have her opinions on your standards. She isn’t forcing you to have those standards.", "label": 0}
{"text": "its not abandonment.. how can you abandon something you don’t have.. \nto abandon a kid I should accept the kid in the first place", "label": 0}
{"text": "If having many past partners really destroys your ability to pair bond then so does social withdrawal\n\nIf the issue is that swinging from person to person makes your brain used to consistent change then isolation makes you used to no person and consistent loneliness\n\nhttps://preview.redd.it/id74sn8p8zwd1.jpeg?width=720&format=pjpg&auto=webp&s=ea81d32296f13da7de59c69d0c5917817681966f", "label": 0}
{"text": "\"The internet allows us to be assholes, so it's okay to be an asshole\"\n\nThis is such a weird take. Anonymity doesn't make it not creepy as hell to break out your abacus to calculate a woman's remaining egg count.", "label": 0}
{"text": "Constantly striking out wishing you had a companion and not being able to find one does mean you need to work on yourself though..", "label": 0}
{"text": "Being the smartest and dumbest out of all my lineage is a heavy feat none the less", "label": 0}
{"text": "I recently just got out of a LTR, so I haven’t been in the dating scene for a while and plan on staying away from it. However, I think that while dating, marriage is something important to discuss. Hookup culture has influenced the ways in which people commit to dates/relationships and I think that it is necessary to make sure both parties are on the same page. When I was dating, that was something that I brought up fairly soon because I was worried about putting energy into a relationship that was just headed toward a dead end.\n\nAlso, historically marriage has been an economic prospect for a woman, as it was essential to survival. These days, I would argue that being a stay at home father is more common than it used to be and that women are becoming (statistically) much more financially independent. That is not to say that women looking for a wealthy man don’t exist! I just find it strange to generalize an entire gender like that.", "label": 0}
{"text": "Oh, I was trying to come up with an extreme example so I could maybe get an honest opinion from them.  That said, I described my marriage to my ex.  I was literally all of those things and he was what I said he is.  We get along fine now and coparent like champions, but the marriage was hell.  It’s funny, because I don’t do nearly as much as I did around the house because I’m not a SAHM anymore.  My SO still tells me how amazing I am every day.  I did so much more for my ex, but my SO doesn’t want that kind of a relationship.  He (and I) prefer equality where we both work and we both clean, cook, care for the kids, etc.  it makes me respect and love him so much more.", "label": 0}
{"text": "Men don't have to do anything for me. It's a personality trait that I like. Just a prefernce. I'm sure you like quiet women who are introverted and shy. I happen to be that woman,    and I despise wimpy passive men like yourself. But- I'll never say that to your face in real life. \n\n Most men cannot fake or amuse a trait like this for very long, and even if they could the mask would soon come off.", "label": 0}
{"text": "How involved were you in parenting? Why don’t you appeal the courts?", "label": 0}
{"text": "Be civil. This includes direct attacks against an individual, indirect attacks against an individual, or witch hunting.", "label": 0}
{"text": "Both. But I won't ever say anything aloud about it.", "label": 0}
{"text": "Lol none of the above.", "label": 0}
{"text": "When I was religious I was very much into the church (Presbyterian) and hung out at the seminary a lot because I had older male friends who were working towards getting their masters of divinity. \n\nAnyway, the Mormons built a temple next to the seminary there, and unlike their churches the temples are members only. Before the site was complete they invited us for a rare look inside, and we got to see the room where they would preform death rights, and even as an atheist now, that room gives me the creeps.", "label": 0}
{"text": "It means don't sleep with a ton of different men.", "label": 0}
{"text": "Yea I agree", "label": 0}
{"text": "Can't whistle is a lie?", "label": 0}
{"text": "All of the examples you list would point to something being wrong. Dress it up however you want, but 99% of people deal with the virginity thing in their teens, and if you’re still carrying the v card into adulthood, then I’m afraid that there definitely *is* something amiss", "label": 0}
{"text": "That could just as easily be indicative of unreasonable preferences as it is of women being on the decline, so your statement doesn't really prove anything", "label": 0}
{"text": "just found out the coalition/group that filed a recall against the incumbent county commissioner (in my district) for allegedly trying to hide information about local water contamination (who just so happens to support his competitor in the election) broke state campaign finance law about funding their recall via donations that far exceed the limit. additionally, one of the organizations that donated to this group, an employee of theirs is the treasurer of this particular coalition. in addition to this, their recall was thrown out of court last month. \n\nweird how corruption like this can happen even at the regional level. i expect this kind of thing to happen with state and federal elections.", "label": 0}
{"text": "The proposed new sub rules are really \"mask off\" about what the moderation team believes.\n\nSaying that dating struggles might be based on some genetic or un-changeable trait is generally banned, unless that trait is being on the spectrum, then it's totally fine.\n\nThis isn't a debate sub, it's a hate sub aimed at telling people with certain neurodivergent traits that they should die alone.", "label": 0}
{"text": "What personal age range would you be ok with?", "label": 0}
{"text": "Especially formal wear. I've never been so jealous of women as when I was at an outdoor wedding in Florida. I felt like a sweaty lasagna.", "label": 0}
{"text": "I brought it up because the op was discussing consciousness/sentinenence", "label": 0}
{"text": "50/50 is usually just means paying for stuff you actually ordered or perhaps splitting down the middle of there were shared dishes.", "label": 0}
{"text": "All do respect, but at your age, you’re invisible to me as well as most other men so I don’t give a fuck what you think because for all intents and purposes you don’t exist", "label": 0}
{"text": "This is a subreddit were people discuss dating and then you are surprised when people do just that. \n\ne.g\n\n>What is actually said: I want a (insert race) girl because they’re (insert stereotypes) and better than (insert other races) because those women are (insert negative stereotypes).  \n  \nWhat should be said: I find (insert race) very attractive.\n\nTwo completely different points, but still the \"creepy asshole\" example is doing what you must in because you **have** to generalize in some manner to drive down points and stereotypes do just that. While stereotypes may not apply to a singular person those stereotypes still exist for a reason due to the group's general trends.", "label": 0}
{"text": "As a 27 year old virgin that fits the criteria from 1-5 you listed, there is absolutely something wrong with me.", "label": 0}
{"text": "You are not left-handed (and you developed an immunity to iocaine powder).", "label": 0}
{"text": "No Race-Baiting or Racially Charged Content", "label": 0}
{"text": "No Race-Baiting or Racially Charged Content", "label": 0}
{"text": "Well they aren’t any more are they. Birth rates are plummeting below replacement rate for a reason. Women are choosing better it seems.", "label": 0}
{"text": "She pretty well documents how exactly to not be creepy in stating preferences in this exact post so no clue what you're on about", "label": 0}
{"text": "not a lie when you believe it", "label": 0}
{"text": "everything but possibly 2 on that list is \"something wrong with a man\"", "label": 0}
{"text": ">That said, marriage and divorce typically favors women at men’s expense which is one of the reasons women file for divorce twice as often as men. \n\nWomen are poorer and have a lower quality of life after divorce than our male counterparts.\n\nIf divorce was so lucrative for women and so awful for men then divorced men probably wouldn't want to remarry at [twice the rate of divorced women](https://www.pewresearch.org/social-trends/2014/11/14/chapter-2-the-demographics-of-remarriage/)\n\n>Some 29% of eligible men say they want to remarry, and 36% are not sure, according to a recent Pew Research Center survey; only 30% say they do not want to marry again. In contrast, just 15% of previously married women want to remarry, and 27% are not sure; about half of these women (54%) report that they do not want to remarry.\n\nSo either men are stupid, or your premise is false", "label": 0}
{"text": "-women bad\n-women bad \n-women good", "label": 0}
{"text": "You need to be corrupt to be in politics, it's a natural law or something.", "label": 0}
{"text": "Well its supposed to be RP vs bluepill, not fat hoes vs male virgins", "label": 0}
{"text": "im sure the bots that create 80% of the topics and comments in the main sub care", "label": 0}
{"text": "Well as I said any legal age gap COULD be fine.", "label": 0}
{"text": "You have been fed incel nonsense fed to you by podcasters trying to making money off the bottom of the barrel men( red pill men that want women to need them instead of want them). Every one has a better chance in their 20s. Plenty of beautiful older women that got out of longterm relationships that meet great guys when they are 30s and 40s around their own age!! Just because she is older does not mean she has been with a lot of guys. Have you seen Gen Z’s morals.. lmao.. who do you think is doing OF?? Millenials?? Lmao. Women are attracted to men around their own age.. all research shows this. Younger men have better virility, strength, looks and sperm quality. Deterioration of sperm quality is a major issue in older men that result in a variety of genetic and mental disorders/ unhealthy offspring. This is well documented. Medical research and every fertility clinic will tell you this.", "label": 0}
{"text": "Do not provide contentless rhetoric.", "label": 0}
{"text": "Do not provide contentless rhetoric.", "label": 0}
{"text": "On average younger women are out earning men.\n\nThey dont need your imaginary money", "label": 0}
{"text": "That wasn’t the question though? No? Men are able to survive and or thrive depending on circumstance better than women in old age assuming the circumstances indicated above.", "label": 0}
{"text": "You're simply misrepresenting me and what I'm referring to and I'm sure you know it.. It's trendy af to disparage men as degenerate horndogs.\n\nStop the \"it might be a you problem\". That's immature grade school horseshit and you're only making yourself look like more of an ass.", "label": 0}
{"text": "you are correct. i’m a basic right-handed person", "label": 0}
{"text": "Doesn’t really matter the reason. Going to be judged all the same unless you’re exceptionally attractive. Too many other fish in the sea for most people to want to or even need to deal with that.", "label": 0}
{"text": "You can’t cry on command", "label": 0}
{"text": "“Currently or historically” means it could be in the past\n\nI agree it’s cheating if they haven’t discussed it’s okay, but IF it’s happening I’d feel better if he was paying her as it’s more respectful at least.", "label": 0}
{"text": "About a week ago aye", "label": 0}
{"text": "And she was simply stating her opinion.", "label": 0}
