{"text": "he's better than biden but no ty", "label": 1}
{"text": "Yep, just like all the ones before him", "label": 1}
{"text": "Keep up with call of duty, sport.", "label": 1}
{"text": "I don’t think he will be either. One day if this country does get healthcare, he’ll finally be remembered as a pioneer for the push. But I don’t think until then.", "label": 1}
{"text": "No, he couldn’t beat Hillary, so he definitely couldn’t beat Trump in 2016.", "label": 1}
{"text": "Nobody says he's Napoleon or Cesaer and has the staying power of centuries or millenia. Notable US politicians have their names recorded.\n\nBeing here, talking about him while he's still alive doesn't really help you.", "label": 1}
{"text": "G'damn election stealing democrats.....", "label": 1}
{"text": "Yea. Keep voting dems. Lol", "label": 1}
{"text": "Wow, mods deleted a bunch of replies to your comment that should not have been deleted. I wonder if they'll delete my comment, too! Sad to see from a subreddit I thought I respected.", "label": 1}
{"text": "Bernie is great and all but he would have been one of the least effective Presidents in our lifetime.  Nothing progressive he stands for would ever pass through the House or Senate.  This subs delusion is on par with conservative.", "label": 1}
{"text": "chill bro", "label": 1}
{"text": "Best we can do is hollow shell of a man and a DEI hire.", "label": 1}
{"text": "Yet his supporters voting for Trump in 2016 is a big reason Trump was president in 2016…", "label": 1}
{"text": "No shit, I saw the Dem's literally \"steal\" the election away from Bernie. I don't care about Trumps stupid shit or any other idiot spouting off bullshit cause I saw them steal that election away from Bernie...", "label": 1}
{"text": "A lot places that she won also excluded independents and/or had weird rules for registering to vote.  Like in NY,  you had to be registered as a Democrat months in advanced, before most people even had that in there mind. I had to register as Democrat in California to avoid the confusion of how to vote as an independent(take in mind most states don't have that option). Been randomly deregistered as Democrat and registered as a Green Party voter in California.  Had to re-register as Democrat again to vote.  I consider myself a left wing independent, but reluctantly am a registered Democrat because I would like to easily participate in the primaries. I still check my registration out of paranoia.", "label": 1}
{"text": "U", "label": 1}
{"text": "He wasn't because he has no spine and caved to the democrats. It's the liberals fault we didn't get Sanders, Sanders and \"the squad\" ultimately turning out to be a bunch of them. They didn't move anyone left, but were all, instead, moved to the right.\n\nNow they voted for US imperialism to blow up foreign countries and stop union-aithorized strikes while living conditions in this country continue to deteriorate.\n\nNo wonder so many have gravitated to far-right populists like Trump. It's the only radical leadership around. The left is non-existent in this country. They all cave and collaborate with the liberals at the end of the day.\n\nIf Sanders had half a spine like Trump does he'd have broken with the democrats when they sabotaged him at the primaries and asked all the unions in this country to endorse him in a new independent party, but he had neither the brains nor courage to do so.", "label": 1}
{"text": "I thought that until he shat on his legacy with his Zionism", "label": 1}
{"text": "Oh good, blatant racism.", "label": 1}
{"text": "Sure, but the margin was so small it’s hard not to point to the Bernie supporters who were so butthurt, they voted Trump and literally got the complete polar opposite of what Bernie stands for.", "label": 1}
{"text": "I don't disagree, but I don't know that I would call it a \"big\" reason. I would say it is one of many smaller reasons that added up to that disaster. \n\nHowever, I have nothing but contempt for anyone that would pretend they have anything in common with Bernie when they went and voted for Trump.", "label": 1}
{"text": "Teenage redditor gets introduced to politics; discovers to his horror that politicians criticize one another. More at 11.", "label": 1}
{"text": "Bingo.\n\nI can't help to wonder if this subreddit is supported by Trump/Russia itself, this shit plays right into keeping a democrat out of the white house. Sanders opposed to what many here like to believe stood no chance. Hillary got without a doubt cheated out of the white house by voters who didn't vote, voters who voted for Trump out of spite, voters who voted green, all the dumb shit you can have happened. Now you can blame everyone and everything for what happened, but if *you* didn't vote for Hillary, that's on you, not on Hillary.\n\nTo argue Biden, Hillary or Kamala are worse contenders for the White house than Sanders shows a complete disconnect of reality and again it just plays into what Trump needs, people not voting for what's right.", "label": 1}
{"text": "The Bernie-related subreddits were taken over years ago by pro-Russian bot farms. Some have been deleted, but most still haven't.\n\nThe purpose of this post is to push conspiracy theories about Bernie's \"stolen\" candidacy and dredge up anger at the DNC two days before an election", "label": 1}
{"text": "These people are mostly bots, same as with every other Bernie subreddit\n\nThe purpose of this post is to get people angry at the DNC two days before an election, using BS and conspiracy stuff. Half the Bernie subs have been banned for bot farming, but this one's sill going", "label": 1}
{"text": "you should be banned", "label": 1}
{"text": "What?? lol. Absolutely not. Bernie is great but some of you are like the trumpers are but with him. He’s a god to you. No man should be.", "label": 1}
{"text": "Americans talking about being on the right side of history really makes you think.", "label": 1}
{"text": "Harris/Walz is one of the most progressive natinal tickets in American history. That didn't come out of a vacuum. Sure, many things we would like to see probably won't happen, but progress is measured in decades, not months or even years. We will take what we can get.\n\nAnd thinking anyone considers Bernie to be a god is fucking crazy, and probably a bit of projection.", "label": 1}
{"text": "> Democratic presidential candidate Joe Biden committed Sunday to picking a woman for his vice president if he were to win the party's nomination.\n\nRace has nothing to do with it.", "label": 1}
{"text": "I'm not turning him into a god. I think he's a very honest politician that also happens to be incredibly savy about politics and the way to talk to ppl about issues. I'd love to have someone like him in my country.\n\nBut my liking him doesnt change the fact that he started a massive political movement. AoC would not be where she is without Bernie and she might become president some day.  \nThis guy will be talked about for a looong time. Not just in america. I swear to that many ppl in my country know him better than most of our politicians. This dude has become a worldwide celebrity", "label": 1}
{"text": "No offense, but there’s a reason there weren’t serious Bernie supporters. Like him or not, he just doesn’t care enough to think about policy. Even his supporters surely know he’s just a grifter.", "label": 1}
{"text": "So sad he backed down", "label": 1}
{"text": "lol. I figured I’d get downvoted for being reasonable. This sub is a cult. And no, I’m not projecting but nice try using psychology against me.", "label": 1}
{"text": "Must be a close election, here is the divisive anti Democratic party bullshit.", "label": 1}
{"text": "The man who hates himself loves our country?", "label": 1}
{"text": "Not Islam. In Islam there is a big difference in how you treat free Muslims versus slave Muslims and Christians, Jews and polytheists and non believers in general. Look up dhimmi and yahud and kafir wrt to Islam. \n\nBernie is not well read on the Quran and Sunnah apparently.", "label": 1}
{"text": "He kind of blew it with \"My good friend Joe Biden\" last time.", "label": 1}
{"text": "Absolutely not. We need geriatrics out. We need Bernie mentoring the next generation ticket: AOC and Pete", "label": 1}
{"text": "sadly idk man... Bernie dragged his feet like a mofo on this subject", "label": 1}
{"text": "I upvoted on the post title and downvoted once I read the post itself. ", "label": 1}
{"text": "Why?", "label": 1}
{"text": "Same.", "label": 1}
{"text": "Bernie and Joe did debate though...", "label": 1}
{"text": "Sanders has accomplished nothing but renaming a couple post offices in Vermont, why should Dems listen to a do nothing complainer ?", "label": 1}
{"text": "https://preview.redd.it/6xxaupinrfzd1.jpeg?width=1236&format=pjpg&auto=webp&s=fa43f45c4d9efa4a4949f94180d4553ce4ce4ef1\n\nLook at what all the appealing to moderates and ‘noble Republicans’ and the imaginary group of white suburban would-be Trump voters who would be swayed by Liz Cheney amounted to", "label": 1}
