{"text": "The only so-called politician who makes sense.", "label": 0}
{"text": "LOL on the old feed for ancient socialist, un-American Bernie.  ", "label": 0}
{"text": "Hello hiphopesq. We are sorry, but your submission is being removed because it is primarily about something other than the purpose of the subreddit, which is to elect progressive candidates and advance progressive policy.", "label": 0}
{"text": "Garland won't do anything.", "label": 0}
{"text": "Most likely it would not. As a union employee I would expect my local to circle back to the company and say “Hi there! Remember all those wages and benefits we’ve agreed to pass on so you can keep health care low or even keep it at all? We’d need to talk.” \n\nAnd then if mid contract we’d see raises, increased retirement plans and pension, increases to tuition reimbursement, increased job security … the whole lot. \n\nOne benefit of unions, even if you’re not a member or working for a union company is that non union companies have to meet or beat our wages. Your employer might not want a union, they might fight us. You might not want to joun a union. That’s fine. But your employer has to come close to our standards or … why would you work there?  \n\nThe other thing that happens with MCFA is we’d expect to see a boom in entrepreneurs. You have a dream of the next big thing. But you can’t leave your job because of health care; yours, your family, your employees. If we take health care off the table you are now able to create your product and jobs.", "label": 0}
{"text": "Go to represent me, please?  Albuquerque's a bit too far to walk.", "label": 0}
{"text": "HELL NO!", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "I love Sanders, but he said the exact same s*** when campaigning for Biden and Hillary Clinton. Needless to say, no \"convincing\" ever took place, and in fact these were some of the more warmongering presidents in recent memory. \n\nSad to see him selling out his reputation, and his previous supporters, like this.  I realize this is probably as good as it gets for him under the ridiculous current circumstances.", "label": 0}
{"text": "Can you convince me trump is better than Harris on Palestine? Genuine question. It’s alright if you can’t, and I’m not being sarcastic. Just trying to see what I’m missing here.", "label": 0}
{"text": "I don't think mnbvcxz123 is implying that Trump is better than Harris on Palestine.\n\n\nThey're just pointing out that Bernie is sacrificing his reputation to endorse a choice who will be terrible for Palestine, regardless of how she compares to Trump. \n\n\nAnd I agree that it's sad to see, it's just another example of how one player with zero moral standards can drag the whole game down towards his level. \n\n\nBecause at this point, what other choice does Bernie have? \nSit back and do nothing with a very real possibility of Trump winning? ", "label": 0}
{"text": "Existence is pain for leftists in electoral politics in the US. I think that it’s important to understand that the Oct 7 attack didn’t happen in a vacuum and is the product of Israel’s treatment of Palestinians, everything else I think Bernie is correct here. \n\nBut still, the Palestinian people and the world deserves better than a choice between and open fascist party and a feckless liberal party that won’t take the steps necessary to squash it.", "label": 0}
{"text": "He’s being practical. Would you have him be another Jill Stein instead?", "label": 0}
{"text": "I think you're getting a few things backwards here.\n\nHis core base became his core base because he said the things they wanted to hear.\n\nHe's not a god to be obeyed.  When he says things his core base hates, his core base gets smaller.", "label": 0}
{"text": "I trust Sanders. Trump will not be better. In ANY way.", "label": 0}
{"text": "That sounds pretty backwards.  I used the careful wording that his core base \"considers\" what he has to say.  To hear you say it, his power now involves no ability to change minds or reach anyone and he exists solely to preach what his core base wants said.  That actually sounds like it'd be Bernie's nightmare.", "label": 0}
{"text": "Sad truth. But I'm still voting Harris with enthusiasm. I felt like if Obama had lost either time, no big deal; not a huge difference between mainstream candidates of either party. But this time they're running an actual fascist on a quest for revenge. Fuck. That.", "label": 0}
{"text": "Accelerationism doesn’t work", "label": 0}
{"text": "I guess genocide isn't a problem for you.", "label": 0}
{"text": "Downvote me all you want, but no. As bad a trump is, Kamala is atrocious. I have yet to hear her answer a single question about policy without swerving the question and saying how trump is bad. The whole “threat to democracy” and “nazi rally” stuff is nothing but fear mongering because she doesn’t have legitimate policies that she can talk about instead. I can’t in any good conscious vote for her", "label": 0}
{"text": "People are being tricked and coerced into voting for an abhorrent leader they don't like because the other option is more abhorrent.\n\nI couldn't vote for either because that then makes me complicit with the murder of children and I can't have that weight on my soul.", "label": 0}
{"text": "Keep your head in the sand.", "label": 0}
{"text": "I mean, he is a threat to democracy. He literally tried to steal the election, and I’m not just talking about Jan. 6th.\n\nShe has talked about policy, taxing the wealthy, re-implementing roe v wade, etc.", "label": 0}
{"text": "That’s literally her only answer to any question. “Trump bad” how is this the candidate we’re stuck with. I’m not voting for the first time in a very long time", "label": 0}
{"text": "No big deal if Obama had lost? If McCain had been allowed to manage the financial crisis recovery it would have ruined us. We never would have gotten Dodd-Frank, and the ACA (even in its severely neutered state that didn't go far enough) would not have happened at all. We would have had a decade plus of forced austerity like the Tories did in the UK.\n\nWe need to stop whitewashing the failures of old school Republicans just because they're more respectable than Trump. Trump and McCain/Romney wanted the same shit as Trump, they just hide their intentions better than he does.", "label": 0}
{"text": "Dems literally just skipped an entire primary.  Is that also a threat to democracy?", "label": 0}
{"text": "I get how you feel and you're in NY but Jesus the dude tried to steal the presidency. He's got quite a lot of blame for October 7th by moving the embassy to Jerusalem and the Abraham accords. And he's already stacked the supreme Court to the point where they're giving him immunity for committing crimes in office and he'll have the chance to appoint at least one more justice if he gets elected. I've always voted Green besides Bernie in the primaries, but this is the first time in my lifetime where it's incredibly obvious that both sides are not the same", "label": 0}
{"text": "The children of Gaza applaud your lack of action", "label": 0}
{"text": "Actually there are many options. You mean there are only two that are likely to win. Genocide by the Dems means there is no lesser evil, don't kid yourself genocide against Arabs is ok for you. Clearly you are uninformed if you are unaware that Stein is running and the libertarian candidate is also against the genocide.\n\nI lived through Trump but I have family in Lebanon that didn't.", "label": 0}
{"text": "Voting for Kamila is voting for lack of action.", "label": 0}
{"text": "If you truly hate Kamala, consider that we could have had other options if Trump wasn't such an existential threat. Trump is the ONLY reason Kamala is the only way to go...so if you're mad at Kamala, Trump is the one that made her our only option.\n\n🤷🏽‍♂️", "label": 0}
{"text": "Stein is a no good rat as well. \n\nThe only time she crawls out of her hole is when it is time to play progressive in hopes of stealing few hundred votes here and there.", "label": 0}
{"text": "Im sorry. Did you want Clinton to run again?", "label": 0}
{"text": "Lolololololol.", "label": 0}
{"text": "Hey Bernie, you're a million years too late on this. You should have endorsed her when she replaced Biden and start making the case then. Not that votes are already cast, your effort is too little too late.", "label": 0}
{"text": "You're not wrong. The bulk of the slaughter has been in gaza though. ", "label": 0}
{"text": "Im sorry. Did you think he was living the dream?", "label": 0}
{"text": "It's not \"fear mongering\" to point out how similar Trump's rhetoric is to that of Hitler. \n\nIt's true that some of Kamala's policies are a bit vague, but what specific policies has Trump put forward? He still only has \"concepts of a plan\" for healthcare despite promising to reveal said plan 8 years ago. The closest he gets is touting tariffs as a solution to economic issues despite not understanding how tariffs work, and promising mass deportation though he won't say exactly how he plans to deport \"25 million\" (actually closer to 13 million) people.\n\nIn regards to Gaza specifically, Trump would have Israel bomb it to oblivion, which is the literal worst case scenario. While I think it's fair to say that Kamala has been a bit cagey on the subject, her approach can't possibly be worse than Trump's.", "label": 0}
{"text": "Still Gaza is part of Palestine, and target are Palestinians. There is a decades long concentrated effort of Israeli propaganda not to use words Palestine and Palestinians.", "label": 0}
{"text": "No, no they didn’t. She was on the ticket which won the primary. The electors that chose her were elected. This is the process that is in place for if the elected candidate can’t move forward to the general. Who were the electors supposed to choose, someone who was not on the ticket and didn’t get any democratic support? Don’t you think there would be lawsuits all over the place if it had been a nefarious process? (Especially with such a conservative Supreme Court.)", "label": 0}
{"text": "If I had to bet on who is going to make better policies on genocides my bet is with Harris. If Trump wins and he does what he says he’s going to do to the Palestinian protestors/ everything else just remember that you fought tooth and nail to get him elected.", "label": 0}
{"text": "Fair points, but they're not incompetent fascist narcissistic sociopaths who have no respect for democracy or rule of law. Trump is.", "label": 0}
{"text": "There are no single issue voters whose issue is the conflict in Gaza. Well, I should say there aren't very many. The few that are are just idiot children who have drank the Kool aid in an attempt to seem overly empathetic. The ones in here saying they are voting Stein or not voting because Harris and Trump are the same are fake accounts trying to stir the pot.\n\nThe cognitive dissonance required to claim to have empathy for the Palestinians while simultaneously not giving a shit about millions of others in this country is a level of compartmentalized ignorance that is impossible to achieve. They all say the same thing and don't reply when actually presented with rational arguments. The best everyone can do is scout the comments and downvote the fuck out of them to show everyone its not acceptable rhetoric.", "label": 0}
{"text": "Too little for what?\n\n\nIs a Harris victory hanging on wether or not she gets Bernie's endorsement? \n\n\nKind of ironic if that's the case. ", "label": 0}
{"text": "I really hope some day you come to a more nuanced understanding of politics, and the I/P issue in general. If you think all Trump will do is supply the same bombs to Israel that Harris will, you clearly aren't paying attention. You can criticize the Biden administration's lack of action, but what little action they have taken is certainly better than what Trump would do. They have forced pauses, they have and continue to exert influence to allow aid in, etc. What would Trump do? Well he moved the embassy to Jerusalem, one of the most inflammatory moves that a US president could make, a likely precursor to Oct 7th and the conflict that's followed. No doubt he'll have no issue with continued settlements in the West Bank. Anything you think Kamala would \\_allow\\_ Trump will expedite. And these differences truly matter. We're only talking about this in the context of the presidential election where you have one vote. And the power of that vote is limited, the best you can do with it is harm reduction. You have the entire rest of your life to participate in other actions to help this situation, fund-raising, awareness raising, any number of things. Holding out your vote just doesn't do what you think it does other than let you pat yourself on the back while women lose the right to choose and the people you claim to care about suffer even more. I've been in your shoes before, this is the first election I'm not voting Green, it doesn't feel great but for the first time in my lifetime the difference between the two candidates is so obviously stark", "label": 0}
{"text": "Ah yes and Trump winning is just what we need to fix our broken political system, how could I not have seen this before !?", "label": 0}
{"text": "Yes there are all over MN.", "label": 0}
{"text": "Yeah, they did.  In Florida (the third biggest state), they didn't even pretend: https://www.tampabay.com/news/florida-politics/2023/12/04/florida-democrat-party-primary-voters-biden-uygur-williamson-phillips/", "label": 0}
{"text": "If you have the same foreign policy position as Lindsay Graham then you're most likely on the wrong side of history. 👍", "label": 0}
{"text": "Broken clock. Do you support Russia?", "label": 0}
{"text": "Hip", "label": 0}
{"text": "If that is all you have to say as a response that let him win. Who gives a shit anymore.", "label": 0}
{"text": "I like Bernie, but this is not the way. The bloated economic system that has overrun university and college education is the source of this problem. Deal with that rather than the symptom.", "label": 0}
{"text": "100%\n\nWork to fix the system, don't just subsidize demand for predatory loan officers.", "label": 0}
{"text": "Bernie ♥️♥️", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "Bernie has made his position clear that Israel gets to do whatever they want. His words mean nothing here.", "label": 0}
{"text": "CO Republicans also officially opposed it. Which is kind of all you need to know to support it. I think it's a really dumb way to implement it though. Confusing, and still needs 2 rounds of voting, the first of which is still single choice and then top 4 get a ranked vote.", "label": 0}
{"text": "AZ too", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "Yes. States without them on the ballot are counting on you! That way I can point and sa \"See! Now why can't we have nice things to?!\"", "label": 0}
{"text": "Ooo those tricky bastards", "label": 0}
{"text": "That's how they get you to vote against your own interests... the ol bait n switch", "label": 0}
{"text": "It seems like there's a bit of a conflict within the party - Polis and Hickenlooper support it, but Bennet doesn't.", "label": 0}
{"text": "They will hold out because it’s righteous, but many will vote against Trump at the end of the day.", "label": 0}
{"text": "We need this everywhere!!", "label": 0}
{"text": "Are they actually finally voting on whether the correct version of voting will be used in those states?", "label": 0}
{"text": "They even got Elizabeth Warren to come out against it. The establishment Dems really don't want RCV.", "label": 0}
{"text": "I think the progressive is just a title they have given themselves at this point. With that link towing the establishment Dems party line.", "label": 0}
{"text": "Why is it so complicated ? \n\nExplain why people cant just vote for everyone they are for, and those votes tallied up.  That would always give you the person that the most people agreed one. No one can vote for a single candidate twice. But you can choose all candidates you agree with.", "label": 0}
{"text": "> make it illegal for illegals to vote\n\nwow that is incredibly disingenuous", "label": 0}
{"text": "Source? Quick googling seems like she's for it.", "label": 0}
{"text": "Quick googling : https://voterrightsco.org/senator-warren", "label": 0}
{"text": "As if it isn't already federally illegal and illegal at the state level.", "label": 0}
{"text": "History will treat this man well.", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "I blame the Democrats!  They are the reason why we are sweating a second Trump term!", "label": 0}
{"text": "the Best POTUS we never had.\n\nas people are commenting, history will show that Bernie was right about everything.\n\nIt's very rare that you can look at a politician and say that they were 100% for the people and all their actions and decisions were to make life better for the voters.", "label": 0}
{"text": "This MD would have obliterated Trump in 2016 and 2020", "label": 0}
{"text": "Yeah yeah yeah. We turned it Biden Blue, after the Democratic Party and center right Dem “candidates” worked together to screw Senator Sanders a second time.\n\nThey will do it to the next Bernie type candidate starts getting folks excited.\n\nWe are trapped in a “Third Way” Eisenhower Republican Dem party or crazy ass fascistic racist NeoCon Republican contest every presidential election.\n\nPresently, regular working folks are out in the cold with either of the two heads of the corporate/high finance, more war$$$ uni-party.\n\nLook how the Dems treat those standing for the people. That gets you a primary, not the party’s support.\n\nThe system is broken. Unless herding the poors is actually not a bug, but an aim of the system.  The Federalist Papers give one pause to think about this.\n\nI hope we have a viable world in 2028, climate change and all. I hope we survive without an atomic war pushed by Dem cabinet NeoCons.\n\nDo the work friend, pull people in, excite them by showing them how our candidates make their lives better, build community, enable the Movement to enliven & steer the Democratic Party. Our world needs your success.\n\nHad so much hope with you, Senator Sanders. We finally had someone and something to vote FOR. Here we are, voting against the greater evil, yet again.\n\nDo the work, friend. I wish you luck and success.", "label": 0}
{"text": "This man shows more compassion for the average person in a one-minute speech than most politicians do in a lifetime.  May he live to be 100, devoting himself to working people the whole time.  We need a dozen more just like him.", "label": 0}
{"text": "I was heartbroken when he didn't get to run in an election that could have killed the Trump bs. Plus we'd have had Bernie.", "label": 0}
{"text": "And I give them another $1m tax cut", "label": 0}
{"text": "In an alternate universe he was and they are crushing it!", "label": 0}
{"text": "Thank you Bernie!", "label": 0}
{"text": "That's the nutso thing.\n\nWe could still have it all.\n\nWe just have to force it.", "label": 0}
{"text": "He's right. Even he doesn't realize the EXTENT to which this is true, though.", "label": 0}
{"text": "God if only..", "label": 0}
{"text": "If trump wins there's not going to be a 2028 election", "label": 0}
{"text": "HE should have\n\nat least we can possibly get a true progressive in 2032 if Harris wins", "label": 0}
{"text": "Multiverse Bernie", "label": 0}
{"text": "Look maybe he should’ve been but if you were gonna sit this one out or vote for Trump because he didn’t then you are ensuring that there’s a real possibility that no woman will have agency over her life ever again. If Trump wins, that is the end of fucking democracy. It is the end of freedom because he’s already talking about journalist getting shot and people who disagree with him getting shot and if he gets in, he’s gonna fucking do it.", "label": 0}
{"text": "He would not be able to pass any legislation for us anyway- the Democrats are too gig of pussies for that.", "label": 0}
{"text": "Easily.", "label": 0}
{"text": "\\#1 is appeasing their owners.", "label": 0}
{"text": "While the 2016 election was handled poorly, I blame the idiots who voted for Trump.\n\nI voted for Bernie in the primaries.  But, because he wasn't a democrat, he couldn't secure the endorsement of a single prominent democrat.  And that's just one of the reasons he didn't win the nomination.", "label": 0}
{"text": "Bernie is too good for this world. I would follow this man to the ends of the earth because I know he would make it better for everyone not just myself", "label": 0}
{"text": "The left never would have stood for the kind of call outs that Bernie would come up with. Dude calls it like he sees it and that won't work for them. Sadly he never had the shot he deserved.", "label": 0}
{"text": "You think Bernie would have beaten Trump? \n\nI think anybody the Democrats put up against him was gonna lose.", "label": 0}
{"text": "> another Bernie out there\n\n\nYou sure about that? Because I'm not", "label": 0}
{"text": "I think he would have. He was similar to Trump in a way that he didn't give canned responses that a lot of politicians give. Either way, would have been nice to see him given a shot.", "label": 0}
{"text": "stolen from him by the SUPER-Delegates! super", "label": 0}
{"text": "Hilary was one of the most unpopular candidates ever and still won the popular vote. Bernie would have killed in 2016.", "label": 0}
{"text": "I'll never forgive the DNC", "label": 0}
{"text": "He took MI in the primary and then the DNC thought, no we should lose that state to Trump instead", "label": 0}
{"text": "We got robbed bad", "label": 0}
{"text": "Gore definitely up there", "label": 0}
{"text": "Bernie endorsed Kamala Harris. What are you even saying anymore dude?", "label": 0}
{"text": "He is like if trump was eloquent and well versed. Both were completely uprooting the song and dance politics people were sick of. They would have been great to see debate each other. Both of them fighting for some real change but having polar opposite approaches.", "label": 0}
{"text": "I digress, but I often think about how much better the world could have been if crazy ratfucking shit hadn't been going on in our presidential campaigns for the last half century. Bernie would have won. He could have healed our wounds and given us Medicare for All.", "label": 0}
{"text": "Blame the Dems and Hillary. They fucked Bernie. They did it again this year too. All while being the party claiming to save democracy. They literally created Trump lol", "label": 0}
{"text": "Absolutely", "label": 0}
{"text": "“When I do good I feel good, when I do bad I feel bad and that is my religion” \n\n-Abraham Lincoln", "label": 0}
{"text": "He was too early for his time, a few years younger and he would have become president eventually. Would have been the next greatest president since JFK.", "label": 0}
{"text": "Its not \"the left\" though. The DNC and the billionaires that funded the stifling of Bernie are center-right.", "label": 0}
{"text": "Several Southern states that Trump was going to win anyway. The EC makes that a complete non-issue. If he had gotten 51% in every state Biden won in 2020, he could have had literally zero people vote for him in any other state.", "label": 0}
{"text": "You only have the DNC to blame.", "label": 0}
{"text": "I agree with you. Republicans would have started chanting “socialism” and a lot of that would stick. You guys are under estimating how much Republicans hate to hear about policies that help everyone, especially black people. They’d rather go without than something help others that don’t look like them. And to them, Bernie represents advancement of all people.", "label": 0}
{"text": "The best T-shirt I've ever seen is owned by my best friend. It's Bernie lying on a couch like a French girl and says \"you coulda had a bad bitch.\" So painfully true.", "label": 0}
{"text": "Just like RBG is responsible for the overturning of Roe v Wade. The egomaniacs in both parties destroy our hope for a decent future. Now we have fascism knocking at our door. How far we’ve fallen", "label": 0}
{"text": "Blame his party and him for dragging his feet along with them whenever they asked", "label": 0}
{"text": "I know", "label": 0}
{"text": "Because they counted the superdelegates for Hillary prematurely leading to a believe Sanders didn't have a chance to win which was a self fulfilling prophecy ", "label": 0}
{"text": "I sadly don't think so. What happened with Trump in 2016 is truly unique. The way the GOP were able to market Trump and generate what is essentially a cult of personality is political genius and I don't think anyone could have beaten him that year. Of course it was short term success because Trump is an unhinged idiot who botched the covid response so intensely that he'd never have been able to win the 2020 election, and is likely going to lose the 2024 election too.", "label": 0}
{"text": "So many people were only going to vote dem because of Bernie. I really hope the DNC does not get complacent and expect votes for them moving forward. Cause once Trump is gone the reasons for voting Dem better increase or we risk a repeat.", "label": 0}
{"text": ">Clinton had 3.7 million (28%) more votes and 451 (25%) more pledged delegates than Sanders.\n>\n>Why do people still believe the superdelegates myth?\n\nQuoted from someone else:\n\n>I want to be really polite here, so please understand that this is a message of hope for understanding.\n\n\"Scoreboard\" doesn't address Bernie supporters who have felt jaded from the 2016 primary. Here are a few ways the DNC, under Debbie Wasserman Schultz, marginalized Bernie Sanders:\n\n1. **Superdelegates** - The DNC could have controlled their party insiders such that the contest wasn't painted in a negative light for Bernie. -*Before a single primary vote was ever cast*-, DNC insiders pushed the narrative that Hilary had already won the contest. The DNC could have controlled this but did not. This is the one thing that the DNC did change after Debbie Wasserman Shultz left her post, immediately after HRC's primary win, to join HRC's campaign.\n\n2. **Debate cheating** - Donna Brazile, the Vice Chair of the DNC, shared questions with the Clinton campaign ahead of both town halls and debates.\n\n3. **Data breach favoritism** - A month before the Iowa caucus, the first contest in the Democratic primary, the DNC shut off the Sanders' campaign's access to the shared DNC voter information. The system the DNC used was broken and had **PREVIOUSLY** leaked the opposition's voter data in favor of both the Clinton and Sanders campaigns. Think about it like a Google for voters with a firewall in between. This firewall was broken and previously leaked information to **BOTH CAMPAIGNS.** This system was vital to voter outreach, including targeting voters and organizing volunteers. The Sanders campaign did not do anything in this \"breach\" that the Clinton campaign had not also done **AND THE SANDERS CAMPAIGN IS THE ONE WHO REPORTED IT TO THE DNC**.\n\n4. **Media narrative** - Somewhat related to #3 but also broader, Debbie Wasserman Schutz, in defense of shutting off voter access and the \"fairness\" of the contest, went on national media, such as CNN, and fought against Jeff Weaver, Tad Devine, and Nina Turner--campaign managers, strategists, and surrogates working for Bernie Sanders. This could not be read as anything other than favoritism. Release a statement. Strife for impartiality. There are a dozen moves. Attacking one side of the contest is not the move.\n\n5. **Internal Emails** - While likely leaked by Russia via Wikileaks (this has never been definitively proven), the leaked DNC emails demonstrated what Bernie Sanders supporters already knew: that DWS and the many DNC officials were secretly cheering *against* Sanders, at times going so far as to suggest ways of defeating Sanders, such as attacking his religion, planting stories in the media, and directly shaping narratives against Bernie with media contacts--all while the Democratic primary was underway.\n\nWhile I mentioned this at the top, I think it's important to reiterate that Debbie Wasserman Shultz, the head of the DNC, directly after HRC's primary victory, went directly to work for the HRC campaign. It doesn't get any more obvious than that.\n\nSaying \"oh but Sanders lost\" is just so immensely reductive. We will truly never know if, in a fair contest, Sanders could have beaten Clinton and what could have happened next. That is what people are still upset about.", "label": 0}
{"text": "Love you Bernie!!!! Politics and media are so corrupt we can’t even have a president for the people", "label": 0}
{"text": "don't bother explaining it. if they don't know by now, it is because they don't care", "label": 0}
{"text": "He has no baggage. I voted for Hillary because.. but damn did I want Bernie. \n\nBS it was her time. He's been doing this shit his whole life.", "label": 0}
{"text": "I see what you’re saying. It’s true that Bernie would have faced huge challenges passing progressive laws through Congress. But I think his presidency could have been impactful in a different way — not by changing laws directly, but by shifting public perspectives. While Trump’s time in office further polarized the country, Bernie might have encouraged more open-minded thinking and started a broader shift in public attitudes toward progressive values. Sometimes, even without legislative wins, a leader’s message can plant seeds for change in the future.", "label": 0}
{"text": "FUCK the left. Bernie is for the people.", "label": 0}
{"text": "I like to think the democrats are not going to play by the unspoken rules anymore... because they've seen time and time again that the republicans aren't honoring shit. We're behind in this game. Fuck it. Start gerrymandering the shit out of everything when you get a chance. If we get the house and senate in a way where we can increase Supreme Court judges and codify things into law.. so it. Don't try and wait. Just do it. McConnell has bypassed so many precedents and protocols.. if we lose this one, our representatives have done it to us.", "label": 0}
{"text": "He was done dirty. More than once. National disgrace.", "label": 0}
{"text": "In a parallel reality ….", "label": 0}
{"text": "No man is an island...", "label": 0}
{"text": "Hes the only old man Ill vote for", "label": 0}
{"text": "Bernie IS the left. The DNC is only left insofar as they're left of the fascists.", "label": 0}
{"text": "Soooo…what I’m hearing is the Republican Party split and the hard right went Trump, and regular republicans went Democrat, and democrats wanted to go hard left but were pulled right by the watered down republicans?", "label": 0}
{"text": "Bernie would have been horrible, but he still got robbed.", "label": 0}
{"text": "It was not a fair contest but it never will be. The power structures will always resist political movements that threaten them.", "label": 0}
{"text": "it bothers me how demonized he has been. some liberals genuinely believe he's a bad person bc all they see is a old white man yelling", "label": 0}
{"text": "Because people believed the myth at the time and it derailed his campaign.  In a change year he was a better candidate against Trump,  and they never gave him a fair shake because she had already been anointed and that was the biggest mistake.  \n\nShe got the votes because of manipulation,  whether or not she would have regardless we’ll never know.  We do know she and Trump were the two least liked candidates in history.  I say this as someone who voted for her for Senate in NY and as someone who likes her.  But the way that played out was absolute bullshit.", "label": 0}
{"text": "It'll be more depressing if Mango Mussolini wins so let's vote for the next best thing and NO that is not Jill Stein. Stein will give us Trump.", "label": 0}
{"text": "Precisely.  My democratic parents couldn’t see that but my friends and I did.  We didn’t care if he couldn’t get through a broken system,  we cared that he was going to try.  That alone had value.", "label": 0}
{"text": "Oh fuck that,  he still barely won.  She didn’t work on the rust belt and she was essentially given the nomination with no opposition except an independent they buried and that’s why they lost.  They were the two least like candidates in history and he won because he was at least something new.  It wasn’t unique,  the DNC got him in office,  not some great GOP strategy.  You’re completely making up what happened.  \n\nThe GOP tried to get rid of him but then gave in because HE,  not them,  was great at mobilizing the dumbest Americans into the political process.", "label": 0}
{"text": "The other reason is the democrats were cocky and idiotic and run by assholes.", "label": 0}
{"text": "I do", "label": 0}
{"text": "I'll never forget what the DNC and media did undermine his campaign. They went as low as.printing the wrong day to vote on the printed information they gave to Sanders canvasers to hand out.\n\nBut the most egregious was what DNC chair Roberta Lange did at the Nevada convention. Then after that CNN a panel on to talk about it. One of them happened to be Donna Braziel. All they did for the next 10 min was rail on about Sanders supporters. Not once did they mention Lange breaking DNC rules.\n\nThis is when I realized how they were all in on harming Sanders campaign.", "label": 0}
{"text": "I was disappointed by the bullshit that happened, but I showed up and voted for Clinton. Unfortunately, not many did.\n\n Clinton had no appeal for so many. There were too many bad decisions during that election and we all suffered for it.", "label": 0}
{"text": "Maybe, but doubtful this time. Trump was an even worse choice in terms of candidates to push. The woman vote is going to bury him. But in 4 years unless if she does some drastic changes she will lose to whoever republicans put up.", "label": 0}
{"text": "I've never been a big \"honor the dead\" person, but Ever since his run, I've sworn to myself, that if ever this great treasure passes, if the hero we need but didn't deserve passes, I'm getting on the next flight to Vermont to show my respects.", "label": 0}
{"text": "He's the greatest US politician in my lifetime. And that is nearing 50 years.", "label": 0}
{"text": "No way Kanye West should of won.", "label": 0}
{"text": "This post, just days before an election is intended to demoralise democratic voters right?", "label": 0}
{"text": "Bernie would have made the world a better place for all of us.", "label": 0}
{"text": "I will always be sad he never got a chance. I would have love to see how the country would’ve turned out 😔", "label": 0}
{"text": "He should have been the nominee. I will never forgive the DNC for doing that to him. He had the numbers, they knew it. They just didn’t want the change that he really and truly was going to bring. ", "label": 0}
{"text": "I love you Bernie!!!", "label": 0}
{"text": "Bernie gets me.", "label": 0}
{"text": "Remember the [2016 dem primary Nevada caucus](https://www.youtube.com/watch?v=435x0dQ5Lzg)?\n\nAbsolute disaster. The 2016 dem primary is a great example of how fucked America is. A candidate like Bernie will never be allowed to rise up so long as the DNC and RNC continue to function in the way they do.", "label": 0}
{"text": "I think I remember you. 👋🏽✌🏽🇺🇸", "label": 0}
{"text": "I agree. Probably the greatest loss our generation never knew it lost.", "label": 0}
{"text": "A lot of people hate the DNC because of what they did to Bernie. But once you start importing more votes I guess it doesn’t matter if you win.", "label": 0}
{"text": "Sanders would have been trounced by Trump on 2016 and 2020.  He's much better off as a Senator.", "label": 0}
{"text": "Well I mean the DNC did have super PAC meetings on how to sabotage him.  \n\nhttps://www.npr.org/sections/thetwo-way/2016/07/23/487179496/leaked-democratic-party-emails-show-members-tried-to-undercut-sanders\n\nThe outcry and fallout was bad enough they apologized. \n\nhttps://www.reuters.com/article/world/democratic-national-committee-apologizes-to-sanders-over-emails-idUSKCN1052BN/", "label": 0}
{"text": "I don't think Warren lied about what she thought Bernie had said, so it was either a misunderstanding or Bernie didn't recall saying it. What you're referring to, I assume, is Warren saying Sanders had privately expressed concerns that a woman couldn't win the presidency (which speaks to America's collective sexist attitude, not the ability of any given woman).\n\nI think she had every right to say that if she believed it, and I think she did. I think Bernie was right to deny it, regardless of whether or not it was true. But it wasn't going to accomplish anything and I wish Warren hadn't brought it up. At best, she presented it in an uncharitable way.\n\nThat said, that criticism isn't exactly outrageous. I really don't think you need to have this much disdain for Warren over this. She is a solid progressive ally and always has been.", "label": 0}
{"text": "It's a weird claim for that person above to make, given that the DNC's response to criticism (and a lawsuit) was that [they are not beholden to democratic processes.](https://observer.com/2017/08/court-admits-dnc-and-debbie-wasserman-schulz-rigged-primaries-against-sanders/)", "label": 0}
{"text": "He lost by 17m votes to 13m votes.\n\nShould the Democrats have picked the guy who lost?", "label": 0}
{"text": "I'm from the timeline he was, what the fuck is this shithole timeline \n\nPeople wanted change, not the wife of a former president, if she didn't push her way to the front you would never have heard from trump again", "label": 0}
{"text": "Has he passed any legislation? Like, ever?", "label": 0}
{"text": "Bernie Sanders had a speaking engagement in the Chicago suburbs few days after Hillary lost. I quietly sobbed through the entire presentation. His empathy is endless.", "label": 0}
{"text": "DNC, and don’t forget MSM", "label": 0}
{"text": "I would agree that Sanders got shafted. It doesn't really matter, it's opinion. And of course I'm bias. I didn't like Clinton as much as Sanders. I didn't feel like the DNC respected this choice. Why would anyone else care what I think? And in the same token why would I care what they think? Other people want to think it was fair to Clinton? Sure. Whatever. But no one can escape the fact that Clinton didn't win. Deciding for the American people who should be nominated didn't work for the Democrats. If it works this time it will be a miracle, and clearly representative of Harris being seen much more favorably than Biden. We can either respect the American people's politics, or we will have someone much worse than trump win much more easily. If the potential of Sanders winning makes some Democrats prefer Trump, they should make that leap and leave the Democrat party, rather than force the party to run weak Democrats that are basically Republicans from the 80s. Who wants to vote for Republican politics from the 80s? Even if \"you\" do, the American people don't. Wanting those politics is a one way ticket to Trump.", "label": 0}
{"text": "Not quite. There's a global phenomenon called the ratcheting effect. Right wing parties get more extreme over time and pull the Overton window to the right. They enact policies that create a \"new normal\" that makes you easier to move right than it is to move left. The left wing then moves right as it seeks to win \"moderate\" voters. Neoliberalism is in the global right wing, but it's where moderate Republicans and most Democrats in Congress sit. Every Democrat president since Clinton has been a neoliberal. Judging Harris by her time in the Senate, she's a neoliberal.", "label": 0}
{"text": "I don't think Clinton ran a good campaign by any means, but I also think Trump was sort of an inevitable beast, built by America and its broken ideologies and systems. Bernie wouldn't have beaten him. *Maybe* Biden could have, but even that's up for question considering the world was so different in 2016, and 8 years of Obama had just come to an end, and historically, the pendulum swings. \n\nAs for the comment around the GOP's involvement, I think sharpen up. Trump is merely their populist puppet to get the white house and make huge, insidious changes. Once Trump's gone, they'll still be around.", "label": 0}
{"text": "Psssh. It's like comparing Pepsi and Diet Pepsi. One wants to keep us where we currently are with fascism, while the other wants to move is toward the fascism we learned in World History class.", "label": 0}
{"text": "Hillary, and the DNC(headed by a close Clinton ally, Debbie Wasserman-Schultz) stole 8 years of Bernie from the US citizens. \n\nYou'd all have universal healthcare by now because he'd just tell the corporate dems to get fucked and sign an executive order.", "label": 0}
{"text": "A truly good timeline would have had this man win the presidency in 2000 and get re-elected in 2004. I think he would have prevented nearly every single one of the mistakes we've suffered through in the 21st century.", "label": 0}
{"text": "I don't remember the specifics since it has been so long but I do remember hating the DNC for what they did. 2016 was the first time I didn't vote Democrat. I didn't vote for Trump either but the Dems lost my automatic vote ever since. I know I'm not the only one.", "label": 0}
{"text": "I’m sure they did. I’m sure it’s not a coincidence that Bernie Sanders and all the idiotic conspiracy theories are all over my front page again days before the election.", "label": 0}
{"text": "well also millions more people voted for Hillary", "label": 0}
{"text": "Yes, and in yet another alternate universe the conspiracy theories are true and he lost the nomination because the DNC took it from him. We’re not living in either. Here in our reality, he wasn’t even popular enough to win the primaries.", "label": 0}
{"text": "Love how you're framing it as *Bernie's* problem that DC politicians have rarely supported Bernie's policies. Policies centered on the 99% and popular among voters. You can't knock Bernie's character, policies, or voting record so you've moved the goalpost to hold Bernie somehow responsible for the actions of selfish colleagues. Sad.", "label": 0}
{"text": "If great means massive... then yeah. None of them are great with the other \ndefinition.", "label": 0}
{"text": "Young people don't show up to vote, or he would have been.\n\nYoung people not showing up to vote this time could also be the end of our Great Experiment.\n\nSo please vote like our country and the world depends upon it.  Because it does.", "label": 0}
{"text": "He came out as Zionist last year so no, it won't.  If he had left politics before then, yes.", "label": 0}
{"text": "DNC fucked him real good.\n\nI would have maybe voted for him as well.", "label": 0}
{"text": "Fuck the democratic party and the Clintons. Vote Harris.", "label": 0}
{"text": "lol yes.\n\nIt’s such an easy answer my fucking god.\n\n“65,844,954 (48.2%) to his 62,979,879 (46.1%)”\n\nThat’s Clinton with 65 million votes. And did it win her the election?\n\nNo.\n\nLook at where she picked up all her votes in the primaries. Everyone south of North Carolina and California, and NY.\n\nGreat.\n\nWomen? Cool. They’d have likely voted in Bernie’s favor in the same margin if the opposition was Trump.\n\nEspecially after the Access Hollywood tapes.\n\nClinton could barely comment on that as a woman and because of her fucking last name.\n\nBernie would have won. He was huge in the Midwest, huge in the Northwest, he’d easily win the youth vote (raising minimum wage and opening up the option to Medicare as a working teen / young adult?), and he’d win every liberal state that Hilary got by default as well.\n\nThe folks who were looking for something different? Bernie was also that.\n\nHe wasn’t a true corporate Dem. He was a fuckin dude who got arrested protesting the man and then lived his entire life trying to give Americans a safety net and money back from the billionaires. Oh and he was pro 2A.\n\nIt’s why I hate the strategists at the Democratic Party. They knew the numbers and decided nah, Clinton will just somehow win. \n\nThey fuckin threw.", "label": 0}
{"text": "Yeah, it is pretty transparent. And so are many of these comments. They like to use Bernie's loss as a wedge to drive a certain non-critical thinking segment away from voting in their own interest, in order to favor Trump. Luckily, I don't think it has anywhere near the impact it did in 2016.", "label": 0}
{"text": "I’m gonna give you a challenge. Sit and watch both the jd Vance and trump Joe Rogan podcast episodes then lmk if it helps release some of that bias you’ve built up from 30 second out of context clips Reddit has been feeding for years.", "label": 0}
{"text": "When it was already called. California, for instance, was polling in Bernie's favor earlier in the primary process.", "label": 0}
{"text": "I've never heard him say anything like that.  He hardly mentions race when he talks about the need for a living wage and for everyone to have medical care.  Can you point me to something specific?  And which skin color would it be?", "label": 0}
{"text": "I mean because the party and the way it’s managed *isn’t* democratic therefore preference for a candidate under the umbrella of the party to the point at which another candidate is secretly sabotaged is kingmaker bullshit.\n\nAnd we as voting Americans are basically powerless against it.\n\nMight not seem like a big deal when the candidates are close on policy or predicted success. But it also highlights a weakness in our democratic system.", "label": 0}
{"text": "\"His\" party? Bernie is an independent.", "label": 0}
{"text": "Exactly. Hilary could be easily bought. Bernie could not be, therefore he was not the preferred candidate.", "label": 0}
{"text": "Yeah I figured as much. Much easier to press a down arrow than trying to understand an opposing viewpoint.", "label": 0}
{"text": "Amen! He is a real leader who can be trusted! I hope he has an understudy coming along so Harris Walz can pass leadership on to Bernie type philosophy!", "label": 0}
{"text": "What are you talking about?? \n\nAcross two tax cuts, Reagan successfully lowered the top marginal tax rate from 70% to 28/33%. Meanwhile Biden wants to increase it from 37% to 40%. \n\nAs for unions, he’s not completely anti union like Reagan was. By “crushed union strikes”, I assume you mean the train strike? The democrats preferred option was to force the companies to agree to the updated deal, but the republicans blocked that, leaving two options. Force the original deal the unions had negotiated through, or risk economic collapse. You don’t need to be a great mathematician or economist to know which option harms way more people, hence the action that the government collectively took. Skewing it to make it seem like Biden is overall anti union is very much a right wing talking point.The reality is it was most of the government doing it, not just Biden, because the economy is more important than the unions of a specific industry, not because he hates unions.  He literally went back afterwards to get changes enacted.  And ya, the economy shouldn’t be so reliant on one industry, but it’s not like Biden chose for it to be that way.", "label": 0}
{"text": "Regardless of if he did say something to that effect or not, the intent of bringing it up was *specifically* to hurt Bernie. She presented information in the least charitable way in order to get a leg up on him and possibly leech away some of his support when it was clear he was the progressive candidate in the race.\n\nIn 2016, Sanders wanted Warren to run against Clinton. He didn't take up the mantle until Warren turned it down. At that point he believed Warren was a stronger candidate than he was. For Warren to then imply that he thought all women were weak candidates in the 2020 election was simply a knife in Bernie's back.\n\nAnd this being the same Bernie that *wouldn't* attack any of the other candidates on stage. He ran on his strengths and wouldn't hit anyone else's weaknesses. That sort of attack is a low blow and is definitely throwing Bernie's name in the mud, as the previous poster asserted.", "label": 0}
{"text": "Fuck the DNC.", "label": 0}
{"text": "Between this and her refusal to endorse her supposed friend in either of his two runs, it’s clear she’s fake as fuck.", "label": 0}
{"text": "Its frankly surprising that you dont hear a more economical version of this argument used more often.\n\nPaying for a kids school meal is going to lead to a healthier and more educated work force which will be good for the economy.\n\nChipping in for universal health care will lead to a healthier work force that will in return lead to a better economy.\n\nI sincerely doubt that anyone understanding this side of reality would ever argue against these things in good faith.", "label": 0}
{"text": "I truly think he was our one shot at course-correcting. I fear we will never get another. The way the corporate world controls mass media, social media, and the politicians they back with Super PACs and dark money — it’s just too much.\n\nIf a man with the bullet proof record Bernie had wasn’t enough, nothing will be.", "label": 0}
{"text": "I've got an acquaintance that's pretty hard Republican, but he did say there's only a couple politicians he respected and Bernie was among them. I think he still votes R, but all it takes is a small contingent that's a little less tied to the Republican candidate and then that's another Bernie voter.\n\nIntegrity, clear designs on helping people, wanting to work with folks to do so, having a history of supporting the downtrodden, and honestly just helping the working class - all those things are easy to see and people are drawn to it.", "label": 0}
{"text": "Seriously people? Everyone has the right to be wrong.", "label": 0}
{"text": "I mean even with Harris, I find the addition of Tim Welze haveing her ear to be a pretty strong reason for voting for her even if Trump wasn't around. but that may just be me, I would like to keep pushing dems more to the left", "label": 0}
{"text": "He is in support of Palestine? so please just shut up and call him a jew, cuz thats the only reason why u call a jewish person that support Palestine a “zionist” lmao", "label": 0}
{"text": "Unfortunately, to be brutally honest, history will probably hardly remember him at all. \n\nWhen it comes to politics, the only people that anyone learns about (besides perhaps people going to college to be a historian/history teacher) are largely presidents/founding fathers (and even a lot of those get forgotten) and leaders of major successful movements, like MLK jr, Susan B Anthony, and Frederick Douglass. \n\nWhile Bernie was on the right side of history, so has many congressmen in the past, and how many can you name that never became president/weren’t a founding father? The only one I know of/probably the most famous example is Henry Clay, and if I had to guess, most Americans don’t know who he is.", "label": 0}
{"text": "Redditor spotted out of touch. More at 12", "label": 0}
{"text": "It's \"truly unique\" because his cult of personality existed independently of the GOP and was so undeniably strong that they couldn't do anything but fall in line. The GOP hated Trump about as much as the DNC hated Bernie, the only difference is they weren't stupid enough to suffocate his hype in lieu of an institutionally-approved candidate like the DNC did", "label": 0}
{"text": "Elizabeth Warren is a great politician, your rhetoric is almost a decade old at this point and I canvassed for Bernie in 2015. People can have fundamental and at times upsetting disagreements without it devaluing either side’s labor.", "label": 0}
{"text": "Yeah, too late now!", "label": 0}
{"text": " I still feel the Bern.", "label": 0}
{"text": "Other than standing no actual chance of being elected. I agree with you.", "label": 0}
{"text": "Biden got the train strikers everything they wanted. I remember checking the union webpage and there was a big front page thank you to Biden. He just shut it down to avoid the massive economic disaster and went back later to negotiate and pressure the companies on the union's behalf. His PR team really dropped the ball, but he got it done. And he also backed the more recent dock strikes too. \n\nI'd say he's definitely the most progressive president of my lifetime, considering my choices are Clinton, bush, Obama, trump, and Biden. And even if he weren't the most progressive, he's by far the most pro union.", "label": 0}
{"text": "LOL.\n\nThe DNC iS cORRuPT! Also they should have ignored the majority and picked MY candidate.", "label": 0}
{"text": "remember that they didn't want to put him up for presidency because of his age, and they ended up putting older people up for presidency?.... yeah....", "label": 0}
{"text": "You guys missed out on Algore, Obama the Sanders and it breaks my heart. The whole planet would be very different today I believe.", "label": 0}
{"text": "Warren was definitely playing loose with the truth by giving us how *she* could perceive it, with her interpretation of \"I thought a woman could be president; he disagreed.\" Warren could have repeated Sanders' exact words but she **refused** because she knew it was an intentional misinterpretation that was aimed at sabotaging his campaign. Realistically, Sanders and Warren likely had a disagreement over which one of them had better chances going against Trump and the strength/weakness of being a women probably came up. \n\nSanders literally said a woman could be president back in the '80s or '90s.\n\nAdd in the fact that Warren made a fuss about some random person giving an anti-Warren talking points (which was deleted and which Warren's campaign later had anti-Sanders talking points, which the media ignored), Warren spending almost half her exit interview with Rachel Maddow talking about the act of a single person and pinning it on Sanders supporters in an effort to label their entirety as toxic, etc... and it's obvious that Warren only entered the 2020 primary to undermine Sanders.", "label": 0}
{"text": "I love this man, he’s on the right side of history", "label": 0}
{"text": "Stfu", "label": 0}
{"text": "It f killed me voting for H after she pushed him out but it was either her or T - and meanwhile, he won anyway.", "label": 0}
{"text": "Send him to Canada we badly want him and our leaders are all idiots so he would easily win!", "label": 0}
{"text": "Definitely, they want to burn the system, they rather have Trump than a Democrat.", "label": 0}
{"text": "Let's rely on the established facts rather than try to imagine what would or wouldn't have helped. A fact is this wasn't just questions, it was information about *those who asked the questions* as well. A campaign manager worth their salt would make heavy use of that information. Another fact is they shared the information despite the very clear and obvious risk of heavily eroding voter trust in their party like they now have. One doesn't take that risk unless the benefit is equally as clear.\n\nNow address the \"not-dumbest\" ones.", "label": 0}
{"text": "Absafuckinglutely.", "label": 0}
{"text": "I respectfully disagree. I believe Bernie Sanders almost singlehandedly saved the american left with his 2016 campaign and started a movement that is gaining massive support today. I do believe that he will be remembered and be talked about in history books.", "label": 0}
{"text": "Yes, but he was unelectable and it didn't happen. Time to move on. Focus on the choice we have in front of us instead of lamenting what never was", "label": 0}
{"text": "Stop believing everything these politicians say it’s disgusting how many young people sallow their BS. They will say whatever you want to hear. All of them!", "label": 0}
{"text": "That’s why the powers that be doesn’t allow him. ", "label": 0}
{"text": "Can he still win?", "label": 0}
{"text": "This man is too smart to be president. He wouldn’t (and didn’t) have had the support of his own party unfortunately.", "label": 0}
{"text": "They’re gonna put statues of him up in Vermont.", "label": 0}
{"text": "No he's not.  He isolates the problem as being a Netanyahu issue instead of the systemic issue it is, and for numerous months stood firm behind Israel in the face of obvious war crimes.\n\nAnd to be clear, he knows this isn't a new problem Israel has.  Speaking out in support of israel on October 8 was questionable.  But in December?  February? etc.  Nahhhhh\n\nfuck zionists, most of which are not even jewish.", "label": 0}
{"text": "Can we not do that “election was stolen” shit here please?", "label": 0}
{"text": "> The DNC iS cORRuPT! \n\n* Giving Hillary - and only Hillary -  the [debate questions](https://www.cbsnews.com/news/dnc-interim-chairwoman-passed-debate-questions-along-to-clinton-campaign/) before the debate.\n\n* [In a class-action lawsuit](https://lawandcrime.com/high-profile/dnc-lawyer-reportedly-said-they-could-have-chosen-between-clinton-sanders-over-cigars-in-back-rooms/) by Bernie Sanders supporters against the Democratic National Committee, lawyers for the DNC arguing they could have chosen their nominee over cigars in a backroom...the primary voters and democracy be damned. \n\n* The DNC charter, article 5, section 4, requires that the Chair exercise impartiality and evenhandedness in its preparation and conduct of the presidential nominating process. The DNC and Debbie Wasserman Schultz argued in court, “DNC charter’s promise of ‘impartiality and evenhandedness’ as a mere political promise—political rhetoric that is not enforceable in federal courts.” So in their defense, the DNC argued that they never promised not to rig the primary.\n\n* The superdelegates pledging for Clinton early in the primary campaign creating a sense of inevitability. Public perception was that Clinton held a commanding lead before many states even held their votes. This could be seen as the democratic establishment choosing the candidate instead of letting the people decide in state votes. Wasserman Schultz went on to say, “Unpledged delegates exist really to make sure that party leaders and elected officials don’t have to be in a position where they are running against grassroots activists.” \n\n* The DNC claimed that Bernie staffers had hacked the Hillary side of the voter database and used it as a pretext to freeze Bernie's access to the voter database. In reality, both sides had access to each other's data and the Bernie side realized, ran a few searches to see how extensive the security breach was, and reported it to the DNC. The DNC used that as a pretext to block Bernie's access to the data collected by his own staff to hamper Bernie's turn out the vote effort. Bernie had to sue to get access back.\n\n* [Limiting the number of debates](https://thehill.com/blogs/ballot-box/dem-primaries/252227-sanders-dnc-using-debates-to-rig-primary/).\n\n* Before the convention, Hillary’s campaign was grabbing money from the state parties for its own purposes, leaving the states with very little to support down-ballot races. Money donated to the DNC was [funneled almost exclusively to Hillary.](https://www.politico.com/magazine/story/2017/11/02/clinton-brazile-hacks-2016-215774/) A Politico story described this arrangement as “essentially … money laundering” for the Clinton campaign. Donna Brazile said,\"If the fight had been fair, one campaign would not have control of the party before the voters had decided which one they wanted to lead.\" \n\n* The leaked Podesta emails showed the DNC actively working to keep Sanders from being considered. This even forced Debbie Wasserman Schultz to resign as the head of the DNC.\n\n* Bernie got screwed over by Clinton delegates at the Nevada primary that would determine who to send to the ballot. They took an aye or nay vote and the lady conducting the vote claimed Hillary won the vote but audibly it sounded like Bernie had won. Sanders camp asked for a roll call vote so as to determine who the actual winner was but was denied by the vote lady. This was against the rules as the rules require a roll call vote if requested. Hillary was declared the winner by the vote lady who closed the session and quickly left the room so as not to deal with the aftermath of what she had just done. And Bernie camp was left with no recourse to remedy the situation at that point.\n\n**Whether Bernie would have won if the DNC had not put their thumb on the scales is a different discussion; however, there is no denying the DNC acted in an [underhanded, corrupt manner.](https://youtu.be/I8qBexfR3r4)**", "label": 0}
{"text": "The Sanders Trump voters are pretty wild https://en.m.wikipedia.org/wiki/Sanders%E2%80%93Trump_voters", "label": 0}
{"text": "He's like the only politician that sounds like a regular person looking out for other regular people, which in turn makes him not fit in with the other politicians so they push him to the outskirts.", "label": 0}
{"text": "[All of these](https://www.billtrack50.com/legislatordetail/15747)", "label": 0}
{"text": "What is the point in winning if you lose your entire agenda?\n\nDo you think Harris, Clinton, Biden have the same goals as Sanders? You said it yourself, corporate Democrats.\n\nTo many of them, better to have the stock standard Republican over Bernie. At least the Republicans will give their corporate sponsors tax cuts. Bernie would be the worst thing to them. He would have made America fair.", "label": 0}
{"text": "We really were robbed of something potentially great.", "label": 0}
{"text": "na he makes too much sense and wants to help too much. americans hate that", "label": 0}
{"text": "His main supporters dont vote, its weird. Why is it the most vocal age group tend not to actually go out and vote?", "label": 0}
{"text": "Weird how this stupid shit got propelled to my front page the day before the election. \n\nSome of y’all are fucking idiots. Racist ass MAGA supporters gave us Trump. Not Democrats. Fuck off with that bullshit.", "label": 0}
{"text": " Imagine?", "label": 0}
{"text": "I wish I had Farnsworth’s “what if” machine to see.", "label": 0}
{"text": "You heard what you wanted to hear so you could dismiss what you don't like. SAD, low energy.", "label": 0}
{"text": "I wonder how the timeline in which he won the nomination and went on to beat Trump in 2016 is going.", "label": 0}
{"text": "I'll never forget about him.", "label": 0}
{"text": "He will be known as the spark that created the modern progressive movement. \n\nAssuming that the progressive movement continues to grow.", "label": 0}
{"text": "let’s not pretend the DNC didn’t actively push Hillary over Bernie. that’s part of why Hillary lost, when the emails from DWS to the Hillary campaign were released", "label": 0}
{"text": "I wish we had had Bernie as president", "label": 0}
{"text": "What a terrible attitude to have. As if you don't have a say in what history gets passed down.", "label": 0}
{"text": "I also voted Jill Stein 2016.", "label": 0}
{"text": "And he didn't win. Let's move on.", "label": 0}
{"text": "There's no place for good honest men in politics. They might use some of that bomb money for food stamps. The outage! Real shame.", "label": 0}
{"text": "Fuck the DNC! \n\nThat being said - Vote Harris! (Because you have no other viable choice)", "label": 0}
{"text": "The reason I lost faith in the Democratic party. The guy who actually would have changed everything for the better. A real working class hero....still gonna vote Harris because Dump is not even an option but not psyched.\n.", "label": 0}
{"text": "Shonda.", "label": 0}
{"text": "Blame Hilary and the DNC. They fucked him both times.", "label": 0}
{"text": "Blatant corruption,nobody decent will ever get in office again.", "label": 0}
{"text": "Thank goodness he wasn't, we already got 8 years of populist nonsense but atleast we didn't have a president actively trying to tank the economy", "label": 0}
{"text": "One of them has a kid with special needs in school and under DeVos the program got cut.", "label": 0}
{"text": "What do you mean walked away from the party... He is an Independent. It would be odd for an Independent to hold a leadership position in a party they are unaffiliated with lol. He has always supported the Democrats nominee via rallies and endorsements.", "label": 0}
{"text": "/u/anestis_delias", "label": 0}
{"text": "Iirc Bernie had several points over her in CA", "label": 0}
{"text": "Fanatasizing about what bernie could've been doenst help anyone now.", "label": 0}
{"text": "Yes, Debbie Wasserman-Schultz resigned as chair of the DNC for completely unrelated reasons after the Podesta emails leaked. They just so happened to outline the Hillary campaign's plans for voter suppression and election fraud.", "label": 0}
{"text": "but not palestinian children, he doesnt give a fuck bout them", "label": 0}
{"text": "y'all still believe that nonsense? y'all didn't get enough people to the primaries.", "label": 0}
{"text": "I'm not an American and even I could see that only a presidential candidate like Bernie Sanders who would be able to make US of A a better, fairer and stronger country.\n\nUnfortunately, your country is too divisive and only a populist or charismatic leader who would be able to unify the country. Bernie is not that person because he's a policy maker and doesn't talk BS. I was hoping that Biden presidency would give him some opportunities to make drastic changes in the country but it seems nothing significant has been accomplished (CMIIW).\n\nIt's such a shame, America. You had your chances but you blew it. Bernie was the one who got away.", "label": 0}
{"text": "seems like this entire post is to encourage lefties not to vote. Bernie Sanders himself has endorsed Kamala. I can't imagine voting for anyone else this election.", "label": 0}
{"text": "Bernie is the only politician that doesn’t sound like he’s owned by corporate America. It’s so messed up the Democratic Party pretty much ruined his path to presidency for Hillary. Corrupt af, I’ll never forget it.", "label": 0}
{"text": "Bernie has endorsed Kamala Harris, you should vote for her.", "label": 0}
{"text": "Bernie endorsed Kamala. If you want Bernie to have someone to work with, you need to vote Democratic Party", "label": 0}
{"text": "is the \"massive support\" with us in the room?", "label": 0}
{"text": "Touch grass.", "label": 0}
{"text": "One of the only things trump has been truthful about is how screwed over this man was in 2016 and 2020.  The democratic party should have to answer for this.", "label": 0}
{"text": "When you come back from la la land, can you bring me a treat?", "label": 0}
{"text": "Make sure to support the DNC.  They colluded to make sure Hillary got the nomination, even knowing that she might lose to Trump.", "label": 0}
{"text": "When are we going to admit that the DNC is a corrupt institution.  We haven't had a decent nominee since FDR.", "label": 0}
{"text": "People dont even remember who he is now lol. 10 years from now? no chance", "label": 0}
{"text": "History is written by the winners, and he never won.", "label": 0}
{"text": "What?  What about Dennis Kucinich and Mike Gravel? I feel like this is very revisionist perspective on things.  Bernie is awesome but he's not alone.", "label": 0}
{"text": "I am not really sure what you mean by becoming a Democrat. Its just a letter next to your name. Who ever wins the nomination sets all of the parties policies to their own political ideals. Its not like the Democratic party has organizational policies.", "label": 0}
{"text": "I am NOT voting for Kamala - and I 100% agree with this statement.", "label": 0}
{"text": "How so? Thats ominous without any specifics.", "label": 0}
{"text": "And he’s voting for and endorsing Harris. Go out there and do the same.", "label": 0}
{"text": "I wanna eat some shrooms with Bernie.", "label": 0}
{"text": "She’s an accessory, but she was working for Hillary.", "label": 0}
{"text": "That’s not how it works at all.  The president isn’t king of the party.  The platform is set by delegates at the convention (and that’s only the national platform, there are 50 state ones and some additional territories as well.)\n\nBeing a Democrat means doing work for and getting benefits from the party.  Humans are organizational and social creatures.  Every time I knock on a door as a Democrat that information goes in our database.  Every D candidate gets access to that.  And that’s the tip of the ice berg for what the party does.\n\nSo it’s far more than a letter.  For people like me, it’s decades of work at the local, state and national level working as a team.", "label": 0}
{"text": "Yet every redditor thinks trump will somehow be a dictator. Trumps a clown for sure but the constitution will prevail like always. The government will never become a dictatorship. ", "label": 0}
{"text": "People have got to stop saying this. Bernie supporters don’t believe that primary was fair. Saying “yeah bud scoreboard” is the absolute dumbest shit imaginable. Yeah. When the refs are on your payroll and you win, you won. That’s not proof of anything.", "label": 0}
{"text": "He wants you to vote for Kamala Harris. If you’re not voting because he’s not a candidate, he is disgusted with you.", "label": 0}
{"text": "lol", "label": 0}
{"text": "This is the product we get when we vote defensively.  The worst part is, we may never see another like him.   We're heading for some dark times no matter who we vote for.", "label": 0}
{"text": "Can you elaborate?", "label": 0}
{"text": "A Jew preaching human decency. It’s like I’ve heard this story somewhere before.", "label": 0}
{"text": "I see you’ve never experienced the party first hand and all of our infighting.\n\nIn general what the nominee wants goes in because democrats tend to agree at like the 80-90% level on most things.  We all support universal health care.  Some like a public option (about 90% support) that would cover 98% of Americans, some like Medicare for all (about 80% support) that gets us to 99%.  A small percentage like me support an NHS style to get 100%, but I’d also endorse any of the other two.\n\nAnd that’s just how it is.  Also, even if the DNC sets a position, no official is obliged to support it.  Our fragile majority was held together with folks like Manchin who often supported things like a lower minimum wage than our platform.  And you only need to look at 2016 where serious platform changes were negotiated with sanders delegates.", "label": 0}
{"text": "I think that's one explanation, but I think the main issue is money in politics. Corporations and billionaires will back and lobby candidates that will lower corporate taxes, reduce regulations, reduce tariffs, etc. These same corporations and billionaires spend a ton of money to change public opinion and are responsible for the consolidation of news media, like what happened with Sinclair or Bezos buying the Washington Post. Neoliberals are pro-business over the concerns of the average citizen and vastly more preferable to the rich than a truly progressive candidate.\n\nThe Overton Window is the idea that this shift in politics is a natural consequence of what one party did. Instead I think it's an explanation that puts the cart before the horse. The Overton Window happened because we let the rich manipulate public opinion and buy politicians.", "label": 0}
{"text": "Ah so you’re more interested in forwarding the interests of the DNC than making any meaningful progressive change in mainstream US politics. Bernie was the greatest opportunity to do so in the past decade - Warren voters like you infighting are part of what kneecapped him. So what, he didn’t want to kowtow to the shitty party line or be beholden to corporate interests? I’ll never forgive people like you as long as we are stuck with a far right and center right party.", "label": 0}
{"text": "Sanders endorses Harris. What else do you need to know?", "label": 0}
{"text": "The Dem establishment was never more united than preventing his ascension", "label": 0}
{"text": "That’s absolutely not true.", "label": 0}
{"text": "There's a lot of wacky takes in this thread but in no reality is Biden economically to the right of Reagan. Your tax analysis is not accurate.", "label": 0}
{"text": "But the president alone doesn’t.  Obama wanted the public option.  Pelosi got it through the house.  It died in the senate.  The party is a big diverse group of people.  Sometimes things presidents don’t like get through.", "label": 0}
{"text": "I don’t care if he had a .0000000000000000001% or 1000x lower than that chance of winning. People who still feel upset about this don’t care. When you cheat, you don’t get to rub outcomes in people’s faces. I’m voting blue and have voted blue because I see the electoral system for what it is, but I don’t want to hear “Bernie was never going to win.”\n\nWe’ll actually never know. It’s impossible to know. Let’s just agree it was unfair and move forward. Let’s not disparage the man for losing an unfair contest and let’s certainly never use the results of that unfair contest as evidence of anything.", "label": 0}
{"text": "Any examples come to mind?", "label": 0}
{"text": "American politics is grim, all a bunch of rich power hungry manipulators and this is the same in most countries tbh", "label": 0}
{"text": "I voted for Gary Johnson.", "label": 0}
{"text": "bErNiE bRoS", "label": 0}
{"text": "Bernie was an independent for his state he had to go back so don’t be surprised that be did? Like it wasn’t that hard to find out every article that reported it said it was happening because of that.", "label": 0}
{"text": "It's the stupid two party system, the national committees of both parties, the lack of ranked choice voting, and the stupid \"winner take all\" electoral college.\n\nGoddammit, just give one electoral vote per House district and have the certification as independent as possible", "label": 0}
{"text": "I suspect it probably would prevent him. But he us the closest thing to a possible dictator in recent, or possibly our entire history.\n\n\nHe has said he will be a dictator. We should absolutely believe he will try. And even the attempt will probably leave lasting damage.\n\n\n\nAnd the fact that he would even think that is an option should be enough for all of us to do everything we can to make sure he is never in power again.", "label": 0}
{"text": "He will hopefully be remembered like 'Fighting Bob' La Follette in Wisconsin. Not a household name, but if you know you know.", "label": 0}
{"text": "I don’t disagree with your sentiment- I would just note some people react to it non-constructively. \n\nApathy is a risk here, and it’s important to note that relative to any point in American history the party’s control over the secret primary has never been weaker. Same is true for the GOP.\n\nSo we only have less reason to complain compared to the Obama, Bush, or Clinton years- but that’s not usually to tone I see.", "label": 0}
{"text": "$10 says it's either about Ukraine, Gaza, or the Middle East in general.", "label": 0}
{"text": "Absolutely, finishing up his wildly successful 8 years. Imagine, Covid snapped in the bud, a million saved, Medicare for all, appropriate taxes on the rich, peace in the Middle East…and Midwest…much more. I’m not ‘fckngberned2X’ for nothing…", "label": 0}
{"text": "He could have become a Democrat and helped those of us who are trying to move the party left.  I don’t begrudge his decision - it isn’t fun, and he can do what he wants.  I like the guy.  But becoming a Democrat gives you levers in the party to help us move it left.", "label": 0}
{"text": "Bernie Bro for life!", "label": 0}
{"text": "He’s great.  Tragedy how the DNC treats great people like this.", "label": 0}
{"text": "He never ran to win if he did he would have been less emotional and more diplomatic in how he spoke and he certainly should have thought twice about ever uttering the word socialist or socialism two trigger words that turn people off even though they have no idea what it means.", "label": 0}
{"text": "The people always wanted Bernie, but the billionaire donors who control the Democratic party did not.", "label": 0}
{"text": "Just thinking of the turn of events if Bernie had been able to handle the supreme Court changes instead, my whole heart stings...", "label": 0}
{"text": "The DNC giving the nom to Hillary is what sent us into this horrific timeline.", "label": 0}
{"text": "There are a lot of wrong sides of history and no countries/cultures are an exception to that rule, you just have to read books, but you can practice being a decent human being with good ideas about what is right and wrong. Being a good person is transcendental.", "label": 0}
{"text": "Senator Sanders is a statesman. Vermont has been fortunate to have such a well spoken, educated representative for all these years. \nWe would have been extremely lucky to have had him as President.", "label": 0}
{"text": "That's another way to say it! 🤝", "label": 0}
{"text": "The the DNC hates this man and his policies. Do you have any idea how thrilled most of the party was at the opportunity to send $20 billion to Israel and rake in the sweet, sweet AIPAC cash? They enlisted their help to crush progressives around the country. A fantastic bargain made in blood, but Bernie would not have been so cool with that.", "label": 0}
{"text": "He also, in spite of his age, has maintained his faculties way better than Trump or Biden.", "label": 0}
{"text": "Every single argument here is nonsense. Bernie's support has been a huge boon to the party, and if Bernie didn't caucus with the Democrats then the Democrats wouldn't have had a Senate majority from 2021-2023.", "label": 0}
{"text": "Really?", "label": 0}
{"text": "I mean… yeah but that’s a lot of Bernie", "label": 0}
{"text": "We don't disagree. The right wing isn't just the politicians, it's their puppet masters.", "label": 0}
{"text": "He couldn’t he had to go back as he ran as an independent he can’t switch parties for the rest if his term it was a special circumstance rhat he could be a dem i don’t think you get it. He won his seat as an independent he only could be a dem during his presidential run by law he had to go back to independent as that was what he was elected as for vermont. It’s not that hard to understand and he has helped dems numerous times you are looking for something to be pissed about that isn’t there.", "label": 0}
{"text": "One of the biggest heartbreaks of my life", "label": 0}
{"text": "He didn’t even win the popular vote.", "label": 0}
{"text": "That literally doesn't matter in America's system.", "label": 0}
{"text": "Until they barbecued him and he brought the sweet baby rays.  This man has no backbone. I was a huge bernie supporter until I watched him lay down and take the abuse. So sad.", "label": 0}
{"text": "He deserves rest and a life of comfort.", "label": 0}
{"text": "I could totally imagine him being well remembered in Vermont, it’s just more on a national stage I’m skeptical of him being well remembered, unless perhaps the progressive faction gets into power in like the next decade, but considering moderates can hardly win a legislative majority with progressives and independents on their side, I’m skeptical progressives can anytime soon.", "label": 0}
{"text": "I’ll never forget when she went on Maddox and I thought for a moment maybe she would endorse Bernie and then I was heartbrokenly wrong.", "label": 0}
{"text": "They couldn't see Trump coming but they saw the wave of Bernie supporters and thought that they could subvert his movement and absorb his votes.", "label": 0}
{"text": "I voted for you Bernie! I love everything you stand for", "label": 0}
{"text": "> it's proof more people voted for his opponent. i\n\nWho cares? The contest was unfair. If we play basketball and the refs beat you with hammers while I score 100 points, is saying, \"Hey, I scored 96 more points than you\" really a sentence worth putting out in the world?\n\nI've made peace with it happening. I vote blue and support the party. I'm not going to accept that it was fair or that the vote count is significant. Cheating invalidates those things and always, always will.", "label": 0}
{"text": "Interesting, basically she was about as old, little more, than current Tulsi Gabbard's age, when she turned republican but in reverse?", "label": 0}
{"text": "Yep, follow the money.  Thats all you need to know.  Every progressive group is opposed to it.  Big money Democrats like Polis endorse it.", "label": 0}
{"text": "Polis is a big money dem (see his support of for profit charter schools); Bennet is just a normal Democrat who spends alot more time in purple areas talking to people (he’s in my purple city a lot.)", "label": 0}
{"text": "She’s for some RCV.  The Colorado one is not good and there’s a reason billionaire money is behind it.", "label": 0}
{"text": "It's Hilary's fault. He had the momentum behind him not her", "label": 0}
{"text": "How’d you find this sub?", "label": 0}
{"text": "Please don’t disappoint him! 🙏", "label": 0}
{"text": "Bernie is the bomb!! Love him", "label": 0}
{"text": "He would do very well if we had ranked choice voting. However liberals are not going to waste their votes when it’s splitting up the Democratic Party in half which means it’s a guaranteed Republican win.", "label": 0}
{"text": "I believe in Bernie", "label": 0}
{"text": "As a 3rd generation vt'er...I love that man.", "label": 0}
{"text": "Exactly. We are all idiots.", "label": 0}
{"text": "I think because those are paired together in the voting reform ballot measures that are being financed by the wealthy people in the article. I don’t remember the article saying ranked choice voting helps wealthy people influence elections. It was the open primary + RCV that helped them.", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "Honestly. Tragic that the system is all about money", "label": 0}
{"text": "I voted Johnson the election prior, since Ron Paul was out.", "label": 0}
{"text": "Agreed. He’s been a team player too but that was his time to win. so many swing or trump voters would have chosen him.", "label": 0}
{"text": "Iranian coup where WE put the current regime into power \n\nOr \n\nNicaraguan where Regan helped the cocaine cartels by installing the Contras.\n\nJust two, off the top of my head....", "label": 0}
{"text": ">Just two, off the top of my head....\n\n17 hours later....uh huh.\n\nYou go on a spirit quest on the way to the replies buddy?\n\n![gif](giphy|pMePjXUqNNND2)", "label": 0}
{"text": "The democrats stole the nomination from him, and gave it to Hillary. And she lost because everyone hates her.", "label": 0}
{"text": "He'll never outperform Cheney, *look at the fallout we're still dealing with!*", "label": 0}
{"text": "535 to be exact", "label": 0}
{"text": "Funny enough his biggest campaign drawbacks will ensure Kucinich is remembered. History books love their odd little footnote factoids.\n\nHe'll be remembered as \"that one vegan candidate\" and probably have a caricature of his legs replaced with celery sticks", "label": 0}
{"text": "Honestly 2020 was the shot. I haven't been the same since Super Tuesday", "label": 0}
{"text": "I’m voting for your (and mine, and my family’s) best interests today. Everyone I love is as well.", "label": 0}
{"text": "Same brother", "label": 0}
{"text": "Him possibly picking 4 SC judges would’ve changed a lot lol \n\nA better Covid response", "label": 0}
{"text": "Can you imagine if we stopped making these lame ass posts about what if we had Bernie today? What about Mickey mouse? What if we had Ariel, The Little mermaid? What if we had Tom Hanks? You know I could really go for some Karlach too.", "label": 0}
{"text": "No way that backlash would have the backing of the majority of Trump's base - sure the establishment would go scorched earth, but once Bernie's policies started affecting working class people for the better, there would be no going back.\n\nThat's why the establishment fought so hard to stop it from happening.", "label": 0}
{"text": "Doesn't help she spun her endorsements that way. Her entire campaign misread the shifting tides from day 1.\n\nEven Bill knew thanks to the fallout from NAFTA and the upcoming TPP populism was on the rise, just that \"the experts\" (that he appointed two decades ago mind you!) were all ignoring him\n\nIt's a shame that his speeches aren't as well archived as Hillary's from then, because if *he* was running for his third term against Trump, he would have blown out his old record. He was also the only surrogate making blue collar stops, a few reporters that noticed called him \"the loneliest man on the trail\"\n\nReally, the fault begins way before we were even born. Instead of presidential term limits, we should have gotten congress/senatorial. Bill was willing to follow Bernie's lead, but Hillary convinced herself she was infallible and didn't need his support at all, and basically barred Bill from their campaign war room.", "label": 0}
{"text": "I still dream about it.", "label": 0}
{"text": "*The 16% of Bernouts who went to Trump were in the Rust Belt Bernie did best in, that's not insignificant*\n\nAdd in the Left-lib bronies and Gamergaters... (Recalling that the final \"Herd Census\" in 2015 listed **8 million** US bronies of 14 overall, the next largest being **Russia** so you know they got up to some shit!) Sure there's a lot of overlap, *but not 100%*", "label": 0}
{"text": "I think about this all the time.", "label": 0}
{"text": "Even worse was that they forced Klobuchar out. Biden **was still** seen as \"more of the same/a continuation of Obama\" so his reception was pretty lukewarm.\n\nWe would have gotten much better debates about policy if it was those two. Amy had more momentum *simply from not being Biden* even if they had many similar policies. It would have been a \"stand on your own merits\" sort of thing, instead of loyalist vs loyalist.\n\nJoe is *very very lucky* covid happened because I think that is all that saved him", "label": 0}
{"text": "I was part of the 2016 problem. I wrote him in instead of just sucking it up and voting for Hillary. Not since. But he is the president this country doesn’t deserve.", "label": 0}
{"text": "More importantly, *he actually showed he cares about the miners* and other \"working stiffs\"\n\nAll the places she lost bigly in were \"blue dog\" areas that he was performing well in. People need to remember *the base doesn't decide the election* so it doesn't make sense to do more than remind them it's coming up. You want **new** or **the disenfranchised** of which he attracted both", "label": 0}
{"text": "You elect one xenophobic crook and every xenophobe and crook comes out of the woodwork to show their support for our wonderful dictator. This is exactly why money should have nothing to do with politics.", "label": 0}
{"text": "Are you voting today?  I can't decide if I even care enough to cast a protest vote at this point.", "label": 0}
{"text": "Yup and hard to change the status quo on top…", "label": 0}
{"text": "I certainly like to think so", "label": 0}
{"text": "Wow that's wild. What's it like being a Bernie supporter in the South?", "label": 0}
{"text": "It's almost like one of these was actually a presidential candidate", "label": 0}
{"text": "Ooof I'm sorry about that. We're out here for you, brother", "label": 0}
{"text": "You are probably a lot younger and healthier than me.  I don't have time anymore for \"steps\".  I'm glad to hear he's had so much impact, when my insurance just kicked me off my biologic I have successfully taken for 15 years for Ankylosing Spondylitis and my enzyme I take with every meal because of chronic pancreatitis because they want me to take cheaper alternatives.  You keep believing too, until you feel like an old dog that's been kicked too much!  I DON'T BELIEVE IN THIS NATION ANYMORE!", "label": 0}
{"text": "Don't get started on alternate timelines.. what would the country look like if it wasn't for a Cigar", "label": 0}
{"text": "The dnc rigged the primaries in 2016 to block Bernie. Not only Bernie but they blocked the grass roots movement in favor of the establishment. Since then they have doubled down time and time again. If the Dems had a leader like Bernie running the show I’d still be registered democrat, and so would tulsi, and countless other voters. It’s a shame really what has happened to the democratic party since 2016", "label": 0}
{"text": "You weren’t part of the problem. The dnc is the problem. When their voters get unhappy with their corruption, it’s not the fault of the voters", "label": 0}
{"text": "Can you imagine if we actually had candidates and political parties that cared about anything but money and power?", "label": 0}
{"text": "Lol.  You got your answer when I was having my first shit of the day.  You're so special I made you a present, but I accidentally flushed it.", "label": 0}
{"text": ">You got your answer when\n\nYet you felt the need to keep replying?\n\nYou weren't even the original person who asked the initial question. Lol must've struck a nerve eh?\n\nThis was fun.\n\n![gif](giphy|12AB7ELvP6cpjy|downsized)", "label": 0}
{"text": "As a guy hitting 50, the more you think of this country as an oligarchy, the more it makes sense why big policy shift won’t happen. There’s a ton of money being thrown in to make things status quo. It’s just the sad reality.  Until people wake up and unified all we’re just looking at “baby steps.”", "label": 0}
{"text": "No. I cannot imagine that. We're talking about human beings here.", "label": 0}
{"text": "Never had a snowball's chance in hell. You saw it with your own eyes, yay! Believe it. We got Hillary Clinton.", "label": 0}
{"text": "Yeah u might be right \n\nMan i wish we could have found out", "label": 0}
{"text": "Or just wait to die as I am.", "label": 0}
{"text": "Even on the primaries?", "label": 0}
{"text": "He would not have backed out of the WHO, so potentially Covid wouldn't have been a big deal in this country (like ebola)", "label": 0}
{"text": "Unfortunately, the Alabama Democratic Party has become a parody mirror image of the MAGAs.  It is run by racists who only field candidates in majority black districts.  They even horribly attacked our former Senator Doug Jones.  Look into it if you want to see how disgusting it's become!", "label": 0}
{"text": "I voted for Dr. Stein, by the way.  I marked her on the ballot, scanned it, and left.", "label": 0}
{"text": "The same people that refused to make him the nomination are running the nation as we speak, and trying to convince you that Trump is a threat as well.  \n\nWhen the media tell you not to like someone, you should really try to find out why.  I'm a huge Bernie guy, but I'm voting Trump this time around...", "label": 0}
{"text": "I am so sorry this has happened in your state.", "label": 0}
{"text": "Our kids would be smarter and better taken care of, our women would still have all their rights, corporations wouldnt be allowed to buy homes, homelessness would be better addressed, our relationships with our allies would be stronger knowing we didnt elect a damn fool.", "label": 0}
{"text": "Yeah, the politicians here in Canada keep trying to become more like American politicians, while he's going the other way.", "label": 0}
{"text": "Imagine thinking that any American party is \"left\" enough. There was never a place for Bernie, all it took was people dangling the boogeyman of \"socialism\" to scare his general support away.\n\n\nHe can't beat ignorance. ", "label": 0}
{"text": "They made their bed, time to sit in it.  Democratic Party isn’t interested in protecting democracy and made it abundantly clear they don’t want my vote. Time to spoil.", "label": 0}
{"text": "We would not have the shit in Gaza if Bernie had been elected.", "label": 0}
{"text": "> This right here. This one is primarily bankrolled by a CO billionaire (Kent Thiry) who has been trying to buy elections in this state for a while.\n\nI mean, we have a history of rich Senators buying the Democratic nomination after saying they wouldn't seek it and things like that, so for a lot of people it's at least a more honest version.", "label": 0}
{"text": "> It's a Netanyahu issue in the way Trump is a republican issue.\n\nThis is not only wrong, the closer analogy ('...in the way Trump is an American politics issue') still gravely ~~understates~~ misstates how much of a systemic issue this is for Israel.\n\nTo suggest otherwise is to demonstrate a profound lack of understanding in the apartheid state, and how it works.  The Police, the IDF, Academics, all of govt.  There's almost nobody that could replace Netanyahu that would steer Israel towards peace and compliance with Itl. law.  And even if you magically got someone who would do that, they would not be able to succeed because the govt would not let them.", "label": 0}
{"text": "Everyday…this has been in my head since 2016, and will be for the rest of my life.  Possibly be biggest missed opportunity for this country since the DNC screwed Henry Wallace out of the nomination.", "label": 0}
{"text": "Biden was handed the nom when he \"finally* beat Bernie - he won a state that hasn't gone Dem in the general since Jimmy Carter. Having a candidate who wins in NC is utterly useless for the Dems - all they do is pick the most conservative candidate from the Dem slate, then reject that candidate in favor of the GOP candidate. \n\nAll this asínine strategy does is contrive to put right wing candidates at the top of the ticket. Red States should have minimal input into choosing the Dem candidate.", "label": 0}
{"text": "My girlfriend just showed up with a postive pregnancy test\n\nIs this a coincidence?", "label": 0}
{"text": "Did she go to a Bernie rally in the past few weeks? \n\n\nCongrats. I have a great name idea if it's a bit", "label": 0}
{"text": "Mods are dishing out bans if you don't agree that Bernie Sanders is sexy.", "label": 0}
{"text": "Mods are dishing out bans for not strapping in.", "label": 0}
{"text": "Sorry - not quite sure what you mean?", "label": 0}
{"text": "\\# BERNIE SANDERS 2028\n\n\\# LET'S GOOOOOOOO", "label": 0}
{"text": "Will we ever have another Bernie? Is there anyone as consistent as him?", "label": 0}
{"text": "im old too\n\nmy back hurts", "label": 0}
{"text": "Yas!!!!! All the way!", "label": 0}
{"text": "Getting strapped in to the strap on right now.", "label": 0}
{"text": "Her record is already shody.", "label": 0}
{"text": "Uh oh. She's actually a woman. We're screwed.", "label": 0}
{"text": "she did flip flop heavily on supporting pelosi. now it's \"evil white men\" oppose her. lot of identity politics from her in general. nobody likes that. bernie didn't do that.", "label": 0}
{"text": "We aren’t going to have elections by then the way tonight is looking", "label": 0}
{"text": "8 years of Bernie is such a lost opportunity.", "label": 0}
{"text": "bro would be 91 at the end of the term, you guys cant find anyone younger? lmao", "label": 0}
{"text": "Claudia De La Cruz", "label": 0}
{"text": "in another universe this was the end of a monumental and probably the best 8-year presidential term America has ever had", "label": 0}
{"text": "Wut?", "label": 0}
{"text": "That Super Tuesday will always live in my brain. Pete Buttplug can't be trusted ever and neither Kamala as we saw tonight and throughout Biden's term", "label": 0}
{"text": "Not in this government structure.", "label": 0}
{"text": "you talking crazy. You did the right thing back then. I voted for Claudia De La Cruz here in CA. I can't support a democratic party that has an old man with dementia in the highest office", "label": 0}
{"text": "Fire up the Fire up chainsaw!!", "label": 0}
{"text": "You're right about most except Tulsi... she might have been a grifter since the beginning", "label": 0}
{"text": "If Bernie Sanders had won the presidency in 2016, the political landscape in the United States would have likely shifted significantly toward progressive policies. His administration might have pushed for sweeping reforms like Medicare for All, free public college tuition, and aggressive measures to combat climate change, such as the Green New Deal. The Democratic Party could have undergone a dramatic transformation, moving further left and invigorating a new generation of activists and voters. Economic policies aimed at reducing wealth inequality and reigning in corporate power would have faced fierce opposition from Republicans and establishment Democrats, likely resulting in legislative gridlock or intense political battles. Internationally, Sanders' non-interventionist approach and focus on human rights could have reshaped U.S. foreign policy, impacting relationships with allies and adversaries alike. The populist energy that fueled his campaign might have changed the trajectory of American politics, perhaps blunting the rise of Trumpism or at least shifting the terms of the national debate.", "label": 0}
{"text": "I LOVE BURNIE BUT AN 87 YEAR OLD PRESIDENT REALLY ISNT IDEAL", "label": 0}
{"text": "Let alone if he is still alive", "label": 0}
{"text": "he has no intentions of doing that", "label": 0}
{"text": "this couldve been an election for his 2nd term :( he had a really good shot in 2020", "label": 0}
{"text": "Username checks out 😂", "label": 0}
{"text": "NARDO", "label": 0}
{"text": "I wonder where we would be if the DNC didn’t collude to stop him in 2020", "label": 0}
{"text": "Absolutely, and the corporate Democrats couldn't allow that to happen", "label": 0}
{"text": "What a G", "label": 0}
{"text": "I’m very upset she wasnt on my ballot.", "label": 0}
{"text": "Bernie is also a cute girl name!", "label": 0}
{"text": "Sorry to hear that.", "label": 0}
{"text": "This post brought to you by Hannah Einbinder.", "label": 0}
{"text": "But it was Hillary's turn", "label": 0}
{"text": "she's been subjugated. but is still given freedom to shit on white men at her leisure. i don't like where the democratic party is going. only reason joe won was because clyburn giving that god bless speech on the selma bridge to old black folk. \n\ni'm white. i love everybody. i'm not evil. i don't appreciate being lumped in with those mother fuckers because i didn't go to college. i don't think we should talk about people in blanket statements like that, ever.\n\nbernie never did. it's why he killed at the town halls on fox. \n\naoc is a faker. she got into some power now and started licking boots. bernie never licked *no boots*.", "label": 0}
{"text": "until she straight out supported her to be contradictory because 'evil white men'.  that is fucked up. i do not want anybody in power that votes based on the race/gender of the people that voted no or yes.", "label": 0}
{"text": "You can thank the DNC for that, specifically if you’re a New York voter", "label": 0}
{"text": "lol he's still got it", "label": 0}
{"text": "The ghost of Eugene Debs. I don't know much about necromancy, but he's at the top of the list!", "label": 0}
{"text": "I mean if Hillary didnt take the nomination— do we think trump wouldve be thwarted? The biggest what if of my lifetime", "label": 0}
{"text": "Yea", "label": 0}
{"text": "No way, blue can't get anything done. Obama was the last great thing blue had and they've been choking since", "label": 0}
{"text": "Trump is very thankful for your help winning! You guys can’t even rally behind AOC", "label": 0}
{"text": "As long as we have Bernie, there's still hope.", "label": 0}
{"text": "Thanks for that, dems. Really love how you went against the will of your constituents and manipulated Hilary into winning the primary.", "label": 0}
{"text": "Yeah because the DNC constantly ignores the will of the people. I don't feel like we've truly picked our own candidate for president since we picked Obama in 2008.", "label": 0}
{"text": "Or 2016", "label": 0}
{"text": "DNC and neoliberals cost us a Bernie 2016/2020 and an AOC 2024 💀😒 and it still drives me nuts", "label": 0}
{"text": "I remember being excited for a Bernie Sanders & Tulsi Gabbard ticket. How wrong I was about her!", "label": 0}
{"text": "Sherrod Brown is probably more realistic, if it weren't for his pro-israel side coming out strongly recently then honestly it could have been John Fetterman", "label": 0}
{"text": "But it was Hillary's turn !", "label": 0}
{"text": "SUBSCRIBE!", "label": 0}
{"text": "The president we should have had all along. Sadly I don’t think he will ever get the chance he so rightfully deserves.", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "Nah this country is fucked, and never deserved him.", "label": 0}
{"text": "literally impossible to do worse than Kamala", "label": 0}
{"text": "You guys might not want to hear this but the best possibility we may have to get progressive policies passed is through JD Vance. Go watch his interviews, like the interview with Joe Rogan . Read his book! He's not far right on economic issues and it's likely he'll be Trump's successor. I would love to vote for a sanders over Vance but Bernie won't run again and even if he did the democrats would rig it again .", "label": 0}
{"text": "And how could I get to this alt universe please?", "label": 0}
{"text": "The problem with that is that boomers are doing their best to take us all with them", "label": 0}
{"text": "Time machine", "label": 0}
{"text": "![gif](giphy|l1IYaUbufpd3EYMlG)", "label": 0}
{"text": "Then by gaslighting Dems through the primary window.\nNot a democratic bone in the Dem leadership. Oligarchs talk and everyone else goes home.", "label": 0}
{"text": "No, but a 90 year old might be pushing it.", "label": 0}
{"text": "American politics is dead. The people don't want policy or good governance, they want a narrative to cling to. They don't care.", "label": 0}
{"text": "Hillary will come back just to shoot him in the back again", "label": 0}
{"text": "Clone him", "label": 0}
{"text": "Trump already said there won’t be anymore elections, so nice try but we are too fucked to matter now", "label": 0}
{"text": "DNC will stop Bernie every centimetre of that path.", "label": 0}
{"text": "I think we've established that people in this country would rather hate than care. ", "label": 0}
{"text": "Fuck the Democratic party. We need a new party that isn't braindead and bought off by corporate interests.", "label": 0}
{"text": "Flatlander who thinks Malloy is governor apparently. Ignore him and move on", "label": 0}
{"text": "I really just want the nice humble man to enjoy the few years he has left. He’s been working hard and getting shit on his entire life", "label": 0}
{"text": "Shawn Fain", "label": 0}
{"text": "People’s Party of America\n\n“People over profits.”\n\nJust need some serious champions to bring it to life.", "label": 0}
{"text": "Should've been him in 2016. But it's too late for Bernie now. He's done his part. It's up to us now. \n\nNot him, us.", "label": 0}
{"text": "You might be referring to the GOP who is literally that.", "label": 0}
{"text": "They are literally the corporate interests.", "label": 0}
{"text": "Whether everything on the list is true or not, these are the biggest issues seen by right leaning voters and mostly went unaddressed.", "label": 0}
{"text": "In a perfect world, our representatives don't have an opinion either way, they follow constituency. But also, in a perfect world, my wife's cousin, who is a judge, doesn't vote for a 30+ times felon.", "label": 0}
{"text": "wtf are you talking about, she has already caved in situations he didn’t at her age", "label": 0}
{"text": "Its true in the fact of these are the things people are unhappy about and common complaints. These are things democrats usually dont see.", "label": 0}
{"text": "Honestly. Democrats didn’t choose Biden, they folded the entire party behind him to stop Bernie. Democrats didn’t choose Kamala, Biden folded into her nomination. \n\nNext time if democrats don’t allow us to make our choice the Democratic Party will be the one to fold.", "label": 0}
{"text": "Locations were started under Trump, and the vaccines were all funded and developed under Trump using Trump money. Plus, the majority don't have a problem with the vaccine mandated. You're just wrong on these points", "label": 0}
{"text": "The Obamas speeches directed towards black men flabbergasted all the black men I know, and Harris' bullshit 'Black Male Agenda' (when there is already one out there written by black male PhD's, lawyers, economists) was plain insulting.", "label": 0}
{"text": "Basically we were screwed either way.", "label": 0}
{"text": "Did i say a majority? Also i cant be wrong when this is a common criticism towards the Dem party that people have. People were absolutely unhappy about the “ mandating” of the vaccine.", "label": 0}
{"text": "Another piece of good news: one more day less until the Dimbass in Chief gets jailed, dies of a cheeseburger heart attack, and then gets thrown into eternal damnation along with his fascist friend from the last century.", "label": 0}
{"text": "Majority is what decides elections. Mandated vaccines ain't what turned states red in this election \n\nDon't waste time on the small thing. The election mostly comes down to the economy (how much money im making, and how much things cost),  which the dems did little to focus on. \n\nHell, the #1 top issye among registered Dems here in my areas was \"Pritecting Democracy \", and it's fucking irritating how out of touch the Dems and the militant supporters are", "label": 0}
{"text": "And they thought pulling out the Cheney card would work ? Cheney is the Trump if the 2000s. Thats like the Dems pulling out Trump in 2032 to say how bad JD Vance is.\n\nWhat a batshit crazy, baffling move. All it did was discourage the Blue Vote and energize the Red Vote", "label": 0}
{"text": "It was a sea change, and most of the guys I know *still* voted for her. It was a struggle, tho", "label": 0}
{"text": "What if, instead, the democrats moved further to the right again and alienated their base and offered no solutions to what ails most people? \n\n/S if that wasn't obvious!", "label": 0}
{"text": "If this was a factor, it would've showed in 2022, not just now in 2024. 2022 was a very good year for Dems.", "label": 0}
{"text": "I can’t help but think back to when Bernie won the Nevada primary with roaring support, only to be sidelined by the establishment democrats and the\nmedia. With Bernie having the biggest tent of voters, I’ll never understand how Hillary was chosen. \n\nNow look where that’s got us.", "label": 0}
{"text": "At that time, I think people thought the Democrats had a plan and were more reasonable. And then they found out they weren’t. Also, the media suppression and attacks on Trump turned people away that were previously on the side of the mandates and lockdowns. And I think it was a factor in both elections just a more minor factor. People think Biden and Kamal fumbled the bag and now they want a new option", "label": 0}
{"text": "Y’all need to stop trying to get people 65+ in office.", "label": 0}
{"text": "Please stop.  Be honest with yourself. Bernie, a socialist, would not have fared any better, and likely much worse. In order to win you need to convince the people in the middle, the soft republicans… something impossible with someone as progressive as Sanders.", "label": 0}
{"text": "How is that fucked up? Thats just politics. For me, flip flopping is about policy positions", "label": 0}
{"text": "Might be unpopular here, but AOC can’t win the presidency, at least not any time soon", "label": 0}
{"text": "Check out Vermont's Rep Becca Balint, who will almost certainly be his Senate successor. She is dynamite.", "label": 0}
{"text": "Who will be running in 2028? The Dems have nobody appealing.", "label": 0}
{"text": "Only unpopular bc it’s true. I’m not sure we’d vote for any woman at this point.", "label": 0}
{"text": "That's why they called this one at like 38% of the popular vote being in.", "label": 0}
{"text": "It’s not worth anything but we can take solace in being right the whole time", "label": 0}
{"text": "And .... Liz Cheney Tweeted out this morning for Dems and supporters to accept the election results. I'm fucking dieing 🤣", "label": 0}
{"text": "your position on the speaker of the house is a policy position. it's like, literally, a determining factor, of literally *all* your policy positions if you're in the house.", "label": 0}
{"text": "I've felt this way since 2016 and 2020 cemented it. I hoped 2016 would be the DNC's watershed introspection moment and they didn't learn a damn thing and decided that token \"resistance\" and punching left would be sufficient to secure enough middle support to win elections. It worked in 2020 following a disastrous COVID response, but with Americans' goldfish memory it wasn't enough in 2024. \n\nI have no idea where we go from here. The DNC is so dominated by the aging party elite and corporate interests, and I'm worried people like AOC have been so demonized by the right that any election with her as a candidate (as an example) will just be another bloodbath.\n\nThe DNC needs to see this as nothing less than a complete loss and rebuild accordingly if we want a shot at a Democratic president in our lifetimes.", "label": 0}
{"text": "Really glad the Democratic stronghold of  *checks notes*  **South Carolina** killed Bernie’s campaign in 2019.", "label": 0}
{"text": "DNC hates Bernie. They hate how right he is about the corrupt state of affairs in the USA. I fully believe he wouldve won this election based on his core values and intelligence. Kamala was way too indecisive with her viewpoints & where she stood which turned people away. Bernie’s stances on Israel/Ukraine, abortion, & healthcare wouldve gone those people back. DNC fumbled this election HARD", "label": 0}
{"text": "Other subs full of people saying the democrats went too far left. The overton window is some insane shit lol, people have zero awareness.", "label": 0}
{"text": "What if we put his head in one of those jars from futurama", "label": 0}
{"text": "usa is definitely getting it with a strap on now", "label": 0}
{"text": "We did. His name was fucking Bernie Sanders and it was not overwhelming. \n\nYou see how America voted today? They voted way more right.  \n\nBernie had momentum in 2016 and lost it in 2020.", "label": 0}
{"text": "You say this but he’s more mentally stable than majority of the politicians now", "label": 0}
{"text": "I thing the general republican policies are inherently appealing to them. But no, I don’t think politicians know how to reach them.", "label": 0}
{"text": "How many hoops did the Dems just jump through to *AVOID* an actual primary? There won’t be a progressive at the head of the party for another 50 years at least.", "label": 0}
{"text": "The second largest voting group, and they don't know how to reach out to them. Goddamn.", "label": 0}
{"text": "I have conversations about this sometimes. Both parties worry so much about the black vote but in reality its 10-13% of the population but latino is at a strong 19%. I think the race pandering is childish anyway.", "label": 0}
{"text": "Its not race pandering, it's reaching out to the groups you want the support of. Jewish voters will absolutely get what they ask for, if you want their vote. The black vote has long, perhaps too long, been a guarantee, and in a republic democracy, that isnt how it is supposed to work.\n\nI know exactly the kind of agenda I want supported for my community, and vote for the people that advocate for it. In fact, I helped put one together, albeit a small voice.", "label": 0}
{"text": "https://preview.redd.it/cdl2wbcsvazd1.jpeg?width=210&format=pjpg&auto=webp&s=fbaa2d2419a08b8eecd0b68794f1acbddd408408", "label": 0}
{"text": "Well the pandering part is saying that is saying if this group wins your life will be harder with no facts. Especially when each party switches every 8 years basically", "label": 0}
{"text": "Are you trying to say Bernie bad or South Carolina bad? I don't see your point.", "label": 0}
{"text": "Honestly....why wasn't it bernie. Hillary....Biden...Jesus.", "label": 0}
{"text": "Bernie was progressive as fuck and did better with independents and even conservatives than Kamala could ever dream of. The issue is that moving further right alienates your own party’s voters.\n\nBaffling that after two Trump wins you still don’t get it.", "label": 0}
{"text": "Yep. The democrats delivered us another trump presidency on a silver platter. The democratic party has been fucking cooked ever since they shoved Hillary on us and did everything they could to not allow Bernie a shot. \n\nThey thought the exact same strategy would work 8 years later? Fuckin incompetent. Every democratic voter shouldn't be mad at other voters, but at their party who has abjectly failed them yet again.", "label": 0}
{"text": "They built a platform that basically appeals to no person. The median voter doesn't exist. Instead of standing on some principle and acting consistently on that, the only thing they did successfully was piss off anyone that would've otherwise voted, and people who felt left out, mainly men. It wasn't even white men this time, Latino and black men also have warmed up to Trump.\n\nSay what you want about the GOP. They're awful. They're obnoxious. They will bring pain to a lot of people. But at least they're consistent. They believe what they're selling, and they know what they are selling, even if it's snake oil. The Dems aren't selling anything, and they certainly don't believe in it.", "label": 0}
{"text": "I honestly think about how much the world would have changed if Bernie was the Democratic nominee in 2016", "label": 0}
{"text": "The South Carolina primary effectively ended Sanders run in 2020. The irony is that SC is a deep red state.", "label": 0}
{"text": "1. It honestly isn't that hard to be right the whole time.  Humans have basic needs.  We all need medical care, infrastructure, and some sort of education.  War is bad.  Etc.  We just get gaslit by the billionaire-owned media propaganda machine nonstop, bc the things that are great for 99.999% of us are less good for like .001% of the population... that .001% just controls way too many resources.\n\n2. It feels more like taking crazy pills to watch obviously dumb shit happen.  Like when we invaded Iraq.  That was obviously dumb as fuck, even at the time.  But like 80% of Americans have been propagandaized into saying \"Fuck yeah!!\"  Frustrating.", "label": 0}
{"text": "Im down giving a shit about the environment and the future, for equal rights fuck it. Most human are dumb and only care about what affects them. Evil always triumphs over good ", "label": 0}
{"text": "The traditional logic is like this: Republicans get paid to win, Democrats get paid to lose. They're losers because that's the role they are supposed to play. It keeps the minorities and progressives under control. I mean come on. . . Joe Biden? I dutifully voted for the guy because \"vote Blue no matter who\" but here we are. . . I despised that old bastards anyway. He spent his career trying to one-up anyone who wasn't a complete fascist for the War on Drugs. Joe Biden actually called George H. W. Bush \"soft on drugs\" in 1991. This is the Democrat candidate? I despised him but put my feelings aside and voted for him and he ran out the clock playing his games enjoying \"his turn\" to sit in the Oval Office and here we are. I hope he enjoyed having fun in the White House. That was quite an expensive gift he gave himself. I really hope he had a nice time.", "label": 0}
{"text": "When he's 88? I love the guy but pass.", "label": 0}
{"text": "Thanks for writing that- democrats had a chance in 2016 with Bernie- Bernie would have beat Trump in a landslide. And now here we are- question will we the people be able to gain control over the oligarchs.", "label": 0}
{"text": "Bernie lead against trump in so many polls as well but corruption is rampant even in the DNC", "label": 0}
{"text": "Boggles my mind that people are surprised by the result. Handpicked candidates that don’t fairly win primaries have been shown to be losers.", "label": 0}
{"text": "While this was a terrible idea, it didn't lose her the election. She lost because two groups who voted for Biden in 2020 stayed home this election: Latinos and white suburban men.\n\nIt's almost like America has a racism and sexism problem.", "label": 0}
{"text": "And trans stuff. I know a first time voter who voted for Trump because he’s worried about kids being made trans.", "label": 0}
{"text": "Everything can be traced back to Hillary. The entire Trump monster could’ve been stopped if Hillary had done almost anything differently.", "label": 0}
{"text": "Bernie would’ve won in 2016. Once the right wing media machine got a hold of him knowing he would run again in 2020 his shot was gone.", "label": 0}
{"text": "This is the exact kind of thing Democrats deny is real. This is why they lost.", "label": 0}
{"text": "Democrats haven’t run on the prospect of change since 2008. Trump won this election because he won the millions of americans which are fed up of this system and want things to change, and the democrats have been awfull at convincing them they were the ones that would implement this change (which they weren’t anyway, they just weren’t gonna make it worse like Trump is about to).", "label": 0}
{"text": "Latinos didn’t « not turn out », they did, they just voted for Trump way more than they usually do. The fact that the democrats have to rely on these people because they’ve abandonned the prospect of getting white working class to vote for them is the issue. White working class have way more in common with latino and black working class than white billionaires, but for some reason the democrats have given up on the idea of convincing them they do.", "label": 0}
{"text": "Agree, I think you have to be pretty dense not to see this. Every election since 2000, with the exception of maybe 2004, has been a change election. It's the consequence of a continuously degrading quality of life for the working class. Of course people want change! A bag of groceries is $120. Wages are stagnant. The minimum wage hasn't gone up in ages. 60% live paycheck to paycheck. 57% don't have $1,000 in savings. The working class is trapped fighting so many uphill battles.", "label": 0}
{"text": "We were a bush-endorsement shy of victory!!! If we secure endorsements from romney AND bush in 2028? Well lets just say …. the republican party had better watch its back 😈", "label": 0}
{"text": "DNC would rather have trump in power than let Bernie win.", "label": 0}
{"text": "You can thank billionaire Bloomberg for entering the 2020 primary race and detailing Bernie in South Carolina.", "label": 0}
{"text": "Louder for the folks at the back.", "label": 0}
{"text": "It should’ve been Gore", "label": 0}
{"text": "So infuriating, they spit in our face time and time again then want our support. Dems gotta quit being “better” than white and working class voters. You can’t insult people who didn’t go to college", "label": 0}
{"text": "A better place", "label": 0}
{"text": "I also like pointing out to folk that it was her campaign's strategy to boost Trump in the media to help him win the GOP nomination as he was seen as easily beatable. The same shitty tactic they are trying in other races. The dems will learn nothing and the GOP will continue to worsen. America is pretty much gone, it is owned by the wealthy and until people are willing to sacrifice everything to stop it, this will be the path we head down from here on.", "label": 0}
{"text": "While I wouldn’t say 2020 was rigged, they definitely pulled out all the tricks to beat Bernie. They flooded the primary to increase their chances of picking the right anti-Bernie candidate and they had guys like mayor Pete declare early victory in Iowa", "label": 0}
{"text": "So will you be going to Switzerland or Mexico?", "label": 0}
{"text": "I think he still had a good shot in 2020. Remember his town hall on fox news was resonating with republicans and received positive attention. The DNC colluded with the other candidates to help prevent Bernie from becoming the nominee. They will not give up their big money donations and big money, whether red or blue does not want to pay more in taxes.", "label": 0}
{"text": "The DNC is clearly unfit to oppose this right-wing movement in any meaningful way, & needs to be destroyed so something new can rise out of its ashes. They were basically Republicans who like gay people, & that's not enough when everyday people are struggling.", "label": 0}
{"text": "Sanders connected with the working class that would had voted republican.", "label": 0}
{"text": "Agreed and they need better communications out to people. Harris dumped so much money on swing states and it did nothing", "label": 0}
{"text": "He was telling me he saw something about how like 25% of kids today are going to be trans or something. I tried to disprove it, but don’t think I was successful", "label": 0}
{"text": "We'll get Trumps endorsement in 2032 when the dems run against JD Vance and co !", "label": 0}
{"text": "Remember Kasich delivering Ohio in 2020? We already knew this doesn’t work and they persisted.", "label": 0}
{"text": "Establishment democrats will never learn not because they’re incapable, but because there is nothing for them to learn. They didn’t do anything wrong. Keeping the left out is how they win, actually beating the GOP is just a nice-to-have.", "label": 0}
{"text": "Communication about what? That she would have a republican in her cabinet? That fracking is cool, actually? That Israel committing genocide is fine? That people should ignore their lived experience about how tight the economy really is, despite whatever bullshit metrics they spun up? \n\nThe problem was the **message**.", "label": 0}
{"text": "More people need to be introduced to the graph of left-handedness in the US. Too many forget that the current numbers are low because of how socially repressive our society is. Once we become accepting of something that was once taboo, it rises and then flattens out.", "label": 0}
{"text": "“For every blue-collar Democrat we lose in western Pennsylvania, we will pick up two moderate Republicans in the suburbs in Philadelphia, and you can repeat that in Ohio & Illinois & Wisconsin.” — Chuck Schumer in 2016\n\nAwesome strategy Dems, let’s continue doing this in 2028, 2032, 2036, and then reconvene in 2040 to check in!", "label": 0}
{"text": "They're not opposing... they are actively engendering.  \n\nIt's what their donors want.", "label": 0}
{"text": "It was the narrative that they created to give the appearance that his campaign was over. Sanders won the first 4 before that, and then lost. I don't know if that's ever happened before.", "label": 0}
{"text": "Always.", "label": 0}
{"text": "💯", "label": 0}
{"text": "Rare in politics.", "label": 0}
{"text": "Remember when someone asked her what the difference would be between her and Biden and this was the only thing she could come up with? ", "label": 0}
{"text": "Sad and true", "label": 0}
{"text": "They are taking zero responsibility and instead showing their ignorance and racism. \"Its Latinos/Asians/Blacks\" How about you look at her getting nearly 15 million less votes, MAYBE just MAYBE consider she wasn't liked by people, and appealing to old right wing crackpots like Bush and Cheney don't do a damn thing for a progressive agenda.", "label": 0}
{"text": "For sure we’re seeing it unfold today.", "label": 0}
{"text": "Agreed. I love the guy but let’s make sure he’s even alive in 2028 first.", "label": 0}
{"text": "💯", "label": 0}
{"text": "Pete ultimately won Iowa (remember he claimed the win before it had been properly called), but yeah Bernie was ascendant after the New England primaries, Biden was buried in NH and left to kiss Clyburn’s ring in SC before NH voted. Then suddenly after SC the media narrative was that Bernie was toast. Completely infuriating that a state with no hope of ever going blue in the general “decided” the primary and gave us the centrist we all had to settle for.\n\nThe illusion of choice.", "label": 0}
{"text": "That fucking speech makes absolutely NO fucking sense unless you look at it from the perspective that they knew even then that they were fucked, so they were setting up another set of scapegoats to shift blame to once they lost.\n\nIt's flat out false for one, African Americans have overwhelmingly been the ones bailing Democrats out every year. But going out of your way to pre-emptively demoralize one of your key demographics isn't something you do if your goal is political persuasion, rather political demonization. \"This is your fault, this is our reason not to listen to you anymore and ignore even more your needs as we migrate to the Right however we want.\"\n\nThat's why this entire campaign was all about trying to gain the approval of every goddamn Bush era Republican they could find and once again shunning those peaky Lefties for getting too uppity about Palestine. Never let them tell you that they *have* to play to the center right, no they do it because they WANT to.", "label": 0}
{"text": "My understanding is that the same Latinos who voted for him in 2020 voted for him this year—that the key difference was in turnout, not in any new Trump voters.", "label": 0}
{"text": "Exactly. All the fabricated culture war issues. As if there aren’t enough real problems…", "label": 0}
{"text": "It wasn’t a strategy the Dems are legitimately neoconservatives at this point.", "label": 0}
{"text": "> she dampened enthusiasm with her own base\n\nI don't agree, at least not to the tune of about ~15 million votes.  There can't be anywhere close to that number of people who thought staying home as a protest would work out for them.  I think there were a few reasons:\n\n\n1)  Biden didn't step aside to allow for a Democratic primary.\n\n2)  The Democrats ceded the status of the \"change\" party to the Republicans.  Kamala saying that she wouldn't do anything different than Biden was a huge blunder.\n\n3)  Failing to reach out to male youths.  Maybe that would have been too difficult considering the make up of her coalition, but it hurt her dearly.  She should have done the Joe Rogan interview.\n\n4)  Failing to take stand on Gaza was a big problem, although perhaps an unavoidable one.  It isn't clear that declaring for Palestine or Israel would have actually helped her at all.  What needed to happen was a peace deal before the election, but Biden was unable or unwilling to force that outcome.\n\n5)  And, as always, it's the economy, stupid.  Voters don't care what the stock market is doing - they care about the cost of gas and groceries.  Having the Democrats gaslight them that things are actually good was never going to work out.", "label": 0}
{"text": "These numbers are going to change but it does look like turnout was worse this year, which is wild to me.", "label": 0}
{"text": "That is so fucking crazy, why did I ever think she had a chance", "label": 0}
{"text": "It's still insane that she tweeted that shit out, bro, LMFAO\n\nLike hey guys, maybe people would take your \"we have to defeat these supervillains at all costs\" thing more seriously if you weren't always so goddamn eager to break bread with them at the drop of a hat.\n\nOh no wait, she was talking about one of the Good Ones™️ tho, right 😇, because that was their main target. That's why they wanted to impress, to be the core coalition of this election. More than ever they wanted to be Republicans, but just not the rude Trump variant of them.\n\nWell it turns out that neither fucking party wanted that, MAGA wasn't fooled and Liberals weren't being gaslit into going along with it. Great strat, guys, y'all keep listening to all those expert \"consultants\", I'm sure they'll help you win something next decade 👌", "label": 0}
{"text": "Their billionaire donors did not approve this message", "label": 0}
{"text": "It's amazing that the DNC can't comprehend that you need to give someone something to vote FOR. Not just promise to maintain the status quo and threaten them.", "label": 0}
{"text": "Remember Bloomberg (he of shifting partisan loyalties) blew $500M for his red herring primary campaign in 2020, which he ended up using solely to price Bernie off the airwaves and drown out his message. Now looks like he spend a half billion for DNC to sow the seeds of its own demise, long term.\n\nLook at SF in recent years, and the local election results from yesterday. It is a “Democrat” city but is run by oligarchs who are highly illiberal now, all of whom won by spending silly money, PACs, outside donors etc. The party has shifted ever right since Clinton and now they have no real political thesis. Why such shock? \n\nCan we have an honest post mortem this time? Dems have never done a real strategic overhaul in my lifetime. Just different identities shopping the same warmed over neolib slop with different packaging. \n\nGiven that Bernie’s not going to run again, I hope they can get beyond their irrational hatred of him and grapple with the bigger issue ie that they really suck at this.", "label": 0}
{"text": "This.   Trump's total was about the same.   Dems' tanked.", "label": 0}
{"text": "Independents voted more than democrats this time. Sanders was big with independents, and yeah, the only candidate then who cut down Trump's support with men by a lot.", "label": 0}
{"text": "> It honestly isn't that hard to be right the whole time. Humans have basic needs. We all need medical care, infrastructure, and some sort of education. War is bad. Etc. \n\nWell said.\n\nBiden & Harris ignored the cost of living crisis until this summer. In 2022-2023, Biden was gloating about Bidenomics.\n\nAnd the campaign in the last several months lionized Liz Cheney of all people (instead of say Bernie).", "label": 0}
{"text": "\"Just one more Center Right Moderate, bro, I swear it'll work this time, the Cheneys are totally gonna be the key, bro!\"", "label": 0}
{"text": "AOC 2028 then?", "label": 0}
{"text": "At this point, it's too frustrating to take solace in that. I just would like for it to change", "label": 0}
{"text": "You got the wrong message. What is more important is learning how to cheat and get away with it. \n\nTrump had so few people showing up to his rallies. Was it less votes than 2020?\n\nThe Dems may not have run as outsiders like Obama, but they had a better track record and much more enthusiasm. \n\nHow do we beat a juggernaut like Trump who says stupid things, insults black reporters, and had felony convictions?\n\nAmerica is either full of stupid fascists or something stinks. \n\nOh yeah, and our new leader has an odor problem. So should the next candidate smear themselves with poo? Is that the lesson?", "label": 0}
{"text": "The DNC is owned by billionaires, they would literally rather republicans win than a populist / socialist left wing candidate win. \n\nThey pulled out all the stops for Hillary to sabotage Sanders, then same thing again with Biden vs Sanders.", "label": 0}
{"text": "God painfully fucking true. At the end of the day they are bought and paid for by corporations. Bernie is for the people - he never stood a chance. And the DNC deserves their own ruin.", "label": 0}
{"text": "She lost because she was a fucking hardass prosecutor trying to court the votes of poor and minorities. Anyone who has ever lived outside of a wealthy community would know it was a stupid idea.", "label": 0}
{"text": "It makes sense. Biden was coming off of a terrible 4 years of Trump so democrats were motivated to vote no matter who was on the ticket.\n\nOddly enough Kamala could have avoided being tied to the last 4 years if the Dems could stop worshipping their elites and just throw Biden under the bus. By essentially promising more of the same she instead got all the downsides of Biden running again. \n\nSo it was already an uphill battle but it was made even worse by the Dems baffling plan to court the never Trump republicans who don’t exist. No surprise that democrats just stayed home.", "label": 0}
{"text": "Also by selecting a candidate to run against Trump rather than having a primary. They just don’t seem to give a shit about democracy but love to say that democracy is going to end under Trump. They’re fucking hypocrites to be honest.", "label": 0}
{"text": "The marketing blitz I received on my radio stations and TV seemed over the top. I have to wonder if they missed the mark on who they needed to reach.", "label": 0}
{"text": "Where's another Roosevelt when you need one?", "label": 0}
{"text": "The problem was democrats didn’t turn out to vote, so no exit poll is capturing the non-voters. Of course that would be the sentiment when you ask the right-wingers who did turn out. We should instead be asking why 15M Biden voters sat out this election.", "label": 0}
{"text": "They'll learn that being \"left\" doesn't work so they'll move right.", "label": 0}
{"text": "CNN exit polls have Trump and Harris at a tie with non-first time voters. Trump won because, for the first time since Reagan’s 1984 landslide, first time voters have went to the republicans.", "label": 0}
{"text": "I mean ok, but now instead, you have the person who will give them free reign to kill? How does that make sense?", "label": 0}
{"text": "Lost it? No it was taken from him.", "label": 0}
{"text": "Nah let’s watch Dems continue doing this in 2028, 2032, 2036, and then reconvene in 2040 to check in!", "label": 0}
{"text": "Honestly if this isn’t the straw that causes the Democratic party to fold, I don’t know what will. Clearly the rich people and career politicians heading the DNC don’t have a prayer of a clue what the liberal side of the spectrum wants in a candidate because they are more focused on being center to center right. They’re too busy thinking in the binary which dismisses a whole part of their side they’re forgetting about. They’re not even aiming for the undecided voter, they’re trying to poach Republicans because that’s all that’s left for them.", "label": 0}
{"text": "Do some more voter blaming, that has worked out so well for you in the past.", "label": 0}
{"text": "Single issue voters. Fantastic.", "label": 0}
{"text": "Americans voted for a change. And since democrats have decided to run on status-quo, they went to the candidate that was promising them that immigration control was the key to better living conditions. It’s like poor people that play the lottery: they know they aren’t going to become rich, but they hang on to the hope because it’s either that or accepting you’re never going to have a better situation. The democrats have abandonned them because they thought winning minorities would be easier: turns out it isn’t, and being black/latino doesn’t make you immune to inflation, high rents and unaffordable healthcare, it actually makes you even more vulnerable.", "label": 0}
{"text": "I can buy this theory. Would be interesting to know why exactly they didn't turn out. I'm guessing just disillusioned from inflation and no policy proposals would have fixed it. Maybe running an Obama like candidate to enthuse people but I'm just shooting in the dark.", "label": 0}
{"text": "Really am not trying to voter blame, just saying what we get is objectively worse", "label": 0}
{"text": "It is. And the fault lies entirely at the feet of the Democratic Party, because they weren’t willing to compromise on enforcing genocide. They chose to lose this election.", "label": 0}
{"text": "The Democratic apparatus would rather nominate Mitt Romney in the next cycle than Bernie Sanders.", "label": 0}
{"text": "This election was easily winnable if Harris & Biden had embraced economic populism & not ignored the cost of living crisis for years.", "label": 0}
{"text": "DNC establishment didn’t learn from 2016… oops…", "label": 0}
{"text": "Describing an ongoing genocide as a “single issue” scratch a liberal", "label": 0}
{"text": "Which one are you pretending to care about?", "label": 0}
{"text": "the Latinos who fled aren't into Bernie. the working class who fled aren't into Bernie. The Bros aren't into Bernie. All 3 groups would flee him more than they did Kamala. This comment is delusional.", "label": 0}
{"text": "Weird way to admit it, but go off.", "label": 0}
{"text": "No one is refuting there’s a genocide going on. There’s also plenty of people suffering and dying right here in the US that will now suffer more let alone the further instability this will add to geopolitics.", "label": 0}
{"text": "You're in denial. I hope you look inward and find peace.", "label": 0}
{"text": "What do ya know, when you actually stand for something, people respect you!", "label": 0}
{"text": "Bernie has consistently stayed focused on economic equity and well-being. The Dems don’t understand this because so many of their leaders are affluent with advanced degrees. The party is lucky he ever worked on their behalf.", "label": 0}
{"text": "AI slop detected", "label": 0}
{"text": "So nuts they all decided to quit on the same weekend. Except the other progressive in the race. Fuck the DNC and all the establishment meddling from Obama and others.", "label": 0}
{"text": "It doesn't. But as long as you can virtue signal and say you're better than those that surrendered by voting for the lesser evil nothing matters I guess", "label": 0}
{"text": "Or, if we enforced the rules we pretend to have instead of the rules corporations have set. \n\nThis election is 100% the result of corporate interference and intertwining with your governance. It’s not a far fall from fascism to naziism, and we’ve been a fascist nation for a long time.", "label": 0}
{"text": "Every major elections the democrats have won since the begining of the century has been on a progressive agenda (even Biden’s 2020 program was pretty left wing compared to what we usually are offered, Covid checks, a first glimpse of medicine prices regulation, open support to unions). But they keep thinking promoting a moderate agenda is the key to victory, while the republicans put out a far-right crook and still end up winning.", "label": 0}
{"text": "2020 also had record turnout, there was no Covid crisis to motivate people.", "label": 0}
{"text": "i'm perplexed as to why this was downvoted. we have the technology", "label": 0}
{"text": "Don’t even compare Bernie and Kamala", "label": 0}
{"text": "Amen.", "label": 0}
{"text": "Some voters thought that facilitating a slaughter in Gaza shouldn't go unpunished electorally. Some had family members killed and were seeing their country get flattened by bombs and couldn't bear voting for the government that was sending Israel the weapons. I don't blame them. It's on Biden and Harris that many couldn't even imagine or care about a worse situation than the current hell. Not doing anything was a political choice, not a necessity. They reaped what they sowed.", "label": 0}
{"text": "Can't be Bernie in 2028 but he can spend  those same energies and his immense resources preparing the next generation of leaders!", "label": 0}
{"text": "You're telling me that [getting chummy with the Cheneys was a bad idea?](https://www.youtube.com/live/REpv8zUolKI?t=11542s)", "label": 0}
{"text": "The \"I don't know where I am\" vote already went to Trump -- how do we chase that with enough campaigning? We don't. We lost the idiots to the Media.", "label": 0}
{"text": ">oddly enough 15 million Democrats decided just to not vote at all. Who could have seen that coming? \n\nCorrelation is not causation.", "label": 0}
{"text": "This 20/20 hindsight when the game is rigged is so tiresome.\n\nEither Americans would NOT vote for their best interests or the game is rigged. The media won't let us have nice things. That's it.", "label": 0}
{"text": "Also people were literally dropping dead from Covid, it was a national emergency.", "label": 0}
{"text": "Shoutout to BreakingPoints. So glad these guys went independent.", "label": 0}
{"text": "I love how this keeps coming up. Like, instead of blaming a specific person holding tight to a specific agenda that was shoved down our throats by the DNC without a primary, we're just saying the electorate itself is trash.\n\nBoth things are true my guy.", "label": 0}
{"text": "If the Democrats actually listened to Bernie, we would be in a different, much better timeline.", "label": 0}
{"text": "Wait why can't it be Bernie? Genuinely curious and I don't know.", "label": 0}
{"text": "[Lieutenant Chad ](https://www.imdb.com/name/nm0818880/?ref_=tt_ch): Why did 15 million Democrats stay home? No reason. In the Steven Spielberg movie \"E.T.,\" why is the alien brown? No reason. In \"Love Story,\" why do the two characters fall madly in love with each other? No reason. In Oliver Stone's \"JFK,\" why is the President suddenly assassinated by some stranger? No reason. In the excellent \"Chain Saw Massacre\" by Tobe Hooper, why don't we ever see the characters go to the bathroom or wash their hands like people do in real life? Absolutely no reason. Worse, in \"The Pianist\" by Polanski, how come this guy has to hide and live like a bum when he plays the piano so well? Once again the answer is, no reason. I could go on for hours with more examples. The list is endless. You probably never gave it a thought, but all great films, without exception, contain an important element of no reason. And you know why? Because life itself is filled with no reason. Why can't we see the air all around us? No reason. Why are we always thinking? No reason. Why do some people love sausages and other people hate sausages? No fuckin' reason.\n\n[Cop Xavier ](https://www.imdb.com/name/nm0240622/?ref_=tt_ch): *\\[honks the horn\\]*  Come on! Don't waste your time explaining that garbage. Let's go!\n\n[Lieutenant Chad ](https://www.imdb.com/name/nm0818880/?ref_=tt_ch): Just a minute. Let me finish.\n\n*\\[looks back at the audience\\]* \n\n[Lieutenant Chad ](https://www.imdb.com/name/nm0818880/?ref_=tt_ch): Ladies, gentlemen, the film you are about to see today is an homage to the \"no reason\" - that most powerful element of style.", "label": 0}
{"text": "At least now the next Democratic presidential primary will be in 2028 instead of 2032", "label": 0}
{"text": ">Stay tuned.\n\nBernie isn't credible enough for me to stay tuned.", "label": 0}
{"text": "When that bird landed on the podium I thought to myself this is it. This is the moment. And the timeline split and we went into the marvel what-if universe. I like to think that the other timeline is doing okay. Maybe not as good as the if Al Gore won timeline. But still, maybe we could have staved off global warming for a few more years", "label": 0}
{"text": "How many of you voted?", "label": 0}
{"text": "He’s right!", "label": 0}
{"text": "Sort of. Joe slept through the debate where the whole party teamed up and Pete B talked over Bernie the whole time. Immediately after which they all backed out at the same time and Joe didn't have to get his hands dirty debating Bernie himself.", "label": 0}
{"text": "Damn he's angry, rightfully so", "label": 0}
{"text": "It’s not that they don’t realize it doesn’t work, they just don’t want those things to happen so they don’t campaign on it. Every election I’m more and more convinced dems are purposely trying to keep things in razor thin margins so they don’t actually have to do anything, someone even slightly more right than Bernie could win both the nomination and the general easily but because that requires actually making a difference they push those people out", "label": 0}
{"text": "Too late, unfortunately. If he was a decade younger, yeah, he had his shot, but unfortunately, too many rich liberals weren't scared enough. Now we all have to see the consequences of it.", "label": 0}
{"text": "Always on point", "label": 0}
{"text": "Holy shit, he's not taking any prisoners.", "label": 0}
{"text": "Democrats can only offer stability, they cannot offer necessary change. When stupid people see Trump offer change and a better future it seems an easy choice.", "label": 0}
{"text": "I’ve been critical of Bernie in how he’s fallen in line with the Democratic Party, but this seems to have been the straw that broke the camels back for him. \n\nPart of me wants to give him props for this, but part of me is asking where this was in the last year. \n\nHopefully he’s cooking up something good.", "label": 0}
{"text": "Thank you Bernie for coming back to reality!", "label": 0}
{"text": "https://preview.redd.it/r4k6kdx4yczd1.jpeg?width=1236&format=pjpg&auto=webp&s=763c437a1fc512e6e7253bcc50f61ee2155fa47c\n\nLol", "label": 0}
{"text": "If Kamala ran on banning abortion would libs blame women for not voting for her? Or would they blame the Harris campaign for betraying women? I guess it's different when it's Arab lives at stake, because at the end if the day libs dgaf about them.", "label": 0}
{"text": "I think Bernie put it best, it’s not me it’s US. He has done great things for America despite not even being president. He pushed the party in the right direction but democrats are running on a moderate platform that time and time again doesn’t resonate with middle america anymore. If it wasn’t for covid in 2020, trump would have 95% certainty won over biden. 2016 wasn’t a fluke, 2020 was.", "label": 0}
{"text": "Perhaps the Democrats should have been Democrats and not Nixon Republicans.", "label": 0}
{"text": "It didn't even sway moderate Republicans. They turned out even less for Harris than they did for Biden in 2020.", "label": 0}
{"text": "Why can we only have a primary every 8 years?\n\nBiden was a horrible incumbent, yet he was coronated & it ended in disaster.", "label": 0}
{"text": "And what exactly does that say about this voting bloc? Their system and circumstances allow them to prioritize their main issue over the myriad of other problems this country faces? So much so as to ease the path for DJT to be re-elected?", "label": 0}
{"text": "Who out there in 2024 cares about Dick Cheney", "label": 0}
{"text": "Source?", "label": 0}
{"text": "That’s been true since 2016.  The most tone deaf organization on the face of the earth.  They love losing!!!", "label": 0}
{"text": "I find it hard to fathom that people are so disconnected from politics that they didn't know this.\n\nWith that said only HALF the eligible citizens able to vote actually voted.", "label": 0}
{"text": "Great to be able to read comments like this. Up to now they were getting buried on reddit.", "label": 0}
{"text": "God I want to get involved to fight this facist prick.", "label": 0}
{"text": "The time for revolution is now.", "label": 0}
{"text": "Fucking drag em Bernie", "label": 0}
{"text": "Sure. It is ridiculous, but reality is pretty ridiculous.", "label": 0}
{"text": "For all the fear that's been put out there, the moral action the Dems should have taken was to fucking lie.", "label": 0}
{"text": "I garuntee this is at least 50% of the reason she lost. Imagine if she had just no go fuck yourself dick. It'd be a totally different day.", "label": 0}
{"text": "Always has been for 60+ years", "label": 0}
{"text": "You must be young man. He's responsible for a million dead Iraqi civilians, and endless cycle of war in the middle east, and the use of torture on prisoners. He's the reason trump even has power now. The unilateral executive theroy being pushed to its limits is what got trump truly invested in politics and it's so clear that that's the case.", "label": 0}
{"text": "Not wrong. The democratic party has focused on identity politics for years now. The perception is they put more effort into [apocryphal] one armed black lesbian interpretive dance workshops.", "label": 0}
{"text": "We’re 8 years in on this bullshit counter argument. People stayed home because, for the 3rd primary in a row, democrats rigged it.", "label": 0}
{"text": "no people just love fake populism", "label": 0}
{"text": "I sincerely hope that Walz runs in 2028.", "label": 0}
{"text": "My areas (Seattle) had a local news Survey conducted to assess what the issues mattered to voters.\n\nFor Republicans and Independents- it was the economy, and the cost of goods and housing (its the ecosystem stupid.\n\nBut the single most important issue rejected by the Democrats ? Protecting Democracy...... its just shocking how out if touch the party Talking Points are and how militant the Blue checkmarks are with the messaging. \n\nOf course WA went Blue, but the messaging was the same across the country. Instead of the Dems focusing on the Economics and issues that matter for Main Street, they went back to pandering about Fascism and January 6th. Going after the insurrectionists ain't gonna pay my bills.....", "label": 0}
{"text": "Those Democratic strategists, on the other hand, they really know what they're talking about!", "label": 0}
{"text": "People are poor, struggling and angry about it, they voted against the status quo, and the two party system only gave them one other option, simple as that.", "label": 0}
{"text": "He's been grounded in reality this whole time. He's just a pragmatist and knew that he couldn't win because the deck was stacked against him and backed the non-batshit candidate.", "label": 0}
{"text": "Jon Stewart 2028. Full populist campaign. Fight fire with fire.", "label": 0}
{"text": "No clue what you're talking about. But at least since 2020, Bernie's objective has been to herd the lefties into the corporate dem pens.", "label": 0}
{"text": "Friendly reminder that Harris had more billionaires backing her than trump did. Should be obvious we can’t trust the democrats to deliver a more equitable world. \n\nWe need to emphasize class warfare well we still have the freedoms to fight for it.", "label": 0}
{"text": "It’s not like we elected him dem party candidate in 2016…\nOh wait…", "label": 0}
{"text": "We loved Bernie for saying the same shit his whole career, never wavering and willing to die on his hill. Whereas most if not every single other politician is for sale in values and morals.", "label": 0}
{"text": "Can we stop pretending it's women. Both Kamala and Clinton were uninspiring neolibs, it's not about gender. Why tf are liberals so hellbent on this, normies dgaf about identity politics.", "label": 0}
{"text": "Apparently reading isn't your strong point.\n\n\nYes, I absolutely did mean that constantly badgering your own party's voters that they *must* vote for whoever you put in front of them OR ELSE EVIL WINS is going to _cause_ them get sick of it and not even bother.\n\n\nAt NO point did I say they all stayed home specifically because of Israel. If you're going to argue with people, at least pay attention to what they actually say.", "label": 0}
{"text": "This is sadly true. I believe his goal was to find refuge and live to fight another day but the problem becomes one of credibility: How do you reconcile being anti-genocide while simultaneously endorsing a candidate who holds the vice presidency and has not spoken out against supplying an army with weapons that it is using to kill civilians in droves with?", "label": 0}
{"text": "And they tanked, specifically, with about 10 million white, suburban men, who previously voted for Biden in 2020. What conclusion can we draw from this other than racism and misogyny?", "label": 0}
{"text": "This is the way. Obama made that phone call and they dropped like flies. Bernie Sanders forever!!!", "label": 0}
{"text": ">Apparently reading isn't your strong point.\n\nI read what you said fine. And I noticed the fact that you have no evidence for the claims you are making. Did I miss it somehow? Let's go over it.\n\n>Yes, I absolutely did mean that constantly badgering your own party's voters that they must vote for whoever you put in front of them OR ELSE EVIL WINS is going to cause them get sick of it and not even bother.\n\nThat is your claim. There is no causative evidence for it. You just state it as if it is true and move on. \"It just makes sense\" is not an argument. You can't even use yourself as anecdotal evidence because you *did* vote.\n\n>At NO point did I say they all stayed home specifically because of Israel\n\nThe thread is about Israel. The person you were responding to said incredulously \"now instead, you have the person who will give them free reign to kill? How does that make sense?\" They were responding to the idea that Israel was the deciding factor in the election, which is what this thread is literally about. Are you with me so far?\n\nOk, so in response to the guy pointing out that Trump is more pro-Israel than Harris, you said, quote, \"That was the argument Harris made, and oddly enough 15 million Democrats decided just to not vote at all. Who could have seen that coming?\" Implying that the person you were responding to was wrong when they say that Israel didn't decide the election. Do you have any causative evidence that Harris' support for Israel was the deciding factor? Or for your stated claim that being the less-worse option was the deciding factor?\n\nThis isn't complicated. You are making claims without evidence. It's not convincing. I'm reading everything you write, and in all that text, I am not seeing a single goddamn piece of evidence. You are wasting my time. Post some actual evidence or shut the fuck up.", "label": 0}
{"text": "Focusing on the normies cost this elections unfortunately. We are collectively really dumb and need to be treated as such. Including me.", "label": 0}
{"text": "That’s fair.", "label": 0}
{"text": "Rights vs dead kids, and you chose the dead kids,\nThis is what I hear when I read comments like this,\n\nSorry, not trying to attack you, I just don't get it when people make this argument, is that really how you feel?", "label": 0}
{"text": "We had our chance in 2016, but robbed by the DNC. But gee - I hope someone can get through to the American people. We love you, Bernie.", "label": 0}
{"text": "Fuck the Dems. We need a new party.", "label": 0}
{"text": "What focusing? Kamala said Jack shit but copied Republican policies lol libshits never understand why conservatives beat trhem", "label": 0}
{"text": "Krystal Ball landed a good zinger here but in the last few years she's turning into Bill Maher.", "label": 0}
{"text": "He could have prevented all of this, but americans are too stupid to know whats good for them", "label": 0}
{"text": "Bernie Sanders was far more active in the Harris campaign than Dick Cheney was.  Don't pretend you respect Sanders if you didn't vote for Harris.", "label": 0}
{"text": "And ran to a rapist and fraud?  Make that make sense.", "label": 0}
{"text": "Huh? So they opted for the guy who will give them anyway?", "label": 0}
{"text": "\"Stay tuned\"\n\nI wonder what he has in store? How feasible would it be to start a new party now? With Bernie leading the helm.", "label": 0}
{"text": "I think now is the time. I'm hoping Bernie can rally his base to build something big over the next 4 years. The more time available to do this the better, so it's best to start tight away.", "label": 0}
{"text": "And now exactly are conservatives going to help these working class people? Democrats are way more pro working class than conservatives, this is utter bullshit. You can't persuade people that are even considering voting for Trump to vote for anyone else. At some point you have to expect people to be fucking adults and actually look into candidates and see that one is clearly aiming to make the lives of every minority utter hell. The voters only have themselves to blame", "label": 0}
{"text": " A friend who has been a Harris supporter since the 2020 primaries knew the election was lost the moment Harris hired former Obama campaign staff.", "label": 0}
{"text": "As a NY Dem and a Jewish person I hate Schumer with a passion. I never vote for him. I wish both of our senators would leave their positions.", "label": 0}
{"text": "For sure, and calling people that don't agree with you libshits will certainly strengthen what want changed. Bernie bros got crucified when we weren't happy with Clinton. Sanders was right about losing the Latino and male vote by all your name calling. Something you will never understand.", "label": 0}
{"text": "What I’m saying is who in 2024 would vote for Harris BECAUSE Dick Cheney endorsed her", "label": 0}
{"text": "This was my first thought too!! Would he have the resources?", "label": 0}
{"text": "Bernie needs to stop being civil with the dems\n\nThey made it clear that they would never back Bernie\n\nWe've seen it when he was running for primary and the amount of dems (liberals) literally stacking the deck against him.", "label": 0}
{"text": "Bernie has raised tens of millions of dollars from small donors, it might be in the hundreds of million overall.\n\nHis ground game and word of mouth is exceptional, simply because he actually talks about issues everyday people care about.\n\nPlus he might start off slower but Bernie is amazing at getting a funding snowball rolling.\n\nSo I would say yes he could do it.", "label": 0}
{"text": "Half the problem also is that they didn't go after the insurrectionists, not the real ones they should have gone after. They went after some useful rubes and left alone everyone that planned and executed the shit. Democrats are incapable of anything beyond milquetoast. People on the left and the right just want to see the government DO SOMETHING other than keep feeding the military industrial complex and bailing out billionaires and wall street.", "label": 0}
{"text": "I want to like Pete and I'm coming around but I lost a lot of respect for him that night. He would just interrupt Bernie every time he talked, but he wasn't actually saying anything himself just being disruptive.", "label": 0}
{"text": "If you tell republicans to get fucked, and then offer a better future with real promises then Republican voters are more likely to vote for you. Seems paradoxical but these people need to be shamed not coddled", "label": 0}
{"text": "I'm not American but I'm a huge fan of Bernie because he's one of the few congressman ( or senate)  who has the balls to stand up to Israel and their crimes", "label": 0}
{"text": "When is this quote from? It’s insidious if he said this after last night.", "label": 0}
{"text": "2016 DNC fucked us all…just because, “anyone but Bernie” and, “it’s Hillary’s turn.”\n\nAnd by “fucked us all” I mean all of humanity.", "label": 0}
{"text": "*Cries*", "label": 0}
{"text": "I'm so fucking in.", "label": 0}
{"text": "The man who built my house voted for him. I feel for his children who play with mine when their undocumented mother is deported to a place she hasn't seen since she was an infant. I'm not making some outlandish statement here. He literally voted to have his family torn apart.", "label": 0}
{"text": "I doubt that very much.", "label": 0}
{"text": "Apologies in advance for the long rant and this is probably going to come off more aggressive than intended. Unfortunately yes. If that’s how reductive we want to go. I don’t think we should be giving Israel as much support and weapons considering how they’ve been using their power to commit fucked up crimes against Palestine for years. BUT Israel and America ties is a messy complicated issue and I don’t expect a radical policy change so soon or at least during a presidential race. \nConsidering how either left or right was most likely going to give weapons to Israel and be lenient on their actions I voted for the left bc 1) as a queer person who has sisters and nieces, loved ones ect of multiple backgrounds their well being is a priority for me. Even if it was so personal I will vote to protect the rights and well being of my own countrymen first bc it’s impossible to have ur cake and eat it to when it comes to protecting everyone or many at risk groups/peoples in the world. Hell the US maybe barely does it for themselves and 2) the left won’t be as bad as the right on the the Palestine Israel issue which is something when having to make a choice between 2 things and 3) any perceived improved economic or social status from either not voting left or voting right is just wrong  and even if they were to improve my economic status is not worth compromising point #1. Back to Israel Palestine which is showing to be a really big issue for voters. It sucks to be in that choice or which one if both are gonna support weapons and administration that kill children but that’s how the 2 party system works right now. I want more diverse and progressive candidates but I believe that starts with local, state and then rep/senate voting choices. But it’s a long slow road to getting that in a presidential race and not compromising on that single political office is short sighted in my opinion. So yes it’s very far from ideal but no matter what which administration won it’s likely there will be more dead children and innocent people but I can still vote for an administration that will be better for its own people and hopefully better for those in other countries.", "label": 0}
{"text": "T. Roosevelt was a hardcore progressive. The attitude he had is what’s needed overcome the obstacles enacted by billionaires.", "label": 0}
{"text": "The focus really needs to be on election reform as a whole.", "label": 0}
{"text": "Why are we snooping on Joe Biden's search history?", "label": 0}
{"text": "the party is unsavable", "label": 0}
{"text": "One of my life's biggest regrets is that I didn't quit my job to campaign for him in 2016. Not one I share often, just it's one I feel deeply. I doubt it would have made much impact, but the not knowing for sure will forever eat at me. He is a respectable, intelligent, fearless politician who, had he the chance to lead, would have been among the greatest. Alas, it is not so. The world is lesser for it", "label": 0}
{"text": "Winning her election", "label": 0}
{"text": "Wrong. They didn’t vote more right. Republicans got the same amount of votes as 2020 and democrats got 15 million fewer. People just didn’t show up for their 4 year shitlib offering. Want to win? Read the tweet. \n\nWelcome to the sub by the way.", "label": 0}
{"text": "I'm pissed with how the party treated us. This was their election to lose, we backed them, campaigned in 2016, in 2018, in 2020, in 2022 and they just want to get moderate Republicans and hold everyone else's vote hostage. We had a winning formula in 2020 and they were resentful over 2016.", "label": 0}
{"text": "Louder!!! Stop trying to court centrists, undecideds, and not maga republicans! Embrace the left wing progressive policies, it’s what the people and younger generation (increasing voting block) want.", "label": 0}
{"text": "Who could they run?", "label": 0}
{"text": "Why come around? He’s a shit head disingenuous neoliberal the establishment is desperate to prop up. He’s young and gay and no different than any of the other establishment dems who get wiped out at the end of the day", "label": 0}
{"text": "Liz Chaney or\n\nBill/Hillary Clinton or\n\nOprah or\n\nJennifer Lopez. \n\nThese are all deeply unpopular people with the American majority, but the Democratic elite are so out of touch with those sentiments, so they keep pushing them to the forefront as if America wants to hear their voice in politics. These people represent the hypocrisy of the left.\n\nTrump is going to make wars worse, so let’s flout Cheney\n\nTrump is a rapist, so let’s flout Bill Clinton\n\nTrump should be jailed for classified document mishandling, so let’s flout Hillary Clinton\n\nTrump is a rich elitist, so let’s flout Oprah\n\nTrump partied with Epstein, so let’s flout Jennifer Lopez", "label": 0}
{"text": "I'll die on the hill of Bernie would have beat Trump. He's the last D candidate people were actually excited for.", "label": 0}
{"text": "The country too, trump won the popular vote.", "label": 0}
{"text": "The people who own the media get kickbacks from republicans, classic tit for tat", "label": 0}
{"text": "Look at the data. Ten million Democratic votes vanished since the 2020 election, and the vast majority were suburban white men. They didn't vote for Trump, since he didn't expand his support at all. So how would you explain ten million white men who voting for Biden and then sitting out the election when a black woman was the candidate running on essentially the same platform?", "label": 0}
{"text": "Every election i have been able to participate in has brought this garbage", "label": 0}
{"text": "Feel the Bern, Dems.", "label": 0}
{"text": "I’ve seen so many posts on here and across social media blaming Bernie and progressives for pulling the DNC and that what caused Harris to lose. I don’t even bother responding.", "label": 0}
{"text": "He was also charismatic and part of a backlash against bush whereas Kamala was an incumbent without his charm but yes they alienated their base 100% and some didn’t show because of it. They’ll learn this time though…!", "label": 0}
{"text": "Any idea if this will be enough to drive him to start his own party?  \n\nPretty sure he would have enough good ideas to garner the voters that the DNC was leaning so hard to the right to get.\n\nIf only instead of trying to steal MAGA voters, the centrist right party would motivate the 40% of non-voters by having talking points that didn't sound like Reagan.", "label": 0}
{"text": "The time was before the primaries...in 2016.\n\nBut now would also work, I just hope it's not too late and there are future elections.\n\n\nMedia in general seemed useless to the DNC, mainstream or otherwise.", "label": 0}
{"text": "This made me wanna leave the dem party.", "label": 0}
{"text": "Dems, and Dem socialists need to start being a bit more forceful that this is the direction we want the party to go. No more Pelosi democrats. Our backs are against a wall with a racist fascist coming into office. No better time to start punching. No more “when they go low we go high” time for “when they go low we punch them in the face”", "label": 0}
{"text": "The Dems (dims?) are that part of the Business Party that polices the Left in order to prevent or abort movements like Bernie's. The other part is there to make billionaires' dreams come true.\n\nHeil shitler", "label": 0}
{"text": "MAYBE GET OFF REDDIT AND VOTE NEXT TIME LMFAO\n\nYOU ARE HERE LOL 👉🏼 Denial: This is a defense mechanism that helps numb the immediate shock of the loss. It can involve disbelief and avoidance.\n\nAnger: As the masking effects of denial begin to wear off, the pain re-emerges, often expressed as anger. This anger can be directed at inanimate objects, strangers, friends, or family.\n\nBargaining: During this stage, individuals may dwell on what they could have done differently to prevent the loss. They might make “deals” with a higher power in an attempt to reverse or lessen the loss.\n\nDepression: This stage involves deep sadness and regret. It is a natural response to the significant loss and can include feelings of hopelessness and withdrawal.\n\nAcceptance: In this final stage, individuals come to terms with the reality of the loss.", "label": 0}
{"text": "In 2016 probably yea. I’d say the biggest reason dems lost this election is due to inflation. Incumbents globally have struggled massively this election cycle", "label": 0}
{"text": "You guys got anything else besides \"i know what you are but what am I\" if you are gonna be the party of genocide at least be clever", "label": 0}
{"text": "Ok nerd", "label": 0}
{"text": "It’s their purpose", "label": 0}
{"text": "It doesn't matter whether it makes sense to you or not. It's the political reality and the Democratic Party preferred to arm genocide even if it meant losing.", "label": 0}
{"text": "I like Bernie, but this response pissed me off. All I read was, “I toed the party line bc it was the safest thing to do”.  Then when Dems lost he goes on a rant about how weak Dems are. Had he stood his ground to begin with we might have seen some change potentially.", "label": 0}
{"text": "Same. It was an awful look and did not suit him. Knowing he won some Kennedy award or something when he was 18 for writing an essay about Bernie was wild!! How could he disrespect him like that? So gross.", "label": 0}
{"text": "It’s time to create a new party. There’s no path for reform", "label": 0}
{"text": "I think the issue wasn’t the messenger but the message. Harris was as strong a messenger as anyone could ask for. What she was selling — moderated Bidenomics with a side of Clinton style individualistic garbage — was a loser.", "label": 0}
{"text": "I essentially said the same and had the same thoughts here: https://www.reddit.com/r/politics/s/CK7k0QCqNc\n\nLove that my mind is aligned with his like that", "label": 0}
{"text": "I appreciate your well thought out response, and I too apologize for the upcoming aggression, but it's wasted on people like this. The idea that you voted for dead kids is childish, it's the kind of thing that someone who only cares about the presidential election would say. As you said there were two choices at this juncture. That doesn't prevent any of us from participating in other parts of our processes to fight for what we think is right. Trump would be worse for Palestinians, not voting for Kamala did nothing to help them. It disgusts me that these people who don't even understand this conflict or how our system of government works have the nerve to talk and act this way. The people they claim to care about are going to suffer, it won't affect these people one bit, and they'll never see the \"what if\" of a Harris presidency so they can delude themselves into thinking, \"they're both just as bad\". I know Trump supporters are morons, but it makes me just as mad to see this idiocy on the left. Thank _you_ for using your vote wisely, and don't let anyone guilt trip you for it. I hope some of the kids here grow up.", "label": 0}
{"text": "Is that him hinting at a new political party?", "label": 0}
{"text": "too busy finger pointing, blaming each other and sorting ourselves into the red tribe and the blue tribe while the true owners of the country are busy stealing all the money out of the bank and giving it to their criminal friends on wall st laughing all the while at how easy it is to keep us divided and scared so we can let it all happen.", "label": 0}
{"text": "Nah, let those groups find out what happened when they either don't vote or vote for the administration with plans to directly hurt them.\n\nCongrats, you dabbed on those tone-deaf libs. Hope it was worth it 💁", "label": 0}
{"text": ">now is the time to take over the party\n\nOh the innocence. ", "label": 0}
{"text": "That what I took away from the sign off. There's no reason for him to play nice with the Dems anymore. From all the early mainstream analysis I've seen, even after a loss this resounding they still can't see the forest for the trees. If ever there were a moment for the left to take the Dems on, it's now. No amount of \"unity\" is worth squat between now and 2026 at the earliest.", "label": 0}
{"text": "That person never claims to support Palestine. Dems do and end up doing 90% of what the other person would do. ", "label": 0}
{"text": "I like Bernie but fuck this! What did trump do for the working class!  Blame the repugnant people that voted for trump and stayed home!", "label": 0}
{"text": "If we clone him now, we can have him of age in 35 years!", "label": 0}
{"text": "I think even he miscalculated just how badly the Dems were down against Trump. After last night, it turns out they were always destined to lose, but before last night, going after them head on would have been signing himself up to be the scapegoat when the Dems dropped the ball out of their own incompetence.", "label": 0}
{"text": "That is true. Mainly, we can't let him win a primary.", "label": 0}
{"text": "This would be a *much* weirder take on the Manchurian Candidate lmao. I’d watch it.", "label": 0}
{"text": "AOC", "label": 0}
{"text": "I’m not sure how well that would work. The republicans had been painting her as the boogeyman for so long. Can we really convince a majority of people she isn’t?", "label": 0}
{"text": "It's the only way, for real. Them paint anyone that way, we should put up someone who clearly communicates to the voters that she's not buyable by the oligarchs", "label": 0}
{"text": "It really is our last remaining asset, if history written in ten years says it can be called that", "label": 0}
{"text": "This made me chuckle thank you lol", "label": 0}
{"text": "The Clintons need to GO AWAY. Bill is 78 and Hillary is 77 for fuck's sake. They're richer than most Americans can even dream of. They just need to withdraw from public life *completely*. \n\nWhat is it with the American ruling class being constantly hungry for attention?", "label": 0}
{"text": "Then the DNC needs to put on it's adult pants and embrace left-wing populism.", "label": 0}
{"text": "He's the sort that's gonna have it until he just stops breathing.  Always has been at this level.", "label": 0}
{"text": "Your premise is wrong. It’s not as black and white as dead kids or rights. Distilling it into that is just, and I’m sorry, also not trying to attack you, but it’s idiotic. If you lack the critical thinking to see the nuance in the situation that’s on you. \n\nBottom line is leftists took a big risk and lost. Not only did Kamala not move to the left on Palestine, she also lost. And while it may feel good to have “stood on principle” , it is an objectively worse outcome for Palestinians. You can blame Kamala, but what difference does that make? More kids are going to die because people failed to elect her to office. ", "label": 0}
{"text": "I don't disagree with Bernie but I get so confused why that means they lose voters to the Republican side—which does demonstrably NOTHING for everyday working people? On the contrary, in Trump's last term he did things like give the rich tax breaks and removed basic deductions for working class people, even before our tax breaks expired.", "label": 0}
{"text": "Pete Buttigieg from before he joined the DNC and their talking points...unfortunately We're Not Going Back ™️", "label": 0}
{"text": "Lol, no, I don't think so. No more Democrats. He wasted no time torching them, he called it a disastrous campaign, he said they've abandoned the people, he ended with \"stay tuned.\"\n\nI think this is it. He's starting a new party. This is what he should've done after 2016, but better late than never.", "label": 0}
{"text": "Potentially Tim Walz? Not that I'm super tuned in to politics, so I wouldn't necessarily know anyone other than the big names we've already seen, but he seemed to be campaigning with progressive ideals and has backed them up in Minnesota during his governorship. He appeals to working class and middle class voters. He doesn't own stocks and was joking that he was the \"poorest person to ever run for VP\" I think the misstep with the Harris campaign was not putting him out onto the campaign trail sooner. Although the it sounded like the VP debate wasn't going particularly well (I didn't tune in, so take that with a grain of salt), I wonder if that's just because he didn't have time to prepare/the Harris campaign hadn't cemented a platform. He seemed to do very well in later media appearances, and I think he was considered the most popular candidate on either ticket.", "label": 0}
{"text": "Yet democrats voted out Cori Bush in the primary when she stood up to the Israel lobby. Inconsistency is the name of the game in politics.", "label": 0}
{"text": "We’re in a boring dystopia.", "label": 0}
{"text": "Nah shut up liberal you are the reason why trump wins in 16 and 24. Your attitude and understanding of the world is why people feel so numb about the Democrats. Nobody voted for Kamala because of Kamala but because Trump existed.\n\nThe Democrat party need to be thrown in the trash because it abets and feeds the Republicans. Sanders was systematically eliminated by the dnc hacks and I don't need a blue trumpist to spread misinfo.", "label": 0}
{"text": "I've heard Shapiro's name thrown around, but I don't know much about him. At the least, might help win back Pennsylvania.", "label": 0}
{"text": "Yeah wtf are we smoking here?", "label": 0}
{"text": "[This ](https://www.youtube.com/watch?v=LpZutjc5lS0)is very relevant.", "label": 0}
{"text": "Shapiro is a right wing ghoul.", "label": 0}
{"text": "Biden also passed the Willow oil project which offset any green climate gains in the other legislation. The EPA was a much bigger accomplishment than some energy subsidies. Nixon had more progressive taxes on the rich. Nixon had better social safety nets. Bidenomics was a marketing term indicative of nothing. Biden and the dems are far right of Nixon in most respects.", "label": 0}
{"text": "I will be messaging you in 1 year on [**2025-11-07 04:21:33 UTC**](http://www.wolframalpha.com/input/?i=2025-11-07%2004:21:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/SandersForPresident/comments/1glep1b/who_could_dems_run_for_president_in_2028_that/lvug58n/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FSandersForPresident%2Fcomments%2F1glep1b%2Fwho_could_dems_run_for_president_in_2028_that%2Flvug58n%2F%5D%0A%0ARemindMe%21%202025-11-07%2004%3A21%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201glep1b)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "label": 0}
{"text": "They're going to paint anyone as a boogeyman.  Stop running scared, unsheath your sword, and attack back.", "label": 0}
{"text": "This made me smile, thanks for sharing", "label": 0}
{"text": "Pete B is a neoliberal empty suit.  He had more billionaire donors than anyone but Biden for a reason.  He is a right winger.", "label": 0}
{"text": "Because, the DNC ran using the EXACT strategy that lost Hillary her election.\n\nThey tried to appeal to moderates… which no longer exist in this country.", "label": 0}
{"text": "If this is the best we got and he backs Medicare For All... I'll take him.", "label": 0}
{"text": "As Senator Sanders well knows, that just ain’t who the Dems are.", "label": 0}
{"text": "They don't. It has been proven several times now that Dems always win when voters turn out, because the GOP is obviously not popular to anyone with a shred of common sense. The Democratic party hasn't lost its voters to the Republican party, it has lost the good will of its voter base and inspired an impressive atmosphere of pure apathy among many. The problem isn't that fewer people are on this side of the aisle, it's that many of them no longer feel a drive to vote because the Democratic party consistently lets us all down. Trump didn't get thay many more votes than last time. He won the popular vote because 20 million blue voters from last election just... didn't show up for this one", "label": 0}
{"text": "Just looked up some of his positions, and yeah. Tax cuts for corporations; we can do better.", "label": 0}
{"text": "And it's people like you that make others vote red. You rather say shut up, than have any discussion.", "label": 0}
{"text": "Josh Shaprio ya goon", "label": 0}
{"text": "You guys are so stupid. This just divides us even more", "label": 0}
{"text": "It's easy to talk progressive from the VP position. You don't have any actual power. You're basically a mascot to bring in the voters the president refuses to campaign to.\n\n\nWe'll see how close he sticks to his guns if he does hit a position of power and the DNC starts leaning on him.", "label": 0}
{"text": "Ben shapiro? I can't tell if this is a joke or not.", "label": 0}
{"text": "No. Josh Shapiro is the governor of Pennsylvania.", "label": 0}
{"text": "I don’t think we lost as many votes to the Republicans, it’s just that we didn’t gain any and even the democrats that we *do* have didn’t vote. \n\nAs for why working class people stray and vote Republican…there are so many different reasons. Misinformation, fear mongering, some genuinely are basically brainwashed. Some genuinely feel like illegal immigrants are taking their jobs and that Joe Biden is solely responsible for inflation. Trump doesn’t have to do anything for these people, he will give them scraps and they will act like he’s a savior. \n\nHowever, like Bernie is mentioning the Democratic Party is severely lacking in their messaging and appealing to the voters they need. They’ve been running on the “we’re not Trump” messaging for years and when people are out here not able to afford food, they don’t feel energized to vote when they feel like neither side cares about them. If people think that they’re going to be screwed and broke either way, they’re not going to go out of their way to vote. \n\nSorry that was so much rambling as someone who just doesn’t even know what the fuck this country is thinking sometimes", "label": 0}
{"text": "The election was decided on the economy not damned Liz Cheney.", "label": 0}
{"text": "Don't regret anything. The DNC got who they wanted, it would never have been Bernie.", "label": 0}
{"text": "If there is a legit organization (maybe dsa?) to get behind let me know please. I'll call myself a democrat but I stopped supporting the DNC in 2016..", "label": 0}
{"text": "Could you share this poll please?", "label": 0}
{"text": "Definitely agree, which was why I think that he was such a great (and unexpected) pick for Harris. I do remember at the time of the announcement, I saw some online discussion about why the establishment DNC let someone so progressive be added to the ticket, and there were several comments to the effect of \"he was safe because he'd bring in left voters, but wouldn't run for president when another primary came up\". I couldn't find any facts as to what they were basing that off of, but thought it was interesting.\n\nIt's too bad the Harris campaign didn't run with that progressive bend and instead tried to curry the favor of \"flipping\" Republicans. While that's all very nice, it always seemed that they're the exception, not the rule, and I feel like the Republicans who didn't want Trump to win just wouldn't vote for him regardless of whether the DNC pandered to them or not. I also thought they were leaning a little too much on the \"secret woman\" voter. I think you can get conservative women (and people in general) to vote against party on issues (abortion measures, etc., but I don't think that translates to actually voting against party on national races for seats of power as often as the DNC seems to think it does. I think that's what doomed the campaign in the end.", "label": 0}
{"text": "AOC's usual post-disaster instagram livestream also made me feel a little less sick", "label": 0}
{"text": "Unfunny troll", "label": 0}
{"text": "Funny how inflation was/is almost completely driven by corporate greed.  Oh, and checks notes* imagine who was donating ridiculous sums to the gop campaign.  Corporate execs that are expecting tax breaks and bigger profits, no fucking surprise.  Its one big club and you and i aint in it.", "label": 0}
{"text": "As much as I don't like to say it, I don't think running a woman candidate is a great idea, particularly when you're trying to get working-class voters to vote. There's too much unconscious bias involved among those \"who just don't like her, can't put their finger on why\" and outright misogyny of \"women can't be leaders\". \n\nIf the Dems can ever retake the House, I'd love to see her as Speaker one day.", "label": 0}
{"text": "... and how trump is liked to escalate...", "label": 0}
{"text": "Divides who? The Democratic party is a capitalist party which will never, EVER fight for the working class.", "label": 0}
{"text": "Who is us?", "label": 0}
{"text": "AOC spread disinfo about Stein claiming she had been the party's candidate for prez the last 12 years and just shows up every 4 years to grift and does nothing to grow the party. The reality is that Stein was not the candidate in 2020, Howie Hawkins was, and Stein has worked tirelessly to help local Greens. \n\nAs to why the party hasn't grown that's because the DNC has seen to that. They have filed numerous federal lawsuits to boot Greens off the ballot and have refused to debate them and even set up a war room this time to spread fake info on them (see the politics sub AMA). And unlike the Democrats, Greens don't take donations from big donors so they have to scrap for everything.\n\nAnd she was utterly obnoxious while delivering this message to boot.\n\nDon't like Stein? Fine but there's no need to pull a page from the RNC/DNC playbooks and use lies and hyperbole to stain someone who has absolutely put themselves through the ringer and shown courage the likes of which AOC can't comprehend.\n\nShe firmly put herself in fauxgressive status with that fake message.", "label": 0}
{"text": "Divides the country, the democratic party was the only party fighting for the working class. Progressives have no party. Now there is no democrats or progressives to fight for the working class. What the fuck are you guys doing?", "label": 0}
{"text": "The american people. Progressives have lost sight of what is important, now there wont be progressive policies for a generation. 20 years of work flushed down the toilet by sanctimonious assholes", "label": 0}
{"text": "No Dems. even run in down ballot races in my area. There is no \"us\".", "label": 0}
{"text": "And how many progressives?", "label": 0}
{"text": "Shawn Fain", "label": 0}
{"text": "Agree with the statement, but it's hilarious (in a sick, twisted way) that he still can't bring himself to call what's happening to Palestinians genocide.", "label": 0}
{"text": "That's cool and all but their approach achieved the opposite of what they wanted so.", "label": 0}
{"text": "Policy wise I don’t think it mattered much because Americans are very vibes based and want platitudes, not plans. It came down to messaging in my opinion. \n\nShe simply failed to distance herself from Biden and the establishment. When asked what she would have done differently than Biden she couldn’t think of a single thing. If she can’t think of anything that she’d do differently then why would voters? That’s my problem with the way she ran her campaign. ", "label": 0}
{"text": "He said himself he didn't want the job.... I don't blame him. Would be rad though", "label": 0}
{"text": "4 months ago I made post after post on here telling people Kamala would lose and Bernie was a much better choice to replace Biden. Got lots of downvotes. Here is one:\n\n  \n[https://www.reddit.com/r/politics/comments/1e900lb/comment/lec1l3h/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/politics/comments/1e900lb/comment/lec1l3h/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "label": 0}
{"text": "Hello {author}. We are sorry, but your submission is being removed because content originating on YouTube.com is not presently permitted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SandersForPresident) if you have any questions or concerns.*", "label": 0}
{"text": "I love you Bernie, but 3/4’s of the country doesn’t care.  We’re lost and we’re doomed.\n\nHalf the country sat out the election and the other quarter chose Fascism.\n\nI have no faith left and I have nothing to offer.  My only goal at this point is to minimize the struggle and suffering me and my wife will have to endure for the last 30-40 years of our lives.  \n\nI am heartbroken and I have lost my faith in America and in humanity as a hole.  I don’t think this wound will ever heal.  I don’t want to be a part of this human experience any more.", "label": 0}
{"text": "He has been a leader. He’s shown so many people what it means to believe in real change.", "label": 0}
{"text": "Think of the BILLIONS of dollars both parties spent in these campaigns. Such waste that could have done so much good for so many people. It’s a shame. \n\nI’m still pissed about Hillary in 2016 unfairly taking Bernie’s rightful place. Maybe all of this could have been avoided. I weep for our country today as I did eight years ago.", "label": 0}
{"text": "They already have free reign.", "label": 0}
{"text": "Climate change is going to get us there, I guarantee it. I don’t know how long it will take, probably decades. But I fucking know that this country will not survive climate change intact.", "label": 0}
{"text": "The question is, why do these people feel Trump is going to do anything to help Palestine?\n\nI get. It being happy with Bidens response and worrying Harris would be more of the same on that issue, I get that concern, I acknowledge that as a real concern.\n\nBut WHY would anyone think Trump would be different, let alone different in a way that he would actually do anything to help Palestine?\n\nMy bet, he continues to arm Isreal and starts openly praising their “efforts to get rid of the nasty people in Plaestine”.  I bet those literal words come out of his mouth at some point.", "label": 0}
{"text": "Idk about you, but as a lefty, kamala touting her ties to the bush administration had me absolutely *sprinting* to the polls to vote for her.", "label": 0}
{"text": "Okay so you guys got Donald Trump now. You happy? Good fucking job.", "label": 0}
{"text": "For a while I was standing firm on the grounds of running a more moderate candidate with some progressive policies as a \"big tent\" means of going after the moderate Republicans who disliked Trump. It worked in 2020 when memories of Trump's insanity and instability were fresh in America's mind. \n\nNow, the Democrats *have* run their dream candidate - a VP who spoke about policies for a brighter future for all Americans, and gained support up and down the Democrat and moderate Republican line, gathering voices of former big name Republicans and even presidents, vice presidents and presidential candidates. Top leaders of our military speaking against the opponent who has numerous convictions and scandals that should be disqualifying.\n\nWe lost. Still we lost, and with this decision America has made it exceedingly clear that the people are willing to support actual literal fascism than a traditional-style politician. Fascism from a man who considers everyone who doesn't bow before him to be \"the enemy\". Fascism from a narcissist on an ego rampage. \n\nSo we need to eschew that idea. It officially had its best run and it lost another election. So we need to reorganize the party, establish much more further left support, emphasize from the beginning the importance of the well-being of the people, be more thorough and aggressive in working to get Americans united under a more leftist cause. Because I think that Trump is a highly unstable man and I think he cannot keep his facade of helping people up for long. This presidency will almost certainly end with terrible consequences and we cannot rely on old \"balance with moderates\" shtick that we relied on with Biden.", "label": 0}
{"text": "It’s this 100%. And the lie is so comforting they actively seek its reinforcement through media and the politicians they vote for. It’s a major issue of deeply embedded denial that runs back generations. We are seeing the democrat side that used to run back generations unravel in real time. MAGA breathed new life into the GOP and Bernie would have done that for the Dems if allowed to, but we all know how that went.", "label": 0}
{"text": "I mean 24% of the male voter turnout!!? I have a bunch of friends I know don’t like Trump and aren’t affiliated politically at all but they had no reason to go vote for Kamala, so they didn’t turn out at all. Over HALF THE NATION DIDNT EVEN SHOW UP", "label": 0}
{"text": "The parties have shifted in America numerous times. The federalists, the democratic republicans, the whigs. None are here today.\n\nChange is possible.", "label": 0}
{"text": "We should start our own party, or make an alternative even better. Bipartisanship stinks and it's a broken system that does not work.", "label": 0}
{"text": "That is something I can latch my teeth onto, thank you", "label": 0}
{"text": "This. It didn't fully dawn on me until too late. \n\nThe lack of endorsements this time. The we wouldve endorse kamala but boss wont let us...\n \nOur media has always been owned by a few top rich guys. It helps their public image not to be disparage and helps put people in office that will siphon money up.\n\nThese media played liberal but they only did it for clicks. Now they dont really need those clicks from identity politic rage bait... they have trump...\n\nThey can sane wash him, let his \"policy\" go unscrutinized, his myriad of crimes get passed by and still make their clicks...\n\nWth have we become when a convicted financial felon, sa, liar, and politician with only concepts of a plan for aca overhaul is a toss up of a choice...\n\nIt's media... we dam lost our country to oligarchs.", "label": 0}
{"text": "\"Cut the nose off to spite face\"", "label": 0}
{"text": "There are some very real criticism of the current democrat part,y but what won this election was the fact that people had an inaccurate view of the candidates.\n\n\nSocial media and classic news outlets made it very easy to misrepresent both candidates which will always swing in favor of trump (i even saw some people claiming he was a good pro choice candidate). I think Bernie would've maybe been louder and more steadfast on his positions which would've helped, but ultimately this election was decided by uninformed voters and that wouldn't have changed no matter the blue candidate.", "label": 0}
{"text": "[Full article]\n\nWill the Democratic elite learn anything from her defeat?\n\nBy Freddie Hayward\n\nKamala Harris’s favourite spot when she studied at Howard University in the 1980s was a large, grass-covered area in the middle of campus called the Yard. She would stand there and watch the musicians playing instruments and the medics leaving the lab, the students laughing together. “That was the beauty of Howard,” she wrote in her memoir. “Every signal told students that we could be anything – we were young, gifted, and black – and we shouldn’t let anything get in the way of our success.” Forty years later, the Yard was where Harris hoped to declare her ascension to the American presidency.\n\nBut it was not to be. There, yesterday afternoon (6 November), in front of a small crowd of supporters, staffers and Howard students, she conceded defeat. Her uplifting tone was unbowed. She delivered a message of defiant hope. “My heart is full today – full of gratitude for the trust you have placed in me, full of love for our country and full of resolve,” she said. She sought to inspire her supporters to continue the fight against the type of politics which Trump represents, a politics she left undefined. “While I concede this election, I do not concede the fight that fuelled this campaign – the fight for freedom,” she said. “Don’t ever stop trying to make the world a better place. You have power. You have power.”\n\nIt was surreal. Her positivity created the impression that Harris hadn’t really lost, that the entire reason for everyone being there was not now redundant, that the Republicans hadn’t (almost certainly) won the popular vote for the first time since 2004. She had no contrition for the loss, nor did she try to wrestle with the reasons behind her defeat. The message was the opposite: keep calm and carry on, stay the course, keep going. She spoke as if nothing had gone wrong and the strategy had delivered. Her finale was characteristic of her campaign: “I know many people feel like we are entering a dark time, but for the benefit of us all, I hope that is not the case. But America, if it is, let us fill the sky with the light of a brilliant, brilliant billion of stars.” It was at this point that people around me started giggling.\n\nMinutes before Harris mounted the stage, a statement from Senator Bernie Sanders began pinging onto attendees’ phones. It was a stinging rebuke of everything she was about to say. It read: “It should come as no surprise that a Democratic Party which has abandoned working class people would find that the working class has abandoned them… While the Democratic leadership defends the status quo, the American people are angry and want change. And they’re right,” he said. “Will the big money interests and well-paid consultants who control the Democratic Party learn any real lessons from this disastrous campaign?… Probably not.”\n\nThis was a furious indictment of the Democratic Party. It echoed David Axelrod’s comment on CNN that the party treated the working class like “natives” who needed to be civilised. Despite his opposition to the administration’s supplying of weapons to Israel, Sanders endorsed Harris. But his statement yesterday marked the first shot in the fight over why the party lost, the conclusion of which will dictate its direction over the next four years. Dissenters are already criticising Harris for cosying up to Republicans like Liz Cheney, for diluting Biden’s economic populism and for relying on shallow and incoherent messaging. Expect a reckoning on Gaza, while some quiet voices are raising concerns about the party’s failure to stop illegal migrant crossings.\n\nOn the opposite side, Harris’s staffers are already briefing that the blame should fall on Joe Biden’s refusal to stand down in good time. But the Democrats are in trouble if the focus remains on the timing of Biden’s exit. If Harris had more time, would she have won? Isn’t there a risk that the more the public got to know her, the worse the result would have been?\n\nHer concession speech was a sign that the party elite will plough on as before, unreflective about the distance between themselves and large swathes of the electorate. After the crowds started streaming out of the gates back towards the centre of Washington, one man cheerily remarked to a friend, “you know, I remember that Hillary also gave an awesome concession speech in 2016”. ", "label": 0}
{"text": "And worked at McKinsey after college.", "label": 0}
{"text": "And they always love a special identity to wave around in place of actual policies for the working class, as if electing them would be all the advance in society we need.", "label": 0}
{"text": "Still didn't say genocide. But he's very close to the money here", "label": 0}
{"text": "^ this one, Yeap. The kleptocracy and corruption is just absurd. My conscience is clear this morning after having renounced Dem's during Obama. Bernie Sanders' letter is a broken record at this point. The Dem's sadly squandered an opportunity to learn their lesson from 2016's loss.", "label": 0}
{"text": "Bernie is appreciated in Vermont but sadly underappreciated at large. At least we still have Senator Sanders!", "label": 0}
{"text": "I've made this exact argument recently but apparently that's just bad politics and then the republicans win..\n\nMaybe now that they win either way things could change\n\njk obviously Kamala just wasn't moderate enough and her deeply progressive policies cost her the election. Or at least that's gonna be the DNC takeaway lol.", "label": 0}
{"text": "This is the way. But I don't have an answer right now.", "label": 0}
{"text": "I just saw the he won with 64% this time around. I think his reelection would have been similar in 2020 had we had the better timeline.", "label": 0}
{"text": "The margin of Never Trumpers that defected did not change or barely changed from 2020 to today. Knowing that the number is small and unreliable, i dont understand, besides greed and incompetence, why Cheney had been embraced. The GOP can fix their own electorate.", "label": 0}
{"text": "I'd almost root for Pete if it weren't for the Wine Cave social (or whatever that event was called.)", "label": 0}
{"text": "Tell em uncle bernie!", "label": 0}
{"text": "This is the way", "label": 0}
{"text": "Uff, these people do not understand MAGA.", "label": 0}
{"text": "Trump gave them a [target](https://www.reddit.com/r/SandersForPresident/s/JBCbxh6714) to vent their frustrations.\n\nDemocrats don’t even want to be honest about the problem as they are afraid of rocking the boat.\n\nAt some point you should expect better politicians and party to represent you rather than the current DNC elites.", "label": 0}
{"text": "Our last hope is gonna fucking die without ever being president.", "label": 0}
{"text": "The DNC, no matter how desperate they may be, will not ever support a Sanders or Henry Wallace-type candidate.  They’d rather have another Trump.", "label": 0}
{"text": "To them brownies were gonna die anyway, they don't care where it is so long as they FEEL superior", "label": 0}
{"text": "You shut your mouth, that man is a nation treasure. Get it right", "label": 0}
{"text": "To polarizing. She'll get the minority far left vote. That's about it.", "label": 0}
{"text": "Have you seen Robin Williams in ***Man Of The People***?", "label": 0}
{"text": "The best they can do is Kamala Harris. Again. MMM", "label": 0}
{"text": "The media in general all love Trump because he drives views and engagement over whatever batshit crazy thing he's going to do next.\n\nThe Dems largely have a marketing problem. They occasionally do good work, but it gets overlooked by corporate media, and every time they fail to be on the right side of an issue, they get blasted from all directions and lose voters.\n\nNew Media isn't much better, since it's all algorithmically driven engagement nonsense.\n\nWe do need a new party that represents progressive thoughts, with proper funding that gets new blood involved in the political process. The Dems have been \"everything left of fascism\" for too long now to be capable of relevancy or actually solving the existential crisis that are upon us.", "label": 0}
