{"text": "Well. Squirting is peeing. Scientifically proved. But OP case is just a lot of pussy juice.  .", "label": 1}
{"text": "Im sure strangers enjoy a nice surprise shot, I know I would😆😆", "label": 1}
{"text": "Hey i am waiting for someone", "label": 1}
{"text": "Well, yes. It is normal to do that. He is saying he can't control it. \"I start to pee and I can't stop this.\" That isn't normal.", "label": 1}
{"text": "In my experience 1% of women care about cum volume of that.", "label": 1}
{"text": "Your my worst nightmare", "label": 1}
{"text": "And somebody's dream.", "label": 1}
{"text": "This is such a random reply", "label": 1}
{"text": "So you commented on a public post? Should I cry into my pillow because you have eyes? Shall I be impressed. Piss off you fucking child.", "label": 1}
{"text": "Dude the way i would be the happiest bitch on earth if I had this effect on anyone is crazy. She's lucky as fuck idk", "label": 1}
{"text": "Use paragraphs, damn...", "label": 1}
{"text": "Wait, you're imagining fucking your friends? Wth? That's strange lol. I barely have any friends except the one I have and he's 54 and I would *never* think about having sex with any of them. And if I initiated sex with my new friends very soon, they would beat the everloving Christ out of me and accused me of rape lol. I don't understand where you got that from. 🤔", "label": 1}
{"text": "Come on, share the video so we cam assess it ![gif](emote|free_emotes_pack|heart_eyes_rainbow)", "label": 1}
{"text": "Goals lol", "label": 1}
{"text": "Body count of 16 at 17! Bloody hell when does he have time to study", "label": 1}
{"text": "Bravo", "label": 1}
{"text": "Condoms have something inside that kills the sperms.", "label": 1}
{"text": "Is it, though?\n\nAlso I second the seeking out a therapist for you my dude. Could help a ton.", "label": 1}
{"text": "would you like to be friends?", "label": 1}
{"text": "You're an English teacher's worst nightmare.", "label": 1}
{"text": "Why do women always go to that first when a guy has ED, that’s why ED is so traumatic for us! Porn induced ED is incredibly common.", "label": 1}
{"text": "Your post has been automatically removed because it appears to be about wanting \"sex tips\". We get numerous submissions regarding this daily because it is a pretty common interest people have. However, because it is a topic that comes up so often and is [well covered by our FAQ](http://www.reddit.com/r/sex/wiki/index) our community has asked the mod team to direct posters with these concerns to these resources instead. If you're interested in discussion on the topic, please do a search of /r/sex and read some of the many past discussions on the topic. If you feel the topic of you post is not covered by the FAQ, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) and ask that your post be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "grow a set of balls and man up. there's nothing better than making your woman cum using your tongue on your clit", "label": 1}
{"text": "I’m gonna fuck your fucking fanny off you twat usually gets them going", "label": 1}
{"text": "Just don’t cum in 5 minutes \n\n\nI’m joking 😂", "label": 1}
{"text": "I'm a virgin and so what? Bitches these days just want money 🤑💰 that's all the think", "label": 1}
{"text": "My gf prefers BJ without protection. We both are okay with it. Though I always notify her when I am about to come, but she prefers continuing. Is it safe for her to consume it?", "label": 1}
{"text": "1. Opinions are formed by experiences, unless you want to dox every group chat in the world and disprove even modern media which supports women are sharing and roasting nudes in the group chat, literally both of us fall into the lack of concrete evidence fallacy\n3. That's your opinion, and I at least know not to shame you for it.\n4. Okay so you actually believe women don't bully women, got it.", "label": 1}
{"text": "Totally normal.", "label": 1}
{"text": "It’s incredible the people saying stop snooping instead of worrying about the illegal revenge porn these men are distributing. And calling women whores and pigs bc she has sex toys. Disgusting but yea the snooping is the problem 🙄🙄🙄", "label": 1}
{"text": "I know!!! It was horrible the one guy shared private text messages of a girl saying she had anal beads n a pussy pump and all the MARRIED men where like send her pics she’s a fucking whore pig…it just went on and on it was horrifying to read", "label": 1}
{"text": "Exactly. They are married and 5 of them have DAUGHTERS!! They call it piggy stories where they talk about women in the most degrading way. The one guy was sharing a story about a “whore” who grabbed his dick while ubering and squirted all over his car and he called her a nasty 2 dollar slut..I just can’t believe my husband wouldn’t want to naturally walk away from these ppl how does this talk not disgusting him????", "label": 1}
{"text": "I cucked my bf, worth it", "label": 1}
{"text": "1. So you want me to show you evidence of women making fun of a penis in a group chat?  All right 2 seconds for this red herring https://youtu.be/0FfRx1yy4KI\n2. I'm not disagreeing with OP, she can have her opinion, I just don't see it the same way, and that's okay, I don't need to wear her skin, like an animorph, to get her perspective, that goes for you too, but I realized you'd misinterpret my previous statement so I'm back.  I never said it was okay, I said it was wrong when anyone did it, I also did not agree it should be treated like  a crime, because it gives probable cause, what does that mean, well anyone who has ever been in a relationship before and has been a teenager before now could have been sent nudes that they shouldn't have access to, meaning police can now search your phone, because they have probable cause.  First everyone should have a right to privacy, secondly you should have a right not to testify against yourself, and because this is your testimony being used against you that is a problem, no, treat it like slander which is also a crime. \n3. You told me I didn't have to defend every man, to which I responded, its not about men or women, what's being done is wrong, which you called a strawman.  So from your perspective, I have simplified the argument of man bad, to action bad, doesn't matter if man or woman, action bad.  Which first off doesn't make sense, but if it was going to make sense, it would imply that if women did it, then it would be just and righteous, and I don't agree with that, which is why I just boiled that down to you believe women can't bully women, got it.", "label": 1}
{"text": "Girl he's gay", "label": 1}
{"text": "I'll also take a voicemail. Will she take requests and call me \"Princess\" too?", "label": 1}
{"text": "Same unfortunately", "label": 1}
{"text": "What a healthy outlook to share with people who had something done outside their will as children, you seem kind and sane.", "label": 1}
{"text": "Which is ironic because this sub is simultaneously VERY quick to accuse any man who has trouble cumming of death grip masturbation and/or porn desensitization.", "label": 1}
{"text": "Nothing wrong with that!", "label": 1}
{"text": "Well that's not true it's done to babies WAY before they are able to make that choice.\nSo it's always done by someone else's choice....\n\nBarbaric.", "label": 1}
{"text": "1. Idk what this is supposed to mean.  My argument was both men and women make fun of genitalia and its bad whenever it happens. So you asked for proof women share dick pics, I made the claim, I do shoulder the burden of evidence.  Fine I find one example of a woman sharing a dick pic and you immediately say it isn't real.  I'm not omnipresent, I don't claim to be, I cannot scan every group chat to dox an example for you, all I can find are personal admissions of the behavior I just described, one piece of evidence is all that's required to show there could be more, at this point you've slid into an unreasonable burden of proof. Despite that, you seem to think I have no idea how to behave around other people and want me to go roll in the dirt, I'm not an astronaut, I haven't lost the hum of the earth.\n2. If you aren't given expressed consent then its not consentual.  There is no assumption of consent when sharing content of any kind.  I hate to break it to you, but the first 3 seasons of Spartacus are grossly pornographic, sharing a DVD with a friend without getting the actors/actresses expressed consent, so a written authorization, would by your own logic be required for anyone to share this content legally. I'm not dismissing consent in general, I'm pointing out how Ludacris the concept of a human needing consent to share confidential information is.  If that was the default NDAs wouldn't be necessary, because it would be assumed anything shared with another person wouldn't be shared around, thats not the assumption, which is why people keep secrets.\n3. \"What makes you think tons of women are ridiculing dick pics in group chats? Why the whataboutism? Just admit those men are disgusting. You don't have to defend every single thing a man does just because he's a man.\" -your words\n4. It is whataboutism, because idc enough to go nuclear on this dude or his friends, and the consequences for OP doing so aren't worth the effort.  At best the guys know OP reads the group chat and bully her husband, at worst husband gets kicked from the group and OP is to blame. Its way more likely husband will rub off on his friends, than OP will embarrass the guys into acting right.", "label": 1}
{"text": "1. Lol\n\n2. Sharing people's nudes and videos without their consent is disgusting. If you think that's ok, you are seriously deficient ethically.\n\n3. \"Those men.\" Lol read for comprehension. \n\n4. More apologia for misogyny. \n\n5. Idgaf about Spartacus. Stop bringing it up, f#cking weirdo.", "label": 1}
{"text": "Just like the contrariness of the various women I have had in my life.  what can a man do?", "label": 1}
{"text": "Take her out into the forest somewhere private with no one around and touch her butt until she gets turned on then fuck in the woods. 3/3 times it always worked for me something about the harmony of nature always gets girls wet.", "label": 1}
{"text": "Have you tried some serious foreplay? \n\nA woman’s arousal is not the same as a man’s. They require emotional stimulation as well as physical. They don’t get turned on by a penis in front of them. \n\nLet me preface by saying that foreplay doesn’t just start at the point of getting physically intimate, foreplay begins shortly AFTER you have sex, all the way until you have sex the next time. It includes all the small things you do for each other each day, the way you speak to each other, the way you make each other laugh, the compliments you give each other etc.\n\nLOTS of physical/sensual foreplay is required immediately prior to penetration, some women require 15-30 mins of it. This can be kissing, cuddling, exploring each others bodies, compliments, making her feel safe.\n\nCommunication is key. Talk to her. You don’t have to say ‘sex with you is boring’, start with a new position, try mutual masturbation, try watching each other masturbate, try watching porn together, or you use the toy on her. Maybe just make out like young teenagers. Slow everything down, every touch, every kiss. Have you ever just spent an entire session kissing and licking her body and appreciating every curve? Romance the fuck out of her dude.", "label": 1}
{"text": "Do u need a third to spicy this up? I’m Brazilian and I can spicy 🌶️ you both .", "label": 1}
{"text": "She doesn’t like you man. Others will say I’m not right but women are all over men they are crazy about. If the sex has always get boring why put a ring on that?", "label": 1}
{"text": "Tell him to get his dick out and stop being a baby. Like ffs your girl tells you to do something to her just do it. You sure he ain't gay?", "label": 1}
{"text": "My gf prefers BJ without protection. Even though I notify her when I am about to, but she prefers continuing. Is it safe for her to consume it?", "label": 1}
{"text": "Get a new boyfriend who isn’t a little bitch.", "label": 1}
{"text": "I just watched a video about how women are never happy with anything. Had a laugh at it. Then I saw this post.", "label": 1}
{"text": "It’s not uncommon to feel more connected to sensations in intimate settings than during solo experiences; focusing on relaxation or experimenting with different techniques might help.", "label": 1}
{"text": "Finally, a smart man!", "label": 1}
{"text": "Consider approaching the topic by expressing how much these toys enhance your experience, making intimacy even better for both of you; reassurance that it’s simply a preference, like any other, might help her see it with more openness.", "label": 1}
{"text": "I love getting choked. I think I might have a rape fantasy", "label": 1}
{"text": "You are not doing it right....", "label": 1}
{"text": "Could be dehydration", "label": 1}
{"text": ">then just hump a corner of my comforter. [...] I guess parts of the pad going into my urethra\n\nWhat the fuck did I just read?\n\nYour comforter is going to get really stinky really quickly. And they're near impossible to wash (if I understand correctly that a comforter is a duvet). Honestly it's just grim.\n\nAnd I have no clue why parts of your pad would enter your urethra?\n\nMaybe try using a bit of lube, or your finger directly, or experiment with different toys. If you absolutely *must* rub yourself with fabric, maybe get some small fabric cloths that can be washed each time", "label": 1}
{"text": "This sounds like alot of pressure honestly. It's great sex but it's not good enough because he's not doing exactly what you want without instructions?\n\nI'm with many of the others here.... Feels like maybe you need to choose between laying off and maybe he doesn't do exactly what you want how you want it, or giving him specific instructions and he does. A perfectly reasonable choice it seems to me.", "label": 1}
{"text": "Congratulations on your upcoming wedding.\n\nI'd caution you that your wedding day will be very long, very busy, overwhelming, exhausting. It's also quite possible that one or both of you will not be entirely sober by the time you get back to your room. It's really not the best conditions to also jump from 0 to 100 with something that's entirely new to both of you.\n\nSee what you're up for. Don't push yourselves to figure out the sex stuff immediately out of some sense of obligation. You've got all the time in the world for that later. \n\nAll kinds of other good advice all over the Internet for the rest of the \"first sexual experience\" stuff. Most importantly, make sure you work your way up with fingers and such first, and don't be surprised if the first few times involve him finishing before you even have a chance to get into it.", "label": 1}
{"text": "Intrusive thoughts can be incredibly distressing, especially with OCD, but they don’t define your intentions or who you are. Speaking with a mental health professional who specializes in OCD could help you navigate these thoughts and understand them in a safe and nonjudgmental space.", "label": 1}
{"text": "Good job being safe", "label": 1}
{"text": "we have same  problem ey lol", "label": 1}
{"text": "100%", "label": 1}
{"text": "I'm in love", "label": 1}
{"text": "Your post has been automatically removed because it appears to be asking if some aspect of someone else's or your own sexuality or sexual preferences or body is normal or not. We get a lot of questions here that are about really basic stuff that *ought* to be taught in schools but that unfortunately isn't. Variance is the norm in human sexuality. It's more meaningful to ask questions like: is this safe? Is this consensual? Is this mutually pleasurable? There are a lot of great resources for this, including [scarleteen](http://www.scarleteen.com/) and [go ask alice] (http://www.goaskalice.columbia.edu/). You may also find relevant information with a search of /r/sex or in [our FAQ](http://www.reddit.com/r/sex/wiki/index). **If you feel like your question is more complicated or will be a topic for thoughtful discussion**, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) so that we can restore your post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "Your post has been automatically removed because it appears to be about anal sex. We get numerous submissions regarding this daily. However, because it is a topic that comes up so often and is [well covered by our FAQ](http://www.reddit.com/r/sex/wiki/index) our community has asked the mod team to direct posters with these concerns to these resources instead. If you're interested in discussion on the topic, please do a search of /r/sex and read some of the many past discussions on the topic. If you feel the topic of your post is not covered by the FAQ, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) and ask that your post be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "Just have a lot of consistent sex and you'll be cured. That'll get you accustomed to sex - both the feeling and psylogocially. A good way to start is to stop yerking it and to tell yourself the only way you're releasing is through sex.", "label": 1}
{"text": "There's a sissy trend which your son is probably getting into, where a male fantasizes of being a female and acting like one for other males. Not healthy at all.", "label": 1}
{"text": "Get on top maybe? idk... I feel like a lot of women don't understand how physically demanding sex is for a man - in basically any position. \n\nIf he's overweight then he likely runs out of breath quickly, his thighs, butt, arms, legs, and back begin to get tired sooner than later, all while trying not to cum at the same time. It's physically AND mentally exauhsting lol.\n\nI suppose the only real position in which he has to do minimal work in is cowgirl.", "label": 1}
{"text": "Ok, it's unhealthy and traps diseases", "label": 1}
{"text": ">We have a family computer, but my teenage son mostly uses it.\n\nThis post brought to you by 1992.", "label": 1}
{"text": "Yeah... 69 is hard to turn down for sure", "label": 1}
{"text": "Woke up on the wrong side of the bed?", "label": 1}
{"text": "If you’re a guy sadly it involves a wallet or popularity.", "label": 1}
{"text": "As long as you don't smell id be all over it....", "label": 1}
{"text": "It’s not easier or better. Your body shaming cut men by saying that. Unless the man has phimosis it’s literally no different.", "label": 1}
{"text": "Was a teen in the 90s. Used my family computer and absolutely looked at porn pics on it late night on weekends.\n\nDad comes home one day and says “wow your mom found a way to find the old websites we went to but can’t remember, some sort of history the browser has, that’ll be nice”\n\nSpent two days in my room watching dumb tv depressed planning how I was gonna explain why so many porn sites would be in that list. I had the “oh I just clicked on this email and that email and a bunch popped up” excuse loaded up.\n\nNobody said anything. Now i’m pretty sure they knew but was so stressful back then.", "label": 1}
{"text": "Haha it sounds like your dad had your back and was trying to give you a hint to take care of it. Though back in those days, I doubt it would be common knowledge how to do that.\n\nBetter use the internet to find out!", "label": 1}
{"text": "Same here", "label": 1}
{"text": "Where the only thing getting tied up is your internet connection! 😂 But seriously, I’d say just dive into the convo—who knows, he might surprise you with some wild fantasies that’ll make your lewd pics look like stick figures!", "label": 1}
{"text": "The classic 'lights off, morning sex' combo—it's like a surprise party where you’re not invited! 🎉 But seriously, a little compromise goes a long way. Maybe you could negotiate a 'fancy date night' where the lights are on and the fantasy is real? Just make sure to bring snacks; everyone knows that’s the secret ingredient to a happy compromise!", "label": 1}
{"text": "You went from “Let’s get it on!” to “Let’s get it off... the floor!” in record time! 😂 Maybe your body was just trying to say, “Hey, let’s take a break from this wild ride", "label": 1}
{"text": "Any gamer out there that says no to this is crazy lol", "label": 1}
{"text": "I totally get it; those small, intimate gestures during intimate moments make such a difference and show genuine connection", "label": 1}
{"text": "Okay i need some advice regarding sex, from you'll sexual gurus \n\nI am very novice related to women, I am shy around women, also there is fear in me to ask a woman and express my feelings that I like her, also I am very sexually frustrated and I usually just jerk once a day on most days, it's making me sick physically and mentally.\n\nHow should I talk to girls my age that I like her, i fear she might laugh at me, or just spread rumours about me, I am afraid she might slap or accuse me, that I will lose my normal friendship with her and credibility.\n\nI can talk with women but about (safe for work) topics, related to work or anything else (sometimes). I am an introvert my only interactions with a woman were through my school, college and currently my workplace. We talk about work and I tread females like guys just to be not weird.\n\nI fear that I'll die alone without getting some action in my youth, people call me old that I look like a 50 year old and act like an old guy but actually I am a young adult.\n\nI have developed fetishes from watching hentai and porn, I want to ask my gf to let me worship her feet, armpits, ass, nose, and I want to drink her body fluids also.\n\nMy brain is on sex all the time and it's hurting me because I cannot approach any girl.\n\nNeed some life advice regarding my trouble.\n\nI am at a point that I am even Willing to go to a prostitute, (I don't want to do this) and ask her that I can sate my sexual urges with her body, I want some love, if I get an ugly girl even I'll gladly fu*k her all day long and love her like my baby girl.\n\nHelp me please urgent advise needed, people my age have already fucked tens of bitches already while I am a sacredy cat and it's already has turned me into a closet pervert in my mind at least.", "label": 1}
{"text": "Okay i need some advice regarding sex, from you'll sexual gurus \n\nI am very novice related to women, I am shy around women, also there is fear in me to ask a woman and express my feelings that I like her, also I am very sexually frustrated and I usually just jerk once a day on most days, it's making me sick physically and mentally.\n\nHow should I talk to girls my age that I like her, i fear she might laugh at me, or just spread rumours about me, I am afraid she might slap or accuse me, that I will lose my normal friendship with her and credibility.\n\nI can talk with women but about (safe for work) topics, related to work or anything else (sometimes). I am an introvert my only interactions with a woman were through my school, college and currently my workplace. We talk about work and I tread females like guys just to be not weird.\n\nI fear that I'll die alone without getting some action in my youth, people call me old that I look like a 50 year old and act like an old guy but actually I am a young adult.\n\nI have developed fetishes from watching hentai and porn, I want to ask my gf to let me worship her feet, armpits, ass, nose, and I want to drink her body fluids also.\n\nMy brain is on sex all the time and it's hurting me because I cannot approach any girl.\n\nNeed some life advice regarding my trouble.\n\nI am at a point that I am even Willing to go to a prostitute, (I don't want to do this) and ask her that I can sate my sexual urges with her body, I want some love, if I get an ugly girl even I'll gladly fu*k her all day long and love her like my baby girl.\n\nHelp me please urgent advise needed, people my age have already fucked tens of bitches already while I am a sacredy cat and it's already has turned me into a closet pervert in my mind at least.", "label": 1}
{"text": "Okay i need some advice regarding sex, from you'll sexual gurus \n\nI am very novice related to women, I am shy around women, also there is fear in me to ask a woman and express my feelings that I like her, also I am very sexually frustrated and I usually just jerk once a day on most days, it's making me sick physically and mentally.\n\nHow should I talk to girls my age that I like her, i fear she might laugh at me, or just spread rumours about me, I am afraid she might slap or accuse me, that I will lose my normal friendship with her and credibility.\n\nI can talk with women but about (safe for work) topics, related to work or anything else (sometimes). I am an introvert my only interactions with a woman were through my school, college and currently my workplace. We talk about work and I tread females like guys just to be not weird.\n\nI fear that I'll die alone without getting some action in my youth, people call me old that I look like a 50 year old and act like an old guy but actually I am a young adult.\n\nI have developed fetishes from watching hentai and porn, I want to ask my gf to let me worship her feet, armpits, ass, nose, and I want to drink her body fluids also.\n\nMy brain is on sex all the time and it's hurting me because I cannot approach any girl.\n\nNeed some life advice regarding my trouble.\n\nI am at a point that I am even Willing to go to a prostitute, (I don't want to do this) and ask her that I can sate my sexual urges with her body, I want some love, if I get an ugly girl even I'll gladly fu*k her all day long and love her like my baby girl.\n\nHelp me please urgent advise needed, people my age have already fucked tens of bitches already while I am a sacredy cat and it's already has turned me into a closet pervert in my mind at least.", "label": 1}
{"text": "Okay i need some advice regarding sex, from you'll sexual gurus \n\nI am very novice related to women, I am shy around women, also there is fear in me to ask a woman and express my feelings that I like her, also I am very sexually frustrated and I usually just jerk once a day on most days, it's making me sick physically and mentally.\n\nHow should I talk to girls my age that I like her, i fear she might laugh at me, or just spread rumours about me, I am afraid she might slap or accuse me, that I will lose my normal friendship with her and credibility.\n\nI can talk with women but about (safe for work) topics, related to work or anything else (sometimes). I am an introvert my only interactions with a woman were through my school, college and currently my workplace. We talk about work and I tread females like guys just to be not weird.\n\nI fear that I'll die alone without getting some action in my youth, people call me old that I look like a 50 year old and act like an old guy but actually I am a young adult.\n\nI have developed fetishes from watching hentai and porn, I want to ask my gf to let me worship her feet, armpits, ass, nose, and I want to drink her body fluids also.\n\nMy brain is on sex all the time and it's hurting me because I cannot approach any girl.\n\nNeed some life advice regarding my trouble.\n\nI am at a point that I am even Willing to go to a prostitute, (I don't want to do this) and ask her that I can sate my sexual urges with her body, I want some love, if I get an ugly girl even I'll gladly fu*k her all day long and love her like my baby girl.\n\nHelp me please urgent advise needed, people my age have already fucked tens of bitches already while I am a sacredy cat and it's already has turned me into a closet pervert in my mind at least.", "label": 1}
{"text": "That will most probably cause problems in sex with real partner, meaning erection dysfunction and problems with too fast or delayed orgasm and lack of arousal without the visual stimulation that porn gives and getting used to your own hand, also death grip syndrome from too hard touch. Porn also gives you wrong impression about what is normal and what is not. \n\nThe only way to avoid this is to stop watching porn for good and also keep away from jerking for some time. After you've got your sudden hardons back, you can jerk off again, but make sure you do that without porn and that you don't touch your dick too hard. Some say that humping something, like an artificial pussy or lubed plastic bag between pillows is better than jerking as they give you more pussy-like touch and moving by similar moves that while fucking.", "label": 1}
{"text": "No I haven't told anyone about what happened to me except people here on Reddit. I can trust her but I don't want her to know.", "label": 1}
{"text": "Ok I am just afraid of talking about it but I will try it", "label": 1}
{"text": "Thank you and I will try counselling", "label": 1}
{"text": "Oh that seems really smart. Thanks I will try that especially with the lights off at the beginning", "label": 1}
{"text": "He should see a doctor. You can't just assume he'll be okay after that.", "label": 1}
{"text": "It's all about finding your comfort zone—like trying to pet a cat that clearly wants nothing to do with you. Maybe stick to what you're good at for now and leave the mystery for later? 🐱😂", "label": 1}
{"text": "\"Don't worry about it. I'm the one who fucked the shit out of you.\"", "label": 1}
{"text": "Your care package sounds thoughtful and supportive; consider adding some soothing tea for relaxation, a cozy blanket, and maybe some massage oil to enhance the intimacy and comfort. These little touches can show her that you genuinely care about her well-being and comfort.", "label": 1}
{"text": "Talk about taking intimacy to a whole new level! If she ever doubts your chemistry again, just remind her that love can really bring out the... \\*ahem\\* unexpected!", "label": 1}
{"text": "add chocolates", "label": 1}
{"text": "I mean... shit happen 🤣🤣\n\nTalk to her. Conversation is always the key", "label": 1}
{"text": "I would have dumped you ! \nThere are to many other women out there and they all have vaginas and don’t mind using them at all.\nYou need to give him oral or something as he has needs to and you’re not meeting them. \nHe apparently loves you but you are a replaceable unit and if you’re not getting the job done well, the solution for him may be as close as next door ant then you’ll have your feelings hurt and wonder why .  If you’re not satisfying him, someone else will and that’s a fact !", "label": 1}
{"text": "If we talking bout anatomy it’s still clitoris,cause clitoris have a glans(visible part) and crus (hidden part). So,during penetration u stimulate crus clitoris.\n\nU can try stimulate glans,while penetration(toys,cock etc.),just to make sure.", "label": 1}
{"text": "of course you have to be cautious. as with anyone. listen to your gut, are there any other red flags? is the risk worth the reward? is there something you can do together before you jump into bed? like a place to meet and let the chemistry grow a bit....to put some of these concerns to bed. \n\n  \nif she is someone who is a sex worker she will shoot that down pretty quickly.", "label": 1}
{"text": "\"how can i reassure you that last night was not an issue for me and i do not feel any differently towards you?\"\n\n\"I know it may be a big deal for you, but please know you do not have to feel that way because of me.\" \n\n\"Do you want me to poop for you....make it even....\" (if it gets to the point where some dumb humor can bring levity to the situation.\n\ndon't try to \"make her forget.\" it happened. \"I'm happy to talk about it, or not talk about it, but i want to make sure that emotionally you are not beating yourself up over this. it changes nothing, I'm here to talk about it anytime if you'd like, or never again if that's what you prefer. you just let me know. in the meantime, lets go (get some lunch, take a walk, go to diner, go see a movie, partake int he one hobby you share, etc) fill in that blank. \n\n  \navoid making it a big deal by trying to make her feel better as well. sometimes it's best to move on and then laugh about it later. if appropriate.", "label": 1}
{"text": "communicate your feelings without being accusatory....if you don;t know how to do this, read a book, grow, learn. after you do that understand where your expectations are coming from. Do you watch a lot of porn? are women supposed to act a certain way when they cum? some women are quiet as hell when they cum. some aren't. some like to play it up, some don't. maybe she is too nervous to talk to you or tell you. maybe she was brought up in a super strict household and has religious hangups about whats going on...only way to know is to communicate, without being accusatory, and find out.", "label": 1}
{"text": "just have him pick you up and hold you", "label": 1}
{"text": "how much time have you spent building intimacy with her before you want sex? \n\nwomen need intimacy for sex. \n\nmen need sex for intimacy. \n\nsounds like \"initiation drunk sex\" is a cheat code for \"maybe she will do stuff i want this time and i did not have to do any work for it to get there.\"\n\ndo you guys align sexually? have you talked about that? libido, kinks, turn ons, desires, fantasies, etc. \n\nhave you fostered a loving and trusting environment for someone to want to share this stuff with you? what have you done specifically to do this? \n\nyou want your sex life to stay fulfilling and be carefree and fun and effortless? that doesn't exist my guy. having a good and fulfilling sex life takes effort like being good int he gym, or at work, or literally anything else. \n\nif you want to make it more exciting, you need to learn to communicate, openly, lovingly, and without accusations. \"i want our sex life to be better\" is accusatory. \n\nyou need to learn how to foster immense amounts of intimacy.\n\nyou need to learn how to create a loving healthy open space where people feel trusting and safe. \n\nyou need to communicate your wants and desires and also need to take some personal reflection time and understand, \"what is it i really want, why do i want this thing, is thing better as just fantasy? does this thing improve our sex lives together? is this something we both want? will this be something i am asking her to do for me and she gets noting out of it? \n\n  \netc. \n\n  \nbest of luck on your marriage. its the toughest but most rewarding thing you may have in you life. \n\n  \nthere are a number of books/apps/videos, etc that focus on all the stuff up above i mentioned. i would suggest starting now. the more it becomes a habit, the more time you two spend working on your relationship together, the better your sex life will be.", "label": 1}
{"text": "\"Hey (insert name here), i wanted to talk to you for a moment about the times when we are intimate together. Does it make you uncomfortable to go down on me? Is there something about it that bothers you? I'd like for us to feel connected, and this is something that I've noticed and i wanted to bring it up? \"\n\nstart with something like that.", "label": 1}
{"text": "well kudos for the bar being so low that he \"does not want to seriously injure\" you. i mean imagine the alternateive.....\n\n  \nsafe words are so you so not have to say \"whao full stop, not okay.\" they are simply to let someone know hot, medium, cold. in BDSM play it is often about finding that line, that one should not cross, and then having a party on that line. so having the safe word helps to say, he dial that shit back, go back to what you were doing before, you found the boundary, now stay there, and lets have fun together. \n\n  \nbuuuuuuut that is NOT your issue here. your issue is NOT clamming up. your issue is that BEFORE play you had a discussion, you said \"this is not OK\" and then he did the \"not OK thing.\" that is the problem. like i said, lets say it's just the way it was written and there was some miscommunication that i am unaware of. it happens. hence the safeword. \n\nthere are some people that are into sadism. that's fine, no judgement, but both parties have to be consenting, otherwise it's just rape. \n\nask yourself \"would i have violated his boundary? If i had violated his boundary how would i have responded? is he treating me the way that i would tret him and want to be treated?\" the way you are writing this the answers sound like no. \n\n  \nit's possible to be sexually incompatible with someone. just like anything else. it adds a wrinkle and layer of complexity to your relationship and you have to decide how much you want tot partake and he has to decide if he will be ok with that level. if the answer is \"we are not, there is a divide\" then you have to decide how you manage that divide or you realize, \"hey we have a lot of good stuff here but this is a deal breaker.\" there are people out there who will sexually align wit you and respect your boundaries if this person is not willing to do so.", "label": 1}
{"text": "i find it hard to believe, and this is coming form another man, that you want to talk to other people about sex, their sexual experiences and preferences, but you \"don't want to fuck them.\"\n\n\n\nlet me guess, you almost exclusively have these conversations with people whom you would also say you find attractive.", "label": 1}
{"text": "is it a \"sudden shift\" or is it that you just found something new you are enjoying? \n\n  \nin my mind a sudden shift would be that you previously found all of that to be a significant turn-off and no it's changed. \n\nto me it sounds like you came across some more stuff you like, good for you guys! i say enjoy it, and keep exploring! who knows what you could find next!", "label": 1}
{"text": "sounds incredibly common to me. isn't this what most men and women do? It seems like you are asking \"hey, do you enjoy hearing about sex and find it stimulating\" \n\nyou realize how many copies of \"fifty shades of gray\" were sold right.....", "label": 1}
{"text": "not what i was saying at all.", "label": 1}
{"text": "For a \"Lustalicious\" vibe, try \"Earned It\" by The Weeknd, \"Talk\" by Khalid, and \"Wicked Games\" by Geminelle. Adding a touch of alternative, \"Feels\" by Kehlani and \"Bad Things\" by Camila Cabello & Machine Gun Kelly fit the playlist perfectly.", "label": 1}
{"text": "of course. the connection is through the conversation and the communication. not the act of putting a penis in someones mouth. \n\nI'd like for us to feel connected as in \"we have an open safe platform to communicate\" and it's been my perception that this on act may be an issue.", "label": 1}
{"text": "Science says otherwise, unfortunately. Do you always do what he wants you to do?", "label": 1}
{"text": "Damn. Sounds hot to be honest lol", "label": 1}
{"text": "Damn, that’s real love right there, bro. Not many guys would handle that like a champ. Think she’s starting to feel better about it? Or you still working some magic to help her chill?", "label": 1}
{"text": "I don't believe this really happened", "label": 1}
{"text": "Drink it like it’s sweet corn soup", "label": 1}
{"text": "Keep the labia open with your fingers. I don't know how old you are but women are often self conscious about these types of things. She shouldn't remove her pubic hair because you asked her to but because she wants to. Trimming with scissors is a good first step. I've always been too scared to shave so I use a bikini trimmer which is great because I don't end up with ingrown hair and don't cut myself.", "label": 1}
{"text": "Why...\nhttps://youtu.be/7UuowJhHI54?feature=shared ❤️", "label": 1}
{"text": "I love online games and if my wife, or partner, lover or girlfriend wants to disturb me while I'm playing, I can do it as many times as I want because I'll drop any game to be with a woman and the idiots who say otherwise can stop being a man, men In fact, when he sees a naked woman he will drop everything to be with her", "label": 1}
{"text": "add me pf facebook heather martin poole..drop me a comment 🍑", "label": 1}
{"text": "May be you need to two men, let me know if you need another hand other your husband’s", "label": 1}
{"text": "professional help is probably best here, even one in which you could both go together. it's going to be difficult for anyone on reddit to give you an answer that will help with your level of anxiety from intrusive thoughts. the good news is that YOU CAN overcame this. this is nothing new or unique, many people have had this and many people have been able to learn how to control it and achieve the relationships they want to achieve. first, don't be so hard on yourself. second, make sure you are not being hard on each other. this one of many obstacles you will face together a partnership. it is surmountable. just take the steps in your life to work towards you're goal, know it's ok to sometimes feel discouraged, but just keep going and you will see improvement.", "label": 1}
{"text": "usually people who have a \"partner\" do not feel the need to \"sow some wild oats.\" \n\nyou have a girlfriend, and she has a boyfriend, but it doesnt sound like either of you have a partner. \n\n\\-ban communicartion\n\n\\-probably a fair share of unrealistic expectations\n\n\\-rensentment\n\n\\-different values. \n\n  \nmaybe it's not that you want to sow wild oats, maybe it's that you want a partner. \n\n  \nif your partner was into and enthusiastic about doing all the physical stuff would you still feel this way? \n\n  \nprobably a good starting point there my man.", "label": 1}
{"text": "\"My current partner tends to get frustrated after sex because I haven't orgasmed and he states he has never had this issue before.\"\n\n  \nhow does he know? has he never heard of a girl faking it before? please. how ridiculous. he needs to grow up. does he think putting pressure on you and comparing you to other people will help? \n\nmaybe try to reverse that. tell him when you came in the past the other guys had bigger nicer cocks and \"used them better\" and were able to \"hit all the places he can't\" and see if he can keep an erection let alone cum\n\nI'm not seriously advocating you do this, it's just to illustrate a point. \n\nsounds pretty obvious to me....when he is not there and you masturbate, you cum. when you are drunk with him (i.e. a drug has made you relax with him) you can cum. \n\nsounds like HE might be a very large part of the problem and i am willing to bet there is a lot more that you did not share that would support this. \n\n  \nhow do you fix it? probably have to mother him a bit and explain why he's being such a dummy, and what you need. usually that is not very sexy though and often makes the sex life work. but that's the level of communication he probably needs, and you will have to work on that together to get there and try not to let your attraction to him dwindle when he throws all of it on you and you are expected to fix it all for his enjoyment. \n\n  \nsex is  supposed to be something you \"do together\" right.....", "label": 1}
{"text": "this sounds like a potential medication issue, which is a question for you and your doctor, and an issue with you \"trying to hold back.\" \n\ni think you should arrange you timing differently. maybe lots of foreplay for her if you're both trying o cum at the same time. or whats wrong with you cumming? just because you cum doesn't mean you guys have to stop. focus on her, get here there, by then maybe you are ready for round two?", "label": 1}
{"text": "why not just cum? or stop before you get to a point hat will result in blue balls. \n\n  \nthis is like one of those questions where someone is like \"i have a headache\" and they are hitting themselves with a hammer.", "label": 1}
{"text": "\"I’ve never really laid all of this out at once for him before, just communicated one thing at a time, here or there.\"\n\n1. lay it all out at one for him. communicate clearly and without being accusatory what you need to fulfill his needs\n\n2 enjoy better sex\n\n3 realize what good communication can do for your relationship and keep communicating.", "label": 1}
{"text": "why not ask her this directly? then put a plan in  motion to do exactly what she tells you.", "label": 1}
{"text": "\"I have tried to subtly ask for us to try again but she never really continues the conversation.\"\n\nhow about overtly asking for it? in an appropriate way? what is wrong for advocating for your desire. \n\nsometimes we think we want something and then realize later we do not. maybe that happened with your GF. maybe she liked the fantasy of pegging you and the actual act wasn't doing it for her and was a turn off. that's ok. it's on her to communicate her feelings and you to communicate yours. \n\nask for it overtly, offer solutions, a different apparatus, or toys with just hands, or perhaps you do it to yourself while you both are playing around. \n\n  \nask her your feelings, \n\ntell her yours, \n\ngo from there.", "label": 1}
{"text": "why not just share the idea with your partner and do it with them. that's the point. i'm older than OP too, i get the ticking clock...hence, stop wasting time and tell your partner what's up!", "label": 1}
{"text": "different strokes for different folks. some people need more intimacy/connection, others do not. also, some people are able to compartmentalize, perhaps they are having sex to fulfill a fantasy of their partner or perhaps they are having sex to just get off. some people are like this. some people have healthy sex lives and views towards sex, some do not.. all people are driven by those beliefs. \n\nyou're not weird, its who you are, and I'm sure if you thought about it there are probably specific scenarios that would even adjust or stretch those boundaries for you. \n\nmost people create some for of personal connection in the majority of their sexual experiences.", "label": 1}
{"text": "you can still surprise her with stuff. but you have to get the information first. how are strangers on the internet supposed to guess what your wife may or may not be into sexually?", "label": 1}
{"text": "if you're only able to achieve certain behavior under the influence of a drug it's probably  sign that you need to speak with someone about that. alcohol lowers your inhibitions so obliviously you're throwing caution to the wind but speaking with a professional will be the best way to uncover an issue and then give you tools to manage it. \n\n  \nif it is not that deep, there are a number of books that you could check out that can teach you how to be more dom, how to talk dirtier, how to grow into a level of comfort etc. \n\n  \nit's great you want to do this for your partner and I'm sure they would appreciate your efforts and in turn be patient as you both learn to offer each other other ways to fulfill needs.", "label": 1}
{"text": "My own situation is a bit more complicated.....is there another place I can explain it in detail?", "label": 1}
{"text": "What about other nudity", "label": 1}
{"text": "Id give more details elsewhere but for some reason I feel weird talking openly here", "label": 1}
{"text": "But what about erections on their part", "label": 1}
{"text": "It's a little different here", "label": 1}
{"text": "This sounds very interesting", "label": 1}
{"text": "I think that happens sometimes", "label": 1}
{"text": "Make sure that you love the person you’re having sex with", "label": 1}
{"text": "Haha I'm down lmao what that bitch do", "label": 1}
{"text": "18m from Chickasha lol", "label": 1}
{"text": "Would it surprise you to know it wasn’t autocorrect?", "label": 1}
{"text": "Paying for sex at 18 is nuts 💀", "label": 1}
{"text": "Given that information I standby my original suggestions", "label": 1}
{"text": "To a woman who’s not into femdom, I’d say yes. Gotta find a chick who’s into it.", "label": 1}
{"text": "Oh yes, semen inside of you can alter your emotions. Studies show that women who have their partners semen inside of them have less depression and find themselves to be happier.", "label": 1}
{"text": "Um, yes. Those are red flag comments that imo can lead to a DB . Better get at it.", "label": 1}
{"text": "We can talk if you want / need.", "label": 1}
{"text": "I don’t understand why the height difference is a hang up. \n\nAnkle pick or foot sweep your man to the ground and show him who’s boss. Boom. Problem solved .", "label": 1}
{"text": "Yeah, well, what’s the real story.\n\nIs someone on medication? What’s been going on in life? Is she nursing and like 4 months postpartum? Do you do things to create a loving trusting safe environment where someone would want to explore kinks? Are you kinks extreme? Are you willing to make to make things work for both of you? Do you put effort in to\nBuilding intimacy so someone would want to have sex with you? Do you keep yourself in shape? Do you pitch in around the house? Do you alleviate versus add to her mental burden? \n\nMaybe think about some of\nThat", "label": 1}
{"text": "I see how it could have been read that way.", "label": 1}
{"text": "“Nerve endings are found throughout the vagina, including the anterior and posterior regions, the apex, and the cervix. However, the lower third of the vagina, near the vaginal entrance, has the highest concentration of nerve endings.” \n\nThe first few inches is where you earn your keep.", "label": 1}
{"text": "I would be carful worrying too much about labels from watching porn and having fantasy. I mean that’s why it’s there…to literally fantasize. \n\nI wouldn’t worry about labels much in general to be honest but if it’s something that is really bothering you you could read up on human sexuality and identification or just ask yourself :\n\n“Do I want to have sex with someone who has a penis. ?” If this answer is “yes, I do,” and you seek out consensual relationships of that nature then yeah, I’d label that as bisexual.", "label": 1}
{"text": "r/sex is to ask for _actionable advice_ about sex-related questions. See our pinned Rules post or visit our sub's sidebar to view our guidelines. \n\nYour post has been removed as it does not appear to meet those guidelines because either: \n\n1) You're not asking for advice. \n\nIf you want to post an idea, story, or rant, use /r/findareddit to find a more appropriate sub.\n\nor\n\n2) Your question isn't asking for any kind of advice we can or should provide. \n\nThere's too many examples to list but common ones include \"how come I'm not into __?\" or \"why won't my partner __?\" \n\nWe can't explain people's motivations to/for you. Nobody here is clairvoyant. Therefore, your question would only blind (and therefore irresponsible) guesses. Again, you can try /r/findareddit to find a more appropriate sub instead.", "label": 1}
{"text": "ZERO “wrong” with you. 27-45 is like peak libido for most women so actually you’re probably perfectly in the center of the bell curve. \n\nAs for the relationship with your husband, that is another story. Being in a long term relationship and then wanting to drastically make changes can be jarring. Not bad, or wrong, or even inappropriate, but jarring. IMO it’s your husbands position to be a partner and be supportive ins a way in which he’s comfortable, just as if the show was on the other foot. \n\nIt could be cause for some conflict, if he’s not interested or willing or simply off put by it, just as if there were any other major changes in the relationship like with finances or political or religious beliefs. Relationships work bc of a balance and shifts in balance can be a net positive or net negative from a standpoint of the relationships harmony. \n\n\nThis may just be the next best exciting chapter in your relationship together. Id look at it that way and then work on ways to communicate your wants needs and desires in a manner that is most likely to be received well by your partner and respectful.", "label": 1}
{"text": "Telling someone they are beautiful and sexy isn’t always received well and doesn’t create intimacy when there is potentially pressure to have better/more sex.\n\nWhile I hear you on the “working 40 hours” that’s really irrelevant. She probably feels she works 40 hours plus and never gets a break especially if your kids are younger. \n\n\nIf you’re hardly sleeping because you’re always doing something at home I’d look it to time\nManagement skills. Lack of sleep is a killer and you need to prioritize it , if you’re that busy, you need to manage your time better.\n\nMaking excuses for not going to the gym is just that. If you freed up your evening through better time management, you could go then- or get to bed, and then get up extra early before everyone is awake, and knock out a work out then so you’re showered dressed and ready for work/day before anyone else is ever up. You don’t need that much time and There are tons of programs that do\nNot cost much that can tailor a workout to you that’s no more than 30-45 min. \n \nGiven the sparse information- I’m filling in a lot of gaps with assumptions-but let’s be honest- most of our problems are all very similar variations of the same thing. Which means most of the fixes are as well. So, sparing any nuance to your specific situation- \nThere is a book I’d suggest checking out, it’s called the 80/80 marriage. Maybe you’re there already and if you are that’s great. \n\n\nNow let’s say you really are the top 1/2 of 1% and you really do have EVERY single one of these locked down. You can’t negotiate desire in a person. If you’ve done literally everything (you haven’t, let’s be honest, if she was here we’d hear the other side of the story) but if you had and there is zero desire there than “is what it is” my man and you have a discussion to have and a decision to make.", "label": 1}
{"text": "(I feel like I should put I'm 19 M)\nDam this is exactly what I'm feeling. Once me and my girlfriend started dating she mentioned sex and I felt extreame anxiety around it. \n\nI'm not sure what's causing it other than trauma, I've been SAed and don't enjoy kissing nearly as much as she does because of my past experiences. I agree kissing is way too wet. \n\nThere are parts I like about sex now that we've been dating for almost 2 years. But I still feel a lot of what you're describing. I've figured out that for me, the Intimacy is a big part that causes my anxiety, and also the part I crave the the most.\n\n I'd recomend a good therapist and a LOT of self reflection. If you wanted to reach out and chat about our experiences I'd be more than down. I've tried looking al over the internet for people with my experience and have come up dry. \nI'm wishing you Goodluck", "label": 1}
{"text": "Yeah man. Idk, guess you’re right. I mean she lets you post naked pics of her on the internet since you made this post about her shutting down after talking about your kinks, then 2 hours later she apparently “lets you do whatever you want” \n\nGuess I’m off base and you fixed it. Good on you! You need to give us advice obviously . That was quick work my man! \n\nhttps://www.reddit.com/r/WifeyPicTradingAmatur/s/X1dpKbgncD", "label": 1}
{"text": "As the old adage says….”with great power cums great responsibility”\n\n\nIf I was you’d I’d hire a marching band a throw a parade for myself.", "label": 1}
{"text": "OMG don't get me wrong but you sound incredibly pro at this i wanna try it out with you 😭", "label": 1}
{"text": "Micro penis is a thing, maybe you have a micro vagina?", "label": 1}
{"text": "As a fellow millennial, you're dumb AF. Not because of the jealousy and monogamy, but because you're now the boomer accusing the younger generation of things those who came before did.", "label": 1}
{"text": "You should have a taste, for science! /s", "label": 1}
{"text": "The sneaky behavior can definitely be a turnoff, especially if you’re already open about watching things together. It’s fair to tell him it’d feel better if he handled it more openly.", "label": 1}
{"text": "Completely understandable that the sneaky approach feels like a turnoff. Letting him know you’d prefer honesty about his solo time might help you both stay open and comfortable with each other.", "label": 1}
{"text": "It’s completely understandable to feel turned off when your partner sneaks around to watch porn instead of being open about it; honesty is key in a relationship. Encourage him to communicate his desires openly, as this will likely strengthen your connection and intimacy.", "label": 1}
{"text": "Then you are saying indulging in threesome is something you should be proud of? Didn't she have a threesome in her past ?", "label": 1}
{"text": "Obviously it is 2024 and i am the wrong guy :⁠-⁠) , why don't you upload your nudes ? That's pretty cool to be doing in 2024 truly !", "label": 1}
{"text": "It's completely valid to want transparency and openness in your relationship; communicating your feelings about his behavior is key to maintaining intimacy and trust. You deserve to feel desired and respected in your sexual experiences together.", "label": 1}
{"text": "It’s understandable to feel turned off when your partner sneaks around to indulge in porn while you’re asleep, as it can create a sense of mistrust; being open about how this behavior affects you can help him understand your perspective. Encourage him to be more upfront about his needs and desires to maintain a healthy balance in your relationship.", "label": 1}
{"text": "Same here! It was a little much but my girl  cums when it’s time! I say make him “suffer” for your pleasure!", "label": 1}
{"text": "I love pussy juice my favorite", "label": 1}
{"text": "It will ruin your mental health now……. Replace the car with a new one that is better & respects you……. It’s the car that started the comparison then why not get a better car.", "label": 1}
{"text": "you don’t throw away ten years of marriage because your partner doesn’t want you to pee in their mouth. i’m sure the usual wet fluids are fine seeing as he didn’t have an issue until she squirted. it’s just the squirt and that’s valid", "label": 1}
{"text": "it just means that you have to pay the bills and all the other boyfriend related activities, while other people get the lover related activities. You know very well your gut feeling is right, why do you ask? reddit will never be on your side in this kind of matters", "label": 1}
{"text": "Trauma is a powerful and complicated thing, it can definitely affect our sense of self and our desires", "label": 1}
{"text": "insecure fragile manlet found.", "label": 1}
{"text": "No you're totally right about what you're saying girls can have multiple orgasms they can squirt multiple times and they can come multiple times guys can only come once maybe twice if they rest for a little bit", "label": 1}
{"text": "Ok thank you. I will do that", "label": 1}
{"text": "Why, explain if I am just going to be told to just seek help, even though I have done all of it?", "label": 1}
{"text": "How is it hurting myself?", "label": 1}
{"text": "Why post anything here at all then! Either elaborate or bugger off.", "label": 1}
{"text": "It is not a mental health issue. This is purely physical. Why do you guys say it is a health issue? Are you truly confident that you believe that? Me being here is more dangerous and bad for then getting castrated, I have been through far worse than the damage this might do to me.", "label": 1}
{"text": "Not 100% pee, but there is 100% some pee in it. ", "label": 1}
{"text": "Ummm, forced to work 40 hours just to live, not even close to healthy or good for you, have to do things I hate, forced to care about friends or family, everyone and everything when I just want to live my life, but no I am told I need friends, I have to be social, I need to do this, I need to feel this way, I need to be that kind of person, all my life, I never get a break from it, just a full on almost 30 years of nothing but stress, try adding being a male with hormones and bodily chemicals and boom, it's literally hell. So, yes I want juat a little bit of relief of stress, and I know being horny for women is Innate and it is making it worse.", "label": 1}
{"text": "I wouldn't add \"lmao\" to such serious stuff", "label": 1}
{"text": "If I tell you, then you need to tell me how to do this. I am content with being attracted to women. I don't see a need to have an innate attraction if they are unable to have the same for me. I can always make friends with women, just fine, with 0 effort, but they are unable to be attracted to me. Even after talking to hundreds of girls, they all just see me as someone to talk and vent to, so why should I have an attraction? It's a waste of energy, and I am stuck with this until I die, and I don't want to deal with it, I want it gone.", "label": 1}
{"text": "Which is a very good reason to get a castration.", "label": 1}
{"text": "Then I don't know what to do anymore, I am going to get worse if I do, it will get worse if I don't, there are no options left.", "label": 1}
{"text": "Should I just let the stress do all the work?", "label": 1}
{"text": "It sounds like you’re navigating some complex feelings around intimacy, which is totally normal! 😅 It’s okay to feel anxious, especially if you’re not used to being intimate with someone. Communication with your boyfriend is key—maybe talk to him about your feelings and boundaries. You don’t have to rush into anything until you feel ready! 💖 Focus on what makes you comfortable, and take it one step at a time. It's all about what feels good for you!", "label": 1}
{"text": "Yeah it was too early..but how about you to take my pants off and play with my manhood😂😂", "label": 1}
{"text": "I haven't had therapy yet", "label": 1}
{"text": "***Communicate with each other.***", "label": 1}
{"text": "Yeah it's pee. There is no secret stash of magical squirt. It's just urine that gets released as you relax your bladder.", "label": 1}
{"text": "being sexually attracted to someone is sort of analogous to your favorite foods. there are things you like and things you don't like. And when you come into contact with it you have that response. \n\n  \nWHY is it that way. that's probably a longer thesis on human psychology, biochemistry, evolutionary biology, sociology, etc. \n\nsexual chemistry i find comes down to two things, initial physical attraction followed by a steady growth in emotional attraction (lol omg did we jsut both order the same thing and also laugh at the same thing hahaha omg...) mixed in with open communication. \n\nThere is an immense connection when you're nervous to share parts of yourself, and when you get up the courage to do it, it's not only immediately accepted but validated with a \"omg, i feel the exact same way.\"\n\n  \nis it rare? don't know, hard to answer, but i think it would be much less rare if your initial approach to romantic relationships is the right one.", "label": 1}
{"text": "it's 100 percent urine", "label": 1}
{"text": "\"mine put in a real effort to give me a good time and I did the same for him.\"\n\nthis is the key and what most people do not do. \n\ncongrats! i hope you have a long and healthy relationship that brings you both immense happiness. I think the number one quality you should look for in a partner is \"their willingness to grow.\" you will change, he will change, things will change, and having a foundation of a growth mindset can set you up for long term happiness. \n\nkeep on kicking ass!", "label": 1}
{"text": "\"and I continuously feel insecure thinking what if she's comparing regularly.\" \n\n\"Please don’t say I am insecure. Its not about being insecure\"\n\nIt's like you're verbalizing your own issue but afraid to confront it. \n\n  \nThis is a you thing and the root of your entire problem. you're being very diffident. you need to start here and spend some time on yourself before you cause issues in your relationship.", "label": 1}
{"text": "that makes me thing you look at sexual chemistry as a binary \"we are good together, we are not good togther\"\n\npeople who have been in LTR who have amazing sexual chemistry have had days where they had bad sex with each other. \n\nit's not an all or nothing thing. \n\nmy point was speaking to how you find sexual chemistry. in a ONS you can have \"good sex\" but i wouldn't label that as \"good sexual chemistry\" since that person doesn't even know 1/100th of what i like in bed. we had one fun night, the sex was good. we could of easily of had one bad night and never spoken again, buuuuuuut perhaps that person was completely sexually compatible and you based it off of a random hookup?", "label": 1}
{"text": "No no he isn't gaslighting me. He has kinks too so it wouldn't be any good for him to Gaslight me . In fact he loves rough sex more than me yet he stopped in concern.", "label": 1}
{"text": "You‘re fucking 18y old what are you even talking about kinky rough sex?! Go for normal sex first and stop watching so much porn", "label": 1}
{"text": "For real, OP lays out a gem like that and calls his wife awkward 🤣", "label": 1}
{"text": "Stop assuming stuff and why are you being rude?", "label": 1}
{"text": "If clean chat then okay or else bye bro. Stay safe.", "label": 1}
{"text": "Clean how like no nsfw?", "label": 1}
{"text": "Yup and no creepy stuff", "label": 1}
{"text": "Yea I like dick. Only romantically attracted to men.", "label": 1}
{"text": "Yea I thought about if it was just the wrong women - But I have tried it like 6 times now, and not being attracted so", "label": 1}
{"text": "No because you Said Maybe it was the wrong women, so I thought I had to try it several times so I was sure😅 no I didn’t found them hot - I thought they were nice. And this was after scrolling through thousand of women on tinder", "label": 1}
{"text": "Because people kept pushing on it was the wrong people. It was just I found women attractive in porn, I never really do irl.", "label": 1}
{"text": "Fair enough tbh lol", "label": 1}
{"text": "True! :)", "label": 1}
{"text": "Lmao", "label": 1}
{"text": "I would speak to him and tell him it's nothing to do with him for starters as it could course him to worry that he's not good enough (this is the partial reason my husband is a porn addict) also ask him about toys if he would be up for using them I honestly wouldn't use them too much though as they can make it harder for you to climax in other ways look up different positions it's all about the angle so lay flat on your stumic pillow under your abdomen legs straight and him staddle your arse and thrust downwards into your gspot if you want to make it better for him cross your ankles will make you feel tighter but he could also cum quicker look up the Coital alignment technique that simulates your clit while he's inside you cock rings if there not too tight on him my husband hates them because they are too tight but great for clit stimulation when riding him. In missionary pillows under your hips or him lifting your hips then he should be thrusting into your gspot also try a vibrating love egg we use an app controlled one that he controls from his phone before we have sex if your daring enough could use it whilst out and about it will stimulate your gspot and things could get messy when you do have sex after using it plenty of foreplay and pre foreplay 👌", "label": 1}
{"text": "Possible, yes, probable, don’t think so", "label": 1}
{"text": "More communication, more foreplay, for guys that are premature is always good to come once during the foreplay to hold longer during the sex.", "label": 1}
{"text": "Try to have sex in a wall, while he is carrying you, this will allow you to do the top movement with support from the wall.", "label": 1}
{"text": "Push it in whilst she is asleep, that way she won't be able to tense up", "label": 1}
{"text": "Go for the v unless you prefer dudes or something", "label": 1}
{"text": "Sometimes you just have to force it in", "label": 1}
{"text": "Kids are 5-15. She lets them explore her body. Yes I want her to be on the same page", "label": 1}
{"text": "She lets them explore her body", "label": 1}
{"text": "They're all erect usually. They play with her breasts and let her massage them between the legs. They poke the pubic area and smell it.", "label": 1}
{"text": "You're nice. Very helpfull advanced stranger", "label": 1}
{"text": "Like, stop trying to put it in there already!", "label": 1}
{"text": "A fi-fi!", "label": 1}
{"text": "Thanks for all the advices! I'm not really used to penetration, I didn't masturbate frequently in my life and whenever I did it was only touching it and not going deep inside. That was why I was a bit panicked. I also hope it will go easy.", "label": 1}
{"text": "This is no place for your incest porn fantasy bullshit. \n\nIf, in some bizarre twist, you're actually serious and genuinely stupid enough to not know the answer to your own question,, call CPS or the cops and ask them if it's normal. (It's obviously not.)\n\nThis shit doesn't belong here.", "label": 1}
{"text": "Thoughts? You're an immature, rude, arrogant prick likely incapable of developing real relationships in life and so reduce everything down to trying as much as possible to avoid facing the face you are subpar. \n\nNo matter who you have sex with or marry, unless you significantly change life and sex will always remain a disappointment due to your lack of mental development.", "label": 1}
{"text": "Find Guy #5.\n\nAlso, figure out how you want sex to be a part of your life. Sounds like you have some conflicting impulses that you're struggling to reconcile. Guy #2 was the epitome of the \"He's out of line, but he has a point\" meme, as you seem to be aware. You can still be a practicing Christian and get ethical casual ass, but reconciling your faith with your sexual needs is ultimately on you, and the sort of thing you should have a decent handle on before you invite another human into the mix.\n\nBut, yeah, you need Guy #5.\n\nGuy #1, I'm guessing is your ex for a reason. Guy #2, you know what to expect; he's gonna fuck you well and leave you feeling like shit, and the post-nut clarity is gonna suck. Guys #3 and #4 aren't worth the bother. So try and do well enough with Guy #5 that you don't need Guy #6.\n\nGood luck.", "label": 1}
{"text": "I didnt meant to harm her.  \nI lost my emotions and control", "label": 1}
{"text": "Don’t feel guilty about body count, no one should care about something like that, just do what you want. However, guy 2 should’ve respected your boundary of not having sex again right away. The fact that he made advances after you told him you don’t wanna do hookups anymore means he doesn’t respect your boundaries. Don’t compromise on your boundaries, if you don’t want to do hookups, don’t do them. But if you don’t want to do hookups because of body count, don’t worry about body count.", "label": 1}
{"text": "Where the fuck has this 'body count' nonsense come from?\n\n\nWhy does it matter? Who is going to know?", "label": 1}
{"text": "Well that's what you get you want the chad not the nice guy", "label": 1}
{"text": "Thank you for posting in the r/Sex community. To ensure that everyone respects our safe space, we ask that you familiarize yourself with our Forum Rules and Posting Guidelines — which are visible in the forum’s sidebar, and also linked [here](https://www.reddit.com/r/sex/about/rules/).\n\n***\n\nRestricted subjects in r/sex include sex stories (which are permitted in the Weekly Sexual Achievement Thread only), body image and penis-size issues, hookup attempts, common topics which are considered repetitive in our forum, and requests for private chats.\n\nTo cut back on comments that add little value to the conversation, we have instituted a minimum character requirement that will silently remove comments that fall below it.\n\n***\n\nAny attempt to seek private chat or otherwise deviate a conversation away from the main forum, WILL result in a permanent ban. This goes both for OP and for all comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "[This on](https://anesidoralove.com/product/real-feel-vibrating-dildo/)e meets most of your requirements. It's the perfect size, not too long or too short, not too wide or too small. It's phallic-shaped and has a powerful suction cup. Best of all, it's made of body-safe silicone.", "label": 1}
{"text": "(Also ignore the men in the comments, they feel called out on shit like this and try to shift the blame)", "label": 1}
{"text": "Look, man, if she felt fully secure with you, you’d already be there. You’re overthinking this like it’s some puzzle to solve. It’s not rocket science: you initiate, you dominate, and you read her non-verbal cues. Confidence is key here. When you’re constantly tiptoeing around and checking in every two seconds, it’s more likely to make her feel unsure than safe.\n\nMan up and take the lead. Don’t ask her if she’s okay every step of the way; instead, keep things relaxed and focus on creating a vibe where she feels comfortable and can open up. If you’re showing confidence and tuning into her responses without over-analyzing, things will naturally progress. Own the moment—if she’s into you, she’ll let you know.", "label": 1}
{"text": "it can be, but lots of people are bad at it too, glad you're having fun", "label": 1}
{"text": "And what do you like to sext or role play about?", "label": 1}
{"text": "Hotel fun is the best", "label": 1}
{"text": "is it cheating if you do this in LDR", "label": 1}
{"text": "Sure 2 hr account posting non stop about sexting.", "label": 1}
{"text": "you should download anonchat, a lot of people do that in this app and you don’t even need an account, it’s very easy to understand how the app works", "label": 1}
{"text": "11 years is not being impatient in my book. In fact I would label that as being EXTREMELY patient. He’s lucky to have such a patient partner", "label": 1}
{"text": "you single and near the d.c area? I'd love to take you on a date and maybe experience this lol", "label": 1}
{"text": "Damn this is tragic. Got the final boss of vaginas", "label": 1}
{"text": "You know what I mean…", "label": 1}
{"text": "She’s not turned on. The sex is bad.", "label": 1}
{"text": "Thank you for your submission to /r/sex. Your post was removed because it appears to be a question about birth control or if you or someone else might be pregnant. These posts are not allowed. The topics are well covered by the [PREGNANCY FAQ](http://www.reddit.com/r/sex/wiki/index#wiki_pregnancy_faq) in general, and, if you're worried about a specific incident, no one can really know the likelihood that it resulted in pregnancy. You might also find the [FIRST TIME HAVING SEX FAQ](https://www.reddit.com/r/sex/wiki/index#wiki_first_time_having_.27sex.27) helpful as well. Also, please check the TOP POSTS FROM THE [LAST DAY](https://old.reddit.com/r/sex/top/?sort=top&t=day) [WEEK](https://old.reddit.com/r/sex/top/?sort=top&t=week) [MONTH](https://old.reddit.com/r/sex/top/?sort=top&t=month) [YEAR](https://old.reddit.com/r/sex/top/?sort=top&t=year) and [ALL TIME](https://old.reddit.com/r/sex/top/?sort=top&t=all). If your post was not asking if you or someone else might be pregnant or a generic question about birth control, then feel free to [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) and ask that your post be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "I get off to the thought of my husband and his niece way too often lol", "label": 1}
{"text": "Start slow and communicate with your partner. Use one or two fingers, and focus on areas that feel good.", "label": 1}
{"text": "It’s completely understandable to feel defeated when you’re navigating such a complex landscape of intimacy and connection, especially as a trans man in a less populated area. Sex positivity should indeed encompass a broad spectrum of preferences and not be confined to mainstream notions of pleasure or orgasm. It’s frustrating when people equate being sex-positive with adhering to specific standards or practices, like focusing solely on physical pleasure or achieving climax. The essence of sex positivity lies in embracing diverse sexual identities and desires, which includes acknowledging that what works for one person might not resonate with [another.You](http://another.You) deserve relationships where your desires are met with curiosity rather than judgment.", "label": 1}
{"text": "Have you tried water-based lubes? They can work well with SKYN condoms in the shower. Also, consider looking into silicone-based lubes, as they tend to hold up better in water. Just make sure they're compatible with your condoms!", "label": 1}
{"text": "Who will be the legendary hero to succeed", "label": 1}
{"text": "King Arthur, who won’t be forced to pull the sword out?", "label": 1}
{"text": "Add me snap, johnt9340", "label": 1}
{"text": "You may not be an “expert” but you care.m and that may get you further than your local doctor. And today with AI and connectivity to doctors all over the world you can solve the problem. Doctors aren’t as hyped up as they used to be. Read & search without ceasing. 💪", "label": 1}
{"text": "Honestly, it sucks that you're dealing with this! Sex should be fun and fulfilling for everyone involved. Have you tried talking to your partners about what feels good for you? Communication is key, and maybe they just need to know what you want. Don’t settle for mediocre—your pleasure matters just as much! 🌟", "label": 1}
{"text": "Many people have concerns about side effects, especially regarding libido. While some may experience changes, others don't notice any impact at all. It's important to talk to your doctor about your worries  they can help find the right medication for you. Hearing others' experiences can also be helpful,", "label": 1}
{"text": "Until 17 years old? Wtf u mean u started at what 13?", "label": 1}
{"text": "It's possible that frequent masturbation could affect your sensitivity. Reducing it might help you enjoy intimacy more.", "label": 1}
{"text": "Doesn't sound magical to me...", "label": 1}
{"text": "Many people experience comparisons in new relationships, especially after trauma. It might take time for him to fully engage with you without those thoughts intruding.", "label": 1}
{"text": "A good option might be a travel-sized masturbator; some brands offer sleek designs that are easy to conceal.", "label": 1}
{"text": "Yes. She made my cum before from handjob", "label": 1}
{"text": "na don't feel guilty about bj. And yes we have had penetrative sex with a condom", "label": 1}
{"text": "We have also done anal and dirty talk get me going tol", "label": 1}
{"text": "Men are weird.\n\nCasual sex if you get easily attached and you’re an over thinker - not a good idea.\n\nIf you want casual sex then go ahead but please be careful , make sure you’re protected against STIs and pregnancy. But also protect your heart.\n\nMen who want more than sex will message you and talk to you.\nMen who just want sex will get it then never speak to you again (unless they want more sex, in which case they’ll keep asking for it)\n\nOn the other side\n\nMy ex was begging a few women for sex and cuddles and company… all of those women laughed at how pathetically clingy he was. \n\nSo it works both ways \n\nJust please be careful with your heart.", "label": 1}
{"text": "I feel sorry for him, he’s clearly inexperienced.\n\nI feel sorry for you too - I’ve been in your position.\n\nIf you really like him and want to keep the relationship then he needs to know he’s bad in bed, and he needs to be willing to improve. But you should tell him in a way that doesn’t offend him (men are delicate creatures). \n\nTry telling him “i would like it if you did this…” or “touch me here”\n\nIt’s frustrating when they rub you like they’re trying to summon a genie, or when they’re thrusting away and you’re trying not to yawn. I get it.\n\nBut be gentle with him - teach him. If he is willing to learn and put in the effort then you two could have mindblowing sex.\n\nIf he’s not willing to try, then leave him and find someone who is. Life is too short for shit sex.", "label": 1}
{"text": "Brownie points for masturbating to your girlfriend. You’re a keeper just for that", "label": 1}
{"text": "Yep my ex was like that… 45 min “poops”", "label": 1}
{"text": "Abortion shouldn't be used as a form of contraceptive which would be the case here. It can be very taxing on the body including making the woman infertile.", "label": 1}
{"text": "Sex drives are up and down with life milestones. Moving in, babies, work can all affect it.\n\nCommunicate, flirt with him, go on dates - reignite him by teasing him.", "label": 1}
{"text": "Yes her teqnique is very good", "label": 1}
{"text": "Ya lol she sends me bikini pics", "label": 1}
{"text": "But she low key liked it!", "label": 1}
{"text": "Oh my...😍", "label": 1}
{"text": "Yes I read hickeys can cause illness is that true", "label": 1}
{"text": "Girl what 💀💀💀💀 NIECE?!", "label": 1}
{"text": "yes", "label": 1}
{"text": "It's probably a combination of societal expectations, toxic masculinity, and the lack of open communication about sexuality.", "label": 1}
{"text": "Genital herpes has an incubation period of 7-26 days. If you have been together for over 1 year and it was her first episode then she must have gotten it during your relationship. As for the symptoms, there are many possible causes of what might be vulvovaginitis, these require a physical examination, urine tests/vaginal swabs.", "label": 1}
{"text": "It's totally okay to be a virgin at 35! 🥰 Everyone's journey is different. When it comes to bringing it up, try to find a relaxed moment to share your thoughts. You could say something like, \"I haven’t really dated much, and I'm looking to explore that part of my life now.\" Keeping it casual can help ease the tension! Just be open and honest, and you'll find someone who appreciates that. 😊✨", "label": 1}
{"text": "Don't worry too much about the age difference; what's important is how you feel about each other. Just enjoy the moment... It’s amazing to hear how much passion there is between you two! Keep nurturing that connection and see where it leads.", "label": 1}
{"text": "It's important to listen to your body. If you're experiencing pain after sex, especially if it's different from what you've felt before, it might be worth consulting a healthcare professional. Everyone's body is unique, and what feels normal for one person may not be for another.", "label": 1}
{"text": "Totally understand. It’s very freeing to arrive at that moment mentally and be able to jettison the baggage religion added", "label": 1}
{"text": "See this is what I was curious about. It seems like there would be a correlation but maybe there is enough overlap of people raised non religious that it merely points to “we just all develop any number of kinks regardless”", "label": 1}
{"text": "Consider having an open conversation with your partner about your preferences. You could suggest mixing in more serious moments alongside the playful ones.", "label": 1}
{"text": "Everyone's body responds differently, and what you're feeling is valid. It might help to explore different techniques or settings that could enhance your comfort and pleasure. Also, consider giving yourself permission to take your time and not rush the process. If you're concerned about your sensations or feelings afterward, talking to a professional might provide clarity and reassurance.", "label": 1}
{"text": "   Got a buddy that married like this, he was abt your age, she was maybe a lil older, he was infatuated with her, they had some kids and she turned out to be a controlling crazy bitch. Now he pays child support and is married to someone closer to his age…. Word of advice, it’s too late to “Don’t shit where you eat” meaning don’t fuck around at work, once shit goes sideways you can kiss that job goodbye. For the time being though, smash that as long as you can for as long as it lasts, but know it won’t last.", "label": 1}
{"text": "How can you talk about having a violent reaction to cum in your mouth when you just commented on another reddit post where you said a young teenage girl \"low-key enjoyed it\" when she was sexually assaulted... Shame on you. Your husband should assault you in the same exact way the teenage girl was assaulted. Let's see if you \"low-key\" like it too Karen. Shame on you!", "label": 1}
{"text": "\"Sometimes I wonder who I would have been if my family wasn't insane.\"\n\nwhile i absolutely have share that sentiment, and had that thought many times, i have since come to the conclusion that it doesn't matter. meaning, that is metaphorically an alternative universe, not the one I'm in, everyone had to \"start somewhere\" and since I'm a grown thinking adult now, it doesn't matter because i can recognize behavior and tailor my responses and desires accordingly.\n\nmeaning, while i believe everyone is a victim of their circumstances, it's only to a certain point where one is, then they are able to at some point take full control and have full autonomy", "label": 1}
{"text": "Don’t over think it baby , just enjoy being fingered and cum all over that finger. He enjoys it . So just happily please him . If it’s smelling his finger . Know your pleasuring him", "label": 1}
{"text": "i fear that wanting to spice tings up over a \"reconnecting\" weekend might put a lot of pressure on yourself and her and end up having the opposite of the intended affect. my suggestion would be to go into it with as little expectations as possible, and while you are reconnecting, have a conversation(s) about ways in which you both would be happy to spice things up!", "label": 1}
{"text": "A) Never stick your dick in crazy. \n\nB) There is no way you put a baby in her, so you don't owe her anything at all. The less you engage with crazy people, the better.", "label": 1}
{"text": "Heya! I’m Faye, if love to chat, 20F", "label": 1}
{"text": "Don’t make sex with your partner about your validation. As you said, you are fairly inexperienced compared to your partner - how could you expect to be the best? Just ask him what he likes and what turns him on, and if it aligned with your interests, do that. Also - don’t forget to discover what you like and what turns you on - it’s not all about him and his ideas of what is “the best.” What would you like from him so that you could experience the best sex, according to you? \n\nThe best sex, in life, is when two people can melt into eachother and forget themselves, absorbed in love and serving one another - and you get to that place over time and with communication, trust, safety and feeling secure with one another. It’s not about how kinky you are - and if kink is what his “best” meter is based on, he is having sex for sensory gratification more than he is for love. Just slow down, explore each other - you are an entirely different person and experience than his ex - and as you two love another, and as that is nurtured and grows, the best is yet to come.", "label": 1}
{"text": "And then he is 'genuinely' breaking her confidence? Hmm OP's post sounds like a future post on r/twoxchromosomes.\nOrange flag at best.", "label": 1}
{"text": "\"I’m too shy to ask why he does it\" \n\n  \nwhile i can sympathize with this feeling you really need to learn to advocate for yourself. it's not ok for people to do things to you and your body that you are not comfortable with and do not like. there are a million resources available for how to handle conflict, be less shy, or speak up for yourself. he needs to \n\n1. wash his damn hands,\n\n2. be more considerate of your feelings and foster and environment where you feel comfortable talk., \n\nthe bigger issue here though is your inability to speak up and advocate for yourself. you need to focus on that and learn to be able to do this. it will be a major problem in your life if you do not. it's ok that you are shy. it's great you recognize that this is the reason you do not want to speak up. but it is on you to learn how to handle that emotion while being able to communicate your feelings appropriately.", "label": 1}
{"text": "It's crude to do it and talk about it like that, but it's normal for men to do it.", "label": 1}
{"text": "i could enjoy but not everyday", "label": 1}
{"text": "she would get wet for sometime, when i take a little lead she would ask me to stop In romantic way or sometimes like really! she would touch herself badly", "label": 1}
{"text": "no, we never really talked about this! she once said she did masturbation ,i was shocked! so sometimes i feel her horniness is wayy higher to match!\n\n and she gets wet easily doesn't concern me but yeah! she ask me to stop right after", "label": 1}
{"text": "No! something is really concerning! but i can't share here!\nwhich makes me conern about her sexual desires", "label": 1}
{"text": "Sounds normal. If it becomes distracting no out you think it’s a problem bring it up to your healthcare provider", "label": 1}
{"text": "It is good that we are recognizing the subjective nature of this, so what I would do is break it down into two very general extremes:\n\n1. When does it become unreasonable to *expect* more sex? more than 3-4 times a week.  \n2. When does it become reasonable to feel like sex isn't happening at all? 1-4 times a week.\n\nSituations exist outside of this range, as people are different, but if someone NEEDS sex more than the first one they are very likely using it as an unhealthy coping mechanism that cannot deal with real world events, and if it is happening less than the second one it's very reasonable to consider one's sex life to be dead and desire to figure out how to handle that in terms of the relationship.", "label": 1}
{"text": "Your post has been automatically removed because it appears to be about early ejaculation. We get numerous submissions regarding this daily because it happens to lots of men at some point. However, because it is a topic that comes up so often and is [well covered by our FAQ](http://www.reddit.com/r/sex/wiki/index) our community has asked the mod team to direct posters with these concerns to these resources instead. If you're interested in discussion on the topic, please do a search of /r/sex and read some of the many past discussions on the topic. If you feel the topic of you post is not covered by the FAQ, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) and ask that your post be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "Thank you I will search for a therapist but wanted to get rid of them asap or at least before going to one.", "label": 1}
{"text": "I thought so too as they aren't really \"my kinks\" but kinks created by my trauma. I am lesbian but my fantasies are about men cause I was assaulted by one and that Idk kinda makes me think about it a lot. i never ever was into men before and know I am not really romantically or sexually interested in them.", "label": 1}
{"text": "Hmm okay yes that makes sense. I just wish there was a band-aid solution too.", "label": 1}
{"text": "does someone want to meet up and fuck", "label": 1}
{"text": "Ok thank you and you are probably right. I just thought I would at least try it and see if someone has a solution. I will look CNC up cause I never heard about that.", "label": 1}
{"text": "I guarantee you that 99.9% of husbands /boyfriends would not be in the least bit offended. The other 0.1% vote republican.", "label": 1}
{"text": "Oh brother this guy STINKS🍅🍅🍅🍅🍅", "label": 1}
{"text": "Hugs", "label": 1}
{"text": "During sex slowing the thrusting down or thinking about something nonsexual can help. But, at 17, there's not gonna be much you can do to slow it down. \n\nAs you gain more actual sexual experience, you will also likely last longer. You kinda get more used to the sensations. Right now, you are young and not used to those sensations, so they have a greater effect on you. \n\nThe girls/women you are having sex with are likely also not as experienced or understand what you are dealing with. If they try to shame you about it, don't waste your time on them. \n\nI remember when I lost my virginity, it was to a cougar. I had so much going on in my head that I went soft. She was super chill and understanding and helped me calm down, and I got rock hard again. \n\n Don't worry, when you get older you will have the opposite problem.", "label": 1}
{"text": "Based on what information you provided, love has not been introduced so is indeed not part of the equation yet. All you talked about was getting your dick sucked.", "label": 1}
{"text": "Sounds hot to me -- and I think she'd agree!", "label": 1}
{"text": "You’re both 19 and you’ve been together 6 moths …love is not part of the equation yet .", "label": 1}
{"text": "Day trading can be very lucrative but also incredibly fucking disasterous. If you don't TRULY know what you are doing in the market and are using it to \"gamble,\" you will 100% lose more money than you ever gain. Just like in Vegas. You win big at black jack, walk away with 100 grand, think you are the shit, then go play again and lose it all, plus some.. and end up going to bed with less money than you started with.\n\nIt's easy to make 1500 in the stock market by straight up \"gambling\" but it's even easier to lose it if you see that money and think you could make more. Then the stock tanks and now you take a massive loss.", "label": 1}
{"text": "Have you tried showing him your penis?", "label": 1}
{"text": "A needle and a tweezer, I remove them myself. Easy.", "label": 1}
{"text": "That’s hot", "label": 1}
{"text": "Wish I knew some", "label": 1}
{"text": "condom alone is safe, no contraception is 100% but it’s quite effective. condom + pull out is even lower again. both ways are good just as long as you’re using a condom.", "label": 1}
{"text": "Can't help it, you're gay now.", "label": 1}
{"text": "thats true, theres also the feeling that i might be wrong but i guess that one is irrelevant now", "label": 1}
{"text": "Maybe you have hypersexuality. It’s happening to me to these past months", "label": 1}
{"text": "It's difficult to find someone who loves you. These days, boys are too desperate to find sexual partners rather than lovers. Somewhat true for girls too.\nStill you need to find someone who cares for you", "label": 1}
{"text": "Porn just porn he is into porn and IN HIS HEAD you are the slut,dumb bitch,wore, submissive gf", "label": 1}
{"text": "Yikes, that sounds like a complicated situation! It’s definitely a red flag when your FWB suddenly shifts to cuddling mode while you suspect she might be getting cozy with her roommate. The note you found seems pretty suspicious too—sounds like the roommate is making his move. If you feel like you’re just being kept around as backup, it might be time to reassess things. You deserve more than to be someone’s safety net! Maybe have an honest chat with her about what’s going on. If it feels like she’s already moved on, it could be best for you to step back and find someone who’s equally interested. Remember, it’s not worth sticking around just for the cuddles!", "label": 1}
{"text": "Consult gyno near by u for better results.", "label": 1}
{"text": "Visit gyno for genuine solution.", "label": 1}
{"text": "Always ask for papers. \n\nGuys lie for pussy. \n\nSource: I was a young once.", "label": 1}
{"text": "And the just don't get tested", "label": 1}
{"text": "Do you mean that you get pregnant and you never see him again?", "label": 1}
{"text": "And they don't get tested at the right times for things to show up", "label": 1}
{"text": "Like all books and information, you take what you like and jettison the rest", "label": 1}
{"text": "Ew you sound gross honestly", "label": 1}
{"text": "It’s a joke from a popular meme within the last year or so. In fact the girl has the number 3 podcast globally which is insane", "label": 1}
{"text": "Relax bro, the post was about a man and the comment we're replying to was about men. No one is saying only men. The sky is blue and the ocean is too.", "label": 1}
{"text": "It’s really important to tell men that they aren’t these inherently evil creatures when it comes to sex. It’s why the alt-right pipeline has been so successful—the world constantly tells men that they’re liars who manipulate women. \n\nIt’s important to correct that narrative when it comes up.", "label": 1}
{"text": "Relax. \n\nMen aren’t evil but they do lie. I’m a man and have had male friends. I was young and saw dudes lie for pussy. This situation is from a woman talking about, yup, a boy. \n\nDon’t be weird. No one is demonizing no one.", "label": 1}
{"text": "I am genuinely concerned about how the right wing has monopolized on men’s sexuality because so many spaces are designed to make them feel ashamed, embarrassed or worse. I think it’s worth engaging in conversation how we can stop that from happening, and I think reflection on how we talk is crucial.\n\nI don’t know if that makes me “weird” or makes it seem like I need to “relax”. I thought my comments here were all reasonable.", "label": 1}
{"text": "Yeah go heal dude. You ran to this conversation and added nothing. Nobody is shaming men here, you are just being weird.", "label": 1}
{"text": "Idk if the person body-shaming random women on r/amiugly is in a position to tell people to “heal”", "label": 1}
{"text": "She's a clearly gorgeous woman. That was the point of the comment. But sure lil dude go look through more comments. That subreddit is notorious for clearly attractive people commenting. Now back to the subject at hand.", "label": 1}
{"text": "Hello, I am 29 years old and I have been in the webcam modeling industry for 5 years. I am not a TOP model and I like not being one, because the few users who see me in my interaction room can talk to me directly about whatever they want without being specifically sexual. Clearly, if these users support my work with money, then this is how I live and how. If you are interested, I can answer whatever you need. Sorry if this text is poorly written, it's because I don't speak English and I use a translator.", "label": 1}
{"text": "Grosssss dude", "label": 1}
{"text": "Have you read it? Been awhile since I read it but I don’t remember it being about that - I do remember it talking about how men could dirty talk during sex. \n\nHappy to receive any suggestions for reading you have on the topic.", "label": 1}
{"text": "How bout Greys Anatomy", "label": 1}
{"text": "Just be yourself and let the moment happen naturally", "label": 1}
{"text": "\"Before you guys say women always go back to their natural grip, though this might be true I’ve seen labias that tell a different tale. So help me out here…\"\n\ni hate that the sexual education has failed us so badly.", "label": 1}
{"text": "Oh ok how bout this one \"Blue Valentine\"", "label": 1}
{"text": "it’s like a financial seminar but with more leather and less paperwork! Just remember, the only stocks you should be investing in tonight are... well, you know!", "label": 1}
{"text": "if you think of it as a competitive sport, you might just find yourself enjoying the game! Just remember: no one likes a sore loser!", "label": 1}
{"text": "It is not sterile.", "label": 1}
{"text": "My apologies that my comment did not meet your standards. My commentary on the failure of sexual education is just that. Your spin on it being a contextual eye roll is your own take, highly presumptuous, and off base. The answers had already been provided, I was not the first to post. Although, I’m curious, how could there not be a shadow when you’re obviously casting so much light! Your brightness is blinding! No matter where I stand in front of your intellect a shadow will obviously be created. I’m lucky to have had you grace me with your judgements. From now on I’ll send my comments directly to you for editorial review, and you can either approve or deny them moving forward. Much appreciated!", "label": 1}
{"text": "Only suggestion is to wash regularly and look into deodorants etc. for sensitive areas..", "label": 1}
{"text": "Smelly cat, smelly cat\n\nWhat are they feeding you?", "label": 1}
{"text": "Yes sometimes a breakup does feel like anal sex", "label": 1}
{"text": "Number one rule is that time heals all. Give yourself a minute.\n\nNumber two rule is that you’re young and statistically you’re going to find something better and one day look back at this and laugh at your past self.\n\nI sure know that I did.\n\nTake it easy and keep your eyes on the horizon!", "label": 1}
{"text": "you're very welcome!  be better next time or at least be out of the way.", "label": 1}
{"text": "Talk with her about the fantasy. \n\nIf you really want to be cuck then you have to make sure that your girlfriend does all the stuff with the dude in front of you (maybe in a room) and observer how you feel.\n\n99% chances are that your fantasy is true.", "label": 1}
{"text": "Tbh this won't be good for your relationship in long term. But if you really be in this relationship and let her do what she wants, then you should initiate from your side. \n\nYou can find information about it on Reddit itself and see what happens.\n\nGood luck🤞", "label": 1}
{"text": "Lmao. Straight to horny jail.", "label": 1}
{"text": "This turns Sex transactional, which isn't healthy. Some level of transaction is fine, but when it becomes competitive is when there is issue. Concepts of sexual norms and reciprocation is purely subjective, what matters is consent. Is it a principle to not do something for your partner if they don't obey your request? Eye for an eye is toxic, life isn't fair, it's about compromises and boundaries. If she can't compromise, breakup. If she doesn't give him head anymore, that's fine. But acting like this is just \"reciprocity\" is unsound.", "label": 1}
{"text": "Hey-------Oooooooooooooooo!! =)", "label": 1}
{"text": "Is it the land of fairuz and cedar trees?", "label": 1}
{"text": "Use a salicylic acid or glycolic acid toner (like the Paula’s choice 2% bha). It helps balance the ph down there. You will have zero smell even if you’re sweating or working out. Obviously just on the outside skin. Try it and I swear you will have no regrets. Game changer", "label": 1}
{"text": "lol. oh man you actually believed it, that's hilarious. my fav comment of the week by far. lol", "label": 1}
{"text": "Out of curiosity.....where yall from?", "label": 1}
{"text": "Sounds like you two have some serious chemistry going on. Now, to amp up the spice for your anniversary, why not surprise him with a little \"accidental\" reveal of your own? \n\nYou could set the mood with some sexy lingerie and maybe a cheeky note hinting that you know his \"secret\" about the pics. Then, drop some flirty comments about how much you love being his muse—maybe even give him a little foot play to tease him! Why not get creative with a cute photoshoot for him? Turn the tables and take some naughty pics of yourself that play into his kinks—think playful poses with just the right amount of mystery. \n\nEnjoy and let that sexy vibe flow. Happy anniversary! 💖✨", "label": 1}
{"text": "no, I know you're committed to being the problem.", "label": 1}
{"text": "Not to be that guy but I wonder how the comments would be if the genders were flipped. I feel like they wouldn’t tell them it’s alright even though they’re literally saying it’s “ruining their life”.", "label": 1}
{"text": "Again, snooping is permitted and encouraged and not the fucking point of this post. You are literally more mad that I looked through his phone than you are about him taking nude photos of me without me knowing. Well I can guess what’s in your phone and I don’t even have to look. I hope someday you learn what trust looks like", "label": 1}
{"text": "First of all, it’s ok. This is an incredibly common problem. Just ask my friend u/borderlinepervert as I’m certain this has been an issue with them their whole life.  \n\nAlso, One of the best things you can do is to keep learning about yourself! How could you show someone else what you need if you don’t know what you need! Keep learning and then use that knowledge when communicating with your boyfriend. Add remember while orgasms are great, they should not always be the required end goal. That can put a lot of unnecessary pressure on both of you. \n\nThere are a number of sex therapists online that offer a lot of free basic information to get started. Maybe try there. Do it together even!", "label": 1}
{"text": "Im guessing Ukraine, Russia or somewhere in the middle east", "label": 1}
{"text": "Maybe their dicks are just too small! \n\nLol… jokes aside tho, I am sure your vagina is perfectly fine! You’re overthinking this and jumping to an unusual conclusion here. Try lots of different positions and see what you both like best.", "label": 1}
{"text": "I remember all the assholes of the girl i ve been with. I can draw them from memory", "label": 1}
{"text": "Hey sister are you masterbsting?", "label": 1}
{"text": "Go to a doctor smartass", "label": 1}
{"text": "Lock eyes with them and finish, you got this!", "label": 1}
{"text": "I mean yeah but at the same time OP knows there are windows there so maybe close the curtains? Blame can be directed at more than one person.", "label": 1}
{"text": "Sadly take into context the area op is in.  Im not excusing the behavior.  I want to make that clear but in sexually repressed/conservative cultures you're going to have a higher potential of this happening.  There are creeps everywhere and people need to start taking more responsibility for their safety and security.", "label": 1}
{"text": "Aww, it’s so sweet that you’re excited to surprise him and embrace his kinks! 😍 Since he clearly enjoys taking candid shots and has a thing for your feet, maybe you could plan something playful and discreet. For your anniversary, you could wear something that subtly highlights what he loves—like an outfit that leaves your feet bare or a cute anklet. You could also “accidentally” set the mood by leaving yourself in a compromising (but totally intentional) position for him to stumble upon. 😉\n\n\n\nIf he’s into candid vibes, let him find you in moments where he \\*can’t resist\\* sneaking a shot or two! It’ll drive him wild without him suspecting you know his secret. What do you think?", "label": 1}
{"text": "this is textbook victim blaming just so you are aware. like straight from the sexual safety slideshow victim blaming", "label": 1}
{"text": "No victim blaming would be saying she deserved it and is 100% to blame. You realize you can be a victim yet still have fault in your action that caused you to become the victim. That's called taking accountability and only immature people refuse to take it. Notice how I'm blaming the guy while saying she could have taken steps to prevent becoming a victim. People need to learn to take accountability.", "label": 1}
{"text": "You have zero world experience.  Quit blaming everyone for everything and learn that you can do things to keep yourself safe.  Also get off the drugs and get real coping mechanisms.", "label": 1}
{"text": "i won’t argue with someone that won’t take time to use common sense, empathy, or easily accessible resources, because it’s a waste of time. but i will make it clear, she has zero blame. she has every right to have her window open and not have someone kneeling in and asking her what she is going. it says A LOT more about you than it ever would about her. if she was audible and making people uncomfortable, then it should’ve been handled differently 1000 percent. a knock at the door, a holler to quiet down, a bang on the wall, anything would’ve sufficed. people like you just look for reasons to justify pedophilic/rapey behavior.", "label": 1}
{"text": "i’m sober now ty for congratulating me😽and have only ever smoked weed. get fucked pedo💕", "label": 1}
{"text": "Imma need a specialist for that", "label": 1}
{"text": "You don't leave your window open when people live right next to you when you flick your bean. That's common freaking sense.  Jesus you're ignorant. I assume you leave your door unlocked all night to right? Because you don't take any step to prevent bad things from happening?", "label": 1}
{"text": "You needed help to stop smoking weed lol.  Tells me you lack discipline.  Go though life playing the victim.  See how far it gets you.", "label": 1}
{"text": "I'm a totally different creep, but if it'll get me laid, I could pretend to be that one.", "label": 1}
{"text": "If you're not excusing the behavior, then stop excusing the fucking behavior, creepo.", "label": 1}
{"text": "Then yeah fuck him. As I said before.  Sounds like you did everything you could.", "label": 1}
{"text": "Where did I excuse it or say it was OK? I didn't so read what was typed before reaching up for something that didn't exist", "label": 1}
{"text": "Yeah that's why I thought the voice was from the right window because I opened it just a little so no one could peep, and then he told me he was from the left-", "label": 1}
{"text": "Just to be clear I wasn't saying that dude wasn't a creep.  My original comment was basically why not take precautions. So yeah.  Ignore the other people who seem to think i said things i didn't.", "label": 1}
{"text": "Do it....try MMMMF even better", "label": 1}
{"text": "Wash it off with some mint shower gel", "label": 1}
{"text": "I am hoping people who have done this will tell me. ", "label": 1}
{"text": "Can you speak to my girl? 😭", "label": 1}
{"text": "Be careful you'll get banned with this kind of talk around here....", "label": 1}
{"text": "Girl, if a man complains about hair it's because he's gay, men don't complain about hair, they suck hair and everything. Is it clean? I fall in my mouth, even in the anus", "label": 1}
{"text": "\\*\\*\\[Embracing Intimacy: Enhancing Your Partner’s Wildest Fantasies\\](https://pantremeni.com/embracing-intimacy-enhancing-your-partners-wildest-fantasies/2024/11/)\\*\\*\n\n\n\nThis article offers a guide to deepening intimacy by thoughtfully embracing your partner’s desires while respecting boundaries. It suggests starting with understanding your partner’s interests and initiating open conversations about fantasies. Steps include planning surprises, like a playful photo shoot, engaging in activities that align with his interests, and creating an intimate setting. Special attention to details, such as incorporating subtle hints and anniversary surprises, helps maintain a comfortable environment for expressing desires. Lastly, fostering ongoing dialogue encourages a judgment-free space to explore mutual interests, strengthening the relationship over time.", "label": 1}
{"text": "Try deep heat, it will counteract the Nair", "label": 1}
{"text": "that feeling you had might be the onset of some serious pleasure waves. With penetration, it can definitely take some time to really let go and enjoy the ride. \n\nTry this next time: focus on combining clit stimulation with penetration. Have your partner work that magic while you’re getting filled up. It’s like a double feature—two sensations vibing together!", "label": 1}
{"text": "hmm in which position did you reach it the most? and do you please yourself or is your partner stimulating your clit too? 🫣☺️", "label": 1}
{"text": "A triangle? Call me Pythagoras 📐", "label": 1}
{"text": "It's your fantasy right?", "label": 1}
{"text": "That sounds like a really complex situation. It's totally valid to feel a mix of emotions about it! Communication is key here—maybe sit down with your husband and share how you're feeling. If you're intrigued but unsure, let him know you need more time to think about it. Your comfort is super important, and it's okay to set boundaries if you feel uneasy. Just remember, it's about what both of you want and are comfortable with! 💖", "label": 1}
{"text": "I will do a nutritional approach:\n\n1) vit D3+K2 daily for life ideal but 1 or 2 months to see a difference of at least 15k units per day, also add more salt (not iodine salt, sea salt). \n2) Potassium and magnesium are also very low in our diet so take 2 pills before all meals any electrolytes (in pills, make sure no sugar)\n3) eat more protein\n4 make sure the water you drink is good (do an analysis)\n\n\nD3 take out depression and stimulates protein testosterone. You both will feel more desire, have more energy, gain more muscle and her period will be easier and painless\n\nStop birth control.\n\nHope it helps, nutrition is not magic you need to go for a month to see results.", "label": 1}
{"text": "So many things wrong with this post", "label": 1}
{"text": "Fuck you're an idiot", "label": 1}
{"text": "I can orgasm from penetration every single time. The caveat is that I can only do that if my partner had an above average sized penis. Then it’s very easy as it hits the right spots. I was never able to have an orgasm with  smaller sized penis.", "label": 1}
{"text": "Sometimes it's difficult to get back in the saddle after a fight or uncomfortable sexual encounter. To relieve stress, try switching things up with a different role-play or position.", "label": 1}
{"text": "Your boyfriend has a foot fetish but is too embarrassed to admit it. There's nothing wrong with that and it seems like you're open to exploring it. As for making your feet more appealing, maybe try painting your toes with different designs or styles.", "label": 1}
{"text": "Your body is just overwhelmed with pleasure and can't handle it, so it decides to shut off feeling in your hands to focus on the important stuff.", "label": 1}
{"text": "Poker with a truth or consequence", "label": 1}
{"text": "Start talking about Polyamory. It's not going to get better.", "label": 1}
{"text": "Perhaps one day PIV sex will work if you continue to try new things and talk to your spouse", "label": 1}
{"text": "It could just be temporary loss of blood flow due to intense contraction of muscles during orgasm. Or maybe you should see a doctor...", "label": 1}
{"text": "I’m curious to know what yours is?", "label": 1}
{"text": "If you’re a Kamala supporter and you get pregnant she will let you just kill the baby. So please get on birth control to avoid a tough decision.", "label": 1}
{"text": "Hey OP you a phony. I big fat phony", "label": 1}
{"text": "100% \n\nI use roman.  Highly recommend.  We can chat more if you'd like.", "label": 1}
{"text": "Try incorporating other forms of intimacy and pleasure into your sexual routine, like massages or cuddling.", "label": 1}
{"text": "Exploring different options to improve your sexual performance is totally normal and nothing to be ashamed of. Don't be afraid to experiment and find what works best for you and your partner.", "label": 1}
{"text": "I honestly don’t understand this sub’s rules. Talking about size is not body shaming. I see so much of the “most women dont orgasm from penetration alone” stuff on here so I wanted ti share what works for me as a woman who can orgasm from penetration basically every single time under the right circumstances. Yet, I was banned even though I didn’t body shame anyone. I simply said that if I only have knows sex with smaller sized penises, I too would think I’m part of this statistics of women who are unable to have a vaginal orgasm. And that it’s interesting what can make a difference.", "label": 1}
{"text": "You should tell him maybe it’s not big enough lol", "label": 1}
{"text": "Are you loose or is just too small?", "label": 1}
{"text": "Loose as in not tight?", "label": 1}
{"text": "Accept my chat request, I would like to chat with yous.", "label": 1}
{"text": "Your post has been automatically removed because it appears to be about anal sex. We get numerous submissions regarding this daily. However, because it is a topic that comes up so often and is [well covered by our FAQ](http://www.reddit.com/r/sex/wiki/index) our community has asked the mod team to direct posters with these concerns to these resources instead. If you're interested in discussion on the topic, please do a search of /r/sex and read some of the many past discussions on the topic. If you feel the topic of your post is not covered by the FAQ, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) and ask that your post be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "Hit me up I'll do it with you", "label": 1}
{"text": "We all know that in the end it’s still a cuckhold role, however the role play happens lol.\n\nNever in my life have I heard another man talking about how he’s having his wife plowed because of how dominant/alpha or whatever he is.", "label": 1}
{"text": "No she was brought up healthy", "label": 1}
{"text": "My fantasy is getting trained by some of the most handsome men in Hollywood, and then marrying them all. Fantasies are just that… fantasies. lol don’t take it personal.", "label": 1}
{"text": "There are some, and they likely need therapy, but it's a very small amount compared to men overall", "label": 1}
{"text": "Lmao you’re not a whore get over it", "label": 1}
{"text": "There was some nudity.... nothing out of the ordinary but still", "label": 1}
{"text": "There was one wore that sounded like slang for sex or a sexual organ", "label": 1}
{"text": "I did. And I was related to sex organs. But I need to know the rest for context", "label": 1}
{"text": "How?", "label": 1}
{"text": "I'm skeptical. If most people were cool with watching their partners getting fucked by other people in front of them then we wouldn't value monogamous long-term relationships like we do in basically every modern successful society.\n\nIf not wanting to watch my partner get fucked in front of me by another man makes me prude then slap a shoe buckle on my hat and call me a pilgrim. I'd rather be prude than be a cuck with no self-respect.", "label": 1}
{"text": "Idk why men act like they can’t control themselves when they are fully capable of doing so. Utter BS.", "label": 1}
{"text": "Because it's such a great excuse, and other men will back them up on it.", "label": 1}
{"text": "Why can’t you thrust?", "label": 1}
{"text": "It’s verrrryyyy telling that he would rather claim to have no mental faculties than acknowledge what he did.", "label": 1}
{"text": "They have longer vaginas in porn. They swallow like 9 inches", "label": 1}
{"text": "You're not in a committed relationship. OP is married. That not supposed to be the same level of safety and intimacy. Having such insecurities when your relationship is new is sound. Having them years later when you obviously didn't discuss fantasies openly is a logical consequence of a lack of communication. But feeling secure in a relationship allows both to be free of negative feelings like jealousy. And it sure made OP's wife secure and intimate enough to confess such fantasy to her husband.\n\nThere are two sides of this coin. One is his perceptiob of feeling inadequate like you said. The other is her insisting it isn't about humiliation, thus meaning inadequacy is not a matter, and her having enough confidence in OP to confess such a fantasy.\n\nLike always, open, comprehensive and non-judgemental communication is the key to solve this kind of misunderstanding. But only when they both understand what this is about shall they then decide if that fantasy is best kept as a fantasy or not.", "label": 1}
{"text": "Are you south asian", "label": 1}
{"text": "Are you south asian by any chance", "label": 1}
{"text": "‘some’ is so obviously implied. Idk why people on Reddit act as though they’ve never encountered a generalisation irl before. Howwww do you navigate life?", "label": 1}
{"text": "She knows Hindi and Urdu both", "label": 1}
{"text": "I did use an example that was less hateful before but she didn’t get it, I’ll link that in a second\n\nBut if you agree it was ‘hateful’ then you agree that what she said was also to some extent hateful too? They’re the same generalisation, it’s just one was taken a little further", "label": 1}
{"text": "Your post has been automatically removed because it appears to be about anal sex. We get numerous submissions regarding this daily. However, because it is a topic that comes up so often and is [well covered by our FAQ](http://www.reddit.com/r/sex/wiki/index) our community has asked the mod team to direct posters with these concerns to these resources instead. If you're interested in discussion on the topic, please do a search of /r/sex and read some of the many past discussions on the topic. If you feel the topic of your post is not covered by the FAQ, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) and ask that your post be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "Have you thought about incorporating clitoral stimulation into penetrative sex with a partner. Maybe it could help", "label": 1}
{"text": "If he isn't being responsible and considerate, he may not be the best partner for you.", "label": 1}
{"text": "Maybe you dream to get pounded like that even if you can’t", "label": 1}
{"text": "Your post has been automatically removed because it appears to be about having sex for the first time. We get numerous submissions regarding this daily because many people are anxious about it. However, because it is a topic that comes up so often and is [well covered by our FAQ](http://www.reddit.com/r/sex/wiki/index) our community has asked the mod team to direct posters with these concerns to these resources instead. If you're interested in discussion on the topic, please do a search of /r/sex and read some of the many past discussions on the topic. If you feel the topic of you post is not covered by the FAQ, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) and ask that your post be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "if you start asking for performance reviews, it might get awkward when they pull out a clipboard. But hey, at least you'll know where you stand in the rankings..", "label": 1}
{"text": "she loved it when not with others, so its okay to receive this", "label": 1}
{"text": "Little bit inexperienced sex but will improve", "label": 1}
{"text": "Next time, try starting with cowgirl position and see if that changes things up for you.", "label": 1}
{"text": "💦 say' my pussy can't even get that shit inside", "label": 1}
{"text": "We'll he always seems excited enough to cuddle or play with my breasts. He hugs my belly and falls asleep with my legs around him...I'm assuming these are all signs that he's not feeling bad or disgusty", "label": 1}
{"text": "My son is only a kid...and I send them to my husband", "label": 1}
{"text": "No no I send it to my husband", "label": 1}
{"text": "Sorry it's Hindi", "label": 1}
{"text": "They don't know..", "label": 1}
{"text": "That sounds like a really complicated situation! It's totally normal to feel confused and even a bit upset after hearing something like that, especially when it involves your partner's fantasies. It's great that you both had an open conversation, but it's also okay to take time to process your feelings. Maybe talking more about it could help you both understand each other better? 💬❤️ Communication is key!", "label": 1}
{"text": "Yeah that passing out with you still inside her is weird to me. It sounds like she was wasted on alcohol or some drug. If a guy did this on top of a girl everyone would be pissed. If a girl did this on top of me I would be tossing her off like get the fuck off me.", "label": 1}
{"text": "It sounds like you had a pretty intense experience! 😊 What you described does sound like an orgasm, especially with the muscle spasms and the prolonged throbbing afterward. Everyone's experience can be different, but many people describe similar sensations, so you’re definitely not alone!As for techniques, experimenting with different rhythms, pressures, and even positions can help you find what feels best for you. Some people enjoy using toys or incorporating their partner’s touch, while others prefer solo exploration. It's all about what makes you feel good! 💖 Don’t hesitate to keep exploring and learning about your body; it can be a really empowering journey!", "label": 1}
{"text": "Think about this.  Wives are more liberal with someone other than their husband.  In the case of a blowjob.  They would swallow his cum but probably not  yours, because you would know what she did and she would always have this in the back of her mind.   When another is involved, it is usually someone real that she has already made contact with.  They would be making comments to each other, etc.    Like you will love me fucking you because of my big cock.", "label": 1}
{"text": "Well my housemaid used to sleep in the same room as me because our home was small. I'd see her getting dressed and naked almost every day. Sometimes she would be topless in the room and I'd just hang out with her. People would call this bad but nothing harmful happened.\n\nSometimes she would tickle me and play with me while topless or naked. She didn't get angry or scold me if I touched her breast or backside and played. But she never let me touch her private parts, only let me look and ask questions.", "label": 1}
{"text": "It took me well over a year of occasionally trying to reach a prostate orgasm but I knew I was getting some where eventually when I started feeling a crazy weird sensation and I started dripping nut. My ex wife at the time wife wasn’t into it so I had to do all this solo. I never did get an O until 2-3 years ago and let’s just say I had been trying off and on maybe 6-7 times a year give or take a few since 2010. I just had a pspot O in 2021 when I got with my current gf. We just click and she enjoys making me melt like butter and seeing how much I explode when she makes me shiver and moan like a slut in heat! Lmao I’m a loud anal/prostate play partner! But she loves All of it ! She knows she’s getting somewhere when she sees me start gyrating or when I start getting chills or when I start to shiver and moan . And then she just buckles down on what ever movement she is performing and continues until I explode or until I have to tell her to stop. Communication is most definitely key with this . Have your partner use a anal enima duesh squeeze bulb thing in the shower before play and everything she be cleaned out before getting out the shower I try to make sure my last meal was no less than 2 hrs before. Other than all that patience don’t expect to reach the main goal the first time and communicate lots of lube and caressing of other areas while down there always helps me take my mind off the stigma of what’s actually happening so like my girl will stroke or suck or kiss or run her fingernails along my shaft or she will scratch my groin areas ever so gently while she is sliding in or she will start with a blow job and start deep throating me and at the same time she will slide a finger or two in as she takes me balls deep in her throat ! Damn this has me getting hard . Feel free to hit me up if you have questions.", "label": 1}
{"text": "Reminded me of a scene in the movie sex drive. Where he says his brother is going to fuck his ass with a roll of quarters. Go to the bank, stand in line, change a $10, find his ass and fucking fuck it with a roll of fucking quarters😆😆😆", "label": 1}
{"text": "I just crave not being the one to initiate. I crave not knowing so much and exploring for the first time.\n\nI want the experience I had with my housemaid....clueless of anything sexual but fascinated by opposite sex nudity and thrilled to explore a girls body.", "label": 1}
{"text": "Talk about a plot twist! You went from 'let's have some fun' to 'let's have a cleanup crew on speed dial!' Hope your next adventure involves less mess and more cuddles...", "label": 1}
{"text": "Your feelings are completely valid; it’s not about the porn itself but the disrespect and lack of boundaries in your shared space, which understandably makes you feel uncomfortable and resentful.", "label": 1}
{"text": "if your body is throwing a drama series with all those symptoms, I’d say it’s auditioning for ‘As the Stomach Turns!’ 😂 Seriously though, let’s hope it’s just the stress and not a surprise plot twist!", "label": 1}
{"text": " if I had a nickel for every time I wondered if my 'fire hose' approach was better than the 'drip coffee' method, I'd probably have enough to buy a lifetime supply of towels! 😂 But hey, whether you're shooting for the stars or just sprinkling a little magic dust, as long as it feels good, who cares about the volume?", "label": 1}
{"text": "those big-boobed beauties probably have their own set of problems. Like, do they ever get stuck in doorways?", "label": 1}
{"text": "You might be onto something with those hormone levels sounds like your partner’s estrogen is working overtime while yours is just chilling on the couch watching Netflix!...  But seriously, keep up the good work...", "label": 1}
{"text": "Are you overweight by any chance? If so that could be one factor why it’s happening. \n\nBut if that’s not your case then go buy a honey box off of Amazon they work great but only take half or less than half of one packet because if you take more than you’ll get a headache.", "label": 1}
{"text": "Ok thanks for dour opinion. I will rethink our relationship", "label": 1}
{"text": "Well my feelings are that I am okay with dating someone older and you all see that as a problem", "label": 1}
{"text": "I do moan a lot during it to make it hotter for him and he thinks thats why I enjoy it", "label": 1}
{"text": "Ok thanks I will do that", "label": 1}
{"text": "Ok wow that imagine a friend in that situation thing kinda opened my eyes a bit", "label": 1}
{"text": "let me try your hand-job to give you good advices 😋😋", "label": 1}
{"text": "at least you’re getting really good at oral techniques! It sounds like you’re already winning in one department while figuring out the other.", "label": 1}
{"text": "You might want to consider investing in some sort of 'sex position safety gear.' Maybe knee pads for her or a helmet for you? Just kidding—good luck finding that perfect angle without feeling like you're about to snap,,,,", "label": 1}
{"text": "It sounds like you’re caught in a frustrating cycle of wanting to connect but feeling like you have to pull teeth to get there. Honestly, it shouldn’t feel like a job application every time you want to get intimate! You shouldn’t have to beg for that connection—it should be a mutual thing, not a negotiation. Maybe it’s time for a heart-to-heart where you lay it all on the table, no sugarcoating. If he doesn’t get it after that, it might be worth considering if this relationship is meeting your needs. Remember, it’s not just about the sex; it’s about the intimacy and connection that comes with it. You deserve to feel desired without having to hold a meeting first! 💖", "label": 1}
{"text": "thanks", "label": 1}
{"text": "thanks man", "label": 1}
{"text": "thank you i will", "label": 1}
{"text": "It sounds like your attractions are throwing a party in your head, and everyone's invited—straight vibes mingling with bisexual energy like it’s a weird crossover episode. But hey, isn’t that what makes life interesting? Think of it as a buffet where you can sample everything without committing to one dish. Just remember: no one’s judging you for going back for seconds,,", "label": 1}
{"text": "i dont know", "label": 1}
{"text": "It's a girl.. Shitty translation from Reddit 😭", "label": 1}
{"text": "Make some money out of this situation make an Onlyfans account and monetise the problem…/ \nI had one like this but I rehomed her a few years before OF became a thing. \nDidn’t work for years just lay on the couch with buzz light year toy flashing teens  on chat roulette…", "label": 1}
{"text": "Thank you", "label": 1}
{"text": "Thanks im bit addicted to smoking", "label": 1}
{"text": "Mm may be", "label": 1}
{"text": "Suggest trying new things together and make sure to communicate your wants and needs. And don't be afraid to speak up during the act if something feels good or not.", "label": 1}
{"text": "It's good and you are a strong woman", "label": 1}
{"text": "You are not a stranger, but keep things natural.", "label": 1}
{"text": "Yep keep trying to control me motherfuckers. I know exactly who you are. And you repulse me. You can’t stand in my way forever. I will do what the fuck I want to do whenever I want to do it.", "label": 1}
{"text": "My partner asked for this several times throughout our relationship. Almost like pushing scat which I am certainly not into and vocalized to him it did not excite me or make me curious and quite revolted me. He's wanted to have me fart in his face and wants to smell my farts and oftend barges into the bathroom without asking when I'm trying to poop and asking if he can see or wipe me just absolutely nasty. I have never. I consider myself exploratory in the bedroom but this is a hard boundary for me. I guess to each their own but I just can't get down with this request", "label": 1}
{"text": "That’s disgusting. That would be a no from me.", "label": 1}
{"text": "This is pretty gross and can get him sick", "label": 1}
{"text": "Brother just trying to get nuked", "label": 1}
{"text": "I was kidding. Notice the laughing smiley faces next to the sentence.", "label": 1}
{"text": "Wait till he poops on her bed..", "label": 1}
{"text": "Hahahaha, I haven't ejaculated for 1 year now buddy! \n\nYour issue is foreign to me! \n\nI have never had any pain in my balls ever!!!", "label": 1}
{"text": "As every body is different it does not appear in everyone. If I were you I would check my testosterone levels because from abstaining for so long you are slowing down your own production.", "label": 1}
{"text": "Unless you are female, it's the same for all males! \n\nGo back to your biology books man!", "label": 1}
{"text": "You can go back to them buddy\n\nhttps://www.givelegacy.com/resources/semen-retention-fertility/", "label": 1}
{"text": "Stop wasting your time on the internet with links! \n\nBefore it was ever discovered that blood rush to the penis, caused an erection, people believed it was due to air! \n\nSo anything is believed, when passed around!", "label": 1}
{"text": "I mean you are the educator so you should tell yourself to stop. I know my body and what feels right for me so. Jokes are on both of you for staying without sex, anyway.", "label": 1}
{"text": "To stop what??? \n\nWhat joke??? \n\nYou know your body huh! And you know mine too!? \n\nYou are too young my friend! Learn some more, then discuss! \n\nYour balls are in pain, with or without sex, mine don't! \n\nPick up a book or 2, and educate yourself!", "label": 1}
{"text": "Your post has been automatically removed because it appears to be asking if some aspect of someone else's or your own sexuality or sexual preferences or body is normal or not. We get a lot of questions here that are about really basic stuff that *ought* to be taught in schools but that unfortunately isn't. Variance is the norm in human sexuality. It's more meaningful to ask questions like: is this safe? Is this consensual? Is this mutually pleasurable? There are a lot of great resources for this, including [scarleteen](http://www.scarleteen.com/) and [go ask alice] (http://www.goaskalice.columbia.edu/). You may also find relevant information with a search of /r/sex or in [our FAQ](http://www.reddit.com/r/sex/wiki/index). **If you feel like your question is more complicated or will be a topic for thoughtful discussion**, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) so that we can restore your post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "But ofc I have nothing else to do but to read about the placebo of semen retention", "label": 1}
{"text": "From links, written by people who would like to assume it's false? \n\nIf you think education is expensive, try ignorance! \n\nI pity your generation!", "label": 1}
{"text": "I’m definitely gonna try pillows under my hips tonight", "label": 1}
{"text": "Gonna do that tonight :)", "label": 1}
{"text": "Sexual education is needed for men and women.\n\nA healthy man actually enjoys a woman being aroused.\n\nHe wants her to get wet, he wants to drive her crazy. He wants to leave her breathless.\n\nA man who raises a woman's temperature experiences the pleasure of pleasing her to the core.\n\nIf I had a woman, I would want to drive her crazy.\n\nThe female body is beautiful. How nice it would be to caress she, kiss she and lick she. :))", "label": 1}
{"text": "They can refer me but they only do that if they see an absolute need to. GP just heard how I explained it, said he can stick me on a waiting list for frenulumplasty but it’s “a long wait” I asked how long and he said he couldn’t say. But in NHS words that normally means years.", "label": 1}
{"text": "Just chop the dick off and start using your fingers.", "label": 1}
{"text": "What could a urologist do for me? I’m looking into the steroid stretching option now and it seems statistically very ineffective and it says 8 months to maybe see results but you most likely won’t", "label": 1}
{"text": "Yeah I’ll try but was just wondering what all they could actually do, because if it’s nothing my GP couldn’t do. Prescribe this cream and stick me on a waiting list I won’t be allowed to see one, or I will in 6 years because I’ll be bottom priority. \n\nSo I was just wondering because to push my GP to refer me I need really good reason", "label": 1}
{"text": "OMGYes is a resource of interest when it comes to pleasing a woman sexually.  Scarleteen has a number of articles of potential use.  OhJoySexToy has a slew of educational comics.  The r/sex FAQ has some good stuff in it.", "label": 1}
{"text": "The debate of pregnancy is overrated, especially nowadays with all the contraceptives available and women being informed now more than ever about STD's and pregnancy risks. \n\nI am waiting for all the women that say it's predatory for an older man to want to have sex with a younger woman... The ones that get the ick and can't wait to tell how wrong this is. That's all i'm saying.", "label": 1}
{"text": "Lol i literally just got done with this situation. You better make sure you take your pomegranate juice and maca root buddy. Sir you are the human vibrator", "label": 1}
{"text": "I want to find a women like you have that has a high sex drive and everything else that is in mid to late 30’s early 40’s so yeah you are very lucky man and i just turned 30 on October 26th so if i could find an older women with a high sex drive i know i would be in heaven 100%", "label": 1}
{"text": "She plays and is playful but my libido eclipses her by a long shot. I’ve tested her but not initiating and it could be 7-10 days before she initiates something. It may be disingenuous because we are very close and she knows me well. I’m cranky if we go that long without intimacy. ", "label": 1}
{"text": "I am probably a super-dad. I clean all the time. I help with all the chores and when I’m bored I find chores that she hasn’t gotten to and do them too. \n\nSo thanks for your suggestions but yes I have the husbanding and fathering down. ", "label": 1}
{"text": "No. We were both relatively inexperienced. We’ve grown a lot together. We are very close and she is my best friend. I’ve wanted to keep evolving our relationship and on this one matter, she doesn’t express her desire to. I know she enjoys her orgasms and she is happy for them. I just can’t give them to her. ", "label": 1}
{"text": "Curiosity, simple as that, no agenda behind it.", "label": 1}
{"text": "I want to be closer to her. I imagine the feeling of both us achieving orgasm together as the next level. I want to feel her pleasure through it and yes, I admit, my ego or feelings or soul or whatever needs to know that I am capable of providing it. I have had thoughts that she could get there with the “right person” even though she has never, ever hinted nor suggested that. Silly?  Maybe. It’s a feeling and I’m being honest. ", "label": 1}
{"text": "Chill. My wife bleeds regularly from sex. She’s seen gynecologist and everything. There’s nothing wrong with her, it just happens, especially in certain positions when I get extra deep. Also, if she’s about to start her period and we have sex, it always kick starts her period and there’s blood before we’re done with sex.", "label": 1}
{"text": "I hear you. And honestly it’s been like that for a long time. Trying to improve/change but Status Quo. Maybe as I read of what relationships could be like (reading here, and elsewhere) is why I have this feeling of longing. \n\nI feel like my frustrations are heaping up, maybe because of the countless attempts and the reassurances that all is well.\n\nSo yes, it is a me thing. I will own that. I appreciate you taking the time to post. ", "label": 1}
{"text": "neither is okay. it’s crazy to be fine with it. 21 yr olds aren’t mature enough to realize the situation and are being used.", "label": 1}
{"text": "Nothing I’m aware of nor that she will admit to. She’s very open in bed and willing to try things. She’s present in the moment and appears to be engaged. Also she is very giving and loves to give oral and everything else. \n\nThat’s what kills me. I will try and try and try and get nowhere physically. Grateful for toys but also frustrated that it’s her only outlet. And again, it’s not that I’m not happy about that. At least she gets an outlet. Just not from me. ", "label": 1}
{"text": "I appreciate this post very much. ", "label": 1}
{"text": "Respectfully, I don’t need a notch in my belt. I hope others don’t think that like you suggested. \n\nI admit that I want to feel responsible for one element of her pleasure. Yes it’s 100% her body and her pleasure.  And yes she is charge of that. \n\nI come to you, cap in hand,\nexplaining that as a male, in love with his wife for so long, feeling badly that for some reason, I cannot provide that pleasure. Not with my “appendage”, tongue nor fingers. \n\nI am certain that more men than women will understand this feeling. ", "label": 1}
{"text": "EITHER YOU ARE NOT INTO YOUR BOYFRIEND AS MUCH AS YOU WANT TO BE OR YOU ARE MENTALLY FEELING GUILTY.  YOU HAVE TO EXPLORE MORE TOGETHER OR YOU HAVE TO FIND SOMEONE WHO TOTALLY TURNS YOU ON AND MAKES YOU FEEL SEXY. IF YOU ARE NOT ALREADY AROUSED AND EXITED BY HIM IT WILL ALWAYS BE HARD TO FINISH OR BE EXITED. YOU NEED EXITEMENT ON A WHOLE NOTHER LEVEL. TOYS ACTUALLY MAKES IT WORSE FOR YOU FOR YOU TO ENJOY HIM AT THE HIGHEST LEVEL IF IT WERE EVER POSSIBLE TO EXPERIENCE BETTER SEXUAL PLEASURE.", "label": 1}
{"text": "Thanks for this", "label": 1}
{"text": "I have. No breakthroughs. I suspect her mother was tougher on sexuality as a child. But I’ve nudged into that and not gotten much. She is a very strong, smart professional so if there’s something there, it’s very deep seated. ", "label": 1}
{"text": "This is amazing - I appreciate this and you very much. ", "label": 1}
{"text": "I'm down for one as a male Latino 26", "label": 1}
{"text": "not quite. that age can be quite naive and are learning to navigate adulthood and become an adult. his prefrontal cortex isn’t even fully developed yet.", "label": 1}
{"text": "Well I guess it takes all kinds. I have a penis, and my penis definitely is of the “don’t stop” variety. But ok, different strokes.", "label": 1}
{"text": "Just be yourself. Don't be afraid to be a little awkward or shy, it can be endearing. And as for dressing sexy, just find a style that makes you feel confident and comfortable.", "label": 1}
{"text": "I think it's up to personal preference. As long as you and your husband are on the same page and communicate clearly, any dynamic can be enjoyable and painless.", "label": 1}
{"text": "I agree with that i don’t have confidence or self esteem to approach anyone witch is why i am still single most likely and might end up single the rest of my life", "label": 1}
{"text": "I'm 43 still a virgin", "label": 1}
{"text": "HEY SAYING EVERYTHING IN CAPS DOSNT MAKE YOU SOUND IMPORTANT", "label": 1}
{"text": "Had a crazy girl keep suckin one night. I never knew guys could have multiple orgasms in less than a minute. No joke it was impossible to count because your mind just goes blank.", "label": 1}
{"text": "Get some testosterone injections, cialis and PT 141 injections for sex god mode 👍", "label": 1}
{"text": "It sounds frustrating to deal with that during intimate moments! 😟 Have you tried communicating with your girlfriend about what feels good and what doesn’t? Maybe experimenting with different techniques or angles could help. If the pain continues, it might be worth seeking a second opinion from another doctor or a specialist. Open communication is key! 💬✨", "label": 1}
{"text": "disrespectful little shit lmao", "label": 1}
{"text": "Death by Snu Snu!\n\nhttps://youtu.be/uThDGzLhOXg", "label": 1}
{"text": "Why not just hand her a 'Virgin Alert' badge? It’s like a fun fact, but with less pressure and more awkwardness", "label": 1}
{"text": "who doesn’t love a little curiosity? But maybe it’s time for him to realize that experimenting in relationships should come with a ‘no take-backs’ policy! Perhaps suggest some role play instead who knows, you might discover a whole new world of fun without him needing to venture out....", "label": 1}
{"text": "It’s amazing, so much stronger than any other type of organs.", "label": 1}
{"text": "Stretching ring are cheap. There’s easy stretching methods too. /r/foreskin-restoration is  a great resource for phimosis.", "label": 1}
{"text": "My favorite is to give oral but also use my hands, using fingers on her spot and pressing down on the lower stomach with the other", "label": 1}
{"text": "lol im a guy, but thats actually true for me to", "label": 1}
{"text": "Stfu", "label": 1}
{"text": "Oh, you would know.  They're awful.  They're itchy and painful.  You generally end up digging the hair out of the skin with a sharp object and bleeding a lot.", "label": 1}
{"text": "Just think of it as a new form of cardio who needs the gym when you have ‘cowgirl’ practice?  Maybe invest in some leg day workouts for your next session!...", "label": 1}
{"text": "I can help but only if you really want it. No grooming, no harassing, not stalking or similar. Just an offer", "label": 1}
{"text": "I can help with that, most things long and hard can do that", "label": 1}
{"text": "sounds like your clit is playing hard to get! Maybe it’s just shy and needs a little more coaxing. Have you tried sweet-talking it? Or maybe some gentle compliments? “Hey there, little buddy, you’re looking extra sparkly today.. But seriously,,, everyone's body is different. It might just be that you're not hitting the right spot or need a bit more warm-up...", "label": 1}
{"text": "Why not replace those cravings with a new hobby? I hear knitting is very therapeutic… and way less sticky than what you’ve been doing...", "label": 1}
{"text": "Someone's tongue doesn't cost anything", "label": 1}
{"text": "Bring it up in conversation with him and tell him how you want him to explore you as you lay in bed with him. Let your hands roam him while you say that to get him going too.\n\nEverything should be a conversation and you'll be happy you brought it up!", "label": 1}
{"text": "Me and my partner realllllly love the dildos that insert into the vagina. They're essentially a strapless strapon lol\n\nThey vibrate too and it feels great! Just be aware, not all vagina inserts fit perfectly so shop around.", "label": 1}
{"text": "Yeah dude I can’t tell you how awful it would be to become a 21 year old dad (and a stepdad to 4 other kids) with a woman who is old enough to be your mother. Is that the kind of future you want? There’s nothing wrong with liking older women and if you wanna be with an older woman long term one day then cool, but do it when you’re older and more established and have more life experience, your own place to live, and you’re able to sustain yourself if shit ever goes south.", "label": 1}
{"text": "At this point, I think you two are just one pillow fight away from being a rom-com! Just make sure the script doesn’t have any awkward plot twists!..", "label": 1}
{"text": "Ask him to do something because your happiness is linked to his happiness.", "label": 1}
{"text": "Don’t worry about your boyfriend thinking he doesn’t turn you on—trust me, if he’s doing all that work, he’s probably sweating bullets wondering if he’s got the magic touch! Just remember, every superhero has an off day. Maybe you need to channel your inner diva and let him know that sometimes even the best need a little extra help... :)", "label": 1}
{"text": "just make sure you don’t confuse 'friendly' with 'flirty'—one leads to awkward tango lessons while the other leads to some spicy salsa! Just remember: clarity is key,..", "label": 1}
{"text": "you went from 'let’s cuddle' to 'let’s awkwardly walk home' faster than I can finish my drink! Sounds like he misread the room—or maybe he thought ‘cuddle’ meant ‘full-on wrestling match..", "label": 1}
{"text": "Try a man once in a while .", "label": 1}
{"text": "It's no surprise that performance anxiety can affect anyone, even the most virile of teenage males. Just remember, it's not about the length of time you last, it's about the quality.", "label": 1}
{"text": "Stick to traditional lubricants or water-based products to avoid any potential harm", "label": 1}
{"text": "That’s just a silly question. Your body will do the rest….", "label": 1}
{"text": "Well ma'am us men can only dream of meeting someone like you, dedication is important...", "label": 1}
{"text": "It's not likely abuse if she likes it. Some folks go for it.", "label": 1}
{"text": "I have it on my hands so my Segway after it is noticed is “ you should see my cock, it’s like digital camouflage.”", "label": 1}
{"text": "Oof, babe, soap down there is kinda risky business. 😬 Lowkey, your booty deserves better! Ever thought about sneaking in some coconut oil instead? Trust me, your tush will thank you. But hey, props for being adventurous! 😉", "label": 1}
{"text": "I am 6’2” so I would just put you on a table. It would work, where there is a will there is a way! Endeavor to persevere people!", "label": 1}
{"text": "Thank you for posting in the r/Sex community. To ensure that everyone respects our safe space, we ask that you familiarize yourself with our Forum Rules and Posting Guidelines — which are visible in the forum’s sidebar, and also linked [here](https://www.reddit.com/r/sex/about/rules/).\n\n***\n\nRestricted subjects in r/sex include sex stories (which are permitted in the Weekly Sexual Achievement Thread only), body image and penis-size issues, hookup attempts, common topics which are considered repetitive in our forum, and requests for private chats.\n\nTo cut back on comments that add little value to the conversation, we have instituted a minimum character requirement that will silently remove comments that fall below it.\n\n***\n\nAny attempt to seek private chat or otherwise deviate a conversation away from the main forum, WILL result in a permanent ban. This goes both for OP and for all comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "It is hard to beat. I cum just from doing that", "label": 1}
{"text": "Use a thinner rubber", "label": 1}
{"text": "She could look at mine. 🤷🏻‍♂️", "label": 1}
{"text": "I’m ready to give you oral shaved or I shaved.", "label": 1}
{"text": "It's a throwaway??? Wtf", "label": 1}
{"text": "????", "label": 1}
{"text": "I've mentioned in the comments that he's 5 with a few other details ...do you want me to tell again pls say so", "label": 1}
{"text": "Is it unhealthy of my wife to let him \"grope\" her out of curiosity alone, as long as we tell him never to do it elsewhere without consent", "label": 1}
{"text": "Well we've established that he cannot do it anywhere else because of boundaries... But we give him freedom at home with some limits", "label": 1}
{"text": "Got it", "label": 1}
{"text": "Thankss", "label": 1}
{"text": "Thank you!", "label": 1}
{"text": "Got it!", "label": 1}
{"text": "Well we would have to know her comfort zone really to be sure but I would go for something that has high cinematic quality and focuses on intimacy", "label": 1}
{"text": "Guy here. My gf wore some crotchless panties and she wore them during PIV. All I did was get chafed. It was uncomfortable for me. We never used them again. But maybe the hole was not big enough in that particular panty.", "label": 1}
{"text": "Guy here. Been down on lotsa women. Shaved is perfect. Allows more area to roam and  tongue/mouth stimulation is easier in roamed areas. \n\nTrimmed close=perfect too. Approx one-fourth of an inch or so. At least a day or more after trimming for any sex. Why?  Because hairs can be sharp, not soft. This depends on the person's hair. Light fuzz is cute if shaped. \n\nFull bush - I use to prefer it and it's fine once I'm down there. It's not a turnoff, just rarer these days..  Btw, most women I've spoken with find being shaved = much more sensitive down there when having sex. \n\nWhatever you do, do it for yourself. If the male or female is going to have their head down their 24hrs a day then maybe, just maybe, they should be able to come up for a minute &  voice an opinion. Other than that, enjoy being with you for the person you are. I've loved them all", "label": 1}
{"text": "It's tough. Happy to chat about coping skills.", "label": 1}
{"text": "Sweetie, get your ducks quietly in a row & leave when ready. It may take some doing & really sucks;  but your current situation needs to end. Talking won't end it. You have to.", "label": 1}
{"text": "Condom on for a bj.... don't recommend.\n\nBut I did have a couple girls who would go harder with one on compared to it bare....\n\nBut bare they weren't seeming like they enjoyed the act", "label": 1}
{"text": "sounds like your hormones are throwing a rave while you're still trying to figure out how to find the bathroom in this party called life! Don’t stress too much about being inexperienced; everyone starts somewhere—even if that somewhere involves googling 'how to flirt.' ..", "label": 1}
{"text": "the classic 'I just want to have fun without the fame' dilemma! Have you considered becoming a professional pillow tester? Just make sure to wear a mask—safety first", "label": 1}
{"text": "communication is key—so maybe ask her if she wants to explore this topic further. Who knows, you might end up with some unexpected insights or at least a few more interesting stories to tell at dinner parties! Just make sure to keep the paddles for playtime and not for any “disciplinary measures” during the conversation!", "label": 1}
{"text": "Thanks, working through it..", "label": 1}
{"text": "It’s possible he’s just trying to keep his ‘performance’ ratings high for intercourse—like a secret agent with a mission!", "label": 1}
{"text": "Yes, of course.", "label": 1}
{"text": "Ok this is good to know. Could be similar?", "label": 1}
{"text": "That’s one way to get a scholarship", "label": 1}
{"text": "Saying you know more off someone’s personal life is not advice.. someone asking for advice & giving it to someone is… idk why this is hard concept to grasp.\n\nAlso you clearly didn’t read my comment the size is what people are questioning they don’t even read my question they immediately say it’s not possible for someone to have more than 8 inches AND IM CLEARLY SAYING IT IS it’s not called BBC for nothing. They don’t even answer my question they want to stick to their close minded comment ", "label": 1}
{"text": "Sorry to copy and paste I just am not very good at reddjt and don’t know how to tag :( As well intended as this line of thinking is, it can be really harmful.  There is nothing about surviving a sexual assault that could make someone responsible for protecting others from their assailant. If that is something they decide is part of their healing process, wonderful. Beyond that, you owe it to survivors to let them lead the conversation if they want to discuss it, and if they share something that makes it seem like the danger is imminent, you can report that yourself. I hope this doesn’t come across rude or pedantic, I don’t know your story and am just sharing from my own experiences…hope you continue to be vocal in your support of survivors, hearteningly lovely and kind! 🕊️", "label": 1}
{"text": "Just don’t go raping women on trains 👌🫡", "label": 1}
{"text": " I agree with you \\~ ![gif](emote|free_emotes_pack|give_upvote)", "label": 1}
{"text": "You seem to have misunderstood me. I am not telling OP what to do, I was telling YOU to stop doing that. When you say “report him to the police or an online group so maybe other women can be protected.” you absolutely are saying that OP’s choice of not reporting could lead to more assaults…. \n\nNow you doubled down with ‘If someone stole something from you, wouldn't you want to report them to the police so that they could be caught and not steal from anyone else?’ Wtf are you smoking, someone did! It was my peace of mind! It was stolen by the person who SA’ed me! \n\nComparing rape to a stolen wallet?? Smh, those two things are nothing alike, and the comparison is absurdly objectifying to women….", "label": 1}
{"text": "I see you do not understand the concept of an analogy or basic reading comprehension, and therefore I will not be engaging further.", "label": 1}
{"text": "The only girl older than 25 still virgin that I came across was a muslim one", "label": 1}
{"text": "r/Mormons", "label": 1}
{"text": "Truly always a beautiful smell that keeps you all giddy and horny when you have a whiff of the sex smells again. I try to keep it as long as possible on my skin be it on my crotch or fingers 🥵🫠 The smell is just so intoxicating that if I get a \"taste\" of sex it makes be a slut wanting more. Really sucks when your fun buddy is not available but marks and smells are wonderful reminders of the lust.", "label": 1}
{"text": "You need to train her to do it right.   Her future boyfriends will thank you.", "label": 1}
{"text": "I'll take things that are simply untrue for 1.000$, Alex!", "label": 1}
{"text": "I’m too insecure about my size for that. Like how can I be like look babe this how sloppy I want my head. Just for her to be like look this how deep I want your strokes. She wouldn’t say that but I rather not even try", "label": 1}
{"text": "It may be weird by your standards, but try to think of all the women out there who would kill for a husband that interested in them.", "label": 1}
{"text": "Simple, you're not satisfied because you're addicted to porn.\n\nFind the resources to help with your addiction.", "label": 1}
{"text": "it does sound like it’s becoming an addiction, you’re actively looking for more because the old stuff you’ve just watched— isn’t working anymore.", "label": 1}
{"text": "It sounds like you’re going through a tough time, and that can really affect both you and your girlfriend. Have you thought about talking to a doctor? They can help figure out what’s going on. Communication with your girlfriend is key too! Letting her know how you feel can make a big difference. You got this! 🌟💪", "label": 1}
{"text": "It's common, it's an addiction and it's from desiring More than what your daily life is", "label": 1}
{"text": "Addiction is addiction. I'm very familiar with it. My heart goes out to you. I really do wish you the best for whatever path you take.", "label": 1}
{"text": "Borderline pathetic, pretty sad- made you a bitch one last time", "label": 1}
{"text": "I'm snarky. Sure? \n\nThe only proven effect that was found was comparable to placebo. So, can it help? Sure, because you think it might and because it boosts your confidence in bed. Does the molecule have any effect on how fast you ejaculate? No. \n\nSo, maybe, instead of using anecdotal evidence, based on the population of 1, being you, listen to what scientists have actually published about it.", "label": 1}
{"text": "Why are you using multiple accounts to reply to me? You seem very immature so there's no point for a back and forth. I hope things get better for you because it's weird to get this heated over someone disagreeing with you. Maybe take your own advice and don't chime in unless you can handle it...", "label": 1}
{"text": " it sounds like your partner attempted a stealth mission and got caught in the act of... well, nothing!  I mean, who knew you could be so good at sleeping through a surprise attack? Maybe next time they should consider sending a calendar invite for their \"Operation: Wake Up and Roll Over. at least they were considerate enough to check in afterward. It’s like they were saying, “Hey, I tried to wake you up with some morning magic but ended up just waking up my own awkwardness instead...", "label": 1}
{"text": "I think your penis just got the memo that it's time for a snack break after all that hard work!  It’s like, 'Alright, I did my job, now where's the cake", "label": 1}
{"text": "Vaginal orgasms are like that one friend who never shows up to the party always invited but rarely seen! But don't worry, you've got options! Just remember: if at first you don't succeed, try rubbing your way to victory!", "label": 1}
{"text": "t sounds like you need to become a master of stealthy exits. Maybe invest in a ninja outfit for those moments when she needs her solo exploration time? Just make sure to leave a note that says, 'Gone to the store for snacks—don’t wait up! how about setting up a secret code? If she says, 'I’m going to reorganize my sock drawer,' you know it’s time to grab your favorite video game and vanish into the digital realm. Just remember, if you hear any unusual noises from the other room, it’s probably just her trying out new yoga poses.", "label": 1}
{"text": "If sex is feeling like a chore, maybe it's time to add some fun back into it! Think of it as switching from a treadmill to dancing in your living room—way less pressure and way more giggles! Just keep it light and playful", "label": 1}
{"text": "She's just trying to avoid UTIs and any post-sex mess. Or maybe she just likes feeling fresh and clean after a romp in the sheets", "label": 1}
{"text": "Way to twist what I said. Good job. I hope you feel really good about yourself.", "label": 1}
{"text": "Please inform me how I twisted what you said? You’re making OP 2x check herself for making her husband “feel bad for something that is normal and healthy”", "label": 1}
{"text": "i know something that could help!", "label": 1}
{"text": "Porn is going to mess up your sexual life even more and make you more insensitive, your brain will get used to it and you won't get easily aroused anymore . Get off from porn and meet real people and try having real sex, throw away the sex toys and dildos, start taking the real D and practice intimacy", "label": 1}
{"text": "Male here. I know EXACTLY where it is. Why don’t you come over here and I’ll show you, heh heh 😏 \n/s \n\nLemme know what you find out! I’m curious too 🤣", "label": 1}
{"text": "It isn't legally or morally wrong where we live, but it's socially unacceptable and I want to know how to satisfy it for her", "label": 1}
{"text": "Can’t even make jokes….", "label": 1}
{"text": "  \nScenes in those movies are extended with the use of drugs.\n\nOr other scenes are edited and shot within a few days.\n\nIt can increase performance loss. The vaginas and penises that are visible are organs that have undergone aesthetic procedures.\n\nI recommend that you develop your sex life by creating your own fantasies. Relationship doctors also say this.\n\nRelationship doctors do not even recommend women's vibrators that do not reflect naturalness. Excessive vibration stimulation is not natural.\n\nMake love by touching each other's souls.\n\nMake fantasies. Determine positions by drawing lots. Have sex by pretending to be someone else. Stimulate each other visually.\n\nSuggest that your partner belly dance.\n\nAs you move away from what is natural, you will move away from creation.", "label": 1}
{"text": "I am loving this tell me more", "label": 1}
{"text": "Send it to me with your face covered if that helps ;)", "label": 1}
{"text": "Hilarious this. \nThink I care about your warnings? \nYou’re simply not correct. Ban me all you want. \n\nED meds help guys that can’t orgasm to orgasm faster, they reduce the refractory period so a 2nd orgasm happens more often en they improve confidence in the act.  \nThere’s 0 evidence that they delay your orgasm. \nIf you want to promote that opinion, feel free to do so, but you’re wrong.", "label": 1}
{"text": "Hilarious this. \nThink I care about your warnings? \nYou’re simply not correct. Ban me all you want. \n\nED meds help guys that can’t orgasm to orgasm faster, they reduce the refractory period so a 2nd orgasm happens more often en they improve confidence in the act.  \nThere’s 0 evidence that they delay your orgasm. \nIf you want to promote that opinion, feel free to do so, but you’re wrong.", "label": 1}
{"text": "Any toy that does not imitate a real relationship will harm your subconscious.\n\nYou will continue to be overstimulated to reach satisfaction. This will not be enough after a while. There will be problems in relationships.\n\nYou should masturbate naturally. Explore your body and imagine it. But do not use electronic devices! Also, your dopamine level will be disrupted.", "label": 1}
{"text": "We don’t have a pleasure spot on our ass. For me just give me a blow job or sit on my face or grind on top of me i’ll be the happiest man in the world, I bet that’s what your guy would also like", "label": 1}
{"text": "It would be good if you wrote down what your fantasies are. Comments could change depending on the situation.\n\nFantasies are important in married life. If both people care about it, there is no harm in trying it from time to time.\n\nForeplay and then passionate desire can be a way to realize all fantasies.", "label": 1}
{"text": "Any toy that does not imitate a real relationship will harm your subconscious.\n\nYou will continue to be overstimulated to reach satisfaction. This will not be enough after a while. There will be problems in relationships.\n\nYou should masturbate naturally. Explore your body and imagine it. But do not use electronic devices!", "label": 1}
{"text": "Nothing like watching dem tittays bounce. Totally agree. My wife is a 32DDD (super realistic looking implants), and I love watching her tits bounce while I'm fucking her.", "label": 1}
{"text": "Stop watching porn and be with a man who knows how to have sex", "label": 1}
{"text": "Do you use lube?", "label": 1}
{"text": "There’s probably a lack of intimacy.", "label": 1}
{"text": "Let's empathize. What would a man think if he tried to kiss or lick an uncleaned vagina?\n\nThe female organ is generally more closed and more likely to smell.\n\nThe vulva and inner lips can be cleaned with just water before sex.\n\nFor men, please go to the toilet and wash their penis and anus before sex.\n\nThere is no bidet faucet in America. However, in Europe and some Muslim regions, there are bidet faucets in toilets. This is also a useful practice for women.\n\nThe organs should be washed after every toilet use.\n\nI am a circumcised Muslim man. I do not smell between my legs even after 3 days. However, I have smelled between my legs in the hot summer months.\n\nCleanliness is important.", "label": 1}
{"text": "Of course it’s healthy, and if you still need more, I’m here to help. 😉🤪", "label": 1}
{"text": "Your post has been automatically removed because it appears to be about wanting \"sex tips\". We get numerous submissions regarding this daily because it is a pretty common interest people have. However, because it is a topic that comes up so often and is [well covered by our FAQ](http://www.reddit.com/r/sex/wiki/index) our community has asked the mod team to direct posters with these concerns to these resources instead. If you're interested in discussion on the topic, please do a search of /r/sex and read some of the many past discussions on the topic. If you feel the topic of you post is not covered by the FAQ, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fsex) and ask that your post be restored.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "Use a lube. I don't understand why you needed to make a post for this obvious answer.", "label": 1}
{"text": "Dude, stop commenting this stuff on this sub!", "label": 1}
{"text": "It’s all on the medication package insert, just read it", "label": 1}
{"text": "Sorry but this is a really dumb question. Kinda like, how do I kiss someone or how do I fuck, how do I eat pussy?", "label": 1}
{"text": "I see that you do not take into account the advice of relationship doctors. It is useful not to go beyond natural methods for a healthy sexuality. This has of course been a natural process for hundreds of thousands of years. These toys have emerged in the last 100 years.", "label": 1}
{"text": "He probably has watched too much porn in his life and lost sensitivity. I had an ex like that.", "label": 1}
{"text": "Give him a bj and work on his balls and then move down", "label": 1}
{"text": "You will get her number by specifying her", "label": 1}
{"text": "You shouldn’t shit where you eat.", "label": 1}
{"text": "Me too. Guys who don't eat pussy are selfish little boys.", "label": 1}
{"text": "She’s a bitch idk what you expected", "label": 1}
{"text": "Yeah it was crazy watching my cock raise, vibrate and explode without even touching it!", "label": 1}
{"text": "Try playing virtually", "label": 1}
{"text": "I put it right below my balls on the flat area and moved it around until I found the sweet spot then it exploded!", "label": 1}
{"text": "The flat head attachment.", "label": 1}
{"text": "Generally I sincerely agree. I eat my wife so often I swear she’d try to stop me. But playing devils advocate he could be right. There are times women’s vaginas balances are off and can taste acidic etc. My wife’s taste changes now and then. Just maybe a thought to go to your gyno and just check to make sure the small change he doesn’t have a viable complaint. I’d like to not know there’s a man out there u willing to eat pussy. That’d would be sad and he’d have to return his man card", "label": 1}
{"text": "Haha your “friend” is smart.", "label": 1}
{"text": "All. The. Time.", "label": 1}
{"text": "That’s next on my list.", "label": 1}
{"text": "Perfect addition to any shopping list.", "label": 1}
{"text": "Yes. Where are they?", "label": 1}
{"text": "It just seems they are out there but how are they found?", "label": 1}
{"text": "Hi, i used to have the same problem of not being able to cum for a long time, i had a girlfriend at the time and i was sure it wasnt her fault but it still was a problem.I dod not had pain while having sexual intercourse and i dont know if thats normal, so maybe get that checked. I still dont know what \"cured\" me from that problem, but i advise to stop masturbating and, if you watch porn, stop watching, because its like a mental clean for you. Sometimes we think its the body thats blocking somethings when its trully the mind. I dont know if dropping porn is going to help on that, but it could and i think its a good life choice anyway", "label": 1}
{"text": "So basically just shoot it in my own mouth?", "label": 1}
{"text": "Ok thanks.", "label": 1}
{"text": "She can.  Anyone can. \n\nBut that's not what this describes.  After the classic \"fight or flight\" responses to being attacked, there are \"freeze and fawn\".  When someone is bigger and stronger, or has another form of power over you, it's quite instinctively normal to try to soothe, placate the abuser.  To persuade them to hurt you less badly.  \n\nHeck, when I was a middle school girl there had been some teen rape abductions near us in the news and my mother very painfully told me that if it came to it, playing along with a man is sometimes better than ending up dead.  Explicitly teaching me how to mitigate the damage and survive. \n\nThis ends up really toxic because a victim can end up feeling as though they complied or were complicit in the act.  Sometimes even returning to the abuser repeatedly, as they've been told to do.   \n\nBoth men's and women's bodies can have sexual response in rape situations.  Men can get erect, women can lubricate, people can even orgasm and that's not the same thing as consent.", "label": 1}
{"text": "It's perfectly normal. I do it 3 to 6 times a day and I crave for something more and I'm 39yr man", "label": 1}
{"text": "You need to seduce her everytime make her feel loved even without sex Message her help her at home like make dinner and clean up and open up about your feelings towards her and be honest about it", "label": 1}
{"text": "He just don't want you or he has another girl he likes too", "label": 1}
{"text": "He truly loves you just as you are. You may not see it. But, he should also be more supportive of how you feel.", "label": 1}
{"text": "Don't listen to your friends it thier experience not yours", "label": 1}
{"text": "It's hard not to i do it 3 to 5 times a day only been with one woman and I still do it when I'm bored", "label": 1}
{"text": "If he has expressed interest in meeting again, it's likely that he enjoyed spending time with you and doesn't feel pressured. Don't overthink it, just go with the flow and see where things go.", "label": 1}
{"text": "Don't listen to these temptations. This just opens the door for more. Next thing you are wondering if you are bisexual yourself. Then its on to sex it  self, \" I'm a giver not a receiver\" does that make me gay? Etc.. that's how temptations work, compromise, compromise. If you are not attracting women, seek a professional date counselor, it's a part of growth and life.", "label": 1}
{"text": "When I was16 worked with a 32 yo lady hot and we flirted a lot, well she invited me to join her in her vanagan for some fun. Whe we got to the mountain park (real close to our work) she said a friend wanted to join us. I was in heaven and thought f ya a threesome I was told to pleasure her low so I did. We moved around and she put the blanket over me and I was facing up doing my best when the door opened. I felt soft hand move up and stop I was exited then the tongue touched it oh I was having a great time. I still think about it A lot. It was great but it was the waiter. Damn I loved it. I questioned my sexuality but I’m straight I went to his house 2 more times cuz it was great. I never did it again but now I want to giving it back to someone of age of course", "label": 1}
{"text": "Do you want him to last one minute?", "label": 1}
{"text": "You know, if focusing on your body is ruining the mood, maybe it’s time for some distraction techniques! Like counting how many times he uses tongue—bonus points if he accidentally licks his own nose!  Seriously though, take it slow and remember that it’s all about finding what works for both of you.", "label": 1}
{"text": "let's be real, it can feel like trying to fit an elephant into a VW Bug. You’ve got this! Just remember: communication is key. Maybe set some safe words or signals so everyone knows when it's time for a break (or if someone needs a snack!). And hey, if it gets too claustrophobic, just imagine you're in an exclusive club where only the coolest people get to hang out... and you're the VIP...", "label": 1}
{"text": "I will tell you from my point of view as a woman, if I had any Intrest in a guy & found he did this, zero interest now.", "label": 1}
{"text": "Thank you for posting in the r/Sex community. To ensure that everyone respects our safe space, we ask that you familiarize yourself with our Forum Rules and Posting Guidelines — which are visible in the forum’s sidebar, and also linked [here](https://www.reddit.com/r/sex/about/rules/).\n\n***\n\nRestricted subjects in r/sex include sex stories (which are permitted in the Weekly Sexual Achievement Thread only), body image and penis-size issues, hookup attempts, common topics which are considered repetitive in our forum, and requests for private chats.\n\nTo cut back on comments that add little value to the conversation, we have instituted a minimum character requirement that will silently remove comments that fall below it.\n\n***\n\nAny attempt to seek private chat or otherwise deviate a conversation away from the main forum, WILL result in a permanent ban. This goes both for OP and for all comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sex) if you have any questions or concerns.*", "label": 1}
{"text": "let your partner know about the situation and how much it affects you and take it slow build different bonds so it be like you both become best friends", "label": 1}
{"text": "he probably dont know how to sext to try to initiate the sext some time get freaky at least that how i do it with my daddy", "label": 1}
{"text": "I dont know if you can bae but givehim headlike four times a daay and watch what happens", "label": 1}
{"text": "Same especially from a friend that he's going to stay friends with.", "label": 1}
{"text": "mutual masturbation is usually safer than sharing snacks at a movie theater. But if you're still feeling anxious, maybe it's time to consult a professional instead of Googling your way into panic mode! Stay safe and keep those hands clean—both literally and figuratively..", "label": 1}
{"text": "It’s extremely inappropriate and I’m inclined to say yes.", "label": 1}
{"text": "My cousin sister. I was a kid, she was in her early twenties. I was brought up in Bangladesh. And no I don't but who can tell", "label": 1}
{"text": "Okay but like... this is the \\*sweetest\\* and hottest thing ever. 😍 Honestly, it’s all about that communication and feeling safe enough to go \\*all in\\*. Y’all are really setting the bar for how to make marriage sexy af. So, who’s tryna have that kinda open talk with their partner tonight? 🤭 Or are we all still overthinking and holding back? Let's discuss!", "label": 1}
{"text": "Bruh, you is gay", "label": 1}
{"text": "Search up Gold Rush", "label": 1}
{"text": "Sounds like your IUD is auditioning for a role in a horror movie with all that bleeding drama!  But seriously, it’s like your uterus decided to throw a surprise party and forgot to send you the RSVP. on a serious note, it’s great that you’ve checked in with your gyno. If this keeps happening, maybe consider asking if they have any “IUD etiquette” pamphlets? Wishing you less drama and more fun times ahead.", "label": 1}
{"text": "I think the only thing she caught is a case of 'what was I thinking?!' Maybe next time, you should stick to gifts that don’t require a manual on how to use them! Just remind her to hydrate and maybe avoid any future encounters with 'the great unknown at least until she's had some practice.", "label": 1}
{"text": "worst-case scenario, you both laugh it off and end up with a hilarious story to tell your future kids about how their parents' first kiss was more like an awkward game of Twister! Just go in there with confidence and maybe some minty fresh breath—if all else fails, blame it on the mints...", "label": 1}
{"text": "Sounds like he might be taking advantage of your desperation", "label": 1}
{"text": "She won't tell you because she already told Chad. And Chad does it now for you. Yes, there's definitely a Chad there. Sorry bud", "label": 1}
{"text": "My(m24) fiancé(23f) and I have been together 7 years and I don’t think her period has ever stopped us once. Lay down a towel or shirt you don’t care about and use way more lube and you should be fine.", "label": 1}
{"text": "I'm sorry but it's slightly hilarious to me that she went straight to blowing a brand new toy on the spot lol.", "label": 1}
{"text": "STI advice!!!!! Lol twilight zone", "label": 1}
{"text": "Let's talk about the concept of \"easing off the brakes\" rather than just pushing the accelerator. Sometimes, the key to unlocking pleasure is about removing the mental blocks or anxieties that hold us back. Try focusing on savoring the sensations without the pressure of reaching an orgasm. Think of it like a gourmet meal—you wouldn't rush through it, right? Take time to enjoy each bite, or in this case, each sensation. Another fun technique is to flip the script on yourself. Tell yourself that you're not allowed to orgasm (or, if you are open to exploring something kinky with a partner, they can tell you you're \"not allowed to cum\")! It sounds counterintuitive, but this can actually take the pressure off and allow you to focus more on the sensations building up in your body.\nAlso, explore different types of stimulation. The clitoris is a powerhouse of nerve endings, but orgasms can also come from other places like the G-spot, A-spot, or even through nipple stimulation. Sometimes, a blended approach can unlock new orgasmic pathways. By shifting your focus to the pleasure of the moment and experimenting with different sensations, you might find that orgasms come more freely and with less effort. If you're interested in diving deeper, I have a whole [book](https://kennethplay.com/book/?utm_source=reddit&utm_medium=forums&utm_campaign=book) on female pleasure, with plenty of techniques and insights. There might be some useful stuff in there for you!", "label": 1}
{"text": "I am almost scared to ask what the ramble fap genre is, but my curiosity is getting the better of me.\n\nWhat is that?", "label": 1}
{"text": "You need a an alpha not one that is attracted to the same sex", "label": 1}
{"text": "Exactly! A little teasing throughout the day goes a \\*long\\* way. 😏 Keeping things playful and building that anticipation is seriously underrated. Who else loves a good flirty text to keep things spicy?", "label": 1}
{"text": "You might have the next Freddie mercury on your hands", "label": 1}
{"text": "What getting you aroused then?", "label": 1}
{"text": "Well no offence but if you are whom I think, you are the LAST person on earth that should give that advice.", "label": 1}
{"text": "Nah choke em it's fine.", "label": 1}
{"text": "This life, is different than yours. I don’t get comfort in it. It’s just hurts me. In more n more outlandish, bizaar, flukely bad luck ways.", "label": 1}
{"text": "What's mdlb?", "label": 1}
{"text": "That last line is pure fear mongering.  It’s possible to revive someone who’s been half crushed in a car crash, let alone had their neck squeezed kinda hard.  \nYes it’s dangerous. But resuscitation is absolutely achievable.", "label": 1}
{"text": "Looked it up. It seems a bit extreme and i don't think I'm into diapers and calling names, I don't think he is either.", "label": 1}
{"text": "I looked it up and it's extreme. I'm not into diapers and  roleplay stuff and I don't think he is either. What are some basic things we can try. I don't think mothering is even the right word for it because I'm the sub in the relationship.", "label": 1}
{"text": "I think that brain damage is already present.", "label": 1}
{"text": "That's what a 4 year old says about broccoli. He a little bitch....", "label": 1}
{"text": "For letting go, getting into your body and feeling more close and present: Try some really slow pre games like just kissing with no touching for three minutes, or both wearing blind folds and caressing eachother with or without clothes, bathing together, reading erotic stories or playing an erotic game on an app that gives you small challenges, sharing fantasies, dancing in the dark or massaging... Blindfolds or restraints can help with letting go, giving the control to your partner can be very arousing, just make just to read up on consent, safe words and after care. For orgasms during penetration, really warm up, play, and take it sloooow.. use oil ( if no condoms) or lube and get your partner to caress your clítoris, around it, around your lips... Giving you penetration and friction and stimulation around the vulva and your clit. Guide them or also use your own fingers, show them how to get the rhythm and intensity that works for you... Don't stress... The longer you enjoy it the better. Breathe deeply... Let go... Comunicate. Xx", "label": 1}
{"text": "No it's totally safe, and will keep you two from reproducing which is good for the world.", "label": 1}
{"text": "Really? Have a conversation about it. I'm sure she'll be more than happy to.", "label": 1}
{"text": "Ya. I’m a medic.  So yes, I’m very aware of the whole process of both anoxic and hypoxic related arrests.  And that survival rates for CPR are directly impacted by down time before compressions are started.   \nSo do start cpr and don’t keep choking your partner when they stop breathing.", "label": 1}
{"text": "She sounds like a bitch.  Find someone else.", "label": 1}
{"text": "Send them to me. I’ll check to see if they’re leaked online.", "label": 1}
{"text": "what positions would be best?", "label": 1}
{"text": "Perfectly normal to be feeling these ways, needs are needs and it’s tricky when this is a big priority to you and you don’t feel like they’ve been met. \n\nSometimes it is just a non compatible thing and nothing can be done. \n\nBut first. \n\nThe other partners you speak of, \n\n- what size were they all? \n- what did they do differently? \n- what did you like from them? \n- what didn’t you like from them? \n(Just the sex perspective) \n\nNow \n\n- what do you like about him? \n- what parts of the sex do you love with him? \n(Just the sex perspective) \n\nSex isn’t all about PIV. \n\nSex, intimacy and arousal is and starts in the brain. \nNow when someone is new to sex or Intimacy in those ways it’s hard to perform to a level of someone that isn’t on the same level as you. That’s how experience works. \n\nSometimes patience when someone doesn’t have experience can trump previous experienced lovers. It all comes down to the eagerness of the individual. \n\nDo they want to even be dominant or learn these dynamics. Are they curious about sex or research it and want to get better that? \n\nNow you’ve stated that you’ve tried different positions, can you elaborate on what you’ve tired so I don’t just give basic dud or heard it, seen it, tried it advice?", "label": 1}
{"text": "Maybe you guys could try a toy? Or learn some new ways to have sex inside the videos. Keep experiencing sensations that neither of you have tried before. It might be helpful for you to find out what your sensitive spots are.", "label": 1}
{"text": "Sounds like you’ve been on quite the rollercoaster ride!., sometimes the best way to improve intimacy is to throw in a surprise element—like a pizza delivery guy showing up at the wrong time", "label": 1}
{"text": "when you masturbate and you’re wet, try inserting one finger slowly and see how it goes. you don’t have to go all the way in.", "label": 1}
{"text": "Stay in school, minor.", "label": 1}
{"text": "it’s not of their business. make sure that your friend will cover for you in case she calls", "label": 1}
{"text": "“Stay out of my business”\n\nLittle girl, you literally put your business out there on the internet 🤦🏻‍♂️", "label": 1}
{"text": "Even then you all are adults here ur not doing anything wrong or illegal everything is consensual and none of there business in this case even if she did max they will e mad for few days and ultimately be okay with it as you're there only daughter.", "label": 1}
{"text": "Congratulations! I am in a similar situation as you. The past year, I have been having more sex with my wife at 41. I can think of some reasons why I am lasting longer, these may work for you:  \n\\- Prolonged foreplay reduces my arousal, cos I get hard then soft multiple times. My job is less stressful now so I have time to give her massages while she breastfeeds the baby.  \n\\-  I masturbate on days we don't have sex, in total I cum 5-6 days a week. I find this makes me last much longer, to the point where sex is almost unstimulating and more like a workout, almost mechanical.  \n\\- I try to tire myself by lifting her a little or going for as long as possible until i'm exhausted. I find that the additional strain reduces my arousal but doesn't affect the hardness. My wife also loves the idea that I'm working out!  \n\\- If I feel like cumming, I stop, pull out and give her oral.\n\nOn average, there's a 1 in 3 chance I cannot cum. Partly due to age, partly due to my recent ejaculation I'm too 'spent' or not hard enough, partly because my wife would be dry already after the multiple Os and prolonged sex and she wants to stop. She would have orgasmed several times already.\n\nI find that focusing on her and not myself is key to prolonging my erection and the overall experience. Whether or not I orgasm isn't important to us anymore. When we were younger, she was a school badminton player and I was a skinny nerd, yet she'd please me every way possible. Now she's flabby after 4 children, still works 40h a week, but I have 15kg more muscle and workout almost daily. I am glad to be paying it back =)))", "label": 1}
{"text": "I'm down wya let's hangout we can take it slow if u want to", "label": 1}
{"text": "Certain things should be gendered and this is one of them. I agree with you on feeling less feminine and definitely makes him less masculine. It's the new trend they trying to shove down our throats. It's becoming more and more popular in videos etc. Bullshit if you ask me.", "label": 1}
{"text": "You can’t. Small boobs barely even jiggle or bounce. They’re basically nothing. Work on your ass.", "label": 1}
{"text": "If only there were an instruction manual for this kind of thing! Until then, maybe try turning it into a fun game: first one to cum gets dessert!.", "label": 1}
{"text": " It's like your brain is throwing a party and forgetting to send out the invite to your clit! Maybe you need a little 'sex meditation' before things heat up? Picture this: you, him, and a cozy blanket fort where no thoughts about school or memes are allowed! Or maybe just some sexy playlists to drown out those distracting thoughts. But hey, if grinding is your secret weapon for an explosive finish, then consider it your personal Olympic sport—gold medal for stamina!  Just remember, even superheroes need a break sometimes.", "label": 1}
{"text": "Her investigating ways to relax and be comfortable and be present in the moment and mentally present and you doing what you can to help her there will generally make figuring things out easier, if it doesn't resolve the issue outright.", "label": 1}
{"text": "Am sorry\nA willing woman to write +18 or perverted Rp?", "label": 1}
{"text": "practice using a popsicle so when your teeth hit the ice, it’ll hurt", "label": 1}
{"text": "Bit of a wildcard, but maybe he feels like his dick is too small and causes them to slip off, so you asking to make sure a new one is on correctly felt like a gut punch, made him feel inadequate, unmanly.", "label": 1}
{"text": "If you’re into VR nsfw, Blow!Reality is where the magic happens", "label": 1}
{"text": "I am up and super horny and want to see some dicks \n\nText me please \n\n216-849-8139", "label": 1}
{"text": "I am up and super horny and want to see some dicks \n\nText me please \n\n216-849-8139", "label": 1}
{"text": "I am up and super horny and want to see some dicks \n\nText me please \n\n216-849-8139", "label": 1}
{"text": "Why? It'd be a byproduct of this guy's situation, therefore somthing he should consider?", "label": 1}
{"text": "Yes, next-level VR nsfw fun is always worth checking out!", "label": 1}
{"text": "Blow!Reality delivers the best VR nsfw entertainment out there!", "label": 1}
{"text": "I agree, that spot for dope VR nsfw content is truly unbeatable!", "label": 1}
{"text": "You did not do anything wrong. He just wanted to fuck, and you expect more than that maybe? You are good and fine...", "label": 1}
{"text": "Train him better, hard and fast won’t last.", "label": 1}
{"text": "Are you okay with this arrangement? Hubby sounds like a lazy lover.", "label": 1}
{"text": "Men know women that are in Sex Utility, \nThose who are in Girlfriend Destiny,\nAnd those in Wife Eternity.\n\nIf he is good in sex he has options so why would he stop seeking novelty, some men like chasing hunting women more than the sex. Men know FWB is very often women catching feelings and then it is Dramas and emotional therapist...\n\nMost probably he puts you in one night sex after his quest was achieved. Next one.\n\nAlso : The survey found — in not shocking news — that 64 percent of the men surveyed said they climax during a one-night stand, while only 11 percent of the women reported the same.\n\nIf you have real intimacy with feelings and emotional bound and physical compatibility and body chemistry, you will have much more fun in a long term relationship.\n\nNever forget how women pair bond with Oxytocin.", "label": 1}
{"text": "The best thing to do to make it workout is to take some mushrooms the penis envy type makes you a bit touchy and if you just play sade greatest hits you're good to go", "label": 1}
{"text": "I hope you die of disease soon", "label": 1}
{"text": "Tips for Vaginal sexual\nhttps://youtu.be/636nbJBPF9I", "label": 1}
{"text": "Reading smut is the closest I'll ever get to having sex", "label": 1}
{"text": "women bodycount matters more to their sexual partner! u shouldnt have been so blatant", "label": 1}
{"text": "Prolly cus you put out easy. On to the next.", "label": 1}
{"text": "Perhaps you should take up a new pastime together, such as synchronized swimming or competitive board games—anything that will make you feel flirtatious! Alternatively, try to summon your inner magician by saying, \"Now you see me, now you don't. Hold on, what are we not doing?Just keep in mind that having a decent sense of humor is just as important as communicating. Have fun and keep things light; you never know. Behind that \"I'm not in the mood\" façade, you might just discover her inner wild side!", "label": 1}
{"text": "Your penis sounds like the friend who always makes sure to attend the last dance even when they arrive late to the party! However, you might want to talk to it about timing.", "label": 1}
{"text": "I was thinking about it. Maybe that was", "label": 1}
{"text": "But really, rather than depending solely on the advice of the internet, it might be time to see a specialist if you're experiencing unanticipated side effects. Just keep in mind that it's time to consult a doctor if your urine begins to charge rent for all that extra time spent there!", "label": 1}
{"text": "It sounds like your body is telling you, \"Surprise!\" with that watery blood. I remain here! Regarding the exhaustion and lightheadedness, perhaps your body is simply attempting to keep up with your newfound activities. But don't be afraid to phone your doctor if things grow any stranger it's better safe than sorry! Just keep in mind that it's time to get help if things begin to feel more like a horror film than a romantic comedy. I wish you luck on this journey.", "label": 1}
{"text": "Just be honest, please! Saying anything along the lines of, \"I've sampled the buffet but haven't tried the dessert yet!\"Plus, who doesn't enjoy a good plot twist? Your lover might value your candor more than you realize. Just keep in mind that practice makes perfect.", "label": 1}
{"text": "The most important thing is to be honest with your boyfriend. Additionally, you can always remind him that practice makes perfect if he starts to worry about your lack of experience. and working with a willing partner is the best way to practice! Simply consider it an enjoyable short journey in which you both get to discover new places.", "label": 1}
{"text": "it sounds like you got a two-for-one deal: a peek at the merchandise and an unexpected 'delivery'! Just remember, when it comes to sharing this news with his girlfriend, honesty is the best policy... unless you want to add 'professional secret-keeper' to your resume", "label": 1}
{"text": "I once caught my roommates boyfriend jerking of to my bikini pictures, i wanted to tell her but i kept quite. He once came by too look for his girlfriend  by our dorm room but she wasnt there that day. I let him in so he could wait for he till she came, but he just kept staring at me, he told me  was beautiful and wished he met me before his girlfriend. Ngl he was cute asf i let him feel my titties but we eventually fucked before my roomie came back", "label": 1}
{"text": "I lost my virginity to a boyfriend i had but he was a virgin too, later met another guy majoring in my course. he said he wanted friends with benefits and did not want a relationship, i let him fuck and ohh my. i have never been fucked like a slut before, he made me cum four times till i collapsed in my own cum", "label": 1}
{"text": "I left my boyfriend because he was not able to satify me.  i might be a freak who loves to get slapped and fucked till i cum but he was not just feeling It, I would  be fingering myself in front of him an he wont get hard. Just the look of a dick makes me horny enough", "label": 1}
{"text": "Nobody said get anything over  take drugs this is no sober matter to decide while sober", "label": 1}
{"text": "This is absolutely a decision to take while sober, what the actual..", "label": 1}
{"text": "I would like to get together with you", "label": 1}
{"text": "Girl, you did nothing wrong. Your safety and comfort come first, always. If he can’t respect that without getting moody, maybe it’s a sign to have a real talk about boundaries and respect.", "label": 1}
{"text": "I’m going to get banned here but I’m just saying only one hole is fertile ……", "label": 1}
{"text": "Jeez Louise … I wish I’d asked this question at your age.  \n\n#1:  recognize that your wife MAY be feeling a lot of self doubt as a mom and as a women (body changes post pregnancy, etc).  \n\n#2:  schedule away time (maybe it’s just an overnight in a downtown hotel) to remember what it’s like as a couple.  \n\n#3:  this one is gonna sound ridiculous, but up your dating game.  Dating a rested, libido in tact woman is EASY compared to dating an exhausted, often feeling unsexy mom.  My wife’s emotional erogenous zones changed A LOT.  You may have to recalibrate.  \n\n#4:  learn how to argue.  Sounds ridiculous … but it took me 25 years to stop saying stupid shit like “you always …” and “you never …”\n\n#5:  if there’s an imbalance keeping at least some focus on the marriage as time permits, seek counseling.  My wife prioritized the kids and family members over our marriage.  She assumed we here good and there would be time for us later.  I almost divorced her … and in hindsight it’s MY fault for not demanding couples therapy and addressing head on.  \n\nBest!", "label": 1}
{"text": "ahhh guys are assholes. says another woman who ignored every single red flag je threw at her", "label": 1}
{"text": "God I wish I was attractive and didn't need to do anything to have women want to be with me.", "label": 1}
{"text": "Your boyfriend is gay.\nNo ifs ands or but(t)s.", "label": 1}
{"text": "I'm going to guess you're young, and it's either your first relationship or one of your firsts.\n\nGirl, come on and have a bit of common sense.\nThe man you're seeing has shamed you for something that is 100000% NORMAL, and you're second guessing yourself?\n\nThere isn't a straight man in this world that wouldn't die to make his girl 'wet'.\n\nWhat do you want to hear? That you should be self conscious? That yes, it's a problem?\n\n🙄", "label": 1}
{"text": "You should have worded it \"How does my boyfriend get past his aversion?\" NOT \"Am I wrong?\" when you \\*already know\\* he is the one with a problem, not you. \n\nThat is why you are getting negative responses-- no reason to word it as though you don't know basic biology, it's inviting people to rage against your bf", "label": 1}
{"text": "Untrue. There a hundreds of ways people learn to with and past aversions. There are entire professions dedicated to helping people with it.", "label": 1}
{"text": "You failed driving test 18 times?! Please for all sajes, don’t attempt the test a 19th time.", "label": 1}
{"text": "Man is committed with failing HAHAHAAHAHAHAHAHAHA, got only 1 driving test is all you need", "label": 1}
{"text": "Hence the wording \"get past his aversion\". You are aware he can develop strategies that will improve your sex life and minimize his aversion, yet you are here saying rubbish like \"am I wrong for being wet?\" \n\nYou are well-aware of what he can do and that that is ON HIM. Is there a reason you purposefully tried to enrage people with this post title?", "label": 1}
{"text": "I gotta say that if you failed the drivers test 18 times that sex is probably the least of your problems", "label": 1}
{"text": "19th try is the charm HAHAHAHAHAHAA", "label": 1}
{"text": "Your pussy is awesome.", "label": 1}
{"text": "There's a lot context missing here. These aren't problems a 27 year old should have. You need to pass the driving licence, you need to find a side job to afford a hotel etc. What are you doing with your free time?", "label": 1}
{"text": "Girl, you're putting in all that effort and he's acting like it's no big deal? 🙄 Sounds like he's missing out on a whole snack! Maybe it's time to shake things up or have another real talk. You deserve someone who matches your energy and craves you just as much. Don't let him dim your sparkle, babe! 💖", "label": 1}
{"text": "May be you need clit stimulation instead of PIV. Can he focus on that instead, as you are able to orgasm with masturbating he can do that too with his fingers n tongue.", "label": 1}
{"text": "I disagree but go ahead and delete me", "label": 1}
{"text": "🤣 if the truth makes you feel better", "label": 1}
{"text": "A classmate’s mum failed so many times that when she finally passed, her instructor bought her a bottle of expensive champagne and thanked her for paying off his mortgage through so many lessons 💀", "label": 1}
{"text": "It’s her juices on you dude", "label": 1}
{"text": "If you are a virgin, please don't insert anything in the vegina.  You must preserve it for your husband. It will help you in your lifetime a lot. \n\nQuote \n\"Is It Also Acceptable For Women to Masturbate?\nWomen should never insert anything (hands, fingers, tampons, dildos, etc.) into their vagina but rather preserve the tightness for the man. Women should be married to a man and be fulfilling all of their sexual needs with their husband. I am sure that any woman, regardless of weight, size or looks, can find a man to appease them of their sexual needs. But it is much more difficult for a man to find a woman who is willing to take... \"\n\nSource: https://isawthelightministries.com/Mans-Domain/masturbation.html", "label": 1}
{"text": "The former", "label": 1}
{"text": "I can't...", "label": 1}
{"text": "It's probably a fake post", "label": 1}
{"text": "I'll take the blame but I can't...for reasons I can't mention here", "label": 1}
{"text": "Just get a vasectomy man. It's easy fast and reversible if you ever do want kids. Best 800 bucks I ever spent. Those pills are poison to women.", "label": 1}
{"text": "There is NO WAY that the dozen posts every week on this sub about anallingus are legitimate. I just can’t believe it.", "label": 1}
{"text": "You brought this on your self", "label": 1}
{"text": "Yes he has way bigger problems 💀", "label": 1}
{"text": "LITERALLYYYYY. It should actually be a little sweet", "label": 1}
{"text": "Thank you, that's enough reddit for today.", "label": 1}
{"text": "Send them to me, I’m a lesbian woman trapped in a man’s body", "label": 1}
{"text": "😭😭 the way i audibly laughed", "label": 1}
{"text": "But what does it all mean basil", "label": 1}
{"text": "Sometimes I learn life hacks I hoped to never need to know.😅", "label": 1}
{"text": "Hmmm I suppose some people would say nutty can be sweet", "label": 1}
{"text": "Most people don’t expect a perfect body when looking for their potential partners. I would assume most men would think mom body if you specify you have kids and don’t workout constantly. But if you want validation there’s tons of subreddits on here and men that would love to hype you up girl ❤️. On a side note we all have things we are insecure about. I have a fuck ton of loose skin on my stomach and I’m a small person. I used to think the same thoughts of myself until I started going to swingers clubs and found I’m highly desired. Total ego boost.", "label": 1}
{"text": "🤣🤣🤣 why did I laugh so hard at this?", "label": 1}
{"text": "The Earth.", "label": 1}
{"text": "Omg I read the title as feces", "label": 1}
{"text": "Read this : https://education.nationalgeographic.org/resource/health-every-size/\n\nAlso do not worry if a partner is into you well that means they are attracted to you and want to discover, love and make love to your whole body. You are indeed beautiful and I think your family was jealous of you.", "label": 1}
{"text": "sit this is a wendy’s", "label": 1}
{"text": "I mean, you've gotta expect these kinds of responses when going into a thread about eating ass 🤣", "label": 1}
{"text": "If it's bitter, it's a spitter also applied to tabs of acid bc if it's bitter it's not acid and is instead an NBOMe so spit it before your arms fall off", "label": 1}
{"text": "Your man may have something to tell you…", "label": 1}
{"text": "What a horrible day to be able to read.", "label": 1}
{"text": "Seems to me that the hubs has problems. Move on before there's more", "label": 1}
{"text": "If it’s bitter don’t be a quitter and clean that shitter", "label": 1}
{"text": "Why.. why not??", "label": 1}
{"text": "I'm encouraging her to do it but she just says \"I will look for one, but it doesn't matter that much because they'll probably say that I should look for therapy and use a dilator \"", "label": 1}
{"text": "I had a talk about it like 30m before making this post and she never went to a gynecologist\n\nAnd I think that's strange because it's not just about the pain but it's a common thing seeing a gynecologist, but she comes from a religious family and they think women just need to go if they're having sex.", "label": 1}
{"text": "Iv done it once to my baby daddy and it was the gayest looking thing ever. I felt like I was the guy and he was the bitch. Never again. But him to me is great. An the fact that this guy ask gives me the “gay red flag” such a turn off", "label": 1}
{"text": "Make hi cuckold and watch us i will teach him how fuck a women and make her leg shake", "label": 1}
{"text": "And that’s enough Reddit for the day. Wonder men’s testosterone levels have tanked in the last 49 years. Boys eating their own cum out of women. lol…. Yes everywomans dream….", "label": 1}
{"text": "I do enjoy it but it hurts later on. I want him to keep doing it while he's at it.", "label": 1}
{"text": "I wanna do the latter but how do I deal with the pain later on.", "label": 1}
{"text": "I want it but I want to calm down for now while I get used to it.", "label": 1}
{"text": "looks like ladies no more into bad boys", "label": 1}
{"text": "she is indirectly asking someone to make out who can do softly", "label": 1}
{"text": "I certainly am but just needing my time to be comfortable", "label": 1}
{"text": "Enjoy it little girl!\n What you are getting is something all girls crave for!\n\n Ask him to initiate things gently and then spice up!", "label": 1}
{"text": "she either doesn't like vanilla sex ig", "label": 1}
{"text": "Maybe his sexual energies elevate yours", "label": 1}
{"text": "I thought ladies like that shit", "label": 1}
{"text": "It could work but not reallly", "label": 1}
{"text": "There's no need to worry about that.\n You are not doing anything irl,", "label": 1}
{"text": "Best way to get pleasureable sex is Getting clapped by someone who is in relationship.\n It will make you feel heaven on earth", "label": 1}
{"text": "Why don't you try tribbing?", "label": 1}
{"text": "you gotta give a try to do kegel exercises", "label": 1}
{"text": "شوفتي انتو حارمين نفسكو من ايه وحارمينا معاكو", "label": 1}
{"text": "It's frowned upon \n\nhttps://youtu.be/g-iXx179_h4?si=TJAuBHmiItBCacW8", "label": 1}
{"text": "Dude fuck off home before you fuck off from your job.", "label": 1}
