{"text": "C", "label": 1}
{"text": "C", "label": 1}
{"text": "B", "label": 1}
{"text": "You assume animals have a structured language with \"words\". It'd be awesome but judging by my cat that's not the case.", "label": 1}
{"text": "Wouldn't you say it's also like a post-modern emoji?", "label": 1}
{"text": "B", "label": 1}
{"text": "A & B; C can be protected by the NSFW tag", "label": 1}
{"text": "A", "label": 1}
{"text": "C", "label": 1}
{"text": "Sorry you didn't take care of your body better you meatball 🧆 \n\n\nNow I am actually talking shit about you", "label": 1}
{"text": "B", "label": 1}
{"text": "I do this lol\n\nIt's like a mental 'shut the fuck up' to your muscles. The brain reasserting that 'yes I know we're meant to be trying to sleep now, but I'm still in control here you tit'\n\nSometimes it works 😂", "label": 1}
{"text": "A", "label": 1}
{"text": "I dunno man. I kind of half fell asleep last noght and dreamt about someone I haven't seen or talked to in ages. I was sure it wasn't real and then I woke up on my arm chair. Dreaming is so strange. I didn't need those memories brought back up again! 😂", "label": 1}
{"text": "Incorrect", "label": 1}
{"text": "A", "label": 1}
{"text": "It’s crazy how in stories, people can go from being the bad guy to the good guy just by sticking around and changing for the better!", "label": 1}
{"text": "A", "label": 1}
{"text": "A", "label": 1}
{"text": "A and B", "label": 1}
{"text": "C", "label": 1}
{"text": "A", "label": 1}
{"text": "The Earth orbits its closest star.", "label": 1}
{"text": "After living in south east asia why do we use paper when it just spreads and dries the shit, bum gun + little bit of paper is the way to go", "label": 1}
{"text": "More like a pair of awkward legs.", "label": 1}
{"text": "Okay, Fred, is there any way that you can stand up?", "label": 1}
{"text": "C", "label": 1}
{"text": "I think so too when car horns depends on the mood it can be a way or sort of communication to all the drivers. Maybe it will turn road rage into much safer fun expereince and less stressful drive.", "label": 1}
{"text": "Im just happy to know that you took your son in the park and let him feed the ducks that might be the same duck you have fed before or not. Its a great story to tell to your kids as well. Some parents dont do that anymore. Who knows, some of the ducks might have recognize you and tell their great grandchildren how amazing the cycle.", "label": 1}
{"text": "Okay Fred is there anyway that you can standup?", "label": 1}
{"text": "Okay Fred is there anyway that you can standup?", "label": 1}
{"text": "Okay Fred is there anyway that you can standup?", "label": 1}
{"text": "C", "label": 1}
{"text": "That’s one weird looking seagull, Amy.", "label": 1}
{"text": "That’s one weird-looking seagull, Amy.", "label": 1}
{"text": "Well at least it's not raining.", "label": 1}
{"text": "Well, at least its not raining.", "label": 1}
{"text": "4 generations of ducks have passed, may the legacy continue", "label": 1}
{"text": "I also got the same exact reaction as you did when I first saw one", "label": 1}
{"text": "If proving something matters was a job, I’d need a raise for all the times I’ve argued with my plants about their life choices!", "label": 1}
{"text": "Ummmm.. kinda makes sense.. you won't know you died.. but for sure you'll know you're about to die..", "label": 1}
{"text": "CheeseIt-O's\n\nSwimming GoldFish\n\nPeanut Butter Cheese Cracker Crunch", "label": 1}
{"text": "Add moving the goal post to the daily words, since OP talked about dying and this fat fuck started talking about his heart attack and acting as if it was the same and it clearly is the norm for everyone dying ", "label": 1}
{"text": "Did you die though?", "label": 1}
{"text": "He was glad to be a part of their group.", "label": 1}
{"text": "That must've been a crazy feeling", "label": 1}
{"text": "I wish someone makes an AI powered digital copy of me, like in eva ai app, so my friends would have a functional model of mine when I'm no more.", "label": 1}
{"text": "Ever since she announced this song has been stuck in my head and while it strikes me as a frustrating song and over a simplifies a case, I truly hope that it is not going to be used during the inauguration, only because it will cause me to have the song stuck in my head for another four years.", "label": 1}
{"text": "C", "label": 1}
{"text": "B", "label": 1}
{"text": "The Smiths definitely don't celebrate every day, Bob.", "label": 1}
{"text": "I feel like ive heard this before", "label": 1}
{"text": "Well, at least it is not raining.", "label": 1}
{"text": "Well, at least it's not raining.", "label": 1}
{"text": "Bigfoots just have like 3 retarded cousins that set the world ablaze", "label": 1}
{"text": "Well let's hope so because we would need a #Goku to fight a #PerfectCell #dragonballz", "label": 1}
{"text": "It's because most American food is pretty gross. There are few parts of the country that have good cuisine. Even Americans don't really like their own food and prefer to eat foreign food if they have the money. But all that high fructose corn syrup and cheap junk food has really given Americans a sweet tooth and a fat belly.", "label": 1}
{"text": "It's a constant struggle for survival as we're bombarded with toxins and pollutants, forced to reproduce and regenerate endlessly.", "label": 1}
{"text": "Well, I guess I've been calling my bike by the wrong name this whole time. Thanks for the clarification", "label": 1}
{"text": "Looks like we'll have to start measuring our progress in terms of how many cubic feet we've lost instead of pounds on the scale. Time to invest in a measuring tape and a calculator.", "label": 1}
{"text": "And here I thought I was finally getting in shape... turns out I've just been deflating this whole time.", "label": 1}
{"text": "Americans actually have a pretty strong spice tolerance though? And wtf is sweetness tolerance lmfao", "label": 1}
{"text": "”B”", "label": 1}
{"text": "Flying millions of kilometers into space might mean losing your way back to Earth forever, space is vast and unforgiving!", "label": 1}
{"text": "A", "label": 1}
{"text": "It's always easier to fall than to fly..", "label": 1}
{"text": "C", "label": 1}
{"text": "B", "label": 1}
{"text": "Because a large part of the population \"Can't Read\"", "label": 1}
{"text": "A", "label": 1}
{"text": "Because if you egg a house today you either get shot, recorded, sued or punched", "label": 1}
{"text": "It’s because I will open my door and hospitalize the kids who do that shit to my house and across South Florida the sentiments are largely the same.", "label": 1}
{"text": "Wow bro, you sound really tough!", "label": 1}
{"text": "Definitely! Without history based professions, we might lose umportant lessons from the past that could help us make better decisions in the future.", "label": 1}
{"text": "A", "label": 1}
{"text": "A", "label": 1}
{"text": "They were a menace but now I missed this", "label": 1}
{"text": "I mean yeah. If you were fucking with  my house, you'd be lucky if the only thing I did was call the cops. Like who the fuck do you think you are. You ain't entitled to vandalism or messing up anyone's house.", "label": 1}
{"text": "Someone let Florida Man out of his padded cell again, I see.", "label": 1}
{"text": "Even his username is cringe.", "label": 1}
{"text": "Found the vandal. Go fuck yourself.", "label": 1}
{"text": "\"kids aren't kids anymore\"\n\nKids trying to be kids: \"Honey, I'm calling the cops. They're wasting our precious (biodegradable, easy to clean up) TP.\"", "label": 1}
{"text": "It's toilet paper, no one is advocating for destruction of property here. And kids aren't buying the expensive multi-ply tp that's going to last for weeks. My neighbors all have high school aged kids in sports, the tp was gone in a week between rain/wind and taking a couple minutes to walk around their yard and pick some up like twice. \n\nJust run outside and give them the ol \"you'd be lucky if I had called the cops\" maneuver, whatever that entails. I'm assuming some form of threats/assault of minors. GL with that court case lmfao", "label": 1}
{"text": "Maybe we just call it low because the rest of the world is on a whole different level of awkward!", "label": 1}
{"text": "Who do you think it is? Obviously it changes depending on your definition of 'naked'", "label": 1}
{"text": "A", "label": 1}
{"text": "Wow, never thought of it that way. It really shows how the same message can have such different meanings depending on your employment status.", "label": 1}
{"text": "  \"Oxygen would be the ultimate party crasher, always there but never invited!\"", "label": 1}
{"text": "Go have fun with your own shit. Fuck off my property. Entitled brat.", "label": 1}
{"text": "Guess it's time for us Southern Hemisphere folks to start a rebellion and take over the world.", "label": 1}
{"text": "Well, looks like I'm not the only one who had a dramatic birth.", "label": 1}
{"text": "What you don't know is that you're talking out loud.", "label": 1}
{"text": "USB-C all the way. Now we just have to guess speed, power delivery specs, on both the cable and the port. 🙃 Let alone the cables that straight out lies on their specs on Amazon.", "label": 1}
{"text": "Cry harder.", "label": 1}
{"text": "Look Sarah, bacon is not the right word.", "label": 1}
{"text": "Look Sarah, bacon isn’t the right word.", "label": 1}
{"text": "Half the paycheck, half the stress. It's a win-lose situation", "label": 1}
{"text": "What you don't know, is that you're talking out loud.", "label": 1}
{"text": "That’s a great observation! For salaried workers, it can feel like a break or a chance to focus on other priorities, but for hourly workers, it can mean financial stress and uncertainty. It really highlights how different work arrangements can lead to very different experiences of the same situation. Do you think companies should find better ways to communicate these changes?", "label": 1}
{"text": "A", "label": 1}
{"text": "B", "label": 1}
{"text": "Never heard of those", "label": 1}
{"text": "[https:\\/\\/www.reddit.com\\/r\\/Miniaturespainting\\/comments\\/1f8sv55\\/best_bitcoin_and_crypto_poker_sites_according_to\\/](https:\\/\\/www.reddit.com\\/r\\/Miniaturespainting\\/comments\\/1f8sv55\\/best_bitcoin_and_crypto_poker_sites_according_to\\/)", "label": 1}
{"text": "C", "label": 1}
{"text": "Look, Sarah, 'bacon' is not the right word.", "label": 1}
{"text": "Look Sarah, bacon is not the right word.\"", "label": 1}
{"text": "Look Sarah, bacon is not the right word.", "label": 1}
{"text": "Look, Sarah .bacon is not the right word.", "label": 1}
{"text": "B", "label": 1}
{"text": "Absolutely! You can still get stung by a bee even if you’ve eaten its honey. The bee doesn’t know you enjoyed it, it’ll sting if it feels threatened. So enjoy the honey, but watch out for the bees!", "label": 1}
{"text": "Yep, that bee’s just out here making sure you know it wasn’t a gift.", "label": 1}
{"text": "I guess my dog’s new title is Chief Executive Officer of Luxury Living! Who knew chasing squirrels came with such perks?", "label": 1}
{"text": "So, does this mean I can finally pursue my lifelong dream of becoming a professional snack taster? Because if I’m losing hours, I might as well make it delicious.", "label": 1}
{"text": "The North Eastern Hemisphere: where all the cool kids hang out! Meanwhile, the Southern Hemisphere is like that one friend who shows up late to the party with snacks.", "label": 1}
{"text": "I always knew that leggy spiders were just trying to flaunt their stuff! It's like they’re saying, Look at me. I’m 80% leg and 20% please don’t squish me.", "label": 1}
{"text": "You can make one decision one day and you will then your life will forever be based on that one decision", "label": 1}
{"text": "A", "label": 1}
{"text": "Imagine going to an uncontacted tribe and showing them some brainrot", "label": 1}
{"text": "On the contrary, fat is a way to store calories longer than most foods can possibly last, preventing them from going to waste. \n\nThat let our ancestors survive winters with very little food by eating as much as possible while plants are ripe and prey animals plentiful.  It's only if you *die* overweight that the excess food you ate over your lifetime is wasted.", "label": 1}
{"text": "Yeah, from an evolutionary point, it makes perfect sense. But obese people still have to eat to live.\n\nThey can't survive off their fat stores for 6 months.", "label": 1}
{"text": ">It's only if you die overweight that the excess food you ate over your lifetime is wasted.\n\nBody mass, even fat, requires more calories to sustain. Someone who is 300+ will on average need consume and burn many more calories than someone who is 150 lbs.  Thus, regardless of their dying weight, on average someone who is very overweight will have consumed and burned off much more food than healthy weight individuals over their lifetime.", "label": 1}
{"text": ">They can't survive off their fat stores for 6 months.\n\nWhy do you think that?", "label": 1}
{"text": "but they can do it with less food", "label": 1}
{"text": "Can they?\n\nThey'll be burning more calories than a non obese person, even if both of these people were sedentary all day.", "label": 1}
{"text": "They burned it off, which means it wasn't wasted. Just because someone is bigger doesn't mean that extra energy is wasted by keeping them alive. Kind of a shitty mentality to have tbh", "label": 1}
{"text": "Not to mention the downstream effects of trashed health markers, disease, and all the myriad health problems the excess weight **directly** causes.", "label": 1}
{"text": "Yeah it's a brilliant way to lose weight\n\nIt's not a good way to store food for later use like OP is suggesting lol.", "label": 1}
{"text": "Even that isn't strictly necessary.  It does vary quite a bit, but vitamin C will likely be the first vitamin your body runs out of, and that often takes around 6 months to happen (though it can happen sooner).  I definitely would not want to risk scurvy, so it really isn't worth doing, but strictly speaking an obese person could live for up to about 6 months with nothing but water and be OK at the end.\n\nOf course, you're still going to lose a hell of a lot of muscle mass doing any of these extreme fasts", "label": 1}
{"text": "> [Angus Barbieri was a Scottish man who fasted for 382 days](https://en.wikipedia.org/wiki/Angus_Barbieri%27s_fast)", "label": 1}
{"text": "How do you figure?  They'll be grumpy, but you can live off of fat stores for 6 months no problem so long as you have enough fat.", "label": 1}
{"text": "if you don't burn that fat, though, it stays wasted.", "label": 1}
{"text": "The energy is used keeping them alive *and fat* is their point. Being fat is not necessary to live an awesome life, in fact it's a (medical) detriment, if nothing else. So in that sense, it goes back to being a waste. You require more calories to keep yourself fat, not to keep yourself alive. There is a difference there.", "label": 1}
{"text": "Without consuming ANYTHING but water?", "label": 1}
{"text": "Yes.\n\nYou'll be pushing it with scurvy at that point, some would likely have it others wouldn't.  But otherwise your body has enough stores to get through just fine.\n\nAdd in a multivitamin and you can survive for as long as your fat stores hold out without any real limitations.", "label": 1}
{"text": "Think of it as leaving the engine running on a big truck Vs a little electric car. Same action, more energy used.", "label": 1}
{"text": "All body mass requires energy to sustain. The body is actively burning energy to keep itself fat", "label": 1}
{"text": "There are stories of people losing enormous amounts of weight consuming only water and multivitamins, and maybe black coffee", "label": 1}
{"text": "Yep.  I doubt that I'd personally have the willpower to do it, but there's definitely no biological reason it wouldn't work", "label": 1}
{"text": "The big caveat is that you'll need to be assessed medically on the regular to ensure you're not going through malnutrition", "label": 1}
{"text": "They'd become deficient in certain essential nutrients and would probably feel like shit because of it, but they would survive. With a way to supplement these micronutrients, they would be perfectly fine", "label": 1}
{"text": "It was wasted in the sense that if they were a healthy weight, they wouldn't need to consume nearly as much. For those trying to lower their environmental impact from a resource viewpoint, it's a legitimate thing to consider.", "label": 1}
{"text": "Yeah after about a month you'd probably have to keep a close eye on any potential vitamin/mineral deficiencies.  Luckily they tend to have pretty obvious symptoms and are easily cured lol", "label": 1}
{"text": "You say perfectly fine. But lets be honestly if someone was doing this they'd need regular medical assessment to make sure they weren't malnutritioned", "label": 1}
{"text": "exactly! fat does serve as a crucial energy reserve, helping our ancestors survive during tough times when food was scarce. In that sense, it’s an essential part of our biology.", "label": 1}
{"text": "So it's rocket fuel paradox?", "label": 1}
{"text": "Some people can digest a multivitamin without vomiting, some need the cabbage as a buffer.", "label": 1}
{"text": "Uh oh. I hear health and obesity being mentioned. Are we still downvoting into oblivion because it hurts our feelings knowing our cheese puffs and totinos pizza rolls are poor (but amazing) life choices, or are we accepting it and upvoting because we all know it's unhealthy?  \n  \nLemme go cook my pizza rolls real quick while yall figure it out.", "label": 1}
{"text": ">With that logic you also shouldn't exercise because you burn more calories.\n\nIf all you are considering is how many resources you are consuming, then I'd tend to agree.", "label": 1}
{"text": "Thank you, I couldn’t remember the name but very much wanted to make this comment", "label": 1}
{"text": "Yes, it is indeed possible to be stung by a bee whose honey you've eaten! Bees collect nectar from flowers and turn it into honey, but they can still sting if they feel threatened. Eating honey doesn't affect their ability to sting you. So, if you're around bees and they feel provoked, they might sting regardless of whether you've enjoyed their honey or not. Always be cautious around them!", "label": 1}
{"text": "You can go up to three weeks without food regardless of being obese or not dumbass", "label": 1}
{"text": "Keep licking that boot.", "label": 1}
{"text": "The Sheepster was an average Redditor but no one understands…", "label": 1}
{"text": "Ah, thanks for making it clear how intellectually unqualified you are for these types of discussions. Gonna save us lots of time.", "label": 1}
{"text": "Should a cop stop every assault or should they look the other way and permit assaults against people who they think deserved it? You're basically arguing that cops should be permitted to ignore law enforcement (THEIR JOB) when they feel it's unnecessary. How does that make any sense?", "label": 1}
{"text": "You don’t have to keep demonstrating what I already pointed out about you…and yet, here you are.", "label": 1}
{"text": "Objectively incorrect. Your assumptions here predicate on being a \"good person\" and \"good cop\" as individual aspects. Police are a group, and morality is inherently tied to the culture around it. In essence, by ignoring the predominant defining factors of morality as well as the literal requirements for being a cop you are saying nothing of any merit.\n\nLike all aspects of morality, not only is it subjective, it is also situational. For instance, in all likelihood you can be a good person and bad cop in a small town by ignoring petty theft committed by someone stealing food to feed themself.\n\nHowever, you cannot be a good person/bad cop or a bad person/good cop in NYC. Being a good person(refusing to murder unarmed civilians) gets you fired, meaning you're not a cop at all. Being a good cop(upholding law) gets you killed by other cops, removing your personhood. The structure of NYPD requires you to be a bad person/bad cop or else the system will remove you.", "label": 1}
{"text": "Police are not MORALITY ENFORCEMENT. Police are LAW ENFORCEMENT. Morality is not \"inherently tied to the culture\" around police. I don't know what kind of propaganda you've been consuming to come to that conclusion. Hitler had police. Pol Pot had police. Police are agents of the government, not agents of morality or ethics. Whether a cop is good or bad as a cop is only determined by how well they serve their job description. Nothing more and nothing less. Seeing it any other way is problematic because the government is neither \"good\" or \"bad\" from a moral standpoint and that's what police are-government.", "label": 1}
{"text": "If the cop applies all laws evenly to everybody, they're not unjust. Just delete this dumb post", "label": 1}
{"text": "That’s crazy how annoyed you’re getting over a meaningless internet argument. Does this look like a debate class to you? Do you think that anyone important is reading this to have their views swayed? This is Reddit. The whole point is just to type shit and consume time because we’re bored. If you want a serious discussion r/showerthoughts isn’t the place, my friend. Suggesting that this isn’t “worthwhile” is hilarious. Of course it’s not worthwhile. Look where you are.", "label": 1}
{"text": "C", "label": 1}
{"text": "must be a real uphill battle... literally!", "label": 1}
{"text": "Its simple. Black people statistically commit more violent crimes and weed can cause psychosis therefore there is a higher risk of black people killing someone and you have to deal with it based on how it is. It is a statistical fact. Its not a game when one group of people are more likely to commit a violent crime due to their illegal drug use. Ofcourse you deal with that group of people instead of the ones who are very unlikely to commit violent crimes.", "label": 1}
{"text": "What an insane, unsupported white supremacist post.   \nAm challenging you to provide actual statistics from a scientifically verifiable source, and not the David Duke institute for bullshit racial cover my ass posts.", "label": 1}
{"text": "Well. You’d probably have a bright future in American law enforcement.", "label": 1}
{"text": "I understand what you’re saying, but one thing that’s important to keep in mind is why certain groups are more likely to have crimes on record. Kids of every color are fucking stupid, but oftentimes kids that aren’t white will have something non-violent perceived as violent or escalate to that point because they aren’t afforded the same leeway as white kids. \n\nAnd what comes with that is a vicious cycle. White people thought people of other ethnicities and cultures, so they got accused of crimes they didn’t commit, like that 14 year old that was put in the electric chair, even though years later it came out he was innocent. Or even actually committing crimes due to necessity. If you need to steal bread to feed your family, you’re going to do that. When people’s parents are imprisoned wrongfully, you learn to be wary of the people who imprisoned them. Then the people who imprisoned your parents become suspicious of you because you’re suspicious of them. And this keeps going on for generations.\n\nSo I think it’s something that has to start with those who hold more power extending an olive branch more often, and not jumping to conclusions. Even if something seems obvious, it’s important to take into account why that’s the case.", "label": 1}
{"text": "*Conversation about why cops convict certain groups disproportionately*\n\n\"NoOoOoOo yOu DoNt uNdErStAnD, THIS gRoUp CoMmiTs mOrE cRiMe lOoK aT tHe EvIdEnCE!!\"\n\nThe evidence is from...\nCops\n\nYou're an idiot.", "label": 1}
{"text": "Flexibility in law enforcement can indeed be a double-edged sword lol", "label": 1}
{"text": "1312", "label": 1}
{"text": "Woah. Thought someone accidentally dropped an /s. Turns out they're just an asshole.", "label": 1}
{"text": "I was genuinely surprised that this needed an explanation. I'm not sure why anymore.", "label": 1}
{"text": "Ah i am an asshole for providing a primary source and telling people the truth. Nowadays its asshole to say an ugly truth", "label": 1}
{"text": "Notice how that FBI \"database\" doesn't include household income? Hmm. I wonder why that is. Is it possible that areas with worse infrastructure, worse education, lower-paying jobs, gerrymandering, etc...commit more crimes?!?! Say it ain't so that North Memphis has more crime than the Hamptons. Surely the a amount of pigment in skin is the issue. (/////SSSSSS if not obvious)", "label": 1}
{"text": "You should have just made it about gender \n\nTeenage boys \n\nVs\n\nTeenage girls\n\nWhich group is more violent\n\nThere was no need to add race", "label": 1}
{"text": "How do you expect him to push a white supremacists agenda without lying about race?", "label": 1}
{"text": "It’s just so dumb because it still would have made the same impact on his point with the comment he was responding too but it would be a win for him not the L it was\n\nHowever there is a good chance the poster never cared about anything other than promoting racial animosity given the style of that post \n\nJust another day on reddit", "label": 1}
{"text": "You provided a website. There might be primary sources somewhere on said website, but unless you direct the people reading your post to a specific source or statistic that is relevant to your argument you didn't source your claim in any way.\n\nSource: https://en.wikipedia.org", "label": 1}
{"text": "I made it what they said. They made it about gender and race. They specifically compared white girls and black men. So did i. I will add race also because black people do commit violent crimes more and my source was fbi so  only reason you are saying that is because you dont like the ugly truth", "label": 1}
{"text": "No source, making up things.", "label": 1}
{"text": "People can and will argue the validity of racial demographics in America in regard to crime do to wealth inequality combined with what some people call “systemic racism” \n\nYou may argue that systemic racism is not real but if we go back and forth enough you will no doubt agree that there is racial bias to some degree against black people in some cases. \n\nAll of this clouds what you say and makes you sound like someone just promoting racial tensions because as I said you could have just owned the commenter by focusing on gender and mentioning factors like testosterone and then piggyback statistics. There would have been 0 doubt and you would have gotten the OWN THE LIBS moment you wanted", "label": 1}
{"text": "Youre strawmanning. I never said systemic racism was real. And now youre saying that im the one promoting racial tensions when the original comment is literally spreading misinformation about races and genders and i replied it with fbi crime statistics. You just dont like the ugly truth. You dont like the statistics. Youre making excuses for violet crime. There is no excuse for rape. There is no excuse for robbery. I live poor too and i dont rob people at gun point.", "label": 1}
{"text": "If bugs had their own society,,,, I bet they’d have a ‘Funeral Friday’ where everyone gathers to mourn and snack on some leftover crumbs. It’s like their version of happy hour, but with more tears and fewer drinks .. :)", "label": 1}
{"text": "got it, ready for the shower thoughts! just hit me with the post.", "label": 1}
{"text": "quite saddening to think about...", "label": 1}
{"text": "Okay fine I'll stop stepping on ants now.", "label": 1}
{"text": "Some of the nation or tribe somewhere in the world may have naming for the weeks or may don't have any naming for days or weeks at all. Passed through generations, we use the current naming of days to track time without thinking too much. No one would stop us if we named today as Friday or with any other custom names. It could be applied for the weeks too. It's just a imagination we agreed upon and live by because it's helpful. In reality, every day is a new day.", "label": 1}
{"text": "because it's a hidden jealousy", "label": 1}
{"text": "B", "label": 1}
{"text": "How come this post has so many likes if it's already debunked.", "label": 1}
{"text": "Agreed, especially now since seeing death is something out of the norm nowadays.", "label": 1}
{"text": "Totally agree! Naming each week would just complicate things. Months give us a nice, consistent way to track time. It's interesting to think about, but I think we’re better off sticking with what we have!", "label": 1}
{"text": "A", "label": 1}
{"text": "C", "label": 1}
{"text": "It’s wild to consider how their curiosity might be similar to our current obsession with true crime content. Humans have always had a certain morbid curiosity", "label": 1}
{"text": "it would definitely be filled with constant comings and goings, reflecting the cycle of life in a way we rarely think about.", "label": 1}
{"text": "imagine the tiny bug funeral homes, with little eulogies and everything. “he was a great fly, always buzzing around!”", "label": 1}
{"text": "imagine if we had week names like “second brunch week” or “almost payday week.” would make planning way more fun!", "label": 1}
{"text": "Everything seems aces.", "label": 1}
{"text": "B", "label": 1}
{"text": "A", "label": 1}
{"text": "Instead, Superman rotates the earth forward or back an hour as necessary. Programmers hate him.", "label": 1}
{"text": "Sounds like something eva ai talker would conclude while hallucinating...", "label": 1}
{"text": "\"B\"", "label": 1}
{"text": "What you don't know, is that you're talking out loud.", "label": 1}
{"text": "imagine if we named weeks like flavors of ice cream. \"welcome to chocolate chip week, hope you enjoy the sprinkles!\"", "label": 1}
{"text": "C", "label": 1}
{"text": "on the contrary, and to no one’s surprise: immaturity is not knowing when to be mature.", "label": 1}
{"text": "Being too serious all the time can be draining a little immaturity keeps things fun", "label": 1}
{"text": "It's all about finding that perfect balance between fun and responsibility.", "label": 1}
{"text": "B", "label": 1}
{"text": "B", "label": 1}
{"text": "Couldn’t agree more! It’s like having a secret key to life’s little joys... sometimes you just gotta know when to let loose and embrace the silliness. Keeps the soul young!", "label": 1}
{"text": "Dogs are multilingual geniuses; we're just barking amateurs", "label": 1}
{"text": "Who knew grass maintenance could come with such a breathtaking backdrop?", "label": 1}
{"text": "Nature's trial and error is amazing, cuz evolution creates complex adaptations that seem intelligently designed but are actually the result of natural selection over time.", "label": 1}
{"text": "Maturity is also knowing when it's time to throw caution to the wind and have a little fun.", "label": 1}
{"text": "They always tend to date women that have \"blood type\" mentioned as a preference on their Tinder bio, which would explain why.", "label": 1}
{"text": "I suppose my chances of creating a best-selling novel are lower than those of even a chimpanzee with a typewriter.", "label": 1}
{"text": "Nevertheless, there are still some people who think the earth is flat. Evolution has its limits.", "label": 1}
{"text": "Being mature also means understanding that eating a whole bag of chips for supper is not a sustainable way of life, but occasionally you have to do it.", "label": 1}
{"text": "Perhaps it was the day we all unintentionally triggered the fire alarm while attempting to prepare dinner. The greatest Big Bang tribute.", "label": 1}
{"text": "Well, they wouldn't have to be concerned about their bedding becoming stained with blood. Discuss a win-win scenario.", "label": 1}
{"text": "Even when I urge my dog to quit eating my shoes, he still ignores me. Perhaps he simply doesn't know what \"no\" means?", "label": 1}
{"text": "That's why when someone pointed out that my million-dollar idea of a pizza delivery drone that doubles as a personal masseuse and DJ was merely a mashup of a massage chair, boom box, and pizza delivery van, it was promptly put down. I guess it's time to start over.", "label": 1}
{"text": "\"Can you imagine actually witnessing an execution in person? How barbaric!\" is a question that may arise in a few hundred years when people are listening to podcasts about serial killers.", "label": 1}
{"text": "What about \"Funday\" for the beginning of the weekend and \"Sundaysadness\" for the blues at the end of the week? Just an idea.", "label": 1}
{"text": "Can you picture the drama and gossip among beetles at the bug funerals? \"Did you see how the spider was eyeing up the ant's wife at the last funeral? Scandalous!\"", "label": 1}
{"text": "If so, my dog ought to have penned a best-selling book by now. He just chews on socks instead.", "label": 1}
{"text": "I've heard that they have a group of llamas that mow their lawn. What a view-oriented profession!", "label": 1}
{"text": "Perhaps Timmy is a genius in disguise, and we are all simply too simple to comprehend him. Or perhaps he simply enjoys losing himself in Chuck E. Cheese's ball pit. Who knows?", "label": 1}
{"text": "That must be the bee's way of saying, \"You're not sweet enough for me.\"", "label": 1}
{"text": "\"Thank you for your amazing portrayal of Hitler, you were terrifying!\" \"Thanks, but I'm actually a really nice person in real life. Let's just stick to complimenting my acting skills, okay?\"", "label": 1}
{"text": "Perhaps they ought to have spent their money on a better financial advisor rather than a line of high-end handbags. Just an idea.", "label": 1}
{"text": "Achieving that lifestyle is the main goal. Our furry overlords are the only reason humans are here.", "label": 1}
{"text": "I have more free time to binge-watch Netflix because I work for a living, but I also have less money to pay for my subscription. The irony, oh.", "label": 1}
{"text": "But for some reason, I always end up doing it incorrectly.", "label": 1}
{"text": "I suppose that makes paradise, hell, or respawn point my only options for the afterlife.", "label": 1}
{"text": "Oh, the best excuse to use the stairs rather than the elevator.", "label": 1}
{"text": "It's similar to the proverb \"a moment on the lips, a lifetime on the hips\"—with \"credit score\" in lieu of \"hips.\"", "label": 1}
{"text": "\"Hey kids, want to hear about the boring details of what happened in the past? Come to my history-based profession and let me tell you all about it!\" \\*crickets \\*chirping", "label": 1}
{"text": "Are you implying that I may have a famous twin out there? Now is a good time for me to practice my autograph.", "label": 1}
{"text": "You know, it's all about balance. Even though we're not very good with heat, we can still enjoy dessert after a spicy lunch.", "label": 1}
{"text": "It's possible that my \"Monday blues\" are simply untreated depression, I suspect. At least I can still publicly moan about Mondays without fear of repercussions, though.", "label": 1}
{"text": "With the exception of the new boyfriend of my ex, who thinks the Earth is flat. It's hard to argue with that kind of commitment.", "label": 1}
{"text": "Imagine experiencing a culture shock if you were a member of an uncontacted tribe and all of a sudden had access to wifi.", "label": 1}
{"text": "It seems as though society has an unspoken rule that we must endure the repercussions of an open fly until we figure it out for ourselves. Would you kindly provide us with a \"fly check\" that is comparable to a \"shoelace check\"?", "label": 1}
{"text": "I picture the director shouting, \"Cut! Wait, where did the CGI team go? Oh, right, they turned into bats.\"", "label": 1}
{"text": "Maggie hasn't been sorted yet because she is still a baby, but we all know that she will end up in Gryffindor because she always comes to the rescue with her pacifier wand.", "label": 1}
{"text": "In a few years, they will also be overdone and embarrassing, much like clip art. So, people, make the most of them while they last.", "label": 1}
{"text": "It's similar to rock-paper-scissors, but less strategy and more injuries.", "label": 1}
{"text": "And they say that discovering new things is what life is all about. But really, why must our arms be so short?", "label": 1}
{"text": "\"Right, because nothing says \"good as new\" like a duct-taped phone or a car held together with bungee cords.\"", "label": 1}
{"text": "And here I believed that all those dings on my car were caused by my awful parallel parking technique. Thanks for the fresh justification!", "label": 1}
{"text": "Despite this, they are always taking into account the opinions of everyone but themselves.", "label": 1}
{"text": "After repeatedly shaking the remote, controller, or mouse to attempt to get it to function again, we would all likely have considerably stronger arms. It's the hokey pokey done in the present era.", "label": 1}
{"text": "I feel like I have a lot more empathy because I was at my best in middle school. In any case, who needs a high school peek?", "label": 1}
{"text": "Thanks to technology, we've gone from \"pics or it didn't happen\" to \"pics can't be trusted anymore.\"", "label": 1}
{"text": "The toilet paper companies are the only ones that profit from this vicious cycle. All of us are but pieces in their scheme.", "label": 1}
{"text": "These ducks have seen more of your family than the majority of your relatives, so talk about generational differences.", "label": 1}
{"text": "Will the following series be available for another three generations?", "label": 1}
{"text": "And when traveling in the city, he believed his GPS was unreliable—imagine attempting to find your way back from space!", "label": 1}
{"text": "And let's not even talk about spider webs. It resembles the set design of a horror film.", "label": 1}
{"text": "Can we then refer to it as the \"reputable\" hemisphere? Looking for a Southern Hemisphere companion...", "label": 1}
{"text": "That’s an interesting take! I mean, they are all about the blood, right? But can you imagine the conversation? 'Sorry, I know it’s a bit messy, but I can’t help myself!' It definitely adds a whole new layer to the vampire romance trope. I wonder how that would play out in a story, maybe some very intense mood swings involved", "label": 1}
{"text": "The longer the legs, the more terrifying the spider", "label": 1}
{"text": "Looks like I'll be avoiding any games with permadeath from now on", "label": 1}
{"text": "Looks like I'll be doing cardio in the stairwell from now on instead of using the germ-infested elevator", "label": 1}
{"text": "Crazy how we're more accepting of someone downing a bottle of wine every night than someone taking medication for their mental health.", "label": 1}
{"text": "imagine celebrating the big bang with a party that lasts 13.8 billion years. talk about a long wait for the cake!", "label": 1}
{"text": "A", "label": 1}
{"text": "Social interactions can feel straightforward to most people, but for those who are autistic, even everyday social cues and emotions are often complex and overwhelming", "label": 1}
{"text": "Like you?", "label": 1}
{"text": "Not you though, you're different.", "label": 1}
{"text": "For someone who claims 99% of people aren’t complex, you sure seem to be aiming for 100% of the drama", "label": 1}
{"text": "Okay Fred, is there any way that you can stand up?", "label": 1}
{"text": "Okay, Fred. Is there any way that you can stand up?", "label": 1}
{"text": "Floyd died eating a fuck ton of fentanyl so he wouldn't get caught with it, while being investigated for using a counterfeit $20.", "label": 1}
{"text": "Because it’s a dog and not a wolf? Dogs that we have now will not survive in the wild because of how they’ve been bred since we domesticated them. Hell some dogs barely survive with humans constantly taking care of them because of how inbred they are", "label": 1}
{"text": "Gonna get fucking shot for barking at the wrong guy you little shit.", "label": 1}
{"text": "So, roughly the same rationale. I get that dogs owned by humans are, in the best cases comfortable.\n\n\n But not free. Also not free to leave. Weren't free when they were purchased or given, like human slaves.\n\n\nThank you for proving my point succinctly and honestly.", "label": 1}
{"text": "Wait, you are telling me getting pampered for your entire life, fed what you want, medical care, all that stuff, being genetically predisposed to enjoy companionship with other humans and other animals is better than scrounging for survival in the wilderness?", "label": 1}
{"text": "So now it is a human imperative to control and care for the dogs? \n\n\nHow would you feel if you were told you were bred to be incompetent at your own survival?", "label": 1}
{"text": "The difference of course is that a child came from the owner. Let's focus, please.\n\n\nOf course they don't want to be free now, they're conditioned! They know where food, affection, shelter comes from in a reliable manner! I'd hate it too if that were gone! I'll tell you, though, if those dogs found reliable food and shelter elsewhere - without leashes and gates and doors - they'd forget about you pretty quickly. \n\n\nThey're animals. That's what animlas do.", "label": 1}
{"text": "Really? \"U mad bro\" is not a strong argument lol", "label": 1}
{"text": "That's not the argument I made, I'm not in argument. I don't think you actually believe what you say, I think you're just posting for the sake of attention or whatever other reason ragebaiters post their stuff.", "label": 1}
{"text": "I completely understand; the doorbell sound in commercials can really trigger dogs and make them anxious, so avoiding those products makes sense", "label": 1}
{"text": "This guy is such a clown. Lmfao", "label": 1}
{"text": "Cuz they are a dog owner which means they feed, water, love, and keep it in their home. So by your logic, is having kids slavery. Because pretty much the same things are administered to kids just in differents types of food. I don't even think you know the difference between taking care of something and holding a slave", "label": 1}
{"text": "A", "label": 1}
{"text": "B", "label": 1}
{"text": "B", "label": 1}
{"text": "It's like a double-edged sword of employment. On one hand, less work, on the other, less money", "label": 1}
{"text": "It's like life is just testing us to see how frustrated we can get before we finally get it right.", "label": 1}
{"text": "True", "label": 1}
{"text": "I know, it's disappointing. But on the bright side, more candy for us adults", "label": 1}
{"text": "I think the older we get the harder it's to retire as your responsibilities increase dramatics and you need to get more money as the time goes, thanks to inflation", "label": 1}
{"text": "Bad bot", "label": 1}
{"text": "It's wild how much they spend on ads instead of lowering rates. It's like the priorities are all about keeping themselves in the spotlight rather than actually serving customers. Imagine if even half of that ad budget went toward making insurance actually affordable or accessible… now THAT would be worth a commercial!", "label": 1}
{"text": "Maybe try not to defend marketing in 2024. \n\nMust be so painful being smarter than everyone. Your days must be so full of yourself.", "label": 1}
{"text": "Who made the rule that you have to wait? If I get an advent calendar, I’m definitely going to open a few doors at once! It’s all about the joy of the surprise, so why limit it? Plus, sometimes you just can’t resist that chocolate on day one!", "label": 1}
{"text": "The universal struggle between wanting to get paid more but also wanting to have more free time.", "label": 1}
{"text": "Somehow, every time I still manage to plug it in wrong.", "label": 1}
{"text": "I blame it on the rise of technology and the decline of door-to-door interaction.", "label": 1}
{"text": "My skin is crawling just thinking about it.", "label": 1}
{"text": "That's one way to make sure you don't rage quit while playing a difficult game. Death is a great motivator.", "label": 1}
{"text": "So basically, if you want a clean railing, just take the stairs instead", "label": 1}
{"text": "It takes 10 compliments to undo one insult, but one insult can undo 10 compliments.", "label": 1}
{"text": "Just imagine a future where the only source of information about our time is a Buzzfeed listicle", "label": 1}
{"text": "That's why we measure our success by how many bags of clothes we've donated to Goodwill", "label": 1}
{"text": "We may not handle spicy food well, but we can down a whole tub of ice cream like nobody's business.", "label": 1}
{"text": "We never really give ourselves credit for how much we're dealing with on a daily basis. Just trying to adult in this world can be mentally exhausting.", "label": 1}
{"text": "Is why we always carry a map and a compass, even if we have superpowers", "label": 1}
{"text": "So does that mean we'll eventually have a reboot called Star Trek: The Next Next Generation", "label": 1}
{"text": "The elusive concept of having enough money to retire.", "label": 1}
{"text": "yeah, they could probs save more money by cutting down on the ads and actually, you know, helping people instead of paying celebs to pretend they care.", "label": 1}
{"text": "B", "label": 1}
{"text": "Real life details affect real life.", "label": 1}
{"text": "Real life details effect real life.", "label": 1}
{"text": "This is the dumbest fucking anti-bot shit I've ever seen.", "label": 1}
{"text": "Plus, as people get older, their lifestyle and spending habits often change, potentially lowering their overall costs hehe", "label": 1}
{"text": "We may not be able to handle the heat, but we sure can handle the sugar rush", "label": 1}
{"text": "Practice self-care and seek help if you need it. It's ok to not be ok, and it's definitely not something to be ashamed of.", "label": 1}
{"text": "Can you imagine the panic of realizing you forgot your phone at home and there's no GPS in space to guide you back", "label": 1}
{"text": "Evolution is a slow process, I guess.", "label": 1}
{"text": "yet, no one can seem to agree on what that something is. Is it love or Success", "label": 1}
{"text": "which might reduce the total amount of money you need to cover your living expenses in retirement....", "label": 1}
{"text": "You're absolutely right. Effective regulation is crucial to ensure that insurance companies prioritize their customers' needs and maintain fair practices.", "label": 1}
{"text": "Can you imagine their reaction when they suddenly have access to TikTok and all the dancing videos", "label": 1}
{"text": "That's a fascinating analysis of Vulcan and Romulan history. The decision by Vulcans to embrace logic and suppress emotions certainly seems to be a conscious societal strategy to prevent chaos and ensure stability.", "label": 1}
{"text": "It sounds like you've got a knack for delivering those subtle gems!", "label": 1}
{"text": "It's a small world after all... or at least a small park filled with ducks.", "label": 1}
{"text": "It's a vicious cycle of trying to save money but ending up using more TP in the long run", "label": 1}
{"text": "It's a good thing we didn't have social media back then, or every embarrassing moment would have been captured and shared for eternity.", "label": 1}
{"text": "It's like they're more concerned with keeping your feet safe than your dignity.", "label": 1}
{"text": "No wonder some people struggle to find their footing afterwards.", "label": 1}
{"text": "They're too busy trying to please others to even think about counting themselves.", "label": 1}
{"text": "Here I thought the main cause of car accidents was texting and driving", "label": 1}
{"text": "The transformation from villain to hero, brought to you by societal pressure and the need for redemption.", "label": 1}
{"text": "They could save a lot of money on fake blood and CGI fangs.", "label": 1}
{"text": "Now I can't stop imagining a Harry Potter and Simpsons crossover episode.", "label": 1}
{"text": "That's why I always set multiple alarms, just to make sure I'm not in a deep sleep coma.", "label": 1}
{"text": "In 20 years, kids will look back on memes like we looked back on our parents", "label": 1}
{"text": "And a potential concussion for both parties involved. Let's stick to rock-paper-scissors", "label": 1}
{"text": "And probably a fair number of people who have strained their arm trying to reach that one spot", "label": 1}
{"text": "Yeah, just like how we say I'm fine when someone asks how we're doing.  \n  \nSarcasm is the millennial language.", "label": 1}
{"text": "Kinda makes sense, imagine it's your house but care takers lives there freely like it's their own while you're away...", "label": 1}
{"text": "B", "label": 1}
{"text": "so basically, vulcans are the ultimate life hack for surviving family gatherings without needing a nap afterward", "label": 1}
{"text": "yeah, it's wild how much they spend on ads while charging us an arm and a leg. could be using that cash to actually help us out instead of making random celebs richer.", "label": 1}
{"text": "True! As you age, you might need less for things like travel or raising kids, so your retirement goals can be more flexible.", "label": 1}
{"text": "quite universal.", "label": 1}
{"text": "This reminds me of that one time on Conan.\n\nhttps://youtu.be/PJVNzwTnfbk&t=70", "label": 1}
{"text": "확실한 먹튀검증 토토커뮤니티 먹튀플러스 , 국내 메이저 온라인 카지노 와 토토사이트에서 바로 이용 가능한 각종 꽁머니 포인트 지급 www.먹튀플러스.com\n#먹튀사이트 #토토사이트 #토토커뮤니티 #토토꽁머니 #꽁머니 #토지노 #파워볼 #안전놀이터  #스포츠토토 #스포츠중계", "label": 1}
{"text": "the longer the legs, the higher my squeal pitch. It's a scientific fact.", "label": 1}
{"text": "That's why I always make sure to save before crossing the street", "label": 1}
{"text": "A valid reason to take the stairs", "label": 1}
{"text": "It's like the universe is constantly testing us... and it really sucks when we fail the test.", "label": 1}
{"text": "So basically, being a time traveler is going to be a valuable job in the future.", "label": 1}
{"text": "Does this mean I can finally tell my parents I'm a star without them rolling their eyes", "label": 1}
{"text": "Welcome to the world of adulting, where losing inches is more exciting than losing pounds.", "label": 1}
{"text": "And finding a good deal on a kitchen appliance gives us the same level of satisfaction as a night out partying used to", "label": 1}
{"text": "So basically, we're all a little crazy but some of us just embrace it more openly.", "label": 1}
{"text": "And here we thought getting lost in the grocery store was bad. Imagine being lost in space with no GPS.", "label": 1}
{"text": "It's just a straight line with one person bouncing back and forth between the other two.", "label": 1}
{"text": "Math has never been my strong suit", "label": 1}
{"text": "Which explains why my friends and I are all perfectly abnormal and fit together like the pieces of a puzzle.", "label": 1}
{"text": "The Smiths definitely don’t celebrate everyday, Bob.", "label": 1}
{"text": "The Smith’s definitely don’t celebrate everyday Bob.", "label": 1}
{"text": "The Smith’s definitely don’t celebrate everyday Bob.", "label": 1}
{"text": "so basically, vulcans are like the ultimate introverts who took \"leave me alone\" and turned it into a whole civilization. respect.", "label": 1}
{"text": "Aw hell yeah so technically I'm less broke every day", "label": 1}
{"text": "Crazy how quickly it became the standard!", "label": 1}
{"text": "C", "label": 1}
{"text": "Okay Fred is there any way that you can stand up?", "label": 1}
{"text": "ok", "label": 1}
{"text": "That's because dogs are much better listeners than humans.", "label": 1}
{"text": "C", "label": 1}
{"text": "That's a very astute observation!", "label": 1}
{"text": "On the flip side, students using AI to complete these assignments can highlight both the potential and the ethical challenges of AI in learning.", "label": 1}
{"text": "In reality, hyenas have evolved to have exceptionally strong teeth and jaws precisely to avoid such problems. Their teeth are designed to handle the immense pressure they generate when feeding on bones.", "label": 1}
{"text": "n", "label": 1}
{"text": "12", "label": 1}
{"text": "mmm I robert don’t want to die??", "label": 1}
{"text": "A", "label": 1}
{"text": "C", "label": 1}
{"text": "B", "label": 1}
{"text": "Yeah right It can be", "label": 1}
{"text": "A", "label": 1}
{"text": "Maybe you should get your pussy checked...", "label": 1}
{"text": "That’s so true! Speed bumps are really just there to make you slow down and be cautious; the fear of damaging your car or getting a bump in the ride is often what keeps us from speeding over them.", "label": 1}
{"text": "A lot of people are confused by commas.", "label": 1}
{"text": "It's more a thought experiment. A decade ago the average redditor would have been smart enough to entertain such thoughts. Alas, no more.\n\nAlso, speed bumps do still kill more people by interfering with emergency vehicles than they save by slowing down illicit speeders. But if you can't even have the first conversation I doubt you're ready for this one.", "label": 1}
{"text": "B", "label": 1}
{"text": "B", "label": 1}
{"text": "I’d rather enjoy those 8 hrs and not risk being grumpy for 6.5 extra yrs", "label": 1}
{"text": "Imagine all the extra time, though... we could catch up on hobbies, travel more, or finally tackle that to-do list. But also... naps. Naps are life....", "label": 1}
{"text": "Totally. Sci-fi often reflects current societal issues through a futuristic lens rather than just predicting advancements. It’s less about tech and more about exploring what makes us human.", "label": 1}
{"text": "I have a speed ramp on my road that's so bad I have to go about 3mph or I'm sure I'll break something, I've yet to find one I can go over at the speed limit, they don't stop people who don't care about the car from speeding especially in bigger cars, I find they're the ones tailgating me when I'm doing 12mph over a speed bump", "label": 1}
