{"text": "It's not about branding, it's about EDUCATION. Most Americans can't even identify socialist systems that exist in America right now. For example, our highway systems, Medicare/Medicaid and Social Security, military benefits, etc. These are socialist systems that exist that we all benefit from today. \n\nMost Americans have never read John Stuart Mill, Marx, Malcolm X, etc and have no real understanding of democracy, communism, etc.", "label": 1}
{"text": "It’s mind numbing the amount of coverage this election cycle from the right has branded Kamala a “communist/socialist/marxist” when she’s barely a liberal never mind a leftist lol.", "label": 1}
{"text": "Biden and Harris are centrist. Not FASCISTS like Trump.", "label": 1}
{"text": "they are fascists. they're technocratic fascists, unlike trump who is an opportunist fascist.", "label": 1}
{"text": "People hate Obamacare, but like the Affordable Care Act. People don’t care about your idealogical commitment to socialism, but what you can offer them at the end of the day.", "label": 1}
{"text": "Ite bro idek where I equated Biden/harris to Trump.\n\nBut also as the first reply to u states there’s a pretty solid argument to undermine ur statement here but I’m not up for e-drama on Reddit tn.", "label": 1}
{"text": "Trump is just more open about his fascism, the democrats aren’t as open about it.", "label": 1}
{"text": "Just like liberals with their bigotry.", "label": 1}
{"text": "Co-ops, credit unions, worker owned businesses.  Americans are surrounded by socialism and enjoy it and don't even realize it.", "label": 1}
{"text": "Please educate yourself on American history and foreign policy.  I would say anyone who materially supports fascists is a fascist.  Democrats and Republicans both happily support fascists, the Democrats are just less willing to be honest about that or their willingness to use it at home as well.", "label": 1}
{"text": "Ragan", "label": 1}
{"text": "Because capitalism is great for neurotypical people that are part of the in group. Cis WASPs.", "label": 1}
{"text": "Liberal idpol and socialist intersectionality are different things. We're not for \"More! LGBT! Drone Pilots!\". Also, you just kind of sound like a bigot. \"All that bs\" talking about marginalized groups.", "label": 1}
{"text": "What makes you think I’m a bigot?", "label": 1}
{"text": "Your flippant manner of referring to POC and ... what could be any number of marginalized people (queer, neurodivergent, religious minority). So long as they are unfree we all are unfree.", "label": 1}
{"text": "When did I say that Trump was better? Trump is worse so no one can criticize Kamala? That's a fucked up way of thinking.", "label": 1}
{"text": "We live in a two-party system. Your choices are Trump, Harris, or third party (Trump).\n\nCriticize Harris all you want. I agree with a lot of the criticism, she is not perfect. But she is infinitely better than the lone alternative; Trump.", "label": 1}
{"text": "And yet, any time anyone criticizes Kamala (regardless of whether or not they say anything about voting) libs like yourself will go on and on and on about how Trump is so much worse and how a vote for people who aren't Trump is somehow a vote for Trump, despite the fact that the other side says exactly the reverse. The reality being that a vote for a third party doesn't help either party. The majority of third party voters would likely stay home rather than vote for parties they see as complicit in genocide. \n\nLet me be clear: you don't know how my vote is being used. Even if you think you know from reading my comment history? You don't know. And I'm not telling you. But you can rest assured that my vote will not be counted for Trump.\n\nAlso, you're not living in the same reality I am if you think the Democrats, who are currently overseeing the genocide, will change course under a leader who has said she'd change nothing about the Biden administration. (Psst, VPs running for president have broken with and criticized the sitting president they worked with in the past. She could do it if she wanted.)", "label": 1}
{"text": "We have a political process in the US that involves primaries and general elections. The time to criticize, withhold, and worry about perfectionism is the primaries. The time to hold your nose and swallow the least-worst option is the general election. \n\nWe are passed the primaries. \n\nI never said the Democrats would change direction. They won't distance themselves from Israel and everyone knows it. But, they will listen and give a half-hearted push back while the alternative option will give a full throated endorsement to genocide.", "label": 1}
{"text": ">Candidates can and should be responsive to the voters they are courting.\n\nYes. The time to criticize is the primary election where you vote for the candidate that best aligns with your values. You tell the party what direction to go through the primary. That is why the Democratic party became far more progressive in the last decade, because Bernie Sanders commanded it through voting getting in the primaries.\n\nThe general election is the time to pick the least worst option. Not the time to have perfection be the enemy of good.", "label": 1}
{"text": "So once the primaries are over, whatever the candidate says goes? That's some MAGA logic. The candidate is not infallible. Grow up.", "label": 1}
{"text": "Of course not. But after the primaries the options and choices change. The option to oppose genocide is no longer on the table. Now the options are Absolutely Genocide or Feign Push-Back On Genocide. \n\nChoose one.", "label": 1}
{"text": "Hey. False dichotomy. There are other options (unless you think the only use for your vote is voting for the winner). Truly, liberals are exhausting. A third party vote is not a vote for Trump unless you believe that those votes are gettable, and if they're gettable and the Democrats are not voting for them? And more over if those votes are necessary for the candidate to win? Then responding to their criticism is a good idea and letting them criticize is a good way to find out what they want.\n\nBut by all means, democrats should absolutely continue ignoring the demands of the people who's votes they're asking for. That seems like a great way to convince those people that the Democrats are in fact movable and willing to work with them. Let's see how it works out for them.", "label": 1}
{"text": "I agree. It's bad strategy. The same strategy Clinton used and gave us Trump in the first place. But it gave us Trump in the first place. It will give us Trump again. And after Trump there is no guarantee that we ever get another opportunity to have a vote again. \n\nI agree Harris and the Democratic party is not ideal. But the other option is literally fascist take over of the United States government. The guy who said he wants to be a dictator and would purge any and all government employees and officials who are not loyalists, who has plans for mass deportations. \n\nThe Democrats are holding a gun to our heads. And you would rather just get shot in the face than negotiate.", "label": 1}
{"text": "Comrades? COMRADES? LOLLLL 😂😂😂", "label": 1}
{"text": "Bruuuuuuuuhhh this is peak brainrot even for Reddit LMFAO", "label": 1}
{"text": "Oh those...yeah, I guess they have to be scapegoats for all things evil.", "label": 1}
{"text": ">Either you want leftist policies in government or you don't. Pick one.\n\nExactly. You vote for Democrats or you vote for Republicans. Pick one. You want leftist to have a voice and position in government, or, you don't.", "label": 1}
{"text": "Yeah, sure. But how is that a reason to not criticize Harris? She is not on the left, just nearer to it than Trump. So, because I want her to stop moving to the right, I'm going to criticize her. Maybe if a few more of her voters would do so, she'd actually hear us. Instead, you spend your time trying to silence us so that she can't.", "label": 1}
{"text": "💀💀💀", "label": 1}
{"text": "It's not my job to get her elected. I'm not employed by her campaign. It's my job to try to get her to be the candidate that is worthy of my vote, regardless of how bad the other guy is. \n\n\"Other guy bad\" isn't an excuse to not call democrats out for aiding and abetting a genocide. I get that you're scared. So am I. But the ends do not justify the means (allowing thousands of Palestinians to be slaughtered by Israel without doing or saying anything).\n\nBut it doesn't sound like we're going to convince each other. We're just going around in circles at this point. Have a good weekend.", "label": 1}
{"text": "Fuck you genocide supporter", "label": 1}
{"text": "The Republican presidential candidate and several prominent Republican politicians and figureheads regularly call Democrats socialist. A couple of random fringe Democrats, who no one takes seriously or could identify by name, call Republicans socialists. \n\nThese are not the same.", "label": 1}
{"text": "25% under commie/socialist? Your now worried about a budget surplus vs a huge deficit? X() ...you commies make me laugh. Just go and get a job and suck it up ...you have to become a functioning member of society and get off the government tit ...Austerity is hard but total economic destruction from socialist rot is worse. Your commie / socialst bosses dug a big deep hole for Argentina its gonna take time to climb out ....So A Trabajar Cabrones Flojos 🤣", "label": 1}
{"text": "You know, I was gonna give some thought out reply about how the quest for ideological purity can functionally aid fascists. \n\nBut a quick peak at your comment history shows you’re likely just some uneducated kid who trolls half the communities you’re in. Maybe if you took part in some real activism you’d have something better to do with your time.", "label": 1}
{"text": "Fascism is when people don't want child sex change surgeries & procedures ..\n\nHow exactly are trans people oppressed & what does it have to do with economics ?", "label": 1}
{"text": "Thank you for the clear answer! Could I ask you one more thing?\n\nWhat are there boundaries to people's freedoms or mechanisms to protect the rights of other people? Like, when I say that trans women shouldn't be allowed to go into the womans bathroom, because that is a safe space for cis women. How would a socialist analyze this conflict of ideas?", "label": 1}
{"text": "if Trump wins there will be boots on the ground and we'll never reach the future depicted in this video.", "label": 1}
{"text": "Math is hard", "label": 1}
{"text": "Don't think there is gonna be a Palestine memorial in Germany any time soon, and if Trump wins, their will be no memorials", "label": 1}
{"text": "If Kamala wins, it's no different. Or maybe worse. Any president is the puppet of ADL.", "label": 1}
{"text": "Did I say anything about Kamala Harris?", "label": 1}
{"text": "You don’t need to. I’m just giving you another probable result based on the situation you provided.\n\nIf Trump wins, then bla bla bla. If Kamala wins, then bla bla bla will still happen. Simple as that.", "label": 1}
{"text": "I was eating at a Lebanese dessert place in Dearborn michigan, talking with the owner how Palestinian refugees fucked up Lebanon and Jordan. The knafeh was on point.", "label": 1}
{"text": "There are more Palestinians born than killed. Worst genocide ever really 0/10.", "label": 1}
{"text": "I'm stuck on something. I couldn't create a separate post for this, but I'll post it here. I was reading [this article on World Socialist Web Site](https://www.wsws.org/en/articles/2024/10/24/pxyn-o24.html) (WSWS) when I came across this paragraph:\n\n\"*In the aftermath of the failed coup of January 6, 2021, the Biden-Harris administration sought deliberately to revive the Republican Party in order to provide a bipartisan basis for an aggressive foreign policy, directed initially against Russia—instigating the war in Ukraine—but since expanding to the Middle East (Gaza, Lebanon and soon Iran), and ultimately aimed against China.*\"\n\nI'm not sure what WSWS's stance on the Russia-Ukraine war is, but the words \"instigating the war in Ukraine\" feels out of place. Most evidence points to Russia instigating the war and not the U.S., but this article seems to ignore that. What's your take on this?", "label": 1}
{"text": "Slava Ukraine", "label": 1}
{"text": "Ukraine. They didn’t deserve to have another country come in and start killing them. I am heartbroken at the deaths in both sides though, human lives being used as cannon fodder.", "label": 1}
{"text": "Anti-Russian sentiment happened in specific regions within Ukraine. Western Ukraine was pro-EU, whereas Eastern and Southern Ukraine were pro-Eurasian Economic Alliance. When the Maidan Revolution happened in 2014 and the democratically elected , albeit pro-Russian , President was overthrown, many Ukrainian citizens living in the pro-Russian parts of Ukraine felt that the new interim government was a Western plant and they distrusted the direction that Ukraine was heading in. If you look at the polling data, the folks living in Crimea and the Donbas oblasts *overwhelmingly* voted for Victor Yanukovych, whereas folks living in Western Ukraine were pretty split on their opinion of Yanukovych. \n\nThe main reason that the West is blamed for the current state of affairs between Ukraine and Russia is that the West, particularly the United States, gave funding and arms training to the right-wing militias that eventually overthrew the Yanukovych government. They fanned the flames of the already growing dissent against pro-Russian sentiment in Ukraine. And for this reason, a majority of Ukrainians actually believe that the United States is the largest party to blame for the conflict in the Donbas, at least according to polling data from 2022.", "label": 1}
{"text": "If China incorporated Mexico in a strategic defensive alliance, how do you think America would respond? Who would you blame (most) if a war broke out? Mexico, America, or China? \n\nDescribing pro-western representation as a sphere of influence belies what a sphere of influence specifically is; strategic economic and military exclusivity weaponized for the benefit of an imperial power. Economic inclusion didn't have to be this way, but America for whatever reason decided after the USSR dissolved that it'd just continue operating as if it's the cold war and gobbled up every former soviet satellite state.", "label": 1}
{"text": "I also agree with this sentiment, even if it may go against popular opinions.", "label": 1}
{"text": "So, Ukraine.", "label": 1}
{"text": "Do you favour israel/palestine both neither?", "label": 1}
{"text": "Exactly this. We did the same thing to Cuba with just notably worse results. I don’t see how this is much different.", "label": 1}
{"text": "Conflict of a very different nature", "label": 1}
{"text": "Euromaidan was a CIA backed coup. They then proceeded to make life hell for anti-coup citizens, both Ukrainian and Russian speaking, but especially Russian speaking ones. Combined with them attempting to join NATO, and you can understand Russia’s position. They tried to make peace multiple times post Crimea annexation, and Ukraine rejected all of those attempts. Russia realized eventually that this was their only option. And if you bring up Finland in NATO as a counterpoint, they’re simply a different story.", "label": 1}
{"text": "They shouldn’t have been killing some of their own citizens and trying to join NATO which Russia would have never accepted.\nRussia tried multiple peace agreements, Ukraine chose blood, under the delusion that the West was gonna save them directly with a no-fly zone and whatnot. Euromaidan was not the will of the majority, only some regions, many others were against it. Coup. They could have stayed neutral, but now they’ll probably be fully within Russia’s sphere.", "label": 1}
{"text": "I don’t like the current Russian government very much, but they had few options. Ultimately, the West wanted this war, even if it’s not going perfectly as planned.", "label": 1}
{"text": "Tell that to Ukraine, who slaughtered some of their own people long before Russia directly intervened. This war didn’t start in 2022, it had been a civil war for a while.", "label": 1}
{"text": "Ukraine: Even though I understand the opposition to NATO, the fact remains that Russia is invading another country and I want people living in Ukraine to be able to choose for themselves.\n\nNot to mention that Putin's government is nowhere near socialist, so why on earth would I have any more support for them than I would have for Zelensky's or the US?", "label": 1}
{"text": "Yes, it's still a capitalist economy.", "label": 1}
{"text": "Ukraine,Russia is a imperialist nation", "label": 1}
{"text": "I’m firmly in the Ukrainian camp. I want them to win so badly, and to beat Putin and his authoritarian self into submission. Especially now that North Korea is mobilizing troops to help Russia, and Ukraine was asking for tomahawk missiles. I hope zelynsky blows Putin sky high, and that the innocent people on both sides can return to normalcy in a safe country with its own right to self-determination. Putin not wanting Ukraine in NATO is spoiled baby behavior", "label": 1}
{"text": "Socialism does have a very strict definition which is that it's a transitional stage between capitalism and communism where the dictatorship of the proletariat has been established, but existing economic relations haven't been abolished. This is precisely what we see happening in China.\n\nChina is in fact a democratic worker state as anybody who is minimally educated regarding China would know. Beyond that China does not actually experience boom and bust cycles of capitalism, and its economy has been growing steadily for decades on end.\n\nMaybe spend a bit of time actually educating yourself on a subject you're attempting to debate.", "label": 1}
{"text": "Ukraine. We should always stand with oppressed peoples against their oppressors, though I’m obviously biased, being Ukrainian-Canadian myself", "label": 1}
{"text": "https://redsails.org/china-has-billionaires/", "label": 1}
{"text": "In the long run this was a very successful strategy.  China's industry and infrastructure grew to be much larger than the States and up until recently the US mostly thought China was capitalist as there were external trappings and many profits to be made, so China was not a country they tried to sabotage development in for the most part, unlike the USSR.  The US has found that they cannot co-opt China through covert means and now China can regionally match anything the US can do militarily.  \n\nSo we'll see if slow changes occur  towards a \"purer\" socialism.  I think there's no rush - they have control of the country's finances (unless the governments in the west) and so long as wealth inequality is managed and even decreases, it's heading in a stable direction.  I actually think Putin is looking and learning as he wants to do more about his oligarchs gradually.  Socialist thought is not dead in Russia, it was just put in hibernation by extreme inequality.", "label": 1}
{"text": ">so long as wealth inequality is managed and even decreases, it's heading in a stable direction\n\nincome, yea; wealth, not necessarily, if it creates more business owners\n\ni'm not worried about chinese billionaires, i'm worried about the 40 million or so small to medium enterprises, whose owners are just as reactionary but much more numerous", "label": 1}
{"text": "Traditionally only billionaires really become an imbalance to the system from undue political influence.  Millionaires aren't a worry to me.  Unlike in the US, China has a huge freedom to play with bank policies, tax rates, estate taxes on death, etc.  It's the long term that matters.  In US the myth is a rising tide lifts all boats, but it seems to be real in China; the main concern is to head off any potential oligarchy.", "label": 1}
{"text": ">It's the long term that matters.\n\nbut that's what i'm worried about. sure, china doesn't have to directly expropriate SMEs, they can make most of those businesses disappear with policies and maybe even unfair competition from SOEs. but that still feeds anti-communist sentiment, and when that sentiment infects 40 million people and their immediate families it can get *really* dangerous\n\ni seriously don't care about billionaires, they're notorious and few, so they're very easy for the government to control. SMEs are an entirely different matter, in fact they're usually the ones mostly responsible for the bad side of chinese influence in other countries, precisely because they fly under the cpc's radar\n\ndon't get me wrong, i know why they exist and their role, and i understand the reforms - i actually blame the fall of the USSR mostly on the premature (though politically necessary) end of the NEP, so i obviously don't want china going the same road. my point is just that if the reduction of wealth inequality comes from each billionaire becoming a thousand millionaires, that is just worse situation", "label": 1}
{"text": "So what do you think china is heading towards im very curious..do you think ccp will eventually take the shape of ussr and everything will become workers owned eventually? , can it grow the economy without capitalist framework?.Everywhere they are saying companies are leaving china but nowhere they are saying where they are investing will it stagnate their gdp growth?", "label": 1}
{"text": "I think that's precisely what's going to happen, and in fact we can see that happening already. The role of private sector in China continues to shrink.\n\nhttps://www.piie.com/research/piie-charts/2024/chinas-private-sector-has-lost-ground-state-sector-has-gained-share-among\n\nI'm also not sure why you think that companies leaving China will have much of an impact on the economy overall. It's not like they can pack up their factories and take them. All it's going to mean is that more economy will become nationalized over time.", "label": 1}
{"text": "Please Vote Against Trump --> He's a Literal Fascist\n\nI'm just talking about swing states: Arizona, Nevada, Wisconsin, Michigan, Pennsylvania, North Carolina & Georgia \n\nTrump is a fascist. Despite his claims to the contrary his administration / team has deep ties to Project 2025, a plan with incredibly disturbing implications for the future of the u.s. Personally I also hate Kopmala Harris and the fact that she & the Biden administration are enablers of the ongoing Israeli genocide of Palestinians. But even so Trump is categorically worse on this and a myriad of other issues.\n\nIn fact Gazan refugees think that Trump is the worst possible choice:\n\nhttps://www.aljazeera.com/news/2024/7/23/trump-would-be-the-worst-palestinians-react-to-us-presidential-race\n\nAnd here's a comic that breaks down what Trump's Project 2025 is all about: \n\nhttps://stopproject2025comic.org/\n\nAnd here's an article about how closely tied Trump & his backers are to Project 2025:\n\nhttps://www.nytimes.com/interactive/2024/10/22/us/politics/project-2025-trump-heritage-foundation.html", "label": 1}
{"text": "China doesn't define itself as captialist or socialist in the classical sense. Well, that's why it is \"socialism with Chinese characteristics\". What it means is that China will follow its own path to benefit the country and its population the way it sees fit in its developmental stages. \n\nSo, to your questions, yes and no, or, yes, but not in the way that you think. It is growing the economy using both capitalist and non-capitalist methods. It is also controling the commanding heights. It will not take the shape of USSR, because that just wouldn't be China. The whole country is in a big transitional phase and it might never stop because CCP is always adjusting its strategies and ideas.", "label": 1}
{"text": "Which wouldn't mean much by itself, but they're also electrifying their economy at a rapid pace, so that renewable electric(!) energy is actually displacing fossil instead of just growing along with it as it is for the rest of us losers.", "label": 1}
{"text": ">“…if everyone started emitting as much carbon as the private jets and superyachts of the average billionaire in Oxfam’s study, [the carbon budget] would be gone in two days.”  \nJesus", "label": 1}
{"text": "We shouldn’t have to live in a world where people are forced to donate money in order to save each other’s lives from fighting governments. So many innocent Palestinians have died because Hamas and the IDF are both hell bent on destroying each other. This war is fueled by racism and hate on both sides, and average people are paying the price. I don’t see how someone, knowing what we know now, could support either country’s actions. Hamas was not justified in invading Israel and killing innocent civilians, but Israel was also not justified in doing the same thing back on a much larger scale. This whole war is messed up and no matter who wins, there won’t be much of Gaza left to own. You obviously know that already and I know me saying this won’t change anything but it’s just so dystopian.", "label": 1}
{"text": "Ok but you are agreeing with me and not with the OP who said racism only goes in one direction. You are just rationalizing the racism in the Arab and Moslem world saying that it is understandable. By the same token you can say it is understandable that many young Israelis are racist as they have grown up in a world where their Arab neighbors have been attempting to and successfully killing and their families them their whole lives. If we're being honest we should be able to agree that both sides hate each other for understandable reasons, but there is definitely racism on both sides.", "label": 1}
{"text": "Serial killers deserve the death penalty", "label": 1}
{"text": "Well, it's anti stalinsim. Anyway I think it's okay", "label": 1}
{"text": "Wasn't he a part of the Democratic socialist thing? Anyway, I think he was mainly anti-stalinist. Anyway, could ya give me some links about that? If you don't mind, of course.", "label": 1}
{"text": "George \"I hate the communist party in Spain and I was really bored dicking around in Aragon for several months\" Orwell isn't gonna fuck you. He's dead. You can read the anti-communist propaganda for children he wrote if you want", "label": 1}
{"text": "I'm not American but I'd support neither democrats nor republicans and vote third party usually but in this election I'd vote Kamala as a lesser of two evils because I genuinely believe democracy is at stake.", "label": 1}
{"text": "A single vote does not equate to \"support.\"  I think if you're in a swing state, voting for the lesser of two evils has more to do with strategy than principle.  Besides, compromise is built into life, esp these days... who among us?", "label": 1}
{"text": "It's counter revolutionary", "label": 1}
{"text": "So, bad socialist bad?", "label": 1}
{"text": "Which capitalist is the lesser of two evils shouldn't concern us as socialists.", "label": 1}
{"text": "The only true answer", "label": 1}
{"text": "I understand the sentiment. But one of these two will be elected and have an effect on our daily lives, should we not choose the one that is not openly saying they want to send the military after their enemies?", "label": 1}
{"text": "I don't know you or anyone else online to make any claims of what kind of socialist they are, but if you have a strong ideology and call yourself anti-imperialist and anti-capitalist then how do you justify voting backing any agent of empire? The idea of \"lesser of two evils\" is a fallacy. Lesser to who? Not the global south, not Gaza, or Sudan, or the Congo, or Cuba, or.......", "label": 1}
{"text": "One is openly saying it and the other is already doing it. Remember the student protests against Israel? So let's not entertain either as harm reduction.", "label": 1}
{"text": "Those universities made those decisions themselves. Not at the behest of the administration", "label": 1}
{"text": "Can you define \"support\"?   merely casting strategic votes to keep fascists out of power is not support\".  \"Support\" would be canvassing, putting out yard signs, and (god forbid) donating money to candidaates in the two big parties.", "label": 1}
{"text": "Well-stated.", "label": 1}
{"text": "I think it’s designed in a way to make proper feel like their doing change, it’s masking an illusion of choice when really there is no return or at the very least when moderate reform is mandatory to maintain order among the masse, also the dems are a handy graveyard for political movements such as the occupy Wall Street being funneled into  the controlled opposition party,\n\nIn short the GOP push the capitalist agenda where as the Dems are their to undermine pushback, like some actually think their doing something special by voting for democrats", "label": 1}
{"text": "So we should just let our situation get worse in solidarity? How much more difficult would building a socialist movement in this country become with the guy quoting Hitler and saying he wants to be a dictator for one day and having a real life purge …", "label": 1}
{"text": "I feel like the 2016 win for Trump had a negative effect on progress for socialism. Another win for Trump will just push more people to the right and blame socialists for the loss.", "label": 1}
{"text": "I think \"strategic\" voting rather than voting for what you actually want will only lead to the overton window being shifted progressively further from what you actually want because the chief driver behind policy are capital interests.", "label": 1}
{"text": "What we should do is continue to organize and step up our agitation here in the imperial core. The idea that it's so much worse under one guy than the other only allows things to continue so long as we have some small level of comfort in the U.S. At some point, the pressure getting extreme is the only thing that will push some to action. Under current Dem leadership we have multiple U.S. sided genocides across the globe, cop cities being built in numerous states, a fascist Supreme Court, income inequality at an all time high, massive houselessness, obscene health care costs, skyrocketing goods and services costs, I mean let's be real.", "label": 1}
{"text": "And you can’t put the effort in for that AND cast a ballot? What about all the immigrants and refugees building better lives here who will be directly impacted, whose families will be directed impacted by the largest deportation policy in us history?", "label": 1}
{"text": "I ask why you're under the impression that immigration policy was good under any Dem administration. Obama deported around 1 million more immigrants than Bush did. Liberation struggle is protracted, you can't expect things to magically change today. Our fight is for future generations.", "label": 1}
{"text": "Not necessarily. We can quietly vote for the lesser evil candidate while publicly denouncing their capitalist policies, pushing for socialism, and involving ourselves in socialist organization.", "label": 1}
{"text": "Nah. You have a chance to vote out a child molester and devoted fascist. If you consider yourself a moralist and haven't considered how that at least is a genuinely good thing to do you probably care more about the idea of being a socialist than genuine action or change. Defeat the fascist and continue agitating. Voting is one tool of many. It's not that freaking hard.", "label": 1}
{"text": "What is counter-revolutionary is allowing a far-right reactionary fascist to take power and send the socialist cause back by decades instead of making the unsavoury sacrifice of casting a reluctant vote for the lesser evil candidate.\n\n\nAnd I say this as a Canadian who won't even have to live under a Trump regime if he's elected.", "label": 1}
{"text": "Socialists should support socialist movements.", "label": 1}
{"text": "None of them have proposed what he’s proposing…, you can fight for future generations while still making sure what freedom to organize we have left remains cause once it’s no longer there , fighting for the future will be increasingly difficult", "label": 1}
{"text": "i think theres more value in voting for the candidate you want as a rallying point to organize around even if they have no chance of winning. When people have a concrete number they can put on the fact they aren't alone in feeling like the lesser evil is dogshit they're also more likely to outwardly advocate for their actual views in the real world.", "label": 1}
{"text": "Thank you", "label": 1}
{"text": "At what point does evil become intolerable from an absolute standpoint, regardless of other potential evils on the table? That is the point at which you cut all ties to the bourgeois Democratic Party. For many, that line was crossed when the dems showed themselves to be uncritical and enthusiastic supporters of the travesty occurring in Gaza. For others, the line has yet to be crossed, as they fear that the other party is simply too malevolent to be given any chance at taking power.\n\nIn all honesty, the far left is such a tiny proportion of the US population that our opinions and votes are irrelevant from a strategic perspective. Vote how you will according to whether you believe that the line has been crossed, and know that the only thing judging you is the slow progression of history.", "label": 1}
{"text": "If this is really your take, you need to study more because your politic is severely underdeveloped.", "label": 1}
{"text": "Some states are decided by couple thousand votes, they make a difference", "label": 1}
{"text": "If voting constitutes more than .001% of your political activity then how you’re doing it isn’t the problem. \n\nUltimately, how you vote, if at all, *should* be pretty immaterial to any socialist discussion.", "label": 1}
{"text": "Here's the thing, I think it's arguably defensible as a strategic thing.\n\nIf I were in a swing state, I'd probably consider it myself. Premise: it's basically a statistical certainty that come election day we will have elected either the jerk or the cop, and looking at them it's not unreasonable to argue that electing him is some amount worse, so there's some value to doing what you can to have the less shitty one win. Is it truly worth it to you, is an answer we all have to have with ourselves.\n\nI'm voting third party for sure but that's because my state will forevermore blue so my vote, as it pertains to the election results, is irrrelevant and I can use it to add to the collective chorus of, \"Hey maybe don't?\"", "label": 1}
{"text": "Tell that to Haiti and any other number of revolutionary struggles that were born of extreme oppression and conditions we can only imagine. It's an insult to previous generations to say if we don't betray our principles, we can't fight back. If you think a president dictates the freedom we have to organize, then you're not studying enough. Organizing happens IN SPITE of who's in charge. We will be killed, repressed, and labeled as terrorists by both parties.", "label": 1}
{"text": "Again you’re essentially saying we should let our lives get worse simply in solidarity with people who struggled way more. What about all the people that die organizing in tougher conditions? Is that really what you would rather let it get to", "label": 1}
{"text": "Those are not states where leftism is a popular ideology. Leftists in the United States are concentrated in urban enclaves and the coastal states, which have been so thoroughly annexed by the Democratic Party that they only risk losing them through their sheer incompetence and inability to field popular candidates. Your vote for them will be simply yet another blue vote in a blue county. There are very few counties which actually decide elections, and it is those counties upon which candidates push their issues. It’s why Harris and Trump were bending over backwards to try and please Pennsylvania oil frackers. \n\nLet’s not delude ourselves. Core electorates for both parties are so captured by the state apparatus that their “choice” barely even matters.", "label": 1}
{"text": "Would “let trump win so conditions will get worse, forcing more people to become radicalized, therefore accelerating revolution” be a more or less developed take? Theres some really dark parts of my mind buried way deep in the back that actually thinks that way", "label": 1}
{"text": "Dude, the point is our lives are getting worse regardless of who's in the big chair. You are deluding yourself to think otherwise. Policies of both parties cause death and destabilization across  the globe. How if you're a person of conscience, do you participate in a system that facilitates that? Are the Democrats planning on stopping military aid to Israel? So what about those people who will die as a result of that? If we're serious about stopping these conditions, voting for either candidate gets us no closer to that goal. All we should be concerned with is creating systems of autonomy that give people alternatives to the state, engaging in class struggle to highlight contradictions under capitalism, and organizing direct actions and mass movements in the U.S.", "label": 1}
{"text": "Spot on. The amount of people in this thread bargaining with themselves is very sad. Vote your conscious. The only thing you control in this situation is your vote. Don't be bullied into making a evil choice, regardless of its degree.", "label": 1}
{"text": "Multiple things can be true at the same time. Yes things are getting worse no matters whose in charge, yes we have the bare minimum of democratic participation, yes one candidate will make things slightly worse than the other and yes there’s no logical point in making things more difficult for the movement simply for the sake of claiming youre doing it out of some misplaced sense of solidarity. I promise you struggling people around the world don’t give a shit if you’re choosing to not cast a ballot", "label": 1}
{"text": "I'd say it's moreso understanding that's what it might take as opposed to letting him win. I wouldn't vote regardless of who the nominees are. The main thing is that engaging in electoral politics legitimizes the system. \"Which war monger and imperialist will effect me less 🤔\" If we have an international politic than we understand anything \"good\" in the U.S. comes at the expense of the global south, so our focus should always be dismantling the systems of oppression, not upholding them.", "label": 1}
{"text": "a vote is an endorsement, and you will ultimately be complicit in their policy choices. I believe the Global South would arguably be worse under the Democrat, based off the past 4 years. So I wonder which you are referring to as the lesser of two evil? Evil begets evil. Neither is a choice worth giving. There's an intense self-indulgence and privilege to the OP's question.", "label": 1}
{"text": "Let's be clear, it's the neoliberalism and inaction of the Democrats which has led the country to Trump and Trumpism. Frankly, my hope in the long term is that America as a nation remains hopelessly divided and internationally ineffectual regardless of which party is nominally in power and eventually Balkanizes which I think should be the long term goal of every genuine American socialist.", "label": 1}
{"text": "Ok. We're not getting anywhere with this so the last thing I'll say is if your ultimate political goal is to overthrow the system of Capitalism (I hope it is) then why would you support either party which is an extension of the ruling class? Ask yourself are you a revolutionary or a leftist? Do you struggle on behalf of the working class? If so, which candidate represents the working class' interests and will improve our material conditions?", "label": 1}
{"text": "The [antisemitism bill](https://www.nbcnews.com/politics/congress/house-vote-antisemitism-bill-campus-arrests-rcna150170) says otherwise. I don’t need justification to vote for Harris. My dislike of Trump is enough.", "label": 1}
{"text": "That tactic seems kinda disingenuous and hypocritical, imo", "label": 1}
{"text": "The fact of the matter is either Harris or Trump will win. As a trans person Trump would be a threat to my livelihood. Therefore I voted for Harris.", "label": 1}
{"text": "It's understandable and not entirely invalid imho.", "label": 1}
{"text": "Liberals are in the walls again", "label": 1}
{"text": "I think that's a fair sentiment to have tbh. I mean, if main the reason for why socialists shouldn't vote is because it only solidifies the capitalistic, imperialist world order, then tbh, any form of participation in the system isn't allowed as well.\n\nHaving a wage job in a for profit business, paying taxes, paying for food, buying products, all of that are activities that play into benefit of capitalism and imperialist exploitation of the global south. Can these not be seen as legitimizing the system the same way voting does?", "label": 1}
{"text": "exactly, the only thing separating them at this point is abortion and even that's unclear (the dems actually codifying roe would mean they wouldn't have it to dangle over voters anymore).", "label": 1}
{"text": "The great thing about abortion rights is that while it's very important to women, trans men and anyone who these rights apply to, it's rather insignificant to capital accumulation at large.", "label": 1}
{"text": "Very good point to consider the moral stance of things. I mean, socialism itself is predicated on the moral principle where exploitation and inequality are elements that should be combatted against to maximize the well being of as many human beings as possible.\n\nTo say one cannot vote in a \"better of two evils\" election because of socialism is like trying to justify not patching a sinking cruise ship full of passengers because cruise ships worsen global warming.", "label": 1}
{"text": "Curious… I’m hypothesizing here, but what if instead of looking at the whole GOP vs RNC thing like “lesser of two evils” we instead think of them in terms of “the weaker of two opponents?”", "label": 1}
{"text": "Sounds like you and other leftists need to read about what happened to Ernst Thälmann.", "label": 1}
{"text": "I'm not a leftist, but either way, both parties are fascist so there is no  \"lesser of two evils\", that's the point.", "label": 1}
{"text": "A vote is not an endorsement, nor has it ever been. By allowing Trump to win, you would be complicit in his policies.\n\n\nAnd to imply that he is *better* than the alternative, is utterly unhinged.\n\n\nWhile Harris is also horrid, unlike Trump, she is not a social reactionary who will be responsible for the slaughter of migrants, mass murder of queer people and women (through policy-induced suicide, and restrictions on reproductive freedoms respectively), intensifying genocide against Palestinians, the near-destruction of the socialist movement in the United States, and harm to socialist movements across the globe (including here in Canada).\n\n\nIf you're in a red or blue state, by all means vote for Claudia and Karina, but if one is in a swing state it is counter-revolutionary to not vote for the candidate best positioned to beat Trump", "label": 1}
{"text": "I firmly agree with your take. It is abhorrent to not devote oneself toward eliminating the vile rot of fascism.", "label": 1}
{"text": "I strongly agree.\n\n\nI am not telling anyone to beg any politician to do anything. Casting a vote is not a time-exhausting activity. A vote should not be more than 0.001% of a specialist's political activity, and if it is, they are not doing their duty to the global proletariat.", "label": 1}
{"text": "There is a distinction between  leftists and revolutionaries, especially in contemporary times.", "label": 1}
{"text": "To just flat out say this is “antisemitic” is a dog whistle to shut down criticism of anything perceived as anti Jewish. \n\nIt's more of a mutual relationship between Israel, the compromised US government system, and the MIC that Eisenhower warned about.\n\nThis whole thing is a system where American citizens are used as cannon fodder/a bottomless piggybank, Palestinians/Arabs are used as lab rats, and the Jewish people are going to be eventually scapegoated again for \"antisemitic conspiracies\" because their government is the most immoral  souless evil power structure to exist today that has brainwashed most of it's people where anything they do to other human beings is justifiable. Even exterminating kids and gang raping men, women, and children in modern day concentration camps. \n\n\n\n All of this is going while the military contractors and people who are keeping them in power laugh their way to the bank and into a more poised position of global domination smack dab in the middle of the world. \n\n Tons of this is discussed in Anythony Lowenstein's book \"The Palestine Laboratory\", both volumes of \"One nation under blackmail\" by Whitney Webb and you cant forget \"The Israel Lobby\" by John Mearsheimer and Stephen Walt. It's obvious you haven't read up on this matter at all. \n\n\n\n The USA is totally a puppet state to Israel/the MIC alignment of the late 1960s and early 70s. The only thing Israel is a puppet state of possibly is  the Military Industrial Complex that gets to use Israel to test all of their cool death toys.\n\nAll Israel is to America is an an unsinkable aircraft carrier for US interest in the middle east\n\n This is is all just 21st century colonialism where the power structure is being moved from Washington DC to Jerusalem. \n\nIsrael is a fake country. It's just military base disguised as a home for Jews. That’s why it cannot exist without being artificially propped up by nonstop propaganda, lobbying, online influence operations, and mass military violence.", "label": 1}
{"text": "*national socialists", "label": 1}
{"text": "Hiding your face doesn't mean you're in the wrong. It just means you don't want to be identified (mostly by the authorities but also fascists). In my country the \"revolutionary\" block in marches would be masked on most of the time.", "label": 1}
{"text": "Imagine supporting the stop of weapons to a country fighting terrorism", "label": 1}
{"text": "Trump: The Art of the Deal.\n\nAlways remember capitalism formed the greatest country on this planet:)", "label": 1}
{"text": "Anarchists can’t organize because anarchy is the opposite of organization.", "label": 1}
{"text": "And will actively fight against a socialist state.", "label": 1}
{"text": "Actively fight an authoritarian state.", "label": 1}
{"text": "All states are authoritarian, that is the purpose of the state. The one thing that binds the different strains of anarchism is that they are anti-authority, ie anti-state.", "label": 1}
{"text": "I do truly believe with how the Democratic Party has been, that the outcome will be the same. Trump is only a threat because the blue party refuses to give up on racism. Harris going around talking about how October 7th is the most tragic event of the Israel-Hamas “war” really shows where they stand on issues outside of America. I’m aware how long it’s been since Obama’s candidacy, but if the Democratic Party is spending billions funding mass murder and bombings in several countries within the Middle East, rather than dealing with the catastrophes around America, how are you so sure it’ll stay that way? Genuine question. \n\nHarris plans on having a Republican in office, plus for the past few months all she’s gone about to back her presidency is that Trump will be bad for America and how he’ll make the circumstances in America, all of which have been occurring under the Democratic Party, worse. Sure she’s not Trump, but we see the Democratic Party move more and more towards conservative beliefs and have seen it gone down for the past 4 years, and, for some reason, much more during election season. \n\nThey’ll keep education about slavery, maybe for a year. They’ll show empathy for the dead people of the hurricanes, maybe for a few months. They’ll talk about a ceasefire, maybe for a few *weeks* (this I doubt even more considering how little “vote blue no matter who” MAGA morons give a shit about anything outside of America). They’ll talk about abortion rights, hell maybe even give them, indefinitely until lobbyists pay them off, like they did back in 2022. Whether red or blue wins won’t affect the direction of the Overton Window they go, because America will still be under control of capitalists. It’s all about who’s paying them off and what they want. The only legitimate difference between the red and blue party will always be how obvious they are with their fascism.", "label": 1}
{"text": "> Many even anti-governance\n\nWhole point of anarchy is self-governance.", "label": 1}
{"text": ">Even some of them don't consider themselves left wing \n\nLeave the left/right political stances behind. It's a false dichotomy.\n\n>And they prioritize individualism over colectivism.\n\nWhile it is true that some have minor individualist tendencies, some full on individualists, and some even anti-collectivist, the general principle from all of these anarchist philosophy is still very much anti-capitalist. Synthesists, market anarchists, egoism, all of them are strictly anti-capitalists.", "label": 1}
{"text": "The difference between a worker and a politician is one of a class difference. You can't produce socialism while simultaneously setting a system with a huge class difference between leaders who get to dictate and own capital, while the workers have to follow orders and not be able to make their own decisions with the capital they're working with, due to the fact that the \"socialist\" state owns the capital, not the workers who need those capital. You'll just end up reproducing capitalist exploitation and oppression but replacing the bourgeois with the state bureaucrats. You'll end up with state capitalism.", "label": 1}
{"text": "Pol Pot was right... a demonic single handed short lived extermination of the elite vs. a rotten endless system. Back to the land, agriculture, and a connection with Nature.", "label": 1}
{"text": "Vote for your weakest enemy: Harris.", "label": 1}
{"text": "Vote socialist every time.", "label": 1}
{"text": "And know you're on the right side of history despite the scorn.", "label": 1}
{"text": "Well, it isn't too late to have the genocide where protesting and healthcare is still legal. Having a department of education and Medicare is nice. I would also love to participate in activism post-election knowing the military hasn't labeled me an \"enemy of the people.\"", "label": 1}
{"text": "It's true it's good it's important.\n\nBut under the other evil fucking space alien, they won't be literally enslaved. I do feel like that difference is meaningful.\n\nTwo truths can exist at once.", "label": 1}
{"text": "Women have atleast some type of hair growing on their body. Fun fact. Karl Marx. Yes.", "label": 1}
{"text": "I forgot about Ralph Reed. Mr. Born-again christian. Christian coalition, Faith and freedom coalition. Embezzled money from indigenous casinos. He's not against gambling after all. Nothing changes.", "label": 1}
{"text": "Oh it does change, it gets incrementally worse as the blue side of the uniparty doesn't undo the damage the red side of the uniparty does, sliding further and further to the right (somehow).", "label": 1}
{"text": "Either capitalism wins, or capitalism wins, unless of course capitalism wins. There's plenty of options.", "label": 1}
{"text": "It just keeps getting more important every year! /s\n\nThis reminds me of apple where every year they say “it’s our best iphone yet” although that is at least true.", "label": 1}
{"text": "The leftists here would have called the nazi party and the spd the same, and abstained from voting. You guys are always useless in times of crises.", "label": 1}
{"text": "Oh. Shut up and focus on media school.", "label": 1}
{"text": "I agree with you. You may realize it's the same ruling class, whether or not it's blue or red.", "label": 1}
{"text": "No, I am not calling for you to abstain from voting.\n\nGo vote, vote for PSL, like you should have voted for the KPD in 1932.\n\nRotfront", "label": 1}
{"text": "Bull. Most election in my life (I’m 56) were fairly business-as-usual. Neither major candidate much different. I always voted third party. \n\nThat orange psychopath makes every election he’s in critical. And as a consequence, I am voting D. And you should too. \n\nThis rhetoric that the importance of this election is exaggerated is pure Russian propaganda.", "label": 1}
{"text": "Either way the capitlist machine wins and most normal people lose (even though they've been convinced otherwise by one side or the other).", "label": 1}
{"text": "Or in a very rare case, capitalism wins", "label": 1}
{"text": "Do you think the military is going to help him?", "label": 1}
{"text": "Things absolutely change, but for the worse.", "label": 1}
{"text": "I'm in agreement here. We have always been given a choice between different flavors of capitalism, but Trump has introduced the \"naked fascism\" option to the mix. The democratic party is undoubtedly a part of the problem, but they're not running on stripping women of their autonomy, denying rights and safety to the queer community, or purging immigrants. I'm holding my nose and voting blue this time around, because if the dems win I can continue to protest and push my local politicians for change, and if the Republicans win roughly 60% of my family and friends are actively endangered", "label": 1}
{"text": "So, what do you propose we do about it?  Not vote?  Any thing you think of requires a vote to change.  Vote better.", "label": 1}
{"text": "It might. The far right has been steadily replacing people loyal to the constitution with people loyal to leadership.", "label": 1}
{"text": "Exactly!  👍 Thank you comrade.", "label": 1}
{"text": "Technically each election is. I often fallback to the Coming Insurrection’s read on crisis via capitalism. It requires crisis to move forward, building the next oncoming collapse on the corpses of other crises.", "label": 1}
{"text": "And 2016 (RIP Roe v Wade)\n\n2 more Supreme Court seats will likely be available this presidential term", "label": 1}
{"text": "How many excess deaths did the US have during COVID?", "label": 1}
{"text": "\"**The creatures outside looked from pig to man, and from man to pig, and from pig to man again; but already it was impossible to say which was which.\"**", "label": 1}
{"text": "I am not calling for you to abstain from voting.\n\nGo vote, vote for PSL", "label": 1}
{"text": "Cheney was right.", "label": 1}
{"text": "Honest question: Why? Because of Iraq's invasion?", "label": 1}
{"text": "Are you being serious about Russian propaganda? Because that's the rhetoric dems always use when confronted about something", "label": 1}
{"text": "Gore would have done the same thing.", "label": 1}
{"text": "Just because Ds are usually wrong doesn’t mean they’re always wrong.", "label": 1}
{"text": "But we would have been far better off on an environmental front; may have even retained some respect for science and facts.", "label": 1}
{"text": "I believe this Anti-Russian sentiment is fomented by US propaganda. Yeah, Putin may have influenced Trumps election in 2016, but he was just one of the people who helped Trump. Nowadays, if you confront an average Kamala voter about Kamala's unconditional support for Israel, they're gonna acuse you of being a \"russian bot\" as if they're weren't Bibi's puppet", "label": 1}
{"text": "Kamala's giving the \"we need to deal with the climate crisis!\" rhetoric while being a huge supporter of fracking, increasing oil permits, etc.  Never, ever confuse rhetoric with policy. Policy is determined by who pulls the strings, and Gore was not some free agent.", "label": 1}
{"text": "Pumpkin Spice Latte?\nPakistan Super League?\nPublic switched landline?\nPolarization scrambling loss?\nPortable service link?\nPassenger seat layout?\n\nI hate acronyms and initialisms.  They don’t save much time and always seem to confuse me.", "label": 1}
{"text": "what the fuck?", "label": 1}
{"text": "I am a moderate democratic socialist. People like capitalism because it gives them choice. However, many liberals just don't like exploitative business. They are only hostile because they think we are against them. You have to be careful with phrasing because it may sound too aggressively anti capitalist.", "label": 1}
{"text": "“The most important election is the one where I’m running and want to win”", "label": 1}
{"text": "I would argue advocating for and propping up local unions so that we have an actual labor movement would be more beneficial. In the meantime vote with your conscience, mine does not feel good about voting in favor of genocide but hey that’s just me 🤷🏻‍♂️", "label": 1}
{"text": "I think the main issue is we don’t have proportional representation. So realistically the column A or B politics make it infeasible to vote for other parties. I’d love for another party to have a chance but if you don’t vote for one of the two main parties it’s just a wasted vote.\n\nAlso you must remember the Republican Party has been using Cold War style propaganda to brand democrats as communist so they are extra sensitive.", "label": 1}
{"text": "Maybe, but I'm trying to convince people to become aggressively anticapitalist.", "label": 1}
{"text": "Not calling what we believe in \"evilism nonsense\" would be a terrific start. \n\nIt doesn't really matter whatever it is you believe in, really.  Demeaning someone else's belief structure is a non-starter in 99% of all cases where there is an ideological difference.", "label": 1}
{"text": "Roe was already dead long, long before 2016. The failure of Dems to have a comparable apparatus to the Federalist Society meant that the court was going to be doomed eventually. Republicans/conservatives put in decades of dedicated, organized effort to cultivate a pipeline for reactionaries to end up in our judiciary.", "label": 1}
{"text": "It's an Animal Farm quote", "label": 1}
{"text": "I think most people are vaguely anti-capitalist generally, even though they’re unaware of it. most americans will agree when asked “is the system broken”. Nobody becomes aggressively anti-capitalist without first becoming aware of the fact that capitalism IS the problem they don’t see. you gotta meet people where they are and slowly lead them toward an understanding that the vague problems they have with “the system 😛” is their problems with capitalism", "label": 1}
{"text": "This reminds me of a great quote in Parenti’s against empire", "label": 1}
{"text": "You can't convince most people. Sadly, people are rigid in their belief. Personally, I believe in all necessities being free for everyone while luxuries are able to be bought and sold. UBI and a tax of 100% on all those with more than 250 million dollars. They might change because I'm young but. That's what I believe.", "label": 1}
{"text": "We all spend to much time arguing over voting. Join left organizations, anything that materially supports the corporate duopoly being the ultimate problem. No major change in US history has ever come from voting. Not to say ignore it, but we need to see that people's mass movements make change, not votes, and not even the goodwill of politicians.", "label": 1}
{"text": "The hell it was.  Trump getting three supreme court picks is what doomed Roe, and third party voters back in 2016 voted their conscience because they \"knew\" Roe was safe (or so they assured me).", "label": 1}
{"text": "Animal farm = skibidi toliet levels", "label": 1}
{"text": "Not voting Hillary Clinton because of this no lesser evil shit is what got us here", "label": 1}
{"text": "Without Dems organizing a countervailing force to the concerted effort of the Republicans to pack the court, this was going to happen eventually. If all it takes is one historically inept campaign from Hilary to lose three seats at the court, then maybe the Dems weren't actually fighting seriously over the course of decades. What did the Dems seriously do other than fearmonger for forty years?", "label": 1}
{"text": "Hilary Clinton would have been just as evil as trump except liberals would not have cared while she was doing it.", "label": 1}
{"text": "Ok I guess you don’t care about an ultra conservative Supreme Court or the right to choose or 4 years of rolling back regulations protecting things like clean air and drinking water. Hillary wouldn’t have done that shit. So no, not as evil as", "label": 1}
{"text": "That was my thought as well.  W's presidency oversaw such sudden and drastic changes to the US political and social landscape it was rather jarring. Feels like for the past 25 years we've had our foot on the gas and only now are people starting to realize that someone cut the brakes.", "label": 1}
{"text": "Perhaps no major change has ever come from voting, but without voting and short of an armed conflict, you can't make the changes that need to be made.", "label": 1}
{"text": "Just write in “im worthless”", "label": 1}
{"text": "Jill Stein is a Russian asset, she is not a serious leftist.", "label": 1}
{"text": "Okay I’ll get right on that", "label": 1}
{"text": "Best sign printers on the left.", "label": 1}
{"text": "Bigotry. End of reasons.", "label": 1}
{"text": "I'm right here, talk away.", "label": 1}
{"text": "This analysis is such bullshit and intellectually dishonest. She’s losing because she’s a black woman.", "label": 1}
{"text": "those people dont even vote", "label": 1}
{"text": "Yeah, because there isn't going to be a vote after this.", "label": 1}
{"text": "Everyone who didn't vote for her or advocated against voting at all is personally responsible for this. I hope you will take responsibility for the consequences in the US, Palestine, Ukraine, and the rest of the world.", "label": 1}
{"text": "Yeah, but have you considered that radical leftist like Tim Walz are actually to blame for the loss? Governor Josh Shapiro would have delivered the win. We need to go further right to win over the moderates. /s", "label": 1}
{"text": "I'm not disagreeing, however, why can't the progressive left take over the Dems akin to how MAGA has taken over the Reps? I mean a hostile takeover, not the friendly cooperation attempts that have let to nothing?", "label": 1}
{"text": "this sub seems much much better than r/leftists wtf is going on there", "label": 1}
{"text": "The more democratic a republic is, the less it lasts. All democracies come to an end eventually, just look at the Roman Republic (on which the founding fathers based their constitution). It lasted a lot (487 years), but was eventually couped by tyrants.", "label": 1}
{"text": "I hope everyone in this sub realizes that they helped elect DJT. You deserve what you get now.", "label": 1}
{"text": "I clicked to see what drama you were referring to, and the sub was nuked. What was happening?", "label": 1}
{"text": "Heil shitler", "label": 1}
{"text": "Bro you are sad because this entire sub was part of making this happen. Fuck the DNC but yall took it too a lets not vote and let donnie win level. Atleast as far as it seemed preelection. So yaa doge coin is up, and epsteins best friend is president again. Sick.", "label": 1}
{"text": "You made your voting decision yourself. No one else to blame.", "label": 1}
{"text": "2015/16 called, they want their talking points back.", "label": 1}
{"text": "This is a win for democracy, you don't know what you're talking about.", "label": 1}
{"text": "You just put fascist in power in the US. Also, your vileness is ugly. There won't be any more elections, and depending on how zealous Israel wants to be, there won't be any Palestine in a few years.", "label": 1}
{"text": "Won't make any difference. The voters (and non-voters) just put a fascist in power all on their own, no one forced their hand. We are living post enlightenment and in a free country everyone is responsible for their actions. The rest is just noise.\n\nThe time for structural changes is in-between elections. If in this time no better candidates and parties are established, you need to make a tactical decision that minimizes harm, and that would have been voting for Harris in this election.", "label": 1}
{"text": "Yeah, funding might be a problem, but ganging up on centrists should still work. Make their life difficult at every meeting until they give up or roll over. At first this is not about getting elected but getting control of the party and radicalizing it, and only afterwards it is about getting elected.\n\nWhile Starmer is decent, he is not a true social democrat, socialist, or the like. He is a liberal centrist. The real left wing inside labour has lost a lot of influence with and after Corbyn.\n\nThe third point is a real problem in many current democracies. The neoliberal and status quo thinking has reached almost everyone with a decent chance to power. In Germany, it's the same with Scholz and the SPD. This has let to social democrat positions and ideas (not even full on socialist ones) being perceived as \"too extreme\".", "label": 1}
{"text": "I wouldn't expect them to be very happy about it, but that's why I think it should be hostile.\n\nGang up on every centrist at every meeting. Be aggressive, be unapologetic, be unreasonable, be uncomfortable, and be combative. Make their internal life in the party hell.\n\nFirst of all, this would not about getting elected, this would be about pushing out centrist or get them to roll over. Only after party control has been gained, it should be about getting elected.\n\nIt's dirty and normally not something I would support, but maybe it's time to try.", "label": 1}
{"text": "Thank you, I wish them the best, and Trump will be a lot worse than Harris would have ever been, so the voting choice should have been clear. The time to try and affect the Dems is before or after an election. During it, you need to make the best tactical choice within the available options. If you think none are, I hope you are working on some near-term revolution.", "label": 1}
{"text": "I personally think voting 3rd party is a waste, might as well not vote at all. I voted for Harris because I believed she was the weaker of two enemies. There will never be a candidate that represents us, there will only be two assfuck opponents and elections are the chance we get to decide which of the two assfucks we have to fight for the next four years. Voting for Harris was strategically the best move, she was a weak ass candidate from start to finish.\n\nI know there are a lot of different opinions on this and I don’t judge anyone for whatever conclusion they come to, but personally I’m pretty pissed to have another Trump presidency when a Harris presidency would’ve been a whole lot easier to work against.", "label": 1}
{"text": "Ranked choice voting y'all. We have to unite on ranked choice voting!!!", "label": 1}
{"text": "We NEED ranked choice voting", "label": 1}
{"text": "Fuck the 5% goal. Ranked choice voting would get one of them elected. Not just that, but it would give a chance for other candidates to win smaller races too so that they aren't spending their term bowing to the whims of the majority parties", "label": 1}
{"text": "Ranked choice voting and mutual aid are all I'm putting energy into... And housing for my job... Maybe some climate stuff", "label": 1}
{"text": "The weaker of two enemies is the ethic, not the lesser of two enemies. We aren't picking friends we're picking who we're going to fight. I wish more people would would understand that, leftists and liberals.", "label": 1}
{"text": "Hope you’re happy with Trump because that was the alternative. It seems like people on this sub have a real hard time accepting that reality. I’m sure he’ll be friendly toward socialists though🤣", "label": 1}
{"text": "Did you vote for Kamala? I did because I live in the real world and knew Trump was the other person running not some imaginary socialist. If you don’t think people voting for Trump thought Kamala is aligned with socialism then you’ve had your head buried in the sand. Good luck moving the needle with Trump you got what you deserve.", "label": 1}
{"text": "They swayed the 2016 election.", "label": 1}
{"text": "Literally broke and disabled but yeah I'm a Dem shill wasting money and time on Reddit after Trump already basically won 🙄. Be fucking real.", "label": 1}
{"text": "Sorry I made a mistake, I forgot Johnson was libertarian. \n\nIn Wisconsin Hillary lost by 13k stein got 30k \n\nIn Michigan Hillary lost by 11k stein got 51k\n\nIn PA she lost by 44k stein got 49k.", "label": 1}
{"text": "The difference is people voted for stein because they didn’t like Hillary, not because stein had a good platform or they believed in her. \n\nVoting for the person and not the party is lunacy.", "label": 1}
{"text": "pls read the tweet before replying to the title, bcz there's a lot to unpack here", "label": 1}
{"text": "3rd parties played 0 part in this election.  Its on the dnc perpetuating a brain dead biden and dismissing a primary when we needed one.", "label": 1}
{"text": "That’s true but unfortunately she lost because her message was already too progressive for the general electorate. She would have lost by even more if she had gone full progressive.", "label": 1}
{"text": "At least now Israel can probably annex Gaza and make it into a more civilized place", "label": 1}
{"text": "This all sounds nice but it’s just words. I wish there was a plan that works, but America has run on greed for hundreds of years, and now is one of the worst times. How do you fix that? I dont think democracy can. People are too eager to work against their own interests in fear of higher taxes or desire for trivial tax cuts. \n\nwe are a fatally flawed species, who cannot be trusted to self govern. I’ll be the first person to say we need a socialist AI to run government.", "label": 1}
{"text": "Literally nothing. He was once president and he didn't do any shit that wasn't any different from what past presidents have done.", "label": 1}
{"text": "3rd party voters are not the sole reason why Trump lost, but it's part of it, and the mentality is certainly a reason.", "label": 1}
{"text": "You're being sarcastic, but they literally need those votes, leftist votes are not enough.", "label": 1}
{"text": "This. US left doesn't really realize that the working class is too far gone to elect anyone who’d actually help them. ", "label": 1}
{"text": "This line of thinking will lead to America being forever controlled by republicans. Bravo!", "label": 1}
{"text": "lol enjoy your Trump presidency.", "label": 1}
{"text": "There are utopian ideals, and then there are political realities. Both have their place and time.\n\nThe political reality is that while the Dems are enabling Israel, they also mediate them somewhat, while the Reps will not only enable but instigate them. The one who's okay with genocide is the one who enables the Reps to gain power because they don't recognize the Dems as the lesser evil, not the ones who make sure the greater evil doesn't attain power.\n\nComplicity by non-action is a thing. It is not a moral and innocent position/action, as you seem to believe. Absolute morality is a nice utopian ideal, but relative is murky and often necessitates relative morality within reasonable bounds.", "label": 1}
{"text": "Leftism is the reason fascism runs wild, why would they ever agree to unite for the greater good?\n\nLeftism killed a country today, it's death has just begun.", "label": 1}
{"text": "I'm not mad at third party voters, I'm more mad at my trans friend and gay friends who refused to even vote", "label": 1}
{"text": "No you only have to go back to 2016", "label": 1}
{"text": "Ah, yes. How DARE a member of the LGBTQ community express anger at the two groups who just overwhelmingly voted to have all of their rights stripped away! Clearly that is the most fascism.", "label": 1}
{"text": "No fuxk you guys. All you scum bags that were for months screaming genocide Joe at the top of your lungs. Fuck you guys. You made sure that the supreme court will be conservative and regressive for the rest of my lifetime. Fuxk you guys", "label": 1}
{"text": "They laid out a plan to reform the Supreme Court. They were pretty clear on that one", "label": 1}
{"text": "I hope that the negative consequences of this election will be felt at least as keenly by minorities who voted Trump as everyone else. All the minorities who voted Trump need a wake up call not to vote against their interests, and if getting their family deported is what it takes, then that’s on them", "label": 1}
{"text": "If you didn’t vote for steering the ship away from the iceberg you should be willing to at least share some of the blame when it hits", "label": 1}
{"text": "In 2000 Glorida decided the election and was lost by a few hundred votes. There were 100K Green Party voters in Florida. This election it was not the case, in fact it was even more danmnign that the US electorate has moved further to the right", "label": 1}
{"text": "Got me in the first half", "label": 1}
{"text": "Could be, however, you already have the structure and might be able to take over some funding in one case and have to build everything up anew in the second.\n\nAlso, you would need to choose your fights, and they wouldn't begin with Bernie and AOC.", "label": 1}
{"text": "Fear is stronger than hope.", "label": 1}
{"text": "That's your choice, and with that choice you just enabled more genocide.", "label": 1}
{"text": "Don't leave them the choice, then. MAGA didn't ask the old guard if they can take over.", "label": 1}
{"text": "🤣 enjoy the leopards.", "label": 1}
{"text": "You’re underestimating the extent to which him and his allies weren’t prepared for his 2016 victory, the increase in militancy of followers and those around him, the degree to which Trump has been cast as a martyr, the depth to which skepticism of mainstream science has become normalized, and the extent to which his movement and staff have prepared themselves this time around. This won’t just be a repeat of his first term, and we’ve never seen anything quite like this before.", "label": 1}
{"text": "What are people supposed to do if the people you are trying to defend end up voting for the guy who wants to deport them?\n\nIt's like trying to save an abused & beaten woman when she keeps going back to her abuser.\n\nYou start thinking, well if that's what they want then I'm done trying to help.", "label": 1}
{"text": "This may have been a fair point in 2016 and 2020, but the Dems were promising to be tough on migrants and do nothing about the rising tide of Transphobia this time around. Neither offered us anything on the genocide in Gaza, the only real difference between them is that Kamala might have done something about Roe, while Trump might do something to end Ukraine. Both candidate were running on Trumpism, and there was literally nothing to mourn because there was no fucking choice.", "label": 1}
{"text": "Why would I mourn?\n\nIt was Tuesday now it's Wednesday and the trajectory of capitalism and the important choices you need to make haven't changed", "label": 1}
{"text": "Trying to get people on a socialist sub to log off the internet and join the biggest (by far) socialist movement in the world is cringe?\n\nOk.", "label": 1}
{"text": "What the starving soviet union?", "label": 1}
{"text": "Yeah, I'm not a fan of Biden, Harris, and Trump but in no world are Trump and Harris the same, they're domestic policies are so different from each other. If Trump does what he wants there will be a depression that could possibly be on par with the Great Deppression. That isn't even touching what he'll do to women and abortion, mass deportation, and anti-LGBT laws. These goals of his aren't something Harris or the Democrats would do, the idea that Trump and Harris are the same is completly ridiculous.\n\nThe main issue that leftists have with Harris is Gaza, which I also think is a major issue that she should have addressed better. Trump said himself that he wants to bulldoze Gaza, Harris doesn't want that to happen, she might have given arms to Israel but she wouldn't have supported a full genocide.  I think the bigger issues that are going to affect  the country are Trumps goals with the economy,", "label": 1}
{"text": "Jill stein’s vote would win the election for Hillary easily.", "label": 1}
{"text": "I’m changing strategies. I’m an accelerationist now. \n\nLet it burn.", "label": 1}
{"text": "Or register as a democrat and vote for better candidates, ALONGSIDE PROTESTING AND ORGANIZING.", "label": 1}
{"text": "Who would they vote for?", "label": 1}
{"text": "Dude idfk lmao I’m still gonna kms before the end of his term anyway because shit is not gonna get bettet", "label": 1}
{"text": "Why the problem with Ukraine? A capitalist republic is preferable then a semi fascist empire like Russia.", "label": 1}
{"text": "Disagree. If we want to bring people in, we need to stop purity testing everyone because almost no one comes into this pure. It makes it difficult to bring people in. You’re basically demanding that people line up the same on every single thing or you’re not one of us? No. I’ve heard some wild shit from comrades who are either very new or very old at this, including myself. The best approach is to just hold your line on your own beliefs and explain why and assume it will take people time to realize you’re right (on Palestine especially). IMHO", "label": 1}
{"text": "> the person i was discussing with kept insisting that the only reason nato exists is to \"stop russian imperialism\" \n\nThis is mostly true. NATO was formed to counter the Soviet Union, and its primary role today is a defensive alliance against Russian expansionism. \n\nIts purpose became less clear after the collapse of the Soviet Union, but became increasingly relevant after Russia invaded Georgia in 2008, annexed Crimea in 2014, and finally launched a full scale invasion of Ukraine in 2022.\n\n> and that theyve only really acted defensively and never offensively. \n\nThis is sort of true. They have never acted offensively with the goal of expanding some kind of NATO empire. However, they've conducted some operations that are hard to call 100% defensive – more like exp\n\n- They intervened in the Bosnian War, escalating gradually from sanctions and enforcing a no-fly zone to conducting air strikes and deploying peacekeeping troops, alongside troops from non-NATO countries, after the war ended. It is not clear that the Bosnian War had posed a direct threat to NATO countries. However, their actions were authorized by the U.N., and the air strikes were in response to the Bosnian Serb Army's massacre of Muslim civilians, the first officially recognized genocide since WWII.\n\n- NATO also intervened forcefully to end the Kosovo war, nominally because of the humanitarian crisis and ongoing war crimes. Although the U.N. had condemned Yugoslavia's actions and called for ceasefires, the Security Council did not approve military action, due to opposition from Russia and China. This was the first time NATO used military force without the endorsement of the U.N.\n\n- Article 5 (An attack on one country is an attack on all) was invoked for the first time by the United States, after the September 11, 2001 terrorist attacks. They cooperated on various operations like patrolling the US airspace and securing shipping routes.  After the US invaded Afghanistan, the U.N. established the International Security Assistance Force (ISAF) to stabilize the capital region and help build a permanent Afghan government. NATO eventually took command of ISAF's mission at the request of both the U.N. and the Afghan government. This was the first time NATO had a mission outside of the North Atlantic region. The U.N. later expanded their mission to provide security for the entire county. Overall, Afghanistan was kind of an L.\n\n- NATO trained Iraqi security forces during the Iraq war, at their and the UN's request, without actively participating in combat.\n\n- In 2009 NATO conducted anti-piracy missions in the gulf and Indian ocean area, in cooperation with Russia and China.\n\n- In 2011 NATO intervened in Libya, almost entirely via air power, to enforce the U.N.'s mandated no-fly zone. 7 months later, Libya's ruler Gaddafi was killed by rebels, at which point the UN ended NATO's mandate for military enforcement and they pulled out shortly after that. Libyans generally supported the intervention as Gaddafi was deeply unpopular, but like Afghanistan, the state disintegrated very quickly. Its hard to call this one a success.\n\nIf you want to read more about these conflicts and others I didn't mention: https://en.wikipedia.org/wiki/List_of_NATO_operations\n\nIn my personal opinion, NATO is critical for the security of western and central Europe. They do provide a very strong deterrent against Russian aggression. I also believe they should stay in their lane (defending Europe, North America, and *maybe* international shipping routes).", "label": 1}
{"text": "They're oppressing Russophone Ukrainians that live in Eastern Ukraine. Zelensky even said he admired Israel and hoped Ukraine could be more like them, presumably because he wants to do to the same to Russophone Ukrainians that Zionists are doing to Palestinians.\n\nIf you want to know more look up Bandera/banderites and how nationalism has shaped Ukraine since WW2.", "label": 1}
{"text": "Ukraine is fascist, has extreme far right policy, Nazi brigades, and oppresses the ethnic minority russians living in its eastern areas (the same areas Russia wants to annex).\nIt acts entirely as a US sock puppet, though Russia isn’t favorable, just like Iran, it shares a common enemy with the socialist superpower China and all people oppressed by the US.\nRussia can never be as big of a player as America or China, and if their regime ends, we have to make sure it happens in a world free of powerful western imperialism for the sanctity of socialism. This will not come if it happens soon.", "label": 1}
{"text": "Ukraine strives to be alike Israel- at least according to Zelenskyy. Ask the eastern Russian speaking population what they think of him and his party. They’ve been shelling those people for about as a long as Russias been itching to move in.", "label": 1}
{"text": "Roll over and die, apparently.", "label": 1}
{"text": "There is a lot of nazi in ukraine", "label": 1}
{"text": "So your plan is to take 50 steps back in order to hope to take 5 steps forward because you wouldn't be able to take 100 steps forward with someone else? These books told you that?", "label": 1}
{"text": "We allow rats defending the Ucraine here?", "label": 1}
{"text": "DSA isn't socialist. Get your welfare capitalism bullshit out of here.", "label": 1}
{"text": "what the hell", "label": 1}
{"text": "jesse wtf are you talking about\n\nand i beg, i beg liberals to stop talking about \"steps\" as if history moved linearly instead of dialectically", "label": 1}
{"text": "The territories of the eastern Ukraine breakaway proto-states have been no better under the far-right great Russian chauvinists that have presided over them since 2014. A key reason why no leftist should support the LPR and DPR and because of their [suppression of organized labor](https://links.org.au/ukraine-trade-union-and-human-rights-activist-donbas-when-theres-problem-people-come-us).\n\nThere are plenty of legitimate criticisms of the Ukrainian governments after the fall of the Soviet Union. However, none of them are coming from the Kremlin because the Russian Federation itself is a warped shock therapy subject from the Soviet Union's collapse that is currently drunk on nationalism and great Russian chauvinism.\n\nTo advocate for the supposed revolutionary defeatism of Ukraine but not the Russian Federation nor the other Western powers is an exercise in campism, not internationalist anti-imperialism. The realpolitik endorsed by campists is ironically not all that different from the principal imperialist power (the US) installing dictators, death squads, drug dealers, and religious fundamentalists in an ill-conceived attempt to destroy socialism.", "label": 1}
{"text": "1. Who the fuck is Jesse?\n\n2. Did you know that not everyone that doesn't line up to get one lick each of trump's balls is a liberal? I'm a leftist. \n\n3. Using 'steps' is to illustrate figuratively. That's part of what words strung together, making sentences then further grouping them into paragraphs do.", "label": 1}
{"text": "What does leftist mean for you?", "label": 1}
{"text": "Should’ve made this clear mb\nRussia has all these things too, but they also oppose the US so at least *something* is salvageable.\nAlso the “Russian bot” thing is libshit", "label": 1}
{"text": "fuck dsa join your green party, psl, swp, fucking anything but dsa", "label": 1}
{"text": "I thought about this exchange for a long time, and I think it was supposed to say “Jesus”", "label": 1}
{"text": "Exactly lmao", "label": 1}
{"text": "No clue what that first sentence even means but wtf are you doing saying “Orwell was right” here? Thought this was a socialist sub.", "label": 1}
{"text": "NATO is bad, but Russia is worse. Fuck the KKE revisionists.", "label": 1}
{"text": "I know, I was being an ass", "label": 1}
{"text": "I think there is a general misunderstanding here. \nBiden can also get fucked. I voted PSL and was always against him attempting to run again. He campaigned on being a one term president. \n\nBut cool, I'm the reason we all lost out.", "label": 1}
{"text": "Firstly, Orwell states multiple times that he “can’t bring himself to hate Hitler” and all he did throughout his career was use fairy tales to slander socialism and various socialist projects without any actual valid critiques (while also acting as a colonial officer in British occupied Burma to suppress their independence) so not really the best guy to be quoting.\nThis isn’t about bringing in fascism to “own the libs”…whatever that leap in logic this is supposed to entail, I guess you genuinely think Reddit “arguments” = fascism. You do you man.\nI never tried to “own” you in the first place, or anyone at all. I stated my observation on the matter  of Russia’s position on the world stage in juxtaposition to the USA and its allies then agreed with another person here when they made the observation that this subreddit is full of liberals, I’m sorry that offended you.\nAlso don’t lose your faith in humanity over a Reddit thread of all things lol, your malding over something that isn’t real life. Interact with people outside of this app if you want a glimpse of humanity.\nBtw, if you want to seem morally stable, don’t usher in the slurs the second you start getting upset. And don’t use some excuse like “I was using the literal definition!”", "label": 1}
{"text": ">and all he did throughout his career was use fairy tales to slander socialism and various socialist projects\n\nAnd this tells me you never read anything Orwell or understood what he was saying. Thank you for proving I'm right. So go on and run with your cliff notes Wikipedia research. I'm sure the fascists will love you for it.", "label": 1}
{"text": "Again, colonial officer in British occupied Burma. That’s twice the fascist either of us will ever be.\nThanks for ignoring everything else I said btw. Brilliant slam dunk that was", "label": 1}
{"text": "so let me backtrack for a second, because all you seem interested in doing is throwing out insults…\nI called you out on using slurs with a pathetic excuse, I called you out on using a bad example for anti fascism, a person who stated and reiterated he “can’t bring himself to dislike Adolf Hitler” and continually conflated fascism with communism, I called you out on the premise of this whole thread, you claiming I’m just trying to “own the libs”, and I called you out for conflating Reddit arguments with real life this hard.\nYou responded to none of this, which I don’t really care about tbh, I just want to know why you think I’m a fascist, and why you think repeatedly calling me that instead of giving me something to improve on or work with is meaningful/helpful. (It’s because I’m not really, and you’re just using this one insult as a way to plug your ears and scream into the void.)", "label": 1}
{"text": "It's Jesse from breaking bad.", "label": 1}
{"text": ">so let me backtrack for a second\n\nI don't think you've back tracked far enough. Keep going. Maybe you'll clue in eventually\n\n>I called you out on using slurs with a pathetic excuse\n\nNope, but nice lie. Point to where I used a slur. I'll wait. \n\n>I called you out on using a bad example for anti fascism\n\nNope, but nice lie. Wanna lie again? I bet you do.\n\n>a person who stated and reiterated he “can’t bring himself to dislike Adolf Hitler” \n\nWhich does nothing to counter his most famous anti authoritarian (aka fascism) works. But go on. Prove him right. \n\n>and continually conflated fascism with communism\n\nContinue to prove you have no idea whatbhis work said and that you've never read any of it. Why not? What scares you about reading it?\n\n>, I called you out on the premise of this whole thread,\n\nNope, but nice lie. Wanna lie again? I bet you have to.\n\n>You responded to none of this,\n\nBecause it's all clearly bad faith bullshit and now worth any real response.\n\n>which I don’t really care about tbh,\n\nYou \"don't really care about tbh\" so much that you cry about it repeatedly. Multiple times, in fact. AGAIN. Nice lie. Wanna lie again? Like, at least be honest to yourself about it?\n\n>I just want to know why you think I’m a fascist,\n\nBecause you act like one. When someone doesn't agree with you, you go \"liberal\" like there are only 2 options. It's very fascist to just paint a disagreement as \"other\" not worthy of hearing. And now, as you're going \"well u dew da same.\" i hope you clue into that being the whole point. I've given you what you gave out. Why don't you like it? \n\n>why you think repeatedly calling me that instead of giving me something to improve on or work with is meaningful/helpful\n\nWhy would I try to help you? A lying feckless coward? What have you done to incentivise me? You can't even act in good faith. Lol you try to discount Orwell for serving in the military and a single \"quote\" that I doubt is real and has zero context. That'd be like me quoting you saying.\n\n>so let me backtrack\n\nAnd being like \"see it doesn't want to make any progress. It just wants to regress.\" Is that what you meant? No. Context is key. But you DO NOT CARE about it. You just want a sound bite to try and \"own\" something you don't understand are too scared and lazy to even begin to understand. Because the option to learn is out there. It's all around you. It's literally at your fingertips. But you won't do it. Why should I? \n\n\n>It’s because I’m not really, and you’re just using this one insult as a way to plug your ears and scream into the void.)\n\nIt's ironic that you can see it in others but not yourself. Thanks for again proving me right. That you're a bad faith feckless coward. If you're not gonna develop a spine at least try gas lighting better, narcissist.", "label": 1}
{"text": "Pretty sure it's a breaking bad reference.", "label": 1}
{"text": "Criticism of one is not endorsement of the other, unless you're a liberal. Someone asked a question and I answered it.", "label": 1}
{"text": ">way back when?\n\nHow long before it becomes legitimate in your eyes? Russophones have been living in that area for over a century.\n\n>it'd be so bad if they just went back to Russia.\n\n700k fled to Russia as refugees in 2014.", "label": 1}
{"text": ">How long before it becomes legitimate in your eyes? Russophones have been living in that area for over a century\n\nAnd? They can live in Russia instead. They have a home to go to. You wanna talk about time and legitimate? Let's talk about the colonial world. Let's talk about active invasions and world policing. No? Okay let's talk about immigration. If I land in a country and claim I'm a citizen does that make it valid? Or does only being born there matter? What's legitimate in YOUR eyes? Does it REALLY matter?\n\n>700k fled to Russia as refugees in 2014.\n\nAlmost like... I called it. Seee. They can leave. They can go to Russia. Why are they staying? I wonder....", "label": 1}
{"text": "Do you think from Reagan til now the democrats have ever been \"a step forward\"? Lol, lmao, rofl even", "label": 1}
{"text": "I would be curious to know the specifics of what horrendous shit is suspected to come out of this.. but the republican party has a massive problem as it pertains to Trump. The character that is Donald Trump has become bigger than the party itself. It's extremely problematic and not good for anybody, not even the MAGA voters. Trump can sell the voters MAGA crowd on anything, and they believe in him so much that there's nothing you can do or say to break the mind control. $8 trillion+ in debt? \"yeah, but trump's debt is different debt is different because the money he spends makes america better...\" It's a nightmare for the party, and for everyone. In many cases, constituents will have no choice but to lay down and go along with the horrendous shit.. There will be an us vs them paradigm, of course there already is with the whole RINO label, but I'd expect it to intensify and reach new levels. Anybody in the party who isn't a yes man to trump will be viewed as an anti america first enemy, and this could have personal ramifications as well. This alone could destroy a political career.... I guess you could look at JD Vance as an example. Maybe JD Vance really has changed in the way he feels about Trump and Trump's  policies, but it almost seems like Vance is swallowing his pride, and putting on an act in order to further his career, and of course his income that comes with rising to superstardom.", "label": 1}
{"text": "probably a social democrat", "label": 1}
{"text": "They're just a liberal troll doing the \"fascism = communism\" bullshit from what I can tell. Might be best to ignore", "label": 1}
{"text": "Basing your entire political outlook on one British colonial stooge who wrote fairytales about talking pigs (when he wasn't plagiarising soviet authors) isn't the best idea", "label": 1}
{"text": ">Basing your entire political outlook on one British colonial stooge\n\nBasing my entire polticial view on one reddit post helps prove that colonial stooge right. good job.\n\n>who wrote fairytales about talking pigs\n\nI'm sorry the idea of writing and storytelling is so lost to you. Continue to prove Orwell right why dont you \n\n>isn't the best idea\n\nwho claimed it was? But it's still better than your idea of proving orwell right and using cliff notes and natzi propaganda to belittle him. Go on fascist. Tell us how the natzis were really socialist because it was in the name why dont you? Lol", "label": 1}
{"text": "Op thinks Russia is still communist (or that the soviet union was anything but a fascist dictatorship masquerading as communism).", "label": 1}
{"text": "So we should all go back to our ancestral homelands? My ancestors come from China, Hungary, Norway, and Sweden. I speak none of the native languages of any of those places. I don't even live in the country I was born in. I don't even think I'd return there as a refugee if I were to become one. Where should I go? Where would you have to go?\n\nIf this is your view, why are you even in this subreddit? Are you a nazbol?", "label": 1}
{"text": "someone who votes for blue genocide really hard i guess", "label": 1}
{"text": "We may have no sympathies with NATO, but this is a war that Russia created. Ukraine has every right to defend itself as an invaded nation, for the same reason that Palestine has a right to its own self-determination, and action should only be taken against the aggressor.", "label": 1}
{"text": ">So we should all go back to our ancestral homelands?\n\nGo on. Point to where I said that. Ill wait. Or do you wanna lie again? I bet you have too eh? Why do you have to lie coward?", "label": 1}
