{"text": "The PBS series Nova has countless episodes of interesting science.", "label": 0}
{"text": "Love watching these videos with my kids. It really gets them invested in space which is awesome", "label": 0}
{"text": "No, but it does have that Elon Musk.", "label": 0}
{"text": "If I were at the point where I'd already more or less lived my life, I'd risk it.  John Glenn returned to space at the age of 77, so there's precedent!", "label": 0}
{"text": "Yes, they are all done as \"false color\" images.  Someone has to decide what color to use to represent which shot from which filter.  The \"Pillars of Creation\" for example do NOT look like the popular photo, he simply chose \"well, green will represent oxygen, red will represent hydrogen,...\" etc.    \nThe Webb is even more so, as it mostly only shoots photos in the infrared.  What you see is again a false-color representation.", "label": 0}
{"text": "Journey to the Edge of the Universe - NatGeo. I prefer the version with Alec Baldwin as the narrator.", "label": 0}
{"text": "If you're also interested in human space flight, there are relatively recent documentaries on both Apollo 11 and 13 that are really spectacular. \n\nThey're called \"Apollo 11\" and \"Apollo 13\", respectively", "label": 0}
{"text": "Thank you! Personally I love learning more about rovers more than human space flight", "label": 0}
{"text": "1. Get funding from government\n\n2. Implement stock buyback program\n\n3.???\n\n4. Profit!", "label": 0}
{"text": "The production value is significantly better than I expected and that zoom out from the pool fills me with dread. Horrific.", "label": 0}
{"text": "Boeing is out and fElon is colluding with putin… US space program is in the shitter at the moment", "label": 0}
{"text": "China's space program is steadily marching along, but what exactly is Russia winning? They're not even contenders.", "label": 0}
{"text": "It seems to ebb and flow from year to year. Dems are more pro-science and tend to push for increased funding towards scientific programs, especially some related to things like climate change (with more earth-monitoring satellites, which Republicans have tried to cut).\n\nRepublicans are more for cutting spending, but big red states like Texas and Florida owe a lot to the space program so you can bet the representatives from those states will push for increased funding. Elon Musk has also been very pro-Trump lately so I wouldn't be surprised if SpaceX got a few extra contracts if he wins.", "label": 0}
{"text": "Collimation? Have you ever collimated your optics?", "label": 0}
{"text": "The good old planning ahead reaching new spaces with a drawing and a honest wish i guess.", "label": 0}
{"text": "It's already a giant flaming pile of cash. The people who buy it imagine that they have fire extinguisers.", "label": 0}
{"text": "Then Boeing will be responsible for interest on the debt.", "label": 0}
{"text": "r/remindmebot please remind me in 5 years", "label": 0}
{"text": "Putin asked him to not allow Starlink in Taiwan. Starlink is coming soon to Taiwan and just needs government approval, so he obviously didn't listen to him. \n\nSo yea, you're full of shit and just want to spread your lies.", "label": 0}
{"text": "They *had* the money, and chose to not use it for anything other than lining shareholder pockets. Now they have no money and deserve to wither away, and let the valuable elements get absorbed by other entities or the DoD. There's not much BDS does that couldn't be done by Locked/Northrop/SpaceX. Tricky part is what to do with BCA....", "label": 0}
{"text": "Yea that doesn't sound fascist at all lmao", "label": 0}
{"text": "Hello u/JEWgen0_0! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "“The person who (likely illegally) collaborates with right-wing dictators and promotes ethnonationalism should not be in a position of power” is the opposite of fascism.", "label": 0}
{"text": "I don't want to speculate which astronaut was hospitalized, but one was particularly unstable and wobbly coming out of the Dragon. Being reintroduced to gravity after months in space can't be easy.", "label": 0}
{"text": "I love how people are still spreading these lies.\n\nThey never were disabled, just not enabled in Russian territory.", "label": 0}
{"text": "More trusted? Technically correct, but it's really more like \"Only other option\"", "label": 0}
{"text": "The US government did actually nationalize GM though. Like, that was very much a thing that happened. The US had a majority stake in \"New GM Co\". New GM was 60% owned by the US Government, 12% owned by Canada and Ontario, with the remaining being owned by UAW and the finally private investors.", "label": 0}
{"text": "DSCOVR (at L1) also does regular imaging of Earth, but I think they do so only roughly every 2 hours or so: https://epic.gsfc.nasa.gov/", "label": 0}
{"text": "Back before their planes started crashing is the period I am discussing.", "label": 0}
{"text": "Yeah I watched all his videos today. He is amazing. Will sure grow to millions of subscribers in the coming years.", "label": 0}
{"text": "By that measure, how were the astronauts stranded?", "label": 0}
{"text": "For that price range you are probably better off seeing if you can find some second hand astronomical binoculars.", "label": 0}
{"text": "You can always look for used telescopes on Facebook or people in your local astronomical society. That's not a great budget for a telescope, but perfectly fine for a pair of astronomical binoculars. I've got a set of Celestron 15x70s that were about that price and I use them almost every day, for birds and space.", "label": 0}
{"text": "> can't get back home as planned and is stuck somewhere\n\nCan't get back home as planned.......sure.\n\nStuck somewhere? Nope.  At no point were they ( or are they ) stuck.", "label": 0}
{"text": "I totally agree, would be atleast 10x cheaper, but probably won’t happen since they have inside contracts with companies, less money for high end employees.", "label": 0}
{"text": "Which one was wobbly coming out of dragon?", "label": 0}
{"text": "Maybe im just stupid but i didnt know the ISS had wifi", "label": 0}
{"text": "NASA does some incredible stuff engineering wise and has worked on a tiny budget for a long time now. \n\nThey need to get the funding they ask for to start off. NASA already primarily focuses on science missions.", "label": 0}
{"text": "It will most likely be ready next year, though NASA won't have any availability until 2026. Assuming BO has a better cost control than Boeing, it would likely still be better than developing their own from scratch. \n\nRemember, a lot of problems are with how Boeing does things. Not necessarily with the vehicle itself. Starliner kept humans alive in orbit. And Starliner did return safely. These are both things that BO has not done. And all of the lessons learned from Starliner could be moved over to a larger project at some point.", "label": 0}
{"text": "NASA has always left the engineering to private companies. The space shuttle was built by private companies, the saturn v was too.", "label": 0}
{"text": "NASA never built a rocket, its always been private companies building them", "label": 0}
{"text": "The one wearing a white suit with black boots", "label": 0}
{"text": "Probably the one who got hospitalized.", "label": 0}
{"text": "That's kind of a dumb idea given that the government would run the business into the ground far quicker than any private owner as evidenced by most government programs, but I get this site has a hate boner for anything less than full blown communism.\n\n\nI mean, the greatest contributor to space travel has been a private company. Sure, NASA was able to get shit done with a trillion dollar budget lol. Imagine space x with that kind of budget.", "label": 0}
{"text": "I didn't want to be categoric, because the early early days they've probably built \"rockets\" and I'd imagine they had some sounding rocket sections.", "label": 0}
{"text": "So by cutting cost and firing people who've been the most ressourceful?", "label": 0}
{"text": "Is it the air leaks, the launch failures, or the delays in new rocket development that are selling you here?", "label": 0}
{"text": "Obligitory \"Can Tiny SpaceX rock Boeing?\" cover of Aviation Week", "label": 0}
{"text": "He's talking about privately managed rockets. When a private company designs the rocket and owns the rocket design, they generally do a better job.", "label": 0}
{"text": "No it wasn't. It was a bit weird for you to not understand the context, and then weirder to try and make a thing out of it.", "label": 0}
{"text": "Yeah, the only thing holding him back is volume. His bio says he has a day job and he does this for fun, but if he likes making these videos more than his job, I'd guarantee switching to this full-time would pay off huge for him.\nMake more videos, hit the podcast circuit, get more subs, get sponsorships, hire some people, make more videos... he'd be a millionaire within the year.\n\nOf course, what he's doing now seems to be working great for him, so maybe my plan would just ruin it.", "label": 0}
{"text": "[https://www.youtube.com/watch?v=FaF23LTeyoc](https://www.youtube.com/watch?v=FaF23LTeyoc) about 1:50. Glad three are fine, here's hoping the fourth one recovers quickly.", "label": 0}
{"text": "Boeing, ULA, Lockheed Martin,... are not privately owned companies?", "label": 0}
{"text": "The shot zooming out from the moon with all the galaxies lighting up the entire sky left me awestruck.\n\nIt's easy to think that you can grasp the vastness of the universe and the number of galaxies, stars and planets in it, but actually seeing it hits you like a freight train.\n\nAmazing video. Thanks for sharing it.", "label": 0}
{"text": "Maybe get rid of the executives and MBAs who’ve made all the disastrous business decisions instead? The failed Starliner project is a symptom, not the disease.", "label": 0}
{"text": "I'm glad we could finally clear this up.", "label": 0}
{"text": "No. NASA certainly needs to get into shape (and a decent budget), but leaving engineering to for-profit company would only mean more tax-dollars being wasted along the way. Sharing knowledge and resources between public and private entities is great, but creating dependencies can result on delays that can jeopardize entire projects (ask NASA about Boeing).", "label": 0}
{"text": "As much as a waste as Starliner is, it seems like it would be a good idea for NASA itself to make the purchase.", "label": 0}
{"text": "They've already tried that a couple of times.", "label": 0}
{"text": "Run the government like a corporation? A corporation would've cut ties with Boeing and just partnered with the contractor that is both more reliable *and vastly cheaper*. The fact Starliner, and SLS too, are both going full steam ahead funding wise points to the government very much not running like a corp.", "label": 0}
{"text": "NASA manages and owns the SLS design. Those are contractors building parts and components. It's very different from privately managed rockets.", "label": 0}
{"text": "Blue Origin would make sense.", "label": 0}
{"text": "You're not understanding. Any complicated tech is pretty much useless unless it's so mature that it can run on it's own without oversight, or you have the engineers who understand how it works to enhance and maintain it.\n\nIt doesn't work like you think, where once you have the rockets, blueprints, and patents you can just pick up where Boeing left off.", "label": 0}
{"text": "I wonder what eating and drinking feels like in space. Drinking especially must be a bit weird.", "label": 0}
{"text": "OP has no idea that Rockwell was the designer and manufacturer of the Space Shuttle.\nBefore that, the rockets were designed and built by military contractors.", "label": 0}
{"text": "For a long time the only reliable rocket engine used was a Russian RD180. The story on Elon is just a hit peace. US government keeps tabs on him or he wouldn’t be launching shit.", "label": 0}
{"text": "And that's great for the private companies they don't have to shelve money for the design. Just like Space X don't really have to receiving a lots of subsidies nowaday.", "label": 0}
{"text": "Boeing's best course of action would be to completely replace their entire corporate governance. In 1997, when they replaced engineers with corporate financiers, it has been completely detrimental to the overall quality of the business and it's products.  \n\nA lack of quality control among their various subcontractors has been fucking them in the ass.  \n\nThe only thing that will save Boeing is to put actual engineers back in charge.", "label": 0}
{"text": "They did spend almost 8 months in space. There are health issues associated with that. [Here's the video](https://www.youtube.com/watch?v=5CRB3FHV9Dw&list=WL&t=7100s) of them leaving the capsule. Michael Barrett is the oldest astronaut in Crew-8, and had trouble standing. Jeanette Epps almost fell over when leaving the capsule.", "label": 0}
{"text": "Also, how many of ULA’s issues are due to ULA people vs due to Boeing’s leadership? If you remove Boeing, do the problems still remain?", "label": 0}
{"text": "Are you questioning the mighty Angara rocket, it's obviously not behind schedule and already outdated?", "label": 0}
{"text": "NASA launches its astronauts in those rockets.", "label": 0}
{"text": "That isn't speculation, my god, no.\n\n\nIt is clear deduction Watson. ", "label": 0}
{"text": "They would probably spend all that money on a launch tower again", "label": 0}
{"text": "Tory Bruno (ULA CEO) is competent, I think. I just think that the two ULA parent companies expecting a return on investment yearly has him locked into a low risk pattern of R&D that got ULA too far behind to keep up. Vulcan has promise with SMART re-use, and the upper stage is kind of awesome, but it's too little too late, IMO.", "label": 0}
{"text": "I understand perfectly fine - been in this industry for over a decade and worked for both companies. I didn’t say you can just pick up all of Boeing’s work and not need any engineers. I’m saying the Boeing engineers are not work the acquisition. It is the technology that is useful to a company. I’m responding to the comment that said the deal is only worth it if they get all of the engineers. \n\nPlus, engineers are smart. I’ve taken over projects where I didn’t have any contact with the original engineers because either they left the company or because my company was now responsible for maintenance for something we didn’t originally analyze.", "label": 0}
{"text": "I really think it’s time to wipe Boeing’s upper management right out and give the workers everything they need. The workers aren’t the problem, the decision makers are.", "label": 0}
{"text": "Is Newsweek unreputable or something? /s", "label": 0}
{"text": "People are going to tip toe around the nuances of the wording but I 100% agree with you.", "label": 0}
{"text": "With his on going talks with Russian government officials, I wish the US would nationalize Starlink and SpaceX and keep Elon away from necessary technology.", "label": 0}
{"text": "I mean, that's kind what space travel currently is tbf", "label": 0}
{"text": "Russians are also moving away from a Soyuz", "label": 0}
{"text": "The SLS isn’t competitive. There are no competitive federally-managed rockets. The launch market is dominated by privately managed rockets, mainly SpaceX. The US government isn’t capable of designing a competitive orbital rocket at this point, even when given tens of billions of dollars. It’s the same with Europe. ESA has no idea what they’re doing. The only well-designed orbital rockets are all privately managed rockets.", "label": 0}
{"text": "I saw this coming. Boeing is going to spin off all their space contracts to a new company, and Blue will buy it using tax payers money. Thus bailing out the people whose fault this is.", "label": 0}
{"text": "If anything they'd use starship to launch bigger modules in a modern ISS, and would never use a vehicle itself as the habitat.", "label": 0}
{"text": "People just like to make up shit for the capabilities of Starship cause they love gargling musk's balls. The only plans for LEO station has been to let the private sector take over and that's with companies actually working on such things. Only station NASA is looking forward to after ISS is the Lunar Gateway.", "label": 0}
{"text": "I'm guessing some of it is also the two parents' desire to maximize profit by minimizing costs (at the expense of actual engineering)", "label": 0}
{"text": "We recently actually saw a black hole for the first time ever", "label": 0}
{"text": ">I’m saying the Boeing engineers alone are not worth the acquisition. \n\nThat's not what I meant either. I was trying to say that simply acquiring the tech without the know-how is useless, especially with cutting edge greenfield projects. I thought you were saying that BO could throw Starliner in the back of a truck, drive it to their facility, and be ready to upgrade and launch it in 6 months... I was thinking \"this dude has no idea\"...lol\n\nI guess there's no dispute here. Have a good weekend!", "label": 0}
{"text": "Agreed 100% but had to add words because sub rules (Min 25)", "label": 0}
{"text": "Isn’t this weeks old news? NASA announced this schedule almost a month ago.", "label": 0}
{"text": "The country could very well survive without Boeing. \n\nMaking it public would be a financial disaster. Public workers have no incentive to be efficient.", "label": 0}
{"text": "How much can a space division cost Michael? Ten dollars?", "label": 0}
{"text": "I was gonna say: But think of the shareholders ! Although having satellites blow up in space and windows blowing off airplanes probably ain’t good for ShAREHoldEr ValUE neither.", "label": 0}
{"text": "SpaceX is literally the only choice and its out own fault, we let government contractors sit and collect on open contracts. Do stock buy backs, some \"R&D\" then tell us \"space hard, we need more money\" while doing nothing. Then when SpaceX came alomg and actually wanted to do space exploration. With modern science and engineering,  not projects revamped from the 70s. They blew all the old contractors out of the water. SpaceX is now atleast a decade ahead of anyone in the world,  when it comes to launching and launch vehicles. Anything else is literally just dream chasing and BS at this point. No one should be given contracts untill thier design is proven, no exceptions. Also stop falling for the BS from Boeing and other about \" competition\" its whining BS. Put out contractsa, takw the best idea and go with it. If that is SpaceX,  it is what it is.", "label": 0}
{"text": "“If I’m going to speculate “\n\n“I’m going to take a guess here”\n\n“I think it’s”\n\nNot->”im not going to speculate “", "label": 0}
{"text": "I have no other accounts, but it’s fun to come back to the drama. I’ve been on a plane the last 4 hours. Looks like many people agree with me. If New Glenn succeeds I’ll change my tune.", "label": 0}
{"text": "I don’t want to speculate either, but it’s almost certainly a xenomorph egg planted in the astronauts gastrointestinal system\n\nTrust me I have seen this before, I think it was a news broadcast they had in the cinema.\n\nPeople are awfully calm about the situation", "label": 0}
{"text": "They were all carried. The 2 feet to their stretchers", "label": 0}
{"text": "I don't follow your question.\n\nWhat do you mean by \"squander alot of budget on engineering\"?\n\nand what is the \"floundering\" and \"underperforming\" things you refer to?\n\nSpaceX and other private space companies absolutely need NASA to keep doing what it is doing. The government is basically the only client all these companies have.", "label": 0}
{"text": "To add more information to your comment, [this is the sort of thing NASA has to say](https://www.nasa.gov/news-release/seven-us-companies-collaborate-with-nasa-to-advance-space-capabilities/) about Starship and \"space stations\":\n\n> SpaceX is collaborating with NASA on an integrated low Earth orbit architecture to provide a growing portfolio of technology with near-term Dragon evolution and concurrent Starship development. This architecture includes Starship as a transportation and in-space low-Earth orbit destination element supported by Super Heavy, Dragon, and Starlink, and constituent capabilities including crew and cargo transportation, communications, and operational and ground support.\n\nThey may have made other vague pronouncements in the past. HOWEVER, their [actual plans for commercial space station partnerships](https://www.nasa.gov/humans-in-space/commercial-space/leo-economy/nasas-commercial-partners-continue-progress-on-new-space-stations/) don't officially have any collaboration with SpaceX, unless something's changed this year that I missed (which is possible, I'm pretty lukewarm on that aspect of space exploration right now).", "label": 0}
{"text": "You do know Boeing fired its CEO and the new one is trying to put out the flames. But the fire he’s trying to put out is really freaking big and will take a lot of time before any major changes are made.", "label": 0}
{"text": "Being hospitalized is not really concerning. Readjusting to gravity is taxing and expected", "label": 0}
{"text": "Terrible visuals, terrible presentation, a 5 year old could do better.", "label": 0}
{"text": "The conclusion isn’t wrong tho. NASA will always have use for zero gravity, but if the powers that be are serious about broadening access to space, they need to start looking into spin gravity.", "label": 0}
{"text": "No, it was a fixed contract. They have already been paid and would only be paid more for each mission delivered. Its also how SpaceX does it. Its fair and how it should always been done. Boeing just can't do that, they were designed to just suck money up. Boeing will default and should be fined, own money to SpaceX/NASA for the recovery. In reality they are selling thier stake in ULA to Jeffrey so he stips whinning and using his news paper as a weapon against American space interests. That will make him happy and the government can throw him sowm contracts here and there.", "label": 0}
{"text": "The Starliner was in development in the 90s btw.", "label": 0}
{"text": "What has NASA done lately?\nNASA's budget hasn't increased as a percentage of the total government expenditure, or inflation adjusted dollars for decades.\nhttps://en.m.wikipedia.org/wiki/Budget_of_NASA#/media/File%3ANASA_budget_linegraph_BH.PNG\nAlso, remember most of that money is directed to US aerospace companies like Boeing, Rockwell (which Boeing bought), and McDonnell Douglas (which Boeing merged with) under contract.\nSo that money goes to American companies, who create jobs, and fund research.", "label": 0}
{"text": "They would finally have something capable of orbit.", "label": 0}
{"text": "The design is bad, jts been discussed. The set up of the thrusters will always over heat. They need to resign fully , also its archaic compared to a SpaceX capsule. Maintenance its self is 3 times as much on a Starliner capsule for it just sitting in a warehouse", "label": 0}
{"text": "Excuse you,  stock buybacks come first..... oh that's right, they did that one... Hmm, have they thought of selling shares of stock?", "label": 0}
{"text": "Crew Dragon has 14 successful missions under its belt.", "label": 0}
{"text": "You posted the subheading, not the article's title.\n\n... and yet we all immediately knew ...", "label": 0}
{"text": "The plan was to alternate providers equally.\n\nSpaceX has completed 9 crewed ISS mission while Boeing accomplish at most one half. So they lapped them 9 times.", "label": 0}
{"text": "Show proof of that. Maybe Orion could be considered in development since the 90s, but I don't see any evidence of Starliner being in development since then.", "label": 0}
{"text": "“Successful splashdown..” As an engineer, it’s always interesting to see where other engineer’s “close enough” stands.", "label": 0}
{"text": "Guys I love space. Studied it a bit in school but man I get really depressed knowing that our sun will eventually turn to a red giant and consume us. Any tips for getting over this weird depression ", "label": 0}
{"text": "I *thought* it was old news. Thanks for verifying that.", "label": 0}
{"text": "government will block any sale and just keep propping them up.  this company is a train wreck the government refuse to let die.", "label": 0}
{"text": "We don't know if it will actually engulf the Earth or not, it seems to be about 50/50 as there are a lot of factors that go into it. But it will get very close.", "label": 0}
{"text": "That's gonna be a loooong time in the future. Either we'll have made it off the Earth by then or we'll be long extinct (actually a Chebyshev analysis gives us a very high probability that we'll be long extinct by then whatever we do)", "label": 0}
{"text": "That was over half a decade ago. Don't think I'm some ignorant oik. I spend most of my free time reading about and watching stuff on the universe. It's infinitely fascinating to me. NASA is the one making it all feel like work, like watching road works. Their pr is terrible. If they tried to instil the sense of amazement I feel, in the public, then their budget would go up, they'd be able to do more. All they've done is fill the skies with so much junk we might not even be able to leave soon. They keep showing us unending low earth orbit metal boxes. Yawn. *Another* person floating about in micro gravity. I'd rather read a book.", "label": 0}
{"text": "Just makes zero sense to say their planes or rockets didn't work but they made profit. Just not possible.", "label": 0}
{"text": "Huh. TIL.\n\nDoes it still? Why is that in the past tense?", "label": 0}
{"text": "You can see the video of the splashdown online, it was nominal with four parachutes fully deployed.", "label": 0}
{"text": "That should go to NASA directly. Fuck the middle men. Let the agency meant to do these things do them. Fuck billionaires and fuck our oligarchy.", "label": 0}
{"text": "Boeing talks about it in the 90s, when talking about replacing the Shuttle. Then shleved it. Its why the design is so bad, they just tried to paste new parts on an old design. We were there for it, you can Google it.", "label": 0}
{"text": "Then what did NASA do for almost a hundred years?!", "label": 0}
{"text": "It did go to NASA first. This is how NASA has always worked. Commercial Crew is a contract between NASA and commercial providers to transport crews to and from the ISS. There’s no middle man.", "label": 0}
{"text": "People at NASA said, NASA also said it would be safe to fly and return. Many at NASA were stuck in a sunken cost fallacy with Boeing. They didn't want ti admit they were done, now its obvious. Also to my point,  its doesn't matter unless they make it to space. They are not a comparison,  BO has no good designs, they are who is going to buy ULA and try to do something. Anything not reusable will never be viable so anyone,  working on anything else. Is just passing time till they fade tot he wind.", "label": 0}
{"text": "Hmm, til, still think it sucks.", "label": 0}
{"text": "It’s more of an engineering problem. To make something large enough  will require technologies we aren’t close to. To have an even inertial force on the body you need something huge. Then you have to have materials that can sustain those massive forces. Then you need to somehow build something that big and strong in space.", "label": 0}
{"text": "Isn't the term \"stable condition\" usually used for persons in intensive care whose condition is currently not deteriorating further? I hope that's not what they are implying here.", "label": 0}
{"text": "What we need is for so.eone in Boeing, a whistleblower for example, to come forward and tell Congress what is happening to stop them from succeeding. Oh wait, they're dead now. ", "label": 0}
{"text": "It would likely cost more to retrofit the capsule to make it commercially viable than to just start over with a new design. \n\nWay too many pieces of this thing is expended; service module and heat shield alone are going to be significant cost drivers especially if they’re subcontracted out which with Boeing *is* the case for the prop system and likely for the heat shield.", "label": 0}
{"text": "No, there is not, plus cost contracts are foe people who fall for them and design teams that don't have a real plan, just an idea. Fixed cost contracts should always be the go to, do the work on paper, estimate the experiments and design. Then if that works the next contract is production, this is how SpaceX does it and it works. That way the government is not on the hook and if one part fails , its not a total loss. In reality it leads to much better products and time tables. Just homding people accountable,  like any builder, if yoh don't do your research or give a underestimate,  that is on them.  Not the client", "label": 0}
{"text": "They are doing great, these are professionals", "label": 0}
{"text": "im not shooting anything.  im just observing with my eye.\n\nthe pic i posted is just a ref of what i see with my eye.  about a 95% ref.  almost the same", "label": 0}
{"text": "You are all over the place on this one.\n\nFirst, NASA thought it was ready. Issues came up, but they do think it was fixable. And Starliner did return safely.\n\nSecond, Starliner issues don't cost NASA anything more. Its a fixed price contract. The sunken cost is with Boeing. And they have to fly or pay back.\n\n\"Also to my point, its doesn't matter unless they make it to space.\"\n\nWho? Starliner made it to space. Are you talking about Blue Origin? They have been in space, but not in orbit. However, they are building an orbital vehicle and do have plans to do drastically more in orbit. Which is where Starliner comes in. If they want to achieve their future goals, they need to be able to get people to orbit. And BO doesn't have a human rated orbital capsule. So they would have to start from scratch, likely taking 5-10 years and costing a few billion dollars.\n\n\"They are not a comparison\"\n\nThere are literally 3 capsules in operation today throughout the ENTIRE PLANET. Starliner has gotten people into orbit safely. If Starliner were built in Russia or China, they would have already been using it to send people back and forth to orbit. Even NASA would have returned crew on Starliner had they not had the option of using Dragon. Blue Origin doesn't need a capsule as good or better than SpaceX's Dragon. They just need something to start with. \n\n\"Anything not reusable will never be viable so anyone\"\n\nStarliner is reusable.", "label": 0}
{"text": "Let's see your video. I presume you are at least older than 5?", "label": 0}
{"text": "No. It is a fairly generic medical term for someone not in critical condition. \n\nSource I am a doctor. ", "label": 0}
{"text": "Who do you think built the Apollo rockets? It wasn't NASA technicians.  They basically did exactly what they've done with SLS or Artemis.\n\nThey put out a contract and said we want this.  But they did it 60 years ago when the world and companies like Boeing were very different.\n\nIt wasn't NASA there turning the screws and welding the metal.  It was AeroDyne, Rockwell, Boeing, and numerous other now defunct and consolidated companies.\n\nWe had a healthy aerospace sector that kept each other in check. We don't have that anymore with Boeing and LockMart. We went from dozens to two. Now arguably New Space is working or replacing the dinosaurs, but Congress knows where they get their checks from so that change is slower than many of us would like.", "label": 0}
{"text": "“IT’S GAME OVER, MAN! GAME OVER!”\n\n“I say we nuke the entire site from orbit. It’s the only way to be sure.”", "label": 0}
{"text": "“I don’t know how any of this works and I feel very strongly about it!”", "label": 0}
{"text": "what kind of filter would this be?", "label": 0}
{"text": "Goernment agencies are inefficient. They don’t have to be. I would much prefer NASA leads us into space, but if commercial rockets are 10x cheaper, it won’t happen.", "label": 0}
{"text": "Oh I never said they were stranded. There always was enough seats to emergency egress.\n\nIt would have really screwed up launch tempo and future missions, but if there was an egress of the station I’m pretty sure we wouldn’t be worried about any future happenings as the station would be in a state that early de orbit would me on the table.", "label": 0}
{"text": "i dont know  its a 8 inch dobsonian   should be reflecting", "label": 0}
{"text": "whats your setup?   eyepieces ?  filters?", "label": 0}
{"text": "I only say because I know sometimes refracting telescopes make the light more scattered and rainbowy than reflecting.", "label": 0}
{"text": "thanks for your reply.  but what is a mark 1 eyeball and a mark2? xD\n\nsadly i would need to wait years to view jupiter in twilight", "label": 0}
{"text": "The governments sold their stake about 5 years after the crisis, so no.", "label": 0}
{"text": "Astronauts had a term for leaving the shuttle after a long time in space. Rebirth. Pretty self explanatory. In many different ways, gravity isnt an easy readjustment.", "label": 0}
{"text": "Thanks for the clarification.", "label": 0}
{"text": "Yes, this is more clickbait slop for uninformed redditors to happily choke down", "label": 0}
{"text": "Steve Jobs also had a [great disdain for these people](https://www.youtube.com/watch?v=P4VBqTViEx4).  They promote the sales and marketing people, but not the product and engineering people.\n\nI encourage watching the video, because he's very clear and concise.", "label": 0}
{"text": "They're referring mostly to [James McNerney](https://en.wikipedia.org/wiki/James_McNerney) and [Dave Calhoun,](https://en.wikipedia.org/wiki/Dave_Calhoun) both of whom were accountants. [Dennis Muilenburg](https://en.wikipedia.org/wiki/Dennis_Muilenburg) was an engineer. But he was only CEO for four years. He also wasn't a particularly good CEO.\n\nAn engineer or physicist doesn't automatically make a good CEO of an aerospace company. But an aerospace company should have an engineer or physicist as a CEO. It should be a prerequisite for the job. The person making major business decisions should have a basic understand of how aircraft and spacecraft and rockets work. The CEO needs to be focused on the actual products, instead of just focusing on stockholders and accounting.", "label": 0}
{"text": "You might need to pay someone to take that dumpster fire off their hands.", "label": 0}
{"text": "Yeah, not that rare for them to have after effects. The main scientific experiment of ISS and all space flight are the crews, the test subjects really. Everyone of them has ill health effects coming back to Earth, sometimes bigger sometimes smaller. In this case the lottery ticket seems to have fallen on \"bigger health effects\" on a case.\n\nThen again could be anything from \"lets put you in hospital ward under monitoring just in case\" to \"we have to start major treatments to stabilize the patient\".", "label": 0}
{"text": "Dave Calhoun caught the flack, but it was [James McNerney](https://en.wikipedia.org/wiki/James_McNerney) who was CEO during 787 Dreamliner and 737MAX.  His background?  B.S. in American Studies from Yale and M.B.A from Harvard.  No engineering background.", "label": 0}
{"text": "Sometimes takes time. Scott Kelly has good description about his nasty felling experience after his year long stay and it also didn't set off until few days after.\n\nhttps://www.thestar.com/news/insight/after-a-year-in-space-scott-kelly-s-legs-betray-the-mission-they-are-swollen/article_8b9a6faf-3fbd-59fd-a947-88e279cbc0d0.html", "label": 0}
{"text": "Oh... Okay, so you pulled that picture from somewhere else as an example or something. All right, so then everybody else is right, that you need to limit the amount of light getting into your telescope probably with some kind of diaphragm, which would serve to limit the light coming into your telescope, as well as collimating the light, which would result in a more focused image. But, there's a reasonable chance that your telescope came with some swappable eyepieces, which would perform the same action, if the telescope is focusing properly, but it's just blowing out when it comes out of the camera, goes through the lens of your eye, and then freaks out your retina. You've got physics and biology mixing together, so that's fun.\n\nAssuming that sunglasses won't fix the problem (which would be equivalent to an adjustment of a camera's f-stop by *a lot*), and you can't change the shutter speed of your eye because biology is a thing, then changing the aperture is really your best bet.", "label": 0}
{"text": "Oh man when I first read that I thought it read \"Boeing Explodes Something Something blah blah blah\" and I had to blink and rub my eyes until I saw what it really said, and thought, whew, that was a close one.", "label": 0}
{"text": "i just bought a neutral density filter set from aliexpress.  hope that helps.  next time i will try sunglasses too", "label": 0}
{"text": "I think that the union should demand that the growth of total compensation of management cannot outpace the growth of total compensation of the workers, and make it retroactive 20 years back.\n\n\nThe management has not earned the compensation it received and continues to receive.", "label": 0}
{"text": "\"Space is big. You just won't believe how vastly, hugely, mind-bogglingly big it is. I mean, you may think it's a long way down the road to the chemist's, but that's just peanuts to space.\"\n\n\\- Douglas Adams\n\nMr. Adams was of course right, but this video at least gives some sort of conception about how vastly hugely mind-bogglingly big space is.", "label": 0}
{"text": "u/TTT\\_L puts a ton of work into his videos and they are always exceptional. I am surprised he didn't post this to Reddit first.\n\nAlso, this was already posted on r/space yesterday.", "label": 0}
{"text": "Tbh. I'm excited  to see social media when aliens are just normality (not only fantasy).", "label": 0}
{"text": "*Dejected diamond miner that gave up meme*", "label": 0}
{"text": "When the whole Starliner test flight fiasco was happening, I postulated that Boeing would look to exist the space business, in whole or in part. Everyone was \"they are too important, they never would\".\n\nWell, this is the first step.\n\nThey have been trying to sell ULA for years now, with nobody really interested. Even with Vulcan getting certified despite recent dangerous launch failure - its a discardable launch vehicle at twice the price of even a Falcon 9.\n\nStarliner is a lemon. Fault after fault after fault - who would want to take that on? Its a liability, not an asset.\n\nSLS is an incredibly overpriced boondoggle that would find it difficult to launch once a year and is sustained on political corruption. Once Starship is launching once a week the call for it to be cancelled as not fit for purpose, with the money going elsewhere will become unignorable.\n\nEven the satellite business looks dodgy, with Intelsat 33e blowing up recently.\n\nWho is really placed to take that parts bin scrap off their hands, and why would they? The price would have to be extremely low, and the deal would need to be sweetened with something viable. Short of that they just let it die, with no investment etc.", "label": 0}
{"text": "Jeff Bezos actually likes to buy ancient space relics and put them on display like a museum at Blue Origin. \n\nHe could add them to the collection.", "label": 0}
{"text": "You miss the entire point of the commercial crew program", "label": 0}
{"text": "And then Jobs hand selected Tim Cook", "label": 0}
{"text": "Presumably their products worked when the engineers were in charge. Then the MBAs took over and spent multiple decades cutting \"costs\", reducing r&d, and pumping the stock price.\n\n\nThe product failures didn't happen until the fo.pany had been mismanaged for decades and they couldn't coast off the success of the 80s and 90s anymore.\n\n\nIt's really not a complicated idea if you're capable of thinking about casual links that last more than a few minutes, or have spent the slightest bit of time studying a technical field.", "label": 0}
{"text": "The problem is when the company is the size of Boeing.\n\nIt isn't just Boeing that is affected, you also have the the hundreds of suppliers based in the US who would also be catastrophically affected.\n\nHypothetically if Boeing were to fail and enter Administration, you would be taking upto a hundred of thousand job losses, 100's of smaller companies going out of business, for some small towns it would be the death knell for them.\n\nYou then have the national embrassment of one of the largest and oldest companies going boom.\n\nThis is why no Government, not just in the US, but around the world would not allow a company the size of Boeing to go under.", "label": 0}
{"text": "Scott jokes that Mark ran for Senate because Scott had a much better astronaut career.", "label": 0}
{"text": "Some things are universal, like numbers. Doesn't matter which planet/language you're on, everyone will agree on the 1 2 3.\n\nBinary means 0 and 1, I don't know how they chose to send the code, but if I were doing it. I would send out a burst to mean 1, and then I would send nothing for the same duration to mean 0. So if I fire the beam for 1 second on, one second off then 2 on one off, they could interpret it as me saying 10110 . And then maybe a long silence could mean the end of a sequence (like if they stop sending for a min then resume again)\n\nin the message they could send basic math so that the aliens would know this is an artificial signal, something to mean that 1+1 = 2 and it could look like this 0001 0001 0010.\n\nSome suggest even sending a list of prime numbers. Prime numbers will be prime numbers no matter where you're from.", "label": 0}
{"text": "We're making a not-unreasonable assumption that an ETI would be aware of binary.\n\nHow they decode a given bit-stream, deciding that it's a n x m array, for example, is another matter.\n\nHere's a nice paper about the Arecibo message of '74.\n\n[https://www.sciencedirect.com/science/article/abs/pii/0019103575901165](https://www.sciencedirect.com/science/article/abs/pii/0019103575901165)", "label": 0}
{"text": "You can't spin the ISS fast enough to produce artificial gravity without it falling apart and then nothing would be able to dock with it.", "label": 0}
{"text": "  \nWe decoded NASA’s messages to aliens by hand\n\n[https://www.youtube.com/watch?v=RRuovINxpPc](https://www.youtube.com/watch?v=RRuovINxpPc)\n\n\n\n>What is the purpose of sending the binary code to the exoplanets?\n\n\"purpose\" might not be the right word since the ETs phone won't ring for 25,000 years.. and it will be another 25,000 for the \"hello?\" to come back.\n\n\n\n  \n[https://en.wikipedia.org/wiki/Arecibo\\_message](https://en.wikipedia.org/wiki/Arecibo_message)\n\nThe message was aimed at the current location of M13, about 25,000 [light years](https://en.wikipedia.org/wiki/Light_year) from Earth, because M13 was a large and relatively close collection of stars that was available in the sky at the time and place of the ceremony.[^(\\[4\\])](https://en.wikipedia.org/wiki/Arecibo_message#cite_note-4) When correctly translated into graphics, characters, and spaces, the 1,679 bits of data contained within the message form the image shown here.[^(\\[5\\])](https://en.wikipedia.org/wiki/Arecibo_message#cite_note-cassiday-5)\n\n\n\n>if so, how would they know how to translate binary code?\n\nwe use hydrogen as the \"decoder ring\" -  ET must know about hydrogen.\n\nonce you can establish \"1\" you're good to go \n\n\n\n  \n[https://en.wikipedia.org/wiki/Pioneer\\_plaque#Symbolism](https://en.wikipedia.org/wiki/Pioneer_plaque#Symbolism)\n\nAt the top left of the plaque is a schematic representation of the [hyperfine transition](https://en.wikipedia.org/wiki/Hyperfine_transition) of [hydrogen](https://en.wikipedia.org/wiki/Hydrogen), which is the [most abundant element](https://en.wikipedia.org/wiki/Abundance_of_the_chemical_elements) in the [universe](https://en.wikipedia.org/wiki/Universe). The [spin-flip transition of a hydrogen atom's electron](https://en.wikipedia.org/wiki/Hydrogen_line) has a [frequency](https://en.wikipedia.org/wiki/Frequency) of about 1420.405 [MHz](https://en.wikipedia.org/wiki/Hertz), which corresponds to a [period](https://en.wikipedia.org/wiki/Frequency#Period_versus_frequency) of 0.704 [ns](https://en.wikipedia.org/wiki/Nanosecond). Light at this frequency has a vacuum [wavelength](https://en.wikipedia.org/wiki/Wavelength) of 21.106 centimetres (8.309 in) (which is also the distance the light travels in that time period). Below the symbol, the small vertical line—**representing the** [**binary**](https://en.wikipedia.org/wiki/Binary_numeral_system) **digit 1**—specifies a unit of length (21 cm) as well as a unit of time (0.7 ns). Both units are used as measurements in the other symbols.[^(\\[6\\])](https://en.wikipedia.org/wiki/Pioneer_plaque#cite_note-Rosenthal2016-6)", "label": 0}
{"text": "The act of turning either a written word or spoken phrase into a radio signal requires encoding.  At the barest minimum - sending pulses radio energy as Morse code is - well - code.", "label": 0}
{"text": "Binary code isn't really something humans invented. It's just the mathematically simplest possible form of information. Mathematics works the same everywhere in the universe.\n\nWith on/off pulses you can represent everything from the digits of π (which are also the same everywhere in the universe, 11.0010010000111111...) to images (black and white obviously, and colour without much more complexity).", "label": 0}
{"text": "I had forgottten about that fact, thanks friend", "label": 0}
{"text": "Lol what? So people who have some Boeing in a mutual fund or index fund just get robbed? How do people actually think like this.", "label": 0}
{"text": "Does NASA have a plan in the event of a medical emergency on the ISS?  If so, have they ever had to implement it?", "label": 0}
{"text": "We can decode any math base using our current tech (binary, octal, deci, hexa...) so anyone smarter than us would detect immediately what to do with such a data stream.", "label": 0}
{"text": "NASA and SpaceX have both said the reentry, splashdown, and recovery were all normal.", "label": 0}
{"text": "They're assuming that aliens are clever enough to decode a basic binary signal. There's only so many combinations of one and zero, and if they have powerful AIs crunching the numbers it's likely they could decode it rather quickly.", "label": 0}
{"text": "haha, that's great.  And apparently comments less than 25 characters aren't allowed. So, I wrote that to fill the quota.", "label": 0}
{"text": "Maybe it has to go with readjustment to gravity?", "label": 0}
{"text": "Wats that book scientology propaganda from what I understand now wich makes me more confused about scientology still not interested it's a good book thou think there was a movie Jhon tervolta may have hold on Google battle field earth any way some the aliens used different math ie non decimal I think they do it to obscure some of there scientific breakthroughs but regardless I don't think binary or PC Morse code is necessarily universal I mean I'm unaware of alternative methods but is silicon based life is a possibility why not some exotic math just looked it up crazy options I mean octal [to who knows ](https://en.m.wikipedia.org/wiki/List_of_numeral_systems)", "label": 0}
{"text": "> plus cost contracts are foe people who fall for them and design teams that don't have a real plan, just an idea. \n\nNo. They’re for when the government wants a product that nobody makes, and that nobody has much interest in making, unless it’s paid for up front. Or when the government doesn’t know exactly what they need made because they’re a bit of a unique customer. \n\nWithout them, the best you’ll get is organizations bidding, starting work, and then failing to deliver, while taking up the physical space (or the contact space) that would be needed by a more competent organization. \n\nEssentially, doing it that way results in the government not getting what they want, even if they don’t get charged in the process. They still don’t get the needed capability.", "label": 0}
{"text": "Who wants to tell them that splashdown wasn't in the Atlantic Ocean, lmfao", "label": 0}
{"text": "So Yahoo, then? I am so excited for Yahoo!Space.", "label": 0}
{"text": "Yeah, I mostly just fucking dislike major corporations.", "label": 0}
{"text": "And also how *empty* it is. \n\nI was fooling around with the math the other night. If you took all the matter in the universe, every bit of every star, planet, asteroid, etc, and crammed it all into one corner of just the known universe, if you imagined this universe as a giant six-sided television cube, then all of that matter would be in a single pixel down at the bottom corner... and the cube would be right about five miles wide on each side.\n\nThat's a big TV.", "label": 0}
{"text": "In addition to what others have said, I think what some people might not think about is that literally every other way of communicating would be more complex. Binary is the simplest method. English wouldn't make any sense, video or audio would require more advanced understanding to decode, text would be in binary anyways.", "label": 0}
{"text": ">We're making a not-unreasonable assumption that an ETI would be aware of binary.\n\nAssuming not-unreasonable is a long way of saying reasonable, then I completely disagree. Binary is just way to count. It's a base 2 number system and certainly would be recognizable to any civilization that could receive a message. It also also the simplest way to encode logic. It's a universal as Physics.", "label": 0}
{"text": "?\n\nWe're agreeing.\n\n*\"Assuming not-unreasonable is a long way of saying reasonable, then I completely disagree\"*\n\nSo you think that the choice of binary is *un*reasonable?", "label": 0}
{"text": "Their bodies are not adjusted to gravity.", "label": 0}
{"text": "It's possible to be ignorant of facts and data without being confused or stupid.", "label": 0}
{"text": "How could a company buy Starliner without getting the facilities that build it. Boeing would have to sell whatever facility builds it along with whatever products are built at that facility.", "label": 0}
{"text": "NASA's budget has been less than 1% of the US budget since 1993, and has only continued to drop since then. You're either a liar or just a dumbass that regurgitates every lie you hear", "label": 0}
{"text": "Literally yes. It happened a few years ago with GM. People lost money. Those who profit from illegal and unethical business practices should face the losses that result from those practices.", "label": 0}
{"text": "Yeah, but there’s still the $250 million set aside for Boeing that they can’t claim yet due to not hitting their goals. Someone else could take it.", "label": 0}
{"text": "That's corporate America for you. Prioritizing short term quarterly gains.\n\nGotta hit thous profit goals so they get their bonus.", "label": 0}
{"text": "Nah, they brought something from space, definitely.\n\nOne will become Stretch Armstrong, one will be invisible to society, one dumb as a rock, and one will self-immolate at will.", "label": 0}
{"text": "I’ve never heard that we’ve sent signals to space, but I guess we have. I assume there must be another ”layer” of encoding on top of the binary to give the message meaning — a key of some kind. I don’t really have the right vocabulary for this, so please bear with me. A string of 1s and 0s in itself means nothing. You need a way to interpret it. All digital information is binary 1s and 0s, but there’s a key that says this particular string of 1s and 0s means a particular letter or number, and a different string translates to a different letter. And once you decode enough letters, language is the next layer of encoding that says these letters in this order is a word with a particular meaning. And these words in this order are a sentence. And so on. So what message did they send, and how is the key provided so that the aliens can turn the 1s and 0s into something that means something? Or did they just send some dots and dashes that don’t really say anything other than signaling that here’s a non-natural signal, and it means somebody is here?", "label": 0}
{"text": "I mostly like what SpaceX does, but they really need to get a new leader. You can't have the CEO of a company contracting billions with defense and other export-controlled technologies be joking about killing the President and talking to Putin.", "label": 0}
{"text": "I think it was when they couldn't get them OFF the space station.\n\nBut yes. Journalists are the worst these days.", "label": 0}
{"text": "This article was punished last Thursday so even the article is old. OP is just karma farming off old articles", "label": 0}
{"text": "we're living in the quantum realm ourselves eh?", "label": 0}
{"text": "How did the study of the environmental impact of mega constellations of satellites become the task of the Federal **Communications** Commission? We see so many \"concerns\" by scientists about aluminum in satellites burning up in the atmosphere, but not a single numerical estimate. Maybe if scientists get distracted from writing journalistic articles for a second and start doing, well, science, maybe this situation will shift?", "label": 0}
{"text": "They may not know how to decode it but it would be evident that it's a civilization sending the message and not some pulsar far off. Also, they would also be able to tell where it came from.", "label": 0}
{"text": "It’s been a long time since I’ve lugged mine outside. I have the Newtonian mount and everything is so heavy. I have a 9mm and larger mm that came with the Orion set up. I purchased a larger FOV with less mag that allows me to see a larger part of the sky. I love that for things like Pleiades. I also have a 2x Barlow although it’s finicky. I can’t seat it down fully and still get all my EP to focus, but it works. I just have a moon filter. Nothing fancy. \n\nI’ll tell you what though, I’ve never had luck getting a photo through the EP with my phone. Hard to get the light to hit the lends right and not disappear with the slightest movement. The photos I do get aren’t that crisp. The view through the EP is decent though. I’ve never noticed Jupiter be blown out like that at any mag without a filter.", "label": 0}
{"text": "The FCC doesn’t regulate China. They do regulate Starlink.", "label": 0}
{"text": "I will admit I misunderstood your original comment as suggesting the company be force nationalized now before bankruptcy with no compensation given to stakeholders. If the company actually goes bankrupt and needs a bailout then absolutely shareholders should get nothing.", "label": 0}
{"text": "Just the second launch tower for Artemis will cost more than they gave SpaceX for developing a crew vehicle: [https://arstechnica.com/space/2024/08/nasas-second-large-launch-tower-has-gotten-stupidly-expensive/](https://arstechnica.com/space/2024/08/nasas-second-large-launch-tower-has-gotten-stupidly-expensive/)", "label": 0}
{"text": "They also want to abolish lightbulbs lol\n\nNo, but I understand the sentiments that light pollution is up looking at the stars, but if anything, we should be creating a new technology of light that reduces the amount of light pollution", "label": 0}
{"text": "One of them didn't do their daily exercises.", "label": 0}
{"text": "Except the part where somebody got hurt. If your technology works great and still fails to do its job, it’s a design problem.", "label": 0}
{"text": "Should be pointed out too that the landing went perfectly fine. Had the astronauts been aboard they would’ve been fine. Obviously easy to say with hindsight but it shows the Starliner is a capable spacecraft with an unfortunate set of teething issues.", "label": 0}
{"text": "Tim Cook has a degree in Industrial engineering for undergrad", "label": 0}
{"text": "understands Musk is no longer the same guy as he was 10 years ago, he has changed, you can't continue defending him for what he did in the past, SpaceX is incredible and he will be remembered for what he did, but he has become a burden for the company and I hope that Shotwell and the board of directors force him to resign.", "label": 0}
{"text": "Yes I understand than. my point was China is the one who is starting from scratch so astronomers need to work with them. Statlink its to late. We are stuck with the current 6500 sats. If it wants to make change for the better its best to go after China right now. The first sats china has launched are hitting 5-6mag", "label": 0}
{"text": ">  I would go to the emergency room, but no one at the hospital will have seen symptoms of having been in space for a year. I crawl back into bed, trying to find a way to lie down without touching my rash.\n\nWeird that he wouldn't have a NASA team of doctors literally on call or even living with him.", "label": 0}
{"text": "[Alpha Station](https://m.youtube.com/watch?v=u0FX8sd1uVo&pp=ygUiY2l0eSBvZiBhIHRob3VzYW5kIHBsYW5ldHMgb3BlbmluZw%3D%3D)", "label": 0}
{"text": "Progress has been made on developing inflatable habitats/modules and could prove to be a valuable technology given SpaceX's own vehicle development.", "label": 0}
{"text": "https://www.gao.gov/products/gao-23-105005\n\nGAO says it’s in their purview, and that they may have incorrectly exempted satellite constellations from that review. ", "label": 0}
{"text": "I think a updated Hubel telescope would be the best option, put it in orbit above the starlink satalites, china, and amazon are going to put up their version of starlink....", "label": 0}
{"text": "I have met some of the researchers doing those eye studies!", "label": 0}
{"text": "You don't need new tech, all you need is proper shielding so light goes down and not up.", "label": 0}
{"text": "There needs to be a worldwide controlling agency for orbital insertions.  Every rich billionaire wants to put their 40,000 satellites into orbit without account for anything.", "label": 0}
{"text": "You can see who signed here, lot of Princeton and Columbia https://pirg.org/edfund/wp-content/uploads/2024/10/PIRG-Satellite-Letter-to-FCC-from-100-researchers.pdf", "label": 0}
{"text": "From what I understand, hospital visits were fairly standard.\n\nLess standard is one of the four were kept in hospital.", "label": 0}
{"text": "We don't know if the \"hurt\" was landing related, or something else (like an unexpected longer term stay in micro gravity).", "label": 0}
{"text": "For the same reason we have an Army and a Navy. Different sets of responsibilities that sometimes overlap in spots. ", "label": 0}
{"text": "I never said there aren't taxpayer losses, I'm arguing that they're separate and no longer increasing, and that claiming that the Boeing losses in the headline count towards those losses is incorrect.", "label": 0}
{"text": "There's no indication the medical concern has anything to with the performance of the vehicle. All kinds of stuff can happen to astronauts' bodies after months in zero g which can cause complications on reentry/landing.", "label": 0}
{"text": "They have had decades to study this issue and decided not to because they didn't think these constellations would ever happen. The window to stop them has closed. The truth is that the millions of people now receiving cost effective high speed internet who couldn't before now outweighs these other issues in the eyes of most\n\nEven if they did manage to halt SpaceX launches its not going to stop any of the non-US launches. China's planned 14,000 satellite constellation has already started launching without any of the brightness mitigation features SpaceX has applied. What they need to do is push for an international regulatory regime for these things but they aren't", "label": 0}
{"text": "That has nothing to do with NASA. That has entirely to do with the US Federal governement.", "label": 0}
{"text": "Investigating WSJ for the report? Investigating whether the report has merit? Or investigating Musk for his communications with Putin?\n\nWho is the editor? Can’t the headline be a bit clearer?", "label": 0}
{"text": "There's a difference between astronomers and \"astronomers\". Let's not confuse the two", "label": 0}
{"text": "1. Hubble is already above all Starlink satellites.  \n  \n2. James Webb Space Telescope is in many ways an \"updated Hubble telescope\" (yeah I know it's an IR telescope, not a visible light telescope). It is at a higher altitude than the Moon, also placing it above Starlink satellites.", "label": 0}
{"text": "A proposal to fix Hubble and boost its orbit has [already](https://en.wikipedia.org/wiki/Polaris_program#Mission_II) been made, but NASA is not yet willing to allow any risk of working with it.", "label": 0}
{"text": "So... maybe they are exactly what OP says. \"Privates\".", "label": 0}
{"text": "If you want to change the world, yes, do what Elon does, but if you want to make a boatload of money... well, it's also Elon who's made the most money...", "label": 0}
{"text": "Use all the stuff these private companies built.", "label": 0}
{"text": "I love this idea that Shotwell is more important than Musk. It's just so out there.", "label": 0}
{"text": "The difference is 2 weeks, and the mission was significantly shorter than other missions have been. Being in microgravity for months can cause complications regardless of any changes in mission duration. The delay is most likely not a determining factor in whether there are complications from reacclimatizing to gravity.", "label": 0}
{"text": "No other aerospace company will touch Starliner with a ten foot pole, let alone pay good money for it.\n\nThe part of ULA they want to sell actually has a solid line of business doing satellite launches for DoD. The question there is whether a buyer thinks the ULA cost structure can be competitive with SpaceX and maybe the Blue Origin New Glenn rocket when that contract is up for recompete in five years. \n\nAs I write, Boeing is planning to keep their piece of the SLS program.", "label": 0}
{"text": "That's gonna be a tough sell given the amount of defense contracting ULA does.", "label": 0}
{"text": "Maybe Sierra Space\n\nhttps://www.reuters.com/business/aerospace-defense/boeing-lockheed-martin-talks-sell-ula-sierra-space-2024-08-16/", "label": 0}
{"text": "Boeing just can't get a break lately.", "label": 0}
{"text": "It's a great idea that will unfortunately never work. The entire world isn't going to agree on a single governing body for literally anything. Our sky is destined to be polluted with several mega-constellations.", "label": 0}
{"text": "Hell yeah triples of the Nova\n\nHopin that Barracuda deal pulls through", "label": 0}
{"text": "Hubble is out dated and several systems have failed on it. Its nearing eol", "label": 0}
{"text": "Nasa's more trusted commercial partner; the Putin conformant?", "label": 0}
{"text": "Jim Collins & Jerry Porras keep striking out as time progresses", "label": 0}
{"text": "What head start? SpaceX is already doing it. I get you might mean give themselves a head start, but realistically just buying such a project and expect to make it work is fantasy.", "label": 0}
{"text": "Acronyms, initialisms, abbreviations, contractions, and other phrases which expand to something larger, that I've seen in this thread:\n\n|Fewer Letters|More Letters|\n|-------|---------|---|\n|[FAA](/r/Space/comments/1gc70ar/stub/ltrpm7g \"Last usage\")|Federal Aviation Administration|\n|[FCC](/r/Space/comments/1gc70ar/stub/ltrpm7g \"Last usage\")|Federal Communications Commission|\n| |(Iron/steel) [Face-Centered Cubic](https://en.wikipedia.org/wiki/Allotropes_of_iron) crystalline structure|\n|[GAO](/r/Space/comments/1gc70ar/stub/ltrlf75 \"Last usage\")|(US) Government Accountability Office|\n\n|Jargon|Definition|\n|-------|---------|---|\n|[Starlink](/r/Space/comments/1gc70ar/stub/ltro8bp \"Last usage\")|SpaceX's world-wide satellite broadband constellation|\n\n**NOTE**: Decronym for Reddit is no longer supported, and Decronym has moved to Lemmy; requests for support and new installations should be directed to the Contact address below.\n\n----------------\n^([Thread #10740 for this sub, first seen 25th Oct 2024, 23:52]) \n^[[FAQ]](http://decronym.xyz/) [^([Full list])](http://decronym.xyz/acronyms/Space) [^[Contact]](https://hachyderm.io/@Two9A) [^([Source code])](https://gistdotgithubdotcom/Two9A/1d976f9b7441694162c8)", "label": 0}
{"text": "you're referring to the inflationary epoch a fraction of a second after the Big Bang, not the Big Bang itself", "label": 0}
{"text": "Imagine starship with a hubble built inside and the nose cone flips over 180 on itself.... Starship can then come back to earth and get caught on the tower for service/upgrades and maintenance and then relaunch......", "label": 0}
{"text": "What could possibly be t(he)reason behind this questionable behavior?", "label": 0}
{"text": "https://en.wikipedia.org/wiki/Big_Bang\n\nNo I'm not...", "label": 0}
{"text": "Right? Cats out of the bag now. 120 astronomers trying to prevent over 4 million people from getting their internet access…", "label": 0}
{"text": "I'm surprised more aren't hospitalized tbh. Hope they're okay but it can't be easy spending so long being weightless to feeling like there's 150 pounds weighing on your entire body.", "label": 0}
{"text": "Or, maybe they were a bit skittish about becoming the online targets of Musk's completely rational fans...", "label": 0}
{"text": "Usually it's just a medical check on the boat, again on the plane back to Houston, and outpatient care at JSC. Hospital care is unusual, usually it's straight from the helo off the boat to the NASA jet home.\n\nProbably just too the helo straight to the hospital and just checked them all out since they were there, keeping the one who had the issue.", "label": 0}
{"text": "NASA has never built a crewed spacecraft. They hire companies and tell them what they want. The only difference with commercial crew was that they were intentionally less involved and gave broader specifications, basically allowing the companies to do it how they saw fit (or at least moreso than in the past).", "label": 0}
{"text": "Ya.  It was mainly meant in jest.  I make computers talk to each other.  These guys are sending people to space and back.  These folks undoubtedly have literally every aspect of their life more together than I do.", "label": 0}
{"text": "Or that they took the helicopter off the boat straight to the hospital instead of to the airfield with the NASA jet.", "label": 0}
{"text": "Thank you very much, I'm hoping to make an even better one in the future with a lot more data :)", "label": 0}
{"text": "sooooo boeing puts then? Lol\n\n  \nI mean, it's ... probably a good time to buy the stock. It's close to its 52-week low. Idk I'm nervous", "label": 0}
{"text": "What if Starlink is able to mess up the worldwide network of radio telescopes that we link together? Need a big Starship to put that into orbit.\n\nAnd you’re right in that Starship is poised to make access to space much easier, *however*, Starship is not guaranteed to work or to be as cost-effective as it might seem, and the costs of bespoke projects are often not down to the launch. Look at JWST - $10bn (granted, over 25 years) and the Ariane 5 it launched on cost like $200m.", "label": 0}
{"text": "We're going to turn our orbital space into a no-fly zone and destroy any form of ground-based astronomy.", "label": 0}
{"text": "I admit the possibility (probability) that this is idiotic, but I wonder if it be possible to take a number of custom starships rigged for long term habitation, connect them in a large circle with docking tubes, and spin the whole thing for artificial gravity. Would be able to divide each one into floors lengthwise to maximize useful volume.\n\nI recognize that if possible this would be a wildly complex engineering problem and that a lot could go horribly wrong with it, but a dozen starships would get you a station fit for hundreds of people and that avoids at least some of the health issues of being in space. Of course, might be safer just to purpose build a ring station in space using segments delivered  by starship.", "label": 0}
{"text": "Starship will allow us to launch gigantic space telescopes that will be much better than telescopes on the ground.", "label": 0}
{"text": "collect your five rubles ivan, and get back to work", "label": 0}
{"text": "Space telescopes are really expensive, and this would require enormous investments in astronomy that we don't currently have. The launch is not even close to the biggest expense involved.", "label": 0}
{"text": "Yes.\n\nRussia is a hostile nation, and Musk has access secret intelligence.", "label": 0}
{"text": "Ahhh, the fine aroma of musk's farts must be so intoxicating", "label": 0}
{"text": "Look at it this way. There are really only two reasonable outcomes. Either humanity will have killed itself long, long, long before the Sun in its red giatn phase consuming the Earth is relevant or humanity will have been a technological civilization for a billion years and will be so advanced that they will be able to avoid being doomed by the Sun (likely by just going elsewhere, but there are a zillion other potential options).", "label": 0}
{"text": "When I worked unclassified projects near people who worked classified projects, it became possible to make educated guesses about the classified projects because of what they were interested in on the unclassified projects we worked. \n\nI was told very kindly and firmly (by a very competent manager who also had a lot of intellectual curiosity) that the best course of action was to never speculate out loud.", "label": 0}
{"text": "Saddest thing is looking at Apollo era engineers blueprints for all the reusable rockets, or Wernher von Braun ferry rocket, and seeing SLS in 2024, being weaker and costing more than Saturn V.\n\nFalcon 9 should have existed in 1980s, and Starship in 1990s. NASA ineptitude and corruption denied an entire generation exploration of space.", "label": 0}
{"text": "But they wouldn’t say it’s normal", "label": 0}
{"text": ":( my mother recently passed away and the beach from \"contact\" was a special scene for us. I want to go there. That bad?", "label": 0}
{"text": "I'm a shocking twist it was revealed that during the astronauts time in space, the were at one point attacked by an alien organism that latched onto their face... But eventually it came off of its own. This is just a follow up to be safe.", "label": 0}
{"text": "I don’t think this is ULA. It’s Boeing itself which has   Starliner, ISS operations, satellites, etc.", "label": 0}
{"text": "Thank you for pointing this out. Sometimes people just beat themselves up over this", "label": 0}
{"text": ">It's the same thing with the lawsuits against launches at Mar A Lago.\n\nI assure you there has never been an orbital launch of any kind from Mar A Lago.", "label": 0}
{"text": "I’m talking about a single governing body. Agreeing on a set of standards isn’t the same thing as a governing body. And the FAA also doesn’t set those standards, by the way. ICAO does. \n\nTo enforce what can and can’t be put into orbit would require giving a single agency worldwide power to enforce the airspace of space. There is no such equivalent in aviation. Neither the FAA nor ICAO has the power to enforce airspace worldwide. \n\nThe most realistic scenario is an international treaty, but again, good luck getting every nation to sign the treaty.", "label": 0}
{"text": "https://gizmodo.com/nasa-freezes-starliner-missions-after-boeing-leaves-astronauts-stranded-2000512963\n\nThe missions are frozen. It's starting to look like all of that $4.2 billion might be gone forever. That's a 100% taxpayer loss. None of that money will ever be recouped. They've turned Boeing into Solyndra now.\n\nSo much money has already gone down the tubes that any sane person would have pulled the plug a long time ago but because the money came from taxpayers under the guise of \"government funding\" all the warning signs have been ignored.", "label": 0}
{"text": "Aren’t jokes supposed to be funny?", "label": 0}
{"text": "The FAA is an agency of the U.S. federal government.  It has zero jurisdiction over foreign carriers outside U.S. airspace.", "label": 0}
{"text": "This is outrageous! *Proceeds to not read article after only looking at the headline…*", "label": 0}
{"text": "Awesome! Thanks! This stuff never gets old.", "label": 0}
{"text": "There could be legislation to reduce amount of aluminum in satellites, but it's going to massively favor SpaceX, as they can afford to have heavier spacecrafts. There is no real reason to ban all satellites, just particles that deplete ozone layer. SpaceX already has insanely well engineered and cheap satellites, so replacing aluminum with steel or other metal would not bother them, especially when Starship starts launching.", "label": 0}
{"text": "The reporter included a link to the referenced letter.\n\nThe letter contains the names and affiliations of the signatories.\n\nIt's right there if you had cared to look.", "label": 0}
{"text": "Not a problem - see how hard it is for the same species to communicate!\n\nNow imagining having to decode a random prime x prime bitstream and try to make sense of it!\n\nTruly a problem to make one twist one's tentacles with vexation!", "label": 0}
{"text": "The full document is linked right there in the posted article.", "label": 0}
{"text": "Is supply chain management considered sales, or marketing?", "label": 0}
{"text": "Maybe not that, but you can put hundreds or possibly thousands of telescopes much bigger than Hubble, for the price of Hubble, when Starship can launch cargo. SpaceX or some other company could rent time on the telescopes for profit to governments and private people. Government would save a lot of money on observation, and private citizens would have access to highest grade of space telescopes for less than it cost to get a decent hobbyist telescope.\n\nCurrently, chances of you getting time on Hubble or JWST are so minimal, it does not rly matter that it's free. Most people would be willing to pay some extra to get guaranteed access to it.", "label": 0}
{"text": "You're still missing the point. The headline of this article is talking about the $1.85 billion that Boeing have spent separate from the money they received from the contract.\n\nYou called those taxpayer losses, but they are not.\n\nAs an aside, Boeing have not been paid the full contract value. The contract is milestone based, and each operational flight had a completion payment of $0.36 billion, for a total of about $2.2 billion that has not yet been paid to Boeing. \n\nYou should be far more upset about the $2.6 billion that Boeing gets every single year for SLS than the $2 billion for Starliner spread out over the last decade.", "label": 0}
{"text": "Sorry. But this is silliness. Just stacking images eliminates mosntvissies", "label": 0}
{"text": "The math works the same for everyone in the universe, but the interpretation doesn’t. You can only use binary to represent an image, for example, if the receiver knows that (and how) it represents an image. The question then is, how was the message chosen to maximize the chances that the receivers will be able to figure out what it’s supposed to be.", "label": 0}
{"text": "2 months could cause some issues. Microgravity is pretty tough on your body", "label": 0}
{"text": "> Maybe not that, but you can put hundreds or possibly thousands of telescopes much bigger than Hubble, for the price of Hubble, when Starship can launch cargo.\n\nLaunch costs are not why space telescopes are expensive.  Never has been.\n\nStarship isn't a panacea", "label": 0}
{"text": "Google is fucked-up nowadays. It gives personalized search results, leaning towards the social media personalized content algorithms.", "label": 0}
{"text": "SpaceX has already come up with an automated system that allows radio telescopes to operate and provide Internet at the [same time](https://uk.pcmag.com/networking/153839/starlink-is-coming-to-radio-quiet-zones-in-the-us). The Starlink satellites don't point the radio beams directly at the telescopes and turn off when the radio telescopes are looking in their direction, which keeps radio noise down to an acceptable level.\n\n>Need a big Starship to put that into orbit.\n\nRadio telescopes are larger than optical ones but they can be built from [mesh](https://en.wikipedia.org/wiki/Faraday_cage) and require dish precision in millimeters instead of microns, so can easily be made unfoldable.", "label": 0}
{"text": "Amazing footage!\n\n\nThe Sun is really something out of this world...", "label": 0}
{"text": "could also be addrenaline wearing off maybe?", "label": 0}
{"text": "Man, those suits look stiff. Strong lass there doj g so much of the heavy lifting.", "label": 0}
{"text": ">the costs of bespoke projects are often not down to the launch.\n\nIsn't a lot of the cost due to having to develop technologies with weight saving and miniaturisation in mind. You wouldn't really need that with starship no?", "label": 0}
{"text": "Yeah future Starship-launched telescopes are going to be awesome. You could get even larger with a folding JWST design too.", "label": 0}
{"text": "You don't need to be \\*that\\* close to Cape Canaveral to see a launch. You could see Space Shuttle launches from my family's backyard in Orlando if there weren't too many clouds.\n\nOf course, it's a lot more impressive the closer you get.", "label": 0}
{"text": "Light has an unpleasant property to reflect when it strikes opaque materials...", "label": 0}
{"text": "In other words, recycling forty year old hardware and then throwing it into the ocean shouldn't qualify either.", "label": 0}
{"text": "The WSJ article is paywalled, but the only fact they were reporting about was about a single call with Putin, in which they talked rockets and Putin asking to not enable Starlink over Taiwan, which SpaceX can't even choose to enable because of local Taiwanese law.\n\nDoD knew about the call and was listening to it, and did not found any reason to revoke Elon's security clearance. Elon also donated 80 million worth of Starlink terminals and subscriptions to Ukraine, and 0 to Russia.\n\nIt's a shame people just read the headlines of WSJ article and read a highly speculative article and treat it as truth.", "label": 0}
{"text": "I believe a Boeing satellite in Geosynchronous orbit just exploded, we are stopping them too right???", "label": 0}
{"text": "A finless Starship with the fuel tanks converted into living space.  ISS replacement in one launch.", "label": 0}
{"text": "I mean, they all were. They're all getting pulled out, barely standing, and sitting on a wheel chair. They all looked the same to me.", "label": 0}
{"text": "> some space telescopes are expensive because of needed weight savings or restrictions on size\n\nVery very very few.\n\nMass constraints are not why they're expensive.    \n\nTESS was $200M and less than half a ton....that Falcon 9 could have launched 10x the mass to the same trajectory.\n\nIf it was cheaper to make a TESS that was 10x heavier......they would have done that.", "label": 0}
{"text": "How much money did the previous CEOs make to ruin Boeing?", "label": 0}
{"text": "Putting all these satellites into LEO is incredibly dangerous in the long run. The collision risk increases dramatically. Once a few collide, the resulting thousands of bits of debris from each collision will potentially destroy everything in LEO.", "label": 0}
{"text": "wtf are you talking about? \"I dislike major corporations, why can't the government do it\" \nWe have a genius at work here.", "label": 0}
{"text": "Ground telescopes get more science done than space telescopes due to the sheer number of ground telescopes. Adding a few more space telescopes and negating all ground telescopes destroys astronomy.", "label": 0}
{"text": "Hello u/New-Farm-9256, your submission \"Solar System Poster\" has been removed from r/space because:\n\n* Such questions should be asked in the [\"All space questions\" thread](https://www.reddit.com/r/space/about/sticky) stickied at the top of the sub.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "That would be news to me, considering my PhD advisor along with several other astronomers I know are listed [on the letter](https://pirg.org/edfund/wp-content/uploads/2024/10/PIRG-Satellite-Letter-to-FCC-from-100-researchers.pdf) that is directly hyperlinked in the article.", "label": 0}
{"text": "Hello u/Mashmello06, your submission \"Can magnetic fields (that of MRI) be used to propel rockets?\" has been removed from r/space because:\n\n* Such questions should be asked in the [\"All space questions\" thread](https://www.reddit.com/r/space/about/sticky) stickied at the top of the sub.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "Every...EVERY thread about Starlink has people saying 'Just launch cheap space telescopes on Starship\" as if launch costs or up-mass have been the problem forever.\n\nThey're not.\n\nThat's not 'doomsaying'.  That's the reality check massive Starship enthusiasts need on the basics of spaceflight.", "label": 0}
{"text": "One new Hubble telescope doesn't make up for losing tons of ground-based telescopes.", "label": 0}
{"text": "As a PhD in astronomy, it's extremely foolish to say \"just make everything a space telescope and get rid of ground telescopes.\"", "label": 0}
{"text": "Launch costs are expensive, but that's not the driving cost of space telescopes. Space telescopes are still going to be very expensive with Starship and cannot replace ground telescopes.", "label": 0}
{"text": "Very good points. We really need to wait a little before we can say we know what happened.", "label": 0}
{"text": "If only these 120 PhD astronomers thought about stacking images! You clearly know best!", "label": 0}
{"text": "Must be news to my PhD advisor and several other astronomers on the letter that I recognize by name as being among the best in their field.", "label": 0}
{"text": "[Here this might help](https://www.educatedinlaw.org/2019/02/united-states-is-a-federal-corporation-says-u-s-code-title-28/)", "label": 0}
{"text": "Yes, that is why I said “how,” not “if”", "label": 0}
{"text": "Hello u/Fearless-Ad8625, your submission \"Make America Gerbil Again\" has been removed from r/space because:\n\n* It is not related to space.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "Hello u/Perfect_South7160, your submission \"Does anyone have ideas to avoid space debris? \" has been removed from r/space because:\n\n* Such questions should be asked in the [\"All space questions\" thread](https://www.reddit.com/r/space/about/sticky) stickied at the top of the sub.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "I guess it’s never too late to comment. \n\nI wonder why the exact question from the exact Reddit post would come up as a top result.\n\nSeems so odd. \n\nI guess OP should have seen that before they posted.", "label": 0}
{"text": "Dragon needs a tightening turn maneuver over a few weeks during re-entry. Problem solved.\n\n/s", "label": 0}
{"text": "All astronauts get medical training, so they can handle a lot of situations. If it's something they can't handle on the station, the astronaut (and their crewmates) have to return to earth in their capsule.", "label": 0}
{"text": "To be more specific about the locking, it's because the comments on threads like this usually end up being almost entirely about Tesla, the US election, awful stuff musk says on twitter, and a lot of other stuff that doesn't have anything to do with space.\n\nThere's a tendency on reddit for big subreddits to all sort of blur together, with very similar posts and very similar comments on all of them.  We try to avoid that happening here by being pretty strict about keeping posts/comments directly related to space.", "label": 0}
{"text": "Hello u/Prestigious-Issue850, your submission \"Space launches updates in USA\" has been removed from r/space because:\n\n* Such questions should be asked in the [\"All space questions\" thread](https://www.reddit.com/r/space/about/sticky) stickied at the top of the sub.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "Hello u/Minhtrinhxinhxinh, your submission \"Space's Photos,timeplase video\" has been removed from r/space because:\n\n* Such questions should be asked in the [\"All space questions\" thread](https://www.reddit.com/r/space/about/sticky) stickied at the top of the sub.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "Hello u/mooman413, your submission \"Question about space photographs\" has been removed from r/space because:\n\n* Such questions should be asked in the [\"All space questions\" thread](https://www.reddit.com/r/space/about/sticky) stickied at the top of the sub.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "Come in and dismantle the company, sales remains flat but costs drop because you've fired all the best engineers and replaced them with low cost engineers from my country.  Make record profits and give yourself a fat bonus.  \n  \nAirplane start falling from the sky a decade later. You jump ship, taking a couple hundred million dollar golden parachute. Land in another successful company, rinse and repeat.", "label": 0}
{"text": "What you have to do is have all the lights go off at a certain time after say 12:00 a.m. but that creates a situation where bad things can happen with no light coverage in heavily populated areas. It is quite the conundrum, and I am somebody who uses a telescope to look at the night sky quite often. I would love if my bortles 6 became a bortles 2 but I also realized the importance of lights at night in heavily populated areas.", "label": 0}
{"text": "If I was him I'd be back channeling to the government desperately trying to get broken up, Ma Bell style.", "label": 0}
{"text": "Pretty massive assumption you got there", "label": 0}
{"text": "That was pretty funny 🙂‍↔️", "label": 0}
{"text": "Yeah Boeing only did this half assed effort because they played the patriotism card to get govt funding. They were never serious about this. Just another reason to hate Boeing for half-assing this and leaving us with the best and only options of using companies owned by unstable billionaires", "label": 0}
{"text": "Why is the entrance door so tiny?  Pressure reasons for rentry and whatnot?  Just seems like it’d be rasier if the door was normalish size", "label": 0}
{"text": "> The only thing that will save Boeing is to put actual engineers back in charge.\n\nBut we all know the odds of that are very slim. They’re far more likely to pawn off the non-core pieces of themselves in the hopes of stemming the bleeding. Also, if they’re hoping for a bailout (since they have a virtual monopoly on US aircraft manufacturing), they know they’re more likely to be broken up as part of the deal if they have too many businesses.", "label": 0}
{"text": "JWST isn't an updated Hubble, for the reason you state. Glad you understand that.", "label": 0}
{"text": "https://sma.nasa.gov/SignificantIncidents/ - this page has some published incidents listed (under MEDICAL EVACUATIONS and the like)\n\nNASA doesn't publish everything, out of respect for medical privacy for the astronauts. Usually they're only published if they're medically interesting.\n\nThey typically try to solve the issue with medicine that's already on-hand (and they prepare extensive medical cabinets/tools for the ISS). But if it's serious enough, they will rotate crews to get the astronaut back home quicker.", "label": 0}
{"text": "I would personally go a little east of there and visit Navarre, less crowded beach and beautiful water.", "label": 0}
{"text": "Nice job wokestronomers! Let NASA and BOEING retrieve all their space trash for clean up and we will have cleaner environment.", "label": 0}
{"text": "Even if launch was free, you still have to operate the telescope in a vacuum, with significant thermal problems.", "label": 0}
{"text": "Everything in LEO is suborbital if you wait long enough", "label": 0}
{"text": "Good thing that we don't have to choose.", "label": 0}
{"text": "Hello u/AlbertCrafter31! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "It's not space policy or space business though. It's Elon drama and political shit slinging.", "label": 0}
{"text": "Hello u/BriskmarckTheBrisket! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "Putting earth telescopes in space just doesn’t make a ton of sense. Most of the cost of a space telescope is the space part, not the telescope part. As soon as you’re done preparing it for the most extreme temperatures (on both sides of the spectrum) and making sure it can survive being put in orbit along with being remotely controlled and operating flawlessly without any hands on human control whatsoever, it’s really not much more expensive to get a huge mirror", "label": 0}
{"text": ">This one chooses not to mention it for some reason\n\nMaybe because even the NRAO doesn't see [any problems](https://uk.pcmag.com/networking/153839/starlink-is-coming-to-radio-quiet-zones-in-the-us)? Are these scientists sure it's Starlink, or did they just detect some signal from a satellite and immediately assume it's Starlink because it's the most common?", "label": 0}
{"text": "I haven't seen open lamps for at least 15 years, and from what I know, this is often explained by outdated infrastructure.", "label": 0}
{"text": "thank god, I thought that those 100+ PhD scientists had a point, but never fear, this guy on reddit says it’s silly", "label": 0}
{"text": "Wondered where you’ve been. Congrats on your new job. You’ll do great at it. You have a knack at explaining this.", "label": 0}
{"text": "We're going to have to agree to disagree on that.", "label": 0}
{"text": "That’s great but shouldn’t we look into Musk’s relations with Putin? Is our space apparatus compromised? Should we really outsource our space capability to a foreigner who bought Space X? He didn’t invent it. He needs to have his classified status revoked and once he’s replaced by a new CEO, we can proceed with Space X.\n\nOtherwise, we may find ourselves in a position where we can only get our Astronauts back if we give him more money and more power in return. If we haven’t been put in that position already…", "label": 0}
{"text": "Really sorry that response stayed up for so long, reddit actually automatically approved it (?!) so we didn't see the report.", "label": 0}
{"text": "Hopefully it is based on science not politics.", "label": 0}
{"text": "JWST had to fold up to be able to fit in the fairing which was why it was so complex to build. JWST's mirror is 6.6m wide unfolded so this means that JWST wouldn't have needed to be folded up if it had launched on Starship.\n\nStarship changes everything!", "label": 0}
{"text": "Hello u/Different-Horse-938, your submission \"Sci fi era for interstellar\" has been removed from r/space because:\n\n* It is not related to space.\n\n* This subreddit's for real life space, this should be in a movie subreddit.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "But you know some group of engineers is salivating over how large of a folding telescope they could fit inside Starship, haha.", "label": 0}
{"text": "TLDR: Boeing is considering selling its NASA space operations, including the Starliner program and ISS support, to cut losses amid financial struggles. CEO Kelly Ortberg’s new strategy prioritizes streamlining, aiming to focus on Boeing’s core commercial and defense sectors. Boeing has faced cost overruns and delays with space projects, and NASA recently chose SpaceX over Starliner for an ISS return mission due to reliability concerns. Boeing plans to retain its work on the Space Launch System, but it and partner Lockheed Martin are also looking to sell United Launch Alliance, their national security launch joint venture. Previous discussions with Blue Origin about taking over NASA programs underscore Boeing’s shift from space exploration to concentrate on fewer, higher-quality projects.", "label": 0}
{"text": "Do you really think Chinese astronomers have any CCP influence when Chinese environmentalists can't get them to stop dropping boosters with hypergolic fuel on their heads? (which is as toxic as a chemical weapon)", "label": 0}
{"text": "For sale, broken space ship, doesn’t fly, also special today, take over our exploding satellite division, surprises everyday. Space suits, you gotta be kidding.", "label": 0}
{"text": "Space telescopes aren't expensive because they have to fold up, they are expensive because they are large scale precision instruments operating without maintenance in the most unforgiving environment.", "label": 0}
{"text": "This is a week old now, the news doesn’t mean Starliner will never go back up but it looks doubtful. The problems were going to take time to sort out and likely there would need to be a requalification process with an unmanned mission. That’s likely another $1B in costs and Boeing has already been paid every dime they are going to get from NASA. Boeing has now thrown $1.6 BILLION  of stockholders good money after bad with more to come.\n\nA Starliner launch earns Boeing about $90M so just looking at cash it’s going to take 18-20 launches to make back the cost over runs, probably more. With SpaceX costing about 55M per launch and having great success is there even a market for Starliner when it’s ready? The new CEO should cancel the program and use the money to fix the other parts of the business before the whole thing goes down the tubes. But Congress is likely to figure out some way to get some money to Boeing to keep going as after all we according to Congress we need “competition “.", "label": 0}
{"text": "But hey, some billionaires will get a lot richer!", "label": 0}
{"text": "David Kipping is one of the signatories.", "label": 0}
{"text": "This is not how it works. Even if launch were free space telescopes would still be order of magnitudes more expensive than ground-based ones.", "label": 0}
{"text": "\"Space telescopes aren't expensive because they have to fold up\"\n\nJWST having to fold up so it could fit into the fairing added a ton of complexity and cost to the mission, come on dude everyone knows this.", "label": 0}
{"text": "Why do you assume twitter replies are real people?", "label": 0}
{"text": "Information Theory is a *very* powerful science, as we've demonstrated *at least* since WWII.", "label": 0}
{"text": "It's weird how so many people that are supposedly pro science and pro technology get so adamantly opposed to astronomers on this issue. You have an entire field of respectable scientists saying mega constellation of satellites are a big issue for years now (even before Elon Musk took his heel turn), but they get completely dismissed just because people like to see their big shiny rocket launch. These people are not science fans, they are SpaceX fans. It is a cult.", "label": 0}
{"text": "Yes, but not reentering ones. Megaconstellation satellites are designed to be disposable and will reentry often. Their concern is about any ill effects on the atmosphere from tens of thousands reentering objects.", "label": 0}
{"text": "The irony here is that Starship can’t exist without revenue stream from Starlink.", "label": 0}
{"text": "They already have fewer high quality products", "label": 0}
{"text": "Someone has to regulate it. It's either going to be the FAA, FCC, Department of Commerce, or NASA. NASA definitely doesn't want to do it. It's not a clean fit anywhere.", "label": 0}
{"text": "You're welcome! I pretty much feel the same way, I'm a little bummed this post isn't taking off just because I feel like *everyone* should see it, but at least everyone else who's watched it seems to love it as much as we did.", "label": 0}
{"text": "The beach scene was filmed in the Yasawa Islands in Fiji", "label": 0}
{"text": "The delay was mostly caused by weather though. Two hurricanes passed through the prime touchdown areas back to back.", "label": 0}
{"text": "Meanwhile https://www.reddit.com/r/technology/s/Z3qDsp6Kf0", "label": 0}
{"text": "We're on reddit though, not twitter.", "label": 0}
{"text": "Likely due to suspected alien replacement of one or all of the crew members.", "label": 0}
{"text": "The lack of ability to imagine anything that hasn't been seen already really explains why astronomy is such a muddled mess ", "label": 0}
{"text": "What are you talking about??", "label": 0}
{"text": "If it was a Boeing capsule people would be piling on", "label": 0}
{"text": "Any concussion deserves medical evaluation by a competent doctor, and more tests as needed.\n\nI remember a terrifying moment back when I was teaching. A student walked into my classroom and showed 3 or 4 symptoms of concussion.\n\n - Aversion to light\n - Pupils uneven size\n - headache\n - I can't remember if the whites of her eyes were red.\n\nAnyway, something made me think \"concussion\" when she walked into the classroom and shaded her eyes, so I asked and checked her eyes. Then I asked if she had hit her head. She said, \"Yes someone dropped an extension cord on my head in stage crew at 9 a.m..\"\n\nI was in a panic. Then I remembered the teacher in the next classroom had been an Olympic coach. They must all receive some training in concussions, I thought.  Sure enough, he did a quick neurological exam, then asked her to call her mother.\n\nWhen the call went through, he plucked the phone out of her hand and said, \"Your daughter has a concussion. If you drive here immediately and take her straight to the hospital I will release her to you. Otherwise I am calling an ambulance.\"\n\nI thought that was the best-handled emergency I have ever seen.\n\n---\n\nI came to the comments to hear speculations about what the emergency might be. \n\nFall and concussion?\n\nFall and sprained ankle?\n\nExtreme seasickness?\n\nPregnant?\n\nHeart attack?\n\nMaybe I should just wait for a subsequent report.", "label": 0}
{"text": "We’ve all seen that movie. Fire, fire works best.", "label": 0}
{"text": "Probably a twisted ankle.\n\nBut you are right, it might be something really requiring attention in a hospital.", "label": 0}
{"text": "Space telescopes are expensive because of the mass and volume constraints. Two factors that are specifically removed with Starship. Since you claim you are an astronomer (or at least part time when you don't spend your time obsessing with Musk) you should know this. ", "label": 0}
{"text": "Did they profit on the sale? I never did find out .", "label": 0}
{"text": "Most astronauts are very disciplined about doing their exercises, 2 hours a day minimum.\n\nEven if they do their exercises, it takes about a week for the sense of balance to return to normal. I would guess that falls right after reentry are not uncommon.", "label": 0}
{"text": "That's for everything go, including black holes. I'm talking about star formation ending that 100 trillion years. After about 100 trillion years no new stars will form. And then it will take a very long time for everything to go fully dark. \n\n\n>Luckily for us, the Stelliferous Era—that is, the universe’s star-making era—isn’t scheduled to end for roughly another 100 trillion years. And even then, it will be followed up by the Degenerate Era and the Black Hole era, the latter of which is estimated to occur roughly 10 duodecillion to 1 googol after the Big Bang.\n\n\nhttps://www.popularmechanics.com/space/deep-space/a62684775/dark-matter-long-freeze/", "label": 0}
{"text": "Starship isn't launching telescopes that are upwards of 50m in diameter. Starship isn't launching tens of square kilometres of antennae.", "label": 0}
{"text": "JWST isn't an updated bubble. It doesn't do visible. It doesn't do UV. Currently, ~4% of Hubble's frames are affected by starlink", "label": 0}
{"text": "They have to train pretty hard while in space, to recover fast after getting back to Earth. A lot of ISS research has been about how to reduce the damage caused by zero-G.", "label": 0}
{"text": "He's talking about the complete lack of creativity when all of sudden you have an extremely cheap launch vehicle with basically no mass and volume constraints for space telescopes. Space telescopes are so expensive specifically because of the complexity involved with having to adhere to the launch vehicle's mass and volume constraints. When you can send ten times and the mass and volume for 1/10 of the price you entirely change everything. All of sudden it becomes much more feasible to build much cheaper space telescopes. It becomes feasible to launch more of them. It becomes feasible to make up entirely new space telescopes not previously possibly.\n\n\nAstronomers should really take the opportunity to look at what Starship can actually do for them.", "label": 0}
{"text": "Full statement:\n\n> The Wall Street Journal published yet another incredibly misleading story about @Starlink based upon completely unsubstantiated claims from unnamed sources.\n \n> As has been repeatedly confirmed by the Department of Defense, SpaceX has worked (and continues to work) in close partnership with the U.S. Government regarding Ukraine and denial of service to bad actors. The Wall Street Journal repeats long-ago debunked claims that Starlink ever turned off service for Ukrainian soldiers. Starlink’s contributions to the Ukrainian defense and the Ukrainian people are indisputable. Starlink has kept Ukrainians online and connected to the world throughout the conflict and Starlink has defended itself against major efforts to disrupt that connection, at great cost to the company.\n \n> Regarding Taiwan, as even the Taiwan government has confirmed, Starlink is not available there because Taiwan has not given us a license to operate, and regulators declined to remove a requirement that a foreign entity own 51% of Starlink to operate there. SpaceX has not accepted such a condition for any market in which it operates. This has nothing to do with Russia or China.", "label": 0}
{"text": "just make the door open the other direction. bam", "label": 0}
{"text": "And tens of millions of people will get access to high speed internet*", "label": 0}
{"text": "Aerosols and ground solution are not revolutionary technologies so no.\n\nI guess the US should also get rid of all its nuclear weapons since their bad for the environment, why do we care what China does with them? /s", "label": 0}
{"text": "Hmm, do we believe the serial liar or the WSJ?", "label": 0}
{"text": "I don't know about this claim about wsj it could be true or false. \n\nBut I do know that wsj is shitty company that has released a lot of false investigations, theyve been caught several times lying about their reports. Especially in their investigations against huawei and hsbc.", "label": 0}
{"text": "How about the Guardian. https://www.theguardian.com/world/2024/oct/15/taiwan-to-have-satellite-internet-service-as-protection-in-case-of-chinese-attack\n\n> Starlink is not available in Taiwan after negotiations reportedly fell apart over Taiwan’s requirement that a local entity have a majority share of any joint venture established.", "label": 0}
{"text": "I don't think it is false or misleading, but lacking additional context.\n\n\nThe issue last year was that they were blocking the US military from using the service in Taiwan, despite the US military having a global contract with Starlink/Starshield.\n\n\nSee: https://www.cnbc.com/2024/02/24/house-china-committee-elon-musk-spacex-starshield-taiwan.html\n\n\nSo was the request by Putin talking about consumer service, or the military service? The Taiwanese government has also clarified that Starshield does not need to apply for a permit from the NCC to operate in Taiwan, as it isn't an ISP.", "label": 0}
{"text": "I mean it could also be partially true and partially false. At least parts of it are provably false by Ukraine's own statements and Taiwan's own statements. Unless you want to believe that Taiwan and Ukraine are lying, which seems to be an extreme assumption.", "label": 0}
{"text": "It can launch apertures far larger than is possible today, for far cheaper, with considerably more mass on the telescopes. All of these factors drastically reduce costs and complexity. And also makes it possible to create entirely new kinds of space telescopes, like clusters of them working together. ", "label": 0}
{"text": "> The issue last year was that they were blocking the US military from using the service in Taiwan, despite the US military having a global contract with Starlink/Starshield.\n\nThe only source of information is a Congressman and the DoD has said absolutely nothing regarding that. And SpaceX has denied it is doing so.", "label": 0}
{"text": "Sure, but Space is usually outside so it’ll be ok", "label": 0}
{"text": "Even if you think Musk is a liar, the WSJ has never been close to the pinacle of journalistic ethic. They've had more than their fair share of scandals. Your phrase would just read \"serial liar\" twice.", "label": 0}
{"text": "Eh Starshield is a confusing term used for several different things. Starshield is both a business unit/brand of Starlink and also a possible future constellation dedicated to some portion of the US military. Actually multiple parts of the US military are simultaenously each seeking their own constellations of various types. From the SDA, part of the Space Force, creating their own communication constellation completely unrelated to SpaceX to the US Army who wants a Starshield branded constellation, to the US Navy that's buying service from Starlink satellites under a Starshield banner.", "label": 0}
{"text": "Where are the rest? I imagine they have to sign nda's and make sure everyones story is the same before allowing them to go anywhere", "label": 0}
{"text": "could we train potential future astronauts from very young ages for these kinds of conditions so that their bodies would be able to cope better?", "label": 0}
{"text": "I’ve said this many times betore. Musk will leak ITAR data to the US’s enemies and we will hear about it decades later.", "label": 0}
{"text": "I don't understand why when they don't work why he is wasting money to launch even more of those useless hunks of metal.", "label": 0}
{"text": "Crazy how that can make a universe destroyer", "label": 0}
{"text": "I'd love to see the market crowded with companies, much like we once had many auto makers.  Right now SpaceX is doing it the best.", "label": 0}
{"text": "> Since you claim you are an astronomer (or at least part time when you don't spend your time obsessing with Musk)\n\nDear lord spacex fanboys are insufferable", "label": 0}
{"text": "Weight saving and miniaturization are needed as long as there is gravity. The reason aerospace engineering provides us with so much trickling-down innovation is that there is a constant need to improve thrust to weight ratio.", "label": 0}
{"text": "Never said they can't drive it. There's a difference between that, and being able to decide when and where to go with it on your own.", "label": 0}
{"text": "Let's stay on topic. This is not about Musk. This is about misleading claims made about SpaceX.", "label": 0}
{"text": "This is how you create eco-terrorists", "label": 0}
{"text": "\\>Dear lord spacex fanboys are insufferable\n\nPeople with elon derengement syndrome even more so I'm afraid.", "label": 0}
{"text": "Astronomers are not interested in your cult", "label": 0}
{"text": "WSJ has become about 50/50 political mouthpiece and actual news. Not the fully trustworthy source they once were.", "label": 0}
{"text": "Apollo 1 says that's a horrible idea", "label": 0}
{"text": "I'm sure most astronomers are thrilled of what possibilities Starship opens up for them while also being concerned with how Starlinks affects radio astronomy on earth. Prof David Kipping made a good video about it last year and I have read numerous articles written by astronomers on how they could best use its capabilities in the future all while being one of the astronomers that signed on to this push against Starlink. \n\nI think you need to realize that most people aren't terminally online redditors with Musk derengement syndrome like you. There's a thing called being objective, you should try it.", "label": 0}
{"text": "They'd have to fire themselves (and even worse, acknowledge that they aren't the brilliant masters of finance they paid HBS to tell them they were). \n\nThese McKinsey clones would rather ride the collapse into flames, pillaging every penny on their way out than admit their mistakes.", "label": 0}
{"text": "Imagine thinking BBC is a better place for scientific news.", "label": 0}
{"text": "It can’t end up in a higher orbit only change it’s with making it highly elliptical which would pull it into the atmosphere much faster. Going into a higher orbit requires a increase in velocity were as a collision will typically cause a decrease in velocity", "label": 0}
{"text": "You should read up on basic orbital mechanics. The worst case scenerio is some of the junk getting into a more eccentric orbit with a higher apogee than initially. But because this also means the speed in which it enters its perigee, there the atmospheric density is the highest, means it will experience more drag their quickly lowering its orbit.", "label": 0}
{"text": "Yes, it actually allows that. Because of it's extremely cheap launch cost, enourmous lifting capability and high launch cadance it's possibly to build huge structures in space with it.", "label": 0}
{"text": "So just to get that right. \n\nThis is about SpaceX but has nothing to do with Musk? No connection here?", "label": 0}
{"text": "Maybe the companies launching these constellations can contribute to special software or hardware that mitigates against the satellites image crossing their field of view.", "label": 0}
{"text": "I think I actually wrote that line in that wikipedia page, but yes it's a good point.", "label": 0}
{"text": "The God who walks among men.", "label": 0}
{"text": "I would think the space business of an aero**space** company would be one of their core businesses, no?", "label": 0}
{"text": "Pot calling the kettle black, that is exactly what you're doing. Both to Musk and to astronomers by making definite statements on that astronomers aren't interested in the potential of starship. I just gave you an example of a known astronomer who is both excited about the potential of starship and is against the interference starlink creates for radio astronomy.", "label": 0}
{"text": "Well given that China is spooling up its clustermuck might as well have the devil we know who at least attempts to lower the reflectivity.", "label": 0}
{"text": "Since the long comment I wrote to respond to this for some reason gets filtered and hidden, I will post an image of the response \\[here\\](https://i.imgur.com/mIUpJyI.png). Would appreciate if you read through it and took it in good faith.", "label": 0}
{"text": "They also pushed for the dimming of city lights and particularly street lights - claiming this would have no impact on safety.", "label": 0}
{"text": "Hey New-Statistician9322! Unfortunately, your submission has been removed because you posted a link inside of a self post. Feel free to delete this post and then **[resubmit your link the correct way](/r/space/submit)** (not in a self post). Thanks for understanding! :)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "Damn, ok, maybe the catch wasn't as smooth as it looked", "label": 0}
{"text": "What does an abort look like.in that circumstances, would they have to boost in back to altitude to ditch it safely or blow it up?", "label": 0}
{"text": "r/wallstreetbets 'too the moon'", "label": 0}
{"text": "Decel degens with a massive sense of entitlement? ", "label": 0}
{"text": "No, it's providing internet to millions. It has already disrupted rural ISP monopolies. Not a bit too early.", "label": 0}
{"text": "Do you know how big radio telescopes have to be? The dish itself is usually at least 100 meters in diameter while the average rocket is only 58 meters tall. Tell me again how we can just use a low cost rocket to propel that into orbit and why we should do that instead of just following the gd regulations?", "label": 0}
{"text": "It is, PCMag is infinitely less credible than the BBC when it comes to scientific publication", "label": 0}
{"text": "The heart is a muscle - muscles gain and lose “strength” with training and use. Overtime with aerobic conditioning the heart muscle will regain its strength.", "label": 0}
{"text": "I did not wake up expecting to see a comment hypothesizing on the effects of microgravity on the dreaded \"condiment precum\". But this is important science and we must have an answer.", "label": 0}
{"text": "I have to admit that I didn‘t have time to read the article but does it actually matter how much time there is between all systems saying they’re go for landing and the actual landing.\n\nI‘m guessing this means that basically the last sensor / system switched to go one second before the deadline at which point they abort. So it doesn’t really matter whether its one second or a tenth of a second before the deadline as long as everything is read in time, I‘d even argue for a computer one second is a lot of time as these checks and the decision making is probably fully automated.", "label": 0}
{"text": "\"Condiment precum\" has to be the most cursed term in the English language.", "label": 0}
{"text": "But you know exactly what it is I'm talking about. And why it's such a scourge that studying it in space to defeat it on earth is so important.", "label": 0}
{"text": "Same. By design or necessity there are very short margins in the landing sequence. The headline just sounds sensational when in reality it’s probably pretty common for many rockets to have these phases of flight and landing where something must happen correctly in less than a second or there is a loss of vehicle incident.", "label": 0}
{"text": "Took 2x a bigger paycheck than SpaceX from taxpayers\n\nTalk big game about beating SpaceX to the ISS\n\nSpaceX kicks their ass six ways to and from space\n\nSends one busted ass rocket to the ISS\n\nSpaceX rescues Boeing astronauts \n\nBoeing calls it quits and sells \n\nWhat a legacy.", "label": 0}
{"text": "There was a significant amount of fuel left. There are pictures of the frost line after it landed. It looked like a lot of fuel left.", "label": 0}
{"text": "Plenty of Space X bots and unpaid interns in here.....", "label": 0}
{"text": "We'll have some of the fun, there's still plenty more to go after us, hopefully ", "label": 0}
{"text": "In my experience you have 3 categories - \n\nStable - patients doing well, responding to therapy, cruising along\n\n\nUnstable - you should probably make some urgent interventions and changes to the care plan to avoid the third category\n\n\nImminently stable - if you don’t fix shit fast, the patient is about to become *extremely stable*", "label": 0}
{"text": "There was actual go/no go input needed from mission control on this one. Someone had to hit the button.", "label": 0}
{"text": "They had roughly 15 seconds of fuel left, although the quantity sensors weren’t all that accurate.", "label": 0}
{"text": "Fixed. :) After I saw that it bothered me too.", "label": 0}
{"text": "So then I'm in stable condition? Sweet.", "label": 0}
{"text": "I mean, the whole principle of \"suicide burning\" and whatnot is that you're literally at a fraction of margin (if that) before *insert catastrophe here* no? \n\nMaximum efficiency & performance means maximum risks and minimum margins for... just about *everything*, hence why F1 cars arent on the road for starters.", "label": 0}
{"text": "Why is it humanoid? I feel like a nonhumanoid robot would be better for space stuff", "label": 0}
{"text": "As an ER physician a concussion absolutely does not ever need an ambulance nor does it need a hospital evaluation. Family doctor is perfectly reasonable ", "label": 0}
{"text": "[SpaceX already teared apart WSJ's lies about Starlink in the article](https://x.com/SpaceX/status/1849956344691912873):\n\n> The Wall Street Journal published yet another incredibly misleading story about @Starlink based upon completely unsubstantiated claims from unnamed sources.\n \n> As has been repeatedly confirmed by the Department of Defense, SpaceX has worked (and continues to work) in close partnership with the U.S. Government regarding Ukraine and denial of service to bad actors. The Wall Street Journal repeats long-ago debunked claims that Starlink ever turned off service for Ukrainian soldiers. Starlink’s contributions to the Ukrainian defense and the Ukrainian people are indisputable. Starlink has kept Ukrainians online and connected to the world throughout the conflict and Starlink has defended itself against major efforts to disrupt that connection, at great cost to the company.\n \n> Regarding Taiwan, as even the Taiwan government has confirmed, Starlink is not available there because Taiwan has not given us a license to operate, and regulators declined to remove a requirement that a foreign entity own 51% of Starlink to operate there. SpaceX has not accepted such a condition for any market in which it operates. This has nothing to do with Russia or China.", "label": 0}
{"text": "Yeah, except you have to report all these contacts when you have clearance.  Nothing in the article says he did this.  That's a problem.", "label": 0}
{"text": "He is not under an investigation. You are in the wrong sub. The rest of Reddit buys the misinformation.", "label": 0}
{"text": "And a lot of animals and marine life. SpaceX’s irresponsible destruction of their launch pad has devastated wildlife in that area.", "label": 0}
{"text": "Elon also kicked the service several times and the timing was suspect. Starlink also provides service to Russians. Don’t tell me Starlink doesn’t know where the dishes when in use….", "label": 0}
{"text": "Yes but that was early on and systems were green at that point. When the rocket is coming in hot there's no way a person can decide it's time to abort. Granted, I'm sure they CAN abort manually, but one second before no.\n\nConsidering it was mentioned that the booster was one second away from attempting to avoid the tower, this would have been an automated system.", "label": 0}
{"text": "Also interested to how it formed", "label": 0}
{"text": "No for free though. The fact is that some were sponsored by US but the most starlinks for Ukraine was purchased by Poland.", "label": 0}
{"text": "This is amazing. I love that we live in a time where we can communicate directly with a guy floating around in space.", "label": 0}
{"text": "And you alone have monopoly on truth. GTFO stooge", "label": 0}
{"text": "Funny. So provide a source to this investigation? There was a warning issued for the million dollar thing.", "label": 0}
{"text": "Can you take a video of it freezing or is that not possible?  Very cool picture and thank you for sharing.", "label": 0}
{"text": "I will never understand Elon musk stans. Like why worship a billionaire who was born on 3rd base? \n\nIdk either way, but the comments, damn y'all. Swallow already.", "label": 0}
{"text": "Trump isn't a Russian asset, but ok", "label": 0}
{"text": "Makes sense, wasn't sure which piece it was referring to.", "label": 0}
{"text": "Wow such chaos! I've always wondered about things like this, would the crystals grow uniformly in zero gravity etc. Thank you so much for sharing this!", "label": 0}
{"text": "He actually is under an investigation \n\nhttps://www.cnbc.com/2024/08/04/elon-musk-pac-investigated-michigan.html\n\nNot from the DOJ (yet).\n\nBut to brush off all of his behavior is a bit foolish if you ask me. He's probably breaking laws to support a candidate who is notorious for being soft/friendly with Russia. All while talking to Putin.\n\nCircumstantial, but if you think people in the intelligence community aren't at least very concerned about this you are very mistaken.", "label": 0}
{"text": "During the initial period after the Feb 2022 offensive it was all done on SpaceX's own dime. At least 80million For at least the better part of a year since they were provided immediately when Ukraine needed it without contract. Which cause a snafu later on. \n\n[https://www.cnn.com/2022/10/13/politics/elon-musk-spacex-starlink-ukraine/index.html](https://www.cnn.com/2022/10/13/politics/elon-musk-spacex-starlink-ukraine/index.html)", "label": 0}
{"text": "The starship was supposed to appear in the 70s, look at the Nova projects. There are a lot of rockets very similar to the Starship.", "label": 0}
{"text": "These types always so quick with the hyperbole and personal insults yet lacking in facts lol. Sad that reasoned discussion is dead.", "label": 0}
{"text": "This is completely misleading. Elon never \"kicked the service\" several times. He refused to activate Starlink for coverage of the Russian occupied regions of Ukraine. This is because they're not allowed to cover it under the sanctions against Russia, which include the regions of Ukraine they occupied, and the fact that Ukraine wanted to weaponize Starlink by using them as weapons guidance systems, something they specifically were not allowed to do as Starlink is a commcerical product and not WGS.\n\nRussia bought a bunch of starlink terminals outside Russia and had them smuggled into the country. Then they started to use them once they entered the parts of Ukraine held by Ukrainians because these areas were covered under Starlink. Literally anybody in the west can go into their local electronics store and buy a starlink terminals. There are literally millions of them. No, you can't differentiate between the terminals when they're used in the same area. Just like Russian terminals were bought in the west and sent their, so where the majority of the ones used by Ukraine through donations. You can't differentiate between these.", "label": 0}
{"text": "Ignoring the idea of luck as a resource, let alone a finite one, this 1 second margin really wasn't about luck. Everything worked fine, the tolerances were just overly tight.", "label": 0}
{"text": "then release the meeting recording? he knows how this looks. If he meant no harm he can prove it ?", "label": 0}
{"text": "Not captured equipment but bought on the ‘black market’… that proves nothing because of course SpaceX wouldn’t sell to a Russian directly!", "label": 0}
{"text": ">I decided to grow thin wafers of water ice for no more reason than I’m in space and I can.\n\nNew Item on my bucket list just dropped.", "label": 0}
{"text": "It's both captured equipment and bought on the black market. And one must be incredibly agenda driven and willfully ignorant to believe SpaceX were activally trying to sell a starlink terminals to Russia.", "label": 0}
{"text": "I assume the location of these terminal where then provided to the US intelligence? No… why was that? The dishes can be geo located to a few feet. \n\nI’m sure they are all clueless who is using it… it’s not like SpaceX is also the Service provider.", "label": 0}
{"text": "Elon had regular talks with Putin.", "label": 0}
{"text": "You're literally an Elons lapdog, your bias is bleeding out your ears by just looking at your post history, what discussion you want to have?", "label": 0}
{"text": "What was your methodology for growing the wafers?", "label": 0}
{"text": "There were dozens of Nova projects, some of which were disposable, others partially reusable, and others completely reusable.", "label": 0}
{"text": "Teared them apart by not mentioning his talks with Putin? They do not address the main issue.", "label": 0}
{"text": "There's no evidence of him having regular talks with Putin. I advice you to read this article on the matter rather than hit pieces from WSJ there half of the information given in the article has already been proven to be misleading at best.\n\n[https://arstechnica.com/space/2024/10/why-is-elon-musk-talking-to-vladimir-putin-and-what-does-it-mean-for-spacex/](https://arstechnica.com/space/2024/10/why-is-elon-musk-talking-to-vladimir-putin-and-what-does-it-mean-for-spacex/)", "label": 0}
{"text": "Here's the non-paywalled.version https://archive.is/itc3x", "label": 0}
{"text": "Amazing! That's why I've always thought that proactive boredom is wonderful.", "label": 0}
{"text": "From the article mentioned:\n\nBut in the last two years, the same time frame in which Musk has reportedly been in contact with Putin, the once symbiotic relationship between Musk and the United States has begun to fray. This has also coincided with Musk’s purchase of Twitter and increasing alignment with conservative politics.\n\nMany Americans are celebrating Musk’s bromance with Republican presidential nominee former President Donald Trump. They appreciate his embrace of Republican politics and the more than $100 million he has invested in Trump winning the presidency. In characteristic Musk fashion, he has gone all-in on a cause he deems essential to the future of his interests and those of humanity, even temporarily living in Pennsylvania.\n\nBut for many other Americans, the response to Musk’s activities has been revulsion. He has used social network X (formerly Twitter) to push an increasingly partisan viewpoint and peddled a stream of ideas and theories that can accurately be described as *misinformation*. These people are increasingly uncomfortable with Musk’s power over the US space program and the country’s electric vehicle industry, and ability to influence geopolitical affairs through the Starlink constellation for which there is no viable competitor at present. The idea that Musk is regularly conversing with Putin, an avowed foe of the United States and Western democracies, is deeply uncomfortable.", "label": 0}
{"text": "Why would SpaceX mention that? They made a statement related to their product Starlink like a company should do.", "label": 0}
{"text": "Yeah, my middle class family also had an emerald mine in an apartheid state. No biggie.", "label": 0}
{"text": "It's great that it worked out in the end and now SpaceX has a lot of data that will greatly help improve future launches. High risk high reward at its best", "label": 0}
{"text": "Thanks for sharing your experiment!! Very interesting, hope to see more!", "label": 0}
{"text": "Successful physical interface with planetary liquid surface.", "label": 0}
{"text": "Thank you so much for taking the time not only to write this up but share such a beautiful shot and answer our questions. I also think the fact that I’m responding to someone who sent this from the ISS makes me cheese so much inside!", "label": 0}
{"text": "Such a statement would be best be made by the CEO himself. Not through the company's social media there the intent is to specifically deal with the misinformation in regards to one of their products.", "label": 0}
{"text": "Incredibly cool! I’m a high school science teacher. We’ll soon be discussing this!", "label": 0}
{"text": "So a PAC got issued a warning. Which means it’s not an investigation and it’s not about the made up story of Putin. Nice try.", "label": 0}
{"text": "backlog of missions that use up the last of their inventory of rocket motors.", "label": 0}
{"text": "That’s why they do environmental studies.\n\nAnd do you have evidence they devastated wildlife? Besides activists groups paid by competitors making bold unfounded claims in an attempt to slow down SpaceX and hurt their image.\n\nAt least if the booster blew up a few hundred meters away from the tower they can easily clean it up. Everyone else just dumps their boosters in the ocean.", "label": 0}
{"text": "I know sometimes ice cube trays can grow spikes of water due to the way the water freezes outside-in.  I'd be curious if you can get the same effect in space, or how it would differ?", "label": 0}
{"text": "Very cool!  Do you run into any vibration issues with that armature setup in the space station when taking macro shots?", "label": 0}
{"text": "I think it’s more about their pace than standing engineering principles. Plus, some engineering organizations are managed by suits who are happy to cut corners to please shareholders \n\nExample: boeing", "label": 0}
{"text": "> a Congressman that resigned to join Palintir\n\nAnd is therefore immediately suspect", "label": 0}
{"text": "I'm simply optimistic. We have already seen how cheap access to space has changed the entire way we think of developing space technology through Starlink. The entire starship project's development costs are projected to cost less than jwst. We certainly can mass produce space telescopes of equal capability to the hubble and jwst with the money that went into jwst alone. Especially if you're now allowed to build them with off the shelf components and the drastic reduce of complexity that comes with launching with Starship. \n\n\nThere are so many future possibilities for astronomy here, but you want to be stuck in your old ways and say it's \"impossible\".", "label": 0}
{"text": "Risky for what? Money?\n\nThere’s no real risk to human life or even major damage to the facility even if it RUDs right next to the tower, let alone a predetermined spot chosen for aborts a few hundred meters away.", "label": 0}
{"text": "And why do you think that?", "label": 0}
{"text": "Jist for the record…10 million people is about  .125% of the world’s population…just to put that into perspective since folks seem to be using the word millions to project an enormous quantity.", "label": 0}
{"text": "He said, pulling that information right from his ass...", "label": 0}
{"text": "Let’s backtrack a minute.\n\nAn aborted tower catch would not be a big deal at all. It was part of their launch license and therefore EIS. No one is loosing trust just because they didn’t do something extraordinary like this on their first try. \n\nWorst case would be the FAA mandating SpaceX to conduct an investigation to find the root cause of failure, which they would have done regardless. \n\nAn aborted catch attempt is an acceptable outcomes for all parties involved. It’s a test program after all.", "label": 0}
{"text": "Especially if Matt Damon is piloting the craft.  You ever see that guy try to dock a spaceship? Ooo-wee I tell you what.", "label": 0}
{"text": "It is 'soft' compared to what would happen if it didn't relight its engines.", "label": 0}
{"text": "Nope inherited his family's mining operations. Fyi", "label": 0}
{"text": "How would you train someone to have their body not deteriorate after spending months in microgravity? It would be extremely unethical to put a young child into orbit just to have them not live in gravity", "label": 0}
{"text": "very interesting, this is def science creating art which usually go hand in hand.", "label": 0}
{"text": "A bit ass towards the engineers and managers working on this", "label": 0}
{"text": "Will this continue with Musk's interactions with Putin?", "label": 0}
{"text": "How about what sounds bad?", "label": 0}
{"text": "Don posts such amazing work consistently, I recommend following his Instagram or whatever else is avaliable. I always enjoy seeing his posts and mind blowing photography.", "label": 0}
{"text": ">using a Saturn V rocket,\n\nwe don't know how to build those anymore.\n\n\n\n>and what would be a realistic travel time to reach Mars?\n\nfirst things first. \n\na lot of stuff has to be INVENTED (rockets are not the hard part).\n\n  \n[https://en.wikipedia.org/wiki/Artemis\\_program](https://en.wikipedia.org/wiki/Artemis_program)\n\nThe **Artemis program** is a [Moon exploration](https://en.wikipedia.org/wiki/Exploration_of_the_Moon) program led by the United States' [National Aeronautics and Space Administration](https://en.wikipedia.org/wiki/National_Aeronautics_and_Space_Administration) (NASA), formally established in 2017 via [Space Policy Directive 1](https://en.wikipedia.org/wiki/Space_Policy_Directive_1). It is intended to reestablish a human presence on the Moon for the first time since the [Apollo 17](https://en.wikipedia.org/wiki/Apollo_17) mission in 1972. **The program's stated long-term goal is to establish a** [**permanent base on the Moon**](https://en.wikipedia.org/wiki/Moonbase) **to facilitate** [**human missions to Mars**](https://en.wikipedia.org/wiki/Human_mission_to_Mars)**.**", "label": 0}
{"text": "Cool!!! I'm interested in knowing the formation and this looks amazing", "label": 0}
{"text": "Yeah it is tragic urban areas do this, but never gonna not have lights in the city", "label": 0}
{"text": "How many times are we going to see this same story?", "label": 0}
{"text": "> Space telescopes are expensive because of the mass and volume constraints of their launch vehicles.\n\nSpace telescopes are expensive because they're in space. Everything is harder in space. JWST was expensive because it was the most technologically advanced telescope ever put into space.", "label": 0}
{"text": "Who doesn’t like rollercoasters and ice cream!", "label": 0}
{"text": "I grow really pretty crystals from uranium compounds. If you wanna take some pictures of them, just hit me up and I'll come to space with you.\n\nYou like pretty crystals, I grow pretty crystals. I love space, you have access to space. I think we can work something out.", "label": 0}
{"text": "I feel like this happens every time I go to someone's profile. Be it for cool rocket knowledge or deranged ranting, it always ends up being like that haha", "label": 0}
{"text": "Thanks for your post!  I'm curious to follow your research, in particular, how phase transitions would affect large volumes of water in storage in microgravity.  Any references would be helpful!  TIA!", "label": 0}
{"text": "Awesome work and I like the beauty in what looks like randomness.  Speaking of random, Martian 👽 in your rear view.  I zoomed in  to that pane of glass in the center of second photo and there it was.🍻", "label": 0}
{"text": "Brilliant idea, little piggy. Makes perfect sense. Any other deflections?", "label": 0}
{"text": "Yes, the gov made a net profit on all 2008 bailouts", "label": 0}
{"text": "That looks amazing. Is it possible to stitch together a stop-motion of the photos? I’m curious to see how the ice crystals form in microgravity over time.", "label": 0}
{"text": "> They do not address the main issue.\n\nBecause it's not an issue? Elon has met with every single world leader to talk about climate change and technology with them. Climate change is a global issue that requires global cooperation. It would be weird if he *weren't* talking to putin seeing as how russia is one of the largest oil producer in the world. And If the Saudis can be convinced to start divesting from oil, putin can be too. It's always worth a shot.\n\nAlso SpaceX just returned a russian astronaut from the ISS for the first time ever, so of course there's going to be dialog. Not to mention Elon has been vocal against the war in Ukraine and how much he hates the bloodshed, and so if Elon can use his influence to convince putin to end the war and leave Ukraine, that would be amazing.", "label": 0}
{"text": "Might be a long shot, but maybe it was Isaac Arthur? Maybe his Iron Star video or Civilizations at the end of time. Even if it's not that, it should be similar content.", "label": 0}
{"text": "Even if its not, it sounds interesting and I will watch it. Thank you.", "label": 0}
{"text": "One, there aren't any plans for any of this. Second, your statement that starship has more habitable space completely ignores the absolute massive amounts of life support systems that need to be installed for people to actually, you know, live...", "label": 0}
{"text": "We ALL want MSR to be successful. IMO, China’s architecture is much more mature and simplified (relatively) and will most likely beat is there….. and back. Let’s just not rush to be first, let’s do it right and with much more deeper focus than a “land grab” just for the glory. Again, just my opinion.", "label": 0}
{"text": "Oh...oh my. I was not prepared for that.", "label": 0}
{"text": "Humans aren’t capable of comprehending things of this scale.", "label": 0}
{"text": "Not the documentary but a good excuse to repost this comic of the Issac Asimov short story: \n\n https://imgur.com/gallery/last-question-9KWrH", "label": 0}
{"text": "This is pretty standard for tests.\n\nIt's about the tolerance for risk, so things are expected to go wrong.", "label": 0}
{"text": "100% stop, regulate, require insurance if regulations are broken to pay for de-orbit. It is like environmetal regulation for an oil tanker or bopal.", "label": 0}
{"text": "Can someone ELI5 to me please? What’s the difference between finding them in a different galaxy?", "label": 0}
{"text": "BDSS ??? I hate keeping up with the initials .", "label": 0}
{"text": "> What would you do with such a freezer in space?\n\n> I decided to grow thin wafers of water ice for no more reason than I’m in space and I can. Plus I wanted to see how the freezing front behaves in 0g (without gravitational buoyancy, how does the freezing front push the tiny bubbles around).\n\nRemember kids, the difference between screwing around and science is writing it down.", "label": 0}
{"text": "“It’s not shareholder value vs the company.”\n\nI take it you have never worked for a publicly traded engineering company?  That’s exactly how it works.", "label": 0}
{"text": "Well, SpaceX was built up with lucrative contracts, IP transfer and engineering support from NASA as a measure against this exact situation. Now there are several other aerospace companies eager to get even a fraction of that support. So it’s not as bleak as you make it out to be. We just have to go through the painful aftershocks of the decades long ULA/Boeing grift now.", "label": 0}
{"text": "Very cool! Keep on sharing your awesome photography.", "label": 0}
{"text": "It is, in fact, extremely old news", "label": 0}
{"text": "Okay but why does it make a difference which one you look at? Is it because the one further away is older because of the distance or something?", "label": 0}
{"text": "It's obviously not what you have seen, because it is only 9 months old, but on topic and interesting nonetheless:\n\n[https://www.youtube.com/watch?v=5UxUS6bPiT8&t=5s&ab\\_channel=CoolWorlds](https://www.youtube.com/watch?v=5UxUS6bPiT8&t=5s&ab_channel=CoolWorlds)", "label": 0}
{"text": "Not much details on who or what the issue was but all 4 crew members will continue with normal post return activities.", "label": 0}
{"text": "No, what he said was that they misjudged how long the ramp up time for something would take. Basically giving the abort condition a smaller deadline than needed. One more second and it would have triggered an unneccessary abort condition.", "label": 0}
{"text": "No, they're just not selfish luddites intent on holding back humanity because it makes their job 1% harder.", "label": 0}
{"text": "tl/dw: Space is big.\n\nThere you go champ", "label": 0}
{"text": "Eh the concerns with the bailout were not really the financial consequences in terms of the bailout cost - the cost is in many ways irrelevant, because if you don't do it everything blows up. The government could be down 500 billion on the deal and it would still be worth it compared to the alternative. \n\nThe real issue that people had with the bailout is the moral hazard created - all the reward for thee, all the risk for me. Whether you find that compelling or not, from various perspectives the actual final accounting of how the government did on a ROI basis is really not at all central to the discourse of the 2008 crisis and the response.", "label": 0}
{"text": "Do you... do you think the parabolas are cast in one piece?\n\nYou do know they are made in small sections that are assembled on site, right?\n\nAlso, Space X is following the regulations, and using materials to reduce even further.\n\nYou think China is going to do that? lol", "label": 0}
{"text": "Payloads and ground systems, I assume. Plus access to all the contracts Boeing has.", "label": 0}
{"text": "Nice to see Phil Collins getting back to some work after the spine issues", "label": 0}
{"text": "I think I have watched that. But I don't think that is it. I believe it is newer than that. It would have to be post 2012 because it came out on netflix i believe and i didn't have that until after 2012.", "label": 0}
{"text": "I think Blue Origin is still the favorite as they sell their engines to ULA. \n\nBO buys ULA at a discounted price (Bezos does the gov a solid), gets all the Atlas contracts, maybe gets Vulcan/Centaur certified for more DoD contracts while they get their own rockets up and running.\n\n  \nDisclaimer: I do not follow BO closely so I do not know capabilities of their big rocket versus Vulcan/Centaur. However, I think V/C is closer to cert than New Glenn.", "label": 0}
{"text": "No, they had not a lot of fuel, but it wasn't 1 second.", "label": 0}
{"text": "Maybe, but Sierra was the last one confirmed to be in talks about it, and BO talks seem to have stalled a lot longer. Personally, the big thing for me is BO definitely has the money, and Sierra clearly does not without a huge loan or discount.", "label": 0}
{"text": "I can’t imagine how disregarded I would feel if I was a one of the competent people actually making the project happen and I saw this video.", "label": 0}
{"text": "Hey Don, thanks for sharing this moment of curiosity with all of us. It appears the ice is housed in a circular frame for this photo, would it be possible to create a hexagonal frame for this experiment?", "label": 0}
{"text": "It was not very little, you are underestimating how big that rocket is.", "label": 0}
{"text": "Everything didn't work fine, that's exactly what they were discussing.", "label": 0}
{"text": "It’s about the sheer mass of the parabolas alongside the assembly difficulties. JWST was expensive because it needed to fold up, like the radio telescope you propose would need to. We are lucky enough to have a wavelength (radio) that isn’t impacted by our atmosphere, making group telescopes as effective as space telescopes, and some people think we should just give up on that so that elon can make more money. \n\nWho cares if China follows regulations, someone else breaking the rules doesn’t mean we shouldn’t follow them. The satellites literally just need better radio shielding to reduce their pollution, they’ve been skipping this step to make more money", "label": 0}
{"text": "There are some youtube videos that come up by the search for \"timeline of the far future\". One of them at least traces out how the era of stars will come to and end, and eventually we'll have nothing but blackholes separated by vast and ever increasing distances, which then over stupendous timelengths evaporate, etc. It's very bleak but really good.", "label": 0}
{"text": "Depending on what happens you could trash the entire launch complex or even land on the nearby town as the Chinese have done. And when you say \"money\" they have already spent all the money given by NASA for hls and are in risk of bankruptcy as must has said.", "label": 0}
{"text": "Those old people could have been involved in putting humans in space in the first place so maybe it really is important", "label": 0}
{"text": "Your latter point is exactly why I think it should be big news. If the deal is structured properly, the moral hazard is mitigated. Was public money used to help a company? Yes. But the company paid for the privilege (as it should) and the taxpayer for a return rather than a loss.\n\nThere a lot of narrative out there about government incompetence or wastefulness. Much of it rooted in some truth. But there are successes, and while you appreciate the importance of saving the economy from domino effects  not everyone does. \n\nSo some good news is important. Losing faith in government (and wanting to \"tear it all down\" as some do) because government is not perfect is a far bigger hazard, in my opinion.", "label": 0}
{"text": "Thanks for taking the time to explain that! Very interesting.", "label": 0}
{"text": "The story of Putin pressuring Musk over Taiwan internet for China just doesn’t even make sense.\n\nChina has enough of Tesla’s business interests located within the country that it doesn’t need anyone else if they want to apply pressure on Musk. \n\nChina wouldn’t pressure him to not sell his internet service to Taiwan, they would pressure him to allow them to monitor their communications, so they would pressure him to provide service if he were compromised.\n\nThe logic just doesn’t work.\n\n1. Elon is compromised.\n\n2. He has a service to provide internet.\n\n3. Taiwan is an enemy of China.\n\n4. Tesla, Musk’s most valuable business is dependent on operating in China.\n\n5. China gets Putin to push Musk to not offer his internet service, so that Taiwan signs a deal with a European service instead? Huh?\n\nDo all these people screaming and crying about Musk talking to Putin not realize a Russian cosmonaut just returned to Earth on a Dragon? That an American astronaut will be traveling on a Soyuz in 2025? That Russia is still a key partner in the ISS? Do they really think that the US government doesn’t have all of Elon’s communications monitored? \n\nThe man controls technology that will enable global domination by force by the end of decade. He got there by utilizing technologies developed by the US government but not implemented. He hired the most intelligent and motivated individuals in the US space industry. He received millions in grants and billions in contracts.\n\nDo people not realize that he is a US asset? That if he were having electronic communication with anyone of note about conducting business to assist any country other than the US that our intelligence services would know in real time? That if he were to do Putin’s bidding, his company would taken from him and he would be given compensation?\n\nThe only way people can possibly believe this crap story is to either be completely naive about the world or apply zero critical thinking.", "label": 0}
{"text": "Really glad we were able to get you Iceberg-2 access Don! The pictures look great!\n\nI was your POD a couple Orbit 1s ago when you woke up really early to access. Cheers from Huntsville!", "label": 0}
{"text": "Thanks for sharing and going to space for us!!!", "label": 0}
{"text": "What an absolute shell of a company anymore. They could just do better but they will just the route of money just to keep their investors happy and their executives pockets nice and full.", "label": 0}
{"text": "I'll second this. He's done other videos but none of them are as beautiful and haunting.", "label": 0}
{"text": "At this point, what part of the company is worth keeping?", "label": 0}
{"text": "Luddites weren’t opposed to technology they were opposed to automation reducing the number of jobs that historically were done by people \n\nwhich hey, it’s still relevant. ", "label": 0}
{"text": "The ship and booster are still in development. The Raptor engine will continue to see large improvements for the next few years. The payload to orbit will only increase, not decrease with the current state of development.", "label": 0}
{"text": "Hey man, at least you know what you’re looking for. Like, very specifically.", "label": 0}
{"text": ">That’s a wildly simplistic view of moral hazard \n\nIts reddit. I was on my phone. Were you expecting a dissertation on risk? :)\n\n>companies paid\n\nYes you're right. I worded that poorly. What I was getting at is the point that we (the public) see a lot of news and narrative about how the government constantly wastes money, or favours companies at the expense of the taxpayer - with very little counter narrative about the positive effects of (some) government interventions. It's all downdowndown, with no up at all.\n\nThese narratives then feed into the public losing trust in government. \n\nI think a more nuanced view is necessary, and having some \"good\" news helps with that. So I disagree with you that this point is trivial - but I think I'm thinking of a different audience than you are.\n\nCheers.", "label": 0}
{"text": "It always struck me that astronauts don't have time to do things just because they \"can\". I always imagined it's like a sci-fi movie and they're doing their best to survive 😂.\n\n\nThank you for painting this new image of you doing things out curiosity.\n\n\nBest of luck to you 🫡", "label": 0}
{"text": "I like your choice in gloves. Those are my favorites.", "label": 0}
{"text": "Formerly Boeing Defense, Space, and Manufacturing. They had to rename after some supply chain issues against a dominant competitor.", "label": 0}
{"text": "It looks like it belongs as a Pink Floyd album cover", "label": 0}
{"text": "Really interested to have OP confirm which one it is, but love the list new of docs to add to my list.", "label": 0}
{"text": "Hello u/SnooGuavas5951! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "Aren't orbital based or Lunar based telescopes much better? In a few years you will be able to launch a constellation of telescopes that will outperform anything ever imagined. Plus a lunar radio telescopes on the dark side would be a hundred times more powerfull.", "label": 0}
{"text": "Yea but have you considered rocket man bad?", "label": 0}
{"text": "If this were glass art or \"snow\" globe I'd love to own it.", "label": 0}
{"text": "I remember seeing a nice post on r/food. I think some dude made a nice looking pork belly, so I went to their profile for other posts and it was only pictures of his hog.", "label": 0}
{"text": "I see this kind of picture all the time when I break my LCD monitor.", "label": 0}
{"text": "The is horrifying to think of. Why do people think that's a good idea?", "label": 0}
{"text": "None of that will happen. The costs of such telescopes would be gigantic. And I'm not talking about rockets to launch them, this was always just fraction of the cost.", "label": 0}
{"text": "If by people you mean corporations, it's money. If you mean the poor, we'll nobody asked them.", "label": 0}
{"text": "In fairness thats what they said about reusable rockets. \"Never\" is a long time that too often happens quickly.", "label": 0}
{"text": "Should Boeing sell its space division to another firm, it would freely concentrate on its traditional commercial aviation business and begin full-rate production of the MQ-25 Stingray.", "label": 0}
{"text": "Just like the blimps BladeRunner showed us.", "label": 0}
{"text": "Begin again in a world of opportunity…", "label": 0}
{"text": "it's just cool. it's like exoplanets. they weren't surprising or unexpected or thought to be rare or any of that, but it was still cool when they found the first one.", "label": 0}
{"text": "That would be way more expensive than it could possibly be worth.\n\nJust because I see a Nike tick in the sky doesn't I'm gonna buy some Jordans.", "label": 0}
{"text": "Fortunately we are safe from that being launched from the US. 51 U.S. Code 50911 prohibits the issuance of licenses and launches for activities involving obtrusive space advertising. ", "label": 0}
{"text": "Direct to your existing device, no need for a special terminal. Game changer.", "label": 0}
{"text": "I will when I see it i'm in the process of watching a bunch of these. I really want to find out who the lady was who talked about the research that led to her being depressed.", "label": 0}
{"text": "Headline is clickbait. \n\n64m2 = 8 x 8m. \n\nThe Hubble ST is 14.2 x 4.3m = 57m2 cross section at a similar altitude.\n\nCan you see HST flying by?", "label": 0}
{"text": "Supposedly we have spy satellites pointed at earth with folding fabric antennas that are that large.", "label": 0}
{"text": "“We know it was us who scorched the sky…”", "label": 0}
{"text": "Kurzgesagt released a video a few months(?) back that exactly covers the content you're describing.\n\nThe name was something along the lines of \"What happens when the universe ends\" or \"What's the last thing to happen in the universe\"\n\nHope this potential lead helps..", "label": 0}
{"text": "[Hubble can be seen with the naked-eye](https://asd.gsfc.nasa.gov/archive/hubble/operations/tracking.html#:~:text=Hubble%20completes%20one%20full%20orbit,fast%20moving%20spec%20of%20light.)", "label": 0}
{"text": "In what universe is \"all equipment worked perfectly as programmed and hit all the target numbers within the alorted time\" not working fine? \n\nWhat happened was that they accidentally put the wrong tolerances in for how fast things were allowed to throttle back up. It's like going 55 in a  60 and still getting to your appointment on time.", "label": 0}
{"text": "Maybe for now that's the case", "label": 0}
{"text": "https://m.youtube.com/watch?v=uD4izuDMUQA#\n\nIs this it?", "label": 0}
{"text": "Telescopes often collect light for hours or days. It’s not a single snapshot. Satellites hurt a lot of wide field astronomy shots. It’s a real problem. Space belongs to everyone. Light pollution is a real issue.", "label": 0}
{"text": "(I work in TV News) \n\nI just sat down with someone from the SPWC and was asking about this.\n\n  \nHere's a quote I pulled from the interview related to this:\n\n\"There's no essential definition it's just that period of a couple of years of the highest sunspot activity. So every month we're measuring we're counting the sunspots. We also count we are also measuring radio emissions. There's different ways we can determine the solar maximum, but essentially it's the number of sunspots. And we're in that period now when we're seeing the most sunspots. And so the last couple years we were picking up we were in a kind of peak phase. Now it'll be another year or two that will start going down from that peak phase. So essentially it's a three or three or four year period of of sunspot activities our sunspot man our solar maximum perfect,\" - Bill Murtagh, Program Coordinator of NOAA's Space Weather Prediction Center. \n\n  \nI'm not 100% sure this answers your specific question, but it's kind of a loose and fast term it seems.", "label": 0}
{"text": "So just like the land and the water were polluted to the benefit of they wealthy few, then left to be someone else's problem and cost to clean up.  They will pollute space, make a fortune for a few, then walk away and leave it to someone else to fix and pay for the problem they made.", "label": 0}
{"text": "Nuke the entire site from orbit. It's the only way to be sure", "label": 0}
{"text": "Space belongs to everyone but arguably there are a lot more “everyones” who benefit from 5G than astronomers who benefit from deep space observations. \n\nThis is a case where two groups’ interests are in direct mutually exclusive conflict. Somebody is going to lose out on their interests.", "label": 0}
{"text": "Mostly that the launch infrastructure for cheap satellites could lead to many uses that more people wouldn't support.\n\nPoor terrestrial 5g is more thanks to capitalist bullshit than anything else.", "label": 0}
{"text": "Such an insanely privileged and ignorant comment.", "label": 0}
{"text": "Tell me you had Phil Lesh playing when this ice formed..", "label": 0}
{"text": "In theory yes but you'd need a absolutely massive array floating around the L1 Lagrange point to have measurable changes. \n\n  \nI hesitate to even do the math but you'd likely be better off using that money to build protected bike lanes in various cities around the world instead from an emissions perspective.", "label": 0}
{"text": "That's a ridiculous slippery slope fallacy. Not having low internet isn't going to cause people to die.", "label": 0}
{"text": "*We don’t know who struck first, us or them, but we know that it was us that scorched the sky. At the time, they were dependent on solar power and it was believed that they would be unable to survive without an energy source as abundant as the sun.*", "label": 0}
{"text": "Nah the speakers get placed all around the city on 5G poles, since they're being used for absolutely nothing else as it stands.", "label": 0}
{"text": "As an American company, they are subject to FAA and FCC rules no matter where they operate in the world.", "label": 0}
{"text": "This is different. Just saying. We feel special.", "label": 0}
{"text": "Really good that the US is now completely reliant on Musk for space access. The idea the NASA probably won't make it to its centennial is really sad to me.", "label": 0}
{"text": "64 square meters. If you divide the area of the LEO shell by the number of objects, each object gets something like 50,000 square miles. \n\nThese object do not emit their own light. And in LEO, when astronomers are making observations, they’re eclipsed.", "label": 0}
{"text": "These days, they're prolly just invented by social media consultants to drive engagement. In the old days, it was just idiots.", "label": 0}
{"text": "Yeah. Goes to show that they're no longer an engineering company at its core but an investment trust.", "label": 0}
{"text": "With that logic in mind, are you suggesting that light pollution is going to cause people to die? I think accessing the internet and the vast information that comes with that could actually save lives. I don’t think the same could be suggested for interfering with someone’s telescope…", "label": 0}
{"text": "*facepalm* nicely done, you got me.", "label": 0}
{"text": "Because knowing things that other people don't know feels good. But it's difficult to know actual real things that other people don't know, you need to study, or discover something new, or really research. And much more so to do this in a field that people are interested in or have opinions on \n\nSo it's much, much easier to just make something up or believe something untrue. That way, you instantly turn everyone else into, in your own mind, \"someone that knows less than me\" \"someone that is stupid and believes the mainstream story\"", "label": 0}
{"text": "With raptor 3 they would not need the large heatshield at the bottom of the booster, and they hope to integrate the hotstage ring in future iterations", "label": 0}
{"text": "Starlink is almost impossible to see in a dark sky, unless its immediately after a launch.  U sure you aren’t seeing any of the thousands of other satellites that are brighter?", "label": 0}
{"text": "Probably not the way to get public support for a booming space industry. Suicide bombers will start sabotaging launch pads and launches in the name of saving the night sky.", "label": 0}
{"text": "Seems like this will push for more space telescopes and be better for astronomy as a result.", "label": 0}
{"text": "There is a vendiagram somewhere with MAGA people and these people and it overlaps.", "label": 0}
{"text": "> watch out for the Moon.\n\nI mean, if you're an amateur astronomer, you're well aware that a full moon sucks for viewing and new moon nights are way better.", "label": 0}
{"text": "Capitalism has elevated more people out of poverty than all other economic systems in human history, combined. I think MAYBE it’s modern style corporatism and crony capitalism that you really have an issue with?", "label": 0}
{"text": "Ahh thanks, i only speed read the article, didn't listen / watch. Could've sworn it mentioned Musk, but I'm probably wrong.", "label": 0}
{"text": "Neither is about saving lives. Don't be silly. If you are in a situation where you need the internet to survive, you made a lot of mistakes to get into that situation. You can also have the internet without sky obstructing sattelites. You are making another slippery slope fallacy.", "label": 0}
{"text": "Actually about 250, eventually. But wait till you hear about the 30,000 Elon wants to put up there…", "label": 0}
{"text": "How do I make this my Homescreen?, I'm android.", "label": 0}
{"text": "lmao...is that you kamala...if you truly love venn diagrams...never mind...keep doing what you do...", "label": 0}
{"text": "Yeah, but Starlink isn’t this bright", "label": 0}
{"text": "That is a very specific reference to idiocy", "label": 0}
{"text": "Or they can launch from Russia.", "label": 0}
{"text": "But the LEO starlink satellites are directly causing the smearing of white lines across long exposure photography, and they can be observed with the naked eye because they are reflective.   \nYou can tell if it's a starlink because on a single line in the sky you can see a new satellite refresh the same orbit 5 seconds later.   \nI don't live in the u.s and your space trash has directly affected my view of space, it's a modern travesty. Thank God LEO satellites have a relatively quick de orbit, but it's crazy they're just gonna keep sending them up.", "label": 0}
{"text": "Not yet. Once Starlink has to build larger satellites to comply with FCC interference regulations (because they can’t comply currently with their smaller sats), they will be comparable in size to the AST sats.", "label": 0}
{"text": "It’s unclear why anyone would want this business given its track record, and particularly in comparison with the progress made by other commercial players.", "label": 0}
{"text": "Because stupidity was left outside Nasa space program", "label": 0}
{"text": "It’s basically just a circle", "label": 0}
{"text": "Anyone who believes in conspiracies as absurd as the moon landing being faked doesn't deserve anything other than mockery", "label": 0}
{"text": "No I got that part. You’re missing the point about satellites impacting a still negligibly small part of the night sky in exchange for providing a major quality of life improvement to countless people living in poverty around the world.", "label": 0}
{"text": "There is probably a long answer, but basically they’re morons.", "label": 0}
{"text": "I got that. I’m looking at the costs and benefits. You’re only looking at the costs.", "label": 0}
{"text": "That’s why they created project blue beam to blast Painting Manning and prescription med ads repurposing popular music not an alien invasion like has been hypothesized.", "label": 0}
{"text": "I agree. Rush Limbaugh was a pioneer in this industry.", "label": 0}
{"text": "There are some other theories but big bang so far is the most well supported.\n\nhttps://www.space.com/24781-big-bang-theory-alternatives-infographic.html", "label": 0}
{"text": "Lies! Who would believe such nonsense. It was Kubrik, not Hitchcock.", "label": 0}
{"text": "\"That’s bad news for astronomers as the massive arrays outshine most objects in the night sky, obstructing observations of the universe around us.\"\n\nSounds like bad news for everyone.", "label": 0}
{"text": "I think alot of people are ignoring the fact that when we have 25,000 of these things in space, per company, per country and it's all on a 0 oversight, 0 regulation basis we're just on a hurtling speed toward never observing the night sky like our ancestors did.   \nAll so some dude can access netflix in Antarctica and be like \"science is cool bruh\". Space is cooler....   \n  \nYes the fcc exists, so does russia, so does China, they'll follow suit soon enough. The fcc won't do Jack.", "label": 0}
{"text": "Why do you believe in it? What's the absolute undeniable proof they went...", "label": 0}
{"text": "I've always wondered who started it. I picture some 13 YO saying to his buddy, I've got a great idea for a prank!", "label": 0}
{"text": "Why so angry?  And no, owning a set of eyepiece filters for planetary observation does not necessarily correlate with knowledge of the recent demise of a major retailer.", "label": 0}
{"text": "I used to think it was just about feeling \"in\" on some secret knowledge. But as I see half the country more and more attack intellectualism when we used to celebrate it (like when we were sending people to the moon), now I just think knowing there are people out there who could accomplish a feat like landing on the moon makes a large group of people feel too inferior and they don't know how to deal with it like grown ups.", "label": 0}
{"text": "The basis of the argument is that it is too difficult. The goal was to upstage the Russians, and if you could achieve that without actually doing the thing, that would be the smart thing to do. The thing is, in those days, television and filming etc was really immature, and difficult. It was actually easier to go to the moon than fake 140 minutes of live footage of a moonlanding and moonwalks. The tech to bring people to the moon existed, the tech to fake the footage didn't for three decades yet. Aside from that, every argument it was faked has been debunked, to the point that the burden of proof is well in the camp of the deniers.", "label": 0}
{"text": "That’d be prohibited by ITAR.", "label": 0}
{"text": "Hello u/Big-Box1371! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "No clear night sky until you drink your verification can!", "label": 0}
{"text": "I don't know. There's nothing wrong with saying that. I also don't believe in making up stories to fill in the gaps.\n\nTo further clarify, my understanding of the \"big bang\" is that nothing \"banged\". Space, time, matter, energy, everything we know as \"the universe\" was in a singularity, something insanely small, and then it rapidly expanded into the beginning of our universe. We have substantial evidence of this. We don't, however, know what caused it, whether anything existed before it, or even really how it happened.\n\nI'm totally fine with this. It means we have more amazing things to discover.", "label": 0}
{"text": "Well, actually, the universe only started existing three seconds before this comment was posted.  No need to thank me.", "label": 0}
{"text": "Delusional, would you ride on that?", "label": 0}
{"text": "“Think of how stupid the average person is, and realize half of them are stupider than that.”\n\n― George Carlin", "label": 0}
{"text": "Or to be punched in the face by Buzz Aldrin", "label": 0}
{"text": "That video is absolutely amazing. I love it.", "label": 0}
{"text": "there are people, that think the earth contains a hollow world with lizard people living in it. you expect too much", "label": 0}
{"text": "Obligatory Mitchell and Webb: https://youtu.be/P6MOnehCOUw?si=vzLUYglKHempLjvT", "label": 0}
{"text": "Because any scientific or technical achievement made by any organization in the world should be verified by another organizations and individuals not affiliated with that organization.\nThe only one 100% way of verification today as I can see it - is flying there and making some high quality videos of landing sites, especially showing space suit footprints (if they are still visible), and other stuff left by astronauts.\nHistorical footage of landing, radio communication, photos, stones etc cannot prove anything. Photos of moon orbiters cannot show footprints unfortunately, only traces of rovers. But rovers presence doesn't prove a human presence. \nSo nowadays you either believe NASA, or doubt, or don't believe.\nSorry for possible mistakes (non native English speaker)\nNow downvote me for being the adept of critical thinking.", "label": 0}
{"text": "China, India, and South Korea all have photographic evidence of the Apollo 11 landing site.", "label": 0}
{"text": "Nothing is sacred anymore, everything is for sale.", "label": 0}
{"text": "Leo satellite aren’t new to starlink.  You wont be able to see geo satellites with your naked eye.  They are only a tiny streak in a telescope long exposure.", "label": 0}
{"text": "You're so close, it was actually started last Thursday. \n\ns/", "label": 0}
{"text": "My wife doesn't believe Apollo 11 landed on the moon. She believes that the Apollo program did go to the moon, just that Apollo 11 wasn't the first one. When I question her about it, she doesn't give me any particular reason why she believes that, but she is so adamant about it that I'm not sure if she actually believes that or is just fucking with me.", "label": 0}
{"text": "r/globskepticism is full of people who believe things like that and that space is fake", "label": 0}
{"text": "And the more you point out that they are wrong, the more validated they feel. It's the persecution complex: they must be right if they are persecuted for their belief. If they were wrong, no one would care. That so many people call them out, it must be true.\n\nThe exact same mechanisms work in many groups. Politics, social groups, religions, ... being persecuted for being on the \"inside\" is a feature, not a bug.", "label": 0}
{"text": "Because they’re arrogant morons who feel “special” by not believing the same things as us “sheeple”.", "label": 0}
{"text": "Is that a serious question? We have moon rocks that were examined by independent laboratories, we have video evidence, we have thousands of photos (and the negatives) that were also examined and determined to be authentic...\n\nHow can you possibly deny any of this?", "label": 0}
{"text": "Gatorade would like a chance to submit a proposal", "label": 0}
{"text": "Because it be comparatively cheap id think? Boeing would have to subsidize future continued losses on the fixed price contracts including starliner or take that into account for the selling price.", "label": 0}
{"text": "Hello u/MajesticPost6092! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "what if they open up Espacia Dos Equis?", "label": 0}
{"text": "People in 3rd world countries that now have the ability to connect more easily to the world, and each other during natural disasters, are gonna be pissed when they can't see an unobstructed constellation as they float along at night in a rescue boat during a flood. /s", "label": 0}
{"text": "Im sure NASA burning ammonium perchlorate is less harmful than dumping some water on a wetland", "label": 0}
{"text": "Mythbusters busted all the myths.  Still blows my mind that people think it was fake.", "label": 0}
{"text": "What kind of framerate do you want? Earth is spinning at such a slow rate that any normal movie framerate would make it look stationary.", "label": 0}
{"text": "Soviets Lunohod also had laser reflectors, it doesn't mean Soviets had humans on the Moon. Soviets retrieved lunar samples. It doesn't mean they been there. You cannot prove anything about technology of those times. Not every technology is public.", "label": 0}
{"text": "Glad you're back on the Station so we can get your posts here", "label": 0}
{"text": "Now THAT's funny!\n\n(need more words so I'm not bot booted)", "label": 0}
{"text": "* What time of night do you observe things which are close to the Sun?\n* If they're eclipsed, are they still bright enough to be seen by some telescopes?\n* Do they block photos from any object that happens to be behind them?", "label": 0}
{"text": "Why fold? Just have astronauts assemble it.\n\n\nYou need to stop thinking like we don't have ways to get humans to and from orbit anymore. Starship is VERY close to being approved to haul humans.", "label": 0}
{"text": "I’d just say the pros considerably outweigh the cons if it’s just astronomy shots we are concerned about", "label": 0}
{"text": "Please do it, that would be fantastic. ", "label": 0}
{"text": "I hear Brawndo has electrolytes.", "label": 0}
{"text": "Show us the rocket that can launch a telescope with a 30m diameter aperture.", "label": 0}
{"text": "Big dumpster next to tower.", "label": 0}
{"text": "The Soviet reflectors were mounted on rovers and only used for the duration of the mission. The US reflectors were manually placed and in use for decades. Still used today I think.\nThe US collected 100's of lbs of samples, neciisitatinh manual csllection, the Soviets just a few ounces.\nAnd then there's the massive rocket, visible tracks, etc.", "label": 0}
{"text": "What does that get you, can it see farther and clearer than a space telescope?", "label": 0}
{"text": "In Heinlein's *The Man Who Sold the Moon*, the character DD Harriman has a meeting with the president of the Moka Cola company, surprising him by wearing a pin with the logo of a rival soft drink. Harriman then says that he had been approached by the rival with the idea of spreading reflective material over the moon to create a gigantic advertising logo that would be visible every night. He then steers the conversation to the possibility that the USSR might do a similar thing, except with the hammer and sickle.\n\n\"You know how fond they are of those big banners in their parades\"\n\nThis convinces the Cola tycoon to contribute money toward Harriman's moon rocket project, so they can get there first and establish a precedent that the moon should remain sacrosanct.", "label": 0}
{"text": "We shouldn’t be trying to politicise the post, but just to be clear, as a non-American, living outside the US, I prefer truth and not constantly made-up bullshit that is made up to threaten democracy. All the crap coming out of dear leader’s mouth doesn’t just end at the US border - there are also idiots abroad who take him at his word. \n\nIf MAGA leaders told us that the moon landings were fake, vast majorities of people would believe it. Even those that support them must see they tell some “fibs” every “now and again”…", "label": 0}
{"text": "A larger telescope gets you more photons. And less expensive upgrades means you get new types of instrumentation.", "label": 0}
{"text": "bro looks like he’s gonna build the next *Dog Bed By Stella*", "label": 0}
{"text": "Brawndo. It’s what plants crave.", "label": 0}
{"text": "Oh wow a law , surely no one will break it , especially a billionaire.", "label": 0}
{"text": "Enjoy this meteor shower with a delicious Charleston Chew!  Arrooooooo!", "label": 0}
{"text": "The bright red night glow of Kenny Roger's Roasters.", "label": 0}
{"text": "I was outside for about an hour two nights ago and saw a like a dozed Starlink satellites, and I live in an urban area. And yes, they were Starlink, checked it live with Stellarium.", "label": 0}
{"text": "Is there no way to stop them? Can't even look up at an unspoiled sky without the gods of capitalism taking their share?", "label": 0}
{"text": "It can yes, VLT is very large and uses some cool atmospheric “noise canceling” tech to get some very clear and important science that small space telescopes aren’t big enough to see. Look up VLT vs JWST. \n\nhttps://www.eso.org/public/images/\n\nThe big one that first comes to mind is the black hole images we got in 2022", "label": 0}
{"text": "I was leaning towards Def Leppard", "label": 0}
{"text": "Almost 700 sq ft when it's fully unfurled", "label": 0}
{"text": "BUT you will be able to pay a monthly fee to see the natural sky without ads.", "label": 0}
{"text": "A new life awaits you in the Off-world colonies! A chance to begin again in a golden land of opportunity and adventure!", "label": 0}
{"text": "You mean the one with a CEO who's basically telling the Justice department to suck it after they told him he's running an illegal lottery?", "label": 0}
{"text": "this is truly beautiful and mesmerizing the way the light  is interacting with the ice", "label": 0}
{"text": "Good thing the 2nd Amendment allows for the possession of private anti-satellite weaponry.  Won't be cheap, but will be legal.", "label": 0}
{"text": "Tell that to people who live in remote party of the country. I personally know many people who would have no phone or internet if it wasn’t for starlink. That’s in the USA, imagine rural parts of Namibia or the Australian outback.", "label": 0}
{"text": "Lmao, same starship that went to the ISS flawlessly? I don’t get it honestly, this subreddit has gone from r/space to r/SpaceX. Seriously, why are so many people here calling astronomers crybabies and saying their research isn’t important in *r/space*", "label": 0}
{"text": "You gotta get out of your moms basement and look up", "label": 0}
{"text": "No, but I'm upset, angry, tired and stupid right now.", "label": 0}
{"text": "In my experience, publicly traded engineering firm grow through acquisitions, so they purchase small firms that are actually creating value, they suck the value out of them, and move on.  It’s incredibly destructive.", "label": 0}
{"text": "Are you just ignoring the massive quality of life increase that comes with global wireless broadband? Sure some people with get wealthy (especially all the middle-class people with stock in these companies) but that’s no reason to not use this kind of tech to improve millions of people’s lives.", "label": 0}
{"text": "That just means we should start building more telescopes beyond earth orbit.", "label": 0}
{"text": "There was that old joke saying that if the Soviets got the to the Moon first they'd paint it red, and the Americans would then go and paint \"Coca-Cola\" on it.", "label": 0}
{"text": "Oh I see the confusion. It's just a thing humans do sometimes. When a certain topic comes up, sometimes they'll talk about a related topic. That's what they were doing here.", "label": 0}
{"text": "Can we not full the night sky with a bunch of shit please", "label": 0}
{"text": "I understand the outrage I do, but I think the benefits outweigh the unfortunate.  Their satellites will provide direct to cellular communication… meaning people in emergency situations outside of cell tower range will now be able to call for help.\n\nSaving lives.  Does staring up at the stars save lives if there are no satellites blinking across the sky?  Maybe, I don’t know.  But for now I’m convinced until there’s an alternative", "label": 0}
{"text": "Just before sunrise, or just after sunset, when the sun isn't very far under the horizon and still illuminates the low flying sats. Hardly ideal time for astronomy.\n\nIn the middle of the night the sats overhead are in Earth's shadow and you can't see them. It's a made up pseudoproblem.", "label": 0}
{"text": "This is awesome! So creative too, good science-ing!", "label": 0}
{"text": "Hi ropeless__homantic! Thank you for your submission! Unfortunately, your submission has been automatically removed because the title contains \"**TIL**.\"  Please delete and resubmit without \"**TIL**\" in the title. Thanks for understanding.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "Half the people on this sub seem to think light pollution is great.", "label": 0}
{"text": "Solid cite! Why do you know that? \n\nAlso, it can totally still happen as long as it’s classified as it’s nonobtrusive. Space commercial speech will be a whole new area of First Amendment law to fight over!", "label": 0}
{"text": "I would say that Space Force might have something to say about it.", "label": 0}
{"text": "This was also before Einsteins theory of general relativity as well it was pretty much based from Newtonian physics", "label": 0}
{"text": "I find it amusing how most pictures from ISS are presented with everyone and everything seemingly oriented in an \"up\" position when there is no \"up\" in orbit.", "label": 0}
{"text": "Well yeah, they are under ITAR restrictions too, of course.", "label": 0}
{"text": "Starships current payload bay has 17 m diameter and it’s only only going to get wider baby! We’re going to have massive telescopes in space and it’s gonna be awesome.", "label": 0}
{"text": "Not really, I've seen the photos with the SpaceEx people standing below it, the rocket is massive.  The size of the explosion is relative.  Huge rocket hitting hard and tipping over is going to make a hell of a mess along with some kind of explosion.  Not going to be pretty but compared to other rockets that abort and crash during takeoff, loaded with fuel, I don't think it would be on that scale.  \n\nJust super excited it didn't happen.  One of the most amazing things I have ever seen.", "label": 0}
{"text": "Yeah that's what I want to know more about. If it was a medical issue they had already it could be a one off thing but if it is due to how long they were in space this is a serious issue that will need to be planned for on long space journeys such as going to Mars. I hope NASA has more publicly available info on the reason later.", "label": 0}
{"text": "The largest radio antennas in orbit today are 100 meters, but they aren't smooth enough for high frequencies.", "label": 0}
{"text": "None of that makes any sense. Distance is distance.", "label": 0}
{"text": "Hello u/ContestStriking531, your submission \"Distance of andromeda galaxy relative to how far away it is visually\" has been removed from r/space because:\n\n* Such questions should be asked in the [\"All space questions\" thread](https://www.reddit.com/r/space/about/sticky) stickied at the top of the sub.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "I'm not sure what you mean by \"visual distance\". From our perspective all celestial objects are effectively projected onto the inside of a flat 2D sphere, we have no real way to judge the distance with the naked eye.", "label": 0}
{"text": "Much more succinctly and tactfully put than myself 😂.  I’m optimistic for the benefits to society whether it’s emergency communications, or better/easier access for developing low income nations to a critical infrastructure.  I’ll probably just leave it at that.  Happy for others to disagree.", "label": 0}
{"text": "The EHT doesn't have enough money today to add even 1 satellite to that world-wide array... extremely expensive. There are a few papers about it.", "label": 0}
{"text": "I think what they think they are asking is where would Andromeda be now if we were seeing it in real time v where we measure it to be (but it was there in the past).\n\nSo, okay, since it's moving toward us, yes, it's closer than it appears, so the calculation could? be correct.", "label": 0}
{"text": "It's roughly 932 lightyears closer than when the light left the galaxy.", "label": 0}
{"text": "Yeah, I'm one of the few (as are probably many in this subreddit) that never stopped having the dream of bring an astro/cosmonaut, and to talk to a real one is something special. I guess the equivalent of some popstar chatting with teens on one of their subreddits :)", "label": 0}
{"text": "Attacking a satellite in the GEO belt is much harder as rides to this altitude are much less frequent and more costly and economics usually dictate that any spare launch vehicle capacity goes toward topping off the fuel tanks of the main satellite, so they very rarely have options for rideshares that might be affordable.  So access is very expensive, and rare.  On top of that the greater distance to earth makes the communications to control the spacecraft more difficult and much more regulated due to competition from telecommunications companies.  So it's unlikely anyone is able to easily sneak up  there.  Not impossible though, it just really cuts down on the list of potential groups that could pull this sort of thing off.  It's much more likely the propulsion system failed on its own, especially given previous issues they reported.", "label": 0}
{"text": "I knew it from discussions in the past so I went to the space advertising Wikipedia page and copied from the regulations section", "label": 0}
{"text": "What if you made the world's largest potato gun?", "label": 0}
{"text": "You still may not use it to commit vandalism. And the ballistics of a potato are always, at best, suspect.", "label": 0}
{"text": "I remember years ago hearing about an astronaut who opted out of a scheduled Starliner space flight due to family obligations (like his daughter’s wedding or something…) and it was presented as this big deal that an astronaut would do that, and all I could think was that opting out of a Starliner space flight is hardly letting go of a sure thing. What a screwup Starliner is. This is what happens when a bunch of finance bros and MBAs take over.", "label": 0}
{"text": "Soon... Sun Tax. Want the sun over your home/town? Pay the tax and we will move the satellite for a time based on the payment plan you choose.\n\nI hate how our current society has made this the first thing that came to my mind.", "label": 0}
{"text": "Very cool!\n\nAlso funny to think of ISS and NASA as just a very, very expensive “let’s see what happens if we put it in the freezer!”", "label": 0}
{"text": "Yeah well everyone who builds cellular towers have made it absolutely clear that they do not want to provide coverage to regions without a sufficiently large customer base. They might consider it if the government sponsors the construction at utterly absurd prices.", "label": 0}
{"text": "Netflix has “inspiration 4” documentary series.\n\nEveryday astronaut has like a dozen.  “Will raptor be the king of rocket engines is the best”\n\nBut he easily has 6 AMAZING documentaries.", "label": 0}
{"text": "https://youtu.be/LbH1ZDImaI8?si=-BRbU88_VjZGaiEU\n\nhttps://youtu.be/KA69Oh3_obY?si=GWGdrTqlFymVStb2", "label": 0}
{"text": "There's several youtube channels that cover basically everything SpaceX does as it becomes known. (The Launch Pad, Marcus House, NASA Spaceflight, Spaceflight Now, Scott Manley, Everyday Astronaut, ....)", "label": 0}
{"text": "Thanks! I’ll check those out. I’m actually planning to create a 3D VR presentation on recent space missions, so this will be super helpful!", "label": 0}
{"text": "And the point would be?\n\nHint: Satellites aren't there to take pretty pictures so someone can watch a video over chips and beer.", "label": 0}
{"text": "I thought ASTS is the one that is doing the light pollution", "label": 0}
{"text": "I imagine it's like going from being on a ship to dry land but more extreme. Our like when you get off of a trampoline after jumping on it for a long time", "label": 0}
{"text": "Cheap can become very expensive when decision makers think its just a financial exercise. Had an opportunity where a seller offered a reserve payment to buyers covering projected losses. No takers. Uncertainty was too hard to hedge into a reasonable risk…", "label": 0}
{"text": "I don't think other countries care about US codes.", "label": 0}
{"text": "The content that I love to read and learn - thanks", "label": 0}
{"text": "It’s not like satellites launched from elsewhere can just fly over to the space over the US.", "label": 0}
{"text": "> Have you ever seen passing satellites very early in the morning? These things are fucking big not tiny tiny objects flying past fast.\n\nIf you're going to pretend to know what you're talking about, do a little research first. At least then you'll know just how utterly ridiculous your fabrication sounds.\n\nSource: Decades as an active astronomer, with experience tracking satellites.", "label": 0}
{"text": "If we’re talking about safety services, groovy. For that, do they need to be this size, do we need that many of them, do we want it to be tied to someone’s product offering and / or profitability margins?\n\nFor what it’s worth, commercial alternatives already exist, with much lower impact (i.e. fewer and/or smaller satellites).", "label": 0}
{"text": "My brain cannot make sense of this. It looks like a cartoon.", "label": 0}
{"text": "It's hard. They've very dim to begin with, so hard to spot even within our galaxy. Just goes to show how sensitive JWST is.", "label": 0}
{"text": "For Starbase and Starship stuff, the closest thing is Everyday Astronaut's video tours on Youtube. \n\nFor Falcon 9, 'Return to Space' on Netflix is probably the closest to what you're looking for. The Inspiration4 documentary is another one. Jared Isaacman said there'd by a Polaris Dawn documentary out eventually but no word on that. National Geographic also has an older one on the first Falcon Heavy landing I believe", "label": 0}
{"text": "> they aren't trying to control the conversation while still exerting a ton of control over it\n\nIf you mean that like we're trying to support Elon Musk I can't stress enough how much I dislike him and think he's a terrible person.\n\n>Other submissions (like this one) have been shadowbanned from appearing\n\nYour post was [removed automatically](https://i.imgur.com/xTzU59Q.png) for crossing the report threshold.  It stayed removed because, like you acknowledged, it was a duplicate of another post made a couple of hours before yours.  I'll admit to not always catching them, but duplicates are something we care about, behind the questions thread they're the second most common reason I remove posts.\n\n>one submission has been kept up with locked comments\n\nReality is I just don't have the time to moderate a thread like that.  This sub's always tried to be strict about comments/posts being directly space related, and politically charged threads like that always end up with a *lot* of off topic comments.  Locking the post allows the post itself to stay up, but stops the off topic comments.\n\nThe discussion about the political ramifications of what Elon Musk's up to is happening all over reddit, on news and politics subreddits and on heaps of other general purpose \"post anything\" subreddits.  From my experience any big subreddit that isn't moderated to stay on topic ends up blurring together with every other big subreddit, with the same posts and the same discussions duplicated between all of them.  I don't want that to happen to r/space/", "label": 0}
{"text": "Hello u/liuyang61, your submission \"(Qustion) Are there any documentaries on SpaceX's current projects and missions?\" has been removed from r/space because:\n\n* Such questions should be asked in the [\"All space questions\" thread](https://www.reddit.com/r/space/about/sticky) stickied at the top of the sub.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "I love Supramolecular Chemistry like this! Every little perturbation of a system affects the crystal shape/growth but doing it in 0g can change everything and you can learn so much!\n\nBy any chance, if you have access to a zinc source (ZnO, ZnCarb, or ZnAcetate works) some 1, 2, 4 triazole, and some oxalic acid (or sodium oxalate) then this material scientist has some ideas to pitch you that will make the zeolite stuff look old hat!", "label": 0}
{"text": "That's so cool!! I really appreciate you going out and getting to try new and fascinating ideas!", "label": 0}
{"text": "Time to get some laws on the books, companies don’t own space.", "label": 0}
{"text": "…The alternative doesn’t interfere with astronomy.", "label": 0}
{"text": "Guy you’re responding to should maybe start googling what he wants to say before he hits Reply.", "label": 0}
{"text": "Same for landing on the drone ships as well. I believe one did actually abort and hit the water bestide the ship?", "label": 0}
{"text": "“Drink your Ovaltine” is in our dystopian future, which is nice. A touch of nostalgia while you’re walking along the neon lit streets of new Seattle.", "label": 0}
{"text": "They aren’t launching this year and we all know it", "label": 0}
{"text": "No. It's perfectly possible to avoid if SpaceX doesn't go public.\n\nThe capital class' demand for line must go up quarter after quarter more and more ever more. Always. Is what ruins a company.\n\nNow more specific to Boeing was some Satan's lawyer level fuckery from McDonald Douglas when they \"merged.\" Read Boeing bought them out as they were failing but the fiction was better for everyone if it was a merger.\n\nLook it up but despite Boeing buying out mcdoug basically mcdoug levered all their execs in and forced Boeing execs out. Which stole the heart out of the legacy of Boeing and started rotting the corpse.\n\nSo no SpaceX doesn't have to go that route if A) they don't go out public and B) more specific they don't absorb the rotten corpse parasite of another dying company.\n\nSee Arizona tea company it's held by a family and runs very well while not constantly screwing over ever stake holder left right and center.", "label": 0}
{"text": "I hate this so much. I remember swing the Milky Way as a kid with wonderment at the stars…even some nebula. But now I can hardly see more than 20-30. Like 10 when I was in LA. Now this mess?", "label": 0}
{"text": "Then you have two options, get a better telescope or a better attitude.", "label": 0}
{"text": "Firstly, the common consensus was that they did not run the raptor at full power and didn’t use a full fuel load. Musk has said that the current payload to orbit is at around 50 tons. \n\nSecondly, the raptor engine’s thrust is expected to increase by as much as 33% over the next few years. If you add thrust, payload increases. I highly doubt they will add tons of weight and just choose not to optimize.", "label": 0}
{"text": "I'm not chosing to ignore anything. You are just arguing an absurd argument. Most people can't even afford Starlink in the world.", "label": 0}
{"text": "What the hell is the thumbnail?  Does not seem to be in the video. Misleading AF", "label": 0}
{"text": "Well duh that's how catching works. you can always opt out.", "label": 0}
{"text": "Spacenet that acts as a sweeper until it has a certain amount/mass of collected material. Then the net and material would have a thruster push the package towards earth to burn up in the atmosphere.", "label": 0}
{"text": "Thanks, that was neat. Learned a few things because of this. Seemed like a fair mix between facts and speculation. The speculation was interestingly creative and fun to think about. \n\nThere’s a progressive metal band I like a bit called Kardeshev. And now thanks to this video, I now know where the name Kardeshev comes from. Nikolai Kardashev, Soviet and Russia Astrophysicist, 1932-2019. Known for he Kardeshev Scale, “a method of measuring a civilization’s level of technological advancement based on the amount of energy it is capable of harnessing and using.” — [Wikipedia](https://en.m.wikipedia.org/w/index.php?title=Kardashev_scale&wprov=rarw1)", "label": 0}
{"text": "There is just way to much undeveloped land. It would be a massive waste of financial resources to place towers everywhere for complete coverage. Even worse real coverage is very commonly significantly worse than calculated coverage. \n\n\nThe difference between cell coverage maps and reality is massive and when it means being able to get emergency services that is pretty important.", "label": 0}
{"text": "Yeah that want in the video for sure. You’re right. Probably not the best representation. But the video was neat. I liked it.", "label": 0}
{"text": "That Red Bull guy jumped from space.", "label": 0}
{"text": "*puts on old man glasses*\nback in the day before digg collapsed and reddit was still young believe it or not this type of interaction happened all the time.\n\nThe top voted comment wasn’t some repeat meme or joke, it was a very thorough comment from a top expert in some random field that happened to dedicate their life to some crazy specific subject or the person who made the art or whatever the post was about.\n\n2006-2007 was a good vintage for reddit. Shame we can’t go back.", "label": 0}
{"text": "We have close up images from Mercury from the Mariner 10 (1974) and the Messenger (2008) missions. What's that bullshit about first images...", "label": 0}
{"text": "This is so incredible. How large is the circle that the water is in?", "label": 0}
{"text": "The channel is bot-generated clickbait that steals from legitimate creators.\n\n[https://youtu.be/McM3CfDjGs0?si=mEmPu43MLoJWwupy&t=665](https://youtu.be/McM3CfDjGs0?si=mEmPu43MLoJWwupy&t=665)", "label": 0}
{"text": "The internet has been a tremendous good. Literally bits the entirety of human knowledge at the fingertips of anyone with a connection.", "label": 0}
{"text": "Yeah, I've been around since the early days (I create a new username every other year), so I know the feels :(", "label": 0}
{"text": "Yes, because the best way to get good leadership is to underpaid them. It happens everytime because it actually works. Let the adults do the work.", "label": 0}
{"text": "The information in this video was very interesting and engaging. It was enjoyable, not sure about this bot generated or AI thing, maybe a few videos here and there. Pretty interesting and engaging channel overall. Better than most other stuff out there.", "label": 0}
{"text": "Ruin the night sky and see how fast humanity grabs the pitchforks and torches.", "label": 0}
{"text": "Just out of curiosity, those with high power telescopes, are your views being obscured?", "label": 0}
{"text": "I think some companies are working on debris collecting technologies. Like the ESA is working with SpaceX on something for this, some other countries have a national initiative about it. ts probably pretty difficult, but never underestimate human ingenuity... especially while SpaceX is helping everyone with their cutting edge technology", "label": 0}
{"text": "It is worth remembering that Kessler syndrome, if it ever happens, will be limited to specific orbit ranges (like say the higher parts of LEO), it wont just lock people out of launching satellites into orbits higher than the affected orbits, or into significantly lower ones.", "label": 0}
{"text": "A ban from doing any business in the U.S., asset seizure, deportation to the U.S. for prison time, negate brand image once the government puts them on blast, and if all that still fails, Anti-satellite missiles.", "label": 0}
{"text": "People keep saying this but they also don't seem to understand that in the event of a low orbit collision, there is a chance that the beris from the collision will shoot up into a higher orbit, until it loses energy again and finally deorbits.", "label": 0}
{"text": ">in the event of a low orbit collision, there is a chance that the beris from the collision will shoot up into a higher orbit,\n\nWhat would be the perigee of such an orbit?", "label": 0}
{"text": "Except that they are constrained to the laws of orbital mechanics.\n\nThere’s only two ways debris gains altitude.\n1) a pressurized piece of hardware leaks after a breakup and magically points in the correct direction\n2) the collision is rear to front between a higher eccentricity and lower eccentricity orbit.\n\nNumber 1 is extremely unlikely; leaking hardware is never passively stable\nNumber 2 is also extremely unlikely. We don’t place spacecraft in orbits that intersect others, and we adjust orbits as soon as they happen. More importantly, for it to be a relevant difference, the difference in eccentricity must be extremely high, which is rare for debris.\n\nAdditionally, boosted debris retain a periapsis at the collision altitude; where they will experience the highest drag. The result in LEO is that the debris returns to a circular orbit at its inclination very shortly after the collision, then slowly lowers its radius into the atmosphere.", "label": 0}
{"text": "According to your own [website](https://rosymatrix.com/?page_id=374) you already offer a rocketry course.", "label": 0}
{"text": "That’s even worse lol.\n\nLow earth orbit is great for satellites because Kessler cannot manifest dude the self-cleaning nature of those orbits. Placing them around the moon now constrains their use to a 12 hour period (ignoring that half of that period is spent behind the moon, making it 6 hours), and recreates the issue around the moon while simultaneously required excessively large launch vehicles to carry them.\n\nThe only way to make that worse would be to place them in a heliocentric orbit instead.", "label": 0}
{"text": "It’s more MEO and HEO. But those are far less popular and exponentially larger, so the only real region to concern yourself with is Geosynchronous and Geostationary orbits.", "label": 0}
{"text": "> The alternative doesn’t interfere with astronomy\n\nThat won't be a concern for policy makers because there might be as many astronomers caring nationwide as there are people protesting a new cellphone tower locslly. It's just a no brainer from an election perspective. Sats are perfectly \"out of sight out of mind\" for most voters", "label": 0}
{"text": ">Additionally, boosted debris retain a periapsis at the collision altitude; where they will experience the highest drag. \n\nI got another comment from someone who does not understand this...", "label": 0}
{"text": "Spaceship bodies are made of high purity metals. The parts are easy to recycle.", "label": 0}
{"text": "Here is something else to consider.... if you look back at test 4 of the starship, one of the 33 engines didn't light. That was no big deal. If 1 of the Saturn V engines didn't light, it would have been a catastrophic mission failure. So more smaller engines helps with redundant reliability.", "label": 0}
{"text": "I said the opposite. \n\nPlease read again.", "label": 0}
{"text": ">Do you prefer using theory or theory plus observations?\n\nI'd love to see where you got this info from.", "label": 0}
{"text": "I'd say it's more probable they don't make quality products any more", "label": 0}
{"text": "Acronyms, initialisms, abbreviations, contractions, and other phrases which expand to something larger, that I've seen in this thread:\n\n|Fewer Letters|More Letters|\n|-------|---------|---|\n|[ASAT](/r/Space/comments/1gd34fl/stub/ltz3kot \"Last usage\")|[Anti-Satellite weapon](https://en.wikipedia.org/wiki/Anti-satellite_weapon)|\n|[ESA](/r/Space/comments/1gd34fl/stub/ltyuwpg \"Last usage\")|European Space Agency|\n|[GSO](/r/Space/comments/1gd34fl/stub/ltz0qm0 \"Last usage\")|Geosynchronous Orbit (any Earth orbit with a 24-hour period)|\n| |Guang Sheng Optical telescopes|\n|[HEO](/r/Space/comments/1gd34fl/stub/ltyytuv \"Last usage\")|High Earth Orbit (above 35780km)|\n| |Highly Elliptical Orbit|\n| |Human Exploration and Operations (see HEOMD)|\n|HEOMD|Human Exploration and Operations Mission Directorate, NASA|\n|[LEO](/r/Space/comments/1gd34fl/stub/ltz4gxi \"Last usage\")|Low Earth Orbit (180-2000km)|\n| |Law Enforcement Officer (most often mentioned during transport operations)|\n|[MEO](/r/Space/comments/1gd34fl/stub/ltyytuv \"Last usage\")|Medium Earth Orbit (2000-35780km)|\n\n|Jargon|Definition|\n|-------|---------|---|\n|[Starlink](/r/Space/comments/1gd34fl/stub/ltyzcu1 \"Last usage\")|SpaceX's world-wide satellite broadband constellation|\n|[periapsis](/r/Space/comments/1gd34fl/stub/ltyygav \"Last usage\")|Lowest point in an elliptical orbit (when the orbiter is fastest)|\n|[perigee](/r/Space/comments/1gd34fl/stub/ltz3kot \"Last usage\")|Lowest point in an elliptical orbit around the Earth (when the orbiter is fastest)|\n\n**NOTE**: Decronym for Reddit is no longer supported, and Decronym has moved to Lemmy; requests for support and new installations should be directed to the Contact address below.\n\n----------------\n^([Thread #10745 for this sub, first seen 27th Oct 2024, 07:16]) \n^[[FAQ]](http://decronym.xyz/) [^([Full list])](http://decronym.xyz/acronyms/Space) [^[Contact]](https://hachyderm.io/@Two9A) [^([Source code])](https://gistdotgithubdotcom/Two9A/1d976f9b7441694162c8)", "label": 0}
{"text": "Space Debris is not rly a problem for most LEO constellations, but it's likely a problem for future space exploration. There are a lot of old cold war era satellites, and modern Chinese satellites that are defunct or have already been destroyed. As they are in higher orbit, they are not going to automatically burn down like western modern constellations, so eventually they will have to be dealt with. Hopefully with cheap access to space, Starship will be able to deliver vehicles that can clean up those orbits. NASA already has Planetary Defense Coordination Office, and Space Force has an interest in keeping it's military satellites, so we might see a joint project from them in next few years, especially that DoD likely already has technology that allows to get close to other satellites.", "label": 0}
{"text": "Hello u/Altruistic_Hotel_368! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "Then it should be very easy for you to share this literature with us, so we can use it as a source in the next discussion. \n\nYou know, as scientific literature is supposed to be used.", "label": 0}
{"text": "Growing semiconductor crystals in space sounds like an interesting idea. I don't know what kind of lattices you can get in low g compared to down here.", "label": 0}
{"text": "Okay. \n\nNow explain how this even remotely supports your initial claim:\n\n>From actual observations of ASAT tests, a small number of objects end up with a perigee above what's supposed to be possible.", "label": 0}
{"text": "_Most_ new rocket companies are either going hydrolox or methalox - that is, hydrogen, or methane, and liquid oxygen (\"lox\"). So they don't use any more oil that most outfits. It's the people using \"kerolox\" (kerosene and oxygen) that do that - *eg* SpaceX's Falcon 9. And even SpaceX is trying to move away from kerolox. \n\nBut that said, there's LOTS of new rocket companies, especially when you include Europe and Asia (particularly China - there's TONS of rocket companies in China). Not everyone is avoiding kerolox.\n\nHydrolox and kerolox both burn \"sootless\" - they produce (respectively) water, and a combo of CO2 and water, as exhaust. Which obviously has its own issues and concerns - but dumping oil waste isn't one of them.\n\n---\n\nThe main thing to remember about all of this is that at current levels of launches, rockets are dwarfed by things like the airline industry and shipping, even considering their prodigious exhaust. When you add it all up.\n\nAnd it's generally thought that the rocket market is in the process of \"maturing\" - that is, there's lots of startups because people see a lot of opportunity and are actively inventing new things. This won't last forever - eventually there will be a consolidation in the market, because the market will settle on several styles of transport. And then few players will survive. That's part of the reason for all the players now, they're all hoping they'll become one of the standards.\n\nThe big question everyone has is, what will the overall market look like after things mature? No one really knows. Everyone's got their own theory, and/or a way of looking at it.\n\nThe current problem with the rocket market is that it's _supply-constrained_ - if you want to launch your own comms constellation, you basically have to build your own rocket to do it. Because there's no time on the SpaceX launch schedule for you - they're too busy doing NASA, Space Force, NRO/DOD, and Starlink launches.\n\nSo the question is: what happens when supply is 100% fulfilled? Can it even be fulfilled at the prices companies could reach in 10-20 years? Perhaps the market is not that much bigger than it is now - but then people are betting billions that it is, at the same time.\n\nSo waste, in general, could turn into a major problem, both on Earth and in orbit, if the market goes gangbusters. It's hard to say. It depends how successful all these startups, and SpaceX, turn out to be.", "label": 0}
{"text": "Hello u/QuantumDriveRocket, your submission \"The First Real Images Of Mercury - What We Found?\" has been removed from r/space because:\n\n* It has a sensationalised or misleading title.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 0}
{"text": "As I said, complain to the licensing authority. Nobody puts up a satellite without permission.", "label": 0}
{"text": "It’s just greed. There’s no common sense or sensibility applied to this technology. Money is all that has gone into the planning and design.", "label": 0}
{"text": "Ah, I see that you are not in the slightest interested in an honest discussion. \n\nThe old \"bait and evade\" tactic of dishonest people. \n\nYou either link to a solid source supporting your initial claim or you be admit it was only hear-say on your part.\n\nBefore that I'll just rebuke you with your own silly comments slightly rephrased. That's a more sensible Sunday morning activity than entertaining your gishgallop and try to find sources which likely don't even exist.", "label": 0}
{"text": "no sorry, you'll have to accept that providing billions of people with low cost internet takes priority over your hurt feelings", "label": 0}
{"text": "That won’t stop the Chinese though, will it? Or Indians? Or Musk.", "label": 0}
{"text": "What interaction, besides accusations by tabloid?", "label": 0}
{"text": "More of an Elon hate bot invasion.", "label": 0}
{"text": "Why did it take you that long to post the link?", "label": 0}
{"text": "Yes! You do an observation of a few hours of e.g. a nebula, and you will have several streaks across from satellites. Only way to manage this is to split exposure and take several images, which are then lost processed to create your ‘long exposure’. Greatly simplified you can say that you remove the individual images with satellite in them as a step in the process.", "label": 0}
{"text": "You posts two links to wiki articles which did not contain _any_ info relevant to your initial claim. \n\nHow is that not random?", "label": 0}
{"text": "except for the dark shapes that obscure the few stars not eaten by light pollution every few moments", "label": 0}
{"text": ">They did support my claim. \n\nYour claim was that perigees can rise after collisions. I asked for your sources.\n\nYou then  linked to two sources saying that ASATs happened. Which I never questioned.", "label": 0}
{"text": "The contract is milestone based. Boeing reaches a milestone, Boeing gets paid for it. No paying that back, when Boeing drops out.", "label": 0}
{"text": "Because it takes time for light to travel  the further away you can see the closer to the start of the universe you can see, so the more we can learn about how the universe has changed over time.", "label": 0}
{"text": "Probably not changed (yet). But the signs are there that the NASA approach is failing due to lack of private space station use. Which means a private station is not financially viable. So NASA may reconsider. \n\nOption 1, no more continuous astronauts in LEO.\nOption 2, Starship space station.", "label": 0}
{"text": "And then there is also the issue that you cannot leave earth anymore because of all the debris. There is a point that even a cleanup crew cannot be brought into space anymore. Then we have to trust on other tech like laser to shoot the debris out of orbit to make room.", "label": 0}
{"text": "It’s a lot newer right? ISS is old and in need of replacement", "label": 0}
{"text": "We’ve established that for organic life we have seen so far (on earth) requires carbon, hydrogen, nitrogen, phosphorus & sulphur. And I understand why we look for planets that could potentially have something similar to hydrothermal vents within oceans, because that’s where we came from.\n\nBut just as the theory of relativity completely changed our understanding of the laws of physics, is there any credible theory to suggest that sentience and life could stem from a formula of conditions that we’re just yet to encounter?", "label": 0}
{"text": "Looks like an eagle the picture looks like an eagle.", "label": 0}
{"text": "Yeah, after reading some comments I can see the benefit and how it isn't as bad as I thought. But thank you in particular for the kind comment.", "label": 0}
{"text": "Hello u/mi8ir_! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "The China submarine story broke on twitter I'm pretty sure. WSJ just re-reported what people were already talking a bout.", "label": 0}
{"text": "Awesome! Love seeing you ISS fellas passing by my area every now and then. Whenever y'all pass near the northern Iberian peninsula I will most likely be seeing you! Cheers!", "label": 0}
{"text": "Send a rocket with higher TWR after the rocket launching those satellites.", "label": 0}
{"text": "Come on bruh, relax! \n\nIt’s just 4200000000 USD or the price of 11670 average homes (US) each valued 359.892 USD.\n\nInstead of 11.000+ beautiful houses you get a rich CEO, a striking and underpaid workforce, an unsafe capsule and a rocket that is single use and explodes every time you fly it. \n\nSo don’t complain!\n\nhttps://www.zillow.com/home-values/102001/united-states/", "label": 0}
{"text": "> looks more spacious inside than the ISS\n\nThe modules are not bigger. This just means they have less equipment, experiments and supplies.", "label": 0}
{"text": "24x24 is is 576 square feet. The hubble solar panel array is 400 square feet.\n\nThey're huge.", "label": 0}
{"text": "holy moly, so tidy and modern. Actually shows that the ISS truly is at the end of its lifespan. Hope the gateway station will be launched soon.", "label": 0}
{"text": "lol, no, not even remotely close. Satellites are not blocks of aluminium. It's like trying to \"recycle\" a car. Sure, there are some elements which you could melt, but most of it are some composites.", "label": 0}
{"text": "Ah yes, just click the \"build more cell towers\" decision per province, which has a similar buff, spend the twenty gold per province and the towers appear automagically with no negative externalities.\n\nI swear redditors have a worse understanding of the world than middle schoolers.", "label": 0}
{"text": "It will be even rougher should the Starlink CEO end up as assistant US President. I estimate 25% chance.", "label": 0}
{"text": "In the original Red Dwarf books they trigger the right combination of stars into supernovae to write COKE ADDS LIFE across the night sky", "label": 0}
{"text": "Explain to me exactly what alternative exists for satellite cellular on common LTE.\n\nGo on, I'll wait.", "label": 0}
{"text": "Yes. There are around 7,000 now. But 100,000 in planning stage from competing companies and governments.", "label": 0}
{"text": "> People keep saying this but they also don't seem to understand that in the event of a low orbit collision, there is a chance that the beris from the collision will shoot up into a higher orbit, until it loses energy again and finally deorbits.\n\nYes, but if it shoots into a higher orbit, the perigee of the orbit MUST (by physics) be at least as low as the collision site, or lower. So unless it's really getting catapulted up to 1000 km+ it's still going to de-orbit relatively quickly.", "label": 0}
{"text": "Hey! Don't shame people, also he likes nuclear power.", "label": 0}
{"text": "Exactly, everyone’s acting like it’s some big deal. Who’s to say the astronaut didn’t have an unexpected heart murmur or felt ill for a few days. Or maybe stubbed their toe and needed X-rays", "label": 0}
{"text": "Maybe this is a scheme to hide the visitors traveling across the sky. Oh there goes another one of those \"satellites\".", "label": 0}
{"text": "That's not what this is about. You didn't even read the article.", "label": 0}
{"text": "So many SpaceX fans (and I am one myself) clearly did not read the article. This is NOT about the \"plan for abort\" and okaying it from mission control. This is new information about an abort criteria almost being hit right as the vehicle was landing, in close proximity to the tower after the landing burn had already started.", "label": 0}
{"text": "> For clarification. My understanding is that the system assumes it's aborted. It doesn't attempt a catch and looks for sign of aborting. It's automatically aborting looking for approval to attempt the catch and not abort.\n\nYou didn't even read the article, so stop incorrectly clarifying people.", "label": 0}
{"text": "They say in the article that it would crash nearby the tower.", "label": 0}
{"text": "How much access has China had to the ISS and its designs?", "label": 0}
{"text": "Hello u/Bulky-Tomorrow8311! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "More thrust from the engines will only provide a very minimal increase in payload capacity to orbit through using less of the burn on counteracting gravity. This is very unimportant, the Saturn V first stage had a fully fuelled TWR of a sluggish 1.2 iirc, which should tell you how unimportant that is so long as the rocket is capable of physically lifting itself. The actual deciding factor in mass to orbit is the specific impulse of the engine, which is to say its efficiency at converting fuel mass into kinetic energy.", "label": 0}
{"text": "Beautiful, it's so amazing, I don't know what to even say", "label": 0}
{"text": "Gateway isn't an ISS replacement, and isn't designed to be permanently crewed.  It's just sorta a stopping off point.\n\nIt's rather small and only designed for four crew max.", "label": 0}
{"text": "*see, I told you I'm a grower not a shower.*", "label": 0}
{"text": "> \"Let's destroy every natural wonder on the planet for marginal benefit\" is an interesting view  \n> \n\nHmmm about that... What we consider natural wonders, many others consider them a marginal benefit. They could easily flip that statement around at ya. I love astronomy (which is why I followed this news in the first place) but it's not helping the cause to cry so bitterly over this without suggesting viable alternatives.", "label": 0}
{"text": "Look at this guy living it up in a shoe box. I'll bet he can smell his kitchen from his bed.", "label": 0}
{"text": "For something 18.8 lightyears away I'm supprised it took this long.", "label": 0}
{"text": "Uh, it is easy to say you'll go to jail for threatening to do something that is 100% impossible. Not saying that building an anti-sat system is impossible, but you said you \"will personally\". \n\nThat's like me saying I will personally go out and acquire all of the Cherry Garcia in the world, and then just eat it all in one setting. I'd die of sugar overload for that.", "label": 0}
{"text": "Most people simply don't play Kerbal Space Program.", "label": 0}
{"text": "I like to think of my ears as my 'head microphones'.", "label": 0}
{"text": "Got citations that they’ve less equipment and experiments? The space difference could easily just be that computers / electronics / other equipment have just gotten smaller and more integrated since the ISS was built.", "label": 0}
{"text": "There is only a need for 65 or so to give coverage to the world unlike Starlink approx 1600. Total network- much less total Sq ft in these ASTS satellites needed than the total combined sq ft of Starlinks. \nNo one should not be able to just launch stuff into space because he can.", "label": 0}
{"text": "AST Spacemobile is building satellites that will provide the world's first direct-to-device satellite broadband. This will provide cell coverage to the nearly 3.5 billion people on earth that son't currently have access.", "label": 0}
{"text": "Hello u/Dramatic_Expert_5092! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "I used to be able to do long expositions of early night sky. Now it's impossible without seeing at least 2 streaks of a starlink satellite in my picture.\n\nThankfully they are easy to erase, but in longer expositions (> 30s), the streaks start to outshine the rest, and contaminate a large portion of the picture.\n\nI predict that before 2050 we won't be able to take a picture of the sky without 100s of streaks.", "label": 0}
{"text": "It is the closest spiral galaxy to the Milky Way at a distance of around 2.5 million light years. It is also the most distant object that can be observed with the naked eye under good conditions without technical aids. It lies in the constellation Andromeda, from which it inherits its name. It is often referred to as M31 for short after its entry in the Messier catalog. \nVersion II of my editing this data from last Friday. \n\n📸 https://instagram.com/beringerus.astrophotography\n\n150 minutes L R G B\n\n🔭 Optics : Askar FRA 600 📷 Maincam : ZWO ASI2600MM Pro 🔦 Guidecam : ZWO ASI174MM 🌐 Guiding : ZWO OAG-L ⚙️ Mount : ZWO AM5 💻 Controller : ZWO Asiair Plus 👁 Focuser : ZWO EAF 🔵 Filters : Antlia LRGB-V Pro 🎨 Processing : Pixinsight / Photoshop", "label": 0}
{"text": "There are workarounds for managing the problem. Traditionally images would be created by single long exposures and tracking the object - this is no longer possible in the same way. I can imagine that any science the require continuous uninterrupted observation is challenged. But, that has always been the case due to atmospheric effects anyway.", "label": 0}
{"text": "Hello u/DanielJStein! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "Says the guy posting on Reddit from a telegraph.", "label": 0}
{"text": "Don’t bother. Space nerds usually have no clue what it’s like to live outside their parents basement, let alone in a developing country.", "label": 0}
{"text": "This article only references the brightness of BW3, the Company’s prototype which lacked any light mitigation. \n\nThese next 5 NASA and astronomers were included as part of the light mitigation efforts. We won’t know how successful those efforts were until the light reports come out on these ones, but it’s premature to think they will all be as bright as the prototype.", "label": 0}
{"text": "Look up how different wavelengths interact with earths atmosphere and which ones are used to communicate with satellites and why some are used only for los and long distance communications and why some can be used to communicate through the earth.\n\nWhat you’re asking already exists.\n\nHF for example will bounced off different layers of the atmosphere due to changes in things like day/night, temperature, space weather etc and distance of communication will vary greatly.\n\nELF can be used to send communication through the earth.\n\nSHF is primarily used to penetrate to satellites in orbit.\n\nHave fun!", "label": 0}
{"text": "Hello u/ojosdelostigres! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 0}
{"text": "This is stunning. Thank you for sharing.", "label": 0}
{"text": "Wait until Minister of Efficiency Elon eliminates launch licensing department.", "label": 0}
{"text": "This is surely satire, right? The US and EU have wreaked havoc on the Global South.", "label": 0}
{"text": "Absolutely!\n\nRead up on RF propagation. Longer wavelengths (lower frequency) especially are affected by the F layers of the Earth's ionosphere. We call propagation like that \"skip\", as in skipping a stone on water. The radio waves \"skip\" off of certain layers of the ionosphere , bypassing some areas entirely to reach others.\n\nhttps://www.eetimes.com/rf-basics-radio-propagation/\n\n> Radio waves can propagate from transmitter to receiver in four ways: through ground waves, sky waves, free space waves, and open field waves. Ground waves exist only for vertical polarization, produced by vertical antennas, when the transmitting and receiving antennas are close to the surface of the earth. The transmitted radiation induces currents in the earth, and the waves travel over the earth’s surface, being attenuated according to the energy absorbed by the conducting earth. The reason that horizontal antennas are not effective for ground wave propagation is that the horizontal electric field that they create is short circuited by the earth.\n\nhttps://en.wikipedia.org/wiki/Radio_propagation\n\nHere's a kinda long (30 minute) ham radio presentation on it;\n\nhttps://www.youtube.com/watch?v=_tpY5hUxOS8", "label": 0}
{"text": "I'm guessing other substances can freeze and be ice as well?", "label": 0}
{"text": "This guy makes good videos. He holds the opinion that if you can't explain something intuitively, you probably don't understand it.", "label": 0}
{"text": "> Starlinks deorbit within months after they fail.\n\nThat is technically true in basically the least helpful way.\n\nWhen Starlink is deployed, it's deployed very low, and climbs to its final altitude using its internal hall effect thrusters. If a Starlink satellite fails when it deploys, then yes - it only takes months to deorbit at that point.\n\nBut.\n\nOnce Starlink satellites have reached their operating altitude, it takes 5-10 years for them to deorbit.", "label": 0}
{"text": "It's possible on a transient state. The ring won't magically appear when the threshold is reached. It would take time for the ring to form. \n\nCool thought tho. Earth with it's own tech garbage rings.", "label": 0}
{"text": "NASA is already partnerships with ESA, CSA, JAXA, the UAE, and even Russia. It does make me wonder why we don’t join with India or China.", "label": 0}
{"text": "It’s like you can’t tell when it is night or day? I see my shadow at 2:00AM as I do yard work to the light of their satellites.", "label": 0}
{"text": "Thanks for sharing I'll add it to my watch list.", "label": 0}
{"text": ">He holds the opinion that if you can't explain something intuitively, you probably don't understand it.\n\nThat's a good opinion. I've had the similar thought that if you cannot break a concept down into its simplest elements, that indicates you still have some work to do in understanding it.", "label": 0}
{"text": "That's interesting thanks! If you were traveling on the space ship accelerating to near speed of light towards a giant star, would it seem like the star is getting further away?", "label": 0}
{"text": "Look how many don’t care about fracking, drilling, and oil pipelines on beautiful untouched land. \n\nOr endless towering condos on previously untouched beaches.", "label": 0}
{"text": "was*\n\nFTFY because Russia is all kinds of fucked now.", "label": 0}
{"text": "Yes but it dramatically increases the risk of a cloud of debris could smash into a higher orbit satellite, which would be exactly what Kesseller was describing but all you ding dongs here think it's fine because it'll burn up in a few more orbits.\n\nA cloud of debris in an unplanned orbit of unknown eccentricity that will burn up in at best a few orbits and at worst a year at least depending on the satellite, is not an issue at all. \"By physics\".", "label": 0}
{"text": "True, but that isn't the only situation where these are useful. Just look at the situation in NC after Helene. Those people weren't in places that had no cell tower coverage, the towers just weren't functioning due to a natural disaster.", "label": 0}
{"text": "https://www.theguardian.com/world/2024/sep/26/china-nuclear-submarine-sinks\n\n> It is not known if there were any casualties – or if the submarine had any nuclear fuel onboard at the time, although experts have deemed that likely, **according to the Wall Street Journal, which initially broke the story.**\n\nThe original WSJ article: https://archive.ph/XPU6C\n\nThe twitter post you're talking about was probably about **another** Chinese submarine that supposedly sank. The one about the Chinese sub trying to trap a British sub then getting caught in its own trap right? It was broke by [Daily Mail](https://www.dailymail.co.uk/news/article-12589429/chinese-sailors-trap-yellow-sea.html), although it probably started off Twitter, idk. The Taiwanese authorities even came out and said it didn't happen.", "label": 0}
{"text": "Honestly, you can tell who on here has zero empathy. Loss of life is a cost they’re willing to hand wave away so they can get a marginally better viewing experience with their telescope", "label": 0}
{"text": "Lucky there is enough garbage up their that this will not happen. Just look at James Webb. It's far away from earth but was already hit several times.", "label": 0}
{"text": "I would suggest you look at simulations of space collisions from different angles, while the largest pieces of space craft act exactly the way you say, things like solar panels will absolutely whip about and fly in unexpected directions, but don't worry I'm just a garden variety Internet idiot who's after easily digestible internet drama, and there's no way I might actually know something you don't.", "label": 0}
{"text": "Maybe hit his head when leaving the capsule you never know", "label": 0}
{"text": "It’s like that one petrol pump (or gas station) in the middle of the Australian outback with nothing else for the next 300kms", "label": 0}
{"text": "Even with the door closed, I can still smell it.", "label": 0}
{"text": "My degree required me to take a class in astrodynamics, then satellite controls. This was part of the curriculum.\n\nThe difference in velocity requirements for a collision to boost debris enough to affect other orbits is too high, just as is the rotation requirements on a defunct sat. It will spin itself apart long before the shed is high enough to boost the apoapsis to a concerning amount.", "label": 0}
{"text": "It’s a popular opinion and said more simply by Einstein (or at least attributed to Einstein), “if you can’t explain it to a 6 year old, then you don’t know it well enough.”", "label": 0}
{"text": "Well, I'm not American, but I think that being American doesn't take away your rights to see China for what it is, even if your country is far from perfect.", "label": 0}
{"text": "It depends on popularity. Geosynchronous and Geostationary are at a very specific altitude, so the volume allotted to each satellite is much lower than elsewhere. More importantly, Geostationary is a geosynchronous orbit with an inclination of 0 degrees. Until recent times, it was the most popular orbit, and we have been leaving defunct satellites up there for a while. This couples them because any geosynchronous satellite passes through the geostationary belt twice per day; which generates a higher risk; and of course, the deorbit time of geosynchronous orbit is about 100 times longer than the distance between now and the first human civilizations.", "label": 0}
{"text": "Hello, are the different colors those of the components in the frozen water or the only light effect?", "label": 0}
{"text": "Reminds me of the profession from Better Off Dead", "label": 0}
{"text": "I have an issue with the statement about information taking time to be passed on...what about quantum entanglement? Am i confusing concepts?", "label": 0}
{"text": "I am very skeptical gateway will ever happen. Given all the delays to Artemis in general, starship could be 100% operational before gateway is. That would eliminate the need for basically everything else in Artemis besides starship", "label": 0}
{"text": "I would try and help you, but I have no idea what that is 🥴", "label": 0}
{"text": "Ah, yet another Youtube graduate. To reiterate your erroneous assertion:\n\n> These things are fucking big not tiny tiny objects flying past fast.\n\nThe dimension of the ISS - the largest man-made object in orbit - is a point source to the naked eye. It can be resolved only with significant optics. Most satellites are point sources even through large telescopes.\n\nFurther, your video shows a time lapse during twilight. With full night LEO satellites are in darkness and invisible.\n\nYou want to see problems with \"large\" objects in the night sky, you need look no further than aircraft, the running lights of which show dimension even to the naked eye and, unlike LEO satellites, are visible all night.", "label": 0}
{"text": "That’s the most Reddit response I’ve ever heard.  As soon as it’s your mother, father, brother, sister, wife, kids… etc that are in a situation that could have been saved by a simple call but they had no service… I imagine you would wish they could make that call.\n\nI would argue for the majority of people the night sky will be unhindered by these satellites.  I would also argue the environmental impact is much smaller than cell towers.\n\nCan you imagine, the Hubble telescope is a similar size and we put that up solely to view further depths of space to stroke humanity’s hubris?  - I’m being facetious here 😉", "label": 0}
{"text": "Good explanation, but its a tad condescending.  Also, not so sure about the photon explanation for the mechanical clock.  Force carrier, I get, but the motion of the clock is not dependent at all on a photon reaching the second position before movement occurs.  Hogwash. Also, the explanation of time was kind of weak.  We all know intuitively what time is, but the scientific explanation has to do with entropy or the tendency for the universe to go from ordered (high energy) to disordered (low energy).", "label": 0}
{"text": "It’s called TS-SCI Talent Keyhole. ;)", "label": 0}
{"text": "Living in space is absolutely dangerous to the body.  Both from the increased radiation levels to muscle atrophy and bone loss.  There’s a lot of research on how to limit both, and some measures are already implemented, though it still isn’t enough to eliminate all the effects to the body.", "label": 0}
{"text": "A. That’s an awesome photo!\nB. Has anyone ever told you, you kinda look like Phil Collins?", "label": 0}
{"text": "Not quite, no. It's a specific probe with a pretty catchy name", "label": 0}
{"text": "Entanglement sidesteps this because you cannot transfer information through entangled particles.", "label": 0}
{"text": "That's so beautiful. I'd love more details on how it's done.", "label": 0}
{"text": "Yes, the ISS's life support system also create a constant background noise.", "label": 0}
{"text": "And those articles being pushed take no account for us being able to overcome radiation and zero-g. It’s such a defeatist message, and a rather new one.", "label": 0}
{"text": "Yes, but they knew there were things that could travel faster than sound. You could easily demonstrate it by creating an explosion and observing it from a sufficient distance. The real problem with something traveling faster than C is that it breaks cause and effect. It would be like seeing the explosion, then hearing it, then observing the demo guy press the plunger.", "label": 0}
{"text": ">No we shouldn't cooperate with enemies of freedom.\n\nWhich country supported:\n\nMilitary dictatorships in Greece, Korea, Taiwan, South America, Middle East, funding and supplying weapons for genocides and purges in those places?\n\nYou're right nobody should cooperate with the enemies of freedom.", "label": 0}
{"text": "Exactly. Einstein famously called it \"spooky action at a distance\" because of this possibly physics-upending behavior.", "label": 0}
{"text": "Yeah… but that’s why they let the Norwegians do the peace prize and leave the physics one to the Swedes :)", "label": 0}
{"text": "So if the entirety of this demonstration is from the point of view of the observer, that the observer cannot see things eclipse the speed of light, what does that mean for the observed?  The presenter says that the clock ticks will appear as expected for the moving entity. Does this not indicate that the moving entity can eclipse SOL, but never be seen doing so?", "label": 0}
{"text": "All I can think of is the Russian in Armegeddon when theybare refueling the shuttles.", "label": 0}
{"text": "Name any country and you've named a country that has supported dictators. China IS a dictatorship, with current border wars and large claims of territories that nobody else recognizes.", "label": 0}
{"text": "> Not saying Boeing's iS-33e satellite was taken out by stray space debris but... It's a possibility.\n\nI'd say it's would be more likely if that particular unit didn't have multiple propulsion issues earlier in life.", "label": 0}
{"text": "> breaks cause and effect.\n\nHave you read about the [Delayed Choice Quantum Eraser Experiment](https://en.wikipedia.org/wiki/Delayed-choice_quantum_eraser)?\n\n> While delayed-choice experiments might seem to allow measurements made in the present to alter events that occurred in the past, this conclusion requires assuming a non-standard view of quantum mechanics. If a photon in flight is instead interpreted as being in a so-called \"superposition of states\"—that is, if it is allowed the potentiality of manifesting as a particle or wave, but during its time in flight is neither—then there is no causation paradox. This notion of superposition reflects the standard interpretation of quantum mechanics.\n\nCause and effect isn't all that it's cracked up to be.", "label": 0}
{"text": "Minimizing gravity losses is ultra-important when considering a reusable architecture as the first stage will have to squeeze out as much velocity as possible while also saving enough fuel to RTLS. More thrust means that the booster can do as much work against gravity as possible, vs Saturn V which had to spend much more fuel fighting against gravity. The Raptor sea-level is pretty much optimized for pure thrust when on the ground. If they decided to optimize the first stage for efficiency, there would be trade-offs for thrust and staging velocity, and that defeats the whole purpose of having a reusable booster in the first stage. If hypothetically, Raptor was optimized for efficiency by having a larger nozzle/bell, the larger nozzle itself would add weight.  In addition, the higher staging velocity would result in a longer boostback burn and higher peak heating during RTLS. In this case, thrust is king. It just is not very feasible to have an ultra-efficient first stage on a reusable launch vehicle. F9 and Starship have a TWR of 1.5 for the reasons listed.", "label": 0}
{"text": "I do the same thing in Minecraft", "label": 0}
{"text": "I have a book that was published before the ISS was built that said the ISS would be a stopover for spacecraft to the moon and Mars and all that fancy stuff", "label": 0}
{"text": "...seems pretty typical:  i shopped and lived in one-bedroom apartments for twenty-five years and never saw one greater that 650 square feet...", "label": 0}
{"text": "More like you didn't watch the video or don't understand what they are telling.\n\nYou basically took the sentence \"Everything is possible\" to a complete extreme. That's not how reality work. You probably are that guy who calls other a \"pessimistic person\" for saying it is impossible for a person to life a 1000 ton object. Somethings are just impossible according to the rules we have to abide by.", "label": 0}
{"text": "If you think 2+2=4 is a problem, I don't want to be in a spacecraft with you.", "label": 0}
{"text": "None of these are Starlink sats. They are too dim to see with the naked eye. Except while they rise to their operational altitude, directly after launch. Those are strings of sats, easily identifiable. If you see single sats, they are not Starlink.", "label": 0}
{"text": "It doesn't matter, these are magnitude 1.5, Starlink are magnitude 7.5.\n\nSpaceX sats are 0.3981% as bright.", "label": 0}
