{"text": "Countdowning\n\nhttps://preview.redd.it/glu23zx5f1xd1.png?width=1290&format=png&auto=webp&s=fb6dcf06b53201dd05446a91b6629e71e17bcec6", "label": 1}
{"text": "Not all of us would try to buy an election for a fascist", "label": 1}
{"text": "I think a lot of people on reddit would, if given the chance. Maybe not for a far right candidate but for a far left candidate", "label": 1}
{"text": "What's a far left candidate in the US? Universal healthcare and UBI? And far right is currently advocating for migrant concentration camps?", "label": 1}
{"text": "“Everybody I disagree with is Hitler”", "label": 1}
{"text": "Yaaaaahhhh I love when r/SpaceX starts talking about universal healthcare and migrant concentration camps 🥰 so fun, love that we stay on topic here", "label": 1}
{"text": "Is that the garbage California is suing that African about dropping on subjects of California?", "label": 1}
{"text": "> public and private insurance\n\nThis one is funny, because the government didn't want to do the work and they left it for private parties, while regulating it and making it mandatory to the point that the private parties are practically operating as a governmental insurance. So, in essence there is no difference. \n\n>allows gun ownership under specific circumstances\n\nVery very very very, specific circumstances. But gun ownership has never been that big of an issue to be politiziced here. And most of the descision making was left to the civil servants advising the minister of internal security. However, I do know for a fact (personal relations) that the civil servants are now actually advocating for a pretty harsh ban on everything firearms related. So this will start to become politizized. Where probably half of the 15 political parties will agree on banning all firearms. So in that sense, we have 75 bernie sanders in parliament. \n\n> restrictions on immigration\n\nAbout 60% is for EXTREME restrictions of migration. That leaves 40% to be against these harsh restrictions. With 15-20% advocating for free-er restrictions.\n\n----\n\nYou make the mistake by assuming that governing parties and policies mean that there are no parties who would change this into a more left oriented policy. Yes the current (and past 10 years) Dutch government have been predominantly right. This does not mean that there are no representatives advocating for a more left direction. Because we have those. I'd say that Bernie sanders policies are shared by the PvDA-GL, PvDD and SP. And most points would be shared by the CU (but they are a weird progressive, but chrisian conservative party). That totals a 36 seats of the 150 that share bernies perspective, and I know, they even have stances that go much further than that. \n\nFor example the thing PVDA-GL and SP (30 seats) are advocating for is a limit on income AND a limit on wealth. Imagine that being presented in the US. SP is more on the extreme end of left, but not the furthest left in policies if you take communist (the historical interpretation, not the American one) perspectives into account.", "label": 1}
{"text": "Are you real? Do you even know what literal communism is? I feel like you have no perception of the differences between socialist perspectives and communist ones. Communism, like we've seen tried in historical perspectives is quite literally the DEFINITION of extreme left.\n\nAnd moreover, this was not even relevant. It was about the question if there was extreme left in the us politics. And my answer is and remains that the answer is: No, not from the Dutch perspective. And laughably so, not even from the US political perspectives. Because lets not forget the historical periods of the US when there was in fact a 90% top marginal tax on income. 1944-1963.\n\nI am just explaining that there is no extreme left in the US political debate as seen from the perspective of the Dutch political landscape. My perception of what I find far left is quite irrelevant in this. On top of this, I quite literally presented that from the Dutch perspective, that is about 25% of the people, what you call extreme left, is not extreme left. Contrary, it is within mainstream discussions or the overton window if you prefer that term.\n\n------\n\nAnd yes, there are extreme left perspectives from my point of view. Like I said, irrelevant to the discussion above, but I'll entertain you. Something turns into extreme left to me when the state starts to take care of things outside of the basic needs area, such as housing, livelihood, education, healthcare, public transport, etc... Such as directly steering the industrial output in for example five year plans and completely eliminating free market principles. Because that is Communism... That is far and extreme left to me, as the original meaning of the terminology holds. The same that far and extreme right are political parties that tick more boxes on the fascism scale of Lawrence, than I have fingers (on one hand, i'm critical..). \n\nI'd like to think that this view and scale would represent the entire political spectrum and would be universal due to its basis in political history. But I am mistaken in this.\n\nLet me ask a question to you. How do you define literal communism (historical application) if Bernie sanders (which again, shares 25% of Dutch opinion) is already called extreme left?", "label": 1}
{"text": "Whoa. I don't know what I said to upset you, but I apologize. I was sincerely trying to engage in a discussion.\n\n\nThat said, getting yelled at by someone across the pond isn't what I signed up for. Have a nice day.", "label": 1}
{"text": "I might have put it more nice, but I was absolutely flabberghasted by you insinuating that me factually representing the data as seen in the Dutch political sphere would mean that my stances compare to communism. \n\nOn top of it, it frustrated me that political discussions can't be factual but are continously pulled onto the feelings scale.", "label": 1}
{"text": "Mate, I never said your views were communism. If you look, I never said that word and I assure you I never thought it.\n\n\n>I was absolutely flabberghasted by you insinuating that me factually representing the data as seen in the Dutch political sphere would mean that my stances compare to communism.\n\n\nYou made a giant assumption. Next time, please simply ask instead of insulting someone.\n\n\n\nI was genuinely confused because you seemed to think that 100% government run health care with no private option is not \"far left\". So, I asked for you to share what you think far left is.\n\n\nAnd, to be quite honest, I completely disagree that the only definition of \"far left\" is Communism. Like many things, I think there is a spectrum and I don't subscribe to the idea that Communism is the only political philosophy or ideology that counts as far left.\n\n\nPeople constantly say \"America is so far to the right of Europe that there is no \"far left\" in America.\" Maybe, from certain perspectives, it is more that Europe is so far left that they only see \"Communism\" as far left and don't realize that there might be more to that term?", "label": 1}
{"text": "was (s)he constipated?", "label": 1}
{"text": "None of what you just listed describes Fascism. He is a fascist, because he represents and promotes the merger of State and Corporation. But his position on trans culture, race, or immigration has literally *nothing* to do with fascism. \n\nAgain, Elongated Muskrat ***is*** a fascist, but get the reasoning right so that you don't deteriorate the word.", "label": 1}
{"text": "Its amizing.", "label": 1}
{"text": "Realistically? Another repeat performance and then a slow down while they work on what's actually next.\n\nAnd in the long term...serious risk to the company in the form of Elon's illegal vote buying scheme. He's going to kill the company if he's not careful", "label": 1}
{"text": "how about you keep your political BS out of here?", "label": 1}
{"text": "Jeez that’s crazy", "label": 1}
{"text": "You think the CEO of the company committing crimes isn't relevant to the community?", "label": 1}
{"text": "reported for offtopic spam", "label": 1}
{"text": "You go girl", "label": 1}
{"text": "https://preview.redd.it/730k2u1zbyxd1.jpeg?width=4032&format=pjpg&auto=webp&s=c0c65214f9e593b90daf482631c35c88d098b423", "label": 1}
{"text": "Musk is too unstable to be in this business ", "label": 1}
{"text": "https://www.theguardian.com/technology/2023/sep/07/elon-musk-ordered-starlink-turned-off-ukraine-offensive-biography\n\nRight", "label": 1}
{"text": "Will he work for US gov or provide to any gov for money?", "label": 1}
{"text": ".... but there obviously was. So they obviously do.", "label": 1}
{"text": "Geeeeezus. When you generically state “words mean nothing” as you have multiple times, the implication you’ve made clear is that in your opinion “words” have no causal or consequential relationship with adverse actions because they’re only words, and so we can all confidently sit back and just ignore the words knowing everything will be rosy.\n\nIt only takes one single counter-example to prove this premise false, yet there are many throughout all of history. In fact many terrible actions clearly trace their origins back to “words”, except for example something like a random impulse killing. If this were not the case, the verb “incite” would not exist. So your premise is obviously bullshit from the start, but to state “the words mean nothing if the action didn’t happen” also ignores all future consequences. So an action didn’t happen when? Within 5 minutes? 5 days? 5 weeks? What’s the statute of limitations when you formally decide that they’ve led to no actions or consequences? Tbh I’m not even sure why I’m entertaining this whole discussion because as Bill Maher amusingly said of Megyn Kelly, “you’re the person who walks into a room and sees a mouse and an elephant but cannot tell the difference”. Cheers.", "label": 1}
{"text": "You are misquoting me - I said the following:\n\n\\- words mean nothing without the actions\n\n\\- Actions > words.\n\nYou have not given an example of where words meant more than the action.  There are plenty of calls to action, where that action is not taken, and said words are left of history's cutting room floor - useless in their impotence.\n\nThe first rule of being in a hole is to stop digging.", "label": 1}
{"text": "Apparently by your downvotes, there will be continued sucking…", "label": 1}
{"text": "lo, you failed with the link, if you linked the correct link he wouldn't need to have to ask in the first place. Stop with the propaganda.", "label": 1}
{"text": "I hope someone make for starship testing also", "label": 1}
{"text": "I love you star kitty 😺❤️", "label": 1}
{"text": "I reckon we'll see Musk getting involved in politics, and then *if* it goes according to his plan, we might see a USA government sponsored human to Mars mission.\n\nWith President and both houses of congress republican controlled, I could totally see all the necessary laws and spending commitments being put in place this presidency (but not the actual mission itself happening).\n\nI could totally imagine this \"department of government efficiency\" plan was a handshake deal between Musk and Republican leaders that all money saved could be spent on a \"get america an outpost on mars\" mission.\n\nWith far more funding, I think we could see the whole plan substantially accelerated.", "label": 1}
{"text": "I’d like to watch this but rather without Elon. Who’s got hos schedule? I’m hoping he’ll be preoccupied with governmental preparations or sharing Nazi propaganda on Twitter.", "label": 1}
{"text": "Next year, test flights will no longer be log jammed   by FAA.", "label": 1}
{"text": "Can you elaborate?", "label": 1}
{"text": "Biden appointees will be gone from the FAA.", "label": 1}
{"text": "Hah, we’ll see if that really means the wheels are greased or just have an extra hand turning them", "label": 1}
{"text": "If you look at from Starship's development from late 1998 to Biden came to power, Trump administration's FAA gave timely approvals and numerous test flights and improvements led to the Starship. \n\nThen Biden Admin came in, and the FAA started requiring everything from plaques detailing importance of the region during US Mexican War, to Plaques of the area during US Civil War, and studies of potential impact of launches on extinct animals. The launch cadence collapsed to max of 2 launches a year. \n\nIf you were in Elon's shoes, what would u do about it?", "label": 1}
{"text": "Honestly f spaceX!", "label": 1}
{"text": "This is pretty ahistorical. The flight cadence slowed down because they went from suborbital hops to building the infrastructure for orbital launches. Building the tower, tank farm, all the OLM stuff took a lot of time. Then, after IFT-1, they had to shut down again to fix the cratered launch mount. Presently, SpaceX doesn't have a backlog of ships to launch. They're machine, not regulation limited.\n\n  \nThat's not to say overactive regulatory bodies haven't played a role in slowing them down. I'm not a Trump supporter, but I too will be happy if SpaceX gets a longer leash to operate.  That said, it is fiction to blame Biden or the FAA for how long it took to the pad ready for launching Starship. You're looking at the picture with like 3 pixels of resolution if you think that.", "label": 1}
