{"text": "Musk’s constant stream of overpromising and underdelivering has really made me lose interest in following spacex", "label": 1}
{"text": "Oh no. Hope it wasn't too serious of a thing.", "label": 1}
{"text": "And that was absurdly stupid.", "label": 1}
{"text": "step one would be to ban NASA from gargling Alabama Republican Sen. Tommy Tuberville cock for 5 min", "label": 1}
{"text": "Russia hasn't been communist for decades chief", "label": 1}
{"text": "Ironically, Musk is really the only CEO with the balls to fire massive underperforming chunks of a company like he did at Twitter as well as Tesla.", "label": 1}
{"text": "Oh yes, underperforming chunks of Twitter, like server engineers and content moderators... Once they were cut the valuation of the company shot through the roof!\n\nThe downside is that the house is flipped upside down.", "label": 1}
{"text": "\\> Russia winning the new space race\n\nlmfao", "label": 1}
{"text": "Yeah, that argument was passed around in the wake of the layoffs, but that was years ago and the company is undoubtably still churning along just fine with a tiny fraction of the staff. A massive amount of overhead was purged and allowed the company to operate much more efficiently, it was a do or die moment the company could not have survived with that enormous amount of operational overhead (Dorsey and Agrawal have said as much).", "label": 1}
{"text": "Www.google.com", "label": 1}
{"text": "The person isn’t wrong about starship being able to fill this roll. There’s just no plans to use it that way.", "label": 1}
{"text": "Yep anyonw being positive about SpaceX must love Musk /s it must be sad to have so much hate you let an ass like Musk role your life.", "label": 1}
{"text": "Get bent. Nothing you said is relevant to this mission.", "label": 1}
{"text": "Would this be the same 'trusted partner' who's CEO was yapping to an adversary? lmao.", "label": 1}
{"text": "I mean we do know... The sourcing for the WSJ article was U.S. and E.U. officials and Elon's clearances weren't revoked which means either a) He followed foreign contact protocols or b) He was investigated and it was deemed not that big of a deal.\n\nIt isn't weird for the founder of the largest private space company to be talking to a nation that, despite how low its star has fallen, is still one of the big 3 national powers in space at the moment. Layer in all of the drama regarding use of Starlink in Ukraine, and you quickly see how Elon could be in lots of perfectly mundane convos with Russia. It aggravates me that he has thrown in with Trump, but nothing Elon has done himself smells of Russian influence to me.", "label": 1}
{"text": "People need to stop acting like Elon Musk is special.", "label": 1}
{"text": "Hasn't been yet. We just found out today that Elon declined to deploy Starlink to Taiwan today because Putin asked him not to. It brings into question his purpose in not deploying Starlink over Ukraine in the first place. Starlink in Taiwan is still \"coming soon\" but his choices there if China makes a move on Taiwan would be more telling.", "label": 1}
{"text": "It misleads readers into believing the original Boeing Airliner passengers are back on Earth when infact this is just another delayed return of the 4 astronauts who were in the station BEFORE the 2 Airliner passengers got there.", "label": 1}
{"text": "It doesn't mislead.  The only way you could remotely think that is by not bothering to read any part of the article.  And at that point, all headlines are misleading because they don't post all details in it.", "label": 1}
{"text": ">And at that point, all headlines are misleading because they don't post all details in it.\n\nAnd that's exactly what happened to the OP of that link. He read the headline and thought everyone was safely back on Earth. And you can't even read the rest of the arricle if you ran out of free articles, its hidden behind a paywall. It IS intentionally misleading.", "label": 1}
{"text": "This is some laughable \"X\" and Elon Musk propaganda", "label": 1}
{"text": "> We just found out today that Elon declined to deploy Starlink to Taiwan because Putin asked him not to.\n\nElon declined to deploy Starlink to Taiwan *and* Putin asked him to. Elon's reason was always that Taiwan law requires 51% government ownership of ISPs, and he wasn't willing to cede control of the Taiwanese arm of Starlink to them. Which is super reasonable as doing so would have all sorts of legal implications, especially if Taiwan went to war and began using Starlink for military purposes.", "label": 1}
{"text": "Which part is untrue? Musk mass fired the majority of people from Twitter 2 years ago. Reddit was claiming they wouldn't last 2 months, here we are 2 years later and they are still one of the top sites / top apps on the Internet. When did they die due to the enormous headcount reduction?", "label": 1}
{"text": "I almost spilled my cocktail! 🤣🤣🤣", "label": 1}
{"text": "Yeah, nothing says \"churning along just fine\" than an 80% drop in valuation.\n\n>  Elon Musk’s X is worth nearly 80% less than when he bought it, Fidelity estimates \n\nhttps://www.cnn.com/2024/10/02/business/elon-musk-twitter-x-fidelity/index.html", "label": 1}
{"text": "> the company is undoubtably [sic] still churning along just fine with a tiny fraction of the staff\n\nthere's no way you actually believe this lmao", "label": 1}
{"text": "I dunno man, i deleted the app couple days ago but until that time, it was working just fine.", "label": 1}
{"text": "Clearly somebody had a gun to their head as they were replying.  They had no choice.", "label": 1}
{"text": "So since I'm completely ignorant here obviously, explain to me how X has become inoperable and is no longer used and not currently one of the top websites on the Internet then?", "label": 1}
{"text": "Twitter lost 10% of its daily active users, 20% revenue, and 80% of its evaluation after Musk took over. \n\nSo literally all of it is untrue", "label": 1}
{"text": "Source?  \nAnd is that a recent estimate of daily users? Or a 2 year old state when he cut out 90% of their overhead?", "label": 1}
{"text": "https://finance.yahoo.com/news/twitters-revenue-collapses-84-tesla-171535190.html\n\nhttps://mashable.com/article/twitter-x-revenue-falls-x-payments-plans\n\nhttps://www.theguardian.com/technology/2024/mar/26/twitter-usage-in-us-fallen-by-a-fifth-since-elon-musks-takeover\n\nhttps://www.cnn.com/2024/10/02/business/elon-musk-twitter-x-fidelity/index.html\n\n\n\n>And is that a recent estimate of daily users? Or a 2 year old state when he cut out 90% of their overhead?\n\nI can't even fathom what you think you are saying", "label": 1}
{"text": "They are also pushing for the abolition of the light bulb.", "label": 1}
{"text": "Wow, The Elon hate train really came for you.\n\nFunny how he was their favorite person till he started talking about free speech.", "label": 1}
{"text": "It's functional but it's now full of bots, Nazis, porn, and Elon spreading fascist propaganda. So I guess it depends on your definition of working.", "label": 1}
{"text": "Just nationalize SpaceX and fold them into NASA already. \n\nThey should have been under NASA to begin if the US government actually funded and supported the agency anyways. \n\nThe fuck is Elmo gonna do?", "label": 1}
{"text": "Hot take: Musk is a private citizen and this is not a fascist state that says who and who not you can talk to.", "label": 1}
{"text": "This commenter is a Musk, ergo Trump, supporter.", "label": 1}
{"text": "Really? You pick THIS to suddenly trust Putin?\n\nThis is transparent astroturfing at its finest.", "label": 1}
{"text": "Looking at the reporter's bio and how they went out of their way to not name who are these \"astronomers\" who signed it are, I'm sure this is purely scientific reasoning and definitely doesn't have a political agenda behind, right?...right?\n\n(narrator: It did.)", "label": 1}
{"text": "Untrue when security clearances are involved. Sentences of execution have been handed down for such things.", "label": 1}
{"text": "Having a security clearance and defense contracts isn't a constitutional right. Merely not doing anything explicitly criminal isn't enough to get and keep a security clearance. \n\nTalking with known war criminal dictator enemies of the United States is absolutely enough to get your security clearance revoked.", "label": 1}
{"text": "Musk's political opinions are delusional and I'm not thrilled with Trump either, but that doesn't change the fact that SpaceX is doing amazing things with Falcon 9, Falcon Heavy, Starlink, and Crew Dragon.", "label": 1}
{"text": "Really? This is your response?\n\nThe Wall Street Journal, a conservative news organization, has said that Musk spoke with Putin several times, and the Kremlin agrees that they spoke once. When asked about it, Elon Musk didn't respond. \n\nSo then you think it's *me* who is astroturfing? It's clear you're just looking for an excuse to defend Musk.", "label": 1}
{"text": "Private citizens can speak to whomever they want—provided they aren’t violating the Logan. Private citizens who want to be entrusted with government contracts relating to national security are held to a higher standard. Musk’s interactions with a rogue head of state call into question whether he is worthy of trust—particularly if he has a security clearance as the CEO of SpaceX.", "label": 1}
{"text": "I personally think it's a great look for the USA to be giving an African American the benefit of the doubt.", "label": 1}
{"text": "Russia is a special topic for the US because of their relationship, if you know government secrets and you go to Russia/talk to the Kremlin you better believe you're going to be spied on, the US will try to know every movement you make and every conversation you have.\n\nThey may not tell you what to do but they will use you.", "label": 1}
{"text": ">security clearance is a super broad term and has many different levels of access.\n\nAnd depending on his level of access will determine whether or not he is in breach of that clearance. Hence, an investigation to make that determination.", "label": 1}
{"text": "> EDIT: guys, security clearance is a super broad term and has many different levels of access.\n\nHe has a top secret security clearance. You only need those for sensitive defense, intelligence, or nuclear related activities. Either his work on building rockets or the fact that the rockets sometime send up military/intelligence satellites both require that level of clearance.\n\n> The entrepreneur has a secret-level clearance because of his role as founder and CEO of Space Exploration Technologies Corp., which is certified to launch military spy satellites.\nhttps://time.com/5547914/elon-musk-security-clearance-pot/", "label": 1}
{"text": "According to the article:\n\n>\n\nHere's another, earlier article [about the subject by The Guardian](https://www.theguardian.com/world/2024/oct/15/taiwan-to-have-satellite-internet-service-as-protection-in-case-of-chinese-attack):\n\n>\n\nAnd another earlier article, [by CNN](https://edition.cnn.com/2024/05/04/asia/taiwan-starlink-intl-hnk/index.html):\n\n>\n\nSo, what to believe? The Russians, who lie about EVERYTHING, and are never above spreading a bit of FUD? Or that SpaceX is simply making hard-nosed business decisions?", "label": 1}
{"text": "I just found out that Joe Biden talked to Putin several times...but nobody seems to care.", "label": 1}
{"text": "Musk is the public face and main financier of those ventures.", "label": 1}
{"text": "Biden is the president. Elon isn't.", "label": 1}
{"text": "We're handing over the reins of far too much of our space infrastructure to two fascist-enabling, partisan billionaires. Musk and Bezos both should have their aerospace companies ripped away from them. NASA already has enough of a dark history of handing leadership to nazis; no need for its future to do the same.", "label": 1}
{"text": "> EDIT: guys, security clearance is a super broad term and has many different levels of access.\n\nlol…what level of security clearance do you think would look past Musk’s behavior? Assuming these conversations weren’t disclosed as part of the clearance process, he’s in deep shit.", "label": 1}
{"text": "The WSJ article itself cites that the Biden admin isn’t aware of any illicit contact or security breach. If they’re not already aware of something, it’s hard for me to imagine that WSJ knows something the CIA doesn’t, or isn’t already investigating.", "label": 1}
{"text": "Maybe the mods should also be investigated because they seem to be good at running interference for this guy. They deleted the previous post.", "label": 1}
{"text": ">and this is not a fascist state that says who and who not you can talk to.\n\nYou might want to read upon the [Logan Act](https://en.wikipedia.org/wiki/Logan_Act), that thing has been on the books for hundreds of years now.\n\nAnd holders of security clearances - which Musk almost certainly is, given the involvement of SpaceX into highly classified government satellite missions, not to mention Starshield - agree to being under strict requirements regarding communications with third parties if they want to keep that clearance.\n\nHell all I have is a clearance for the German firefighter/police/EMS encrypted radio broadcast network and I had to sign a permanently binding NDA regarding anything secret I come across during my duties. That's as low level as it gets. If I were to enter public service even as a dumbass paper pusher clerk, I'd have to sign off for far deeper restrictions, and forget about higher ranks in the service.", "label": 1}
{"text": "Considering how many claims against musk end up being nothing, I think it's probably best to wait for an actual report and not just anonymous sources before the election. \n\nAlso musk has controlling interest in spacex. He cannot be forced to do anything.", "label": 1}
{"text": "Sure, but who is DoD or NASA going to turn to to launch their satellites or get crew/supplies to the ISS? ULA can do some of it for now, but it costs more per kg, and they don't have a Falcon Heavy competitor anymore. Also, they're on the verge of being bought by Bezos and merged with BO. The only other option is Russia... and we're right back to dealing with Putin, only this time the US would be dealing directly instead of rumors about the CEO of a company talking to him.", "label": 1}
{"text": "He’s not. He hasn’t put money into SpaceX in almost two decades.", "label": 1}
{"text": "That's not NASA's choice. That's what the governement tell them to do.", "label": 1}
{"text": "Nobody is saying he needs to stop. Just that his security clearances may need to be pulled. Talk to whoever you want. But if you want to know state secrets, don't talk to... -List of people-", "label": 1}
{"text": "Whether it is true or not, SpaceX is harmed, that is why they are forced to go out and write statements on Twitter, that shit has to stop, but that has to come from SpaceX and talk to him, if he continues in that position of believing himself to be political, yes He can't understand it, they have to remove it, it's ruining the company's reputation.", "label": 1}
{"text": "Well the Russians were using starlink, so it's not surprising they communicated.", "label": 1}
{"text": "[Considering how many claims against musk end up being nothing](https://www.youtube.com/watch?v=oHC1230OpOg)", "label": 1}
{"text": "Putin asking Musk to not provide internet services to a US ally seems like a big problem.\n\nIf DOJ is investigating it'll take a long time, which is probably why someone gave it to WSJ. \n\nThe amount of \"well akshullllly\" in this thread licking Musk's scrotum is exactly what I expected to see.", "label": 1}
{"text": "I'm dying over here bro, how are people so confidently stupid.", "label": 1}
{"text": "Musk very much can be forced out using a plethora of ww2 and cold war era laws. And there is always the Eminent domain laws which effectively give the US gov the ability to whenver and for whatever reason take private property into government ownership. \n\nActively maintaining contact with the leader of a hostile state is a single step away from outright treason.\n\nAnd which claims have \"end up being nothing\"?", "label": 1}
{"text": "This certainly would explain Musk’s erratic behavior lately.", "label": 1}
{"text": "You are very much mistaken about the \"whenever and for whatever reason\" part of eminent domain.", "label": 1}
{"text": "Lmao what a lunatic to bring trump into it 😂", "label": 1}
{"text": "A week before an election, I assume anything from \"anonymous sources\" is complete bullshit.  We'll see what come out of the investigation, though.", "label": 1}
{"text": "Helium? I mean he could be an avid user but I'm not sure how that is relevant. ", "label": 1}
{"text": "Reddit wanks itself off with Elon Musk hate almost as much as it does Donald Trump. Look to AskReddit threads rather than here if you want to judge the tenor of the site as a whole. If you're looking for a conflict in popular Reddit opinion, Trump/Musk isn't the dichotomy you wanted.", "label": 1}
{"text": "Do you not realize that Musk's SpaceX and Russia are the only two groups capable of getting astronauts into space?  They're going to interact with each other.", "label": 1}
{"text": "This makes no sense. He sought the Russians out himself you realize this, right? He went to them. End of story.", "label": 1}
{"text": "Putin happens to be the leader of the only other significant space capable nation on earth.  There is absolutely nothing surprising about Musk and Putin communicating.  Touch some grass.", "label": 1}
{"text": "Maintaining contact with the leader of a country under heavy sanctions for an illegal war is a little bit more than \"responding to a generic email\" [And the Original article from WSJ](https://www.wsj.com/world/russia/musk-putin-secret-conversations-37e1c187?mod=hp_lead_pos7) cites multiple well regarded diplomats and trusted sources from multiple nations security teams.", "label": 1}
{"text": "Of course Boeing who will charge extra money on a fixed-price contract to speed up work that will actually take twice as long as originally planned. And then sell the seats in the Russian Soyuz to close the gap in the schedule that they artificially created.", "label": 1}
{"text": "Not only to space, but also back, which Boeing failed at spectacularly.", "label": 1}
{"text": "Do not think it's a little bit crazy to immediately assume that any conversation with Putin involves national defense secrets being divulged?  There are perfectly valid mundane reasons they would have been in contact with each other.", "label": 1}
{"text": "Name a claim that ended up being nothing.", "label": 1}
{"text": "Anyone who has even walked past an engineering class didn't believe his bluster.\n\nIt just gets so tiring after a while.", "label": 1}
{"text": "Boeing... is a private enterprise. They're not the government. Private enterprise isn't a synonym for good.", "label": 1}
{"text": ">There are perfectly valid mundane reasons they would have been in contact with each other.\n\nIndeed, but holders of security clearances usually also have to submit information about past contacts, even vacation visits with a list of third party countries (or more commonly, there's a whitelist of \"assumed safe\" like other EU states, and everything else has to be flagged) - and keep that up to date as well, and get sign-offs for any kind of intended contact with such countries.\n\nThat's the deal when holding security clearances - you get the chance to know stuff our enemies would not just figuratively but *literally* kill or go to war for to obtain it, but in exchange you have to relinquish quite a few of your rights.", "label": 1}
{"text": ">cites multiple well regarded diplomats and trusted sources from multiple nations security teams.\n\nLike who?", "label": 1}
{"text": "I don’t give a rats ass if it’s a communist nation, a dictatorship, a fascist state, or a failed state. If the country is actively involved in a proxy war with the USA our defense contractors shouldn’t be having conversations with the leader", "label": 1}
{"text": "The headline is probably nothing but propaganda clickbait. However, even taking it at face value, my reply is: So what? Americans can talk to whoever they damn well please without needing to get permission. \n\nNow piss off!", "label": 1}
{"text": "If Musk and Russia are talking, and Musk isn't doing this at the strict direction of the United States government, then he should absolutely not be doing that.", "label": 1}
{"text": "> I know this might blow your mind, but you can talk to Russians when you have a Top Secret clearance. \n\nConflating a normal Russian with Putin...", "label": 1}
{"text": "> Putin happens to be the leader of the only other significant space capable nation on earth.\n\nSo? If he's talking to Putin and he's not doing it at the explicit direction of the United States government, and especially if the US government isn't aware of it, he is and should be in some serious shit.\n\n> Touch some grass.\n\nMy god, dude. Get a fucking life outside of defending Musk secretly talking to war criminal dictators.", "label": 1}
{"text": "Great job willfully misreading. Blue Origin and SpaceX do not have to be owned and operated by two of the most transparently evil men in contemporary America. And, in fact,  aerospace companies are one of the few businesses where the US government has the obvious levers to force them out.\n\nThey should be forced out.", "label": 1}
{"text": "Yes, but if you have ongoing foreign contacts outside the scope of your government responsibilities, you are obligated to report them.  If Musk took a call from Putin, that's not automatically disqualifying, but there are damn sure counterintelligence hoops he would be expected to jump through.", "label": 1}
{"text": "It was obvious a lot of that staff was not needed, or they were just bad at their jobs. Amount of \"Kill all men\" and bullying going on twitter was insane, with doxxes and child porn being all over, so obviously the content moderation was not working. And Twitter video was garbage, and it still is, but it's much better than it used to be. Whatever engineers were doing, either management did not allowed to be implemented or engineers were to inept to actually do.\n\nPeople look at twitter with rose colored glasses and don't remember what a shit show it always was.", "label": 1}
{"text": "Hello u/p00p00kach00, your submission \"Exclusive: NASA head says report of Elon Musk talking to Putin should be investigated | Semafor\" has been removed from r/space because:\n\n* It is not related to space.\n\n* \n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 1}
{"text": "[The Guardian names Ian Bremmer (runs Eurisa Group a risk consultancy group started in 1998) and Fiona Hill (senior Director for Eu and Russian Affairs during the Trump admin) to start with,](https://www.theguardian.com/technology/2024/oct/25/elon-musk-has-been-in-regular-contact-with-putin-for-two-years-say-reports) \n\nBut this is just the initial report mate, things take time to come out and its not looking positive for Musk. And give his current actions around the presidential election and the war in Ukraine, How you lot still see Musk as a god is beyond me.", "label": 1}
{"text": "The only people I *ever* see interject Musk into conversations about his companies on Reddit are people who have hate boners for the guy. I haven't read a legit Elon fan boy comment in years. We all know the guy is a billionaire who likes to shitpost. We just don't care. We're here to talk about space.\n\nI just can't imagine spending so many hours of my waking life harboring vitriol for a person who doesn't know or care that you exist. You've gotta move on, man.", "label": 1}
{"text": "This must be one of the things he was referring to when he said he was \"fucked\" if Trump loses the election. His security clearances need to be revoked NOW.", "label": 1}
{"text": "why is this NASA's issue and not the NSA's issue?", "label": 1}
{"text": "Well I guess we'll have to let go of the most useless science. Sad, I like the pretty nebula pictures and shit, but if they can't adapt to modernity I guess they're not that smart after all.\n\nOr more likely the real future is in having tons of orbital telescopes and you're just a bitter contrarian redditor who wasn't hugged enough as a child.", "label": 1}
{"text": "What do you expect. People who fellate clueless billionaires are clueless about the field they are criticising lmao.", "label": 1}
{"text": "Astonishing footage!  Congratulations all!", "label": 1}
{"text": "Lol, I'm sorry this hit piece article turned out to he misinformation. Must suck not to have your political agenda and derangement syndrome validated", "label": 1}
{"text": "What an exciting time for astrophysics!! This finding not only solves a mystery but also opens up new questions about the nature of brown dwarfs in general.", "label": 1}
{"text": "Election season, lots of noise from media. I don't know what to believe anymore. \n\nTaiwan wants their own network, it has nothing to do with Putin asking Musk. That probably didn't happen. This story would be more believable if it was Xi Jinping, because Musk has massive business running in China.", "label": 1}
{"text": "Neither are perfect, but if I had to choose between believing Musk or the WSJ, it would be the WSJ every time.", "label": 1}
{"text": "Bot (25 characters, 25 characters)", "label": 1}
{"text": "I don't. He is under the assumption it is special, which is why he thinks \"they have rapid progression\".  SpaceX does its R&D efforts with mostly private funds and minimal government \"assistance,\" which is why they can actually achieve the mythical \"better, faster, cheaper\". It's not because of some secret engineering sauce. It's secret management/business sauce.", "label": 1}
{"text": "It seems like almost every thread has one of these large language model bots now. I don’t get why Reddit allows spammers to get so many accounts.", "label": 1}
{"text": ">It's not because of some secret engineering sauce. It's secret management/business sauce.\n\nWhy don't you ask Boeing how that's working for them.", "label": 1}
{"text": ">when you see how he supported Russia during the war\n\nBy sending thousands of Starlink terminals to the Ukrainians?", "label": 1}
{"text": "And disabling it as soon as the military started using it, while to this day allowing Russian military to use it despite being quite clear they have the capability of selectively disabling clients.", "label": 1}
{"text": ">when you see how he supported Russia during the war,\n\n\nWhy are you lying? Elon and SpaceX have done nothing but sorry Ukraine and harm Russia during the war, and that's despite people like you attacking him for doing everything in his power to help.", "label": 1}
{"text": "As the CEO of two companies with US military contracts? Wow… you don’t care about anything on a worldwide scale.\n\nAlso, what global issues is Elon an expert at again?", "label": 1}
{"text": "Then deactivating them when Ukraine needed them? How about Starlink being used by Russians? You don’t think they know where those terminals are and who is using them. Grow up.", "label": 1}
{"text": ">The nature of the conversation is what matters.\n\n\nExactly. SpaceX just brought back a Russian astronaut from the ISS for the first time, why wouldn't Elon talk to putin about this historic milestone? Additionally Elon regularly meets with global leaders to talk about the importance and benefits of going green. Global warming is a global issue, and Tesla's mission statement is to accelerate the world's transition to sustainable energy, not just the western world. Also, it's well known Elon doesn't like the blood shed in Ukraine. If he can use his influence to ask putin to end the war, why shouldn't he? Simply talking to putin means nothing, and is probably a good thing if you give Elon the benefit of the doubt.", "label": 1}
{"text": "No for free though. The fact is some were sponsored by US but the most starlinks for Ukraine was purchased by Poland.", "label": 1}
{"text": "So because (according to you) there was no law broken, this is fine? Team Russia over here I guess. Are you also mad that you can’t use the N word because free speech?", "label": 1}
{"text": "The source is “someone who knows”. It’s the kind of thing that has consistently been used against Musk - the horse for sex thing was very similar - “someone talked to someone who knows about it”. In an actual court this would be laughed out for hearsay.", "label": 1}
{"text": "You’re being intentionally misleading.", "label": 1}
{"text": "Yeah, you're talking about the military version of it, which came to life after he disabled it during an operation. Let's also remember that the whole initial free usage was nothing more than getting Ukraine to depend on it, then demanding money from the pentagon and threatening to turn it off.\n\nAlso, you posted this reply too fast with nobody mentioning Taiwan. So Mr Russian bot, do better next time and try to be believable with your replies.", "label": 1}
{"text": "It’s not what they talked about over two freaking years! Jebus… Elon is not your god", "label": 1}
{"text": ">and is probably a good thing if you give Elon the benefit of the doubt.\n\nConsidering he's using money to encourage people to vote for a Russian asset in the upcoming election, he should never be given the benefit of the doubt.", "label": 1}
{"text": "\\>Yeah, you're talking about the military version of it, which came to life after he disabled it during an operation. Let's also remember that the whole initial free usage was nothing more than getting Ukraine to depend on it, then demanding money from the pentagon and threatening to turn it off.\n\nNo, I did not. the military version is Starshield. Which is only in its development stage. Only 16 test satellites for it has been launched so far. It's irrelevant here. He never diabled it. It was simply never activated in the Russian occupied territory for the reasons I have already stated. And Ukraine to depend on it? That's like saying Ukraine depends on all the weapon systems they use to fight the war. It's an asset they would be MUCH worse of using.\n\n  \nI literally just posted the entire statement SpaceX posted. Please get your head out of the sand.", "label": 1}
{"text": "You are not using any common sense if you think that Putin has time or interest in a conversation about the scourge of global warming or the return of a cosmonaut through SpaceX gear. I mean it's just beyond ridiculous to suggest Putin gives one iota of interest in what Musk thinks about sustainability, or that he even cares about Ukraine at this point, much less that he's got any sway over policy there. I don't usually think I'm talking to actual propagandists here but if you're not one you really need to think more about what motivation parties in a discussion might actually have.", "label": 1}
{"text": "Right, I'm sure they talk about green energy and ending the war in Ukraine", "label": 1}
{"text": "These fools really want to believe that don't they?", "label": 1}
{"text": "Elon is obviously influential and very popular, that's why he regularly meets with every other global leader in the first place. People do in fact want to listen to him about green energy. ", "label": 1}
{"text": "Your reading comprehension is not very good is it? It's because they use them when they're in the territories still controlled by Ukraine. SpaceX would have to be able to know all the positions of all the troops in Ukraine at any given moment to be able to differentiate Russian starlink terminals from ukranian ones. Which is obviously impossible for them. It's difficult enough for them to constantly update Starlink's coverage of Ukraine depending on who controls what territory.", "label": 1}
{"text": "I will quote what I already wrote since you don't seem to bother reading my comments\n\n\\>Literally anybody in the west can go into their local electronics store and buy a starlink terminal. There are literally millions of them. No, you can't differentiate between the terminals when they're used in the same area. Just like Russian terminals were bought in the west and sent there, so were the majority of the ones used by Ukraine through donations. You can't differentiate between these.\n\nIf you wouldn't be able to activate these terminals in Ukraine after you bought them the majority of Ukraine's terminals would be useless as they wouldn't be able to activate all the ones donated to them through literall hundreds of different channels. You can't differentiate the ones Russia smuggled into their country from the ones donated to Ukraine. Because in the end they were bought through basically the same channels.", "label": 1}
{"text": "You can't possibly think Putin gives a flying fuck about green energy. The same Putin that on the regular orders hitmen on his political enemies, poisons them abroad, sends oligarchs that endanger his position flying out of windows and the same Putin that sends meat wave after meat wave of soldiers into his invasion of Ukraine.\n\nThe same Putin that has been meddling in US elections by spreading misinformation and propaganda on all social media networks, the same Putin that according to US intelligence has been proven to meddle in US elections. \n\nYou are utterly, utterly naive to believe Putin wants to talk about green energy with Musk.", "label": 1}
{"text": "Gee I can't imagine why those sources would like to remain anonymous and not have their lives destroyed when Musk inevitably puts their name on twitter, unleashing a hate campaign against them that will annihilate their existence.\n\nReal mystery, that one.", "label": 1}
{"text": "That guy's post history looks to be largely shilling for Musk, anyway.", "label": 1}
{"text": "Gee I can’t imagine why someone who is making things up would prefer to remain unverifiable. Unless you’re saying there’s absolutely no reason someone would make things up against Musk 2 weeks before the US election. The story happened in 2022, but coincidentally broke 2 weeks before the election. Who are these people kidding?", "label": 1}
{"text": "Having worked in some of the mentioned organizations; I cannot agree more.  Engineers need less \"leadership\" and oversight than gets forced upon them.  Give them a problem and get out of the way.  They will self organize to fit the problem being solved.", "label": 1}
{"text": "Nah, everyone knows these things were possible. Physicist worked out the math decades ago. We just needed the materials science to catch up with what was known to be physically possible. \n\nWhat was considered \"close to impossible\" was NASA doing it with only the resources allocated to it by Congress.", "label": 1}
{"text": "Probably because Reddit is getting some form of compensation for allowing companies to train on the amount of content it has.  I was listening to a podcast going over how OpenAI has already exhausted the publicly available resources to train their LLM on and now are using Reddit and other social media to train it.  It scares me to think AI is learning how to converse and think through these channels.", "label": 1}
{"text": "You need to keep up with the news :-)\n\n[The author who claimed that SpaceX deliberately deactivated Starlink in order to block a military operation later fully retracted that claim](https://www.theguardian.com/books/2023/sep/12/elon-musk-biographer-admits-suggestion-spacex-head-blocked-ukraine-drone-attack-was-wrong) (source: The Guardian, a reputable newspaper).", "label": 1}
{"text": "So you agree with me that SpaceX supplied large numbers of Starlink terminals to Ukraine.", "label": 1}
{"text": "dude managing 3-4 gigantic companies, while having 12 children and play game what a legend. all thing space x probably fall to the hand of gwynne shotwell, the woman who actually in charge of everything. elon just a figure head give some idea here and there.", "label": 1}
{"text": "100%. I wish more people understood this. SpaceX management philosophy allows them to not be burdened by certain inefficiencies present elsewhere. Engineers are the same besides general work/life balance expectations (SpaceX is generally more intense, NASA is generally more chill).\n\nAnother aspect of this is that NASA engineers provide insight to SpaceX as part of their contract. 100s of NASA engineers have reviewed the subsystems of Starship top to bottom and have provided feedback to SpaceX. It's a working relationship between teams.\n\nSource: one of those engineers.", "label": 1}
{"text": "Why would he record random phone calls? Is that a thing?", "label": 1}
{"text": "If the haters stop posting information about him, I'll stop correcting it.", "label": 1}
{"text": "> You can't possibly think Putin gives a flying fuck about green energy. The same Putin that on the regular orders hitmen on his political enemies, poisons them abroad, sends oligarchs that endanger his position flying out of windows and the same Putin that sends meat wave after meat wave of soldiers into his invasion of Ukraine.\n\nI don't see what these two things have to do with each other. The saudis aren't greta people either, but they the biggest investors in green energy in the world and are divesting from oil because they see the writing on the wall. If the Saudis of all people can be convinced to abandon oil, russia can too.\n\n>The same Putin that has been meddling in US elections by spreading misinformation and propaganda on all social media networks,\n\nAgain, what does that have to do with conving putin to abandon oil? Also the only misinformation I see is about Elon. Redditors love spreading misinformation about him. I get that two wrongs don't make a right, but the biggest and most damaging source of misinformation is right here on reddit, being spread by commies.\n\n>You are utterly, utterly naive to believe Putin wants to talk about green energy with Musk.\n\nI think you're hooked too much into a singular black and white narrative. People can be evil and still see the logic of investing in solar panels and EVs.", "label": 1}
{"text": "I eagerly await the day that Chat GPT casually mentions The Poop Knife in a response. Or, my personal favorite, the tenuously relevant \"And my axe!\" I mean... the model collapse is a bummer. But think about the memes!", "label": 1}
{"text": "How many times each day will this get posted?", "label": 1}
{"text": "Or someone who knows something decided to speak up because they recognized the threat of billionaires like Musk buddying up with a fascist like Trump.\n\nMusk is literally breaking the law by paying people to register to vote. That is flat out illegal and an attempt to sway the election by buying votes. \n\nBut to you, I'm sure this isn't a big deal.", "label": 1}
{"text": "That’s so absurd.\n\nAlthough the Kims had a cellular phone with them, their remote location in the mountains was out of range of the cellular network, \n\nhttps://en.wikipedia.org/wiki/James_Kim", "label": 1}
{"text": "Oh cool I'll let the astronomers and GAO know you gave the all clear. Who knew the answer to these questions could be dealt with so easily", "label": 1}
{"text": "People love the feeling of being one of the elite few who know \"the real truth\" while the masses are ignorant.  Some enjoy this feeling so much that they're happy to accept basically any narrative which contradicts the standard one.\n\nTo get that feeling for real is a hell of a lot of work, e.g., when making a new scientific discovery you are briefly the only one to know something, but believing some fool on YouTube couldn't be easier.", "label": 1}
{"text": "According to some spacex engineers, not true all, you do you", "label": 1}
{"text": "Never gonna happen, not while Garry Kasparov still defends man from machine with his secret knowledge of the mysterious en passant.", "label": 1}
{"text": "If I see an ad in the night sky, I am becoming a terrorist", "label": 1}
{"text": "Damn quick someone find a way to blame Elon", "label": 1}
{"text": "He idiot, one is a telescope facing away from Earth. The other is a flat reflective metal surface point back at 🌎. There is a huge difference.", "label": 1}
{"text": "Discussion Starter: As space continues to be commercialized, an increasing amount of items will be put into space, dramatically increasing the possibility of collisions. Donald Kessler predicted this effect in 1978, and the problem has only increased since then. What solution do you think is the best?", "label": 1}
{"text": "Put satellites into orbit around the moon, which send signals back from there.\n\nLeave the planet's orbit for the most strictly necessary.", "label": 1}
{"text": "Well, to be fair the prompt was for the best solution. If I would rather make things worse for everyone, I'm technically correct.", "label": 1}
{"text": "Hubble is a shiny metal tube with flat solar panels. Both reflect sunlight, which is how you would see them. Not sure you should be throwing that word around when this is your level of misunderstanding.", "label": 1}
{"text": "Hello u/LettuceNo7413! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 1}
{"text": "Right there with you man. Gonna have to make a rail gun i guess.", "label": 1}
{"text": "I've got a tungston guy that's pretty reliable. Magnets are gonna be the issue here.", "label": 1}
{"text": "Friendly reminder that Trump was anti-EV until Elon kissed the ring.  \n\nIf Elon wanted to advertise in Space under a Trump presidency, this (or any) written law wouldn’t stop them.", "label": 1}
{"text": "Hello u/DanielJStein! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 1}
{"text": "automod is broken is broken today it seems", "label": 1}
{"text": "Hello u/TicketFew6932! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 1}
{"text": "Hello u/descriptiontaker! Unfortunately, your submission has been removed because we only allow images to be posted on Sunday (UTC).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/space) if you have any questions or concerns.*", "label": 1}
{"text": "Why cant we just work with the chinese and collectively work together to enhance this station further? Im sure alot of the shit they’re doing on there we’ve already done in terms of experiments. Would be dope to have a world space station rather than individual country stations.", "label": 1}
{"text": "Because congress made it illegal. That's why.", "label": 1}
{"text": "> Why cant we\n\nBecause this `dope` space station is built on top of human rights violations? Some of their rockets make it to space to make a cool space station, others filled with toxic propellant fall on unsuspecting villages.", "label": 1}
{"text": "Because China and Xo Jinping are actively trying to claim the entire South China sea as their own territory rather than respecting international boundaries. They have rammed Filipino ships and are building bases on islands that belong to other countries. \n\nThey want all trade to go through China before it gets to Taiwan. And that's a problem", "label": 1}
{"text": "Thats actually a long agreed on treaty to not do so. So laws would need to change significantly.", "label": 1}
{"text": "Some sort of pipe, maybe for water, sewage, or oil?", "label": 1}
{"text": "Hang on. I thought these commies were still in the dark ages. Fucks sake Trump...", "label": 1}
{"text": "A flying object that can't be identified. What's the big deal?🤔", "label": 1}
{"text": "With a value right there in the middle.", "label": 1}
{"text": "Autobot/Deception coming in to join the battle for Earth", "label": 1}
{"text": "Wait until you find out there's like a dozen countries with claims in the South China Sea that all don't care about the current boundaries, including the Philippines.", "label": 1}
{"text": "No silly, that’s clearly a body of water", "label": 1}
{"text": "The birth of dragons! Congratulations on seeing the red comet!", "label": 1}
{"text": "Excuse me, those are trees.", "label": 1}
{"text": "I sure hope we all are. ***Artificial*** is in its name after all.", "label": 1}
{"text": "It’s definitely trees at night at the edge of a body of water. I’m with this guy.", "label": 1}
{"text": "Someone threw P Diddy out of a plane now he's burning up in the atmosphere 😂", "label": 1}
{"text": "Looks like a water main or possibly gas... Plumbing of some sort.", "label": 1}
{"text": "Naw that's light pollution from New Orleans", "label": 1}
{"text": "Cannot see how this is a measure of quality. My bike is artificial and I can ride it faster and more comfortable than any human I tried.", "label": 1}
{"text": "Looks like a manual valve on a 10\" to 12\" pipe. But seriously, that is very likely a plane as the trajectory is horizontal and the left wing light is red (on all planes, boats, etc.).", "label": 1}
{"text": "A jet contrail at sunset. I've seen similar numerous times.", "label": 1}
{"text": "Lmao perfection isn’t appreciated enough.  I wish we could cultivate it, bind it with ancient sigils atop the crowns of our heads.  Spread its magnanimity like light passing an event horizon.  Make it flush.  Cantilevered. ", "label": 1}
{"text": "Riding a bike has literally nothing to do with and is incomparable to our mind, organically constructing consciousness as we know it.", "label": 1}
{"text": "The image appears to show a nighttime scene over a body of water. In the sky, there is a bright, horizontal streak of light, possibly a meteor or an aircraft, glowing in red and orange hues. The streak suggests rapid movement against the dark background. In the foreground, there is a rust-colored metal pipe with a valve, which adds an industrial element to the scene. The overall atmosphere is dark and mysterious, with a hint of urban or industrial context along the water's edge.", "label": 1}
{"text": "Likely a water main as a gas main would not have the valve accessible to everyone like this.", "label": 1}
{"text": "Depends on where you are - if you're in Ukraine or Lebanon... duck.", "label": 1}
{"text": "Everything changed, when the Fire Nation attacked", "label": 1}
{"text": "If this video was recorded recently there was a Comet passing by earth this last week. Maybe it’s that?", "label": 1}
{"text": "That’s a pipe!  Wait…. Oooooh the thing in the sky sorry can’t help", "label": 1}
{"text": "Dang all about right time right place if it’s crew 8’s re-entry", "label": 1}
{"text": "Sorry I was just flying by. Thought the place looked neat.", "label": 1}
{"text": "As a pipefitter I can confirm that is a 10” 150# line with a reducing 10” 150# x 8” 300#  45 with an open gate valve directly off the 45. Painted red so good chance it’s a firewater line.", "label": 1}
{"text": "That’s Tom Cruise piloting Darkstar  to Mach 9", "label": 1}
{"text": "Looks like a pipe. Been playing Satisfactory lately?", "label": 1}
{"text": "Thats just hancock drunk flying no need to worry", "label": 1}
{"text": "The members of Heavens Gate returning to take over the earth?", "label": 1}
{"text": "Finally we have got the correct answer.", "label": 1}
{"text": "It's the end of a Dragon (mission), actually.", "label": 1}
{"text": "Looks like a orange pipe with a pressure valve", "label": 1}
{"text": "I can unequivocally say this is not Sigmar, because it only has one tail.", "label": 1}
{"text": "It's Deep Purples \"Fireball\" album. \n\nWe're only just now able to see the light from it.", "label": 1}
{"text": "Those are the Mighty Morphin Power Rangers traveling", "label": 1}
{"text": "I believe it means a dragon was born.. maybe even 3 who knows", "label": 1}
{"text": "My spitfire after I do a 10000km climb in warthunder", "label": 1}
{"text": "Hahahahahaha, the Classic Blunder lives on", "label": 1}
{"text": "Whats the biggest pipe you’ve ever fit?", "label": 1}
{"text": "Look up in the sky, it's a bird, it's a plane, it's Superman ...", "label": 1}
{"text": "Well, was it faster than a speeding bullet?", "label": 1}
{"text": "I would say it’s IRONMAN testing his new suit", "label": 1}
{"text": "That’s crude oil or gas or liquid gas otherwise referred to as Y Grade or otherwise referred to as NGL pipeline. Short answer: a pipeline.", "label": 1}
{"text": "6 inch sprinkler mains are a right bastard to get up on your shoulder and into the next bit to clamp up I know that much", "label": 1}
{"text": "It is 100% not a comet. No comet is that clearly visible. It's probably a rocket of some sort of a meteor coming in at a very low angle. \n\nMore than likely though, it's some nefarious deep state, radical left something-or-other.", "label": 1}
{"text": "Isnt there like tons of space in space?", "label": 1}
{"text": "I swear to god i have seen this picture before........", "label": 1}
{"text": "You should crosspost it to r/idthisanimal, but i think you just captured the highly elusive NyanCat", "label": 1}
{"text": "A red pipe with a valve of some sort but importantly, what is that thing in the sky behind it?", "label": 1}
{"text": "I was going to say Sozins Comet, but this seems like a more accurate answer", "label": 1}
{"text": "They probably just painted it red so it goes faster.", "label": 1}
{"text": "I'm thinking probably water pipes.", "label": 1}
{"text": "Looks to be like some kind of valve on a pipe. Perhaps to reduce or stop flow entirely?", "label": 1}
{"text": "A chance to make a big wish.", "label": 1}
{"text": "It looks like the kind of large wheel that's used to open and close valves on water pipes.", "label": 1}
{"text": "Just a valstrax about to ambush a poor hunter pay it no mind", "label": 1}
{"text": "Never bet against a plumber, when pipe is on the line.", "label": 1}
{"text": "magic i truly believe what you are witnessing is pure magic, looks cool", "label": 1}
{"text": "Love it, and I know nothing about pipes.", "label": 1}
{"text": ">to the current treatment of the Ugyirs.\n\n... a growing population every year, so literally the opposite?", "label": 1}
{"text": "That is a knife gate valve. Judging by the bolt pattern and flange thickness I’m going to guess that it is a low pressure 6” pipe that transports water. It is currently in the open position. Despite its reddish colour and that it is not locked in the open position I’m lead to think it is not emergency fire fighting water", "label": 1}
{"text": "You are all insane, it is clearly a type of water piping with a valve. Crazy", "label": 1}
{"text": "Im dying laughing as the drywall list guy. My fitter standing there looking at the list of drops with a giant pile of oily drywall scraps at his feet from earlier in the day! All written in sharpie.", "label": 1}
{"text": "Iiit’s theee ehndd of the world as we know it! It’s theee…", "label": 1}
{"text": "That’s a ductile sewer main pipe with gate valve.", "label": 1}
{"text": "I was going to say it was the comet we have had here for the last few weeks, but that appeared in the western sky.", "label": 1}
{"text": "It’s the Master Chief before he crashed in Africa after he jumped off the Forerunner Key Ship.", "label": 1}
{"text": "That's the Enterprise doing the slowdown maneuver - \"orbital speed friction braking\"", "label": 1}
{"text": "I’m trying to send over more pictures of the same kind of craft but my phone keeps freezing!!! F@&#!!!!", "label": 1}
{"text": "One of my dingleberries on fire fired from a slingshot.", "label": 1}
{"text": "That’s a hand valve, I think you can call it a spigot as well, idk I’m not a plumber", "label": 1}
{"text": "*In the black water with the sun shining at midnight, those fruit shall come ripe and in the darkness of that which is golden shall split open to reveal the revelation of the fatal softness in the earth.*\n\n  \n(sorry, too much Vandermeer lately :D )", "label": 1}
{"text": "Its a variation of the 1988 iteration of the BBC title card", "label": 1}
{"text": "The average distance between Starlink satellites is 250km. It's not exactly crowded up there.", "label": 1}
{"text": "seems like a gate valve or an other type of valve used in piping", "label": 1}
{"text": "Pipe layer here. Looks like you’ve got a metal pipe with a valve, a shallow bend (maybe a 45), and straight pipe on either side. \n\nAlso there’s some odd bullshit happening in the sky.", "label": 1}
{"text": "Crew #8 return to earth aboard a SpaceC Capsule!? 🤔", "label": 1}
{"text": "Boeing 737 on fire. Boeing is having a bad year ..", "label": 1}
{"text": "It smiled back for the first time. It found three rugged people. Not including me.", "label": 1}
{"text": "It looks like a lake. Let me know if you find out though.", "label": 1}
{"text": "Well I *thought* I was clever just with \"Looks like a pipe to me.\" Didn't have to show the rest of us up that hard, dang. ", "label": 1}
{"text": "And here my answer was a body of water and the shoreline.", "label": 1}
{"text": "It's my space ship...im supposed to be undercover so if you stop telling people about it I will give you a ray gun 👽   🔫", "label": 1}
{"text": "Interstellar space travelers returning to check on their conquest.", "label": 1}
{"text": "Nyannnyanyan... for 10h straight", "label": 1}
{"text": "The starship enterprise on a mission to save warf", "label": 1}
{"text": "beast haha! as long as the 300 keeps turning the system is working accordingly. is he marking his cuts with paint marker or a dab of dope?", "label": 1}
{"text": "Where's the reducer? The entire line seems to be the same size.", "label": 1}
{"text": "Is it a rocket? Is it a plane? No! It’s SupaMan!", "label": 1}
{"text": "That’s an OS&Y RF Gate Valve.  Probably a size 10-14", "label": 1}
{"text": "It appears to be some type of streak in the sky.", "label": 1}
{"text": "Superman doing Mach 2 on his way to Metropolis", "label": 1}
{"text": "Some kind of water pipe and valve next to a lake at night!", "label": 1}
{"text": "looks like a turning valve for controlling the flow of the liquid in the tube", "label": 1}
{"text": "Wholesome keanu reeves big chungus 69 420 funny number kamala harris bernie sanders reddit moment!", "label": 1}
{"text": "It’s a bird…. It’s a plane…….it’s …… Superman", "label": 1}
{"text": "Good. Losing Chandra would be horrible for X-ray astronomy and Hubble deserves to stay up there as long as SpaceX needs to develop Starship in order to bring it back.", "label": 1}
{"text": "You hit a lightening bug.  Don't hit the wipers!", "label": 1}
{"text": "Its a wheel used to turn a valve or gate of some kind. Often used in pipelines to regulate and/or control flow of the fluid being transferred", "label": 1}
{"text": "It would appear to be a red pipe with a valve on it.", "label": 1}
{"text": "A fishing float being struck across the camera", "label": 1}
{"text": "It’s Tom Cruise testing the Darkstar from the movie Top Gun 2.", "label": 1}
{"text": "Vietnam has double the militarized islands on the SCS and builds closer to the Phillipines than China ever did.\n\nThe Phillipines tried to claim parts of EAST MALAYSIA. Not just the sea, but COASTAL AREAS. The Phillipines also shot and killed Taiwanese sailor over territorial disputes.\n\nIs Vietnam not a communist authoritarian totalitarian government? Why is the US pandering hard to Vietnam now? Was China in 1971 not so when the US laid out the red carpet?\n\nYou see that in your daily western propaganda? Of course not. It's disingenuous to say the West fights for freedom when its historical record consistently shows it only attempting to expand its own power, including by destroying popular democratic governments(Mossadegh, Sandinistas to name a couple), and funding/arming military dictatorships everywhere.", "label": 1}
{"text": "I'm a shooting star leaping through the sky\nLike a tiger defying the laws of gravity\nI'm a racing car passing by\nLike Lady Godiva\nI'm gonna go, go, go\nThere's no stopping me\n\nI'm burning through the sky\nYeah!\nTwo hundred degrees\nThat's why they call me Mister Fahrenheit\nI'm traveling at the speed of light\nI wanna make a supersonic man out of you\n\nIt's clearly Freddie Mercury", "label": 1}
{"text": "It's an open OS&Y valve. Not sure if it's fire suppression or some other fluid management.", "label": 1}
{"text": "Looks like a few pixels are out on the sky dome", "label": 1}
{"text": "ICBM (I have to write now 25 characters long for not farming karma as the text said, so I'm writing this now)", "label": 1}
{"text": "I was thinking Sputnik rentry. I didn't  even notice the pipe at first.", "label": 1}
{"text": "I assume it's the comet C/2023 A3 (Tsuchinshan-ATLAS) which should be passing over Denmark right about now", "label": 1}
{"text": "Looks like an 8” rising stem gate valve to me.", "label": 1}
{"text": "Superman after Lois called to say she’s home alone", "label": 1}
{"text": "They're pipefitters, not Orks!", "label": 1}
{"text": "OS&Y Wedge Gate to be exact.", "label": 1}
{"text": "You know this guy lays pipe.", "label": 1}
{"text": "How do one become a pipe fitter?", "label": 1}
{"text": "Certainly looks like a valve if some sort, if you spin it one direction will open up and let some liquid or gas travel through it, or it might tighten and prevent it from happening", "label": 1}
{"text": "Damn nice shot! The comet AND Starlink!", "label": 1}
{"text": "Could be Space X team returning, or a comet that recently streaked across our sky.", "label": 1}
{"text": "Yes, that's an Outside Screw & Yolk Valve (OS&Y) 😂🤣😅", "label": 1}
{"text": "Luke throwing his lightsaber after that one scene in The Last Jedi.", "label": 1}
{"text": "Superman.. Obviously. Can't you see the red blue and white? 😂", "label": 1}
{"text": "Sixty million years ago the Old Ones and the Ca’tan crashed biological weapons to fight on their War in Heaven. The Old Ones gifted the Eldar knowledge of the warp and created the Krorks to fight the Ca’tan head on. The Ca’tan tricked their worshipers, the Necrontyr, immortality at the cost of their very souls. The war waged for millions of years, resulting in the great slumber of the Necrons and the rise of the hegemonic Eldar Empire. We still have about twenty thousand years until Eldar excesses and decadence create Slaanesh, for now they secretly rule the galaxy. \n\nOne day the immortal psyker Neoth will unite humanity and lead us towards our evolution into a psychic race.", "label": 1}
{"text": "Beneath a bleeding star, Azor Ahai will be reborn amidst salt and smoke", "label": 1}
{"text": "Ceci n'est pas un pipe.\n\nIt's a picture.", "label": 1}
{"text": "Thats the FTL plasma beam fired by Starkiller Base towards the galactic capital of Hoznian Prime. Hope this helps!", "label": 1}
{"text": "Gate valve in the pipe, used for closing and opening flow fluids.", "label": 1}
{"text": "You’re gonna have to post in r/ufo or r/UAP if you want some real answers", "label": 1}
{"text": "It’s a gate valve, sometimes called a wheel head valve. Connected onto a steel pipeline with flanges and painted with red oxide primer.", "label": 1}
{"text": "Seems to be some dihydrogen monoxide.", "label": 1}
{"text": "that’s a bird. no actually it’s a plane. wait that’s….", "label": 1}
{"text": "As others have said it looks like the capsule return. Very cool that you got to bear witness.", "label": 1}
{"text": "I don’t know much about pipes, but it definitely looks like some sort of pipe to me.", "label": 1}
{"text": "> were still in the dark ages\n\nThey bought tech from Russia. See:\n\n- https://en.wikipedia.org/wiki/Tianhe_core_module\n- https://en.wikipedia.org/wiki/Mir_Core_Module\n- https://en.wikipedia.org/wiki/Zvezda_(ISS_module)\n\nand\n\n- https://en.wikipedia.org/wiki/Soyuz_(spacecraft)\n- https://en.wikipedia.org/wiki/Shenzhou_(spacecraft)\n\nall resemblance is purely coincidental ;)", "label": 1}
{"text": "Looks to me like a pin flam-fastened pan trap at the maiden-apex of the jim-joist.", "label": 1}
{"text": "Lmao. I scrolled too far down for this.", "label": 1}
{"text": "What's the difference? Have you ever seen a purple pipefitter? I didn't think so!", "label": 1}
{"text": "Yeah we've been doing it for decades but only the government regular people have not been doing it for decades.", "label": 1}
{"text": "It's so much better to be hilarious instead of dumb and mean. Great reply!", "label": 1}
{"text": "I think in the world of Mario, some would call that a fireball.", "label": 1}
{"text": "Looks like some kind of valve", "label": 1}
{"text": "Class 7 alien craft with high powered LED lighting.", "label": 1}
{"text": "A photo that would make an amazing album cover.", "label": 1}
{"text": "Dinosaurs roamed the earth for 350 MILLION years and never did a single thing of note!! They were just as dumb and stupid on the last day as they were 350 million years earlier… but Homo sapiens have got people flying back into the earths atmosphere from a trek into space in just 100,000 years!!!! We are looking everywhere in the universe for extra terrestrial life but WE ARE THE ALIENS!… we are not from here it is clear. Idk who put us here obviously but it wasn’t Mother Nature 100%.", "label": 1}
{"text": "We can pretend that airplanes in the night sky are like shooting stars...", "label": 1}
{"text": "A dragon has been born. At least according to game of thrones", "label": 1}
{"text": "It appears to be a large red pipe with a shut off valve.", "label": 1}
{"text": "Looks like a pipe with some kind of valve on it.", "label": 1}
{"text": "Anybody on P-Diddys videos leaving the country", "label": 1}
{"text": "That’s crazy I saw the valve and thought it looked like you were on the river working at plant. I’m from the same area and worked in many plants", "label": 1}
{"text": "That's just God fixing the saturation and other stuffs in the night sky.", "label": 1}
{"text": "If this is a painting rather tan a photograph, then it could be a happy little accident.", "label": 1}
{"text": "It looks like a water supply pipe with some sort of shutoff valve.", "label": 1}
{"text": "I’m no expert, but that looks like a water pipe with a wheel shutoff valve.", "label": 1}
{"text": "Giant Meteor looking at the 2024 race and just noping the fuck away.", "label": 1}
{"text": "That made me chuckle. I'll just use my 3 inch brush and make some leaves on these trees, oops just a happy little accident, but that's OK.", "label": 1}
{"text": "Looks like a water pipe.  I doubt gas (or waste) would be that high?   But IDK where you are in reference to the ground so the perspective is vague.", "label": 1}
{"text": "Looks to be a pipe. Red in color, with a valve.", "label": 1}
{"text": "Looks like a pipe, usually for fuel or drainage.", "label": 1}
{"text": "Rainbow Bright streaming across the night sky, as seen from afar.", "label": 1}
{"text": "It's a bird,  no it's a plane,  no it's SUPERMAN!", "label": 1}
{"text": "Ol’ Ferrari pipes gonna Ferrari pipe.", "label": 1}
{"text": "Thank you!", "label": 1}
{"text": "That is a flange joist joining a manual valve from a stand pipe to a feeder vein.", "label": 1}
{"text": "Looks like 4\" steel pipe, bolted flanges, maybe a needle valve. The red paint tells me it's fire suppression, but it looks waist high, which would be unusual... Unless it's a pump bypass? Some more context would be-\n\nwait, what sub is this? \n\nOOOOOOH", "label": 1}
{"text": "Valve. Looks like a Butterfly valve with a hand wheel manual actuator.", "label": 1}
{"text": "It's an etch a sketch line. You use that wheel there to move it. Should be another nearby to go the other direction.", "label": 1}
{"text": "Yeah those are definitely all 150 class fittings. I think the bolt pattern for the valve top works confused them but it’s a 150 class valve.", "label": 1}
{"text": "Damnit. This is why I came to this post", "label": 1}
{"text": "Some sort of large rock, possibly made out of metal.", "label": 1}
{"text": "I’m going to need all of you to look at this device…,", "label": 1}
{"text": "Maverick pushing 10.1 mach for excessive testosterone.", "label": 1}
{"text": "Looks like a water pipe with a valve to close/open it", "label": 1}
{"text": "A water valve with a wheel, commonly a gate or globe valve, is used to control water flow in plumbing systems. Turning the wheel moves a gate or disk inside the valve, which either blocks or allows water flow. Turning the wheel clockwise typically restricts or shuts off water, while counterclockwise opens the flow.\n\nKey components include the handwheel (usually metal or plastic), a stem connecting the wheel to the gate or disk, and the valve body, made from materials like brass or PVC. Gate valves are ideal for fully open or closed positions, while globe valves offer more precise flow control.\n\nThese valves are widely used in household, commercial, and industrial plumbing, as well as irrigation systems. The wheel design offers leverage, making it easy to control or completely stop water flow as needed.", "label": 1}
{"text": "Is there any way to setup that I charge $50,000,000 per astronaut (or space debris) to land on my property?", "label": 1}
{"text": "entertainingly, the misspelling you made was like... the most correct possible misspelling.\n\nBy which i mean, the letters \"u\" and \"v\" were, long ago, the same letter, and we started writing them differently to denote how they were being pronounced slightly differently. This is also part of why \"w\" gets called double-yuu, despite being written more like double-vee - there absolutely were times when words were written down like \"uuorld\" instead of \"world\". The distinction between those three letters was still being solidified at that time.", "label": 1}
{"text": "That is the Comet Halle Berry", "label": 1}
{"text": "Looks like some sort of pipe used for regulating water flow", "label": 1}
{"text": "Superman. Without a doubt. 🙂", "label": 1}
{"text": "It could be The Raider I think that’s a I think it’s a black ops project, but they announced it", "label": 1}
{"text": "Ain't no way superman is out flying in the open", "label": 1}
{"text": "That’s Maverick trying to reach Mach 12 this time", "label": 1}
{"text": "The answer I came here looking for, was gonna post this too but figured the mods would just delete it. Nice to see that didn’t happen. The funny part is I actually looked at the pipe with the valve before I saw what OP wanted me to see.", "label": 1}
{"text": "Guys, stop you're making me more self-aware 🤭", "label": 1}
{"text": "Alien invasion...or something that starts the zombie apocalypse hopefully", "label": 1}
{"text": "This is Reddit. A specifically a subreddit for space.", "label": 1}
{"text": "As my son would point out, it’s clearly Iron Man.", "label": 1}
{"text": "The night sky maybe? Just a guess though I could be wrong.", "label": 1}
{"text": "The Omnitrix, If you follow where it could have went you’ll have a chance to wear the omnitrix and be able to transform into 10 different aliens", "label": 1}
{"text": "This is a vertical photograph, presumably from a smart phone.", "label": 1}
{"text": "IT's a shut off valve on a pipe, the trail of light thing might be a comet", "label": 1}
{"text": "Pretty sure it's just a big pipe with a valve.", "label": 1}
{"text": "That's John Mayer's guitar tech", "label": 1}
{"text": "As soon as you have the massive rocket, the next step is to fake a moon landing.\n\n[https://www.youtube.com/watch?v=P6MOnehCOUw](https://www.youtube.com/watch?v=P6MOnehCOUw)", "label": 1}
{"text": "Arrest the traitorous Nazi CEO and nationalize the rest of the company.", "label": 1}
{"text": "Another jacquouille la fripouille giving his opinion, but the world don’t cares about what he thinks and no one will remember him.", "label": 1}
{"text": "The reason people sometimes think anything was recovered is because the crypto bros generated AI fakes of the flaps in SpaceX saying stuff like \"the flap was still recovered\" and stuff like that. There's a lot of conflict of interests around Leon causing an unusual interest in promoting misinformation (and it's been like that for a long time, just look at Teslarati for instance, one of the biggest sources). Now that Leon has gone full MAGA, expect misinformation trying to make him look good skyrocket", "label": 1}
{"text": "I’m  sure the Germans were quite pleased with the performance of the V2 as well. Why carry water for an open nazi?", "label": 1}
{"text": "Yes let’s arrest the guy who is single handedly revolutionizing the space industry", "label": 1}
{"text": "You want to punish a company that’s revolutionizing the space industry just because you don’t like its CEO?", "label": 1}
{"text": "Wow, you just won the prize for the most idiotic comment on Reddit, congratulations 🎉", "label": 1}
{"text": "Live with it, delusional hater. Gonna have fun in the next years, but you won't be happy I think", "label": 1}
{"text": "> Any and all of the credit for SpaceX’ accomplishments goes to the workers and engineers. \n\nYou must therefore think really poorly of the workers and engineers at ULA, Blue Origin, Arianespace, etc.\n\n> they’re a company which has consistently over-promised and underdelivered\n\n[Yet they launch more than everyone else *combined,* be it in tonnage, payload count, or launch count.](file:///home/chris/Downloads/Bryce%20Briefing%202024%20Q1-3.pdf) But I suppose you might be right in one sense: the other companies promise little - and meet expectation.", "label": 1}
{"text": "You got problems buddy, SpaceX is awesome", "label": 1}
{"text": "Moderators, maybe we start banning people who attempt to destroy the conversation with non-r/space related political discourse?  Clearly they don’t like it here.", "label": 1}
{"text": "Amazing shots! Super cool how close up they are", "label": 1}
{"text": "Well, I stronglyndisagree with that.\n\n\nIt can totally be coincidence. We should assume that those are untrue because we cannot back them up with any evidence whatsoever. Quite the contrary, most of them can be easily disproven.\n\n\n\nMythology is not a substitute for science, it isn't equal. Regardless of how cool it can be at times.\n\n\n\nWe should still remember it, but for completely different reasons.", "label": 1}
{"text": ">we cannot back them up with evidense ***yet***.\n\nFTFY.\n\nIf we find that evidence; those with your attitude will ignore it. Not very scientific now is that?", "label": 1}
{"text": "Elon Musk calls the head of NASA a pedo and changes the spacex logo to include a swastika.", "label": 1}
{"text": "No one is enriching SpaceX, NASA is administrative.\n\nSpaceX gets paid for a product, not subsidies.\n\nStop this fucking nonsense.", "label": 1}
{"text": ">Bro; SLS costed 20 billion to develop\n\nAnd the Saturn V cost $40 billion. The cost per launch of SLS is 2 billion because SLS does not make use of economies of scales. Saturn V with 11 launches in a short period of time reduced its launch cost to 1.2 billion dollars. \n\nAlso the integration of older technology was costly but saved time. Otherwise the SLS would be flying manned in the 2030s and now blowing up in IFTs.\n\n> was delayed many times\n\nSame as Ariane 6, Vulcan Centaur, Starship etc.\n\n>didn’t even launch Europa Clipper.\n\nThe full official authorization to use the SLS came when NASA had *already* ordered the first 11 SLSs to support the Artemis missions and there was no room to build one more in between. Plus the SRBs made the rocket too shaky and Europa Clipper integration would take more time.\n\n>Anyways it is pointless to argue with someone with SLS as a profile picture.\n\nThen shut your little mouth 🙃", "label": 1}
{"text": "One cannot prove something *does not exist*. I assume you learned this in school. The absolute fact you have **faith** it does not exist is quite telling. \n\nWe must wait for proof that it does exist. Until then, it’s simply a concept. \n\nThe fact your default is denial means you lack the ability to use scientific reasoning skills here. \n\nI intend to allow my mind to be made up of actual observable facts. Among those facts is the absolute truth that many ancient civilizations have similar flood myths.  All of this in an era when modern modes of transportation and communication supposedly did not exist. \n\nThe only thing i *believe* in here is this. Unlike you; I believe i will keep my options open for new discoveries.", "label": 1}
{"text": "Does anyone question that this \"Report\" was prepared by PCI, which receives hundreds of millions from NASA?\n\nNothing like unbiased and objective \"reporting.\"", "label": 1}
{"text": "One could argue that hubris is also a form of stupidity, while a space fan myself, (probably not as much as most people on this sub, I have ksp and i've played many space games including eve for over 10 years so the interest is there for me i'm not some sort of avid hater) the idea of getting most people invested in space when they'll 1) never go there 2) never interact with it 3) never see any personal gains from it. It's not hard to see why people would rather billions spent on things that will actually have an impact on their lives down here on the surface. Where most people will likely be, for the next 1000s of years. Or more. I'm all for space exploration, but there is a large part of me that questions the practicality of it, and whether it's driven by practicality or just general unquenchable curiosity.", "label": 1}
{"text": "He endorsed Trump. \n\nSo probably a ton of reddit hate posts are next", "label": 1}
{"text": "Okay well, he’s currently publicly commenting a felony by trying to pay people to vote for a candidate so yeah, I don’t think felons should be in charge of multi-billion dollar publicly funded government programs. Also treats his employees like shit.\n\nDespite common misperceptions , we’re not soul-bound to one company just because we have history with them. Sometimes you have to sever ties.", "label": 1}
{"text": "Technically if he is actually successfully sued, it will be for paying people to register to vote. Nothing about the payments required winners to vote one way or another. It's legal to pay people to sign a petition, tbh the initial articles I read quoted a campaign finance attorney who said it was a legal play. Courts will decide, I don't really care either way. \n\nI get you're out of your element here and just don't like Musk. Fine. Just don't pretend you know anything about the space industry, it's clear you don't.", "label": 1}
{"text": "Who’s campaign, Trump’s? Probably not the right guy to ask if helping them out is a fair play from a guy charged with 91 felony counts and a legally defined sex offender. \nIf you don’t think dt & Elon are frauds and not to be trusted then I definitely wouldn’t trust your opinion on anything you don’t have accredited validation on. \nI suppose I probably shouldn’t be Stan’ing NASA ether considering operation paperclip but that’s whole another topic. I just don’t want Fascists running our government. Sorry if that’s controversial to you.", "label": 1}
{"text": "Next they’re going to claim Pluto isn’t really a planet.  *Bah humbug*", "label": 1}
{"text": "It’s not a matter of I don’t like the ceo but that the ceo is actually a nazi.", "label": 1}
{"text": "Wait until you hear about who works at NASA", "label": 1}
{"text": "Assuming we can see through the hordes of satellites by then, you mean? ", "label": 1}
{"text": "Sure thing, kiddo. Il keep that in mind.", "label": 1}
{"text": "If we have trouble seeing bc of satellites, at least everyone will have wifi", "label": 1}
{"text": "True but then maybe all our space resources go to the mining instead because nobody wants to miss out on the profit. Basically greed.", "label": 1}
{"text": "The outcome is not a novel idea. There have been reports like this about NASA going back decades.", "label": 1}
{"text": "This whole thing was fake as hell, clearly AI slop meant to distract.  BTW, space programs are just a nice way of saying \"we are building weapons with the full intent on taking over the world\"", "label": 1}
{"text": "Don't worry I'm sure NASA will be made \"more efficient\" by Trump's Government Efficiency Department with Elon calling the shots. \n\n(God help us all)", "label": 1}
{"text": "> but thank goodness we kept gas prices down\n\nLOL  Please don't let reality have any effect on your political beliefs masquerading as science.", "label": 1}
{"text": "Yeah, that’s totally wrong. They just prioritized quarterly earnings over core capabilities and product performance for too long. I don’t think the shareholders and business drones cashing those checks would qualify on anyone’s list as “woke”.", "label": 1}
{"text": "I’m not saying it was aliens, but it was aliens.", "label": 1}
{"text": "they are trying to hold us back from exploring the system.", "label": 1}
{"text": "Yes, but it *should* be a Comet Disintegrinator Ray-inator! The -inator has to come all the way at the end. \n\n(Yes, I did misread the original comment and this is me trying to cover for it)", "label": 1}
{"text": "Touché. Doof does have his specific ways.", "label": 1}
{"text": "Green or gray?", "label": 1}
{"text": "Whats your plan? Post that", "label": 1}
{"text": "Pfft. So you're one of THOSE kind. I don't see color.", "label": 1}
{"text": "\"Holding information back\" is not the same as \"keeping it a secret\" tho. It's a sign of poor literacy if one thinks so.", "label": 1}
{"text": "lots of space weapons here soon", "label": 1}
{"text": "So you're an \"all aliens matter\" kind of person?", "label": 1}
{"text": "Oh neat, okay: treaties tired to military expansion. \n\n\"Leave the following orbits clear of constellations or they will be shot down by mutual agreement.\"", "label": 1}
{"text": "Yeah it doesn't work like that at all. China will just shoot down the west's satellites", "label": 1}
{"text": "They'll stop crying when SpaceX can put tonnage up AND link to Starlink to pull data from their sats.", "label": 1}
{"text": "Yup. On-the-ground radio satellites will be blown out of the water by ones based in space/on the Moon, even if they're significantly smaller. SpaceX (as well as other launch providers) are rapidly reducing cost/kg to orbit, which will eventually tip the scales and make ground-based astronomy totally obsolete.", "label": 1}
{"text": "Are they gonna drop a stage full of hypergolic propellant on a rural village of innocent people?", "label": 1}
{"text": "Because in reality China would carry on regardless, so all it would do is potentially limit the West competing.", "label": 1}
{"text": "If you think that's realistic, you need to go read up on history and politics.\n\n\nThe fact is that no one is willing to start a space war over ground-based astronomy. It's so far down the list of concerns that it's not even on the table.", "label": 1}
{"text": "Yep... You're breaking the law, but we're not,. So we might as well", "label": 1}
{"text": "Just a falling comet? Or is it something more?", "label": 1}
{"text": "Aside from taxation, this is one of the reasons Musk is getting all pally-wally with Trump. Who cares what researchers urge?", "label": 1}
{"text": "The problem is starlink interfering with ground based radio astronomy, not science satellites. The new gen starlink emits 32x more interference than the previous one. This is a problem.", "label": 1}
{"text": "I work at a ground based radio telescope and there is benefit to space-based radio telescopes, just less so than others. The atmosphere is mostly transparent to radio, but high atmospheric humidity can make it harder to get good data. Not to mention that conventional weather issues - rain, wind, and snow - can impact observing.", "label": 1}
{"text": "Comet Destructionator might have gone over better.", "label": 1}
{"text": "You can't \"shoot down\" satellites. All you can do is turn them into lots of little pieces still in orbit. Doing so hurts everyone that uses orbit for anything.", "label": 1}
{"text": "Have you considered that much of the cost doesn’t come from launch? Designing and building it is the hard part.\n\nAnd we certainly don’t have the capability to create the same size/accurate interferometers in space as we do on earth\n\nBut sure just disregard the opinions who have spent years in their field, they don’t know anything 👍\n\nFWIW every astronomer would love massive telescopes in space, it’s just not feasible (yet)", "label": 1}
{"text": "A Disinte**gratin**ator makes me think that the remains will be tender, lightly browned, and oh so cheesy.", "label": 1}
{"text": "Yes I have and before. Rocket launch is high hundreds of millions of not billions.\n\nYes we do, you're telling me James Webb isn't better than anything we have on earth ?\n\nAnd yes it is feasible, starship can carry 200 tons of payload significantly and at significantly cheaper than ever before.\n\nYou carry on acting like people don't just moan about everything when their careers are on the line.", "label": 1}
{"text": "Why are there so many toxic anti-Earth Musk cocksucking potentially bot comments in this sub now man", "label": 1}
{"text": "Ask those ground based astronomer if they'd rather have a small sat with 2/47 connection at an Lagrange point or just anywhere outside the atmosphere. You missed the entire point of my first comment, just to paste a wiki link.. k.", "label": 1}
{"text": "I'm sorry, they would say no, because it is simply not possible to receive the faint 80-200mhz signals VLBI listens for with a satellite. You need physical separation (very longbaseline) and huge collecting area", "label": 1}
{"text": ">simply not possible\n\nYe of little imagination, an array of small cube sats seems like the perfect solution.\n\nThey can manage to listen to it within the noise envelope of Earth's atmosphere but suddenly wont be able to in space?", "label": 1}
{"text": "> They're doing a much better job of combatting climate change than the US and it's not even close. \n\nYeah, [absolutely not](https://www.carbonbrief.org/china-responsible-for-95-of-new-coal-power-construction-in-2023-report-says/).", "label": 1}
{"text": "Google what makes up the event horizon telescope, which is the telescope network that took the black hole pictures. You think they have the budget to replicate that in space?", "label": 1}
{"text": "Do some research? I am active in this field my friend.\n\nCongrats you have named a telescope type that is much more suited to space.\n\nNow name me an optical/microwave space-based telescope that outcompetes anything on the ground?\n\nBetter yet, name me a radio telescope in space?\n\nThe capability is not there yet both from cost and technology standpoints. \n\nGo do some research yourself and stop acting like this", "label": 1}
{"text": "How has no one picked up that he is unhinged and thinks he's fucking special? \n\nWhat is the obsession with this lunatic?", "label": 1}
{"text": "Not till SpaceX helps pioneer the way and reduces costs.", "label": 1}
{"text": "Some of these proposed LEO constellations involve the use of satellites that are each quite large, in terms of surface and volume.\n\nDo you think it would be practical to use the space-facing sides of these satellites to mount antennas for the purpose of radio astronomy?  The idea would be to create a massive array.", "label": 1}
{"text": "Network of thousands of huge antennas = barely within the budget\n\nNetwork of those huge antennas on thousands of satellites plus ground downlink infrastructure = somehow not hugely over budget?\n\nHow much lower spacex can get launch costs is totally irrelevant", "label": 1}
{"text": "\"China's going to dump toxic sludge in the ocean so why should we hamstring ourselves by regulating our industries to behave responsibly\" is not a compelling rebuttal, though.", "label": 1}
{"text": "And you don't think Musk would do the same? Especially if his guy wins?", "label": 1}
{"text": "is the 32x claim from AT and verizon who are throwing everything they can into the mix trying to keep their regulatory capture over cell service?\n\nhttps://www.teslarati.com/spacex-starlink-att-verizon/", "label": 1}
{"text": "This is a false dilemma . We can have starlink and radio astronomy. The radio interference the new starlink generation emits (32x more than their predecessors)  is not a fundemental part of it's operation; thus this is a fixable problem, if SpaceX wants to fix it.", "label": 1}
{"text": "No https://phys.org/news/2024-09-gen-starlink-satellites-leak-radio.html", "label": 1}
{"text": "Disintegrinatorinator is so much more Doof tho", "label": 1}
{"text": "> How did we solve the problem with streetlights again? Where it interfered with a small number of astronomers but massively improved the quality of life of everyone else?\n\nWe designed less lifght-polluting streetlights. https://www.archdaily.com/977131/how-to-reduce-light-pollution-with-street-light-design", "label": 1}
{"text": "Yeah, a better analogy is \"China is already dumping sewage in that river, so even if we stop others from dumping sewage in it, you probably should find another source of drinking water\"", "label": 1}
{"text": "Did I capitalize it? No i didn’t", "label": 1}
{"text": "Actually it's directly relevant to that. With him being appointed to a seat in the cabinet, and with SpaceX getting government subsidiaries, it looks pretty obvious that he probably won't care what experts say. Politics don't need to be involved everywhere, but when he directly injects himself into it, it makes things appear differently.", "label": 1}
{"text": "Name checks out. \n\nThe book written about Ninja lantern fighting sharks is amazing. I am looking forward to the laser version that is coming, and the budget sea bass options..", "label": 1}
{"text": "After nearly a century, but in no way did we slow down the rollout to solve the problem first.", "label": 1}
{"text": "There is genuinely no fucking way you're a real person. If you are, I pity you, and hope you receive psychiatric help soon.", "label": 1}
{"text": "So long as it doesn't slow the rollout down at all (including ever increasing capabilities and capacity) sure, but the harsh reality is its several orders of magnitudes down the list for worth solving.  \n\nI get this is THE sub to view this highly, and I value astronomy highly too\n\nBut even if it was an unreal and hyperexagerated choice between losing all radio astronomy capabilities or even one child being cut off from education who didn't have to be I'd choose the former.", "label": 1}
{"text": "It’s extremely relevant. What the hell are you talking about.", "label": 1}
{"text": "Musk is already doing this under the current administration. There’s no reason to think anything will change for SpaceX just because the president changes. SpaceX also doesn’t get subsidies from the government, they get payments for contracts they’ve performed. It’s an important difference.", "label": 1}
{"text": "These people think that SpaceX is going to solve everything related to the problems they are creating themselves. If it costs extra money, I'm pretty sure they will not do it (regarding the fixing of the radio leakage on starlink)", "label": 1}
{"text": "Sure, thanks for at least being reasonable. It just sucks to see people not read the articles and assume *the fundamental operating principle* of starlink is the problem, when it's not, and it's in fact a very fixable problem.", "label": 1}
{"text": "The guy who's successfully launching payloads into orbit and landing rockets repeatedly is \"Probably not going to pay attention to what experts say,\" huh?\n\nI mean part of your flawed argument here is going to be that he ONLY relied on other people for SpaceX success which means he's spent the entire time \"listening to experts.\"\n\nThis is entirely political.", "label": 1}
{"text": "I'm afraid you're right, but let's hope not.", "label": 1}
{"text": "Yeah, I hope so that I'm wrong. Radio Astronomy like the EHT has brought a ton of new discoveries, and I don't want it to be ruined in the near future.", "label": 1}
{"text": "Ok then, what exactly do you think he's going to do? Relate how what they said is relevant here.", "label": 1}
{"text": "It’s an honest question. If you need it explained to you, that’s all I need to know. If you haven’t heard of project 2025, I can’t help you. We’re a week from election. Are you serious?", "label": 1}
{"text": "You'll burn the planet down trying to compete with China, won't you", "label": 1}
{"text": "Very true, and people don't lnow about it at all. I bet a non-zero number of people in here think JWST took the black hole pictures.", "label": 1}
{"text": "Yeah, and the people that think that you can put this sort of thing in space ignore the fact that the fastest way to transport the data in the arrays was by physically moving the hard drives around.", "label": 1}
{"text": "This is exactly what I meant. You can't even manage a defense of it outside of politics. You have NOTHING but political reasoning for it.\n\nYou too are just grinding your own personal political axe and you want other less intelligent people to join you.", "label": 1}
{"text": "That ruins the joke there Sport.", "label": 1}
{"text": "Valid point regarding the service module. I was concerned about protecting the heatshield on the ground, additional shielding might help prevent such damage. \n\nThe level of damage shown in the photos indicates one or more of the following:\n\n1. Physical damaged before launch\n\n2. Poor fitment of heatshield tiles.\n\n3. Poor design, in shaping the tiles failed to account for the plasma laminar flow in certain areas.\n\nAny ground-based protection even the thinnest sheets of titanium would hopefully might protect, and/or show NASA where/when potential damage has occurred prior to launch \n\nAfterall this is NASA we're talking about here. the same NASA that didn't help Columbia's final crew.", "label": 1}
{"text": "I read that as \"disentangled\" for the kast 5 minuets and this has been a hell of a read.", "label": 1}
{"text": "Great, I havent see China's yet. I've randomly caught Starlinks on multiple occasions without trying. \n\nStarlink can be stopped by my own government taking action now. Then my government can pressure other countries like China to stop. But until we put a stop to our own pollution of the skies we dont have a leg to stand on to complain about others doing it too.", "label": 1}
{"text": "Nah, this is just doomerism. International rules are very hard to establish, but there's still plenty that exist now and apply widely. Hell the US and the USSR managed to agree on nuclear deals back when they both wanted to turn each other into glass.", "label": 1}
{"text": "They made a deliberate decision not to inform the crew that they didn't expect them to survive re-entry, or provide an alternative survival strategy.\n\nSo, I think the Jerks work for NASA, and you're just an arrogant POS.", "label": 1}
{"text": "Relax the rocket had expended half its fuel before it exploded in the village so only a few people were murdered by the government", "label": 1}
{"text": "Trump literally mentioned musk building a massive space missile system at a recent rally. And Musk is extremely vocal in support of Trump. So it’s completely appropriate.", "label": 1}
{"text": "What harmful things? Don't speak in platitudes, name specific items otherwise you're just another political hack come to sharpen his axe.\n\n It crystal clear to me that every conflict and natural disaster zone on the planet has benefitted from what you're now calling \"harmful.\"\n\nSo let's hear what you think is harmful now.", "label": 1}
{"text": "may I suggest that you avoid space travel?", "label": 1}
{"text": "what a slap in the face to the people who invented the technology that \"wasn't there\" back then", "label": 1}
{"text": "If I had a nickel for every comet I was supposed to see this month, I'd have 2 nickels.", "label": 1}
{"text": "I’m addressing your point of “the guy launching rockets probably won’t listen to experts” joke. \n\n“Ha, Boeing, the company that builds thousands of jets used around the world probably won’t listen to experts” sounds ridiculous right? We’ve seen the effects of greed and lobbying from successful companies. Nothing is inherently special about SpaceX that makes them somehow more ethically pure.", "label": 1}
{"text": "According to the Heritage Foundation, he’s working on space weapons and Trump will allow him to do it. \n\n https://youtube.com/shorts/79e8Y2Mgq-0?si=oIXwbcSVEF-CvOfJ\n\nWonder why he’s MAGA?… 🤔", "label": 1}
{"text": "Fuck Russia , and fuck them. Also, fuck Putin the coco gobbler.", "label": 1}
{"text": "Cock sucker , it’s not that hard Reddit bot.", "label": 1}
{"text": "Don't normalize that terrorist state.\nFuck Russia.", "label": 1}
{"text": "It may be the spike in russian souls becoming sunflower.", "label": 1}
{"text": "As much as I hate Russia now, this shit is about scinece. Shut it.", "label": 1}
{"text": "Science should have no borders", "label": 1}
{"text": "Do you hate the US? they done worse and continue to do so", "label": 1}
{"text": "I wouldn’t say he is laying with Nazi’s.  Buzz said he likes how the space program was expanded under Trump and that’s why he is leaning that way.  Hopefully that doesn’t sway you away from a great American that inspired millions of us to reach for the stars.", "label": 1}
{"text": "Endorsing Trump is enough to sway me away from anyone.", "label": 1}
{"text": "Or….OR….hes choosing to align with evil people with malicious intent, space program expansion or not. Stop making excuses for these *former* heroes. \nHe is choosing to stain his own legacy.", "label": 1}
{"text": "You people are fuckin unbelievable.", "label": 1}
{"text": "Stop pretending like supporting Trump is even a normal political opinion when half his and cronies platform is based around taking rights away from people.", "label": 1}
{"text": "It is unbelievable that people have integrity and uncrossable lines?", "label": 1}
{"text": "I'm not American and I'm very interested why do you all so much hate Trump. Can someone explain?", "label": 1}
{"text": "Says more about yourself than it does him honestly.  Redditors getting unhinged when someone doesn't support their politics needs to be studied.", "label": 1}
{"text": "If you don't understand already, that's on you.", "label": 1}
{"text": "Not american here.\n\n\nI hope he doesn't get elected again because he will stop the US support for Ukraine.\n\n\nSome of the others here, especially those throwing around the word fascist, are probably just because he isn't wearing their team colours.", "label": 1}
{"text": "He's still a hero and you're still a loser.", "label": 1}
{"text": "I’m not to into politics nor do I like trump or Kamala  but to think people lose there shit over someone supporting a Candidate other than the one they want is fucking insane lmao", "label": 1}
{"text": "The space program has always been militarized.  It started for military purposes and it’s always been that way.", "label": 1}
{"text": "I'm not american nor do I \"like\" trump, but it is hilarious to see that no matter where in reddit I go people's heads will explode at the mere mention of him", "label": 1}
{"text": "I just lost a lot of respect for Buzz Aldrin. And it hurts.\n\nTrump has *none* of the traits he says the President needs. None of them. But Buzz is endorsing him because he created a military branch that is basically what we already had as a civilian organization in NASA.\n\nDamn it hurts to see your heros fall like this.", "label": 1}
{"text": "Over the past 8 years the media and the left has given people a schizophrenic obsession with and aversion of Trump. On Reddit it’s really bad how delusional a lot of these people are.", "label": 1}
{"text": "Russian troll. See his post history. \n\ntag /r/codebender", "label": 1}
{"text": "It is good that people have strong reactions to trump, serious things should be treated seriously.", "label": 1}
{"text": "All your comments demeaning him for having his own well laid out political opinion is the epitome of Un-American. The founding fathers disagreed with each other passionately, yet were able to come together for the common good. This is what America is. Different opinions from different people. If you don’t like it get over it and grow up it’s what the USA is about. This man is a legend regardless of your input on his political views.", "label": 1}
{"text": "Americans really need to learn the difference between patriotism and jingoism. Trump supporters are not patriotic, if they were then they wouldn't be flying the Confederate flag so often.", "label": 1}
{"text": "But have you considered that orange man bad?", "label": 1}
{"text": "The Republic itself is at stake. Women's rights are being rolled back. There is talk of mass deportations and dictatorship from Trump himself.", "label": 1}
{"text": "The growing American fascist movement or the \"centrists\" who support it?", "label": 1}
{"text": "Well, without the nazis, he would've never got to the moon. \n\nKinda /s, but not really. Fuck Trump and Buzz.", "label": 1}
{"text": "Oh man. I love Buzz and respect him for what he did for our country during the space race; but I guess older age and nepotism go together. He lists all the things a quality leader is and Trump is the opposite of all of them. It seems Buzz’s only true motive for this endorsement is the space program. Which I understand is very important, but he list’s other things like air space over Korea, and the contested space front. None having to do with American’s day-to-day lives, as Buzz points out the president will influence. \n\nKamal is a leader with all the traits he listed. And let be honest. Whether a D or R is in the White House, national defense is always top priority.", "label": 1}
{"text": "Damnit!  Ivan got me again.", "label": 1}
{"text": "Serious question: would you say the same thing if the politician in question was a German politician saying that Germans need more “living room”?\n\nIs it wrong of me to be critical of Charles Lindbergh for, and even saddened by, his support of Hitler?", "label": 1}
{"text": "More Ad Hitlerums.  This is the same shit that gets said every 4 years by Democrats is comparing their opponents to Hitler.  You guys need to get a new story as this shit only appeals to other Democrats.", "label": 1}
{"text": "Aldrin is a 94-year-old, thrice-divorced white man who has been a life-long Republican booster. This would be the least-surprising endorsement by an astronaut for Trump but for the existence of Harrison Schmitt. It is a great reminder that being a talented operator in any field does not make you smart in any other subject matter, and certainly doesn't make you a good person. We *have* to get past letting fascists be the face of America's space program. It's bad news.\n\nAlso, very interested how long it takes the mods to enforce their \"no politics\" schtick this time!", "label": 1}
{"text": "Considering the threat posed by climate change, it’s a discussion worth having", "label": 1}
{"text": "no problem man .................................................................", "label": 1}
{"text": "How am I a fascist?  If you don't want to be called a retard, don't act like a retard.  Retard.", "label": 1}
{"text": "Given the consequences of catastrophic failure and the insane failure rate of private corps, yes, I believe space should be left to governments, not individuals, and certainly not people who are only relevant because they have capital.", "label": 1}
{"text": "What authoritarian, anti-freedom drivel. We should ban private transportation, flying, and the consumption of meat by the plebeians in the name of the climate too, right? Because those are many tens of thousands of times worse for the environment than rockets.", "label": 1}
{"text": "Yeah probably. Also should have global control of our energy production and grid, so we’re not a) squabbling for resources and b) we can once and for all end fossil fuels powering our grid. We had our chance to do this in a more natural way, but instead we chose profits and trickle down economics over common sense and planetary health", "label": 1}
{"text": "Yeah.... Im sure the 94 year old is so up to date on current events he was able to write such a perfectly worded press release and understands every minute detail of the presidential race. There's absolutley no concern what so ever that this 94 year old was manipulated by friends and/or family to do this.", "label": 1}
{"text": "Or he is fricken 94 years old and obviously manipulated into doing this by the people around him", "label": 1}
{"text": "Hes 94 years old, you really think he did this totally on his own and wasnt manipulated by those around him to publicly support trump", "label": 1}
{"text": "Well, it's a good thing you're not in charge of anything important, because you definitely seem like the type of person who's okay with making everyone miserable as long as they're equally miserable, instead of looking for actual solutions to the problems we have today. Invest in clean (nuclear) energy? Nope, just genocide the cows and outlaw private industry.", "label": 1}
{"text": "The government has a worse track record than most private corporations. So you're of the opinion that we have to stifle progress and innovation because the government should have a monopoly on said catastrophic failures?", "label": 1}
{"text": "You really believe that the government doesn't hide anything? Talk about naive...", "label": 1}
{"text": "I believe I had a clean energy policy in there, getting rid of fossil fuels. Nuclear plays a very key role in that, and a valuable technology that we’ve squandered way too long\n\nBut your way, continuing business as usual, consequences be damned, ends with a LOT more suffering than tightening our belts", "label": 1}
{"text": "Nice strawman, as if I'm advocating for \"business as usual\". I'm just surprised to see a bunch of space luddites on r/space of all places... But then again, this *is* Reddit", "label": 1}
{"text": "He's a former Republican Senator, a climate-change denier and has been on Alex Jones' show. Just saying that I feel like I could peg who he's voted for for the last 24 years faster than any other living astronaut.", "label": 1}
{"text": "Somebody shit in your cornflakes Musk fanboy?", "label": 1}
{"text": "Not what I said. But yes, I do believe governments are, on balance, more accountable to the people than private corporations. That's the whole point. Low-information indeed.", "label": 1}
{"text": "Yeah, you kinda implied it. You argue that governments are legally required to report on failures as if they don't *regularly* break the law and hide the evidence", "label": 1}
{"text": "Are you familiar with Godwin’s Law? Are you familiar with what Godwin himself has said with respect to its application to Trump?\n\nhttps://www.washingtonpost.com/opinions/2023/12/20/godwins-law-trump-hitler-comparisons/", "label": 1}
{"text": "You have spent way too much in this massive agenda driven echo chamber if you genuinely believe this. Touch some grass will you?", "label": 1}
{"text": "Since the inception of NASA and other space agencies, we as the public have **never** received a video of our earth in it's entire field of view rotating (above 2 frames an hour).\n\nFor example, DSCOVR: Correct me if i'm wrong, but while DSCOVR was heading to the L1 Lagrange Point, it could have taken a video.\n\nDSCOVR's data transmission costs are not public information, but cost estimates for standard satellite data transmission are on the high end at $10 per MB(probably low here). For a 24 hour high definition video of earth. The size of the video would be approx 54,000MB. DSCOVR'S bandwidth is 0.625 MBps. This would take approximately 15 hours to transmit back to earth and cost approx $540,000 along with a high quality camera. Considering DSCOVRs mission cost 340million, I don't think the data transmission costs or bandwidth limitations would be an issue.\n\nFor the people saying, oh it'll just be boring, it's not worth it etc. You can **increase** playback speed of a video. It would be the most amazing thing. Yet it has not been done.\n\nWhy?", "label": 1}
{"text": "And you're a brainwashed 20 year old that gets his opinion from the single biggest and most agenda driven echo chamber on the entire internet, which I stated earlier. No, you can't state anybody you don't like is a \"fascist\" or \"nazi\" or whatever. You completely lack any agency of your own, and think you can accuse freakin Buzz Aldrin off being unitilligent?", "label": 1}
{"text": "And you're a 20 year old that gets his opinion from the single biggest and most agenda driven echo chamber on the entire internet, like I stated earlier. No, you can't state anybody you don't like is a \"fascist\" or \"nazi\" or whatever. You completely lack any agency of your own, and think you can accuse freakin Buzz Aldrin off being unintelligent?\n\nStop acting like a political zombie christ. Trump winning isn't the end of the world. He was already president for 4 years and nothing extraordinary happened. You're buying too much into political propaganda.", "label": 1}
{"text": "It would have been less upsetting if he had died.", "label": 1}
{"text": "Not the sub for this stuff", "label": 1}
{"text": "Space launches are highly regulated and private entities in it have been proven to be far more reliable. Falcon 9 is the single most reliable rocket ever and it was built by SpaceX. If anything private entities have higher standards put on them compared to the government in the space sector because of all the regulations around it. For example SpaceX was required to have the risk of loss of crew during a launch be 1 in 273 for them to be allowed to send astronauts into space with the dragon capsule. Meanwhile the government funded and developed SLS rocket could ignore these requirements and only have a 1 in 90 risk instead as they don't need to adhere to the same requirements as private entities need using the same risk assessments.", "label": 1}
{"text": "But the Maga Qs believe the moon landing was staged", "label": 1}
{"text": "What are you referencing when you say this? I voted for Trump, and this would definitely make me feel better about it lol", "label": 1}
{"text": "Ah, you overplayed your hand, Ivan.", "label": 1}
{"text": "Yeah - it says they’re not a fascist.", "label": 1}
{"text": "You fell for fake news:\n\nhttps://www.politifact.com/factchecks/2020/jul/11/joe-biden/no-trump-didnt-tell-americans-infected-coronavirus/", "label": 1}
{"text": ">“**And then I see the disinfectant**, where it knocks it out in one minute. And **is there a way we can do something like that, by injection inside or almost a cleaning, because you see it gets in the lungs and it does a tremendous number on the lungs**, so it’d be interesting to check that, so that you’re going to have to use medical doctors with, but it sounds interesting to me. So, we’ll see, but the whole concept of the light, the way it kills it in one minute. That’s pretty powerful.”\n\nSorry mate, it was literally on live TV. You'll notice the post you responded to didn't say anything about **drinking** bleach. He said to inject it. On live TV, plenty of recordings around if you would like to inform yourself.", "label": 1}
{"text": "Here is a direct quote, taken from the transcript on C-SPAN:\n\n\"AND THEN I SEE THE DISINFECTANT, AND IS THERE A WAY WE CAN DO SOMETHING LIKE THAT. BY INJECTION INSIDE.\"\n\nhttps://www.c-span.org/video/cc/?progid=545222\n\nTaken from the same source politifact used to deny it...", "label": 1}
{"text": "Time to die, old white man\n\n(no matter your accomplishments)", "label": 1}
{"text": ">Biden said Trump said drinking bleach could help fight the coronavirus. Trump did not specifically recommend ingesting disinfectants, but he did express interest in exploring whether disinfectants could be applied to the site of a coronavirus infection inside the body, such as the lungs. We rate Biden’s claim Mostly False.\n\nI know it can be hard to accept that you were fooled, but even poltifact admits it.", "label": 1}
{"text": "doesnt your quote prove his point?", "label": 1}
{"text": ">Biden said Trump said drinking bleach could help fight the coronavirus. Trump did not specifically recommend ingesting disinfectants, but he did express interest in exploring whether disinfectants could be applied to the site of a coronavirus infection inside the body, such as the lungs. We rate Biden’s claim Mostly False.\n\nPlease read the article before posting a response.", "label": 1}
{"text": "No, he didn't. This has been debunked numerous times by numerous sources. Do better.", "label": 1}
{"text": "Notice how nobody in this thread is talking about what Biden said? They’re talking about what Trump said. Show me the politifact entry for that 😂\n\nOr keep arguing in bad faith, whatever floats your boat dude.", "label": 1}
{"text": "This is what op falsely claimed:\n\n>He also told people to inject themselves with bleach.\n\nThis is disproven by the politifact link I posted. But some people are so biased they can't see the truth even when it's staring them in the face!", "label": 1}
{"text": "I didn't need to read the article as I had watched the video originally when it aired. I looked for the transcript to find the part I knew that had already existed. \n\nYes he did not tell you to go out and drink bleach. At the same time he did recommend looking into putting ultraviolet light and disinfectants into your body.\n\nIt isn't such a controversial quote because people will take it literally and inject disinfectant or drink bleach but because it really gives you a measure of his understanding of the human anatomy.", "label": 1}
{"text": "Probably don't even see the irony in that statement.", "label": 1}
{"text": "I'm curious why you would think that my statement was ironic after I corrected some misinformation. \n\nPerhaps it's you that lacks self awareness?", "label": 1}
{"text": "It might sound clever to you but it is childish to other people.", "label": 1}
{"text": "Shame. Old and white. I guess that will do it.", "label": 1}
{"text": "This ignores one big part about Putin and his war on Ukraine. He does not simply want Ukraine, he wants to take over the territories that used to be a part of the Soviet Union. He would continue on to war other countries like Estonia, or Georgia if allowed. If he was allowed to take Ukraine, Putin would just keep asking for more and more until there was some other defined crossing point. It is all well and good to speak against war and the military industrial complex and wish for not sending our own military to another country's conflicts but for the world we live in now, it is important for the United States military to exist and to engage in the conflicts of other nations. The economy that we live in today is interconnected worldwide with small changes that can create ripples throughout it. The USA's military and NATO is one of the many reasons we can enjoy the relative peace that we have today keeping certain nations in check that would otherwise be at each other's throats. When Trump talks about just giving Ukraine to Putin, that solution is not as simple as he makes it out to be and is shortsighted to the bigger stage that is at play.", "label": 1}
{"text": "Who cares? It’s not like they are doing some kind of important research. The sole purpose is political propaganda.", "label": 1}
{"text": "The only use of china's space program is to drive US and others to expand their space exploration efforts.", "label": 1}
{"text": "Absolutely amazing comment.", "label": 1}
{"text": "I had to read that twice to fully digest what you were getting at. Nice.", "label": 1}
{"text": "For those that have gas giant heads....ELI3", "label": 1}
{"text": "It’s a jab at regressive American policy, not specifically talking about space.", "label": 1}
{"text": "It's a political/cultural comment which contributes nothing to the conversation and has nothing to do with space.  \n\nMore election-year political spillover from the rest of Reddit.  Ignore it.", "label": 1}
{"text": "Sorry....Thanks for the response", "label": 1}
{"text": "Sorry....Thanks for the response", "label": 1}
{"text": "What's funny is I've been in China a couple times, and felt that socially it was similar to the 50s in the US.  Everyone smoked (including literally in front of no smoking signs), misogyny abound, and it seemed generally people dressed up for the most mundane occasions.  China has basically been in an industrial revolution that's comparable to mid-20th century US.  \n\nIt's obviously not a perfect comparison, but I think China beat us by getting back to the 50s sooner.", "label": 1}
{"text": "Yeah stealing ideas is awful, way better to smuggle a bunch of Nazis into your country instead.", "label": 1}
{"text": "I swear, none of the other posts on this subreddit make it to my frontpage, but as soon as the post is about china it is at the top of my frontpage for hours.", "label": 1}
{"text": "When I’m in a hating the history of spaceflight competition and my opponent is an r/space user", "label": 1}
{"text": "If only they stole some nazis too", "label": 1}
{"text": "Maybe they can bring back some real moon rocks too. [All of the ones we brought back turned out to be fake](https://www.nbcnews.com/id/wbna32581790)", "label": 1}
{"text": "The way things stand the future of human activity in space is sizing up into two big blocks, the Artemis Acccords block of Western and allied nation - US, Canada, EU, Japan, South Korea, Australia, NZ, most of Latin America, KSA, UAE, Israel and a few others.\n\nThere's the Chinese-led \"International\" block of them, Russia, Belarus, Kazakhstan, Venezuela, Egypt, South Africa and few others.\n\nThen there's India who are Artemis signatories but with an independent space programme, and as India always does will probably play both sides to their max benefit. I imagine there will be many more nations interacting with both sides too.\n\nIt's pretty clear that the international block is heavily China dominated while Russia will probably continue doing tech transfers to allow participation until that train dries up, the rest are hardly worth mentionning as far as space activities go. Of course within Artemis US is the heavy player and many are just titular signatories, but no one scoffs at ESA and JAXA.", "label": 1}
{"text": "Rocket Lab offers end-to-end mission where the focus is on the many difficult skills needed on the planetary craft.\n\n\nRocket Lab leads in ultra light weight rocketry both in composite structures and precision rocket motor fuel consumption as well as precise and reactive planetary craft control accuracy and robotics, all leading to a feasibly light weight end to end mission.\n\n\nRocket Lab also leads in planetary-mission hardened spacecraft components, starting from world leading solar panels, all needed for a glitch-free years-long stay outside the radiation-shielding Van Allen belt.\n\n\nRocket lab has a very impressive track record of cost-efficient in-budget, on-schedule de-risking deep space and other missions, such as moon CAPSTONE, Mars ESCAPADE, Venus Life Finder, Blue Ghost propulsive moon lander with Firefly, Victus Haze precision redezvous, Varda sample return, and more.\n\n\nNeutron is essential in emsuring cost and schedule success as ESCAPADE proved where they first were supposed to launch on Falcon Heavy, scrubbed, now New Glenn, delayed, you see the pattern.", "label": 1}
{"text": "The US has been seemingly coasting on its 60s/70s lunar missions, assuming it won the race, and not realising that it barely passed the first corner. \n\nThe political and egotistical hamstringing of how legacy space works in the US has also been straight up slapped in the face by private industry, opening up a lot of people’s eyes to a monumentally inefficient and bloated bureaucracy. \n\nSLS is a cathedral to this Hubris, built from 25 year old spare parts destined to be dumped in the bottom of the ocean at a cost of 2 billion dollars a pop.", "label": 1}
{"text": "Oh look, it's a person who frequently posts on the RocketLab stock sub.", "label": 1}
{"text": "Stop doing tricks on it my man", "label": 1}
{"text": "Proud of these guys. Whole world said they couldn't do it, don't even try. They failed so many times, got laughed at and ridiculed, and now look at their achievement.", "label": 1}
{"text": "\"I'm so, so proud of my hostile dictatorship that starves our population and pilfers whatever wealth they have for use in weapons manufacturing\"", "label": 1}
{"text": "NGL it’s definitely impressive, they’ve been cut off from the west and most of the rest of the world for 70 years and they still manage to build a highly advanced piece of military hardware.\n\nI wouldn’t say I’m proud of them though, that’s a little weird.", "label": 1}
{"text": "Traded expendable troops for Russian missile tech is far more likely", "label": 1}
{"text": "I thought you guys couldn’t access the internet in NK? How did you manage to post this?", "label": 1}
{"text": "I'm sure sharing a border with Russia had nothing to do with this. \n\nNK just sent troops to Ukraine out of the goodness of their heart.", "label": 1}
{"text": "And the US didn't import tens of thousands of Nazi scientists that began and advanced their rocket programme?", "label": 1}
{"text": "Strange assumption you're making", "label": 1}
{"text": "Everyone who even remotely has a differing opinion than me is a Russian bot.\n\n-you", "label": 1}
{"text": "I’m pretty certain he’d have been fine with it if they were going to endorse Harris.", "label": 1}
{"text": "more propaganda for the easilty fooled western minds.", "label": 1}
{"text": "It's a place where normal space enthusiasts can meet employees of foreign intelligence agencies, marketing agency workers, cult members, stock pushers, and moon landing deniers.", "label": 1}
{"text": "How is it not related? We’re talking about states possibly sharing missile technology.\n\nThey pointed out the hypocrisy that America did the same thing, arguably worse since they were literal nazis.", "label": 1}
{"text": "If you see an article showing the results of an exchange of troops for missile tech between hostile nations and your reaction is ‘US bad,’ then you’re clearly not acting in good faith to begin with", "label": 1}
{"text": "This day and age, if you don't demonstrate to the American government that your crazy enough to use nukes or attack it directly they will most likely invade or destabilize. Look at the middleeast and Ukraine. They gave up their weapons and lost their standing in the world", "label": 1}
{"text": "Obviously that's not what my comment was about.", "label": 1}
{"text": "The sub contractor pipeline is a huge part of the bloated timelines and budgets. Sub contractors on sub contractors all trying to work to the same standard through half a dozen different industry practices and cultures all driven by baseline company growth. \n\nThe budgets suck, but the money NASA has access to could be so much more effectively used and focussed.", "label": 1}
{"text": "so, the previous test from January that reached, 6400km was designed by whom? Aliens?", "label": 1}
{"text": "the US did fund a puppet regime to overthrow a democratically elected gov in Kiev...", "label": 1}
{"text": "And they improved on the russian design, so now it goes in the air without exploding on the launch pad.", "label": 1}
{"text": "He should get SOMETHING for his loyalty to Trump. /s", "label": 1}
{"text": "Did you just copy paste their company sales pitch? Laughing at the punctuation and effort put into that Reddit comment lol", "label": 1}
{"text": "Nope, didn't do that either.", "label": 1}
{"text": "Don't forget the UFO believers.", "label": 1}
{"text": "that book is truly terrifying. 28 mins…", "label": 1}
{"text": "I wish mods removed such posts, but in the meantime I'll down it's each of OPs comments. I hope you all so the same 😂", "label": 1}
{"text": "this is so dumb. north korea's first orbital launch was 14 years ago.", "label": 1}
{"text": "maybe, but it doesn't seem like LoRa's range would be compatible with this thing. you might be able to fuck around and do something like that but i think it would be mostly experimental at this point", "label": 1}
{"text": "i'm not familiar with shit but my phone and my computer regularly pick up usable signals at -138dBm. right now it's detecting -140dBm", "label": 1}
{"text": "that's not\n\nthat's not what's...\n\nyou know what nevermind i was never here", "label": 1}
{"text": "Then why did the NATOphiles had to overthrow the government in 2014 and kill thousands of people? Why couldn't they just wait for the next round of elections if they had the support of the majority of Ukrainians?", "label": 1}
{"text": "Don’t know if you realize this, but the American people are likely about to re-elect Donald fucking Trump of all people, because to the average person the left is the party that has lost its mind.", "label": 1}
{"text": "Space is one of the few things Trump has done well.", "label": 1}
{"text": "You can trace the lineage of all NKs rockets to their original designers. Spoilers, it's the soviets.", "label": 1}
{"text": "> there's nothing wrong with journalists endorsing a candidate that doesn't want to throw them in jail just for being journalists.\n\nYes, I remember all the journalists Trump threw in jail in his first term.\n\nOh wait.", "label": 1}
{"text": "\"hiring\" hah.\n\n\nYea sure, that's what happened with Paperclip.", "label": 1}
{"text": "I was born in 1981 its completly crazy", "label": 1}
{"text": "Your phone browser has a setting to automatically switch to the mobile version of the site if it's available.\n\nYour PC browser does not, so it will go with whatever is specified by the URL and this one has en.m.wikipedia at the start. Remove that m. and you'll get the desktop version.\n\nhttps://en.wikipedia.org/wiki/Shannon%E2%80%93Hartley_theorem", "label": 1}
{"text": "I'm entirely a layman, so I have no clue what you guys just talked about.", "label": 1}
{"text": "I’m a layman (entirely, not partially). Is this the same as [Lorelei, the 132-meter steep slate rock in Germany](https://en.wikipedia.org/wiki/Lorelei)?", "label": 1}
{"text": "Elon probably gave/sold the tech to China already", "label": 1}
{"text": "What else am I supposed to do?\n\n*Work*???", "label": 1}
{"text": "I’m entirely a layman, but is this in any way related to [Lori Lee](https://en.m.wikipedia.org/wiki/Lori_Lee), the fictional character from Australian soap opera Neighbours?", "label": 1}
{"text": "I'm a layman, but isn't she related to L'Oreal? Because she's worth it.", "label": 1}
{"text": "I'm a layman, is this slate rock called Lorelei related to the woman from Star's Hollow, CT also named [Lorelei ](https://imgur.com/a/C40CtfE)?", "label": 1}
{"text": "“Cosmoleap” reminds me of when Kramer got those crazy [shoes](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJGgMqBajWjw_YdnOU7d4AoI3WiNhEFEn_3w&s).", "label": 1}
{"text": "It must be good go live in a delusional world such as your brain...", "label": 1}
{"text": "I'm as much of a entire layman than the entirety of laymen, but is this related to the biblical figure  [Lord Eli](https://en.wikipedia.org/wiki/Eli_(biblical_figure))?", "label": 1}
{"text": "I really shouldn’t have to install software to unfuck European regulations.", "label": 1}
{"text": "So fucking annoying that even in a science based subreddit, the top voted comment reply to a question is just a dumb fucking joke.", "label": 1}
{"text": "China is powerful, and hostile. These are not good things. Especially if Trump controls america.", "label": 1}
{"text": "Not that I condone that, nor am I very educated on the topic, but I think an invasion by a foreign country, using soldiers, missiles, tanks, planes, etc., is **a liiiitle** bit worse than giving people that are already in the country and 'align with US interests' money/supplies.\n\nTo clarify, I see a major difference between a military invasion by a foreign country, and a foreign country empowering citizens that align with their interests.\n\nAgain, not necessarily condoning the international meddling, but I have a feeling the discussion around Ukraine would be wildly different if Russia funded a rebellion without actually putting boots (and tanks and planes and missiles) on, in, and around Ukrainian soil (and Ukrainian hospitals along with other civilian infrastructure).", "label": 1}
{"text": "You think primitive humanity didn't fight each other?", "label": 1}
{"text": "You believe the 1800s were more peaceful than the last 70 or so years and up to the Biden era?", "label": 1}
{"text": "I thought you are supposed to change it up a bit when you copy homework.", "label": 1}
{"text": "Air force was original. \n\n\nOver 5 words quality shitpost.", "label": 1}
{"text": "How I would like to see exactly why they aren’t worried about working with SpaceX and why they feel confident doing so despite their CEOs “erratic behavior”. There’s been a little bit too much of straight up Neo nazi stuff coming from the Musktrump camp.", "label": 1}
{"text": "It's five layers deep, get over yourself.", "label": 1}
{"text": "Claiming there was a more peaceful period without producing the time period to the year isn't really a strong argument.", "label": 1}
{"text": "A state of affairs that will be completely familiar to anyone who has spent time on the water.", "label": 1}
{"text": "They will be a bit worried & I’m sure they’d prefer not to have to deal with a megalomaniac but the truth is SpaceX are unmistakably brilliant at what they do. More than 80% of global launches to orbit were SpaceX this year. The reusable tech & costs are revolutionary. Starlink is of vital importance. On balance NASA will be thrilled \n\nOnce they master Starship (they are getting quite close) then it’s game over. The alternatives (old space like Boeing) have proven themselves to be failing & mindblowingly expensive.", "label": 1}
{"text": "It's mostly because the Space Force was created by Trump, though I'm sure people will pretend it's something else", "label": 1}
{"text": "Big deal, so have I and you don't see me bragging", "label": 1}
{"text": "If you're going to pretend 50,000 bce is relevant to this conversation, why not just walk away? Just acknowledge you can't refute the idea of modernity's relative peace and walk away", "label": 1}
{"text": "NASA has no right to take into account party politics of any kind. Trump is officially a presidential candidate and no matter how much you want it, no laws are being broken.", "label": 1}
{"text": "Well said and I can’t help to agree. I love Starship and this new era of space exploration, even if it starts off as yet another weapons race.\n\nThough it still would ease my mind to see some hard evidence that Musk (or Trump for that matter) doesn’t have the power to do whatever he wants and on a whim end the global society as we know it.", "label": 1}
{"text": "True, but not very comforting ;)\nAnd I got the impression they had Braun on a short leash. Right now I appreciate NASA for being a slow giant. Sometimes long and tiring bureaucratic procedures might be the best way forward.", "label": 1}
{"text": "Well for starters, there is no air in space!", "label": 1}
{"text": "Don't worry, the internet has ruined us all.  CBT recommended by my therapist made me laugh.  Cognitive Behavioral Therapy wasn't my first thought AT THERAPY.  ", "label": 1}
{"text": "That's why I sympathize with Musk's initiative to save money, despite the obvious conflict of interest, simply because he knows how to organize enterprises economically.", "label": 1}
{"text": "To be fair, Trump is the most mockable president in history.", "label": 1}
{"text": "This is part of Putin's plan to get Trump elected so that the US allows Russia to take all of Ukraine.   \nICBMs, and N. Korean troops on the ground in Ukraine conjures fears of WW3 - American get scared. Trump has recently been stressing how he will not engage in  wars, while also projecting a strong man, protectionist image. Scared people like that.", "label": 1}
{"text": "Timing is a bit suspicious no? Just a few day's before the US election that Putin desperately want's Trump to win?\n\nCrate fear to motivate Trump voters. Electioneering of a global scale.", "label": 1}
{"text": "Definitely true, but I think it turns into a problem when people let their feelings about him (or anyone for that matter) cloud their judgment to the point that they can never view anything he says or does as anything other than mockable or bad", "label": 1}
{"text": "It is very “therapeutic”. \n\nComments must be 25 characters.", "label": 1}
{"text": "Trump offered musk power to obtain more money. Musk has no interest but his own.", "label": 1}
{"text": "A mote of dust suspended in a sunbeam.", "label": 1}
{"text": "Because the internet told you so. ", "label": 1}
{"text": "Musk just knows the right things to say, especially when competing against a beleaguered behemoth like Boeing. \n\nHe would be the sleaziest war profiteer of all time if given the same type of access Boeing enjoys.", "label": 1}
{"text": "No, because I have ears and a brain and can recognize prime mockability by myself. \n\nThEy'Re EaTiNg ThE dOgS, tHeY'rR eAtInG tHe CaTs", "label": 1}
{"text": "Found the China shill lol. It's pretty clear that China is a hostile nation and is doing everything in their power, just short of actual war, to shit on the US.", "label": 1}
{"text": "Shill? \n\nThat, or a person not being fleeced by US military industrial complex marketing dollars. \n\nGo, buy a ticket to Beijing or Shenzhen. Tourist visas aren't hard to get. Travel around. Walk the streets, go in businesses and markets. They're no different than us. None at all. \n\nThe military posturing and alliances are just as treacherous and hypocritical as those of the US. They align with Russia for... oil. We align with Saudi Arabia for... oil. They dickwave in the south pacific, we dickwave in the south pacific. They commit atrocities against ethnic groups, we commit atrocities against ethnic groups. \n\nGrow up. The \"red china\" scare bullshit is crap that demagogue politicians push on rubes. We're both capitalist nations with dicey histories and policies looking out for our own best interests.", "label": 1}
{"text": "Is this sarcastic? Lmao \n\nHe completely nuked twitter into the ground in like 6 weeks my man, and he did it by firing people arbitrarily. What are you even talking about.", "label": 1}
{"text": "Is this satire?  It's gotta be satire, right?", "label": 1}
{"text": "Musk has no intention of saving money for the government. Much of his current wealth is because of government rebates (early on with Tesla) and direct contracts like SpaceX.\n\nWhen Musk has complete, uninsulated control of a company like with Twitter, he runs it into the ground.", "label": 1}
{"text": "Do you hear yourself, save money?  The only way this comment makes any sense is if you didn't know about his attempt at a $56B payday that had to be stuck down by a court.", "label": 1}
{"text": "What on earth gives you that idea?", "label": 1}
{"text": "We have to remember that a 40 year old in China grew up when the country was essentially a farming based society. Even if the country changes, the people will not change as quickly.", "label": 1}
{"text": "[Trump didn't repeatedly promise \"revenge\" on his enemies in his first term either](https://www.politico.com/news/magazine/2024/09/30/trump-doj-revenge-political-enemies-00178218)\n\n\"Oh wait\" yourself lol", "label": 1}
{"text": "Ehh in my recollection, *dumb, dishonest* people said they were crying wolf over Ukraine.  The entire US government and its system of allies and partners took it seriously, as did every serious media outlet.  The fact that people like Tucker Carlson or Trump purported to have doubts about it doesn't really mean it was up for debate.", "label": 1}
{"text": "I work at Tesla and it's beyond a shit show. Hia top talent started leaving last summer with no replacement. And look at the stock performance. Look at twitter value.", "label": 1}
{"text": "I think it should be army navy astry, but you can get used to pretty much any name over time.", "label": 1}
{"text": ">What agenda do you really have here?\n\nOther than calling out the Pentagon and the US defense budget for inflated numbers as well? None. Christ, how paranoid are you?", "label": 1}
{"text": "German and Japanese internment camps in the 1940s. \n\nHighest incarceration rate of any country in the world. \n\nWe invaded Iraq and Afghanistan for 20 years for... reasons, and killed about a million civilians. \n\nBut do go on.", "label": 1}
{"text": "Am I supposed to be sad that they execute corrupt officials in China?", "label": 1}
{"text": "Also rockets are thousand year old chinese technology", "label": 1}
{"text": "Putin and the BRICS nations are [baiting the US and NATO](https://amzn.to/3An6ZhE) into wasting economic and military power, so BRICS can become rhe dominant superpower of the world. That's what all these wars in [Ukraine, Israel, and Taiwan next](https://amzn.to/3An6ZhE) are all about.", "label": 1}
{"text": "Doesn’t repeating the same thing get boring at some point? Europe has a vibrant new space scene", "label": 1}
{"text": "Not to flex over the ISS situation… but my body has been leaking gases out every day since birth and it’s really nothing to worry about.", "label": 1}
{"text": ">Again, not necessarily condoning the international meddling, but I have a feeling the discussion around Ukraine would be wildly different if Russia funded a rebellion without actually putting boots (and tanks and planes and missiles) on, in,\n\nWhich is exactly what Russia did during the first 8 years of the Kiev regime. They funded the Luhansk and Donetsk rebels.", "label": 1}
{"text": "That sort of proves my point; I can tell you a heckofalot more about the current invasion of Ukraine than I could tell you about previous Russian meddling in the region. I mean, I'm sure Russia is meddling anywhere and everywhere they can, but a full scale invasion is a different beast. One is an internal conflict with foreign influences, the other is a full-scale invasion by a foreign country.", "label": 1}
{"text": "No, the Soviets did not invent chopsticks", "label": 1}
{"text": "Elon might be a grifter, and he might bow down to the CCP to sell Teslas in China, but he doesn't sell industrial secrets.", "label": 1}
{"text": "\"Shit goes into one side of the black box, the black boxes in the US and China work very different, the shit that comes out the other end is pretty much the same\" \n\nExcept China gets high speed rail and EV cars.", "label": 1}
{"text": "You just mentioned three free services, meaning the product is actually the user. They're not sabotaging their product, they're annoying their product into allowing them to be properly monetized.", "label": 1}
{"text": "It would have been easy to come up with something cooler. Space corps is easily better. Galaxy force, galactic force. Star force. It’s so easy", "label": 1}
{"text": "I appreciate that. And still think it’s important to beware, the political game is not fought in a separate universe and things change. We create democracy every day. There are Halloween examples of what dictatorships do to the space industry. And the US is close to choosing a dictator.", "label": 1}
{"text": "What turns into a problem is letting an egomaniac fascist feel powerful. Mocking breaks down his lies and facade for the rotten core.", "label": 1}
{"text": "The level of Sinophobia in this comment section is truly astounding.", "label": 1}
{"text": "I'm just as critical of the Chinese government, I'm just alarmed by the rising jingoistic nonsense about it. In this comparison there isn't a winner is all I'm getting at. Both have horrible histories and horrible current policies. It is what it is. \n\nI just don't want normal people to throw paid for fuel on the dumbass fire of saber rattling. Trump's bad enough with his lazy pandering, we don't need more of that.", "label": 1}
{"text": "US Space Force by Donald Trump. What could go wrong.", "label": 1}
{"text": "We probably send more money to Israel than NASA", "label": 1}
{"text": "US has the most violent and largest prison population.\nPolice have qualified immunity which is a license to kill. You don't know what you're talking about.", "label": 1}
{"text": "Honey wake up, new \"Why Elon Space Company Very Bad\" story just dropped", "label": 1}
{"text": "Every boat is a pump failure away from sinking?", "label": 1}
{"text": "Please tell me you're not that dumb and naive, and you're just trolling. Please.", "label": 1}
{"text": "But it's not a galaxy force and has little to do with stars. Space Force is very descriptive and appropriate for its responsibilities. The only more apt name would've been Near Earth Orbit Force or something.", "label": 1}
{"text": "I think it would help if Trump stopped saying and doing bad and mockable things. I know it is tough for him and I feel for him, but his family are doing him a disservice by allowing him to embarrass himself in public like this", "label": 1}
{"text": "Yeah it’s over for the EU space program. Basically pointless. India will be ahead of them soon.", "label": 1}
{"text": "You could orbit inside the black hole and live.\n\nThere are black holes where the event horizon is far bigger than our solar system. There is no upper limit either.\n\nSo in theory an entire solar system could even be inside the event horizon, the planets would be orbiting their star, which would be orbiting the singularity. The bigger the black hole the more seamless crossing the event horizon becomes.", "label": 1}
{"text": "Imagine being enraged by any mention of the Space Force because it's associated with Trump to the point that it makes you foam at the mouth and seem completely incoherent", "label": 1}
{"text": "The other day I was in the elevator at work. Got on at the first floor alone, going to the 6th floor and I needed to fart. I thought to myself “What are the odds that someone is going to get on between 2 and 6? They would probably just take the steps. “ so I let ‘er rip. Someone got on at the 4th floor going to 8. I hope they made it.", "label": 1}
{"text": "Pretty much, but saying it that way makes it seem a lot more fraught than it actually is.", "label": 1}
{"text": "Weaponize that bomb.. why the 25 characters?", "label": 1}
{"text": "Mine too and I found that the real emergency is when it is unable to do so. 😮‍💨", "label": 1}
{"text": "The AFSPC was basically just renamed into the Space Force", "label": 1}
{"text": "> NASA budget at $25.4B was ~0.36% of total US government spending.\n\nAnd still larger then everyone else in the world *combined*. If they are advancing their space programs faster than the US, it isn't because of funding.", "label": 1}
{"text": "US Space Force warns of ‘mind-boggling’ build-up of Chinese capabilities\n\nAgency chief Chance Saltzman says Washington must co-operate with allies to counter threats from China and Russia\n\n￼General Chance Saltzman: ‘One of the reasons you have a space force in the US now is in recognition of the last 20 years, [Russia and China] have developed and demonstrated the ability to conduct war fighting in space’ © Michael Brochstein/Sipa/Reuters\n\nPrint this page\n\nThe chief of the US Space Force has warned that China is putting military capabilities into space at a “mind-boggling” pace, significantly increasing the risk of warfare in orbit.\n\n“The number of different categories of space weapons that [China has] created and . . . the speed with which they’re doing it is very threatening,” said General Chance Saltzman, head of space operations at the US military’s recently created force tasked with protecting American interests in space.\n\nSaltzman spoke during a tour of Europe to raise awareness about the potential for conflict in space with powers including China and Russia and the need to co-operate with European allies to improve deterrence capabilities.\n\n“One of the reasons you have a space force in the US now is in recognition of the last 20 years, [Russia and China] have developed and demonstrated the ability to conduct war fighting in space,” he said. The Space Force was established in 2019 by then-president Donald Trump, who is vying for re-election next week.\n\nThe US military has long been using space-based assets for communications and missile targeting. For China, space has become an increasingly crucial domain in its quest to put one of the US military’s traditional strengths at risk. \n\nBeijing has dismissed US claims its increasingly sophisticated space programme poses any danger to other countries. The foreign ministry accused Washington this year of “repeatedly hyping up China” as a threat as “an excuse for the US to expand its forces in outer space and maintain military hegemony”.\n\n￼US Air Force Academy cadets before they were commissioned into the US Space Force. The space force was established in 2019 by then-president Donald Trump © Michael Ciaglo/Getty Images\n\nAs part of large-scale military reforms started in 2015, Chinese President Xi Jinping combined space, information and cyber warfare operations under the Strategic Support Force, a new arm of the People’s Liberation Army.\n\nIn April Xi launched another restructuring that in effect dissolved the SSF and puts its functions under direct control of the military leadership, in a sign that he seeks to enhance space, cyber and information operations.\n\nBoth Russia and China have tested satellites with capabilities that include grappling hooks to pull other satellites out of orbit and “kinetic kill vehicles” that can target satellites and long-range ballistic missiles in space.\n\nIn May, a senior US defence department official told a House Armed Services Committee hearing that Russia was developing an “indiscriminate” nuclear weapon designed to be sent into space, while in September China made a third secretive test of an unmanned space plane that could be used to disrupt satellites.\n\nThe US is far ahead of its European allies in developing military space capabilities but it wanted to “lay the foundations” for the continent’s space forces, Saltzman said. Last year UK Air Marshal Paul Godfrey was appointed to oversee allied partnerships with Nato with the US Space Force — one of the first times that a high-ranking allied pilot has joined the US military.\n\nBut Saltzman warned against a rush to build up space forces across the continent. \n\n“It is resource-intensive to separate out and stand up a new service. Even . . . in America where we think we have more resources, we underestimated what it was going to take,” he said.\n\n￼For China, space has become an increasingly crucial domain in its quest to put one of the US military’s traditional strengths at risk © Adek Berry/AFP/Getty Images\n\nThe US Space Force, which monitors more than 46,000 objects in orbit, has about 10,000 personnel but is the smallest department of the US military. Its officers are known as “guardians”.\n\nThe costs of building up space defence capabilities mean the US is heavily reliant on private companies, raising concerns about the power of billionaires in a sector where regulation remains minimal.\n\nSpaceX, led by prominent Trump backer Elon Musk, is increasingly working with US military and intelligence through its Starshield arm, which is developing low Earth orbit satellites that track missiles and support intelligence gathering.\n\nThis month, SpaceX was awarded a $734mn contract to provide space launch services for US defence and intelligence agencies.\n\nDespite concerns about Musk’s erratic behaviour and reports that the billionaire has had regular contact with Russian President Vladimir Putin, Saltzman said he had no concerns about US government collaboration with SpaceX. \n\n“I’m very comfortable that they’ll execute those [contracts] exactly the way they’re designed. All of the dealings I’ve had with SpaceX have been very professional,” he said.\n\nAdditional reporting by Kathrin Hille in Taipei", "label": 1}
{"text": "Actually, Clinton gave it to the Navaho, in the eyes of the US, anyway.  THAT came up leading up to the Peregrine launch.", "label": 1}
{"text": "A space station is a hole in low orbit into which you pour money?", "label": 1}
{"text": "Sure. But if it’s big enough that could take a very long time.", "label": 1}
{"text": "[Phoenix A](https://upload.wikimedia.org/wikipedia/commons/d/d3/Phoenix_A_compared_to_Ton_618_and_the_Orbit_of_Neptune.jpg) definitely exists. \n\nBlack holes like Phoenix A represent a new class of black holes, some scientists call them “stupendously large black holes” (SLABs):\n\n> A black hole of this mass has:\n\n> - 24,100 times the mass of the black hole at the center of the Milky Way (Sagittarius A*)\ntwice the mass of the Triangulum Galaxy, including its dark matter halo.\n> - Assuming it is a non-rotating black hole, an immense event horizon with the Schwarzschild diameter of 590.5 billion kilometres (3,900 astronomical units; 0.062 light-years), 100 times the distance from the Sun to Pluto.\n> -A circumference that would take 71 days and 14 hours to travel at light speed.\n>Such a high mass may place it into a proposed category of stupendously large black holes (SLABs), black holes that may have been seeded by primordial black holes with masses that may reach 100 billion M☉ or more, larger than the upper maximum limit for at least luminous accreting black holes hosted by disc galaxies of about 50 billion M☉\n\n> First, the tidal forces in the vicinity of the event horizon are significantly weaker for supermassive black holes. The tidal force on a body at a black hole’s event horizon is inversely proportional to the square of the black hole’s mass: a person at the event horizon of a 10 million M☉ black hole experiences about the same tidal force between their head and feet as a person on the surface of the Earth. Unlike with stellar-mass black holes, one would not experience significant tidal force until very deep into the black hole’s event horizon.", "label": 1}
{"text": "Ok I need ur help **ASAP** (i have 3 days to take this decision) so some of my friends and I started a website and I am to give masterclasses on this website and I will be taking one class on Astronomy and another on Quantum Mechanics do you think people will join, or just answer this question would you join ? (I am certified by IIT Madras and BITS Goa, 2 of the highest-rated colleges in India) the class is for 1500INR or around 24$ USD ?", "label": 1}
{"text": "Sure thing little buddy. Tell poo bear to stop genociding the uyghers.", "label": 1}
{"text": "Why downvoting you fkin idiot", "label": 1}
{"text": "Actually being passionate against fascism is very helpful. \n\nYou may have even told yourself that you wouldn’t ever allow your country to be taken over by nazis, while learning about WWII. I don’t think that occurs by encouraging others to stop making fun of the fascist.\n\nIt is helpful. What isn’t helpful is attempting to tolerate the intolerant.", "label": 1}
{"text": "Yes it is. What galaxy do they operate in? The Milky Way. Has little to do with stars? Oh ya you’re right, they don’t plan their entire schedules are the stars. \n\nI’m sorry, you think space force is ‘very descriptive’? It is exactly as descriptive as the other names. No more, no less.\n\nNear earth orbit force it’s ridiculous. So then they change their name to middle earth orbit? Then 1/3 light year force? What’s next? Is this how you think they should name branches? As a description of previous locations? Additionally, their missions already exist beyond low earth orbit.", "label": 1}
{"text": "I've always been told that if it fucks, flies, or floats it is cheaper to rent.\n\nWhich raises an interesting question... is the ISS flying or floating?\n\nWe all know the fucking is being done by the ULA capsule", "label": 1}
{"text": "Sadly, whether you like the guy or not, Space Force was incredibly necessary. To think none of our enemies are trying to make one is foolish. And to think none of our allies wouldn't either is also foolish. Not saying we need to distrust them, but in 30 years loose allies could become enemies (looking at Pakistan and Turkey). \n\nI'd argue advancing Space Force to as fully funded as the rest is incredibly necessary. We had an army and navy then created the marines. We never suspected we would have any other forms of conflict. And then planes came into existence and proved we would need another form of military. Now we have Space flight and other countries, at least 2 that are antagonistic towards us, have spaceflight capabilities. It was in this thread I found out China has its own space station. We don't even have our own - we're sharing it with one of our biggest rivals. \n\nIgnore your hatred for who made it a thing. It's necessary and could potentially become as important in future wars and conflicts as the Air Force is today.", "label": 1}
{"text": "So maybe I'm missing your point. Are you saying Space Force was a mistake?", "label": 1}
{"text": "I want to live on the timeline where Apollo-Soyuz was followed up on and we got the ISS in 1990.", "label": 1}
{"text": "No one is saying you should just tolerate intolerance", "label": 1}
{"text": "Steven seagal?\n\nSorry Reddit threads running together", "label": 1}
{"text": "He seems quite sure that he's heading for prison if Trump loses. I don't see how he'll be relevant to SpaceX if he's either heading up the \"D.O.G.E.\" or in prison. That's his words, not mine.", "label": 1}
{"text": "Are you? I never said space force was a mistake", "label": 1}
{"text": "What was Lowell’s reaction to the enormous planet-sized mouse cursor in space pointing directly at Pluto?", "label": 1}
{"text": "Lol is that where you’re at brotha? I have no problem thinking logically. Are you projecting or something haha. I’ve never run into the point where I start defaulting to ‘actions that run counter to my opponent’.\n\nMy thoughts are original, and based on facts. You’ve done nothing to convince me a fascist should not be mocked on all occasions, but you are starting to convince me that you prefer to defend the fascist.", "label": 1}
{"text": "\"It's right-fucking-there.\"\n\nAlso, Lowell refers to \"Lowell Observatory\".  The guy credited with discovering Pluto is [Clyde Tombaugh](https://en.wikipedia.org/wiki/Clyde_Tombaugh).  Just mentioning it here because nobody else has yet.", "label": 1}
{"text": "He was like, \"Mouse cursor? WTF's a mouse?\"", "label": 1}
{"text": "Iirc Clyde Tombaugh used to joke about the Pluto images always being annotated with arrows; when people asked how he discovered Pluto, he said he looked up and saw there was an arrow pointing at it.", "label": 1}
{"text": "Fun fact: Clayton Kershaw's great uncle", "label": 1}
{"text": "Pardon my ignorance. But how the heck did they know that that little dot was a planet back in 1930?", "label": 1}
{"text": "It's not flying, it's falling with style. \n\nTo infinity and beyond!", "label": 1}
{"text": "Yeah I almost put that but the mods have been known to delete joke post lol \n\nStrictly true though I think", "label": 1}
{"text": "Yea, this sub is quite humorless. For quite some time I was sitting at negative votes for what is pretty clearly a shitpost in response to what is also pretty clearly a shitpost.\n\nSigh", "label": 1}
{"text": "\nIsn’t it crazy we are the only planet to view Pluto as not a planet?", "label": 1}
{"text": "And interestingly, some of Tombaugh's ashes were on New Horizons", "label": 1}
{"text": "Only for English speakers. In my language we don’t use the word “Planet”.", "label": 1}
{"text": "He took two pictures of sections of the sky days apart, then had those pictures compared by rapidly alternating between them (google 'blink comparator'). Objects outside of our solar system would appear in both pictures, but anything in our solar system would have moved and would appear to be twinkling as he alternated between the pictures.", "label": 1}
{"text": "Weird.....its almost like Pluto is a dam planet", "label": 1}
{"text": "The fuck is it pointing at?", "label": 1}
{"text": "Add another moon to the list where possible xeno-sushi exists.", "label": 1}
{"text": "Xeno-plankton at best but your point is well made.", "label": 1}
{"text": "I can’t help but hear this word in the whispering voice of Summer Glau", "label": 1}
{"text": "Xeno-plankton would still be the most important scientific discovery of the past 100 years and would, hopefully, get us looking outwards a lot more actively and deliberately. ", "label": 1}
{"text": "Absolutely. Proof that the universe can do it more than once and only within the small sample size of the bodies around our star. It would be amazing.\n\n(Cynical Me checking in to remind everyone that the public would care about it for a few days before the next pop/political thing pushed it out of the news cycle.)", "label": 1}
{"text": "IKR I try to convince myself that people would care about something like that, or maybe an even bigger discovery, but I just don't think even something like the discovery of extra-terrestrial life would even matter to the public for long.", "label": 1}
{"text": "Lol 1994 someone def cheated but we couldn't prove it yet. Looking like a nineties screen saver smdh.", "label": 1}
{"text": "He might have known what a mouse is", "label": 1}
{"text": "Ah. A fellow trauma survivor.", "label": 1}
{"text": "What does anyone do with this info? Theres some plankton running around on a moon thats forever out of our reach, let’s hope they dont steal the krabby patty formula?", "label": 1}
{"text": "Half these comments have to be bots.", "label": 1}
{"text": "Wait which scifi show is this referencing? She was a savage in the 2000s and needs to be in more things", "label": 1}
{"text": "I think the public would only care if we found aliens that we  could potentially go to war with or invade that us. Yeah they would probably not care if we just found simple organisms like bacteria.", "label": 1}
{"text": "War OR have sex with.... or both", "label": 1}
{"text": "I am a leaf on the wind, watch how I soar", "label": 1}
{"text": "Firefly, or more specifically the movie finale Serenity", "label": 1}
{"text": "I guess it's technically possible it was seeded through pan-spermia.", "label": 1}
{"text": "\"We found this plankton and need to establish a research station... I mean the plankton have weapons of mass destruction!\"", "label": 1}
{"text": "Ah yes, the ultimate end game: Sexy War", "label": 1}
{"text": "I feel like people would expect it to be like a person or big animal and be disappointed if it was something like a fish, meanwhile I'm just expecting it to be microbes and would be happy to just have that. If it was a fish or starfish I'd be ecstatic we found a multi-cellar life-form at all.", "label": 1}
{"text": "Heck I feel like they'd be disappointed if we found a fish, meanwhile I'd be flying sky high. A multi-celled organism is more than I would expect. It's what I hope for but I expect a single cell organism.", "label": 1}
{"text": "I heard the plankton have oil reserves. And I heard they’re going to give exclusive access to China.\n\nWith 25% of the US DoD budget reallocated to delivering democracy to the plankton oil fields, we could probably have Space Force out to Uranus by 2040.", "label": 1}
{"text": "Wow, I didn’t think the switch could render things that well", "label": 1}
{"text": "Anything more than dirt and fluids is a win...If they found fish can we make space sushi out of them please?", "label": 1}
{"text": "If we had proof that life existed elsewhere, it might make us start thinking a little harder about what that Great Filter might be, and in-turn how to get past it...", "label": 1}
{"text": "Would be neat if I could stop reading space articles that way “this planet could be earth like*”\n\n“*it orbits a white dwarf, is tidally locked, and has gravity 4x that of earth.”", "label": 1}
{"text": "They Wash them. \n\nAlso my comment must be 25 characters or longer", "label": 1}
{"text": "Along the line of what you're saying,  proof it can happen more than once in our solar system, and on worlds we could not have imagined, drastically changes the parameters of the Drake Equation. Life would be the rule and not the exception. We may find out that life exists because consciousness exists and not the other way around.", "label": 1}
{"text": "\"These plankton are using some novel process to use energy where they are. If we learn how they're doing that then we can use similar reserves of energy here.\"\n\nOr if thats too complex for them, \"There's oil in them there moons!\"", "label": 1}
{"text": "The answer is: They run them through the wash!", "label": 1}
{"text": "You want to “probe” Miranda? 🫣", "label": 1}
{"text": "You know that and I know that. My cynical comment was because the average person doesn't care about any filters that aren't easily provided by a photo app. Post-modern culture is infected with a nihilistic belief that nothing matters so only the now is worth paying attention to.", "label": 1}
{"text": "Just say we’re sending space missionaries to spread salvation", "label": 1}
{"text": "Captain kirk: \"I sure hope not\"", "label": 1}
{"text": "Do you want Reavers?  Because this is how you get Reavers...", "label": 1}
{"text": "They would care about it if they had 1000 new trash TV channels to watch. Not very much if they couldn't tell the difference, admittedly.", "label": 1}
{"text": "I want to believe it would make more of a splash than that", "label": 1}
{"text": "So do I, my lad. *Sips sadly* So do I...", "label": 1}
{"text": "I agree. I was born in 1973 and the coolest thing I got to see that was space related was the first shuttle launch. Barely any news coverage for the second launch. \n\nI do have to say the SpaceX booster grab definitely rivaled the shuttle launch, and it's time in the media spotlight lasted maybe a week.", "label": 1}
{"text": "These are both still roo soon", "label": 1}
{"text": "Could we ask her to stop orbiting my... Oh no - Uranus, and finally get some life?", "label": 1}
{"text": "I’ve seen “Life” and just don’t want it to be Calvin.", "label": 1}
{"text": "It’s also entirely possible there is no such thing and never has been such a thing as the Great Filter", "label": 1}
{"text": "It would be an amazing find.\n\n\nBut it probably wouldn't prove life evolved more than once. It might be more evidence for panspermia ", "label": 1}
{"text": "especially if its non carbon based life, but there is a high chance of it being carbon based at least from our solarsystem", "label": 1}
{"text": "Exactly what came to mind when I saw the post. I love that dancing octopus", "label": 1}
{"text": "Nearly everywhere, carbon/water is just too versatile for energy exchange and making of complex bonds", "label": 1}
{"text": "which judeo christian branch do they fall under and what's the tax rate?", "label": 1}
{"text": "I just watched Firefly for the first time, it is EXTRA too soon for me!", "label": 1}
{"text": "Fruuuuuuuuuuuuty oat-y bar!", "label": 1}
{"text": "Sure, but we don't have access to an infinite universe, we have at most a local galaxy cluster to explore, depending on the speeds we reach. Having it right in our solar system would be huge.", "label": 1}
{"text": "It would basically be the difference between:\n\n\"the universe is so enormous life probably does/did/will exist other places than earth\"\n\n and:\n\n\"The universe is teeming with life\".", "label": 1}
{"text": "Truth. It’s also amazing that we’ve discovered life on Earth in places we thought inhabitable. Of course some of the population will not even care or only care enough as their short attention spans let them. I have always believed there to be life (intelligent as well) outside our planet - it’s egocentric to think the possibility doesn’t exist and we are the only one’s. I think there are some things we just intrinsically know, that isn’t just of our imaginations. I’ll step off my soapbox before I go too far… ", "label": 1}
{"text": "Spoiler Alert* It's your mother's bumhole", "label": 1}
{"text": "If Firefly and Serenity have taught us anything, DON'T. GO. GO TO. PLANETS. NAMED. MIRANDA.", "label": 1}
{"text": "Absolutely, and being discovered outside the “Goldilocks zone” would completely blow our models for finding life outside our solar system out of the water.", "label": 1}
{"text": "You are not buying into the Christian line that life is too complex to have just happened, and therefore there must be a god. They do this again with evolution: far too complex, it would be like a tornado hitting an automotive junkyard and accidentally assembling a 747.", "label": 1}
{"text": "What the fuck is a reaver?", "label": 1}
{"text": "Maybe there is no Great Filter: the galactic civilization has decided to invest in making sure that the rabid human race does not detect them, at least not for a few more millennia.", "label": 1}
{"text": "If complete strands of at least RNA had been transmitted, I think sequencing the genes of the new life form could tell us whether we share a common original sequence.", "label": 1}
{"text": "Except evolution has made crabs 5 times, so the tornado accidentally made 5 different but similar 747s", "label": 1}
{"text": "Still basically meaningless to us other than thought experiments. As we can't get out of this solar system, pretty much ever without \"physics breaking magic\" level of advancement.", "label": 1}
{"text": "Tell me you've never seen *Firefly* without saying you've never seen *Firefly*...", "label": 1}
{"text": "If I eat terra-shrimp I will swell up and die. You can have the alien sea bugs.", "label": 1}
{"text": "The bigger response is that, no a tornado cannot plausibly assemble a 747, even from a junkyard full of 747 parts, but that's not how evolution works either. For one thing: evolution didn't have a \"goal\", like creating humans. If you have *lots* of mutations, you gets lots of variation. And then if you have nature selecting the fit (by killing the unfit before they can pass on their genes), you get crabs 5 times (which also ought to make you reevaluate your dating habits).", "label": 1}
{"text": "I agree that the Christian pseudoscience is ridiculous, if not harmful, but science can coexist with religion, and as far as I know, science has never proven the absence of a creator. Christians don’t like evolution because the Bible says we were created in gods image. But evolution doesn’t disprove that statement, it just explains the process.", "label": 1}
{"text": "Elons space pollution. It's a horrible thing to watch.", "label": 1}
{"text": "I mean, I don't see why my comment was downvoted. It was just a question >!that ended up coming out wrong in tone because of that extend comment characters to not sound like a bot!< But no, I've never seen Firefly.", "label": 1}
{"text": "I still haven't seen firefly but have seen serenity, loved that movie and hope to check out firefly some time", "label": 1}
{"text": "Oh don’t worry if they do find life elsewhere they will change tunes say it’s all part of gods creation and all is well with their world view again. Belief is faith based not evidence based so no amount of evidence is going to shake that.", "label": 1}
{"text": "Yes, their god wanted a slushy ice-ocean full of plankton on a distant moon because \"God works in mysterious ways!\"", "label": 1}
{"text": "“It was a test of our ingenuity by him to see if we would ever find it!”", "label": 1}
{"text": "Scrolled far too far to see this.", "label": 1}
{"text": "But that’s less fun to say all that, than it is to say “crabs good, evolution prove”", "label": 1}
{"text": "I certainly didn't downvote you.  That would be rude.  Not having seen a 20 year old show is not deserving of a downvote.", "label": 1}
{"text": "He has cousins?!?\n\nOh no...", "label": 1}
{"text": "If you loved Serenity, you'll at least like Firefly.  It's very much the same in tone, though somewhat smaller stories, lots of character and world building, and a lot done very well with a much smaller budget.", "label": 1}
{"text": "If Christianity is very malleable, saying very little other than \"there was a creator\", science will never disprove that (can't prove a negative). \n\nHowever, where Christians makes assertions like: the Bible is literally true and the Earth is 6,000 years old, and 6,000 years ago man was created from dirt, and woman was created from a man's rib, and there was a global flood (about 1B cubic-miles more water than exists on Earth right now, to cover the mountains), and such nonsense, science has shown that those things are incompatible with all of the evidence, from multiple interlinked disciplines. In other words: it's bullshit.", "label": 1}
{"text": "Only if evolution also provides butter and Old Bay seasoning.", "label": 1}
{"text": "It would tend to explain the Fermi Paradox as life gets to first base fairly often but hits home runs aka intelligence very rarely.", "label": 1}
{"text": "I’ll call and ask, just to be sure", "label": 1}
{"text": "It's part of the \"deceptive God\" hypothesis. God buried all of those dinosaur fossils to test the faithful. You don't just have to assert your belief in God in the face of zero evidence for God: the truly faithful will assert their belief even in the face of controverting evidence! Believe or burn.", "label": 1}
{"text": "Mr beast video 50yrs from now I tried all of the solar systems moon sushi in 30 days 😋", "label": 1}
{"text": "I get the impression the movie and the TV show are completely separate?   Whenever the moon Miranda is mentioned always makes my think of serenity. I'm going to have to find a copy of firefly to finally watch it, been on my to do list for years", "label": 1}
{"text": "Or worse...we will become the Great Filter", "label": 1}
{"text": "...so *far*\n\nBut yes, most definitely.", "label": 1}
{"text": "Got it. Look forward to watching it", "label": 1}
{"text": "Yeah, reavers man. Anti-depressant cannibals that do unspeakable things.", "label": 1}
{"text": "Exactly! Can sushi salmon be topped? We will see ;)", "label": 1}
{"text": "Gorram Reavers, Mal. We can't go there!", "label": 1}
{"text": "Can't we just wash it off?", "label": 1}
{"text": "As far as we know DNA in life is unique to earth. Complex organisms could exist without DNA", "label": 1}
{"text": "Could be! Hopefully we survive long enough to find out!", "label": 1}
{"text": "I don’t agree that the Fermi Paradox is even a thing either", "label": 1}
{"text": "Lol I absolutely agree with you. My comment was overly optimistic - \"maybe\" implied far too strong a chance that that would happen.  \nIf people aren't worried enough about their own kids/grand kids to act, they aren't going great to worry about humanity's theoretical future as a galactic civilization.", "label": 1}
{"text": "Umm sushi everyone kinda likes sushi", "label": 1}
{"text": "What are you basing that claim on? It seems pretty clear to me that the consensus is that the universe is infinite. However, the *observable* universe is finite.", "label": 1}
{"text": "Well it'd definitely \"a thing\", you and I are talking about it.  \nBut I'm interested to know what you think about it.  \nE.g., Do you think that we *have* detected a galactic civilization?", "label": 1}
{"text": ">science has never proven the absence of a creator\n\nYou can't prove a negative.", "label": 1}
{"text": "Is it just me, or does Pluto look like it’s been on a glow-up journey? 🌌", "label": 1}
{"text": "Not the first time Miranda’s been orbiting Uranus.", "label": 1}
{"text": "Firefly predicted this...[Gif](https://makeagif.com/i/1cf2Cl)", "label": 1}
{"text": ">Still basically meaningless to us other than thought experiments.\n\nSee, this is the thinking that holds back society. I'm not targeting you specifically, but a lot of people seem to think in this limited way.\n\nThe fact is that life existing outside of our planet or anywhere else has a huge effect on us as a species. In may not, and probably won't, effect any of us *as individuals*, but concrete evidence of life, no matter how rudimentary, will drive future innovation to 'seek out new life and new civilizations'. Theoretically, it could encourage a global unity to either seek life out and gain knowledge, or more likely for humans, conquer it.\n\nAs a species, we really need to stop thinking in chucks of 80 years at a time, and start looking at the bigger picture.", "label": 1}
{"text": "The colour calibration seems a little off . . . ?", "label": 1}
{"text": "It’s not even 06:30, and I’ve learned a new word already.", "label": 1}
{"text": "I mustn't laugh. I mustn't laugh. I'm a grown up.\n\nURANUS \nHAHAHAHA", "label": 1}
{"text": "They were systematically surveying the sky.", "label": 1}
{"text": "We couldn't detect ourselves with our current technology, and we definitely exist. That alone kind of throws the thought experiment out. \n\nThe Fermi Paradox relies on the assumption that any alien civilization we detect is so advanced, that they have begun to numerate the stars of a galaxy and alter the universe on a cosmic scale. That they will have electromagnetic signatures that rival the largest forces in the universe. That might not be plausible.", "label": 1}
{"text": "Too soon.\n\n\n...also, my comment must be 25 characters or longer.", "label": 1}
{"text": "That's similar to the Dark Forest theory that has been popularized.", "label": 1}
{"text": "It's hot in here. Must be Summer.", "label": 1}
{"text": "I didn't mean you directly, sorry.", "label": 1}
{"text": "Where there is Plankton, there is Crabs.", "label": 1}
{"text": "Galaxy, not solar system. We can very much get out of the solar system without magic", "label": 1}
{"text": "I’m a foodie! \n\n(Great stand up special!)", "label": 1}
{"text": "I'm not eating that fish thats for sure", "label": 1}
{"text": "Discovery of life may not be a good thing, existentially. It would eliminate several possibilities of the Fermi paradox, leaving us with the conclusion that Life is common but it does out before becoming interstellar. One possibility is that intelligence is rare. Another possibility is that we as a species have an expiration date, and that date is relatively soon.", "label": 1}
{"text": "I hope Summer Glau didn't read this headline in a whisper.", "label": 1}
{"text": "I respect the Mirandans for telling us to have legal rights read to those arrested.", "label": 1}
{"text": "No we can't. We can send probes that leave the solar system 30 years later but sending a human anywhere outside the solar system is still very much impossible and will be for a very long time, perhaps forever. Just because sci-fi writers can imagine it doesn't mean it actually happens later.", "label": 1}
{"text": "Great!!!!\nPretty amazing to capture all of this on a phone 📞.            Congrats!!", "label": 1}
{"text": "They always use non living things for their analogies.  Cars, planes, etc do not exchange Genes and reproduce.  We can make changes to designs as often as we please to improve the product.  Nature relies on accumulated mutations passed down through populations over time.  They know most people dont understand that.", "label": 1}
{"text": "That's pretty grim, PussyStapler  😟", "label": 1}
{"text": "I don't think your conclusions follow. \n\nDistances in the solar system, galaxy, and universe are so vast to our current understanding of physics that there's no way to make any of these judgments. \n\nInterstellar travel may only be able to happen at speeds significantly slower than *c* for a variety of reasons -- running into random things not moving in the same direction as you at relativistic speeds being a major one. Life could be everywhere and too far apart for meaningful interactions to occur, but still living. \n\nAnd then there's also the possibility that the life we know could've started on something extraterrestrial to Earth in our solar system, but dispersed throughout our solar system. For example, Europa and/or Enceladus could have shot plumes of organic materials out into the solar system and been the genesis of life in our neck of the woods -- meaning still having a possible single source of life. \n\nOr we're just a backwater, and there's no reason intelligent life capable of interstellar travel would be interested in us or even know about us yet. (Which may be a good thing, depending on their proclivities.)\n\nAll of which is to say: we should be careful about drawing any major knee-jerk conclusions about anything, even if we find signs of life elsewhere in our solar system.", "label": 1}
{"text": "No, I don't see why it would mean that (and physicists don't generally believe that these days).\n\nThe universe is \"expanding\" because space is being created (at an increasing rate, if I'm not mistaken) between everything, uniformly, everywhere. That doesn't mean it has finite bounds that are increasing.\n\nHowever, it does mean that the size of the observable universe from our perspective is virtually shrinking, since things are constantly getting out of range for us, because of that expansion.", "label": 1}
{"text": "The universe is billions ofyears old. I doubt we are the first if the are others.", "label": 1}
{"text": "The Systems Alliance put something in the water so might want to slow down on the sushi.", "label": 1}
{"text": "Not mandatory! ... And other comments to get to 25...", "label": 1}
{"text": "It would be terrifying because the [Great Filter](https://en.wikipedia.org/wiki/Great_Filter) is ahead of us, not behind.", "label": 1}
{"text": "Intelligence is rare on earth /s\n\nBut I've always thought how we sort of assume humans are top of the intelligence scale, 10/10 while other life forms are <10. What if the scale goes beyond, and we're at 10/1000, just completely incapable of comprehending the universe. We're a seagull with it's head stuck in a bag of chips thinking we're completely stuck and alone", "label": 1}
{"text": "I am *so* sorry. I remember that feeling.\n\nDid you watch the entire series before the movie?", "label": 1}
{"text": "We're all screwed.  Miranda is the planet (in Firefly) where the government tested chemicals to make the population docile but in reality turned them all into reavers.", "label": 1}
{"text": "My point is that you’re incorrect in saying that getting out of the solar system requires “physics breaking magic” level of advancement.", "label": 1}
{"text": "That’s my problem with the argument that since we don’t see other life we must be the first or only.  The distances are so vast.  Every galaxy could have just one interstellar species, which would mean the universe is teeming with intelligent life. But at a galaxy level, interstellar life could be rare.", "label": 1}
{"text": "Damn that's a depressing thought. We actually find alien life and what do we do? Farm and eat it. ", "label": 1}
{"text": "You mean the place with all the dead people on it?\n\n[When I hear Miranda, I always think of this.](https://youtu.be/3FJatsqNdf4?si=HuElOHWIjRGjY98Q)", "label": 1}
{"text": "To get a living human outside the solar system, yes, yes it does.", "label": 1}
{"text": "If we farm sustainably whats the problem? Is xeno-life somehow more precious than terrestrial?", "label": 1}
{"text": "«Это кум на смех!» before you even start randomly beating people.", "label": 1}
{"text": "I think you'd find there are a lot of people who don't believe we should be farming or eating terrestrial life in the first place.", "label": 1}
{"text": "Thank you, that is 100% what I hear every time someone mentions this moon.", "label": 1}
{"text": "What a great name a colony, Im sure nothing bad would happen", "label": 1}
{"text": "Glad this was at least near the top:)", "label": 1}
{"text": "I mean.. as far as we **know** life is unique to earth. DNA or no.", "label": 1}
{"text": "I never even thought of the possibility of alien fish becoming a delicacy here on Earth. Wonder how much a xeno sushi roll would cost", "label": 1}
{"text": "[Most Earth-like planets have yet to be created](https://hubblesite.org/contents/news-releases/2015/news-2015-35.html#:~:text=The%20bulk%20of%20those%20planets,planet%2Dhunting%20Kepler%20space%20observatory.) (to the tune of 92%).\n\n\nThe universe is about 14 billion years old (14,000,000,000), but a stellar mass black hole takes about 10^67 years to fully dissipate (that's 10,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000,000).  And that's just a stellar mass black hole - something like a supermassive black hole takes much longer (~10^100 years).\n\n\nIf you take that 10^100 years as a sort of lifespan for the universe, we're not very far along at all - if the universe were a person, it wouldn't be a minute old yet.", "label": 1}
{"text": "My preferred solution to the Fermi Paradox is that even with the best possible technology, interstellar travel is slow, dangerous, and expensive, to the point that the average inhabited system establishes less than one successful out-of-system colony.", "label": 1}
{"text": "That’s funny you say that because I feel the same way about your analysis.", "label": 1}
{"text": "Evolution isn't a 'tornado' though, it's subject to selective pressure.\n\nIf someone asks you to build an object that can survive being thrown off a cliff you will eventually create something either vaguely plane-like (light and glideable) or just something super sturdy. I.e., the scope of your creation is limited not by the bounds of your imagination but by certain circumstantial pressures.\n\nEvolution is the same way. The underlying mutations are random, but the mutations that actually survive and propagate are based on the challenges of the organism's environment, because mutations only survive if they're reproductively advantageous (or at least not reproductively disadvantageous) and the more reproductive advantage they grant, the greater the likelihood that they propagate.\n\nPut an organism into a boreal environment full of ground-level predators and eventually it will evolve mechanisms to avoid those predators to maximise its reproductive success; it'll dig or go into trees.\n\nFor it to live in trees it needs to have a way to get up there, so it's either going to evolve to be good at climbing or it's going to evolve to fly or glide, etc etc.\n\nPut an organism in a situation where it would benefit from a crab-like body plan and over a pong enough period of time a crablike body plan will likely evolve.", "label": 1}
{"text": "Better than the Miranda I know-she's soulless..", "label": 1}
{"text": "I can’t help but worry the terraforming didn’t go quite as planned, they were warned about the PAX inhibitor.", "label": 1}
{"text": "Except that the basic chemical foundations of life are much less complex than that of the pieces needed to build a 747. So, it would be more like a tornado hitting a lumberyard and the planks landing in order to make a small fence.", "label": 1}
{"text": "My problem with the arguments is its looking more and more like alien life has visited Earth.", "label": 1}
{"text": "Like....at all? Not even veggies?", "label": 1}
{"text": "I wanna eat it, and then fuck it. Maybe in reverse order IDK, feeling cute. ", "label": 1}
{"text": "Well...if supply is extremely high, we just need to cut down on the cost of procurement and transportation, pay labor a good wage, and do it sustainably. \n\nWe can (eventually) do this!!!!", "label": 1}
{"text": "Are you guys serious with this faux pessimism? Even a single cell organism, even if it came from Earth and evolved there will be the discovery of the century.", "label": 1}
{"text": "Yeah man just dirt and rocks", "label": 1}
{"text": "DNA is just coalesced and bound carbon+hydrogen+oxygen\n\nAdd water, heat, and an energy source and DNA can appear anywhere.", "label": 1}
{"text": "Deadliest Catch is about to get a whole lot more dangerous!", "label": 1}
{"text": "Renci de Shangdi, qing dai\n\nWo xiang mei er, mei xin, bian shitou\n\nPlease God, make me a stone", "label": 1}
{"text": "That's a well constructed argument.", "label": 1}
{"text": "Science is agnostic not atheistic, many scientists believe in God, but leave questions of metaphysics out of their scientific endeavors.", "label": 1}
{"text": "BuT aCtuaLly xeno plankton…", "label": 1}
{"text": "I agree with you completely.", "label": 1}
{"text": "Refer to my “sure but that’s not as fun to say” comment", "label": 1}
{"text": "These sushi popplers are great!", "label": 1}
{"text": "Yes! It could be lkke that show awhile back, \"When Nature Fights Back!\"", "label": 1}
{"text": "Man I had to scroll too far to find a firefly reference!", "label": 1}
{"text": "And why would they care? These organisms will make no difference in our daily lives, not for a long time. All of the information will be released. Nobody in this general public will be creating new news. Why should it stay in the daily news cycle? Bleeding edge news that affects our lives doesn't stay in the forefront long. But a cup full of purple smelling bacteria like organisms would drop down in interest after a few weeks.  Why would news that has no real impact on us stay? If it's cute, intelligent, or tasty, that would be different.", "label": 1}
{"text": "Here’s the crazy thing. The universe being 13.8 billion years old sounds like a lot, but we’re still in the infancy. It took 4 billion years for our own planet to form and for life to evolve to this level. If our planet has formed earlier, it might not have been as mineral rich. Don’t forget, for heavier elements to form required stars to have already formed and exploded previously. The universe will be capable of supporting life for trillions of years. It wouldn’t be shocking if it were still too early in the universe for a species to have evolved and spread or generated enough signal for us to notice them. Don’t forget that if there were another civilization just as advanced as ours, we wouldn’t be able to detect them unless they were within 10 light years.", "label": 1}
{"text": "Not interested in the planet where the Reavers come from, thanks", "label": 1}
{"text": "Yeah, thanks. My sci-fi brain was hearing Miranda whispered, but I’ve seen so much sci-fi I couldn’t remember which franchise it was from. My first guess was The Expanse.", "label": 1}
{"text": "> DNA\n\nI love weird sci fi about DNA.\n\nJust re watched the 80's anime Space Pirate Captain Harlock - Endless Odyssey and man does it get far out.\n\nIt's about evil entities called Noo which existed and ruled the universe during the Planck era right after the big bang, and DNA is a sort of \"curse\" they inflicted on life so that they could influence and enslave life through fear. https://omniversal-encyclopedia.fandom.com/wiki/Noo_(Space_Pirate_Captain_Harlock:_The_Endless_Odyssey)\n\n>The Noo were an ancient race of formless alien beings that had existed since the time of time where they were known to had thrived on chaos and destruction. Following the birth of the universe, the Noo lived in the moments where there was no order in the cosmos. When the universe came into existence there was only chaos when matter did not follow the laws of physics. In this cruel world there was only inferno and pain with the Noo being the rulers of space. They were considered the actual condition of primal space itself and ruled the universe through terror where they created slaves for themselves. This period was described as being akin to Hell with shadows and pain spiraling around with the only emotion given to the conscious being fear. At this time, from the chaos of shadows, came the first signs of order in the form of the Twisted Rope which was DNA that was born. \n\n>As time passed on, the clan of the Twisted Rope were unable to bear the control of the shadow of the Noo. Thus, they began a revolution and used the chain of space and the arrows of time against them. The actions of the Twisted Rope led to the lords of shadow being sealed at the very edge of dimensions. Bound in chains, the spirit of the Noo was sealed away within the far reaches of space whilst the remaining body was shattered by the arrow of time that spread all over the universe.\n\n> Since that moment, space was able to move forward and flowed along the flows of time. All these events occurred in a single instant in less than one-tenth of a second after the creation of the universe namely within Planck time. This was when the universe was smaller than elementary particles and was a horribly dense place. These moments were a time when the laws of physics could not be applied. These seconds since the creation of the universe was an incident dense enough in importance to match billions of years worth of time.", "label": 1}
{"text": "[https://www.youtube.com/watch?v=hXCaF68sDPU](https://www.youtube.com/watch?v=hXCaF68sDPU)\n\nSerenity (2/10) Movie CLIP - The Miranda Fight (2006) HD", "label": 1}
{"text": "What in the Lovecraftian hell did I just read", "label": 1}
{"text": "> Fermi Paradox\n\nis an example of taking arbitrary statements lead to arbitrary conclusions.", "label": 1}
{"text": "Here come the gorram Reavers, buckle up everyone", "label": 1}
{"text": "That's not the same thing. At all.", "label": 1}
{"text": "What's stopping us from launching terra plankton at some random planet 🤔", "label": 1}
{"text": "Same thing that has kept us from launching much of anything else at other planets: cost. If SOME ORGANIZATION can provide (relatively) inexpensive mass to orbit and transport to that other world then we can pan all of the sperma.", "label": 1}
{"text": "Our *planet* is also billions of years old, just under a third of the age of the universe itself, and it took around a billion years after its formation for life to first arise, and another billion or so years after that for the first multicellular organisms.\n\nThe idea that we are among the first systems to develop complex life is really not that far out at all.", "label": 1}
{"text": "Yeah it's pretty much an 80's lovecraftian sci fi anime.\n\nIt's full of a lot of great sci fi concepts on top of the weirder lovecraftian stuff, only 13 episodes so very worth a watch if you don't mind older animation. Also has a great soundtrack, here's the opening: https://www.youtube.com/watch?v=D11ENl8EI4o\n\nAnd a short clip of the climactic battle at the end featuring a lot of explosions in space: https://www.youtube.com/watch?v=5xufFqPH7TU", "label": 1}
{"text": "idk, harnessing electricity was pretty big.", "label": 1}
{"text": "Does \"The Wheel\" count as a scientific discovery?", "label": 1}
{"text": "I always love seeing a Tim Heidecker quote in the wild.", "label": 1}
{"text": "Remember that Sex And The City episode where Miranda is seeing a guy that’s into ass play?", "label": 1}
{"text": "Starting to get some serious \"Serenity\" vibes from our solar system :P", "label": 1}
{"text": "Continuation. Religiously God took nothing. And there was nothing. Not even light. This is all part of the order and the chain of events that would have led to you creating this universe but isn't creation itself. The devil can't create and only God the first can create and this is what the devil is angry about and why the devil wants to kill all lan and destroy all God's creations but even then the devil can't create for this was already created including every possible choice you chose. And every thing you create yourself.", "label": 1}
{"text": "I am intrigued.  Thank you for this, I'll have to check it out.", "label": 1}
{"text": "> we just need to cut down on the cost of procurement and transportation\n\nprobably more cost-effective to try and match the conditions locally and figure out how to farm them here on earth than to set up some sort of fishing and transport operation on a moon of uranus", "label": 1}
{"text": "Feel like i had to go too deep for this one.", "label": 1}
{"text": "That damn jingle lives rent-free in my head forever", "label": 1}
{"text": "I remember there was a British group called \"Miranda Sex Garden\" in the 90s, but I was not a fan.\n\nI was more of a shoe[maker-Levy9]gazer..  \n\n..but then the shoegazer comet chrashed into Jupiter and everything became britpop/complete shite..", "label": 1}
{"text": "We can’t even do that on earth is the problem.", "label": 1}
{"text": "There is nothing that says that the universe wasn't infinite before inflation. Afaik what we do know is that our observable universe was at first close enough to even out it's temperature quite a bit and then inflation happened and it stopped being that close before it turned homogeneous. Nothing of that puts any limit on the scale of the early universe.", "label": 1}
{"text": "Why only plankton? The underwater hydrothermal vents on Earth, which thus far is our closest analogy, do support some fish and mollusks. so why is it limited to plankton?", "label": 1}
{"text": "Ahhhh thanks brings me back", "label": 1}
{"text": "It is also believed to have a ring made of fruit", "label": 1}
{"text": "I want Zeno-sushi tho..What am I going to do with Xeno-plankton? Do I look like some kind of soft bodied invertebrate or a baleen mouthed ocean mammal to you?", "label": 1}
{"text": "Excuse you. How dare you age me like that!", "label": 1}
{"text": "The problem is you'll have to get through Reaver territory to get there.", "label": 1}
{"text": "I am sorry, my brother, but it seems time takes no prisoners. We are ageing.", "label": 1}
{"text": "It’s evidence, but not a guarantee.\n\nYou are right.", "label": 1}
{"text": "The point is we know what chemical reactions and environmental states it took to create our DNA could be far more common than not.  There aren't that many exotic components in DNA to begin with, they just need the right circumstances.", "label": 1}
{"text": "My thoughts would be that it wouldn't make that much of a splash hopefully because no one would be that surprised. It seems inevitable to me that there's life on other planets", "label": 1}
{"text": "Yea, I never disagreed with this.\n\nI was mostly talking about DNA vs other forms of genetic information storage.", "label": 1}
{"text": "Or chemosynthesis or something using heat as an energy source, like thermophiles, since light is less abundant iirc than geologically active locations", "label": 1}
{"text": "\"Another interesting aspect is Uranus’s atmosphere, which is rich in icy materials like water, ammonia, and methane\"... I'm a 40 years old kid.", "label": 1}
{"text": "Given the fact there hasn’t ever been an experimental replication of the primordial soup DNA emergence I don’t think it’s fair to say with certain that it can merely “appear anywhere given enough time”. Yes we are walking proof of concept but it’s one of life’s greatest mysteries as far as how it happened and whether it could again or we just so happen to be the .0000000000001%", "label": 1}
{"text": "I did, yes! Amazing show that has aged poorly in a couple respects.", "label": 1}
{"text": "We came within a hairs breadth of actual space cooperation with the USSR several times.  Even prior to Apollo-Soyuz.  Unfortunately stupid bullshit on one or the other end interfered every time.", "label": 1}
{"text": "Hey, I may have put on a bit of weight, but that's not a good reason for getting nasty", "label": 1}
{"text": "i will when theres concrete proof like how the US is funding the Israeli genocide of Palestinians", "label": 1}
{"text": "There are several possible explanations, including the ones you mention. The argument about interstellar travel being slow or expensive would be countered by pointing out that if there was even one expansionist space faring race, it could colonize the entire galaxy in a few million years, even without relativistic travel.\n\nThe point is that discovery of extraterrestrial life would reduce the strength of the arguments that we see no life due to life being rare or terrain life being first. All the other theorized explanations are still there.", "label": 1}
{"text": "Just wild theories but some of those things with the illusion would just piss me off. Because i am a person who doesn't like fake crap.", "label": 1}
{"text": "Even after all this time it is still too soon. 🥺🍃", "label": 1}
{"text": "There's probably a dozen+ bodies in our solar system that contain life. Us of course, Europa, Enceladus, mimas, Miranda, likely even places like Pluto, and for a wildcard: the moon\n\nLife on the moon would be underground, getting it's energy from a warm core and tidal forces. There are lava tubes all over the moon that are in the 60F temperature range. Places on the moon that you could exist in shorts and a T-shirt with a bit of added atmosphere.\n\nI'm confident that the universe is actually *teeming* with life. Our understanding of reality and biological processes increases every year, and I'm to the point where I no longer doubt the existence of life elsewhere, but *just how much* of our universe contains it.\n\nWherever life *can* exist, it *will*.", "label": 1}
{"text": "I have completed confidence that they'll find life on the other planets/moons in the solar system but it won't be the huge impactful thing it is until they find life in other solar systems, until that happens it will always be argued that life just came from earth and spread there.", "label": 1}
{"text": "Well then, I age to misbehave.", "label": 1}
{"text": "The only time I've been *shhhhh*'ed in the theater. I was... not ok.", "label": 1}
{"text": "I mean, I know what you’re saying but I’d say fire might have been slightly more impactful. ", "label": 1}
{"text": "Past 100 years? Dude, that is the underest statement ever. It will be the greatest discovery ever!", "label": 1}
{"text": "👏👏👏 Well played. Captain Mal would be proud. 😁", "label": 1}
{"text": "Imagine my horror when I couldn't post that exact gif as my comment.\n\nBoth comedically crippled, and also forced to acknowledge that my humour has devolved to basically using images. \n\nIt was a wild 23 seconds.", "label": 1}
{"text": "Well the you'll hate to hear the story about how I killed the ship who killed us. It's not very Christian.", "label": 1}
{"text": "I had the exact same experience before deciding to just post my comment! Lmao", "label": 1}
{"text": "It doesn't ever stop being too soon, just so you know. No matter how much time has passed.", "label": 1}
{"text": "Thank you, I …. kind of got that sense. <\\3", "label": 1}
{"text": "Nah mate it’s actually Optimus prime.", "label": 1}
{"text": "No shit. It’ll continue to change and over time our kids will see views similar to 2015. Nothing burger", "label": 1}
{"text": "I mean eventually. Some scientists would have leftover soy sauce or ketchup packets and put one and one together...\n\nDont tell me you never felt snacky before.", "label": 1}
{"text": "Who pissed in your wheaties?", "label": 1}
{"text": "Ummm invasive species much? You ever try to pass customs with fruit from another continent? No beuno.", "label": 1}
{"text": "Its on our To-Do list. We need people in power to make it happen.", "label": 1}
{"text": "I took a massive shit between his nothing burger buns", "label": 1}
{"text": "Technically correct! The best kind of correct.", "label": 1}
{"text": "15 years ago you would have needed a 500 dollar camera and another 2000 dollar lens for something like this", "label": 1}
{"text": "Yours does too. \n\n(This character limit is lame.)", "label": 1}
{"text": "After my kids are adults I’d definitely consider volunteering to eat space sushi", "label": 1}
{"text": "Hello u/Armand9x, your submission \"Our view of Saturn has changed over the years \" has been removed from r/space because:\n\n* If images are not OC please give proper credit to the original source/photographer.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 1}
{"text": "Past 100 years? It would be the biggest scientific find since the discovery of making fire. Or probably tied. Cause if plankton can be found on a small moon with no sunlight, then that means that other forms of life are out there, possibly more intelligent than our own", "label": 1}
{"text": "Yeah, but water is a great candidate for carbon based solvents. First its plentiful (Hydrogen being the most common element in the universe means all you need is Oxygen. Water is the most stable configuration with those two; there's a reason its one of the products of combustion). Second, water is polar while hydrocarbons tend to not be. You want your solvent to not be reacting with your  solute.", "label": 1}
{"text": "Life on another planet would be the greatest discovery in human history. ", "label": 1}
{"text": "Will also raise the scary question of why it's so quiet if so much life exists. \n\nThere could be some form of intellectual barrier we were lucky to break. \n\nOr there could be some alien super predators coming our way.", "label": 1}
{"text": "Hello u/Flubadubadubadub, your submission \"This engine twists space and stops time: The only solution to visit another galaxy\" has been removed from r/space because:\n\n* It has a sensationalised or misleading title.\n\n\n\nPlease read the rules in the sidebar and check r/space for duplicate submissions before posting.  If you have any questions about this removal please [message the r/space moderators](https://www.reddit.com/message/compose/?to=/r/space).  Thank you.", "label": 1}
{"text": "There were meteorites containing DNA that hit Earth not long ago so DNA is not Earth bound", "label": 1}
{"text": "I dont have anything to add except character limit hate", "label": 1}
{"text": "looks awesome man i really like it what phone is that", "label": 1}
{"text": "Also…what the fuck!", "label": 1}
{"text": "Agreed, instead of talking to me your time would be much better spent taking [3 seconds to google ](https://en.wikipedia.org/wiki/Budget_of_NASA)whether or not your comment is connected to reality in any way.", "label": 1}
{"text": "Seems I am right, you are awful.\n\nJust pointing at a Wikipedia article doesn’t prove your point. Do I need to remind you that a republican politician was head of NASA during Trumps administration? Even so, they slashed the outreach and education budget. [I feel like this article summarizes the trump administrations handling of NASA quite well.](https://www.theatlantic.com/science/archive/2017/05/trump-nasa-budget/527817/)\n\nNow that a nonpartisan is back in charge, republicans are dragging their feet on approving more funds. With fewer cuts hitting SpaceX, which invests most of its subsidies in a red state now. Curious, isn’t it?\n\nFor someone not from America I know way too much about your governments budget and the reasons behind it.", "label": 1}
{"text": "I never claimed any high ground, get off your high horse and wrestle in the mud with me >:)", "label": 1}
{"text": "> SpaceX is a private company. It will be interesting to see how you remove the owner of a private company.\n\nIt's called Lawfare. Trump org is a private company too but look at that debacle. He's banned from serving on the board of a public or private company until the appellate court overturns the Manhattan judge in charge of the case.\n\nOnly \"fraud\" case I've ever heard of where the victim formally testifies to the Court that they were not defrauded, and in-fact were repaid on schedule, yet here we are.", "label": 1}
{"text": "The though of that one made me cry a bunch as a kid", "label": 1}
{"text": "This is hard to use and really doesn't represent the activity and scope of the DSN.\n\nI much prefer NASA's official version that replicates the big screens in the Space Flight Operations Facility at JPL\n\nhttps://eyes.nasa.gov/apps/dsn-now/dsn.html", "label": 1}
{"text": "Visible only from southern Florida, the Carribiean, Central America and the northernmost countries of South America. \n\nCentral Florida (Tampa to Orlando to KSC) will see Saturn graze the lunar limb, everyone else will see Saturn close to the Moon", "label": 1}
{"text": "Weird that he didn't give it to daddy Vladdie first.", "label": 1}
{"text": "Yes, because China has never stolen technology before...", "label": 1}
{"text": "Why is this news? They steal everything and calls it \"Chinese ingenuity\". Which I suppose they're not wrong. Stealing IS their ingenuity lol", "label": 1}
{"text": "At this point, we should be asking what won’t China clone?", "label": 1}
{"text": "Are you new to earth? Live under a rock? Never see the light of day? China steals stuff all the time without a single fuck to give.", "label": 1}
{"text": "Long history of using other peoples design in space flight.", "label": 1}
{"text": "I mean they're very well educated so I assume they vote to the left", "label": 1}
{"text": "I think many citizens of other countries would gladly prefer this to their current regimes.", "label": 1}
{"text": "racism is american ingenuity i suppose", "label": 1}
{"text": "And a 1 party system with media controlled by 1 entity is better?", "label": 1}
{"text": "Is this racism? Are you saying China doesn't steal IP?", "label": 1}
{"text": "I can predict the answer to this.  There are certain talking points that get rolled out in hopes that nobody will realize that it isn't an actual defense.\n\n\"Well, such-and-such copied from China so this is just evening the score.\"", "label": 1}
{"text": "can you point to specifics in this case?", "label": 1}
{"text": "They do: \n\n> DS542: China — Certain Measures Concerning the Protection of Intellectual Property Rights\n\nhttps://www.wto.org/english/tratop_e/dispu_e/cases_e/ds542_e.htm", "label": 1}
{"text": "how to access a worm hole and travel through it", "label": 1}
{"text": "It's not news. It's a blog post of Chinese interior propaganda, mostly so people in forums like this subreddit can laugh at it.", "label": 1}
{"text": "Okay. Who said anything about America?", "label": 1}
{"text": "“Hey do you want to not be imprisoned by the Russians and still make rockets? Btw we are willing to overlook the whole SS membership thing.” \n\nYeah, stealing lol.", "label": 1}
{"text": "Human rights. Anti-slavery laws...", "label": 1}
{"text": "US Germany was in active war. Are you suggesting that the US and China should be in active war as well?", "label": 1}
{"text": "not American. And calling a thief a thief is not derogatory or defamatory, just the truth", "label": 1}
{"text": "calling racists racist is just the truth too i suppose", "label": 1}
{"text": "Not to mention the evangelicals", "label": 1}
{"text": "That's such an empty, literally unprovable statement. You might be wrong, or you might be right.", "label": 1}
{"text": "I'm certain there are countries I'm right about. Iran, North Korea, Somalia, South Sudan. \n\nIt's also not hard to prove. How many of our citizens, risk their lives, the lives of their families, and everything they have to try to sneak into those countries? Oh yeah, none.", "label": 1}
{"text": "And do you think the majority of the people of those countries love the American model, yet they just didn't install it in their own countries? \n\nThat's not how dictatorships work, the moment they lose the people, it's over. But alas...", "label": 1}
{"text": "So, if Trump guts NOAA do they just sell all of this off to the highest bidder? Does Musk just own the ability to predict the weather in the US?", "label": 1}
{"text": "“Hey do you wanna make rockets with us instead of the Russians? We’d both have you make rockets, but you’d be far more comfortable in our country.”", "label": 1}
{"text": "I mean, if they actually build it, then that absolutely is ingenuity. Certainly it means they have better engineering than most other rocket companies in the world", "label": 1}
{"text": "You're right.. most programs can't even put together two cans and make it look like a rocket.\n\nBut the part where they pass it off as their own creation like they do with everything else they steal, is a complete disgrace, and a slap in the face for those who spent endless hours to R&D the original product these thieves ripped off", "label": 1}
{"text": "Yes I'm sure those are legit surveys and not \"please don't murder me I'll say I love you guys\" answers.", "label": 1}
{"text": "Ah good old Reddit, why not paint the entire Chinese people as thieves and make it look like they're all proud of it. I'm proud of you redditor, normally people aren't this blatant with their bigotry", "label": 1}
{"text": "No but saying the only thing the Chinese can do is steal and saying that's their ingenuity is racism. Hope that helped (doubt it did since you're a racist but whatever, worth a try)", "label": 1}
{"text": "Edelman is a PR firm that supplies data like that to their clients. According to Wikipedia they had $1B+ revenue in 2022. They are based in the U.S.\n\nI am not sure you understand anything you are saying", "label": 1}
{"text": "Its one thing to build a jetliner based on the principles worked out by the Wright Brothers and quite another to sit outside the Wright Brothers garage peaking in and cranking out near carbon copies of whatever they are working on at the moment.", "label": 1}
{"text": "You can't criticize a country unless they're majority white, didn't you know?", "label": 1}
{"text": "They literally steal ideas from top to bottom. No ingenuity. What real technology inventions have come from China that rival the car, airplane,  battery, etc? \n\nPlease don’t mention fireworks lol. China works better as a country that has vast work ethic, but zero creativity. ", "label": 1}
{"text": "Mockery? And lol, we are not stealing space secrets from China. They copy everything we do. Maybe they eventually get the systems right to mass produce things better, but the original idea? Neeeeope they’re the kinda of IP theft because creativity is hard to maintain I. A country that absolutely stresses adherence to hierarchy and never questioning things. ", "label": 1}
{"text": "At least they’re right about one of those things.", "label": 1}
{"text": "Honestly so? The entirety of human development is based on evolving and copying previous designs. I find the value and morality of IP laws tenuous at best. The only thing that I'd agree with is protecting small innovators from big corporations but that's not the case here.", "label": 1}
{"text": "The person you are responding to did. Conversations evolve as they go along.", "label": 1}
{"text": "Hating? Or rightfully criticizing? No place is perfect and America only perseveres when we check its wrongs. The two party system is broken and the media conglomerates are very serious issues. It doesn’t need comparisons against other countries for big issues to get the attention they need.", "label": 1}
{"text": "Paper, Printing, Gunpowder, Compass, etc. It's not exactly hard to come up with many.", "label": 1}
{"text": "They might try to clone it but it'll only be fractionally as good. There's no way they know every detailed inner working to make it a decent rocket.", "label": 1}
{"text": "Paper and gunpowder lol. Yeah, we’re looking at an exact copy of a rocket that can land itself, but you reached back to give China credit for gunpowder. Okay aight, we’re done here. ", "label": 1}
{"text": "> They literally steal ideas from top to bottom. No ingenuity. What real technology inventions have come from China that rival the car, airplane,  battery, etc? \n\nAn American invented the first plane, a German invented the first car and an Italian invented the first battery.\n\nWhich nation hasn't 'stolen' ideas?\n\nWhat has China invented? \n\nPaper, printing, the compass, blast furnace, borehole drilling, cast iron, fishing reel, forensic entomology, gas lighting, the gear, gimbals, oil refining. Those just to name a few. You hand wave fireworks, but America wouldn't have their beloved guns without gunpowder.\n\nWe might not like China today but to think that modern society today isn't standing on the shoulders of Chinese invention, is just utterly ignorant.\n\nAnd no, I'm not Chinese, or even Asian. I just picked a few things from the Wiki page of Chinese inventions:\n\nhttps://en.wikipedia.org/wiki/List_of_Chinese_inventions", "label": 1}
{"text": "Saturn be like: \"Bonjour!\"", "label": 1}
{"text": "Person asks for significant inventions, I listed some.", "label": 1}
{"text": "That is all ancient China shit. They have been copying and stealing since probably 100 years. It's all this country knows and it is endorsed and encouraged.", "label": 1}
{"text": "Not invading all the countries surrounding it.", "label": 1}
{"text": "> You don’t notice a massive difference?\n\nWhich of these would we have without the Chinese inventions that came before it?", "label": 1}
{"text": "Because of the tyranny of the rocket equation and physics, it’s going to mean that rockets are going to look extremely similar, just as ship hulls look alike because of buoyancy and hydrodynamics. But it’s just galling how brazen China is about stealing/copying/duplicating western countries’ inventions. We don’t understand how China can feel pride in doing so, while China undoubtedly doesn’t understand what the big deal is.", "label": 1}
{"text": "> That is all ancient China shit. They have been copying and stealing since probably 100 years.\n\nAstonishing! Nobody is denying they are copying stuff today. I was responding to:\n\n> What real technology inventions have come from China that rival the car, airplane, battery, etc?\n\nThe answer is a load of stuff, without which, us in the west would never been able to get to the car, airplane and battery. We copied and stole for 1,000's of years.", "label": 1}
{"text": "Isn't slavery still legal in the US? You just have to put people of colour in prisons now instead of kidnapping them from Africa like the good old days.", "label": 1}
{"text": "As long as you are Han Chinese and keep your mouth shut.", "label": 1}
{"text": "Even at the conceptual stage this thing isn‘t a carbon copy, they plan to use expendable upper stages for one. Later we‘ll see what the finished product looks like, I‘m sure there will be significant differences from Starship. Why should they build something that‘s deliberately less optimized than what SpaceX is doing? They‘re not bound by patents or anything after all.", "label": 1}
{"text": "Which are all hundreds or thousands of years old. How about in this century?", "label": 1}
{"text": "IP laws are part of what spur inventions in the first place (at least, in modern times). Without it, why would a company or person bother putting so much time and energy into an invention knowing that straight away it can be copied and they will receive no compensation for it. \n\nBig pharma comes to mind, computers, software, heaps of things...", "label": 1}
{"text": "Well yes and no. Many of the things you mentioned were _first_ invented in China, but also invented somewhere else at another time, so it is not a strict line of copying.\n\nBut I do understand your sentiment.", "label": 1}
{"text": "You conveniently didn't scroll very far down that wiki page did you. \n\nI'm sure the company that has a long controversy section that is summarized by \"Edelman has a history of establishing astroturf campaigns (seemingly grassroots groups that are fronts for industry) for its clients\"  and includes doing PR work for Saudi Arabia is very very trustworthy.\n\n\n\"I am not sure you understand anything you are saying\"", "label": 1}
{"text": "... ... ... ... ... ... ... *brain explodes*", "label": 1}
{"text": "They still have a justice system.", "label": 1}
{"text": "Couldn't disagree more. \n\nI mean, if you want to completely change how society functions, we could discuss that, but given capitalism exists, people's ideas should be protected. Otherwise, if you have a great idea or design, some big company can just steal it, undercut you, and price you out. \n\nIdeas need to be protected.", "label": 1}
{"text": "Yeah but the two party corporate thing is pretty nice. You're basically talking about a descent into a one-party corrupt state.", "label": 1}
{"text": "I'm mocking because every time SpaceX does something China claims they're building the same thing, but they haven't actually built anything. I can open up blender and make a render of a rocket that looks suspiciously like Starship too, doesn't mean I have any ability to build it.", "label": 1}
{"text": "I wonder how that happened?  China is the home of \"we can steal your tech and do exactly the same as as you except cheaper\".", "label": 1}
{"text": "Basic rights, of course. Par for the course for china", "label": 1}
{"text": "i hope this is a /s if u think america has freedom of press and a proper democracy 💀", "label": 1}
{"text": "> Edit: I just realized the article didn't actually link any research, which is pretty bad. Anyway, here is a big white paper that outlines the science in question and includes links to many other papers.\n\nuhh... *What* whitepaper?", "label": 1}
{"text": "Hillary in jail might happen, if we're very lucky. She can room with Pelosi down the block from McConnell.", "label": 1}
{"text": "Show me journalists being jailed in the USA. Show me a taboo topic in the US like the 1989 Tiananmen massacre that they can't even look up. Show me protests and crackdowns similar to what's going on in Hong Kong. \n\n\nYou can't. State sanctioned censorship isn't happening in the US and you're a fool for even comparing the 2.\n\n\nRegardless, for all you could have known I was referring to Sweden, Spain, Japan, or Australia...all of which have higher liberties than the CCP police state 🤡.", "label": 1}
{"text": "Fuckit, I'll go for whatever party builds proper public transport infrastructure. ", "label": 1}
{"text": "Because there is a difference of using the ideas or even parts of other people's work, as opposed to an outright copy.  You can shit on SpaceX all you want, but it's very obvious that their rockets are not direct copies of other people's work, in the same way that an A320 is obviously not a rip-off of the Wright flier.\n\nIt's sad someone has to explain this.", "label": 1}
{"text": "Which is biased against black people \n\nhttps://library.harvard.edu/confronting-anti-black-racism/criminal-justice", "label": 1}
{"text": "Still not slavery, and now wed have to open this whole debate, in order to identify whether your over exaggeration can have a modicum of merit, because slavery does not exist in america. Lots of ways you could find some examples of it, or whatever, but slavery was being able to legally own humans, and do whatever you want with them.", "label": 1}
{"text": "So you can't show him journalists being jailed...  \nKent State is not comparable to Tiananmen Square (neither in situation or scale). Also, every kid learns about Kent State in school...   \nNot sure how poor foreign policy decisions is at all comparable to domestic ones.\n\nYou're grasping at straws in a way you wouldn't be able to domestically against the Chinese government.", "label": 1}
{"text": "Difference is Russia doesn't have to steal, elon and trump will wrap it as a gift for putin", "label": 1}
{"text": "You okay there. You went a little crazy with all the emojis and the ad hominem. I'm a lib? Pretty sure my voting record doesn't support that. Also, is calling out China make me a liberal? Liberals support Israel? Weird there's protests all over the US in support of Palestine...do you think 1) I attend those 2) China would support wide scale protests? \n\n\nSeems like I got the anti-westerner all in a tizzy.", "label": 1}
{"text": "Outlawed by the 14th Amendment, explicitly. Application of the amendment to strike down attempts to institute slavery by a different name were extensive in the period of Reconstruction, and continued through the Civil Rights movement and, to a lesser extent, continue even today. It's fairly apparent that Slavery is not popular or protected as an idea or practice, regardless of how it is described or named in the US.", "label": 1}
{"text": ">\tPrison labor is legal under the 13th Amendment to the U.S. Constitution, which prohibits slavery and involuntary servitude, except as punishment for a crime. Prison labor in the U.S. generates significant economic output.\n\nhttps://en.wikipedia.org/wiki/Penal_labor_in_the_United_States#:~:text=Prison%20labor%20is%20legal%20under,U.S.%20generates%20significant%20economic%20output.", "label": 1}
{"text": "Forced labor as punishment for a crime isn't slavery.", "label": 1}
{"text": "I'm not sure how you expect a Justice system to function without any sort of incarceration or involuntary detainment.\n\nNot all forms of forced behavior are slavery.", "label": 1}
{"text": "I didn’t ask if people liked it more, I asked if it was better and it’s objectively not", "label": 1}
{"text": "I don’t think you know what the word “objectively” means, ironically under a post with the only actual real data…", "label": 1}
{"text": "Compare basically almost any metric in the standards of quality of life between the US and China, the US will be better. Income, HDI, Healthcare, etc.", "label": 1}
{"text": "Elon gave it to China because he is a shit-weasel", "label": 1}
{"text": "Yeah I don’t think that this US company threatened to murder the random Chinese people they were surveying", "label": 1}
{"text": "Like life expectancy? https://qz.com/china-life-expectancy-exceeds-us-1849483265", "label": 1}
{"text": "Nation wide public transportation, wait shit that's America.", "label": 1}
{"text": "Yeahh the people conducting the survey were part of a U.S. PR firm… you sound heavily entrenched in propaganda to make a weird ass response like that", "label": 1}
{"text": "Being a client state to a country that's bombing and starving a civilian population.", "label": 1}
{"text": "They don't have the money for something like that right now.", "label": 1}
{"text": "Bruh, 13th amendment. Prison labor is a thing in like half the states.", "label": 1}
{"text": "They have a higher life expectancy because they are skinnier. It’s one of the very few metrics China is better it\n\nUS is higher\nhttps://en.m.wikipedia.org/wiki/List_of_countries_by_Human_Development_Index\n\nUS is higher\nhttps://en.m.wikipedia.org/wiki/Exchange_rate\n\nUS is higher\nhttps://en.m.wikipedia.org/wiki/Disposable_household_and_per_capita_income\n\nAnd since you want to bring up something as vague as “happiness”. The US is higher\nhttps://en.m.wikipedia.org/wiki/World_Happiness_Report", "label": 1}
{"text": "Fair points\n\nI would pay attention to any rate of change for some of those metrics. China was nowhere close to the U.S. just a decade or two ago in many regards; that can continue to shift", "label": 1}
{"text": "Brother I've BEEN to Tibet and have spoken with Tibetans. Don't say shit about propaganda to me. I'm the kind of guy who goes and sees it with my own two eyes and hears it with my own two ears. Someday when you can comment here without a VPN, you and I can have a chat about propaganda.", "label": 1}
{"text": "Rate of change cannot be used to definitely compare either because development is easier during the “developing country stage” due to diminishing returns afterwards. It could still provide some useful insights", "label": 1}
{"text": "Yo mama so fat, China won't clone her", "label": 1}
{"text": "As opposed to the ones supporting terrorism, child soldiers, and religious indoctrination... m'kay", "label": 1}
{"text": "Until it's through your house.", "label": 1}
{"text": "They also have full protection to speak out. Heck I can even call Xi Winnie the Pooh and \\*gasp\\* not get arrested for it.", "label": 1}
{"text": "At least China is doing the shot calling, while Israel is telling the US what to do, the power of foreign lobbyists.", "label": 1}
{"text": "Yeah but the guy they responded to didn't. Whataboutism anytime anyone points out China's domestic bullcrap.", "label": 1}
{"text": "When did China become a client state of Israel?", "label": 1}
{"text": "it is literal slavery. read the 13th amendment", "label": 1}
{"text": "yes it is, and the 13th amendment literally says it is", "label": 1}
{"text": "The topic is about things China doesn't have or isn't.", "label": 1}
{"text": "Tibet was free'd from theocratic chattel slavery by the PLA in the 50s", "label": 1}
{"text": "We'll see once today's election ends. Bibi has Biden by the balls unless Kamala wins and apathy from Trump and his evangelical donors if he wins.", "label": 1}
{"text": "All of them...? There's not a single component of the battery that was reliant on the inventions from 2,000 years ago you mentioned. That would be like an Italian trying to take credit for Archimede's inventions, only to be told by a chinese person that *they* actually have credit because \"China invented the gear\". Bullshit. \n\n  \nCall me back when China invents a technological marvel in the past 200 years. Something similar to the fucking gas-powered engine, or nuclear fission, or Western Medicine, things which all stand on their own. Western Medicine in particular, because it took decades longer for China to come onboard, but clearly you know which kinds of hospitals you prefer! Is that China's credit too?", "label": 1}
{"text": "Furthermore, China has almost no foreign policy sphere of influence. Comparing them to the US is ridiculous.", "label": 1}
{"text": "I mean, they listed \"printing\" as an example of their inventions. That's not printing. It's literally manual woodblock inking, which is one of the most painfully manual forms of printing ever existed. The funny thing about every single one of those inventions (paper, printing, the basic compass which is just a needle floating on water)...are all things I COULD DO TODAY. With my limited knowledge, I am pretty confident I could make every single thing u/BountyBob listed out as marvels of China (from 2,000 years ago). But the car? An airplane? A battery? I would love to see BountyBob even have a CLUE about how to start manufacturing ANY of those. BY the time China had learned to align the metal of a pin for the most basic compass, Archimedes was building the Antikythera and other ancient computers.", "label": 1}
{"text": "Why are you saying you'd love to see me manufacture these things? What does people inventing stuff have to do with me and my manufacturing abilities? I'm not claiming I can make any of these things. \n\nYou say can do these basic things today with your limited knowledge. Where did this knowledge come from? Did you discover everything from scratch or did you learn from the teachings of others? \n\nAll I'm pointing out is that China has invented things. Don't now why you're so triggered.", "label": 1}
{"text": "*Ancient China. Again, call me back when they make a tech marvel the whole world uses, within the last couple hundreds years please. Otherwise we’re comparing apples to oranges, and you’re using inventions from before archimedes. Go back far enough and all our ancestors are combined, hurr durrrr", "label": 1}
{"text": "> There's not a single component of the battery that was reliant on the inventions from 2,000 years ago you mentioned.\n\nHow do we get copper?", "label": 1}
{"text": "It's way more ridiculous that a small country is telling the US what to do.", "label": 1}
{"text": "Yeah typical reddit misplaced pedantism. \n\nMissing the forest for the trees just to clamour on top of it and claim its uselessness.", "label": 1}
{"text": "Nobody has denied that these things come from the past. The original post didn't put it into a limited time frame to suit the narrative. \n\n> Go back far enough and all our ancestors are combined, hurr durrrr\n\nIndeed. If only that shared history meant everyone could get along today.", "label": 1}
{"text": "your southern lost causer revisionism is horse hockey. they included involuntary servitude to also include the vestiges of slavery such as debt peonage. It's all the same clause, and \"except\" is being used as a conjunction referring to BOTH slavery and involuntary servitude as the same subject of the clause.", "label": 1}
{"text": "Some reading comprehension would reveal that I’m calling SpaceX a giant on whose shoulder CNSA is standing, just as Belotserkovskiy was a giant on whose shoulder SpaceX is standing.", "label": 1}
{"text": "> Some reading comprehension would reveal that I’m calling SpaceX a giant on whose shoulder CNSA is standing, \n\nLol, I understood what you wrote, but what you wrote is wrong.\n\nSpaceX is not wholesale copying entire rockets.  CNSA is attempting to do just that.  They're not standing on the shoulders of SpaceX, they're just attempting to steal the entire rocket.  As they do with many things across many industries.  They aren't innovating, they're just outright stealing.  Don't shill for the CCP, it's not a good look.", "label": 1}
{"text": ">why not paint the entire Chinese people as thieves and make it look like they're all proud of it\n\nNah, not the Chinese people. Just their government and any government affiliated companies (which is all of them), and those individual thieves that are happy and/or forced to do their dirty work, and those who defend their crimes.\n\nIf the product in question has software or IC in it somewhere, it was most likely stolen at one point", "label": 1}
{"text": "Stop playing word games, it is slavery. Even [California's constitutional amendment](https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202320240ACA8) uses the word slavery to describe 'involuntary servitude'", "label": 1}
{"text": "Uhhhh, hello??? Russia and Ukraine?", "label": 1}
{"text": "If this is reference to US Israel, what about China’s support for Russia.", "label": 1}
{"text": "There's a difference between knock offs and inspiration.  What is the value added for this Chinese rocket?  What does it do better, or significantly different than the Space X one?  If the answer is really nothing, then it's a knock off, not \"inspired by\".  You still have to stand on your own, even if you're standing on the shoulders of giants.", "label": 1}
{"text": "They did plan on that. Now its going to be fully reusable. Wonder what inspired them.", "label": 1}
{"text": "Is China a client state of Russia? Does it always listen to what Russia asks? Do Russians have a lobbying group in China to to fund the re-election campaigns of the Chinese Communist Party?", "label": 1}
{"text": "They plan on making it fully reuseable while retaining the option of an expensable upper stage for large payloads to high energy orbits. Which is not something spacex is currently doing and pretty smart in my opinion.", "label": 1}
{"text": "What a coincidence. So does Starship \n\n[https://forum.nasaspaceflight.com/index.php?topic=58204.0](https://forum.nasaspaceflight.com/index.php?topic=58204.0)\n\nIts like they're soulmates or something.", "label": 1}
{"text": "Ah so spacex eventually had the same idea, cool… not like it takes a genius to figure out. Look, obviously the current LM-9 concept is starship inspired, why should it not be? In order to surpass your enemy you first need to match their capability. It’s why the US and soviets copied the german V2 after WW2 before starting their own developments. What else would you do in their place?", "label": 1}
{"text": "Consider for a moment the number of species on Earth, with new discoveries of life still occurring. We are, unfortunately, so dismissive of the life that exists around us, that to automatically dismiss the potentiality of life elsewhere is pessimistic. However, until proven we do have to maintain a skepticism of life not of earth, while still being amazed of life that exists in places we find uninhabitable here.", "label": 1}
{"text": "There wasn’t chattel slavery in Tibet. Go ahead and cite an academic source for this slavery claim.\n\nFreeing also isn’t invading, annexing, and oppressing a country.", "label": 1}
{"text": "bro, Buddhism is one thing, Buddhists quite another. \n\n[Here](https://redsails.org/friendly-feudalism/) is an extensively sourced article detailing the pre communist Tibetan system. You're gonna have to refute the extensive bilbiography on this one, no copping out with ad hominems on the publisher or author.", "label": 1}
{"text": "Europa and Enceladus are also strong candidates.\n\n(In the oceans beneath the ice.)", "label": 1}
{"text": "Oh I'm sorry, is full reusability some sort of patented idea on a very costly project rather than just the ideal design? As if SpaceX isn't doing something that roscosmos and NASA absolutely would have loved to achieve had they had the technology.", "label": 1}
{"text": "A tiger would absolutely beat a koala in a cage match. Are you dumb?? Why on earth would you put your money on the koala?\n\nAnd don't act like you don't know what I'm talking about, conversations evolve as they go along.", "label": 1}
{"text": "Parenti is an academic but not in regard to Tibet. Go ahead and list his credentials related to Tibet. \n\nWe can ignore his inherent bias and that he had a conclusion made up before writing or researching anything else. But we can’t ignore the fact that he made basic mistakes that an undergraduate student wouldn’t make (origin of the Dalai Lama) or his sources relating to slavery.\n\nWhen he makes this slavery claim he can only relies on and cites two “Sources”: Gelders and Strong. They were some of the first foreigners in Tibet after China invaded. They were invited by the CCP as they were pro-CCP sympathizers and already showed their support beforehand. They knew nothing about Tibet and needed to use CCP approved guides for their choreographed trip. Strong was even an honourary member of the Red Guards and Mao considered her to be the western diplomat to the western world. There are reports of Tibetans being told what to say when Strong came. They aren’t regarded as credible or reliable and yet the only sources Parenti has for this slavery claim. \n\nWhat’s interesting is that Parenti doesn’t mention Alan Winington who was a communist and supporter of the CCP,  but maybe that’s because he makes no mention of slavery or the other supposed abuses that Gelders and Strong write about.\n\nParenti also cherry picked so badly from Goldstein that he dishonestly represents his work. But should we talk about what Goldstein writes on the matter?\n\nThere’s a reason why no one in this field takes this seriously. Go ahead and cite an academic source for this slavery claim.\n\nAgain, do you have an *academic* source? Seriously, go ahead and see what you can cite. Let’s take a look.", "label": 1}
{"text": "Well that's certainly quite the tangent. Well done.", "label": 1}
{"text": "He didn’t mean that small and regardless when you’re proven wrong don’t come crying to ne", "label": 1}
{"text": "The amount of hastily repackaged press releases missing a link to the preprint is too damn high!", "label": 1}
{"text": "Evolution, not tangent. \n\nBut thanks.", "label": 1}
{"text": "I prefer Cornflakes to Frosties.", "label": 1}
{"text": "Lmao, I have no sympathy for the confederacy. The North didn't go far enough.", "label": 1}
{"text": "Then who are we supposed to cry to?", "label": 1}
{"text": "Clearly not with the hopium billionaire tech cult", "label": 1}
{"text": "If we could solve one space mystery, I'd go for either proof of alien civilizations, and maybe warp drive, if possible, which I personally believe isn't.", "label": 1}
{"text": "And trump is also in contact with putin and want to betray our allies", "label": 1}
{"text": "Not every conversation needs to be an argument.", "label": 1}
{"text": "Ya, but knowing our luck with this monkey's paw timeline, we'll get our wish, and we get it because a hostile alien species showed up to plunder our resources and enslave us.", "label": 1}
{"text": "Being this smug and condescending when *you're* wrong is just embarrassing. The article itself and actual scientists list a black hole as a possibility. Whether this hypothetical object is a planet or black hole with 5-7x earth's mass, it would have the same amount of gravity.\n\nA black hole with that mass would have a radius of about 2 inches, so about tennis ball sized. Nobody said it had to be at least football sized. And even that tennis ball sized black hole would take ~6.78 x 10^52 years to evaporate. So about 68 thousand trillion trillion trillion trillion years. Not exactly \"very quickly\".\n\nIf it's a primordial black hole it must have formed very near the start of the universe. Since the big bang itself, about 0.000000000000000000000000000000000000000005% of it would have evaporated.", "label": 1}
{"text": "What an embarrassing look for you", "label": 1}
{"text": "Funny how the argument with wumaos always goes \"It's okay to invade and annex other countries when we do it because we make them better\". It's no different from Manifest Destiny that the Americans believed in the 1800s when they genocided the natives. If China wanted to actually free a nation of oppressed people, they wouldn't have gone on to oppress those same people themselves.", "label": 1}
{"text": "you snooty liberals are pathetic. I'm native american. these are not the same. Manifest destiny is a bourgeoisie myth https://www.marxists.org/archive/lenin/works/1914/self-det/", "label": 1}
{"text": ">Soon, the debate could be settled, once a new telescope capable of surveying the entire available sky every few nights comes online in late 2025.\n\nDidn't see much on what telescope, etc.", "label": 1}
{"text": "Lol this might actually happen now after last night's results. I want off this crazy timeline", "label": 1}
{"text": "It’s big. Like, REALLY big.", "label": 1}
{"text": " Do you realize the space industry kinda did better under Trump..?", "label": 1}
{"text": "From my understanding, weight savings from being able to remove the landing legs as well as placing all the shock absorbers in the tower instead. Having mechanical legs would face greater wear as well instead of having solid catch points.", "label": 1}
{"text": "I think we’re talking to a Madam Astronomer.", "label": 1}
{"text": "If you have only today realised that you should read beyond a headline and do your own research I can just imagine how you vote and make other important decisions.", "label": 1}
{"text": "Still not a single orbit or pound of cargo carried, it's a joke of a spacecraft. Thanks for blowing billions of tax payers money on catching a tube with a tower!", "label": 1}
{"text": "It's in development. And it's not blowing billions of tax payer dollars. It was largely funded internally by SpaceX.", "label": 1}
{"text": "I bet this flight would be pretty survivable as long and you can deship in time in the ocean.", "label": 1}
{"text": "The DC-X clipper never went close to orbit, also way not anywhere close to the size of starship.  DC-X was also planned to be a SSTO.  Also used hydrolox, not metholox.", "label": 1}
{"text": "SpaceX has taken 2.8 billion dollars already for its starship program: [https://www.usaspending.gov/award/CONT\\_AWD\\_80MSFC20C0034\\_8000\\_-NONE-\\_-NONE-](https://www.usaspending.gov/award/CONT_AWD_80MSFC20C0034_8000_-NONE-_-NONE-)", "label": 1}
{"text": "It's the concept that matters, it wasn't his. But all of you Musk fanboi's keep downvoting me, PLEASE... bring it. I revel in your hate.", "label": 1}
{"text": "No, that's not how it works you thunderf00t cultists. They were awarded a 2.8 Billion contract to develop the HLS Starship but the money from that award is paid out incrementally based on reaching various mile stones. They have not even been paid nearly that amount yet. \n\n\nIf you want to talk about wasted tax payers money, talk about SLS that was 6 years late and has cost tax payers 32 Billion USD built using 1970's technology. Or the Orion capauke that started development in 2006, has cost 30 Billion USD and STILL doesn't work as intended because of the faulty heat shield. Starship HLS could be fully developed today and it still wouldn't be able to land people on the Moon until late 2027 at absolute earliest because of the delays with Orion. Heck, the SLS launch tower alone has cost over 3 Billion USD and is years late. \n\n\nMeanwhile SpaceX has saved tax payers tens of billions of USD by making it so much cheaper to access space. Just a month ago they saved tax payers over 4 Billion dollars by offering an alternative to launch Europa Clipper instead of the SLS it was originally intended for.", "label": 1}
{"text": "Thankfully the corrupt bureaucracy is sidelined. Let’s make some progress!!", "label": 1}
{"text": "^Found the hateful extremist.", "label": 1}
{"text": "The DC-X wasn’t the first concept of a landing rocket…", "label": 1}
{"text": "No, the engineering is what matters. Anybody can have an idea. Making it work as intended in practice is what matters. DC-X was not even remotely close to being a booster for an orbital rocket like Falcon 9's reusable booster is, much less compared to Starship.", "label": 1}
{"text": "> He didn't invent EVs either.\n\nNo one claims he invented EVs though.", "label": 1}
{"text": "What does your Trump opposition have to do with anything? I never claimed otherwise. You said Trump doing favors for Elon was a good thing. I disagreed and then mocked Trump and Elon for their free market hypocrisy.", "label": 1}
{"text": "SLS had a goal of going around the moon unmanned, which it did. And like SpaceX they were awarded money for it.", "label": 1}
{"text": "And it was over half a decade late, cost tax payers 32 Billion USD just to develop with each launch costing 4 Billion, launching a capsule with a malfunctioning heat shield!", "label": 1}
{"text": "SLS is a launch vehicle, it doesn't go around the moon. Other vehicles with a custom kick stage could have done the same.\n\nAnd no SLS was not \"awarded money for it\". The money was funded outright with no required milestones to be met for funding to continue.", "label": 1}
{"text": "Probably because they don't listen to redditors in their 20's making stuff up in their echi chamber. One would think this election would make way for some self reflection...", "label": 1}
{"text": "> Every starlink sat has several cameras with live feeds.....\n\nHeavens, it's like his trash on the ground sporting wheels. Paranoid about someone vandalizing them?", "label": 1}
{"text": "Trump can flat out just tell him once he is in office.", "label": 1}
{"text": "I know I'm going to get banned which is fine but I fucking hate Musk. I want anything he owns to be on fire right now.", "label": 1}
{"text": "Wow. Someone hates Musk on Reddit. How original.", "label": 1}
{"text": "Wake me when it shows muskie boy shot into deep space for his behavior. Until then, I don't give a fuck", "label": 1}
{"text": "The fact that it's in such high demand shows just how valuable this tech is. We’re in for some amazing breakthroughs.", "label": 1}
{"text": "Gee, what happens when you launch a vicious terror raid against a much more powerful neighbor, grab a bunch of hostages, and then refuse to give them up and surrender? I can't imagine why things ended up this way! It's a total mystery!", "label": 1}
{"text": "trump elon and putin are basically a little clique of bffs who talk on the phone to each other more than teenagers", "label": 1}
{"text": "Remember when Biden had to twist Israel’s arm to turn the water supply back on? To keep Israel from genociding 8 million Gazan’s with thirst?", "label": 1}
{"text": "No, WE don't, Trump voters do.", "label": 1}
{"text": "Yeah, the pesky EPA, go have a glass of PTFE water then. Don't forget your Covid shot that Kennedy doesen't believe in. Better hope he's not in charge of public health. \n\nOh, that's right, trump continued air travel during the pandemic, drink your bleach.\n\nAt least we'll have rockets (but no EPA or public health services).", "label": 1}
{"text": "Build the dome !!\n\nMusk-Trump 2045", "label": 1}
{"text": "Well then you should explicitly say that, we'll have much larger problems in January than rockets. I'll upvote you.", "label": 1}
