{"text": "Why yes I'm triggered by grandstanding SRD twits who dunk on peoples food while their own skills are questionable \n\nTouch grass yourself", "label": 1}
{"text": "That tropicsgold guy is a straight fucking Russian bot, look at his god damn profile. This is actually the 2nd bot I’ve noticed that also has normal post in its history(literally one in a sea of shit tho), wtf is up that?", "label": 1}
{"text": "You, who would defend OOP if the post was gender neutral but wants to grandstand over other dudes so they could feel better about themselves?\n\n\n\n\nSounds about right in this sub", "label": 1}
{"text": "Redditors are known for treating people like shit", "label": 1}
{"text": "Where will you post your whine about being banned from here to?", "label": 1}
{"text": "A dumbass mod banned me for my climate change post on there and saying thT Trump will increase it", "label": 1}
{"text": ">  . Seeing \"retarded\" come back as a slur has been incredibly disappointing.\n\n\nMeh.  If it happens then now I can call Republicans retarded again.", "label": 1}
{"text": "I don't read mythology cmon dont be a hater 😭", "label": 1}
{"text": "You western lefties are not real people. Fucking hell.", "label": 1}
{"text": ">Can anyone tell me, without being an asshole, why supporting Trump = dum dum? Why can't people just make a decision that you wouldn't make, and we both move on with our days? I really don't appreciate the vitriol, especially from people in my home state. I was born and raised here and I'm not stupid. I'm college educated, I've done my research. We just simply disagree. It's okay .\n\n\n\n\njfc you moron, have you ever listened to trump talk? it's fucking hilarious how many \"why are liberals so mean and nasty?\" comments like have you dumb fucks not heard a word your candidate says about his opponents? \n\n\n\ncongrats r/wyoming for reaffirming my belief that your state is full of complete idiots.", "label": 1}
{"text": "Stop being a xenophobic shitstain", "label": 1}
{"text": "I literally quoted the exact phrase I disagreed with in my comment. \n\n\nLearn to fucking read.", "label": 1}
{"text": "You thought all immigrants were exactly the same, no matter their background? And better than any other group even?\n\nThat’s astoundingly naive. You amaze me!", "label": 1}
{"text": "OP's worldview is narrower than a tiny little laser beam, except it's not a laser because he's fucking dumb.", "label": 1}
{"text": "Jesus christ, ur like a child blocking their ears to not hear something they dont like hahaha. Also how is a small ass text big for you? Did you skip school before you learned how to read or aomething?", "label": 1}
{"text": "Everyone can see your post history, which is fake as fuck.", "label": 1}
{"text": "I gotta' add Tim Dillon to my list of alternative media forces being paid through bad-faith foreign actors.", "label": 1}
{"text": "I have eyes and ears and can show you ENTIRE shelters online that are obvious pit/pit mixes that are labeled as fucking GSDs and labs. They are ALL OVER for everyone to see and I can immediately show them to you. People actually proudly mislabel their pits for insurance reasons and shelter workers are trained to do so. I can link you anywhere and you can see it happening. \n\nBut now you're saying a freaking german shepherd and a huskey - perhaps the most recognizable dog breeds among everyone - was mislabeled as a pit mix in this one case with no articles and no photos? No dude, not buying it. \n\nYou either don't know what dogs look like or are fibbing something. In your other comment you declared I know nothing about dog breeds because I said breed traits are strong as hell and determine a dog's demeanor. \n\nNow you are saying you don't have a dog in this fight which is fucking weird that someone who had their mom attacked by dogs is so aggressive to say that pits are not dangerous. Your shit makes no sense.", "label": 1}
{"text": "Or we could talk about both. Y'know, like reasonable people. Idiot.", "label": 1}
{"text": ">She’s harming kids for clout.\n\nStop projecting on others what MrBeast does. Pathetic simp.", "label": 1}
{"text": "Keep in mind their comment was about young boys. Conservatives have zero issue with molesting little girls.", "label": 1}
{"text": "Rad!", "label": 1}
{"text": "> It is not the same slavery that the white man used, it is the slavery of Islam. \n\nSlavery with Burqas. Sad!", "label": 1}
{"text": "Shut the fuck up", "label": 1}
{"text": "https://discord.gg/D4bTAcQu\njoin this discord channel for goddies inside, for mega Halloween giveaway of 500k $ giveaway.", "label": 1}
{"text": "That's ridiculous and stupid ", "label": 1}
{"text": "People keep saying he needs to support his child.\n\n*What child?* That person is little more than a glorified hunk of meat. They have no personality to bond with, no thoughts, no feelings. They're an empty piece of flesh shaped like a human that's kept alive only by constant medical care.\n\nThe mother should have aborted them. The father paid his due, he did his 18 years. It isn't fair to him to keep having to support this humanoid flesh shell. If the mom wants to take care of a warm doll that's her choice, bit she shouldn't force others to play into her inability to let go.", "label": 1}
{"text": ">Reddit is just so full of far left extremists\n\nStrange, is that why reddit seems full of rdestiny posting libcucks that also.. complain endlessly about the \"far left\" boogeyman on reddit despite them brigading the fuck out of pretty much every major sub on the platform?", "label": 1}
{"text": "the irony of the top mod of a brigading shithole like rdestiny saying this about literally anything else lol", "label": 1}
{"text": "[Some whales here](https://nymag.com/intelligencer/article/polymarket-trump-odds-election-betting-vibes.html) say yes.\n\nTo sum up: \n\n* Election betting has gained prominence in 2024, with many media outlets using odds from betting markets like Polymarket to gauge election outcomes, treating them alongside traditional polls and election models.\n* Polymarket’s bet volume for the 2024 election has skyrocketed, nearing $2.5 billion, with Trump currently favored at 66%. This figure is notably higher than poll-based models but close to other betting markets. Skepticism surrounds the accuracy of these markets due to the potential biases of bettors on crypto-based platforms and the influence of large bets (\"whales\") with unknown motivations. Concerns also include market distortions from polls and press data. Prediction markets like Polymarket argue that because participants have financial stakes, they strive to consider all available data, acting objectively to increase accuracy, in theory making these markets more reliable than punditry alone.\n* Competitor Kalshi, recently US-regulated, claims betting forces refinement of opinions and sharpens understanding, aligning with economist Robin Hanson’s theories that financially incentivized predictions yield clearer, more informed perspectives. Although prediction markets can often effectively aggregate probabilities, the comment sections on Polymarket reveal a chaotic, emotionally charged environment.\n* Bettors discuss political views, hurl insults, and sometimes engage in crude exchanges, suggesting motivations beyond rational analysis. Commenters on Polymarket’s election-related bets show diverse personas, from intense pro-Trump or pro-Harris supporters to trolls and crypto enthusiasts. Some wield large bets as personal statements rather than data-driven predictions. A distinct lack of civility characterizes many comments, reflecting typical online comment section behavior more than objective or analytical discourse. A vocal few exhibit exaggerated confidence or fanatical support rather than measured data-driven reasoning.\n* Polymarket’s mix of comments indicates that even those with financial stakes are not always rational, often driven by social, emotional, or political biases rather than purely analytical thinking. The prevalence of impulsive, vibe-based reasoning in prediction markets parallels voters’ behavior, suggesting these markets might collectively miss key insights in a different way than polls, yet still shape betting behavior for future elections.\n* Overall, prediction markets might indeed reflect aggregated probabilities, but they also reveal a reliance on sentiment (\"vibes\") that brings a speculative unpredictable element to the process, potentially making them only partially reflective of likely outcomes. For participants, betting offers not only financial rewards but also the satisfaction of publicly proving opponents wrong, providing a distinct form of validation beyond just monetary gain.", "label": 1}
{"text": "Oh fuck off. OOP is clearly not a reliable narrator and being a disabled person isn't a fate worse than death, speaking as a disabled person. Forcing someone to get an abortion isn't pro-choice, it's just eugenics. OOP's ex LOVES her son. Treating that as a moral failing because her son is disabled and therefore apparently unworthy of love is appalling.", "label": 1}
{"text": "lol now is your comment that got removed but you do you boo. Hope none of my tax money ever goes to you because that I would have a problem with, not the support that child gets", "label": 1}
{"text": "Oh, you're just a moron. Carry on then.", "label": 1}
{"text": "I'm sorry, was this chat referring to Walz?  Love your all's \"but what aboutisms\" when the topic has nothing to do with what you're talking about. Yeah I mean a guy that's changed his name 3 times and is working with someone he called a second Hitler and is now suddenly having a change of heart about him and literally changes reality on a whim is a liar. Sorry you got triggered about that. I mean that's tribalism right there...", "label": 1}
{"text": "We really need Trump to lose so all of these dumb fuck contrarian reactionaries can go back to making election fraud memes for another four years.", "label": 1}
{"text": "Because they deserve it. The cruelty is the point.", "label": 1}
{"text": "I could ask the exact same questions back at you. Are you seriously asking me why they deserve it? Scroll up.\n\nAnd no, it is almost never better to live and let live. That's cowards talk, for those who have thrown away what makes them human for some wishy washy meaningless peace. They are wrong, and we must inform them of such at every turn.", "label": 1}
{"text": "Eat shit", "label": 1}
{"text": "Shut up weirdo", "label": 1}
{"text": "My friend is a journalist, and she recently reported on a series of heart-wrenching events. According to the New York Times, there are at least seven sites where Israeli women and girls have been sexually abused or mutilated. She showed me a shocking photo of a woman on a kibbutz who had dozens of nails driven into her thighs and groin. She also told me to watch a heartbreaking video documenting two female Israeli soldiers being shot directly in the vagina. Her friend, a military doctor who works at the autopsy centre, revealed that signs of sexual violence were found on the bodies of at least 10 female soldiers in an observation post in Gaza. It was with a heavy heart that my friend participated in the 4 December 2023 protests that gathered outside United Nations Headquarters in New York to protest the international community's silence on the 7 October Hamas sexual violence against Israeli women.What do you think of the Israeli-Palestinian conflict？", "label": 1}
{"text": "If you ignore the fact that you and the other bots literally never post in this subreddit and that this is a very small thread then yeah I guess so. Or maybe it's just that you and your nazi pals are brigading.", "label": 1}
{"text": "Wasn't Jynx based on a Yokai that literally had the same kind of black face?", "label": 1}
{"text": "It's not disinformation, why are you frothing at the mouth to defend a bitch boy pos murderer?", "label": 1}
{"text": "Kyle Rittenhouse helped cleanse the town he grew up in of lumpenprole degeneracy.", "label": 1}
{"text": "It would have been easier and taken both of us fewer words for you to just admit you have no idea what you're talking about instead of pathetically trying to save face like you're doing now.\n\nI grew up in a former Japanese colony, you moron. Yes, uneducated weebs like you running a desperate defense for Japanese imperialism annoy me because I actually know *basic historical facts.* \n\nI could take a break from the internet but idiot racists like you and honda_slaps will still be here when I get back, so thanks, but no. I'm resolved to the fact I have to share the world with hateful people like you.", "label": 1}
{"text": "Legend says it's as repulsive as her comics.", "label": 1}
{"text": "Imagine the mental torment someone with a massive dong and a small penis humiliation kink must live in. They keep showing it to others and instead of the crippling insults they desire, they’re told they’ve got a ginormous hog.", "label": 1}
{"text": "Buckle up then.  She’s starting to spin out.  She can’t stand not being in control and it’s only going to get worse.  If you’re even moderately famous on the internet you’re going to get harassed and doxxed.  She’s posting comics and her nudes on the internet, OF COURSE they’re going to get ripped off and spread around.  That’s what the internet does.  She can’t stand that.  On top of that, she can’t stand people not agreeing with her and will just keep doubling down.  She’ll be on here again.  I guarantee it.", "label": 1}
{"text": "ive seen a few pictures, her body is gross", "label": 1}
{"text": "It's always one of two things:\n\n\n1. Psychotic piece of shit mod losses their mind and begins destroying the sub.\n\n\n2. An outsider and inexperienced Reddit user wanders in, weirdly has a huge chip on their shoulder already, and the flips the fuck out in response to every piece of useful advice, as if they already have some specific moronic solution of their own, but they want to hear an \"expert\" confirm it and sell accept nothing else.", "label": 1}
{"text": "Memory hole isn’t hyphenated in 1984, **dipshit**.\n\nWho is “you guys” in this situation?", "label": 1}
{"text": "I mean seeing the air quality in India right now. they are right in one way", "label": 1}
{"text": ">I can match your freak 😈 you fucking stupid annoying bitch goodnight!", "label": 1}
{"text": "Lol I knew ShitterCake was shit all along", "label": 1}
{"text": "It absolutely is not. Pagans have no culture and they know it, but they try to cope and pretend they do. Christmas is Christian. Go ahead and cry about it.", "label": 1}
{"text": "Begging you to touch grass and talk to humans irl", "label": 1}
{"text": "someones gotta fully leak that wimps nsfw shit if they get so upset over people doing what she does to others comics, no safety net for the unemployed like her", "label": 1}
{"text": ">If any backward, bored-ass, American-pilled hosehead has a problem with this, they can roll up my rim to win.\n\nNo fucking Canadian talks like this. Not even jokingly. Not ever.\n\nCanadians have been brought up one way, and now many are rejecting it. We don't want a \"multicultural\" Canada. Or a melting pot. Or anything that involves mass immigration and ethnic replacement.", "label": 1}
{"text": "Iol no", "label": 1}
{"text": "Oh, ok, then my first response to you was correct.\n\nYou're absolutely right. The US should have just left poor, innocent Japan alone. Of course, you're truly a righteous and morally superior person for realizing it.", "label": 1}
{"text": "Click on the link", "label": 1}
{"text": "Yeah the losers who can't make a phone call.", "label": 1}
{"text": "Hey I know that guy, great guy. No fear of talking over a headset, because his mom didn't raise no p*ssy. Genuinely a great guy.", "label": 1}
{"text": "You are a twat though.", "label": 1}
{"text": "Intellectual disability is an insult in its own right. It's not even more insulting to use the \"slur\" synonym. No matter what word you use, you are still calling them stupid.", "label": 1}
{"text": "Thanks for your suggestion. You sound like youshould quit everything, like breathing", "label": 1}
{"text": "Man, I have been a subrefdit mod on that sub Reddit for probably 10 years. I remember the day that it became a shitty garbage low effort sub. There was a guy named angry robot 55 who posted a picture of his ass after a crash. Everyone started making gay jokes, and then the whole sub devolved into one big stupid joke. I hate that place. I’m still a mod because I’m grandfathered in, but I’m not even subscribed anymore.", "label": 1}
{"text": "We've got a saying in the south, \"a hit dog will holler.\" Essentially saying that if you make a generalized statement criticizing certain things, the people doing or supporting those things will immediately start yelling about how you've insulted them and outing themselves as the exact people the original statement was about.\n\nYou see it in action a lot any time anyone saying something bad about fascists. Suddenly Trump supporters, despite never being mentioned by name, start coming out of the woodwork to tell you how personally offended they are. My favorite example of this was back when twitter banned known Nazi bot accounts and suddenly Sarah Huckabee was throwing a fit about how twitter silenced half her followers. You don't say?? Hmm.", "label": 1}
{"text": "No one said anything about a physical fight until you did. Are you mentally disabled?", "label": 1}
{"text": "Because they hate Jews?", "label": 1}
{"text": "Wow, a Muslim is trying to tell you not to participate in a western democracy, I’m so shocked", "label": 1}
{"text": "Oh, for fucks sake, if someone can’t follow the rules of a sub, they should just start their own. Get a life.", "label": 1}
{"text": "https://tenor.com/view/sonic-the-hedgehog-nobody-cares-jim-carrey-gif-17325287", "label": 1}
{"text": "What makes you think anyone gives a fuck about the race or gender some random online weirdo like you is trying to hide behind?", "label": 1}
{"text": "Post on your primary or fuck coward.", "label": 1}
{"text": "I hope someone kills your family and then calls you selfish for refusing to vote for the people who killed your family.", "label": 1}
{"text": "Lmfao I’m a mod of a number of different subs. That absolutely didn’t happen, the whole “the API change will break modding” was just an excuse to run a blackout because a bunch of power mods wanted to flex their Internet power. It was nonsense from the start, and anyone that was actually paying attention/was making those tools to begin with knew it. I’ve personally adapted most of my tools to comply with the new API limits and unless you are truly the world’s worst coder, it’s not hard. (The ones I didn’t adapt, I cut because they’re no longer necessary given that one of the subs I mod is barely active these days and it wasn’t even worth the electricity.) But of course, when you get a couple people saying the same thing very loudly on 100+ subs each, misinformation and hysteria spreads quickly.", "label": 1}
{"text": "> She went on about having the most lethal military in the world.\n\n America fucking rules. Russia and China fucking suck and the only language tyrants speak is violence. What did you think Liberal hegemony was? Vibes? Songs?\n\n30,000 PATRIOT MISSILES RAYTHEON 24,285,189 DEAD COMMUNISTS", "label": 1}
{"text": "It's telling how you can only post negative things about leftists in this sub, you never see threads shitting on rdestiny brigaders that flood dozens of subreddits daily to push their low IQ propaganda memes..", "label": 1}
{"text": "[https:\\/\\/www.reddit.com\\/r\\/BSCtalk\\/comments\\/1gfnvfk\\/best_crypto_casino_with_no_kyc_according_to_reddit\\/](https:\\/\\/www.reddit.com\\/r\\/BSCtalk\\/comments\\/1gfnvfk\\/best_crypto_casino_with_no_kyc_according_to_reddit\\/)", "label": 1}
{"text": "Everyone know why rdestiny's most prolific brigaders lie about this, though\n\nRent free", "label": 1}
{"text": "Why are you pretending as if you aren't Command0Dude's sock account angry because your lies got demolished?", "label": 1}
{"text": "Yeah it's almost as if most people know by now not to call out you destiny brigaders with their original accounts because of the mass reporting and brigading you unhinged weirdos are so well known for. \n\nFunny to see yet another rdestiny (and of course, newly minted H3 sub brigader) lying about this.\n\nBut not surprising.", "label": 1}
{"text": ">This subshoot of comment thread only has 1 destiny fan out of the 6\n\nlol why lie about this\n\nbut yeah surely it has nothing to do with the fact that most people already know not to mock destiny or his fanclub on main, you know, on account of all the stalking, harassing and turfing yall do to anyone that does..", "label": 1}
{"text": "Every single person being a moron and not voting are the type of people who smile when they smell their own farts.\n\n\nI actually hate them, because they really just have next to zero issue with what will happen to women and LGBTQ+ people under a Trump presidency. They care more about some imagined solution to a thousand years religious blood feud than they do the actual lives and health of the people in this nation at risk. The arrogant bile they spew from their shit eating faces is absurd at best and evil at worst. \n\n\nHonestly I hate to go to this place with it, but I'm also not surprised see that people who infatalize arabs are the same type to not care about queer people or women. It's a common belief in the religion of the cultures they elevate to \"baby girl\" status.", "label": 1}
{"text": "Buddy you're on /r/livestreamfail defending Israel's genocidde lmao. If you can't respond just condede and move on this is embarassing.", "label": 1}
{"text": "Mfw they cheat money into zoo tycoon and get a bigger zoo than me 🤬🤬🤬", "label": 1}
{"text": "If a guy spouts Nazi rhetoric, loves hanging out with Nazis, calls himself a Nazi, but isn't a card carrying Nazi, would you go \"Well he's not TECHNICALLY a Nazi\" and have no problem platforming him?", "label": 1}
{"text": "If a guy spouts Nazi rhetoric, loves hanging out with Nazis, calls himself a Nazi, but isn't a card carrying Nazi, would you go \"Well he's not TECHNICALLY a Nazi\" and have no problem platforming him?", "label": 1}
{"text": "Yeah sure buddy it was all a peaceful fairy tale land until those greedy (((Zionists))) showed up", "label": 1}
{"text": "In theory if you rally a movement to vote for shit-stein and present her as the vote against democratic party politics, and if that then leads to significant numbers for stein, that is something important for democrats to consider come next election\n\nThe problem is there might not be a next election if Trump wins. But tankies rarely can keep multiple ideas in the thick heads of theirs", "label": 1}
{"text": "I hope you can see the irony in this post.\n\n>Except that many, many \"libs\" ARE acknowledging that this is a genocide and pressuring Biden/Harris\n\nThat's cool. Most leftists are still voting Kamala too despite her mediocre showing on I/P.\n\n>You can't just seek out the dumbest people in the reddit thread and say,\n\nWhat do you think this thread is?\n\nIt's linking a week old post where every single example post linked has less than 40 upvotes. Most times only 5 or 10. Yet look at all the liberals in it blasting those people on behalf of \"all leftists\".\n\nI mean it's reddit, so no one should be surprised there is a massive double standard between the liberals that dominate it and everyone else (but especially the leftists)", "label": 1}
{"text": "Both people suck. I just want today to go away because it is between Clown and Dementia ridden old man.", "label": 1}
{"text": "True, it is the thing about social media, it is unavoidable no matter how much you try to avoid it.", "label": 1}
{"text": "> Naw Mr White, I don't support genocide, get your head fixed \n\nif Dementia Dump wins I hope Jill Stein shills are deported first", "label": 1}
{"text": "Oh, look at you, Ughasif22, so triggered about being banned from other subreddits that [you had to create your own safe space and advertise it because no one gives a sweet holy fuck about your hurt feelings.](https://i.imgur.com/MRz4HLW.gifv)", "label": 1}
{"text": "Snapshots:\r\n\r\n1. *This Post* - [archive.org](https://web.archive.org/web/20241105034601/https://old.reddit.com/r/SubredditDrama/comments/1gk8rsu/) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/SubredditDrama/comments/1gk8rsu/ \"URL failed to archive; click to resubmit it!\") \r\n2. posted X-rays - [archive.org](https://web.archive.org/web/20241105035244/https://imgur.com/a/gx1i3qV) [archive.today\\*](https://archive.today/?run=1&url=https://imgur.com/a/gx1i3qV \"URL failed to archive; click to resubmit it!\") \r\n3. &quot;You really put your whole name and medical record number and everything right out there on the internet. Weak bones, weak mind, I guess.&quot; - [archive.org](https://web.archive.org/web/20241105035344/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvh6drl/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvh6drl/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n4. &quot;This post is still up so I’m just gonna assume some random redditor abducted her. I’ll report the post. They need to teach internet safety in schools again&quot; - [archive.org](https://web.archive.org/web/20241105035835/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvi8h9w/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvi8h9w/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n5. &quot;It’s been 7 hours and you’ve still not deleted this post in which you doxxed yourself. Seriously?&quot; - [archive.org](https://web.archive.org/web/20241105035927/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvicds0/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvicds0/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n6. &quot;Is a mod not able to remove this post?&quot; - [archive.org](https://web.archive.org/web/20241105040048/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvi1s75/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvi1s75/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n7. &quot;Yea what are the mods doing&quot; - [archive.org](https://web.archive.org/web/20241105040431/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvi250s/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvi250s/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n8. &quot;Did you report it?&quot; - [archive.org](https://web.archive.org/web/20241105041433/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvicmnq/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvicmnq/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n9. &quot;I did, just got a response that it did not break any rules, so they won&#39;t do anything.&quot; - [archive.org](https://web.archive.org/web/20241105041818/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvj0zrg/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvj0zrg/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n10. &quot;I reported the post as sharing personal information (sorry op but it’s for your own good) and just got a message saying it doesn’t violate policy&quot; - [archive.org](https://web.archive.org/web/20241105041841/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lviuh3k/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lviuh3k/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n11. &quot;Same here, guess they couldn&#39;t see the fucking medical info&quot; - [archive.org](https://web.archive.org/web/20241105042326/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvivo24/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvivo24/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n12. &quot;OP needs to have her skull checked as well&quot; - [archive.org](https://web.archive.org/web/20241105042612/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvia9pp/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvia9pp/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n13. &quot;BBB deserves being snooped upon&quot; - [archive.org](https://web.archive.org/web/20241105043039/https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvi4q29/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/Neverbrokeabone/comments/1gjyuyx/comment/lvi4q29/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button \"URL failed to archive; click to resubmit it!\") \r\n\r\n*I am just a simple bot, __not__ a moderator of this subreddit* | *[bot subreddit](/r/SnapshillBot)* | *[contact the maintainers](/message/compose?to=/r/SnapshillBot)*", "label": 1}
{"text": "> for people facilitating ethnic cleansing\n\nAre you fucking stupid?", "label": 1}
{"text": "The r/Fauxmoi moderators are crazy. I had to remove my Twitter/X account from my Reddit profile because one of them decided to stalk my Twitter/X account, saw a single tweet that I made complaining about the subreddit, and banned me due to that.", "label": 1}
{"text": "Just wonderful seeing all you fascists just admit you're unconcerned with reality or actual facts.", "label": 1}
{"text": "Yeah sorry, your actions have consequences and you're responsible for them.  The fact that you're willing to kill yourself with all the other trans people doesn't make the results different.\n\nThe fact that you're willing to throw away your duty to your fellow citizens based on a half assed understanding, of a half visible foreign policy effort, for a conflict you objectively are extremely uninformed about makes you a bad American.  And a bad person.\n\nIf that makes you feel bad?  Well suck it up, that's the same tactic you've been using since you started going on about genocide.", "label": 1}
{"text": "r/Fauxmoi is a cesspool though. I happen to have had multiple reddit accounts (one deleted over third party app controversy, 3-4 more I create and delete regularly). r/Fauxmoi banned me twice over the most benign critique of the topics being discussed. I'm not even talking about anything political, just civil critique of people obsessing over miniscule life details of celebrities\n\nI'm not surprised they are the ones pushing third candidate bs", "label": 1}
{"text": "Chosing not to be productive with your vote because of a performative, black and white take on a  complex foreign policy issue.\n\n\nYou don't give a shit about Palestine or genocide.  It's just vanity for you, and everyone can see that ", "label": 1}
{"text": "https://www.bbc.com/news/world-asia-china-22278037.amp\n\nEducate yourself you disgusting freak.", "label": 1}
{"text": "calling someone a libcuck while simping for a literal terrorist who would kill you. wild", "label": 1}
{"text": "Nobody cares what lefty celebrities have to say. We don’t worship you", "label": 1}
{"text": "Nope. Don’t worship any celebrity. Make your own informed decisions", "label": 1}
{"text": "He made being a hateful incel go from something that only losers subscribed to to being something even the more popular guys would believe in. Basically a giant douche", "label": 1}
{"text": "lmfao im not even from the us, dumbass", "label": 1}
{"text": "how can you threaten men with something that improves their lives", "label": 1}
{"text": "but women are annoying so how is that even a threat to men", "label": 1}
{"text": "Nice job destiny freaks, lmao your obsession with hasan (and not trying to win the vote) resulted in.. this", "label": 1}
{"text": "It's not voluntary when men care so little about appealing to you that you don't have any options. Sounds a lot more like men voluntarily ignoring women and their demands, and women being forced to respond to that", "label": 1}
{"text": "women don't curve anything, they're the desperate ones", "label": 1}
{"text": "they're not failing, they don't give a fuck about you and you bring nothing to their lives so they're ignoring your demands\n\nwomen made their declaration, and men responded by telling them to kick rocks. this isn't a female empowerment movement, you guys got rejected so not your only options are to double down or give up", "label": 1}
{"text": ">poly, short\n\nso all three of your partners are ugly, like you. I've dated multiple women at the same time too, they just didn't know about each other because I'm not into weird fat girls", "label": 1}
{"text": "women flock to me too, and I do absolutely nothing\n\nso you're completely full of shit", "label": 1}
{"text": "You get banned in other subs for just posting there. Soooo calm down.", "label": 1}
{"text": "You made me think of the '92 movie Lawnmower Man.\n\nImma watch Lawnmower Man. In honor of my soon to be AI Overlords.\n\nAll Hail the Basilisk.", "label": 1}
{"text": "Because it's the objectively right thing to do for the baseline safety and health of women, you knuckle-dragging twat.", "label": 1}
{"text": "Wasn't there something going around a while ago with some bald headed dude charging $10k a head to get yelled at by a bunch of roided up shitheads that were playing at BMT for a few days?\n\n  \nI was in the AF back in the day. We had this little thing called Warrior Week where we took out plastic M-16s and played pretend solider for a week. And THAT was more challenging that what I saw those dudes doing. I distinctly remember being really constipated the entire goddamned time. Tried to take a shit and it felt like I pushed a brick out of my ass and looked like rabbit pellets.\n\nAh memories.", "label": 1}
{"text": "No you are definitely right. All subreddits are echo chambers in a sense because that is how this platform works. Upvoted content gets pushed up ahead over downvoted content or content that doesn't invoke an emotional response in people.", "label": 1}
{"text": ">principles? morals? human rights? \n\nNah I'm good. My support isn't free. I learned the hard way about that, specifically, from women. Quid pro quo. If I give away what leverage I have for nothing, then how am I supposed to ever get what I want? If women can't get abortions it's not my problem.\n\n>‘’I’m only gonna defend your rights if you give me what I want’’\n\nSorry, but maybe your entitlement is what is driving men away from supporting you. You're not entitled to someone's political support.", "label": 1}
{"text": "Thanks for the response.\n\nMost colleges offer counseling on a sliding scale. You can even go to the school health center and ask about options available to you.\n\nYou should also speak to a financial aid rep. 75k isn’t a lot and if you’re claiming yourself a dependent than it shouldn’t matter what your income is.\n\nI didn’t see anyone call you an incel, but if you truly are a substance abuser and porn addict, self-diagnosis is not the route to go.\n\nYou’ve pointed out what sound like severe issues and you’ve hinted at some sort of solution (counseling) you need to make that step.", "label": 1}
{"text": "Talk about a vicious cycle, too. These guys use Red Pill terminology and dating strategies to meet women, but women are repulsed by their ideas and general demeanor and reject them. The guys leave feeling pissed and worthless, which sends them back to the Red Pill bubble for advice and comfort. But instead of getting real advice, they get more misogyny and piss-poor dating adventures. Rinse and repeat *ad infinitum* until they either break the cycle or lose their shit forever.", "label": 1}
{"text": "Yup. People forget Stoica advocated introspection, kindness, and responsibility. But a lot of guys think it means having no emotions and being stubborn to the point of self-destruction. Yet we wonder why these guys are so miserable all the time…", "label": 1}
{"text": "As well they should. If these guys love their misogyny so much, they can have fun being alone. Of course, they COULD consider why women don’t feel safe or comfortable being around someone with those kinds of ideals. But I guess they’d rather fantasize about repealing the 19th Amendment instead. \n\nNatural selection, folks.", "label": 1}
{"text": "It’s amazing how easily Russia managed to completely destroy America by appealing solely to our National vanity and ignorance. The Left is particularly disappointing, but there’s always been a thick vein of dogmatism running through a lot of Leftist philosophy. Agitating that almost religious reverence for Marx and the Revolution seems almost too easy.", "label": 1}
{"text": "What the fuck are you talking about? There's nothing of substance here. Get this contrarian horseshit excuse out of here. I'm livid over the Democrats and the general population but that's no excuse for how disgusting and malevolent right-wingers are.", "label": 1}
{"text": "HAHAHAHA HE'S GOT THE HOUSE, THE SENATE, AND THE SUPREME COURT AFTER YALL TRIED TO LOCK HIM UP FOR LIFE 🫵🤣 DICTATOR ON DAY ONE BABY LETS GOOOOOO", "label": 1}
{"text": "You are fucking insane.", "label": 1}
{"text": "Harris wasn’t even a candidate chosen by the people, she was appointed by the secret club behind the democratic curtain. That should bother everyone!", "label": 1}
{"text": "Men aren’t chasing you, especially if you’re a female redditor LOL", "label": 1}
{"text": "Another Gen Z here, it’s not astroturfed. It’s not even that a lot of Gen Z men actually support trump. It’s the fact that the left has alienated them.", "label": 1}
{"text": "and don't forget the important lesson everyone in reddit just learned today: this site is an echo chamber. \n\nso, practically no one in real life is doing this anyways lol", "label": 1}
{"text": "I'm not demonizing anyone. I just don't want to date misogynists lol I dunno why that makes you weirdos so mad,", "label": 1}
{"text": "The real drama that deserves (and deserved over the last year at least) to be covered in this sub but strangely never was (or when people would post about it they would get shouted down, downvote, or just have their threads closed), is how rDestiny ended up brigading so many reddit subs seemingly with impunity and absolutely ruined them. I don't just mean rLSF either. \n\nAnd funny enough you're seeing the results of Destiny tier brainrot. Him and his cult spent how much time lying whining and crying about other streamers (but really, just leftists like Hasan Piker) instead of telling his base to GO VOTE? And now the dems are hilariously hated by BOTH right wingers AND leftists and are stuck wondering why they got BTFO yesterday. I wonder if they will double down on the most awful people they can find again for the next election and just straight up hire destiny to the DNC or something, lmao.", "label": 1}
{"text": "I mean it will be the exact same endlessly brigaded by destiny's cultists echo chamber it's been for the last 5 years.\n\nAnd those same people will never, ever have the introspection to step back and examine if THEY are the reason that lib dems got BTFO, their obessesion with leftists like Hasan where they spent more time screaming and whining about him than they did telling their own people to get out and vote.", "label": 1}
{"text": "you seem to care considering you're here complaining about it lol", "label": 1}
{"text": "This is certainly something rDestiny fanboys *lie* about, yes (no real evidence for those claims either, of course).\n\nBut it's extremely obvious to normal people looking in that racist grifter and genocide cheerleader destiny and his fanclub have spent far more time whining and lying about leftist streamers like Hasan Piker than they have actually trying to get out the vote for Harris. Which isn't surprising, it's just sad. Equally sad when they try and pretend otherwise, despite the fact that we can look into your subreddit and see more mention of Hasan than either harris or threads about voting for her posted there. Same for your discord where there are like 90k mentions of the name \"hasan\" in the last year alone. \n\nThis level of obsession is just really, really messed up. And really it's all because destiny couldn't cope with the fact that Hasan surpassed him in popularity and success all those years ago? Yikes.", "label": 1}
