{"text": "No pain, no gains.", "label": 0}
{"text": "If you have a technique that works on making them come around and see Trump for the monster he is, I'd love to hear it (and see a link to it in action so I can study it).\n\nFrom my extensive experience, this is a cult and people who have been indoctrinated rarely leave willingly, sadly.", "label": 0}
{"text": ">Only problem, it's not horror. It's just a legal to watch snuff film.\n\nThis dude clearly never saw r-watchpeopledie or r-makemycoffin in their heydays.\n\nI watched ISIS and Mexican cartels execute people in HD quality video, I guarantee nothing in Terrifier reaches those levels.", "label": 0}
{"text": "Snapshots:\r\n\r\n1. *This Post* - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/diving/s/kHGjl5Lk7T \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/diving/s/kHGjl5Lk7T \"URL failed to archive; click to resubmit it!\") \r\n\r\n*I am just a simple bot, __not__ a moderator of this subreddit* | *[bot subreddit](/r/SnapshillBot)* | *[contact the maintainers](/message/compose?to=/r/SnapshillBot)*", "label": 0}
{"text": "i'm a sick fuck i like a quick fuck 🎶", "label": 0}
{"text": "The way the friend dies in Terrifyer 2? Nah, It deffo is horror gore terror porn or something like that.", "label": 0}
{"text": ">If someone pushes to make a situation involving an exchange of money illegal, if they get finessed, I think don’t think they should be shocked and legally, it’s in the best interest of the person who pushed for it to be illegal for it to get ignored, yes.\n\nDo you think sex workers don't suggest these actions? That they're just sitting there all prim and proper and perfect and pristine and then these dirty gross men come and offer the money?", "label": 0}
{"text": "I mean if we're playing word games, no one's ever proven innocent.  They're declared not guilty.", "label": 0}
{"text": "Yes, whether or not you have committed a crime is not dependent on whether you get caught and convicted. A high number of criminals never get caught.", "label": 0}
{"text": "Sex workers are not evil, they are victims. Men exploiting vulnerable women is evil. \n\nSex isn't \"icky\", rape is evil", "label": 0}
{"text": "Genuinely the only good men focused subreddit is r/menslib\n\nI have not found a single other good one, genuinely", "label": 0}
{"text": ">Go and rematch Mary Poppins pal.\n\n  \nWhy don't mind if I do! I've got 50 quid on the old gal!", "label": 0}
{"text": "Didn't have to look very deep, did you", "label": 0}
{"text": "I'll wager that a significant portion of the comments are bad-faith foreign actors.", "label": 0}
{"text": "As someone who isnt invested in this, all i have to say is\n\nA. There isnt any proof that she did it\n\nB. That’s still like… a weird thing to say tho, right? Am i not the only person that thinks that here?", "label": 0}
{"text": "It's weird that watchpeopledie got permabanned alongside the source of the trouble (liveleak) for the Chch shooting. When there were dozens of equally vile videos like that before including other mass shooters who livestreamed such as notorious incel Elliot Rodger, and the guy who shot up black people in that supermarket. The chch shooter and Elliot Rodger both wrote a manifesto as well, except one was sex related and one was race related.", "label": 0}
{"text": "Honestly, that sounds like it explains the wage gap, which is kind of the opposite of “debunk.”", "label": 0}
{"text": "As a guy, i agree. It’s really annoying that 90% of the time someone brings up our issues, its to “own da evil feminazis” or whatever", "label": 0}
{"text": "I would like to see one claim that she raped anyone.", "label": 0}
{"text": "people who have these kinds of opinions about feminism are usually telling on themselves. they just dont like women", "label": 0}
{"text": "I remember several years ago, there was a shelter for male survivors of domestic violence (in the UK I believe) that was at risk of shutting down due to lack of funds. \n\nDo you know who I saw promoting the fundraiser to keep that shelter open? Feminists.\n\nDid I see any of the \"but what about abused men?\" MRA types promoting the fundraiser? No, *not a single one*.", "label": 0}
{"text": "> Complaining about feminism as a guy is loser behavior.\n\n[I really like this picture.](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fthis-man-at-pakistans-womans-march-v0-lvpji5n6emrd1.png%3Fauto%3Dwebp%26s%3D507d79f9653236921a0e095ccb6e1c1b92c8e9fd&rdt=47590)", "label": 0}
{"text": "All of these mods need to lose their community. 🤨", "label": 0}
{"text": "First Aquaman, then it’s The Deep, and then there’s this. How many fish fucker are there?", "label": 0}
{"text": "Or because someone drugging and robbing someone is a legitimate thing to get upset about.", "label": 0}
{"text": "I think one of the problems is her fans and just a lot of women in general, won't admit she was cruddy for doing it. \n\nYeah the dudes were cruddy for robbing and killing too.", "label": 0}
{"text": "How is r/truetruecrime", "label": 0}
{"text": "You deserve to suffer to show you care? Thats a sad worldview. Despite what feminists tell you, no amount of self flagellation will ever make up for you being born as the bad gender.", "label": 0}
{"text": "True, but the one or two that occasionally appear in specific threads, particularly around election time, is I think pretty obvious.", "label": 0}
{"text": "He has said in interviews that he was going to kill Kim for kissing a bouncer but decided not to. \n\nThat's real life bro.", "label": 0}
{"text": "Also mansplain isn’t just a man explaining stuff or even e being condescending or talking down to a woman.\n\nIt requires the man to explain something so obvious that it’s extra condescending or something where the woman is more expert than the man", "label": 0}
{"text": "i think it’s everyone’s responsibility to try and fight against it, yeah. Nobody deserves blame for every bad thing. The patriarchy deserves blame, but it couldn’t hurt for some to say “I benefit from this system of privilege.” That’s pretty much all I mean by “social responsibility”", "label": 0}
{"text": "They’re anti-feminist.", "label": 0}
{"text": "Antifeminists seem to have an understanding of feminism about on par with what your understanding of Judaism would be if the only book you ever read on the topic was Mein Kampf.\n\nI've never in my entire life met an antifeminist who has a coherent definition of feminism that is congruent with what feminist philosophy actually espouses.", "label": 0}
{"text": "Eh, I wouldn't say \"vast majority\", though I acknowledge how difficult it is to get reliable numbers on this kind of thing. I've seen a number of authors that wrote futanari content come out as trans or non-binary after some time, with the explanation that they were using it to explore their own sexual and gender orientation.", "label": 0}
{"text": "You can see both sides of this rhetoric in this very thread. Feminists suggesting men dont need their own advocacy because feminism is a global force for peace and equality so you dont need anything else because we know what's best for everyone. And then practically in the same breath, claiming feminism doesn't owe men any help because men are the bad guys and they should have to struggle for equality the way women did and they should start their own movement", "label": 0}
{"text": "I’m not suffering, other people are suffering. I can either be complacent or acknowledge it. I get the privilege to even choose that.", "label": 0}
{"text": "Not at all. this is just you rationalizing your ick. \n\nIt’s like saying liking musicals is for homosexuals. ", "label": 0}
{"text": "Feminists do this with \"men\" and \"the patriarchy\" constantly. Is it cool when they do it?", "label": 0}
{"text": "No.", "label": 0}
{"text": "No, absolutely not.", "label": 0}
{"text": "Jealousy is a helluva drug.", "label": 0}
{"text": "Agreed. She also has a lot of very high-effort cosplays too. Though, I do question how much of those are AI-generated/assisted or *heavily* photoshopped to the point of looking AI-generated.", "label": 0}
{"text": "I agree with all of this. And if the message from feminists was \"examine your privelege and use it to help people\" i would take 0 issue with that. But thats never what feminists say is it? They say \"you CANT be a victim because you're a man and patriarchy is to blame\" or \"how can you deserve sympathy when your gender is the one causing every problem?\" Or \"hold ALL men accountable everytime a man kills or rapes\"", "label": 0}
{"text": "At some point it's a self-fulfilling prophecy no? Even a woman who didn't pick the bear would change her mind if she saw these guys still obsessing over a dead feminist meme months later.", "label": 0}
{"text": "There is a brand of feminism that promotes that narrative, yes. Pinkwashed feminism can be toxic, yes. Have you read any feminist literature?", "label": 0}
{"text": "I think social media has incentivized affirming our biases. It’s much safer to agree with a bland position that ‘feels’ like in something moral, and disagree with something that feels like it’s anti feminist (so therefore incel right wing reactionary misogynist, etc), instead of analyzing someone position in a vacuum. If I reframed it as “women should examine their sexism like men are asked to” and threw in something about how its the patriarchies fault they’ve internalized it or something like that I’d probably get upvoted. I feel validated you were seeing what I was saying. ", "label": 0}
{"text": "Many are not even Canadian, some are not even human: just AI-turbo boosted bots.", "label": 0}
{"text": "Ive read Bell Hooks. And im sick of the No True Scotsmen bullshit from defenders of feminism. If feminists are willing to entertain that rhetoric and never call it out, then as far as I'm concerned they condone it. Which is why their reputation has become so tarnished. They let the most hateful people drive the ship and push the narrative but when they're called out for it they just claim they can't be TRUE feminists.", "label": 0}
{"text": "Oh man, don't get Reddit gooners started on moths. There's a hundred page psychological horror moth lady hentai that circles around every now and then", "label": 0}
{"text": "Ok\n\nThe person I was talking to referred to “twink” as though it’s a neutral, non-sexualized term. They used it as an opposed example to “futa.” But it’s not, as you pointed out. \n\nTo be clear I don’t think either one is an acceptable thing to call someone who doesn’t want to be called that. \n\nI don’t really know if it’s offensive or not. Although as a queer person it does annoy me to hear self-back-patting straight “allies” throw it around all the time.", "label": 0}
{"text": "Im not saying they’re not true feminists, I’m saying that feminism isn’t a monolith and different brands of feminism are usually the most responsible for hateful rhetoric.", "label": 0}
{"text": "Unfortunately, these days chill means \"can have a conversation without foaming at the mouth.\"", "label": 0}
{"text": "Ok redditor", "label": 0}
{"text": "You might appreciate this other dream I had \n\n> I had this dream the other night where this evil criminal was sentenced to lobotomy. So I took his brain slice by slice and cut it out and analyzed it until he could get better. He was literally only head on a stool, after I got halfway through his brain I realized it still wasn't working and now he’s just a shell of himself but still in pain. I can't get his moans out of my head. No one should go through that. Some song came on and while I felt the urge to shut it off, i could tell it was soothing him somewhat so I let it play and continued my work, now feeling I’m no longer doing something morally just but continuing anyway\n\nIt made me wonder if it’s moral to ‘correct’ someone’s worldview if it brings them personal pain. I’m sure the religious dream was because I accidentally made a woman cry asking too many pointed questions about god like why would he create suffering? Tbf she was pursuing a PhD in the subject so I thought she might have answers. Anyway, I felt bad cuz she wasn’t preaching to me and I did feel I negatively affected her for no reason but to satiate my curiosity ", "label": 0}
{"text": "You can play dumb about it if you want, but it’s the truth. If that makes you feel defensive for some reason that’s your own problem to work out.", "label": 0}
{"text": "Just gave alot of people heart problems, doesn’t change the fact so many leftists calls trump supporters a cult all while they were acting cultish during covid", "label": 0}
{"text": "I personally love, how for 110% of these chuds, they decided to go all 'Uhm, Ackshully!! Bears are several hundred pounds killing machines! Silly females don't go in manly hunting sessions, they don't know what bears are capable of!'\n\n\nLike, bruh, we know what bears are", "label": 0}
{"text": "Ok... What does that have to do with anything?", "label": 0}
{"text": "Your description just makes it sound like over-moderation.", "label": 0}
{"text": "We are cute fuck you fite me", "label": 0}
{"text": "Yeah, it's not surprising that the kinda anti-feminist manosphere YouTube grifters turned those phrases into dirty words to ensure their target demographic kept getting angry over stupid shit and came back for their content.", "label": 0}
{"text": "Right? It's fascinating! I'm more into the relation and creation of various fetishes, but that still breaches into linguistics territory whenever new terms are made. What I've noticed in this area specifically is that both the old and new terms become separate tags in a way, where they now also tell you where the author stands on the issue and how it might affect their writing.", "label": 0}
{"text": "Oh shit. I now believe this 100%.", "label": 0}
{"text": "Didn't ask", "label": 0}
{"text": "im trans and have been out since 2014 and am super online and have literally never seen someone call a trans woman a futa before, idk. im sure someone has but its not exactly the most common slur used against us", "label": 0}
{"text": "This but unironically, there's some really amazing lectures about human sexuality in smut (aka lore): https://youtu.be/ZeqTn6bxnyU", "label": 0}
{"text": "That's not even getting around it. He said the line he wouldn't cross is \"***showing*** violence against children.\" Not implying it.", "label": 0}
{"text": "I voted.", "label": 0}
{"text": "You have seriously never seen critiques of liberal feminism, pop culture feminism, choice feminism, TERFs, or pink washing? I was just heavily criticized in a feminist sub for saying it’s not ok to masturbate to your female friends, where many of the users disagreed and said I was being excessive, to which I then conceded.   \n  \nevery sect of feminism has some toxicity, obviously. \n\nwhere is this enraging content you’re seeing", "label": 0}
{"text": "you are taking what I said to an extreme. I didn’t say that there aren’t toxic feminists in every sect, there are at least some. I said some areas are more toxic than others.", "label": 0}
{"text": "Not sure if I can comment since I'm involved in both subs, but the sub was taken over by Elne ", "label": 0}
{"text": "I had never heard of dropout before I saw it on this sub last week, but hearing that the dude from those old Mortal Kombat / Pokemon theme song videos is part of the drama makes me feel like it's 2008 or something", "label": 0}
{"text": "People need to understand that sexuality can be compartmentalized, and that what is or isn't in pornography should be universally extrapolated to justify ideas on any producer or gooners IRL politics/rules/desires.\n\nOne of the most common sexual fantasies (among women) is rape, but that doesn't mean any of them are pro-rape, or want to experience rape IRL, or even enjoy CNC.", "label": 0}
{"text": "But it’s not a slur, it’s just being misappropriated as one and by an extreme minority at that. In many cases it’s not even being used as a slur, it’s simply being used out of ignorance.\n\nYou are right to be offended but that doesn’t make it a slur.", "label": 0}
{"text": "yes, they do have a penchant of using it improperly “as a joke lol!” to make it sound worse than they are. \n\nBut I also see many many women use it improperly as a bludgeon to win arguments. \n\nI hope this doesn’t make me sound like some anti feminist or something. The problems behind those words are there but I’ve seen many people from both genders using it to push back against stuff that makes them uncomfortable", "label": 0}
{"text": "It is absolutely considered a slur by a majority of trans people. Saying it’s just being “misappropriated” is missing the point that it’s harmful regardless of the context it’s being used in. While it’s likely true that it’s more used out of ignorance, that doesn’t make it any less bad.", "label": 0}
{"text": "Okay, so if they can’t use the term in the text, title, or tags of a post, but can use it in a file, how are people going to avoid ending up blindsided with it in an audio?", "label": 0}
{"text": "An unfortunate consequence of actually allowing anything is you get a whole bunch of political shit and rightwing propaganda especially. Every now and then there's some interesting stuff worth discussing but man you gotta sift through some shit to find it.", "label": 0}
{"text": ">Very convenient position, “I want to be able to point out all the problems but it’s not my responsibility to fix them, that’s a males problem.” \n\nI am a guy. I don't understand what you mean here. \n\n>Do you take social responsibility for capitalism giving African countries predatory IMF loans? After all, you live in a capitalist society and closer to the top of the hierarchy than them in this unequal system so bear responsibility to fix the problem of neocolonialism \n\n\"Capitalism\" isn't giving anyone loans. Capitalism is an economic system, it's not a financial institution. I believe I am responsible for helping to fix the problems colonialism has caused in Africa though, yes. \n\nI do not know who kendi and diangelo are.", "label": 0}
{"text": "\\>This why you see so often feminists saying that they hate all CIS men  \nI don’t see this often, no.", "label": 0}
{"text": "I think in a very literal, denotative way, yes, it would violate consent. But in a connotative way? \n\nThe type of consent initially described, when broken, is rape. \n\nThe consent broken when a company intentionally misleads customers, while still illegal, is not rape, and I don't think there's any confusion about that there. \n\nThe consent broken when someone on GWA uses tags to mislead someone is absolutely a dick move and potentially a ban worthy action, but it isn't rape. And because the content is sexual, I think the use of the term consent does imply rape. \n\nIt's just a different degree of fucked up, and kind of a low one at that.", "label": 0}
{"text": ">You can fight for equality (or even equity as feminists prefer now) without being hateful and blaming people who have never discriminated against women or leveraged their inherent privelege in their entire life. \n\nIsn't that what I'm doing? Although I'll add that one of the properties of *inherent* privilege is that you don't need to actively leverage it, society does that for you.\n\nYou sound like you have deeper problems that you should discuss with something trained to handle that.", "label": 0}
{"text": ">Getting rid of it benefits the vast majority of people, regardless of gender.\n\nThis is not true. Getting rid of patriarchy will be a net negative for men. That's ok though.", "label": 0}
{"text": "Yeah, I forgot what subreddit I was in. I thought I was commenting on an OKbuddycinephile post.\n\nNobody should watch Salo.", "label": 0}
{"text": "This is one of the dumbest but most persistent myths perpetuated by that book. \n\nThere have been massive societal changes that led to a reduction in violence. It is not related to leaded gasoline. This is a classic \"correlation vs. causation\" issue.", "label": 0}
{"text": "However this IS reddit and you need to hit enter TWICE to create a linebreak (or hit space twice at the end of each line for single spacing)", "label": 0}
{"text": ">sure but the “complete exchange” was about a situation where someone kicked and spit on someone else\n\nNo, it wasn't, they literally just explained this to you:\n\n>What I said related to **the general trend** the first comment described, and the one the comment I responded to expanded on.", "label": 0}
{"text": "Hello! Thank you for your recent submission in SRD. You are receiving this message because your submission does not look like subreddit drama. We feature drama on reddit, and generally require a link to reddit itself or an archival site for approval. If you did include a link to reddit or a mirror of a reddit thread, please modmail us so we can fine-tune our bot.\nYou can delete and post again with the appropriate links to reddit. If your post features drama outside of reddit, post it to /r/InternetDrama instead.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SubredditDrama) if you have any questions or concerns.*", "label": 0}
{"text": "Like… if i was a famous celebrity i dont think i’d say that", "label": 0}
{"text": "Respectfully, that sub sucks. It feels like its 90% complaining or “debunking” feminism", "label": 0}
{"text": "The H word is a slur against intersex people. \n\nAltersex or salmancian are the preferred terms\n\nOther tags like \"dick growth\" or \"genital transformation\" could also be used \n\nI think audios containing slurs should be marked so people can choose to avoid them and yeah a lot of \"futa\" stuff Is really transmisogynistic and interphobic and fetishizing and a lot of people don't want to see that or be reminded that a lot of cis people equate trans women and femmes to \"a girl with a dick\" or some kind of sex object", "label": 0}
{"text": "You seem like a good dude, I think we’re having two different conversations. Kendi and diangelo are some of the intellectuals popular right now in academia who are seemingly beyond reproach, for example the redefinition of racism from personal prejudice to systemic imbalance of power. I noticed a lot of rhetoric here vocalizing those types of ideas which I find fairly harmful. Tbh most my beef is with those types of ‘intellectual thought leaders’ who’s ideas trickle into these spaces when people take a 101 course and think ‘it’s in the book so it must be right, I must educate people now’\n\nBut yeah I mean that’s fairly in the weeds. I generally agree with your position we are privileged and have it easier as men, and that equality is good and should be strived for", "label": 0}
{"text": "I wouldn't label futas cis, for the same reason they don't qualify as trans. They're like a third gender", "label": 0}
{"text": "Why am I wasting my time on a weird little troll", "label": 0}
{"text": "A satyr is from greek mythology and it's like a centaur but instead of half horse it's halg goat, also it's bipedal (only gets the hind legs of a goat with a human torso) and they usually have little goat horns on their forehead. They are often portrayed playing a panflute and are tricksters. The most famous historical satyr is Pan, a minor god in Greek mythology. Another famous example is Mr. Tumnus, the \"faun\" (satyr, really) from The Lion, The Witch, and The Wardrobe.", "label": 0}
{"text": "I think you made a theory and worked backward to make your case. I agree that a newer study would better support your claim.\n\nThe methods in the article you cited were largely in reviewing groups that were either already disputing paternity, or articles that didn't directly examine Parental Discrepancy. This also includes isolated and tribal groups.", "label": 0}
{"text": "True, though I feel there’s some legitimate debates there. Ironically a third wave criticism of 2nd wave is saying “why can’t I be a feminine girl? By being a ‘strong independent woman’ you’re assigning me a new gender role and norm to abide to. I say ironic as I feel the 4th wave have reverted back into that type of \nIf you’re not an ally, you’re an enemy betraying your own gender’ type of pitfall\n\nAnother interesting one I see coming back is whether sex porn is empowering to women or further entrenches women as a sex object and not a person ", "label": 0}
{"text": "I absolutely love Dropout but the conversations in both the main subreddit and the circlejerk subreddit are starting to get extremely volatile and ridiculous. I meant to post the thread where a hearing impaired person requested the consideration of more professionalism in the subtitles (shorter/less verbose to make it easier to read, and less subtitle-specific jokes that aren't actual subtitles).   \n  \nThe amount of drama that generated was phenomenal, and it spread across several different threads.", "label": 0}
{"text": "This, it stops people being able to screen it out and avoid that content", "label": 0}
{"text": "It would be very strange to me to say it detracts from women's pain and trauma to mention a woman that was victimized by another woman, so I don't understand the logic of saying the same thing in the case of men.", "label": 0}
{"text": "Following in case you get an answer I'm not too dense to figure out", "label": 0}
{"text": "\"I'm not your *friendo*, guy!\"", "label": 0}
{"text": ">It would be very strange to me to say it detracts from women's pain and trauma to mention a woman that was victimized by another woman, so I don't understand the logic of saying the same thing in the case of men.\n\nEach victim and case deserves their own spotlight. By lumping them altogether, you risk muddling the complex message and acting flippantly.", "label": 0}
{"text": ">>[Genital transformation]\n\n\"Puss-to change-o!\"", "label": 0}
{"text": "Calling a black person a spade is 100% a slur.  The word is not a slur, the garden implement is not a slur.\n\nA futa is not a trans person, calling a trans person futa is 100% a slur.", "label": 0}
{"text": "whats wrong with being a cis man, wow. \n\nI’m looking, can you give me a post when they a feminist has said this. I can’t find it, sorry.", "label": 0}
{"text": "White people sure do love to pontificate about black folks with zero facts at hand", "label": 0}
{"text": "Or just an older account doing a shit job of spamming links to their subreddit which was *just* banned, probably for reasons like this.", "label": 0}
{"text": "“Was going to” but.. didn’t. \n\n\nSo you have songs and thought crimes. Not admissions. \n\n\nSo… nothing?", "label": 0}
{"text": "Honest question, generally wishing to learn, what's the difference/significance?", "label": 0}
{"text": "He repeatedly claims to be a Psychiatrist lol sure buddy", "label": 0}
{"text": "[And, according to its \"banned\" message, it was banned two hours ago...](https://i.imgur.com/ZeroyOq.png)probably because the OP was going around to other subreddits to spam its existence to get more subscribers LMAO.", "label": 0}
{"text": "counterpoint: fuck mods 420", "label": 0}
{"text": "I felt this", "label": 0}
{"text": "The fact that Smosh has employees is blowing my mind even more haha", "label": 0}
{"text": "It seemed to reaaaally piss people off for some reason. I've honestly heard the complaint presented several times (in person) and while I have enjoyed the jokes (as someone with mostly decent hearing), I can absolutely see why they should remain professional. It's a basic level of trust and readability for those that can't passively hear on top of the subtitles. \n\nSeems like the threads have been cleaned up now, which is sad for drama purposes. \n\n[https://www.reddit.com/r/Dimension20/comments/1fl5ivk/bad\\_captions/](https://www.reddit.com/r/Dimension20/comments/1fl5ivk/bad_captions/)  \n[https://www.reddit.com/r/Dimension20/comments/1flhal4/why\\_was\\_the\\_thread\\_critiquing\\_the\\_subtitles\\_locked/](https://www.reddit.com/r/Dimension20/comments/1flhal4/why_was_the_thread_critiquing_the_subtitles_locked/)", "label": 0}
{"text": "Sauceless and unseasoned is the main problem here.\n\nLike, the basic elements here are okay I suppose...pasta, meat, and veggie (albeit just one, and not an interesting one either).\n\nBut this looks completely flavorless. It looks and probably tastes like a 7th grader's first time making a home cooked meal. \n\nI'd serve this to my five year old because she's in a bland foods stage right now, but that's about it.", "label": 0}
{"text": "i made weird meals like this a few times in my 20s when i was completely broke and had to just put together whatever was in the pantry.", "label": 0}
{"text": "I know the Expanse is not dedicated horror, but there was a scene in the last season where the prosthetic was so good that it apparently made one of the crew vomit during filming (and almost me, watching it when it came out lol). I saw some behind the scenes rehearsals and it was much lower stakes, but yeesh.", "label": 0}
{"text": "I mean, I agree that cooking is a useful skill to have, but taking issue with that in a subreddit called r/shittyfoodporn is impossible to justify", "label": 0}
{"text": "So, does every edible meal had to be a culinary masterpiece", "label": 0}
{"text": "Running it together makes it seems like it’s a discrete, separate noun that is different than a woman. Whereas with the space, trans woman is just telling you which kind of woman, the same way tall woman or American woman does.", "label": 0}
{"text": ">It's like how your dick needs lubricant - so does your oesophagus fuck hole. For the love of God learn how to make sauce.\n\n\n>>Oh damn, now i get it. Finally, someone is using terminology I understand. Thanks, mate.\n\n\nThat's certainly one way of communicating lol.\n\n\nThe people saying \"cooking is an essential skill\" aren't wrong but it's just shitty to attack the guy, when really he's having a \"today's lucky 10,000\" moment", "label": 0}
{"text": "There would be no drama in here if OP didn't mention a gf.\n\nMost reddittors ain't, hell most people ain't culinary geniuses, and sometimes you just make edible food which looks like shit", "label": 0}
{"text": "Do you make culinary masterpieces any time you wanna eat?", "label": 0}
{"text": "Honestly, you could make this meal work with just a can of tomato paste and a thing of McCormick Taco spice. Like, that wouldn't be how I'd ideally prep it, but just two things you can get at most supermarkets and you've turned it from 1950 British food to a palatable meal.", "label": 0}
{"text": "Every time a post comes up on Reddit about “my girlfriend cooks for me most of the time” it brings some real weirdos crawling out of the woodworks like silverfish in a library. \n\nYeah like people should learn to cook/bake for fucks sake but also if someone is apparently content to take the lion’s share of food duty then who fucking cares??", "label": 0}
{"text": "Lots of reasons including but not limited to\n\n'not being taught alot of life skills as a child'\n\nAs was mentioned .", "label": 0}
{"text": "Ahhhh, that makes sense! Thank you!", "label": 0}
{"text": "The best submissions to the sub aren't lazy leftovers slop, but people attempting to make things way above their skill level, or people making surrealist jello dishes from the 70s.", "label": 0}
{"text": "“50+ hours a day” Damn, relax a little!", "label": 0}
{"text": "Literally all it would take it pull that together is a bit of seasoning, and tossing with butter and leftover pasta water. Still probably wouldn't be good but it would be some kind of better.", "label": 0}
{"text": ">  a few times in my 20s\n\nOOP is approaching 40.", "label": 0}
{"text": "Do you think adding seasoning turns stuff into culinary masterpieces?", "label": 0}
{"text": "Ya, it looks like the kind of tasteless food they put you on in the hospital if you have high blood pressure.", "label": 0}
{"text": "The downside to having brains that naturally look for patterns is we find them where they don't exist. The \"manchild boyfriend\" trope exists, therefore this is that", "label": 0}
{"text": "I’m really confused about why people would go onto r/shittyfoodporn to yell at people for making shitty food.  What were they expecting?", "label": 0}
{"text": "I am not good at cooking, mainly because I don't like to cook.  I can do basics and I have a microwave.  Learning to cook is not a necessary life skill for most people.  Even when I was a broke college student I was still able to eat without doing much more than heating stuff up on the stove or microwave.", "label": 0}
{"text": "Sorry but the rest of that comment seems worth repeating \n\n\"I'm (late 30s) older than her (late 20s). So I tell her all the time she should get a younger partner (or two, a GF and a BF or whatever combination). Like she could have a younger GF herself. But she never listens to me.\"", "label": 0}
{"text": "50 hours in a day? Damn", "label": 0}
{"text": "The idea that seasoning your food and adding a bit of sauce = culinary masterpiece is wild.", "label": 0}
{"text": "Projecting insecurities onto others is the national pastime for Reddit", "label": 0}
{"text": "He's in his late thirties. He's been an adult longer than he was a child at this point.", "label": 0}
{"text": "There is so much space between this and a culinary masterpiece. At least have the self respect to put butter on it. Those noodles are dry as a bone.", "label": 0}
{"text": "Why is it a red flag to not like to cook? I fucking hate it most of the time.  I have plenty of other life skills I am great at and prefer to do.", "label": 0}
{"text": "Adderall is one hell of a drug.", "label": 0}
{"text": "If I give that to my 4 yo, he gives me the plate back", "label": 0}
{"text": "Again I ask, is every meal you make a culinary masterpiece you take few hours to make?", "label": 0}
{"text": "Be nice, he's British.", "label": 0}
{"text": "ADHD can be a reason it's *harder* to learn to cook but it's nowhere near an actual reason to be unable to cook in this day and age. The internet has infinite resources for both learning *or* for simply following basic instructions for simple meals that would require *nothing* other than basic reading and direction following. There are all sorts of physical and mental disabilities that make cooking harder but people still know they have to learn to do so.\n\nAlso OP is in his *late 30s*. No matter what he did or didnt learn as a child, he's had multiple decades to fix it since then.", "label": 0}
{"text": "Awesome! Never too late to learn", "label": 0}
{"text": "Idk man I'm from eastern europe, we use very little seasoning.", "label": 0}
{"text": ">How do you even get to this point of your life having never learned how to navigate a kitchen?\n\nBeing competent in the kitchen and making a culinary masterpiece are two different things.", "label": 0}
{"text": "OOP does not give the impression he has the willingness to learn.", "label": 0}
{"text": "It's weird how the same sub can flipflop around the same issue. People regularly celebrate dudes learning to cook even when the effort is mid. Which they should celebrate. But also, this meal isn't even that bad? Throw some salt and pepper and it's perfectly fine. Not anything special but pretty alright. I've eaten plain rice with a fried egg and some soy sauce or a spoonful of chili crisp. It's not any better than pasta with ground beef and corn but tastes fine ", "label": 0}
{"text": "It's not about seasoning fam, people shit on how his dish looks\n\nPeople who make similar stuff when they are making dinner for only themselves", "label": 0}
{"text": "I've met a lot of people who cannot food. Some people just don't have much interests in food. To them being full is enough. Also some people grew up without proper food so their taste are just off that leads to low interest in food also.", "label": 0}
{"text": "You got soft hands, bruther 💪👖🧰", "label": 0}
{"text": "In that case, I'd expect you to be more sympathetic to SPA's statement.", "label": 0}
{"text": "These comments are wild.  Some people simply aren't good cooks, or don't like to do it.  My boyfriend doesn't care that I don't like to cook.  There are things he's not good at which I do well.  No one needs to feel sorry for these people based on the info OOP provided.", "label": 0}
{"text": "I mean, I’m making Duck a L’Orange tomorrow for no reason other than I can. Some form of crème brûlée for dessert, caprese salad as an easy side and probably twice baked potatoes.\n\nI’m not professionally trained at all so just had two parents that taught their kids you have to fucking eat so you better be able to fucking cool.\n\nI meal prep on weekends so I can get a homemade meal on the table in 30minutes. It’s not hard.", "label": 0}
{"text": "yeah like it doesnt look perfect but its better than a *lot* of stuff ive seen some of my friends and family of the same age group make.", "label": 0}
{"text": "Who cares\n\nHave you ever made a quick meal shit for yourself?\n\nWould you even shit on the dude if he wouldn't have mentioned a gf?", "label": 0}
{"text": "I actually do go extra with everyday cooking, making everything from scratch etc. And I legit think the OOP is doing fine, today he learned about sauce! \n\n\nWhen I started getting into cooking in my late 30s I thought the people on Nailed It! were really good bakers. We all start somewhere! The hate towards OOP is stupid and misguided. ", "label": 0}
{"text": "Apologize", "label": 0}
{"text": "Again, you must never have made a quick shit looking dish for yourself?", "label": 0}
{"text": "No but I've never thought to substitute sauce for corn in my pasta.", "label": 0}
{"text": "Their source doesn’t even support their statement. \n\nI think this guy needs help.", "label": 0}
{"text": "There's absolutely nothing productive about criticizing somebody who's actively trying to improve themselves, regardless of when it's happening. It only serves to make the person criticizing feel better about themselves", "label": 0}
{"text": "A man in his late 30s who is obsessed with weed and can't make a decent meal?\n\nYes, I would. \n\n>Have you ever made a quick meal shit for yourself?\n\nI make quick meals all the time. I don't post on reddit to cry about how shitty my cooking skills are because my girlfriend who's a decade younger than me is out of town.", "label": 0}
{"text": "There would be 0 hate if he hadn't mentioned a gf, people here and in that post are just projecting", "label": 0}
{"text": "yeah my wife has adhd and she cooks amazingly. she gotta have her steps written down but still", "label": 0}
{"text": "haha this thread is so close to drama", "label": 0}
{"text": "Yeah the hardest part about cooking for me, as someone with ADHD, is just starting it and having to wait for it to cook and time everything right. Actually making good tasting food that also looks appealing isn’t hard.", "label": 0}
{"text": "You seem really triggered by this.\n\nMaybe you should cook a nice meal for yourself and go touch grass.", "label": 0}
{"text": ">If I was as in to smoking weed as you I'd want to learn how to cook a bit better, for the munchies. But it seems like smoking is all you care about, love that for you.\n\nI thought this might be like a puritanical take but nope OOPs comment history is a *lot* of weed lmao", "label": 0}
{"text": "Why are you running all over this thread to defend this random guy?", "label": 0}
{"text": "My wife was out of town and I got home late from playing hockey. I realized I forgot to go to the store, so I pan fried some salami to put in leftover mac and cheese and it was pretty lousy. It looked like shit and was so salty. Oh well, I was hungry so that was the solution.  I ate it and went to bed, didn't post about it and moved on with my life.  I do 98% of the cooking in the household, I'm not awful, but sometimes I am.", "label": 0}
{"text": "Lmao damn, what have they made?", "label": 0}
{"text": "Time to post this on r/SubredditDramaDrama.", "label": 0}
{"text": "You can teach yourself life skills at any time", "label": 0}
{"text": "most recently burnt and falling apart pot roast. in a slow cooker.", "label": 0}
{"text": "Unpopular opinion on this thread: Cooking is only a necessary skill if you’re the average/median person. It is not a basic life skill if you make a lot of money, or enough to eat out all the time and still save money for retirement/houses/etc.\n\nI see a lot of people saying not cooking is a red flag, haven’t lived in an area where the majority of people make a lot of money / dont cook.", "label": 0}
{"text": "I was thinking the same.\n\nThat dish looks alright. Plenty of seasoning would be enough to make it delicious.\n\nCooking doesn't have to be beautiful. The point is to make something one finds tasty.", "label": 0}
{"text": "> Just gave alot of people heart problems, \n\nYeah, and turned one guy into the Hulk!\n\n>doesn’t change the fact so many leftists calls trump supporters a cult all while they were acting cultish during covid\n\nHow were people acting cultist during Covid, as compared to how Trump supporters have been acting?", "label": 0}
{"text": "Today he learned about sauce. Why are you so negative about this?", "label": 0}
{"text": "Not being taught as a child is an excuse for not knowing something. But it’s not a justification for refusing to learn something as an adult. \n\n[It’s like people who lack basic geographical knowledge](https://youtu.be/kRh1zXFKC_o?si=mdQzzlVyu2nI_X0w) who try to defend their ignorance by saying “we weren’t taught this in school!”. Ok but if you’ve reached 40 and you’ve never had the basic intellectual curiosity to look at a map, that’s on you.", "label": 0}
{"text": "That's really something... Maybe a thin slice of it spread on bread would be okay, but a cake-sized slice would be repulsive.", "label": 0}
{"text": "Me reading this after having spent multiple hours slow braising short ribs on a bed of onions and garlic with apple cider vinegar and chicken stock", "label": 0}
{"text": "Ok now this is way more interesting than the food stuff. I really want to know more.", "label": 0}
{"text": "I saw this earlier and didn’t think it was even close to the worst thing I’ve seen on that sub just today alone 😭 I had no idea there was drama going on in the comments", "label": 0}
{"text": "OOP is actively not trying to improve and literally says he doesnt care to get better.\n\n>Maybe I'll do it the same way and just eat it again \\^\\^ works for me\n\n>No let's be honest, next time i'll just eat bread, which she does not like as much. Always a good spot for that.\n\n>But thanks.\n\nYou want for this to be like some poor tragic soul but it's just an almost 40 year old who smokes a shit ton of weed and cant cook.", "label": 0}
{"text": "I felt like such a dumbass when he explained it too. Like I’m telling him about how I put all my toys in the closet and a chair in front of the door and he was just like, yeah, no it was fine. So I over corrected by telling him it’s fine now and I can watch scary things. Which was supposed to be me saying I’ve seen the new Chucky stuff and he’s good in it but it came out like “I’m a big boy now and watch big boy things and don’t get scared or hide my toys.”", "label": 0}
{"text": "also moderator of a hentai subreddit, full of porn versions of other media... self-awareness has left the chat", "label": 0}
{"text": "These comments are full of privileged grandstading sed users\n\nImagine shaming someones food", "label": 0}
{"text": "I've definitely thrown stuff like that together when the cupboards are empty and I don't want to go to the shops. Maybe a couple of dashes of hot sauce and an egg or something would help it a bit.", "label": 0}
{"text": "I feel like it's one thing to chose to eat out all the time because you're wealthy and can afford it, but it's another to have to do it because you didn't develop the skills. \n\n\nYou never know what can happen in your life and its always good to have basic life skills to allow you to be independent", "label": 0}
{"text": "Based on what? Your ass?", "label": 0}
{"text": "Ahh... The life...", "label": 0}
{"text": "I think the biggest issue with not cooking is that it makes you rely on high sodium and heavily processed foods. Being able to saute vegetables or make sauce from scratch can be daunting, but it's easier to get fiber, vitamins, and less microplastics and preservatives.", "label": 0}
{"text": "Even then, you should probably just...not do that.", "label": 0}
{"text": "I'm not form western europe fam", "label": 0}
{"text": "> Based on what? \n\nHis comments.", "label": 0}
{"text": "But the “exchange” is this post, we’re we are talking about the linked video. The general trend is discussing the situation presented in the video. Let me know if you need any more reading help", "label": 0}
{"text": "Why not? The females have dicks.", "label": 0}
{"text": "Shaming someone for not having a skill when they're trying to acquire the skill is counter-productive and screams insecurities. Oh, you can make the mac&cheese off the box? Great, teach and encourage your fellow human on doing the same. Maybe, one day they'll surprise you with a soufflé instead of avoiding their fears of failure and never learning. \n\n\nI trained many girls and guys in the kitchen and never never never bashed them for the lack of knowledge if they showed interest. The apathetic and lazy I would not lift a finger for, but if you showed up with heart I had all the time the world for you.", "label": 0}
{"text": "I work full-time, have ADHD, \\*and\\* have a kid and yet I still managed to learn how to cook because I like eating and don't want to make someone else do a simple life task for me", "label": 0}
{"text": "Because shitting on peoples food making skills and ingredients that are available from them is a sign of privileged snob bulshitt", "label": 0}
{"text": "Burning something in a slow cooker sure is a talent.", "label": 0}
{"text": "I don't \"want\" it to be anything, calm down. I'm sorry I didn't read everything lol", "label": 0}
{"text": "Shoot, he tried. He can learn from his mistake and do better the next time. People just want to criticize.", "label": 0}
{"text": "3) she did also do something wrong and has never apologized or even paid money to an org. \n\n4.)She's famous and politically active and has a son. \n\n>The victim here is unknown, and not related to your own personal trauma.\n\nI'm not sure why that matters to men who have been Violated and told it doesn't matter. \n\n>I understand the logic, I think we all heard it often enough in the Depp-Heard trial\n\nIt's the same logic for why \"are we dating the same guy\" groups exist. It's also the cause of men's negative experiences in dv shelters and services made for women. It's also one of the reasons why people excuse female rapists. It's the logic for choosing the bear.", "label": 0}
{"text": "And I at one point of my life eaten stray animals\n\nSo maybe that's why I don't sound like a douchebag and make fun of people's culinary skills", "label": 0}
{"text": "Soup fan?", "label": 0}
{"text": "> Have you ever made a quick meal shit for yourself?\n\nYeah, like carbonara, puttanesca, a fry up, or hot and sour soup. Not *that*.", "label": 0}
{"text": "Same, I like the results but cooking itself is miserable, I tend to cook large batches so I can avoid doing it too much.", "label": 0}
{"text": "No, I do make tasty cheburek", "label": 0}
{"text": "How long does it take for you to add butter to noodles?", "label": 0}
{"text": "They post them in subs that are meant for femboy porn I fail to see the hypocrisy or irony of that.\n\nArnt there plenty of cosplay porn subs she can post her \"altered\" character cosplay instead of in the main sub?", "label": 0}
{"text": "I work full time, have TWO kids, a college degree, and  I've lost 20lbs this year, and I still never fully learned how to cook until a few years ago because I never managed to get around to it between work, family,and therapy, so save the self-congratulations. 👍", "label": 0}
{"text": "Please point me to a single comment he made that demonstrates either a desire to learn, or him learning anything at all from the feedback people gave him.\n\n> Today he learned about sauce.\n\nHe didn't learn shit, he already knew about the existence of sauce. Per his comments.\n\n\n\n>Why are you so negative about this?\n\nCommon misconception. It's actually spelled \"realistic\".\n\nBased on his comments, OOP seems like a slacker who lacks basic life skills, and has no desire to learn.", "label": 0}
{"text": "Must be nice to have those available and that you can buy those ingredients", "label": 0}
{"text": "Its the piped mustard frosting that gets me every time.", "label": 0}
{"text": "> cheburek \n\nGesundheit.", "label": 0}
{"text": "Not liking and not being able to are completely different things though. \n\nA man in his 30s shouldn't have to rely on fast food or a girlfriend to feed himself.", "label": 0}
{"text": ">1950 British food \n\nOh come on. In 1950s Britain, pasta was an exotic novelty food. This would be much more likely to be served on a bed of potatoes and boiled cabbage.", "label": 0}
{"text": "Naw see people will say that's different because it's \"asian inspired\". If OP added chili crisp or soy like you, the sub would probably have reacted a bit more positive", "label": 0}
{"text": "So you’re now resorting to tu quoque, acknowledging your own flaws with you argument while presenting that mine are ostensibly worse. I’m not attempting to hold you to a high standard by simply requesting that you substantiate your claim. I will substantiate my own if you ever request that I do so. I \n\n  \nYou provide a scathing remark about fallacies while relying on several of your own. The most detrimental to your argument being a hasty generalization, which cannot be substantiated. you are lumping me in with all other feminists, assuming that I have engaged in this conversation about men supposedly being trash despite me never thinking this to be the case. Then you create your own straw man of feminist arguments, reducing complex feminist positions to \"pithy comments about how men are trash and the cause of the worlds problems.\" \n\n\n\nyou are already being quite passionate and direct in your argumentation, which I have ignored because you seem to be coming from a place of genuine frustration. So I’m not going to use that against you. I do think you are mischaracterizing feminism as heavily hateful and bigoted when it is not, which is my main issue. I’m not refusing to notice hateful rhetoric. I’m barely even in the thread at all. I will look it over again and see where the issues you are pointing out are. thank you for calling it to my attention.", "label": 0}
{"text": "Well, on the one hand…. But then again, on the other…", "label": 0}
{"text": ">It's like how your dick needs lubricant - so does your oesophagus fuck hole. For the love of God learn how to make sauce.\n\n\n>>[OP] Oh damn, now i get it. Finally, someone is using terminology I understand. Thanks, mate.", "label": 0}
{"text": "I admire your unrelenting optimism", "label": 0}
{"text": "It’s very clearly ground beef. \n\nThe issue is that buddy was just missing some sauce. If he had just put sauce on it, then it would have been an okay enough meal.", "label": 0}
{"text": "You would think if you don't know what you're doing you'd follow a recipe, which would tell you put water in it.\n\nBut r/ididnthaveeggs proves that no such common sense should be assumed.", "label": 0}
{"text": ">  I still think about bologna cake\n\nLet's not be too hasty here.", "label": 0}
{"text": "fr, I think that's what some people ITT are missing. If you have any level of cooking knowledge at all you can turn this incredibly basic and simple and easy meal into one which tastes a thousand times better for, like, one minute's extra work. That's how OOP is telling on himself.", "label": 0}
{"text": "https://www.merriam-webster.com/dictionary/sarcasm", "label": 0}
{"text": "For decades the \"No Stairway, denied\" joke in *Wayne's World* made no sense because they didn't get the rights to the song for home video and inserted a guitar screech instead. I was confused for a good chunk of the '90s because I remembered hearing the opening to *Stairway to Heaven* when I saw it in theaters.\n\nThen the Internet came along and it was explained and I felt a little less crazy.", "label": 0}
{"text": "See, this is exactly the kind of negativity I'm talking about. Why are you so eager to see the worst in everyone?", "label": 0}
{"text": "I'm now imagining OOP as a that lady from Downtown Abbey that can't hear milk on a stove.", "label": 0}
{"text": "What, being able to buy eggs, cheese, bacon and tomatoes? I am genuinely glad that I don't have to worry about buying those ingredients, but I don't think most other people have to worry about buying those ingredients either. Plus, OP usually gets fast food. We know he's got the money.", "label": 0}
{"text": "I think that is a fallacious assertion. you are assuming that the same men responsible for this are the ones complaining in the thread, which detracts from your argument as it generalizes too broadly.", "label": 0}
{"text": ">Well, on the one hand…. But then again, on the other… Hm.\n\n\n\nYou're thinking about chocolate cake, aren't you.", "label": 0}
{"text": "I fail to understand the issue, he made shitty looking quick dish edible for him\n\nWhy grandstand over his cooking skills or ingredients available for him", "label": 0}
{"text": "idk, I think \"gotta use these ingredients before they go back\" is a fine reason to cook?", "label": 0}
{"text": "Reminds me of some friends when I was in my early 20s. I remember one time a friend was getting dumped and his girlfriend said he was addicted to weed, his rebuttal was that weed wasn't addictive. It did not save the relationship.", "label": 0}
{"text": "> drizzle some olive oil or even drop some butter on that bad boy, add some parm or other cheese, it's fine.\n\nHell, just add a bit of feta and oregano salad dressing and you have a nice little knockoff Greek salad.", "label": 0}
{"text": "Aside from the seasoning/saucing other people mentioned, I'd put money on the pasta and meat being overcooked. So it's a bland mush.", "label": 0}
{"text": "Good for you 🎖️", "label": 0}
{"text": "Brain damage sufferer here: I can cook\n\n\nI'm not allowed boiling water, as I have no control over my muscles, but I can cook\n\n\nEven better, with my countertop toaster over, so I don't have to use my system of chairs to put stuff in oven\n\n\nI actually make really good baked chicken \n\n\nI can't do recipes (I have to be physically walked through them to put it into muscle memory, my brain can't process parts), but once it's in my muscles, I'm pretty good \n\n\nOnce you give me cut ingredients and our genre of spices, I'm pretty good \n\n\nMy family loves my eggs. My Alfredo is the best, if they're around to do the noodles for me\n\n\nI will never understand,  how people who have the capabilities I would KILL for, don't feel ungodly ashamed that I can do more than they can", "label": 0}
{"text": "To allow \\[RAPE\\] as a tag necessarily precludes banning ANY tags at all. It seems obvious that if rape isn't triggering the millions of rape victims, then there's literally no tag that should be banned.", "label": 0}
{"text": "I'm in awe. Thanks for sharing that", "label": 0}
{"text": "Or cheese sauce and you have some beefy mac and cheese.  Heck add some gravy and you'd be most of the way to beef stroganoff. \n\nAlthough adding corn to pasta is a bit weird though.", "label": 0}
{"text": ">  that's like saying I cooked ramen last night \n\nAnd I'm proud of you for doing so.", "label": 0}
{"text": "I enjoy cooking. I enjoy trying new things when cooking. I taste at every step, and I have enough experience that I can usually salvage something if it's going the wrong way.\n\nThat said, sometimes I just make boxed mac and cheese and dump a can of tuna in it and call it a meal because I'm exhausted from work.", "label": 0}
{"text": "I saw that post and scrolled by thinking \"it just looks like you needed to butter the noodles and put either parmesean cheese or pesto on it.\"", "label": 0}
{"text": "We season our food and add sauces, damn it. We invented a bunch of sauces! Worcester, ketchup, Oxford, brown, piccalilli, English mustard, mint sauce!", "label": 0}
{"text": "I think only wanting to eat plain (possibly buttered) pasta noodles is something most kids seem to do.  \n\nMy wife will still prefer to have her sauce in a little bowl on the side to dip her pasta in.", "label": 0}
{"text": "Productive isn't the point of this thread \n\nSounding like a privileged douche and grandstanding over poor culinary skills of others so you can feel better about yourself is", "label": 0}
{"text": "In my country is rare that a father gets full custody.", "label": 0}
{"text": "Did you read his post about how his solution to not relying on his girlfriend to cook all the time is fast food? \n\nRather than, well learning to cook? It’s a basic life skill a man in his 30s should have.", "label": 0}
{"text": "Yeah I didn't read the whole thing so I didn't understand that", "label": 0}
{"text": "It’s pasta mince and sweetcorn. No amount of seasoning is gonna rescue that.", "label": 0}
{"text": "I agree with you, and I make a dish like this from time to time too (as an adult), but I'll usually add a bit of bullion or stock to bring the flavor. Idk if you would consider that 28 herbs and spices, but it instantly changes the flavor profile and the dish pretty much looks the same.\n\n\nYou can also add wine and/or flour to add flavor and thicken the sauce. It ends up being like a healthier (because of the veggies I add) homemade hamburger helper. ", "label": 0}
{"text": "He said otherwise he would get take out because his girlfriend is out of town and he doesn’t cook. That’s the problem here", "label": 0}
{"text": ">ketchup\n\nApparently originated in China. I love this line, it's so... British.:\n\n\"British traders developed a taste for the salty condiment by the early 1700s. They took samples home and promptly corrupted the original recipe.\"\n\nhttps://www.history.com/news/ketchup-surprising-ancient-history", "label": 0}
{"text": "> Like she could have a younger GF herself. \n\n\nlol? Why is he talking like it's a pet. \n\n\n\"You know what would help with the stress of a new job babe? A younger gf. You should at least look at the shelter on saturday.\"", "label": 0}
{"text": "I think its a midwestern thing, the corn I mean. It's not that weird anyhow. \n\nRestaurant I used to work at had a pasta dish that was bacon, corn, pepper & butter sauce over farfalle and it sold like crazy, legitimately tasty.", "label": 0}
{"text": "Depends, if he does other housework expect cooking, I don't see a problem\n\n\n'Rather than, well learning to cook? It’s a basic life skill a man in his 30s should have'\n\nExactly, again there wouldn't be drama if OP never mentioned their sex", "label": 0}
{"text": "Lpt: do not take advice about having kids from reddit, or anything for that matter", "label": 0}
{"text": "Sharks vs Jets.\n\nCrips vs Bloods. \n\nKarens vs Managers. \n\nIt goes exactly as expected.", "label": 0}
{"text": "I kind of agree with you. I'm a great cook, but I'm perfectly happy eating mush for every meal. \n\nOne issue is that I don't like it when partners expect me to cook everything just because I'm great at it. Then I'm judged for enjoying my mush. They can't handle my lifestyle, then refuse to take care of their own lifestyle.", "label": 0}
{"text": ">sometimes I just make boxed mac and cheese and dump a can of tuna in it and call it a meal because I'm exhausted from work\n\nLiterally my likely plan for today. Though I also do it regularly just because it's delicious and the macros really aren't that bad.\n\nI've been meaning to try hamburger helper. My cooking experience is kind of hilarious sometimes because my mom was a super whole-foods person and so I can cook all kinds of stuff intuitively from scratch (at least, vegetarian stuff intuitively, meat by the holy mathematical guidance of a thermometer) but then you've got shelf stable mass market products I just never got around to testing out.", "label": 0}
{"text": "Maybe he just wants more cooks in the kitchen, like his own personal restaurant.", "label": 0}
{"text": "I mean he’s feeding himself fine, people are just mad that his food is bland, which is a weird thing to be mad about", "label": 0}
{"text": "Im wondering where the inflammatory latter half of your statement is warranted. I would suggest, instead, to provide a deeper analysis of how patriarchal standards pin much of the childcare responsibility of the mother, rather than resorting to name calling.", "label": 0}
{"text": "If I had to name decisions that are so intensely dependent on situation that it’s impossible to make a general rule about them, “should I have children?” would be near the top of the list.", "label": 0}
{"text": "The meal is edible?\n\nOkay it looks kind of shitty, hints the name of the sub, but people are saying OP can't cook. They objectively have cooked food. If it doesn't give them food poisoning what's the problem? OPs willing to eat it? Sure you need to know how to cook for yourself, but OP is literally demonstrating that ability with this post?? Why is everyone hating on him? Because his food looks shitty? Isn't that the point?", "label": 0}
{"text": "They weren't yelling at him for making shitty food. They were yelling at him for sounding like he's treating his girlfriend like a mother. \n\n\n\"Mom was gone for the weekend so I tried making pasta\" in shittyfood would have been well received.", "label": 0}
{"text": "Cooking is a good life skill, but in the sense that you should know how to prepare a meal for yourself that will nourish you and that tastes reasonably good. Having the ability and patience to prepare elaborate meals that take 45+ minutes is a nice skill, but is in no way necessary for adulthood. \n\nLike, quick and easy stir fries are just fine. Sandwiches, salads are fine. You don’t need to be an expert at cooking to be a functioning adult. You should just be reasonably competent at the basics. And this OP, from his picture, at least is that.", "label": 0}
{"text": "> you are being delusional.\n\nDude, this is an internet conversation. Calm down.", "label": 0}
{"text": "Yeah, like this actually is cooking. He did, in fact, cook a meal. It’s not like he’s a five year old dumping a bunch of cans into an aluminum pot and mixing in ketchup.", "label": 0}
{"text": "Right! OP is cooking for himself and it looks like he cooked edible food. So why are people upset he can't cook as a basic survival skill? He just cooked.", "label": 0}
{"text": "If he doesn’t mind eating like this and doesn’t wanna cook then who gives a fuck?", "label": 0}
{"text": "I'm sorry you're so ashamed of yourself that you put your life frustrations on other people. I know in the context of this post that everybody thinks that OP is the worst person in the world, but as a disability suffer myself, I don't find myself raging at people for their own life choices because I may not get to fully control my own destiny.", "label": 0}
{"text": "Cooking generally means preparing food", "label": 0}
{"text": "i’m writing a reddit comment not writing a thesis ¯\\\\\\_(ツ)_/¯", "label": 0}
{"text": "If it does originate in China, it only originates there in the same way piccalilli originates in India, or sushi originates in South East Asia. 300 years is a...long time.\n\nI will say that I kind of cheated with that one, though. *Tomato* ketchup is American in origin (I think).", "label": 0}
{"text": "Even then, better framing and lighting that wasn't like it was in the corner of a dark room would make it look nicer. Wouldn't be hard to have let the meat brown in chunks of course and throw in a little sauce but if someone told me that they're trying to keep their carbs in check, it could still be decent.", "label": 0}
{"text": "This times a 1000...Please do not take any advice from a random redditor....you in reality have no idea you are talking to...the nature of being anonymous on this site is great for dank meme posting or just plain hobbying..\nBut any kind of political, medical, scientific, or other important factor...read and learn for yourself... and not random redditor *bigdicklicker* on why big pharma is a scam.", "label": 0}
{"text": "given that he put corn and ground beef on it, id say making it into a cold pasta salad with some crumbled cheese and a lil' vinegarette. easy meal", "label": 0}
{"text": "What the fuck is \"natalism?\" Is that just the republican response to antinatalism? Do natalists want to force everyone to breed? ", "label": 0}
{"text": "It’s an edible meal. Why does it need to be more than that?", "label": 0}
{"text": "There is a ton of real research about this.  It is a shame that everything is reduced to these black and white arguments. \n\nAnd of course a lot of nataliats are really just racist great white replacement theorists which is why they don’t care about the situation of the poor as long as they are white.", "label": 0}
{"text": ">If you're 22, barely making ends meet, living with roommates in an apartment, the thought of ever having kids seems like a pipe dream, so instead *you justify why that's not what you want anyways and in fact it's bad to have kids.*\n\nThe idea that antinatalists are making some insane psychological gymnastics to justify such a thing is... an idea, a thought. Idk, I really don't believe **everyone** wants to have kids. \n\nIt feels like, at least for natalism discourse, horseshoe theory makes sense (the extremes are equally deranged, just distinct flavors).", "label": 0}
{"text": "Delicious? Seriously? Pasta, mince, and sweetcorn? Come the fuck on", "label": 0}
{"text": "Exactly, people take shit on here verbatim when they shouldn't", "label": 0}
{"text": "jesus she just decided to torture that meat", "label": 0}
{"text": "I did provide plenty of links. Not my fault you didn't look at em.\n\nI never claimed you were engaging in the hateful rhetoric so dont put words in my mouth. I DID accuse you of covering for it, and i stand by that. You do the same tactic most feminists do. If you get to define the real feminists as only the best of good actors, then of course you can refute any criticism as being misdirected.\n\nIm an egalitarian, and in some very very specific instances, ive been on the side of MRAs. But i acknowledge that there are a lot of MRAs who simply use it to hate women and express their anger at them. That doesn't make them not MRAs. They are a real part of the faction, and MRA's inability to publicly denounce that behavior is why people associate all MRAs as misogynistic. If you dont like the widespread view that feminists expouse hateful rhetoric, the. Pretending it doesnt exist doesn't fix the issue. That's what MRAs tried to do.\n\nWhy do i have to acknowledge feminist positions as complex nuanced topics when, as you can see in this very thread, ANY criticism of feminism is met with people calling you an incel, saying you just hate women, saying you must be evil or brainwashed, saying you just want a subservient female slave. THIS is the rhetoric coming out of your camp. I acknowledge that not every single feminist engages in this behavior but just like feminists say: if 5 people sit at a table and break bread with a misogynist, then there are 6 misogynists at the table. Same goes for misandry.", "label": 0}
{"text": "Like when morons blame women for the draft.", "label": 0}
{"text": "I commented this on the last post about JD Vance being labeled a “chill guy” on the Theo Von subreddit buts it’s equally relevant here:\n\nYou can see why the trump campaign/Russian disinformation groups are targeting these manosphere/Andrew Tate/Tim pool/incel/insecure young guys. The propaganda works easily on them. A lot of them are already conspiracy theorists to begin with so you can see why it makes sense strategically. These are low information, confidently uninformed, insecure, regularly online young men who are mad at the world and mad at “woke society” and “cancel culture” so when these guys like Vance come along and tell them what they want to hear they are already primed for the propaganda. Instead of going for people in the middle the Trump campaign picked Vance to help turnout the insecure, lonely, and angry young male vote.", "label": 0}
{"text": "> Calm down.\n\nNo. I will salt your garden and weld your mailbox shut.", "label": 0}
{"text": "Anger makes humans irrational, irrationality is a force that can be directed ", "label": 0}
{"text": "> Tomato ketchup is American in origin\n\nGet wrecked monarch-haver. Tea goes in the harbor, not in the cup.", "label": 0}
{"text": "No it's a sub about people horny for elves, daedra, lizards and cat people that occasionally makes joke about elder scrolls lore", "label": 0}
{"text": "Is it really just GenZ turning right wing or them not being active in voting generally?", "label": 0}
{"text": "So many questions but mainly would the girlfriend’s other girlfriend be okay with her girlfriend’s other boyfriend as well as her other boyfriend?", "label": 0}
{"text": "*We're* not the ones who think lipton is potable. You guys are the ones propping up that vile company.", "label": 0}
{"text": "Yeah it's cooked ok for what it is. It's not burnt or moldy or something like that", "label": 0}
{"text": "I am always amazed when people can’t cook up basic shit like spaghetti or even hamburger helper", "label": 0}
{"text": "My comment was specifically on the excuse that OOP wasn't taught how to cook as a child.\n\nA grown adult should absolutely know how to throw together a meal in the kitchen.\n\nOOP is the one who decided to post it to r/shittyfoodporn so perhaps ask him.", "label": 0}
{"text": "It's not ableist, dipshit, ADHD/ADD is no excuse to not learn how to cook. Stop throwing around buzzwords to hide your own incompetence. One of my best friend has ADHD and he out-cooks me any day of the week.", "label": 0}
{"text": "Antinatalism mostly boils down to one of two beliefs \n\na) that lives less fortunate than their own can’t be worth living\n\nb) that life is inherently bad and shouldn’t exist", "label": 0}
{"text": "My cooking improved drastically when I started rewriting recipes to be truly step by step. No more \"mix the ingredients\"; now we're doing \"go to the cupboard. Get out the liaojiu, soy sauce, and white pepper. Get out the mixing bowl. Mix\".", "label": 0}
{"text": "And at least that's sort of an excuse!\n\n\nThere's perfectly healthy people, who just, refuse to learn\n\n\nNo one is expecting you to be a Michelin star chef\n\n\nBut if you can't throw a casserole together or some spaghetti as an adult? \n\n\nC'mon man", "label": 0}
{"text": "Ugh, the quiver-full movement by any other name smells just as revolting. I wish these psychopaths nothing but the worst.", "label": 0}
{"text": "I remember reading about how the kid who played the lead in *Come And See* had war-related PTSD after filming that haunted him for years. I get making anti-nazi movies, but damn the Soviets could have *tried* to keep the kid safe. \n\nAlso, the filming of *The Adventures of Baron Munchausen* apparently had ALOT of trauma for the lead child actress.", "label": 0}
{"text": "Legitimately what the fuck", "label": 0}
{"text": "All it needed was some sauce like damn lay off the guy lmao\n\nHe just made a very practical but not so tasty meal", "label": 0}
{"text": "1. \"They’re usually the ones […] and doing all the childcare bc their husband is a lazy POS that doesn’t wanna do it\"\n\nYou did not say majority, but you imply it by using the word \"usually\", as well as not specifying \"some\" husband\n\n2. That’s an understandable explanation, but it’s still kinda far fetched. So I’m just gonna give you the benefit of the doubt\n\n3. This is why I say that instead of removing women’s right to be mother or not like anti-choice think, we should instead give men the rights to choose to be a dad or not, with paper abortion", "label": 0}
{"text": "“Democrats offer nothing to young men”\n\nTranslation: why is no one specifically pandering to me, the demographic that has historically been pandered to the most", "label": 0}
{"text": ">We're not the ones who think Lipton is potable.\n\nOkay, yeah. That's fair.", "label": 0}
{"text": "I'm trash at cooking, but never learned as a kid.\n\nEventually my gf got sick of always cooking and now I cook any night I am around (of course she still helps).\n\nI hate cooking and it feels like a chore but I enjoy the fact that after a year of cooking I could cook a presentable meal.\n\nIt's not amazing, I'm not a chef, but other people would eat it and not complain. And to me that's pretty cool.\n\nI think oop should try that for a change - it's nice to be able to cook for SO or friends or family if they are around.", "label": 0}
{"text": "This whole thing has gotta be a state sponsored radicalization attempt, either by the ruskies and Iran. Probably not the latter\n\nThey also have a thing where they cause so much arguing in the comments people avoid them which ruins coalition building and consensus ", "label": 0}
{"text": "The aghast reactions to this dish are insane, especially the ones in this subreddit. Literally one jar of tomato sauce, maybe swap the corn for another vegetable, and this is a very normal meal.", "label": 0}
{"text": "Both these subs sound insufferable, lmao.", "label": 0}
{"text": "That sub is \n\nDead af\n\nAnd full of very strange fellows", "label": 0}
{"text": "They're dragging him for throwing together a poverty meal, but he responds with childish shit like 'I just eat mcdonalds lmao' and I lose all sympathy.", "label": 0}
{"text": "Corn is more starch than vegetable. And I don't think an Italian would agree that throwing some sauce into this would makte it resemble a proper pasta. Let's start with some onion, garlic...flavour!", "label": 0}
{"text": "There's a few things he could do to save it.\n\nProper seasoning. Or maybe some kind of sauce. \n\nHell, part of the issue is that it's *visually* unappealing. How good food *looks* can have an influence on what we think of the taste of the food. Even just adding peas could have helped.", "label": 0}
{"text": "I edited the Italian reference out because I'm not about to land in /r/subredditdramadrama. But I maintain just adding sauce would make it an acceptable American pasta dish.\n\nAlso don't shame individual vegetables! If that's the vegetable they're eating, let them live. It's better than nothing.", "label": 0}
{"text": "Yep, at this point the right's propaganda is well honed targeted attacks on people's fears or mental illnesses. It's fucking nuts. And people wonder why trump voters are trying to shoot him now. This is what happens when you lie to a bunch of angry, mentally ill people.", "label": 0}
{"text": "LoL no. There are a million good reasons to not have kids.", "label": 0}
{"text": "There's definitely a creep factor towards women, too\n\n\nWe've seen what happened to our grandparents and them when they spend their lives with that many kids\n\n\nAs a woman myself, it does raise the hairs on the back of my neck, when it's men salivating at the idea of more kids\n\n\nReal easy to say that, when you're not the one facing any consequences, and historically and statistically, won't have a life controlled by it\n\n\nHeck, I think some of the women there made their own sub because of that\n\n\nNot saying every guy who wants kids is bad, but when they go all Dane Cook about it, that sets of warning bells for me", "label": 0}
{"text": "The hate is that this is what he is capable of when he can't rely on someone else for a basic lifeskill.", "label": 0}
{"text": "ADHD affects people differently. Different people with ADHD struggle with different things. Don't tell people with ADHD what they should or shouldn't be able to do.", "label": 0}
{"text": "But then the problem could be too many cooks…", "label": 0}
{"text": "Shit he made doesn't even look that bad. It certainly doesn't look good either, but", "label": 0}
{"text": "I think what another commenter said about the way he's talking about it triggering people's overactive pattern recognition for the \"lame weaponised incompetence boyfriend\" archetype, especially because he's also got that fat ten year age gap which is another thing Reddit talks a lot about.", "label": 0}
{"text": "That looks similar to something B Dylan Hollis made except somehow even worse. How is that possible. 🤢", "label": 0}
{"text": "Seems that there is a vocal group in there, IDK how that reflects on the group themselves. All I know is that thread is heavily astroturfed to hell, so not enough of them are on the 'right' side. Instead there's probably foreign agents trying to change impressionable/angry youth perception of what's going on.", "label": 0}
{"text": "I fail to understand what he thinks USA right wing talking heads offer to men\n\nThey mostly openly call their followers losers.\n\nIs seeking help from dudes who constantly demoralize their listeners, some type of masochist fetish?", "label": 0}
{"text": "I looked up a saying on Tom morellos guitar and it was a South American letting terrorist organization that fought American colonialism, yes, but also purged other competing leftist groups. They also thought human rights were created by colonialism to affirm its rule. Just seemed very.. anti RATM’s central message ", "label": 0}
{"text": "One of Russia's biggest historical problems is a lack of a sea port that's usable year round (Warm water port).  A lot of Russia's historical aggressive acts, such as annexing Crimea, came from seeking said port.\n\nIn other words, Russians.", "label": 0}
{"text": "It is, absolutely. It's also antithetical to the idea of giving each victim and case its own space and spotlight. But I genuinely have no desire to upset you over this shitty internet squabble and I hope you're able to put it behind you. I understand where you're coming from I just think you might be a bit lost in the sauce (\"the sauce\" is the seriousness of these internet conversations).", "label": 0}
{"text": "Everything I know about hyena biology I learned from Drag Race UK", "label": 0}
{"text": "Or Skaven", "label": 0}
{"text": "Some of them seem very concerned with falling birth rates.\n\nGives me \"beware the great replacement!\" vibes.", "label": 0}
{"text": "Yeah that’s understandable. For me it really depends on how he and his gf distribute the rest of the household duties. Also I never really understood the phrase “I don’t know how to cook” - like the recipe literally tells you how to do it lol", "label": 0}
{"text": "it is actually impressive how the guy managed to cook hamburger in a way that preserves the shape of the mince as it comes out of the grinder. How do you even? Do you just sort of put it on low heat and poke it apart with a wooden spoon as it's browning? Did he pull it apart and crumble it like cheese?", "label": 0}
{"text": "Yes. And I love he’s like “guys, my GF doesn’t have to cook for me” and everyone just ignores it to complain that he’s taking advantage of her. People just want to stroke a hate boner.", "label": 0}
{"text": "Just throw some Italian salad dressing on it and he’s good to go", "label": 0}
{"text": "Let me guess, those select few who buys his merch?", "label": 0}
{"text": "This is wild, you could walk from the North to South Pole and still be between the space between plain pasta, ground beef and corn thrown on a plate and a \"culinary masterpiece\".", "label": 0}
{"text": "This is setting a pretty low bar for someone in their late thirties. And because we apparently all need to have sob stories to justify our (in)abilities: I know how to cook, because at 15 my mother delegated that responsibility to me. She did not teach me beyond the basics of basics. There was - and is - internet. It's really not hard.", "label": 0}
{"text": "damn, they seem really mean", "label": 0}
{"text": "I mean I also hate how misogynistic a lot of male icons are in rap. But I’m still going to call out Cardi B for admitting to crimes without repercussion. Just like I want all those male rappers to be punished for their crimes.", "label": 0}
{"text": "Well, ironically, the sub has a large amount non-Gen Zers in it, so, you get people who aren’t Gen-Z putting in their 2 cents and it can kinda dilute the truth.", "label": 0}
{"text": "Seriously, what’s the issue here? It really doesn’t look that bad, it’s on theme, and OOP isn’t pretending it’s some great achievement. I love cooking, but in a pinch I’d 100% make something like this. Add some pesto and you’re good to go.\n\nTbh I think people are just being weird about the corn, same way some people are weird about pineapples and pizza.", "label": 0}
{"text": "> And of course a lot of nataliats are really just racist great white replacement theorists which is why they don’t care about the situation of the poor as long as they are white.\n\nI think people would be significantly less creeped out by natalists if they packaged their support for having children with trying to save the climate, trying to reduce cost of living, fighting for reproductive rights, etc.\n\nYou know, actual 'pro-life' positions that also include respect for consent. But no the loudest ones really do just hate the poors who are black and brown", "label": 0}
{"text": "yah I made lay's nachos as a teenager", "label": 0}
{"text": "This plus Gen z women are far more likely to actually turn out to vote, likely because of the Dobbs decision and abortion bans which they fear impacting them directly. Gen Z men are more likely to be disillusioned with voting entirely, so they just sit at home because they think nothing will change no matter who wins (“both sides are the same, yadda yadda.”)", "label": 0}
{"text": "I grew up in a very posh area and I would 100% say that not knowing how to cook in your late thirties is something which should make others raise their eyebrows.", "label": 0}
{"text": "Ah nice, finally an internet argument where BOTH sides are creepy as fuck!", "label": 0}
{"text": "> Probably because he works all the time (12-16 hour shifts) and doesn’t have time to. That’s why most men don’t usually cook, not because they are lazy man children. Maybe you need a job to understand that.\n\nI like how dudes like these can’t be honest with themselves and have to use cop outs like “maybe they work a lot” or some other stupid shit. I mean, I don’t cook and I don’t care to cook, but that’s because I’m fucking lazy lol. I wish these dudes would just admit it.", "label": 0}
{"text": "When you’re accustomed to privilege, equality feels like oppression. If everyone is more educated and has access to healthcare, society as a whole benefits. So in a way, everything Democrats want will help men as well.", "label": 0}
{"text": ">I understand where you're coming from I just think you might be a bit lost in the sauce (\"the sauce\" is the seriousness of these internet conversations).\n\nI'm a sexual psychologist. I've been academically interested in human sexuality etc for 21 years now. \nThis is literally my job and my lifes passion. Whenever people say that it makes me laugh so hard. You guys should not be in on this so hard. The general public should not be so interested in this. I should. 😂😂", "label": 0}
{"text": "Again\n\nWho cares what a person makes for himself as long as it's edible for them\n\nIf he made it for other people then I could agree\n\n\nNow, this whole thread stinks of quite frankly classicism", "label": 0}
{"text": "> slow cooker\n\n> in her defense she didnt know she had to put water in it.\n\nYo ???)?", "label": 0}
{"text": "I mean I don't expect the average person to be able to cook gourmet meals whenever they can. \n\n\nBut learning how to make pasta or cook some rice for a quick bite is definitely useful. ", "label": 0}
{"text": "Brazen bull, etc", "label": 0}
{"text": "Yeah and the person they replied to said not liking.", "label": 0}
{"text": "i agree, there are several X factors like this that will play a huge roll in this election that the polls will always fail to predict", "label": 0}
{"text": "Well a swing to democrats idk about a swing to the actual left", "label": 0}
{"text": ">in her defense she didnt know she had to put water in it.\n\nAnd __that__ is why I made sure to buy seasoning that specifically said \"for slow cooker\" on it for the first time.  I'm not risking a whole roast to my uneducated guess of how to modify the instructions.", "label": 0}
{"text": "Meh, I make pasta with cheese and sweetcorn and it's good as hell.", "label": 0}
{"text": "When have young men ever been the demographic most pandered to? \n\nThey’re the ones who got tossed into the trenches to die the pointless wars for the old men, who were the ones really pandered to.", "label": 0}
{"text": "In 2020 men aged 18-24 voted for Biden over Harris 56-36. That's the first generation of Gen Z who could vote. \n\nIn 2022, which was generally favorable for Republicans, men aged 18-24 voted for Democrats over Republicans for the US house by 54-42.\n\nBut we're to believe that suddenly, in two years, this massively shifted and now men aged 18-24 will favor Trump? Is that really the most likely outcome? \n\nOr maybe it's just a bit more likely that Gen Z is not in fact dominated by men's rights Muppets just because they are the ones who shout the loudest online.\n\nI feel absolutely 100% confident that Trump will not win either the 18-24 or 25-29 male voting demographic. There is simply zero reason to believe this.\n\nWhat is true, is that Trump will get absolutely destroyed among Gen Z women. In 2020 women aged 18-24 broke for Biden 74-25. In 2022 women aged 18-24 broke 68-30 for Democrats. And women aged 18-29 broke 72-26 for Democrats. Trump will struggle to get the vote of even one in three women under the age of 30.", "label": 0}
{"text": "I'm not going to lie: when my wife is out of town I will spend at least 2 days smoking weed and eating fast food/mexican delivery, which is a nice break as the once who cooks.  If I go any longer I feel disgusting though", "label": 0}
{"text": "I think that was what the kids call a “joke”", "label": 0}
{"text": "I can sort of explain: a lot of boys are taught very early on that only boys are acceptable targets are violence. And that girls are not. So in a way seeing videos of men hitting women can feel validating in an ‘equality’ sense. It helps them feel that they are (1) allowed to defend themselves, and (2) aren’t relegated to being the designated acceptable targets of violence.  \nWhile I abhor all violence, regardless of gender (which is why I find such subreddits disgusting), pretending there ISN’T a reason some men are drawn to this type of hypothetical is missing the reasons that are lectured into them since childhood: it’s okay for YOU to be hit because you’re a boy.  \nAnd honestly that just makes me upset.  \n(Not defending anything, so I’m sorry if it sounds like I am. Have a good day!)", "label": 0}
{"text": "Midwesterns are all addicted to corn, its a serious problem that leads to kids becoming linebackers for Big 10 schools", "label": 0}
{"text": "Not what he said. “I don’t want kids” isn’t the same thing. Antinatalism is more “nobody should have kids”", "label": 0}
{"text": "Oh, was referring to his '19 kids bit'", "label": 0}
{"text": ">Also I never really understood the phrase “I don’t know how to cook” - like the recipe literally tells you how to do it lol\n\nI get it, because I didn't know how to cook. What it means is that when a recipe says \"mince three cloves of garlic\", you don't know what mincing means, and you don't know how to get three cloves of garlic out of a garlic bulb, and you don't know if it matters that you got two fat bulbs and one tiny one. It means when the recipe says \"fry until golden\" you have no idea when that is (is it now? Or is it too early? Or is it too late? There's so many different shades of gold). It means that you don't know how long to fry bacon until it's safe. It means you don't know how big a pinch of salt is.\n\nAgreed on the household duties thing btw", "label": 0}
{"text": "I’m pretty fucking angry at MAGA right now. Right now, I’m directed right to the polls, lol.", "label": 0}
{"text": "It is a thing that has been repeated online for years, but I guess we will see in a couple of weeks.", "label": 0}
{"text": "I did say there were toxic actors in every feminist group, did I not?", "label": 0}
{"text": "I could swear in the past I read a statement like yours but with Gen Z replaced with Millenials. ", "label": 0}
{"text": "To be fair, this does depend on the country. For the USA the batshit insanity of the GOP means the women’s shift left outweighs the men’s shift right, on average.\n\nThat’s less the case in Canada, where plenty of recent polls have Gen Z as literally THE most conservative-voting generation right now. Plus obviously countries like Korea.", "label": 0}
{"text": "At least she’s putting in real effort. I hate the OF cosplay posts where it’s just a lady in her room with a scarf or something", "label": 0}
{"text": "When they banned people subscribed to drama and other subreddits for adults they had creepy men come out of the woodwork begging to be unbanned.", "label": 0}
{"text": "Gen Z are wealthier than millennials now and on track to accrue more wealth over the course of their lives.", "label": 0}
{"text": "American Gen Z are richer than Millennials were at their age. \n\n> For example, the average 25-year-old earns an annual salary of $40,000, higher than all other generations when they were the same age. The higher incomes have resulted in bigger spending habits from Gen Zers.\n\nhttps://finance.yahoo.com/news/gen-z-is-projected-to-become-the-largest-wealthiest-generation-according-to-report-185059231.html\n\n> Millennials were somewhat better off than Gen X—those born between 1965 and 1980—when they were the same age. Zoomers, however, are much better off than millennials were at the same age. The typical 25-year-old Gen Z-er has an annual household income of over $40,000, more than 50% above baby-boomers at the same age.\n\nhttps://www.economist.com/finance-and-economics/2024/04/16/generation-z-is-unprecedentedly-rich\n\n\n> While the homeownership rate for adult Gen Zers has stagnated, a majority of them are still outpacing young people of the past.\n\n> The homeownership rates for 19-to-25-year-old Gen Zers are higher than the homeownership rates were for millennials and Gen Xers when they were the same age. For example, the rate for 24-year-old Gen Zers is 27.8%, compared with 24.5% for millennials when they were 24 and 23.5% of Gen Xers when they were 24\n\nhttps://investors.redfin.com/news-events/press-releases/detail/1032/redfin-reports-gen-zs-homeownership-rate-stagnated-in", "label": 0}
{"text": "This is the attitude that leads people to Andrew Tate and garbage like that. People are having a hard time right now regardless of who they are but the right wing has found a group that, on the occasion they vent a reasonable problem (lack of healthy role models for young men, loneliness, money problems) they get treated like they are spoiled for saying anything. All these grifters have to do is give them an easy answer and these kids will take it for lack of an alternative.", "label": 0}
{"text": "One thing that makes talking to these guys so frustrating is that they like to disguise their anger under the rhetoric of logic. Like no dude, you’re not conservative because of any real logical reasoning, you just don’t like the idea of society slowly moving away from patriarchy and traditional oppressive values.", "label": 0}
{"text": "Dude, millenials graduated during the financial crisis. We've only just now caught up to where our parents were at our ages.", "label": 0}
{"text": "that is a good point i did view it from the American lens thank you for correcting", "label": 0}
{"text": "Idk it’s 2024 at this point people are out of excuses. You don’t even have to read anymore you can watch someone make a recipe step by step.", "label": 0}
{"text": "The man clearly knows how to cook. He’s just not great at it. He knows this. It doesn’t sound like his girlfriend is too concerned about it either", "label": 0}
{"text": "“Seeing all this anger is exhausting”\n\n\nThey’re mad/tired… at seeing their own anger? \n\n\nThat doesn’t make sense. It’s okay to just be wrong buddy.", "label": 0}
{"text": "He literally posted a photo of him feeding himself something that wasn't fast food.", "label": 0}
{"text": "I'm 100% with you on women (although that poll also underestimates women, it has Harris up by only 33 points among Gen Z women, in 2020 Biden won Gen Z women by 49 points).\n\nWhat I disagree with is what that poll is saying about men. Because Trump lost Gen Z men by 56-36, there is no real indication that this gap is closing significantly. As it was 54-42 in 2022.\n\nI'm pretty sure that polls that have Trump basically tied with Harris among Gen Z men are simply finding that right wing men are more likely to answer their polls, because hey, if you buy into Trump and the Men's Rights movement, you're probably also more likely to answer a random phone call/text/email.\n\nThere is evidence in exit polls that Gen Z women are very left wing, the only evidence for Gen Z men shifting are the very very shoddy polls that are out there right now. And these polls are all over the place. Some have Trump within 5 points among 18-29, others have him down 30+ points (it will be 30+ points)\n\nIt's just that these far right men are far louder than their left wing counterparts. But just because they shout louder doesn't mean they're anywhere close to a majority.", "label": 0}
{"text": "“The left offers me nothing, so I’m going to support the party that strips away the rights of women”\n\nWill then proceed to complain about women online without a single shred of awareness", "label": 0}
{"text": "The last time there was a draft for a conflict was nearly sixty years ago. Anyone who has died in a pointless war in the last 30 years volunteered to go", "label": 0}
{"text": "Sure, but that doesn't equate to \"has never learned to cook in their life\". It just means \"doesn't usually have a reason to cook\".", "label": 0}
{"text": "I regret wasting the effort on you because you’re proven to not be worth any.", "label": 0}
{"text": "lol.", "label": 0}
{"text": "> He literally was in danger if her continuing to attack him\n\nAsk any self-defense instructor, and they will tell you to GET THE FUCK AWAY from someone who's attacking you, and engage in self-defense only if you can't escape or are being pursued.", "label": 0}
{"text": "Cool. I'll just ignore all of his comments that say he only eats fast food or what his girlfriend cooks lol.", "label": 0}
{"text": "Or maybe they just like trump I mean I have friends who simply like trump because they think he’s cool and it’s not deeper then that. I think your going into Reddit therapy mode a bit to fast", "label": 0}
{"text": "Granted it's been a while but occasionally I got it recommended to me and when that happened all the posts were just making parodying of subs like childfree or anti natalism which are cesspools. Maybe it changed or something idk.", "label": 0}
{"text": ">Edit: added some more text and also here's an even better source about women turning leftward, even moreso than men turning right\n\nThat's what I keep seeing too. \n\n\nYoung men aren't that particularly conservative. They're even still more liberal than the older generations. \n\nIt's just that young women are vastly more liberal and that the conservative young men are the ones with branded content catering to the. The liberal men are enjoying the same content as liberal women. And they're touching grass and having fun. It's only the angry online men that are funding this angry online content.", "label": 0}
{"text": "He’s clearly able to feed himself if he wants to. He’s not amazing at it, but he’s not going to bed hungry", "label": 0}
{"text": "You'd be surprised. The overwhelming majority of cooking youtube channels do not show you a recipe *truly* step by step; I know because I desperately tried to learn from them. There's a tonne of assumed knowledge. Chef John was by far the best counter-example, and I wish I'd found him earlier.", "label": 0}
{"text": "Lmao. Sorry your own words make you judge me that harshly. Is it really that hard to read what you read and not get pissed? \n\n\nMust be a weird life.", "label": 0}
{"text": "\"No one should have kids\" and \"everyone should have kids\" are both insane positions, but \"more/fewer people should have kids\" is a more interesting argument and I assume closer to what both groups believe. ", "label": 0}
{"text": "> the demographic that has historically been pandered to the most\n\n> **historically**\n\nMentioning the draft is a totally valid point here. Plus at the global level there still is plenty of young men getting their lives tossed away for pointless wars", "label": 0}
{"text": "I mean, usually the second you try to talk to them they scream at you about bullshit or personally just dismiss me because I’m a woman and woman bad.", "label": 0}
{"text": "If you look at the graph the Gen Z men are an average level of conservative-ness since 2000. The young men were even more conservative in 2004 than the young men are now.", "label": 0}
{"text": "One of the stated reasons Russia invaded Crimea in 2014 was for its warm water ports. “Warm water port enjoyers” = Russian shills and bots.", "label": 0}
{"text": "I put some blame on their father. If they have one. It is easy to be a dad, but being a good dad takes work.", "label": 0}
{"text": "Hot chicken water.", "label": 0}
{"text": "I get that but even then if you go to a lot of recipe sites these days most have either pictures of each step or they have a detailed video. \n\nI’m never going to fault someone for trying and failing (how else do you learn), but there’s a good number of people who seem almost proud they don’t know how to cook. It’s just weird.", "label": 0}
{"text": "They used to say this constantly about millennials", "label": 0}
{"text": "Hahahah holy hell that is objectively hilarious", "label": 0}
{"text": "It looks like what I feed my dog when she has an upset stomach", "label": 0}
{"text": "Hedwig and the angry foot 'a cock", "label": 0}
{"text": "Again, wild that the difference between a meal and edible ingredients on a plate is 'classism'. Peasants ate better in the middle ages.", "label": 0}
{"text": "That poll is... not reliable.\n\nIt is claiming that in 2020 men aged 18-29 leant conservative. They went for Biden by 52-41. So that poll is off by a good 20 points. Also, in 2020 women 18-29 went for Biden by 67-32, that's quite a bit more than the +20 that poll has in 2020.\n\nIn 2016 Clinton won 18-29 year old voters by 19 points. But the poll has her up by 2 points among men and about 12 among women.\n\nIn 2012 Obama won 18-29 year old voters by 60-37. That poll has him leading women by about 5 points and trailing men by about 10. So he should have lost the 18-29 demographic, not won it by 23 points.\n\nIn 2008 Obama won 18-29 year old voters by 66-32. That poll has him down about 5 among men and up about 5 among women. So about tied? He won by 34 points.\n\nIn 2004 Kerry won 18-29 year old voters by 56-43, so 13 points. That poll has both men and women aged 18-29 favoring conservativism.\n\nThe numbers that poll has are completely out of whack with the political reality of US elections.\n\nAt best you can take it as a longitudinal poll that has a clear innate bias. But if that's the case, there is no movement at all among men. Actually, they were more conservative in the early 2000s than they are now.\n\nSo I really don't understand where this narrative that Gen Z men are more right wing than any previous generation is coming from.", "label": 0}
{"text": "Also, it’s a life skill that takes time to develop. \n\nI’ve been living on my own for 3 years and having to cook my own meals. I recently tried to make steak and mushrooms. \n\nThe mushrooms were finished way ahead of time and got cold. But the steak was cooked to perfection. I decided to reheat the mushrooms and burned them. By then the steak was cold so I tried to warm it up a bit and burnt it. And then the mushrooms were cold again and I resigned myself to burnt steak and cold burnt mushrooms. Thankfully the bernaise sauce turned out ok.\n\nCooking is important but people have different strengths and weaknesses.", "label": 0}
{"text": "It probably has something to do with men constantly being told that life is easier for them and they don't need supports or rights or to fight for themselves, while they die from suicide at 4x the rate and from workplace accidents at 100x the rate, at least where I live.  \n\nAnd it's probably hard for a lot of people to accept that and open their heart to it while being left with the fact that women's reproductive rights are under assault.\n\nIt's not black and white, but men clearly need help, and if they don't get it from the good guys, they're going to get it from the bad guys.", "label": 0}
{"text": "I just want to add a couple of years ago, Contrapoints [made an excellent video about the problems of young men becoming more conservative and right wing leaning](https://youtu.be/S1xxcKCGljY?si=fkSqS3TzDzdw2SaW) that I think made some excellent points. One of the points she made was how a lot of these men are suffering from male imposed standards of patriarchy but how sometime when you tell them that, they still for whatever reason will try to shift the blame to feminism. Another thing that was really interesting was how she also said how the left will call out toxic masculinity without really offering a more positive counter imagery of masculinity to aspire to. I don’t know what it’s gonna take to stop young men to stop being radicalized to the right, but it’s a scary problem and it’s hard to see as a young adult. We’re in a time we’re men have less to offer as women have more to lose (with having greater access to education, better paying jobs, etc). I’m happy we starting to see more positive examples of masculinity like the Hasan Pikers and Justin Baldonis of the world but without a greater societal shift, the gender war is only going to cause more strife in this country in a way we’ve never seen. It’s fascinating to see but it’s also scary.", "label": 0}
{"text": "Just because you don't struggle with cooking doesn't mean other ADHDers don't legitimately struggle with it", "label": 0}
{"text": "I remember this type of stuff from when i was an in-patient.", "label": 0}
{"text": "Thinking \"Wow, let's take a time capsule back to ancient Reddit\" and then finding all of the comments upvoted makes me want to die. I've really been on this website for a decade+ now lmao", "label": 0}
{"text": "Damn son, you murdered him!", "label": 0}
{"text": ">Exactly, people take shit on here verbatim when they shouldn't\n\nGotcha, I'll ignore the redditor who told me to \"not take advice about having kids from reddit\".\n\n\nI will take advice about having kids from reddit.", "label": 0}
{"text": "Yeah but on the flip side post history is also a good way to guage how garbage a poster is or if their post is BS.", "label": 0}
{"text": "Thanks a lot; I'd forgotten about the bologna cake. : \\", "label": 0}
{"text": "I mean I don’t have one in particular but a lot of  \nyoung men online are just like this in general. Someone like Ben Shapiro or other debate bros who will be like “let’s talk about it logically” but then will talk about *their own personal values* like it’s some absolute truth when it’s really just a set of their own beliefs.", "label": 0}
{"text": "I teach high school and it’s not surprising. There is a HEAVY Conservative influence in all the media that is popular with that group (Twitch, Podcasts, TikTok). I also feel like this group has been parroting what their parents say about Trump since he has been around. Watching middle schoolers chant about pro Trump stuff since 2016 is very scary.", "label": 0}
{"text": "Hoom hom.", "label": 0}
{"text": "I think a less generalizing way to put it is “the subset of angry young men who are swinging right are very preoccupied with the concept of getting a romantic partner - it’s a big part of why they are angry. It seems likely that a portion of them will eventually realize getting a partner is easier if you don’t have a toxic attitude toward women.”", "label": 0}
{"text": "Saying that young men have been historically pandered to is not “the attitude” that leads people to Andrew Tate - it is simply the truth.\n\nGrifters seeing an opportunity to rile up boys (in many cases literal children) and sell the idea of  equality as some sort of boogeyman and an existential threat to young men is what leads to people like Andrew Tate.", "label": 0}
{"text": "No, both sides are speaking in absolutes. Antis believe it's morally wrong to have *any* children. The natalists believe it's a moral requirement to have at least one child.", "label": 0}
{"text": "where my gen z labor unionists at", "label": 0}
{"text": "This history of modern american populism rabithole is incredibly interesting.", "label": 0}
{"text": "That annoys me more than anything. Half the posts in the sub are millenials talking about how much better they are than GenZ, literally sounding exactly like boomers talking about X and X talking about millenials.\n\nWhich, that's fine if the 30-40 somethings want to talk about how fucked up us kids are. People have been doing that for a thousand years. But don't do it in *our subreddit.*", "label": 0}
{"text": "I would argue his policies were more technocratic then anything else.", "label": 0}
{"text": "It’s also never clear what they actually want. Like the only legit issues I ever hear are family court, the draft and SA support, but the GOP offers nothing on any of those.\n\nIf they wanted a productive conversation it could be had but it seems like they are mad about other voices being uplifted.", "label": 0}
{"text": "With respect I feel like this is just ignoring the problem and then getting surprised Pikachu face when things don't magically get better.", "label": 0}
{"text": "It seems relationship are getting more rare regardless of political affiliation and gender. Newer generations just date, marry and procreate less.", "label": 0}
{"text": "Yeah that’s basically just a bologna sandwich.", "label": 0}
{"text": "We just won our 19 yo dishy’s job back. He was kinda iffy about unions but we got them on breaking the contract and bro came back actually radicalized lol", "label": 0}
{"text": "Honestly some of them probably think that if the country becomes more conservative then they’ll have a higher chance of finding a wife so they won’t have a desire to watch it anymore", "label": 0}
{"text": "I am Gen X. r/GenZ started showing up in my r/all, I was then certain it was like r/teenagers. Filled with older redditors. ", "label": 0}
{"text": "I thought the millennial sub was bad because of them having rosetinted glasses for everything but that GenZ sub is just godawful.", "label": 0}
{"text": "I have ADHD and timing is a huge struggle and not something I can learn from following instructions.\n\nADHD can also make it possible to forget to eat until you’re at the “feel like you’re starving stage”.\n\nComplex meals can require juggling tasks which is very difficult.\n\nAnd then there’s just exhaustion from everything else that ADHD makes difficult.\n\nGranted I’m in my early 20’s so I haven’t had as much time to practice as OOP.", "label": 0}
{"text": "Yeah like I personally am definitely in favour of making it easier to have and care for kids - but I don't consider that a natalist stance, but more that children and their caregivers tend to be extremely vulnerable in a capitalist society. Like I do think that Western society is very anti-child in many ways, but for capitalism reasons rather than some kind of anti-Christianity reason or whatever.", "label": 0}
{"text": "Snapshots:\r\n\r\n1. *This Post* - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/aMlFfe5Zh2 \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/aMlFfe5Zh2 \"URL failed to archive; click to resubmit it!\") \r\n2. *This Post* - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/SubredditDrama/comments/1gc4irw/ \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/SubredditDrama/comments/1gc4irw/ \"URL failed to archive; click to resubmit it!\") \r\n3. https://www.reddit.com/r/GenZ/s/aMlFfe5Zh2 - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/aMlFfe5Zh2 \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/aMlFfe5Zh2 \"URL failed to archive; click to resubmit it!\") \r\n4. https://www.reddit.com/r/GenZ/s/39WtiBl98N - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/39WtiBl98N \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/39WtiBl98N \"URL failed to archive; click to resubmit it!\") \r\n5. https://www.reddit.com/r/GenZ/s/8NcL6httXl - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/8NcL6httXl \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/8NcL6httXl \"URL failed to archive; click to resubmit it!\") \r\n6. https://www.reddit.com/r/GenZ/s/JEPsgtWhuH - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/JEPsgtWhuH \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/JEPsgtWhuH \"URL failed to archive; click to resubmit it!\") \r\n7. https://www.reddit.com/r/GenZ/s/IOOcIGw5fx - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/IOOcIGw5fx \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/IOOcIGw5fx \"URL failed to archive; click to resubmit it!\") \r\n8. https://www.reddit.com/r/GenZ/s/jDmqTZLDGH - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/jDmqTZLDGH \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/jDmqTZLDGH \"URL failed to archive; click to resubmit it!\") \r\n9. https://www.reddit.com/r/GenZ/s/udI7zjPnaT - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/udI7zjPnaT \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/udI7zjPnaT \"URL failed to archive; click to resubmit it!\") \r\n10. https://www.reddit.com/r/GenZ/s/fZRt6QJf4G - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/fZRt6QJf4G \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/fZRt6QJf4G \"URL failed to archive; click to resubmit it!\") \r\n11. https://www.reddit.com/r/GenZ/s/NMrp9lIen9 - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/NMrp9lIen9 \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/NMrp9lIen9 \"URL failed to archive; click to resubmit it!\") \r\n12. https://www.reddit.com/r/GenZ/s/a5wfzB93EU - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/a5wfzB93EU \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/a5wfzB93EU \"URL failed to archive; click to resubmit it!\") \r\n13. https://www.reddit.com/r/GenZ/s/fTfDNaDbun - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/fTfDNaDbun \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/fTfDNaDbun \"URL failed to archive; click to resubmit it!\") \r\n14. https://www.reddit.com/r/GenZ/s/688XCT3c0g - [archive.org\\*](https://web.archive.org/save/https://old.reddit.com/r/GenZ/s/688XCT3c0g \"URL failed to archive; click to resubmit it!\") [archive.today\\*](https://archive.today/?run=1&url=https://old.reddit.com/r/GenZ/s/688XCT3c0g \"URL failed to archive; click to resubmit it!\") \r\n\r\n*I am just a simple bot, __not__ a moderator of this subreddit* | *[bot subreddit](/r/SnapshillBot)* | *[contact the maintainers](/message/compose?to=/r/SnapshillBot)*", "label": 0}
{"text": "The vibescession is strong when you get your news from an algorithm designed to enrage you", "label": 0}
{"text": "Too many cooks and they’re all serving looks", "label": 0}
{"text": "I.... I don't think it looks that bad? Not as gross as most commenters, anyways. I'm not a huge fan of bologna or mayo so I doubt I'd try it. But it's probably not so bad with cracker and pimento. Or maybe I was in the south too long and that whole \"must try a bite of everything to be polite\" ruined me for life. ", "label": 0}
{"text": " * *gestures wildly at the state of the world* *\n\nThis. This is why we don’t wanna have kids. \n\nThe only unfortunate part is that those with the wisdom and foresight to actually think about having children will not, while bumbling morons will continue to have a full litter", "label": 0}
{"text": "Real funny leap in judgment but ok lol", "label": 0}
{"text": "I know that young men have historically been looked after but if you don’t at least throw them a bone the other side has ripe pickings. Like, obviously don’t compromise on anything but if the whole message is “young men won’t get any help from us because they won’t need it” then Trump could literally promise them a single penny and they’d be swayed toward him. The Democrats are moral but they really suck at messaging.", "label": 0}
{"text": "Don't worry I'm sure an /r/ncd poster will be along to explain how actually Vietnam was based actually", "label": 0}
{"text": "Might get hate for this but a lot of poly talk on the internet sounds like that. Often a lot of “side partners” and “primary partner” talk.", "label": 0}
{"text": "Notice how almost all the conservative comments have usernames that fit the formula of \"VerbNoun123\"", "label": 0}
{"text": "man I'd eat that. Looks like the kind of thing you throw together to use up little bits remaining in the pantry. Not a michelen star dish but looks just fine.", "label": 0}
{"text": "Those are three incredibly flexible ingredients, you could pretty easily make this anything like mac and cheese, stir fry, pasta salad, or a bolognese. \n\nIf this was me, I'd add some crumbled cheese, cilantro, peppers, chili powder, mayo and lime juice and call it an esquites inspired pasta salad.", "label": 0}
{"text": "I've seen a very similar vintage recipe where the serving suggestion is basically that - a thin slice served with crackers. If this was an all beef bologna I'd be way more inclined to eat this over some of the lime jello, egg, and tuna abominations I've seen recipes for. God I love old recipes. Ever wanted a recipe where you put a cup of corn syrup over some hot dogs and pasta? Got you covered!  \n[https://www.reddit.com/r/vintageads/comments/1gaypyc/karo\\_syrup\\_ad\\_in\\_ladies\\_home\\_journal/](https://www.reddit.com/r/vintageads/comments/1gaypyc/karo_syrup_ad_in_ladies_home_journal/)", "label": 0}
{"text": "> You remember back in the day when you went on Rotten.com and read the title of a link -- clicked it -- and anxiously awaited for the horror? And when the picture finally loads, your heart and mind are amidst a tornado of confusion, disgust, horror, and a mild excitement from curiosity.\n\n> There was no excitement with this picture. Just horror and panic.", "label": 0}
{"text": "You don't get to dictate the capabilities or struggles of other people with ADHD, full stop. People with ADHD struggle in different aspects of their lives, with different tasks and topics. Your experience with ADHD is not universal.", "label": 0}
{"text": "Brother they are ANTI-Natalists. They are not arguing for less kids brother, they are arguing for NO kids, it's in the fucking name man.", "label": 0}
{"text": "Why? Shouldn’t I as a man vote for my best interests or how I perceive my best interests?", "label": 0}
{"text": "It’s mostly just great replacement theory people Natalism is the belief that having children is a moral imperative.", "label": 0}
{"text": "Thanks for the link. I’ve never heard of this before. I wouldn’t, I guess, since I’m an American after all, haha.", "label": 0}
{"text": "Same. In this case it was absolutely self defense but that sub it too full of misogynists to actually watch the whole thing.", "label": 0}
{"text": "or misogynist logic: “Women are biologically not as strong as men. They are naturally more nurturing than men, and so they should remain in the home taking care of babies where they are safe.”", "label": 0}
{"text": "I have a physical reaction to this image", "label": 0}
{"text": "hell yeah", "label": 0}
{"text": "Back then real AMAs were common on reddit.", "label": 0}
{"text": "Yeah, relative timing takes... time. When your mom made you come help in the kitchen since you were 7 it's second nature, but I sometimes have to say \"yo, if you show me a list of 4 things on your phone right now at least one of these things will overcook and one will be cold.\"", "label": 0}
{"text": "I don’t really see much point in differentiating “never cooked in their life” vs “doesn’t have a reason to cook.”\n\nAlmost everyone has cooked something or knows how to do simple cooking. Even the people in this area. But if you were to ask any of them, if they want to cook at home, almost all of them would say no. If you were to ask them to cook something, they’d say no. There are few scenarios where they’d actually cook something except if they lose a job (or endure a pandemic.) It makes little difference.\n\nLike you successfully found people in this area that “can” cook in theory, but almost none of them would ever cook you a meal. If you visit their apartment, they’d say let’s go out to eat at the Italian place around the corner.", "label": 0}
{"text": "If someone spits on and kicks me I don’t care what their gender is. I’m defending myself.", "label": 0}
{"text": "I have ADHD and for me it’s that I can be good at something, but I can’t be good at multiple things.\n\nI can work, I can go to school, I can practice self-care (including cooking), I can have hobbies/friends. But I can only choose 2.", "label": 0}
{"text": "Yup. If someone attacks me I’m not going to sit there and think “hmmm. I wonder how many time I can hit back.” I’m just going to defend myself.", "label": 0}
{"text": "I think we're talking a bit past each other. My point is that I believe cooking is a basic life skill which you should be expected to have by the time you're in your late thirties even if you have no direct need to cook for yourself.", "label": 0}
{"text": ">You could argue that they're so smart that you cannot consent\n\nExcuse me? Have we seriously arrived at the point this consent arithmetic can literally decide sentient, adult human beings are incapable of genuinely consenting if the other party''s stats are too high?\n\nAnd what a weird thing to say about Mindflayers especially because if there's any reason to believe a person can't genuinely consent to them, it would be because they can literally fuck with your brain and force compliance, and you may not know it.", "label": 0}
{"text": "Do make sure to check the things the \"good\" guys did with chicken feathers in the Korean war", "label": 0}
{"text": "I think it is true to an extent. I work with teens and if nothing else I am absolutely seeing a resurgence in homophobia and use of slurs. Even from kids who don’t think of themselves as homophobic.", "label": 0}
{"text": "Damn dude, you’ve got some hangups that have nothing to do with feminism.", "label": 0}
{"text": "Most of the people posting about this drama likely cant cook much better than the OOP, the OOP did about as well as the average person. I very rarely find someone who knows how to cook who isnt a cook under like 35\n\nAsk the average 27yr old how to make stock and watch them shrug", "label": 0}
{"text": "I don’t think anyone replying to him there is even in a relationship. Especially when they all ignore how many times he said she doesn’t cook for him.", "label": 0}
{"text": "One of my favourite ever criticisms from him is \"it tastes like Christmas gave up.\"", "label": 0}
{"text": "Bros 'late 30's' and this was his self addmitted giving it his best. Nah he needs to stop being a non stop weed smoking man child relying on his gf to care for him.", "label": 0}
{"text": "HAHAHAHAHA. That man is a national treasure.", "label": 0}
{"text": "Right? Shout out to my ex who tried to cook twice and the first time, she used expired meat and the second time she used crushed up bbq chips as bbq seasoning\n\nShe was 25 or 6 and it was fine because at least she genuinely tried (I ate out those days secretly tho)", "label": 0}
{"text": "I don't doubt it. Seeing \"retarded\" come back as a slur has been incredibly disappointing.\n\nThough personally, I think it's because gen Z men and boys are being radicalized in more directions that millennial boys were. In the fallout of the Great Recession and then Trump, millennial males got radicalized significantly towards the left.\n\nFor Gen Z it was Trump, then Covid, with a much more established right-wing grievance sector on social media. While Gen Z women are arguably the most progressive segment of a generation ever, Gen Z men are being (successfully) pulled in several different political directions", "label": 0}
{"text": "Social media definitely seems to increase tribalism and division in camps defined by labels. You have black and white, red and blue, man and woman - perpetually warring. \n\nIt makes it harder to pursue harmony, as many define themselves along these labels and in opposition to their rivals in this narrative, with more concern placed on vague affiliation than for individual points. I've seen many men complain about 'feminists' and many progressive treat every men's right initiative as a threat to their cause, when they should work together for the same cause. It's sad to see.\n\nAs an example of this, I find it a bit discouraging that you felt the need to justify your take with \"I'm not white\" as if that would disqualify your opinion.", "label": 0}
{"text": "How is he not competent? He’s put together something that is going to keep him alive even if it’s a tad shit lol.", "label": 0}
{"text": "That's an aged reference.", "label": 0}
{"text": "It is very obviously astroturfing, like shockingly so. If you ever go on it there are 1-2 posts every month that surprisingly hit 8 million upvotes that are just the worst conservative slop and they always come out of nowhere. Totally fake.", "label": 0}
{"text": "> Hilary Clinton literally said even though men are dying in war, women are still the primary victim. \n\nLook up what happens to women in war zones. \n\nCivilian casualties have out numbered military casualties for almost a century now.", "label": 0}
{"text": "I actually died at one of the replies to OOP who clarified they do cook even when their GF is around, they asked commenters not be so prejudiced.\n\nSomeone responded, ***“PREJUDICED!?”***\n\n💀 I do think they’re being very hard on bro, but their title very much did imply they are dependent on their GF for cooking lol", "label": 0}
{"text": "Consent applies to much more than just sex - I'm sorry if I'm misunderstanding you, but you seem to be conflating non-consensual as always firstly meaning rape. Yes, non-consensual *sex* means rape, but that's why we have a specific word for that specific instance of non-consent.\n\nAn MMA fighter, for instance, consents to getting punched in the face during a fight. An MMA fighter walking down the street, however, does not consent to getting punched in the face. Nobody is calling that rape, nor is anyone calling a corporation purposefully lying about what it puts in its products as rape. It's just violating consent, plain and simple.\n\nNobody in the linked drama is calling purposefully mislabeling content as rape - they are (correctly) calling it what it is. Violation of consent through purposeful deceit.", "label": 0}
{"text": "If you can't make pasta and ground beef delicious that says more about your cooking then anything else.", "label": 0}
{"text": "I just hate when someone tries to laugh at themselves and there's people who laugh AT THEM instead of **with them**. Folks missed the plot badly in that thread.", "label": 0}
{"text": "Its all just venting about bad exes and projection lol", "label": 0}
{"text": "Yup.", "label": 0}
{"text": "There cups of water with broth bouillon is enough for stew.  Not chili, I've burned chili unfortunately", "label": 0}
{"text": "Nah. Ben Shapiro is too illiterate to use Reddit.", "label": 0}
{"text": "Referring to animals by pornographic labels is going to raise some eyebrows.", "label": 0}
{"text": "Yeah. The responses to so many of those comments are 2016 esque \"maybe you bluehairs shouldn't be making men feel worthless\"", "label": 0}
{"text": "The ideal arrangement would be a polycule of four or five taking turns, with one or two nights designated for leftovers and the last night designated for eating out. That way, your turn always falls on the same weekday and is easier to keep track of and schedule around.\n\nAnd if the cook also cleans, you save yourself *so many* arguments about who makes a huge mess when they cook. Once you start having to do both, you learn very quickly how to minimize the mess.", "label": 0}
{"text": "I got the impression that he just eats fast food a lot. Which is an issue, but not necessarily a relationship issue in the way a lot of people seem to be thinking about this.", "label": 0}
{"text": "And not in the fun way", "label": 0}
{"text": "The people panicking and saying that GenZ men are becoming conservative, obviously forgot what 18-24 year old guys are like.\n\nThey're reactionary, insecure, and looking to feel like they are big strong men instead of kids. This is the same age demographic that comes together and becomes frat bros.\n\nIf I was their age right now and was exposed to guys like Ben Shapiro and Andrew Tate, I would 100% be in a conservative phase.\n\nBut these kids are gonna get older and mature. They're gonna look back at their behavior and beliefs, and cringe. It's the natural order of things.", "label": 0}
{"text": "I helped in the kitchen but I was never fully responsible for juggling *everything* at a young age. My mom asking me to dice the tomatoes while she makes the beef and shells for tacos and my dad shreds the lettuce is a lot different than being on your own and doing all those different things by yourself. Cooking simultaneously with another person is a lot different than being by yourself as far as timing goes.", "label": 0}
{"text": "And advertisements are a bunch of lies to make you buy a product. They still work otherwise the people in power wouldn't use them.", "label": 0}
{"text": "OOP himself stated the food wasn't good, so he's not that competent in the kitchen now is he?", "label": 0}
{"text": "How dare you remind me that this exists, and tell me that it's been 10 years since it first graced my eyeballs", "label": 0}
{"text": "I said it once in response to stuff on whether or not Gen Z was getting more conservative or not, but I'll say it again.\n\nI must be a woman, because the older the get the more left I become.", "label": 0}
{"text": "I was just watching The Sopranos and was a little taken aback by Tony grabbing deli meat with his hand and dipping it into a jar of mayonnaise. But this is like the extreme conclusion of that idea.", "label": 0}
{"text": "It's Gamergate. That's what it all traces back to. Conservatives saw that there were a bunch of online, unconnected, disappointed with reality, (predominantly white) men and realized it was the perfect breeding ground for their hateful ideologies.", "label": 0}
{"text": "What I keep coming back to is special elections. Like sure, they don't get nearly the turnout of general elections, but if there was real-world evidence of Gen Z turning as rightward as these polls say, conservatives would be pointing to special elections instead of betting markets.\n\nLook maybe I'm wrong and I'll have some serious egg on my face after the November election. But polling has consistently underestimated the support that pro-Choice candidates have ever since Dobbs was overturned", "label": 0}
{"text": "Except Republicans aren’t more likely to struggle in finding relationships.\n\n[Republicans are more likely to be married, and Democrat women are more likely to be married than Democrat men.](https://news.gallup.com/poll/646793/why-marriage-became-partisan.aspx)", "label": 0}
{"text": "This is just how Reddit is site wide. It’s extremely cringe", "label": 0}
{"text": "Bro try that shit, it tastes savoury and almost sweet and delicious, your daughter literally just figured it out quicker", "label": 0}
{"text": "Seems a little selfish. Why should I vote for people who want my sister, my mother, and my girl friends to suffer?", "label": 0}
{"text": "I mean that’s exactly what OOP did? He made food, just not particularly good food. I don’t think people are talking about not being able to fry an egg. Usually when people say they don’t know how to cook, there’s an implied level of quality, not “gee what do these dials do”. People understand the mechanisms of heating ingredients, making the result tolerable is the hard part.", "label": 0}
{"text": "Lol no I didn’t, there is male only conscription in other countries, you’ve assumed that I was talking about US policy", "label": 0}
{"text": "The worst ones I ever saw was the [horse meat and winegums](https://old.reddit.com/r/shittyfoodporn/comments/2kd7v2/microwaved_winegums_with_defrosted_spinach_and/) or the [pepsi crab](https://old.reddit.com/r/shittyfoodporn/comments/bjygyd/crab_boiled_in_pepsi_max_for_2_hours_served_in_a/)", "label": 0}
{"text": "The American right isn't actually offering any solutions to the problems you listed, though.\n\nAt best they're just mocked for being losers and told to man up in those spheres.", "label": 0}
{"text": "This is a crazy thing to respond to a comment that referred to the party you're describing as having men's best interest as the one that strips women's rights away.", "label": 0}
{"text": "You realize that he said multiple times that she doesn't cook for him?", "label": 0}
{"text": "Started with gen X, they're just nearing retirement now so most of them have gotten their shit together.  In the US, times have been getting harder for most people since around the 80s, and though everyone can resentfully look at the people 5 years older than them and think \"they had it easier\" (which might even contain some element of truth), the reality is times are just getting harder because our society turned to internal predation after the rest of the world rebuilt; so the forever good times are gone, but the forever good times' stock market returns must be continued lest the rich people be made unhappy.  So we gotta prey on our own poor.", "label": 0}
{"text": "I try not to do the whole “both sides are bad” thing, but when it comes to “natalists” and antinatists, I can’t help it. Both are just the worst in different ways.", "label": 0}
{"text": "The problem people had was the attitude of the title, plus the follow up in the thread. Like, the title itself is boomer tier \"lol I'm a helpless man who can't cook\" attitude, then he says he usually eats fast food if his girlfriend isn't around? \n\nYeah people took it too far in the thread but I'd say they were pretty justified. The man's in his late 30s and doesn't know that he could've made it 100x better with half a jar of tomato sauce.", "label": 0}
{"text": "Ngl, that sub is a breeding ground for preds to target. Every time I've commented in there to give advice and even say I'm not a teenager, I get random brand new accounts trying to slide into my dms asking benign innocuous questions only to see those accounts deleted/banned weeks later....", "label": 0}
{"text": "Yes he is. He just made a shitty meal but he knows how to turn on the stove and cook all he has to do is follow a recipe next time.", "label": 0}
{"text": "That sounds either like a really stupid worldview or one which is just not saying everything it's thinking.  There's no \"he's cool\" no further thought, unless you're 7.", "label": 0}
{"text": "I don't like to cook either, but I'm not bad at it. Especially when you can just follow step by step instructions to get it done. It's weird to be so bad at it that you would have to rely on take out which is unhealthy/pricey. ", "label": 0}
{"text": "The one genuinely hilarious thing \\r/Drama ever did, got to give them credit where credit is due, that was genius.", "label": 0}
{"text": "Lol that thread and this one really showcase how insufferably judgemental redditors are.", "label": 0}
{"text": "His girlfriend doesn't cook for him", "label": 0}
{"text": "And next time maybe he won't openly post about the shitty food he makes because his girlfriend is out of town on the internet.", "label": 0}
{"text": "Oh my god the winegums are microwaved. \n\n\nLord have mercy.", "label": 0}
{"text": "My sister has a really limited palate and just doesn't really care about food all that much. She doesn't want to try new things, and will happily just eat the same meals over and over again. She can cook the handful of meals she enjoys, but I wouldn't want her cooking for me because I like seasoning and flavour and not just some plain chicken breast or turkey burger.\n\nI on the other hand LOVE food, and.care very much about having tasty, healthy, diverse meals. I do 90% of the meal planning, grocery shopping and cooking in my relationship because I just care about it more. I'm a great cook and I love having friends round for dinner. I couldn't survive on the boring ass food so many people are happy to subsist on.", "label": 0}
{"text": ">10 years\n\nhttps://imgur.com/iTCcyaO", "label": 0}
{"text": "But didn’t you say it would be embarrassing if someone can’t cook if its a norm in their class? The norm of royal families is obviously to not cook. The norm of an office worker in the city is to not cook, even if most of them can cook.\n\nWhy is it suddenly a requirement for people where its not actually the norm?", "label": 0}
{"text": "My girlfriend can't cook for shit and I cook most things. Why does everything have to be some sort of outrage?", "label": 0}
{"text": "what will you do as a citizen for your country? men seem to be mad because just being a man isn’t an automatic successful life anymore. women are finally taking their place at the table. just the evening up of the field of play is brought to make men whine and cry. trump and his buddies came along and told men what they wanted to hear and gave them an enemy to blame. and so many have fallen by for it hook line and sinker. \n\nwhy does being an asian american man entitle you to more than any other kind of man? why is it about how the government will help you- a person who at the very least has a phone or computer to use to be online and free time to fuck around in reddit? do you really think you are the most in need of help? what programs have you applied for? have you been rejected by them all? do you expect help without putting up your hand and actually asking for it? do you just expect the government to guess?", "label": 0}
{"text": "meanwhile, as someone who was raised by a single dad, i had to get guidance from him on…well, everything…so i legit credit that for how i didn't wind up a weird creepy incel", "label": 0}
{"text": "If she doesn't cook for him, where's problem", "label": 0}
{"text": "It's an interesting statistic, but it doesn't change the fact that the incel movement is entirely conservative based. There aren't left wing incels or pick up artists or manosphere members.\n\nThis statistic could be for a lot of reasons as well, given by the article. Political attitudes towards marriage are much more lax with democrats, who are more likely to view the institution as outdated. There's less pressure to be married as well. Left-leaning couples are more likely to be content and remain unmarried, while also exploring more untraditional relationship structures like polyamory or open relationships.\n\n[Unmarried women also tend to be happier while unmarried men tend to be much less happy.](https://www.theguardian.com/lifeandstyle/2019/may/25/women-happier-without-children-or-a-spouse-happiness-expert)\n\nThere's a lot of factors at play here and I don't necessarily think that this statistic changes what I've written.", "label": 0}
{"text": "Men are dying in war disproportionally. That’s a fact. Women are not doing a whole lot to equalize that. That’s also provably true. Feminists answer is we will solve war! Newsflash universal peace is not going to happen in our lifetime. So it’s not a valid strategy in the near term. If feminists are saying that it’s not about equality but freedom for women then that’s fine, but don’t expect men to be allies when you can’t  or don’t want to be on the front lines with us.", "label": 0}
{"text": "I'm ahead of the curve on human/superintelligence relations.\n\nIf a godlike superbeing makes you feel like a small child in comparison, if it is simulating every possible version of you to develop the perfect dating strategy, if you are a mere insect writhing in the heat of its mental radiance, if all of your free will effectively leaves the building the moment they enter and the only thoughts you can have are your own insignificance as an ant wandering their chess board too lowly to even be a pawn, then no you cannot consent to a blowjob.\n\nSuch a being is inherently beyond human morality so perhaps we cannot judge it, but at the same time we must.", "label": 0}
{"text": "Is reading comprehension lost on you? The literal title of his post is \"GF out of town, so I \"cooked\". It ain't that good.\"", "label": 0}
{"text": "The ultimate conceit of authoritarianism is to think that you, yes YOU, will be the authority.\n\nSpoiler alert >!you won’t be, you will be getting crushed underfoot!<", "label": 0}
{"text": "This is just chud cope. Reactionaries have been going \"Just wait vro Gen Z is gonna start the day of the rope any day now!!!!!\"", "label": 0}
{"text": "For someone to win someone has to lose. \n\nElevating women at the cost of elevating men isn’t right. Someone has to lose for someone to gain something. In the long run it is a zero sum game.\n\nFor example, if I am a corporate worker in California up for promotion, I could possibly lose that promotion to a woman who is equally or less qualified due to the requirement that 11% of the board must be female. This was recent put on hold in California last year. How is that fair to me?\n\nSecond example, I’m going to take something that I’m competing for right now, medical school admissions. An average for female matriculation was a 504 and the average for male matriculation was a 508. I’m not going to mention the GPA since it was within .01 which can come down to a bunch of random stuff. Why do I have to do more as a male to achieve the same results? \nhttps://www.aamc.org/media/6081/download\n\n\n\nIn fact this is an excellent op-Ed on how Democratic Party has failed men in general \n\nhttps://www.americansurveycenter.org/newsletter/have-democrats-given-up-on-men/", "label": 0}
{"text": "Lol there would be no drama and even overwhelming defense if OP kept the post gender neutral\n\n\nThat's what you learn after 10 plus years in this hole of a sub", "label": 0}
{"text": "Can you rewrite this in a way that’s understandable", "label": 0}
{"text": "This is exactly how my brother got involved in politics, though he's a millennial. He didn't care at all about politics and voting until Gamergate, which filtered him to people like Ben Shapiro and Jordan Peterson.", "label": 0}
{"text": "It kinda looks dry but yeah, its not even really shitty.", "label": 0}
{"text": "I too work with a lot of people who are in their late teens and early twenties (90% guys), and I didn't really notice a resurgence of homophobia or racism, but I *did* notice that a lot of them have dogshit social skills. Half of them can barely talk to each other, let alone to someone a little older or the opposite gender. The few girls I do get to work with are doing a lot better in this regard.", "label": 0}
{"text": "Idunno why subreddits always turn out this way tbh. Seems like people really just want to argue or treat it like AITA. That's why I only go on r/decentfoodporn, keep the expectations low", "label": 0}
{"text": "On the flip side, I’m one of the many men who were idiot kids during Gamergate who thought they were so smart participating and eventually woke up and became radicalized in the opposite direction. It’s kinda crazy how many people have done that. I was a teenager but I still cringe at myself for ever associating with gamergate in any way.", "label": 0}
{"text": "and every other country with a major navy has one", "label": 0}
{"text": "Yeah I don’t get how other people don’t get the irony of “if he added a sauce and tomatoes and seasoning and more than a teaspoon of corn and maybe oil I’d definitely eat it!”  It’s on shittyfoodporn and people are calling it shitty.  News at 11.", "label": 0}
{"text": "Early Gen Z could vote in 2016 (I was 18) but it’s true 2020 was the first election in which they were significant.", "label": 0}
{"text": "Because you’ll find people don’t like you when you act like a selfish, bratty child. If you can’t balance the basic rights of others with your own desires then obviously people aren’t going to want interact with you.", "label": 0}
{"text": "Trying once is trying and it's much better to tell how to do better than punching down if you want him to do better.\n\n\n\"Yeah, it looks bad, but here's what you need to know about seasoning, sauces or oils and cooking pasta. Maybe you could help your girlfriend with cooking one day!\" \n\n\nWorks better than\n\n\n\"SHAME\"", "label": 0}
{"text": "If you're cooking only for yourself then only you get to judge the relative value of the cost of your time and effort vs the benefit of eating less shitty food\n\nIf the only person who's eating it doesn't give a shit why should you", "label": 0}
{"text": "Every generation gets more conservative with age.", "label": 0}
{"text": "Why. That’s all I can think of. Just why.", "label": 0}
{"text": "Because you’re not voting against your direct interest. Democrats are better on the economy and almost every other metric. \n\nYou’ll still do better under democratic governance than republican “governance” even they don’t specifically pander to you. \n\nThat being said, minorities rights are something the dems care about and the Republican Party is adversarial towards.", "label": 0}
{"text": "I have no problem being social. I’m not a stupid single issue voter. \n\nMy main question is that what has the Democratic Party promised or done for SOLELY males.", "label": 0}
{"text": "There are huge differences in people's food budgets, I've learned. Spending $500+/month/person on food is not uncommon for people with higher than median incomes.", "label": 0}
{"text": "Yes, but they think that \"society is collapsing\" and \"defeating WOKEism in video games\" will fix it and they will instantly get a 11/10 trophy wife and a Camaro.", "label": 0}
{"text": "It’s weird because in most of the posts I see there it’s just people in the comments joking about the food looking bad, not personally attacking the person cooking it. Not sure why it happened in that one thread out of nowhere", "label": 0}
{"text": "Yikes. \n\n\nMy kids are in their mid 20s. Not one of their friends have kids. I know son #1 would love to have kids... someday... but he doesn't want them all to struggle way he knows we did. Son #2 simply is asexual and if I ever get a grand baby through him it will be a cat or a step grand. Youngest sibling (younger than my kids) just thinks parenting is bullshit, thanks to their witnessing and experiencing all the bull shit our parents put us all through, so why add to the chaos. \n\n\nThis is such a multifaceted debate. Shocking that they think it can be boiled down like this. \n\n\n\n\n(And even a generation ago it was a toss up, (5 siblings from my generation. I have 2, siblings have 4,3,2 and 0) of course our better educated children are using that \"everything is a choice\" option that we reminded them of regularly.)", "label": 0}
{"text": "I also so what most in this sub refuse to do, press on linked thread and read the comments ", "label": 0}
{"text": "A cow died for that.", "label": 0}
{"text": "I mean wasn’t affirmative action a democratic position that hurt Asian American minorities? \n\nAren’t businesses loans for a certain race and gender also harmful to other minorities who will not qualify for them? \n\nBoth of these affect me directly.", "label": 0}
{"text": "The r word is not making a comeback, it has always been used,", "label": 0}
{"text": "What, to your mind, does the Democratic Party or any political party, need to do solely for males?", "label": 0}
{"text": "Yes, but again the OP does not want to learn. They've said as much themself.", "label": 0}
{"text": "What happened was that the drama subreddit banned anyone subbed to the teenagers subreddit, and then announced that they were banning all teenagers. They then posted a number of messages they got from the banned users (who were subscribed to teenagers) saying “I’m not a teen, I’m 42!” \n\nProbably one of my favorite reddit moments lol", "label": 0}
{"text": "Doesn’t answer my question. What will the Democrats do ONLY for men? Not just women. Something just for men?", "label": 0}
{"text": "That’s actually how it’s meant to be served—it’s in the same category as elaborate cheese balls, pates, hot savory cheese concoctions in chafing dishes, and complex multilayered dips. Something for parties to serve with crackers or toast points.\n\nI wouldn’t serve it at one of my own parties, don’t get me wrong, but thankfully it wasn’t ever intended to be cut in big slices and eaten like a cake.", "label": 0}
{"text": "Stuff like male only DV shelters, male only homeless shelters, programs like WIC for men, etc?", "label": 0}
{"text": "Cooking is easy - just try things until you make something that you like. You have eaten before, you know what flavours you like.\n\nBaking - now, baking is hard. You gotta be precise and follow the recipe or all you are going to eat is disappointment.", "label": 0}
{"text": "You think so. But like, I see this as a complete non issue. It’s not like he’s sitting here saying “my stupid bitch ass girlfriend couldn’t cook for me today so I’m forced to engage in cooking”. The guy doesn’t care what he eats, his girlfriend seems to like cooking for him. She’s gone so he doesn’t eat as well. Nobody is mad about this situation except the people in these comments lmao. It would be different if he was bitching about not having access to good food because his girlfriend isn’t there. But that’s not what’s happening.", "label": 0}
{"text": "She doesn't cook for him \n\n\nRead more than just the title", "label": 0}
{"text": "I know they're not, that's why I called them the bad guys.  But they're the only ones even offering lip service, so naturally these lonely angry young men are going to gravitate to them.  Complaining about it won't change it, but giving them something better might.", "label": 0}
{"text": "That data doesn’t include any of Gen Z yet.", "label": 0}
{"text": "Why not?", "label": 0}
{"text": "Yeah, I wasn't fully clear, what I meant that voters aged 18-24 in 2020 were mostly Gen Z, and that entire group (age 18-23) together is the first generation of Gen Z voters. But you're right, technically the oldest of those stand apart as they were also able to vote in 2016.\n\nMy point is mostly, we've seen how the oldest generation of Gen Z (which is about 1/3 of Gen Z) votes, and those Gen Z men absolutely did not lean Republican.", "label": 0}
{"text": "Go do your homework", "label": 0}
{"text": "I think a better stat would be the likelihood of being in a relationship in general. A stat like this has a pretty significant confounding factor in that I think it’s pretty obvious that republican men would be more likely to be married considering they’re more likely to follow the traditional route of getting married immediately (and are more likely to join the military and less likely to use contraception, two that often leads to marriage lol). That doesn’t necessarily mean that they are finding relationships at any greater rate than democrats, just that they’re more likely to participate in a certain form of relationship", "label": 0}
{"text": "-guarantee ability to use paternity to challenge Child support. Meaning that if I didn’t know and signed the birth certificate and let’s say 10 years later I didn’t find out it was mine, I can get out of child support \n\n-end selective service\n\n-promote males in college through increasing funding for male only programs and scholarships \n\n- provide similar loans and grant program incentives like women only or LGBTQ only", "label": 0}
{"text": "Panders to women, supports terrorism, etc.", "label": 0}
{"text": "You could put most of the top comments in that thread on r/confidentlyincorrect", "label": 0}
{"text": "This isn't what I meant.\n\nHaving interest in your family heritage is fine, and appreciating other cultures is good.\n\nI'm talking about extremists.", "label": 0}
{"text": "You’re exactly who they are talking about. Amazing.\n\nhttps://www.reddit.com/r/4chan/s/CFupuqPbyN\n\nTell us more about women.", "label": 0}
{"text": "They really didn't", "label": 0}
{"text": "Phrasing it as he \"cooked\" because his girlfriend is out of town directly implies his girlfriend cooks for him when she's in town.\n\nOOP trying to course correct after being torn to shreds doesn't change the title he chose to use.", "label": 0}
{"text": "I don’t buy the “Gen Z men are right wing!” claims. This is the least religious and most diverse generation in American history. And we watched Trump declare war on all the issues we care about. And then a massive pandemic utterly mismanaged by him that screwed many of us over, kicking us home from school or university. There will always be conservatives in any generation but I expect Gen Z men to lean liberal this election as they have historically.", "label": 0}
{"text": "I dare say the natalists are a bit more creepy towards women. The other side is just a bit doom and gloom", "label": 0}
{"text": "Are you just stalking this thread? He didn’t even tag you, how’d you see this?", "label": 0}
{"text": "It is true that the progressive cause should do more to champion men's issues, as the opposite can make people feel disenfranchised and push more and more youth in the hands of grifters like Tate, whose only merit is to pretend that they care.\n\nThat said, it is paramount for the progressive men's right activist to not let themselves be embittered by whatever disparagement they encounter online avoiding thus to define themselves as enemies of other progressives; it is only through unyielding nobility of purpose in face of all opposition that meaningful steps forward can be taken.", "label": 0}
{"text": "It's really tiring when people ascribe some kind of moral value to just not being interested in certain things, especially when it gets tied up in the Gender Wars\n\nMen who get all heated about people who just don't care about cars or driving, can't change a tire or change oil, would be happy to have a self driving car or Uber everywhere if they could afford it, etc are toxic (and I say that as someone who does care about car stuff)\n\nSo are men who are shitty about fitness (\"Do you even lift?\") or about \"understanding\" the tech you use etc\n\nAlong the same lines, if you're not hurting anyone else and you're happy with your life, there is zero reason for you to learn to cook if you're fine eating canned soup and PB&J or plain pasta with ground beef and frozen vegetables\n\nIf you can afford it, it's no one else's business if you live on McDonald's and Papa John's\n\nOf all the actual bad things Donald Trump does, the fact that he enjoys well done steak with ketchup has nothing to do with it and there's no reason to bring it up\n\nAnd women who bring this up as something that's wrong with men are just as toxic as all the men listed above, same with stereotypical men who have a dresser full of identical T-shirts and jeans because they don't give a shit about clothes and who put zero effort into skincare other than just showering regularly\n\n(And of course this applies just as much to women and enbies)\n\nYou don't *owe* it to anyone to put effort into anything you don't actually care about that doesn't directly affect other people\n\nLife is hard enough, why can't we just leave people alone", "label": 0}
{"text": "Personally I specifically want democrats to come out in support for male only scholarships, programs in colleges receiving federal funding, ending of male only/female only colleges or at least ending federal funding for them, grants and loans that are only for men like they have for women, etc.", "label": 0}
{"text": "I hope not but one person is correct: Democrats need to push more for men. Men generally but white men too. They don't highlight a lot of their issues. Walz is a good gesture, but they need more people like him, shooting straight and focused on men's issues.", "label": 0}
{"text": "I can’t find any statistics on the matter that apply directly to Gen Z.\n\nIf you have any better stats I’d like to see them.", "label": 0}
{"text": "Temporarily embarrassed ~~millionaires~~ billionaires", "label": 0}
{"text": "That subreddit is basically unreadable. Seems to another place where all the \"enlightened centrists\" congregate.", "label": 0}
{"text": "But the progressives do not care at all. We are told that we are spoilt for asking questions about policies that might harm men’s rights for expanding women’s rights.", "label": 0}
{"text": "I'm glad you had a good dad, too. \n\nMy parents had me super late. The dude lived through the damn civil rights. Surprisingly, it doesn't have those stereotypical backward views. Well, he thought if you smoked weed it would for sure make you a lazy good for nothing, but that changed.", "label": 0}
{"text": "Probably because they don’t want a lecture from Karen on why they should actually hate themselves", "label": 0}
{"text": "They are. Overall the antinatalism one tends to be \"nastier\" but that may just be because it's older. Natalism is definitely getting more unhinged with time.", "label": 0}
{"text": "This explains a lot of social media. Once a trend/trope emerges, it's top of mind for a lot of people. And they apply it to anything that it vaguely resembles.", "label": 0}
{"text": "He’s also very feminine imo. \n\nHis only thing is hating on men and attacking traditionally masculine things. I also hate the fact he’s a socialist (insert insult here)", "label": 0}
{"text": "It's a relationship issue if they've combined finances so his spending habits directly affect her, or if they're actually long-term partners so his long-term health affects her\n\nBut otherwise yeah who gives a shit how he chooses to spend his money", "label": 0}
{"text": "This was LB Johnson’s assessment about southern racism in the 1950s.  He was right then, and he’s right now.", "label": 0}
{"text": "I’m not talking about your experience, the men Cardi B drugged and robbed were not in the same position as you. I’m saying robbery from a stranger that you have absolutely no personal relationship with is different than getting robbed by a sexual partner. A one night stand is not a sex worker.", "label": 0}
{"text": "Really? Because although I hate de Sade for being a disgusting rapist I'm curious in the Salo movie because I've read about the director and how he's Italian or gay or whatever and how the narrative is adapted to be more about fascism and the Franco regime. So I'm holding out that maybe it's not just meaningless violence.", "label": 0}
{"text": "With a ton of extra steps ol", "label": 0}
{"text": "Those comments wreak of bots or generally not Genz. It’s totally possible a lot are conservative which is fine if it’s not absolute insanity and BS Trumpers that are pushing for everything, and it’s messed up the Republican Party let itself get taken over by these maniacs.", "label": 0}
{"text": "The OP said it was bad lol. I will say, it doesn’t look “bad” in the sense that it’s unhealthy or unsafe or even disgusting to look at. But I believe him that it probably tasted unpleasant. Sure, there’s “nothing wrong” with a bowl of pasta with some kind (any kind) of protein and (any) vegetable on it, but taking that instruction literally is so brutally utilitarian that most people don’t cook that way unless they are in a situation where they are not able to choose what to eat. People may use that as a general guideline, and it’s a good guideline, but dumping corn and dry ground beef on dry pasta is not generally what people mean by that. And comparing it to making restaurant style pad Thai as an alternative is disingenuous. It takes literally the exact same amount of effort to put “a protein” and “a vegetable” that mesh well on pasta as it does to pick corn and dry ground beef. It takes *less* effort to dump some canned pasta sauce on pasta. This isn’t a perfectly fine take on the basics, and we know that because the person who made and ate it said it was bad. If he enjoyed this, it would be different. When people give advice like “put a vegetable and a protein on pasta” when explaining to beginners how to start cooking, I feel like that’s only half of the explanation of how to cook enjoyable food, so it results in *food* but not *enjoyable food*. The part that’s missing is “think about what you enjoy eating when someone else is cooking for you.” This man likely never had his girlfriend or parents serve him whatever this is, and I’m certain he never ordered it at a restaurant. If he was looking for a tasty dinner, his starting point shouldn’t be “dump vegetables and protein on pasta,” it should be “what do I like to eat.” \n\nThat said, it’s shitty food porn. OP delivered. I kind of assume this is a “what I had around” rather than “what I think will taste good” meal, and those are often….utilitarian, even if the person is a good cook.", "label": 0}
{"text": "I was around when it was totally normalized and I watched it became a ‘hey, not cool’. *All* slurs are in continuous use unless they’re archaic. It’s about the level of perceived acceptability in general society. R word absolutely rose to the level of ‘that’s an asshole’ (in person) or ‘that’s a fucking troll’ (internet).", "label": 0}
{"text": "I think the Republican Party will never do 2.\n\nThe first point they might do, but they will do it at the cost of women’s right and it becomes an enormously divisive issue that people will inevitably fight on rather than seek to provide protection for both groups. I personally believe the democrats are more likely to implement a solution for paternity challenges that does not harm women. \n\nFor points 3&4, the Republican Party has historically been against higher education except among their immediate personal group, and that education has only ever been used as a crux to maintain their own power. I do not believer they will pursue public incentive programs. The states they control have the lowest outcomes for education at all levels. The party culture is anti-education and anti-intellectual and has been for decades. Believing the RNC has any intention to improve education outside of their very small in-group is, in my mind, willful ignorance and a means of masking one’s own personal biases.", "label": 0}
{"text": "I hope you're right, because if special elections are anything to go by, there's going to be an absolute banger of a blue wave like nothing any pollster is predicting.", "label": 0}
{"text": "Yeah. I think people should learn to cook because it’s a useful thing to know, and there are both monetary and health reasons why takeout and frozen entrees aren’t the best choices. \n\nBut as long as you aren’t making it someone else’s problem, that’s really between you and your budget/blood pressure.", "label": 0}
{"text": "vinaigrette wouldnt be good for something like this. None of that stuff has any flavor on its own, and it's obviously unseasoned.vinaigrette has a strong flavor to it, which is why it's used in salads.\n \nIf done right, the sauce wouldve been cooked in the oil and meat (seasoned), then poured on the noods, with 0 fucking corn, and some cheese on top and then... omg... is that a basic dish?", "label": 0}
{"text": "Agreed. Antinatalists are annoying and I think their “philosophy” is stupid, but the so called Natalists are much more insidious and weird.", "label": 0}
{"text": "Why does anyone on the Internet need to try to accomplish anything with a group who's entire political ideology comes down to, \"I'm not getting laid, so I guess I'll vote to take away others rights\".", "label": 0}
{"text": "He's clueless. Of course he won't try. I don't want to jump off a plane with a parachute right now. I have no idea how it works. \n\n\nHe seems open to me in the rest of the comments OP didn't link. I don't know, man. I just thinks it's better to make the situation improve than find excuses to judge.", "label": 0}
{"text": ">    Your poor gf is dating a child. Cooking isn’t difficult. Not knowing how makes you look like a dependent dork. Grow up and be someone your gf is proud of.\n\n> >  your profile is like 90% comic book stuff dude. you’re in a glass house here.      \n \n> > >   …..you don’t cook and eat comicbooks….or if you do, stop.     \n\n> > >>   I'm a phenomenal cook and I also don't collect picture books written for children. Other guy is right. Glass house.\n\n\nDid you know that being a good cook is mutually exclusive with being interested in comic books", "label": 0}
{"text": "In a way yes with the razor example. I want them to straight up have a requirement that hey this loan or grant or program or funding sources is solely for males", "label": 0}
{"text": "I believe the old joke goes “I never thought the leopards would eat *my* face, says person who voted for the Leopards Eating Faces Party”", "label": 0}
{"text": "What's QoS?", "label": 0}
{"text": "left-leaning gen z men and women are also out dating and having fun rather than raging online.", "label": 0}
{"text": "I love how the left says, \"don't treat women and minorities as shit\" and you seem to take that as a personal insult.\n\n\nBarring forcing marriages, I don't see hiw the left would ever connect to young male conservatives ", "label": 0}
{"text": "I mean how can they not be when they believe that everybody should have children? That is just creepy in and of itself.", "label": 0}
{"text": "Male suicide rate? The reason that's higher is because men use more lethal methods of suicide like guns versus women using more slow acting methods like pills. This means that more men successfully die from suicide attempts than from women, who have more time to be able to be saved. \n\nIn fact, women are actually [3x as likely to attempt suicide than men](https://www.verywellmind.com/gender-differences-in-suicide-methods-1067508). \n\nAs for family courts, that's not even relevant anymore. Well, it *used* to be. But modern courts generally try to do 50/50 split of custody… when both parents show up. One reason mothers still get custody more often is because the fathers would just dip and not even show up to court to get custody. When men *do* pursue custody, they often do win primary or joint custody. \n\nAlso, even though [most married mothers work outside the home](https://www.bls.gov/news.release/pdf/famee.pdf), women are still more likely to take on the role of primary caregiver for their children, especially when the kids are little. Bringing up custody discrepancies without even bringing up the fact that they they do the vast majority of childcare and household labor even when working a job paints an incomplete picture. \n\nDemocrats being anti-men is such b.s. that I won't even bother touching it.", "label": 0}
{"text": "Oh and federally end permanent alimony. Forgot one.\n\nI do not think the democrats will do point one. “To damaging to women” would be their argument. \n \nI’m not saying the republicans will do it, but what I’m saying is the democrats should do it to gain support.", "label": 0}
{"text": "It's why these people feel like their whole existence is threatened by progressive voices; if you can offer solutions that buck the status quo, acknowledge inequality and the shitty hand a lot of people have been dealt _without_ scapegoating women, minorities or vulnerable groups, you'll give them something more tangible and lasting than the outrage leapfrogging that reactionary politics will guarantee their whole lives become.", "label": 0}
{"text": ">I’m saying robbery from a stranger that you have absolutely no personal relationship with is different than getting robbed by a sexual partner\n\nWhich one is worse in your eyes? \n\nAnd is the person who you \"have no personal relationship with\" referring to the one night stand? Because yeah, I had never met her before that, but she was *also* a sexual partner. So she was someone who I didn't have a real personal relationship with beyond a few hours.\n\nI'm not trying to be annoying, but this is genuinely written in an unclear way.", "label": 0}
{"text": "Assuming you're straight, if your girlfriend gets pregnant despite using protection and you're not financially equipped to have that baby, which party's policies will be better for you? The one fighting to protect her right to get an abortion, offering tax credits for new parents, proposing subsidies for childcare, and funding our education system? Or the one working against all of the above? \n\nIf you have a union job, do you want the party that actually supports unions or the one constantly writing anti union legislation? If you like clean water, do you want the party who supports protecting our environment or the one trying to remove as many protections as possible? \n\nThe list goes on and on. I'm a man and have voted Democrat in every election I've been able to because I earnestly believe my life is far better with them in power than the alternative.", "label": 0}
{"text": "While I get why you’d be more charitable and assume antinatalism isn’t as extreme as that other user says, they’re actually right. \n\n\n[“Antinatalism or anti-natalism is a philosophical view that deems procreation to be unethical. Antinatalists thus argue that humans should abstain from having children.”](https://en.m.wikipedia.org/wiki/Antinatalism)", "label": 0}
{"text": "Not really. \n\nOn their website they mention 16 distinct groups yet don’t mention men.", "label": 0}
{"text": "Isn't it fried with breaded chicken though?", "label": 0}
{"text": "Every single bad thing you can say about the antinatalism subreddit -- the racism, the misogyny, the eugenics, the kneejerk neckbeard hostility to stupid normies -- is TEN THOUSAND TIMES WORSE on the natalism subreddit", "label": 0}
{"text": "There is no business loan which is exclusive to race or gender. No lender is allowed to discriminate based on race or gender. Men can apply and receive funding from such programs as well.\n\nI can agree that the names of some of these such programs might make one believe they are strictly available to those groups but that is not the case at all.", "label": 0}
{"text": "Something that also rarely gets accounted for in discussions like this is that GenZ men and women are dangerously apathetic, that tends to skew results somewhat.\n\n\nI've seen it personally, but don't take just my anecdoctal experience for it, everywhere from online polls, voter turnout, unemployment rates, higher education enrollment/permanence, etc...", "label": 0}
{"text": "What direct interest? Nobody one the left is pushing laws that remove your bodily autonomy, nobody on the left is pushing for removing your right to vote, but the right is actively doing that against women and minorities ", "label": 0}
{"text": "If a progressive says truthfully that they do not care about men's struggles then they are not a progressive but just a bigot of a different variety. If you let yourself be defined by their backwards rhetoric you'll be no better than they are, and you will end up flocking to movements that will make you hateful, which in turn will make women feel hateful and flock to equivalent movements and so forth. The only result of this exercise is more division, more anguish and more hate for all involved. \n\nPersonally I have a standard of what I believe is right, and I will pursue it with respect for men and women alike. And when I think that something's wrong I'll speak out, and sometimes I'll get flak, but I won't let that pervert my purpose.", "label": 0}
{"text": "I never said I supported republicans. I want the democrats to earn my vote not just get the vote because it’s not Trump. \n\nAbortion is mainly a state by state issue. \n\nUnions need reform.", "label": 0}
{"text": "They're getting attention, and pandering, is what I mean.", "label": 0}
{"text": "If you don't know, then be blessed by ignorance.", "label": 0}
{"text": "yeah if someone is much better at cooking it makes sense for them to do most of the cooking imo. if i married gordon ramsay i would insist on him doing the bulk of the cooking and ill just take a bigger share of some other housework to make up for it", "label": 0}
{"text": "not really that alike at all, given goat people don't exist irl. girls with peens \\*do\\*, and they do have words that can be derogatory towards them (especially ones that have been/are common in porn, such as sh\\*\\*\\*le, tr\\*\\*ny, or la\\*\\*\\*oy). Whether \"futa\" counts as one is a item for debate amongst trans people, though I think the more common position is that it's not quite a slur unless aimed at trans people in particular. \n\nHonestly I can understand both banning it and not banning it.", "label": 0}
{"text": "Once again, useless comment.\n\n>lmao virgins get laid and then you’ll support my leftist bullshit\n\nAnd what rights are being taken away? Your right to infanticide? “Oh boo hoo I can’t kill my baby this is literally fascism”. Have the doc stick an IUD in you if you’re so worried about unplanned pregnancy, problem solved.", "label": 0}
{"text": "Absolutely spot on. What are Dems doing to swing this the other way? They gotta have a plan, right?", "label": 0}
{"text": "People dont like either subreddit", "label": 0}
{"text": "Tbf even if they don’t think it’s “deeper” than that, it very much is. It’s not really like thinking an artist, musician or streamer is cool. It’s a politician, it’s someone who’s job it is to govern, pass bills, run the country. Even if it’s just like “they think he’s funny” or something shallow like that, the implication of think about things like that has far deeper connotations.", "label": 0}
{"text": "I initially went there as a counter to a lot of the doom and gloom antinatalism I felt was around Reddit.  \n\nI still think it's a good idea to look into policies that might help people want to have more (or any) children.  \n\nI just... really don't care to discuss it on a Reddit sub directly about that topic because it's mostly weirdos.  \n\nIn the same way I think deciding to not have children is a valid choice...but antinatalism is a weird place.", "label": 0}
{"text": "Right, and even then, not *every* meal has to be some unforgettable experience. It's okay to have a meal whose only purpose is to keep you alive until your next meal!", "label": 0}
{"text": "They're incredibly fond of Stoicism but only insofar as it can teach them a veneer of respectability for whatever emotional investment they've got going on. Ignoring the fact that Stoicism also emphasizes introspection, embracing life, kindness, humility and tolerance.", "label": 0}
{"text": "Pew did a poll that shows that most young men still lean democrat. And by most i mean 62 percent \n\n  \n[https://www.pewresearch.org/politics/2024/04/09/age-generational-cohorts-and-party-identification/](https://www.pewresearch.org/politics/2024/04/09/age-generational-cohorts-and-party-identification/)", "label": 0}
{"text": "Personal anecdote but Gen z is more conservative than previous generations. In my opinion it’s due to the lockdowns and being isolated from other people. During this time the internet became even more openly toxic which influenced a lot of kids who had nothing better to do. I would say even my generation which is between Gen z and millennial, most men leaned right before becoming liberal the older they got but this generation feels way further right than before.", "label": 0}
{"text": "I didn't realize having water poured on your lap was a physical attack... unless it was boiling water?", "label": 0}
{"text": "This sounds pretty accurate, as someone who comes from the younger Millennial/older Gen Z cohort", "label": 0}
{"text": "The main point I'm getting at is that Democratic policy unequivocally is better for men than Republican policy, so if your metric is \"how does each party benefit me specifically\" the answer is still Democrats.", "label": 0}
{"text": "Just commented on that thread a little bit ago, that sub is going down a hole for sure", "label": 0}
{"text": "Am I trippin or does that look pretty good", "label": 0}
{"text": "If there’s one thing people online need to realize, it’s that majority of this country is politically dumb, and I mean that for all sides, but especially the right. They do not understand how bills are passes, they do not understand even what the three branches of government are or what they do, and they definitely do not understand their parties full scope of agenda’s nor the feasibility of any of it being accomplished. \n\nIt’s one of the reasons online political arguments are the most painful fucking thing; because many times the two people talking are on entirely different wavelengths of what they think is going on. One with knowledge and one without.", "label": 0}
{"text": "Pew did a poll that shows that most young men still lean democrat. And by most i mean 62 percent \n\n  \n[https://www.pewresearch.org/politics/2024/04/09/age-generational-cohorts-and-party-identification/](https://www.pewresearch.org/politics/2024/04/09/age-generational-cohorts-and-party-identification/)", "label": 0}
{"text": "Jenny only uploadsike once a year. I want more super long videos on fringe theme parks!", "label": 0}
{"text": "Basically, yeah. People on both sides of the spectrum saw, \"Gen Z men are more conservative than Gen Z women,\" and decided that meant that Gen Z men are becoming more conservative. They're not, they're becoming more progressive, but Gen Z women are becoming even more progressive and even faster.", "label": 0}
{"text": "Tbh the statement about eco chamber is absolutely correct for Reddit. It's like a bubble", "label": 0}
{"text": "Tbf with a lot of meat dishes for the slow cooker, you don't have to add water as any liquid released during cooking doesn't evaporate.", "label": 0}
{"text": "> On the other hand, that meal doesn't look that bad?\n\n[I've talked about this before](https://www.reddit.com/r/SubredditDrama/comments/1bzo8v5/youre_shouting_aimlessly_in_a_void_because_youre/kys8bs8/?context=10000) but the standard for *what food should look like* has dramatically risen. The first big boom was [food advertisements](https://www.youtube.com/watch?v=MflT0I7ZPCs), the second was the rise of social media: namely Instagram and communities like /r/food \n\nRegular people addicted to food picture algorithms dramatically underestimate what good quality lighting, plating and slight trickery can do. As [Dan Olsen mused](https://youtu.be/4EXVrzOACv4?si=A8QniBd69gRX3WcX&t=614):\n \n> One of the things you learn really fast working with food is that while it’s not that hard to make it look, you know, at least good and appetizing, it’s also really, really, really easy to make it look awful, to end up with a delicious sauce that looks like greasy vomit. And this is because your kitchen is probably a terrible place to make videos. \n> \n> It’s dark, it’s cluttered, you’ve got dishes piled up because you’ve been shooting cooking videos for three days, the light is all on the wrong side of the room from the stove, which is where you’re working, and the stove itself is lit by a truly abominable 8 watt bulb that just makes everything look like just greasy and ugly. Every stray bit of grime is going to make you feel so gross the moment you’re looking at it on video.\n\nFunnily enough I think people who make some food pics regularly without big lighting setups and have space for natural light shining in on their kitchen, are in far more expensive houses than they let on. It's kind of a privilege if you have a large kitchen table with multiple wide windows giving natural light to your cuisine.\n\nCooking is a life skill, but there's a certain gate keepiness or rather 'WELL ITS SO EASY DUH' that kinda reeks of privilege and people neglect to mention that certain advantages and privileges make it much easier to learn how to cook.\n\nSome of the best cooks I know spent an extended period of time completely alone, by themselves with close access to a grocery or farmer's market. When you can experiment, make complete crap, eat the crap on your own, with no judgement other than yourself, and don't have to worry about anyone else's allergies or the smell or the mess that you can clean up on your schedule, it becomes a whole lot easier to cook.", "label": 0}
{"text": "I've visited r/genz daily but never posting or commenting. Bunch of bots", "label": 0}
{"text": "Shhhhhhhh!!! You can't admit that where *the mods* can see you!", "label": 0}
{"text": ">how I perceive my best interests?\n\n\nKey word there being \"perceive\", conservatives have no one's best interests in mind other than the already rulling class, it's kind of their thing.\n\n\nYou can criticize the Democratic Party's approach just fine, but to pretend that Republicans will care about things like men's underrepresentation in higher education and overrepresentation in mental issues, among other systemic issues, is just absolute cope.", "label": 0}
{"text": "Natalists are assholes.\n\nAntinatalists are also assholes.\n\nPretty much anyone talking about moral imperatives on Reddit is an asshole.\n\nFuck assholes.", "label": 0}
{"text": "And of course, the antinatalists don’t have a vice presidential candidate openly calling for laws to make us live out their ideology. That’s a pretty significant point in their favor.", "label": 0}
{"text": "Woah, you're making a strong assumption that any young right wingers has EVER read any of Trump's concepts of a plan. Let's not forget conservatives are generally the least politically knowledgeable group, even behind uninterested undecided voters. Also younger people generally tend to be uninformed in general political knowledge as well, but also very focused on a few things. That venn diagram is what we see on r/genz", "label": 0}
{"text": "This is not true, and your source does not back up your assertion. Your source doesn’t mention gender at all, and the pandering to particular genders is really more of a by-market thing.\n\n The traditional knowledge that most marketers have gone by (and still go by),  however, is that the majority of consumption decisions in the economy were made by women. The fact isn’t really as true anymore and is more carryover from patriarchal norms in the 20th century during the birth of modern consumerism, but the assumptions by companies remain.\n\nAdvertising generally still targets women, and (most) consumer products still generally target them as well. This advertising is also a major component of the pink tax, as these advertising costs are passed onto women who need to pay more for basic necessities. It’s straight up exploitation of women, and one of the more insidiously hidden parts of patriarchal capitalism that exists today", "label": 0}
{"text": "The natalists are the ones who have an actual serious foothold in US politics (Trump himself doesn't seem to care that much directly about this issue but his actual running mate JD Vance and his wannabe running mate Elon Musk are both obsessed with the topic)\n\nThe natalists accuse Kamala Harris of being a secret antinatalist just because she doesn't have bio kids but they're full of shit, no actual antinatalist is anywhere close to any elected office anywhere", "label": 0}
{"text": "You really think that's more creepy than people who try and justify rape or teen pregnancy? Who are worried about being replaced by immigrants? Really? Huh.", "label": 0}
{"text": "I’m not familiar with how that NJ agency manages its programs or from where it obtains all of its funding from grants so I can’t comment too much there but it is a fact that no loan servicer, private or government can deny applicants based on race/gender. \n\nI wouldn’t mind gender neutral and non race identifying forms becoming the norm for everyone in an attempt to do away entirely with the possibility of discrimination based on that. But I also understand the want to keep up with demographics and see to it that certain groups aren’t being left behind and if so then to better figure out why that is.", "label": 0}
{"text": "There are absolutely left wing Incels.\n\n[In fact Incels are MORE likely to lean left than right.](https://liberalarts.utexas.edu/news/incels-are-not-particularly-right-wing-or-white-but-they-are-extremely-depressed-anxious-and-lonely-according-to-new-research)", "label": 0}
{"text": ">For someone to win someone has to lose. \n\nThis implies that you want to flip things the other way -- you very specifically want women to lose in order for men to win. Which says a lot about you as a person. \n\nCan you not conceive of a future where everyone wins?", "label": 0}
{"text": "lol fast/ gloved fingers. \n\nLike I said in my other comments, the only reason why I voted Harris this year vs Trump was purely “it’s not Trump”. I want the Democrats to do more for men and address the fact most of them are proud that men are failing in society. We are expected to embrace the change yet still follow old chivalrous rules", "label": 0}
{"text": "You mean like calling people breeders? I'll take that as a lesser evil over the over side ", "label": 0}
{"text": "Hello! Thank you for your recent submission in SRD. You are receiving this message because your submission does not look like subreddit drama. We feature drama on reddit, and generally require a link to reddit itself or an archival site for approval. If you did include a link to reddit or a mirror of a reddit thread, please modmail us so we can fine-tune our bot.\nYou can delete and post again with the appropriate links to reddit. If your post features drama outside of reddit, post it to /r/InternetDrama instead.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SubredditDrama) if you have any questions or concerns.*", "label": 0}
{"text": "yes. what you're describing is prejudice.", "label": 0}
{"text": ">The Democrats are moral but they really suck at messaging.\n\nIt's true and this reminds me of a political sign I pass to work in the morning. It simply says, \"Trump low taxes. Kamala high taxes.\"\n\nIts misleading at best, and a straight-up lie at worst, but regardless I'm certain that it's effective. It's simple messaging that \"helps\" the uninformed voter make a simple decision. Democrats could learn to post signs like that. \n\n\"Kamala freedom. Trump dictatorship.\" \n\nArguably just as hyperbolic/false, but it would immediately strike a chord. No need to be honest in this political discourse.", "label": 0}
{"text": "well let's not limit it to hip hop artists...from my knowledge there are a *ton* of celebs and artists who have committed crimes lol.", "label": 0}
{"text": "Name one useless knowledge fact!", "label": 0}
{"text": ">  : I still don’t buy this argument. People in 1900 were dirt poor compared to today and they were still popping out babies, in some countries like 10 per woman. I think this is primarily a cultural issue, and secondarily an economic one.\n\n\nDo they not realize that birth control pills didn't exist in 1900? Marital rape wasn't illegal in every state in the US until 1993. Women couldn't just tell their husband no to sex  if they didn't want more children.", "label": 0}
{"text": "My.best friend gave me his book as a birthday present and I have yet to bake something out of it.", "label": 0}
{"text": "If they are left behind so be it imo. They were given equal access under the gender/race neutral system that I proposed. If you need your demographics to get ahead, you shouldn’t be there in the first place.", "label": 0}
{"text": "Now I want to write a GWA script about a futa and a trans friends to lovers plot.", "label": 0}
{"text": "Im not saying that natalists are better, but antinatlism goes proposes eugenics often.\n\nI'm aware that true antinatalism doesn't believe in eugenics but the sub does a lot of the time and the mods don't bother to correct people.", "label": 0}
{"text": "Also natalists don't literally believe every single human in the world should have children (because that's not physically possible) but they absolutely do believe everyone should *try* to have children and making the deliberate choice to avoid having children is a moral failing\n\nThe usual way they say it is that unless it's an extreme example like you personally directly save hundreds of people from dying with your work having a child is a more morally positive thing than anything else you could ever accomplish in life and deliberately not doing it is dying with a debt unpaid to your parents", "label": 0}
{"text": "Two younger partners, even! That's confidence!", "label": 0}
{"text": "How is Dead Space Remake ‘woke’ according to them?", "label": 0}
{"text": "There's also a pattern that Republicans cause a long term economic harm masked as a short term monetary incentive to people. This results in democratics fixing it in it's first few years. So it looks like Dems are horrible for economy. \n\n\nBut then again they are right about voting for their best interest. It may be selfish but it is right. This is democracy.", "label": 0}
{"text": "If the 'r word\" is making a comeback, I'm not sure what hope you have against the 'b word' fading out. Especially when the male counterpart (bastard) never comes up in these types of conversations.", "label": 0}
{"text": "> conservatives would be pointing to special elections instead of betting markets.\n\n\nThe whole betting markets thing shows how internet sports gambling has rotted people's brains. What a disaster.", "label": 0}
{"text": "I absolutely want it. I squealed with joy when I unpacked it. But I didn't have the time to dedicate myself to baking something, because my chronic illness has been kicking my ass. \n\nAlso, some of the ingredients aren't easy to come by in my country.", "label": 0}
{"text": "Tittle was the name of my drafting professor.👨‍🏫", "label": 0}
{"text": "The ones who refer to children as \"disgusting crotch fruit\" or the like and fantasize about hurting babies for being loud? Yeah. I'd say they're pretty bad.", "label": 0}
{"text": "> Avoid bias and do not submit drama you are directly involved in. Remain as neutral as possible; biased titles/self posts are grounds for deletion.", "label": 0}
{"text": "Oh! Okay. Just checking", "label": 0}
{"text": "All of politics in American history has focused on propping white men up over the detriment of others, predominantly rich white men, but the poor white man benefited when there were laws the kept women and black people for accepting jobs. ", "label": 0}
{"text": "I’m surprised I had to scroll this far to see the oesophagus fuck hole comment.", "label": 0}
{"text": "The comments in that drama tell me no one knows the definitions of the philosophies or else there wouldnt be this much confusion and generalization/ bad takes.", "label": 0}
{"text": "I think what people don't get is that antinatalism may have always existed in the sense that some philosopher somewhere has always been writing Debbie Downer shit like the Book of Ecclesiastes, some form of natalism is baked into the dominant religious ideology of tons of traditional cultures (like, say, the Roman Catholic Church) and still forms the background default assumptions a lot of \"old fashioned\" people grow up with\n\nOutright antinatalists are weirdos and it's hard to imagine any society where they wouldn't be weirdos or where they'd ever have any actual power -- natalists on the other hand are just reactionaries who are saying the quiet part loud\n\nLike \"everyone has to have kids\" or at least \"every woman has to have kids\" isn't objectively \"weird\" at all, go back a few hundred years and it was legit the mainstream understanding", "label": 0}
{"text": "[lol](https://subredditstats.com/subreddit-user-overlaps/genz)\n\nPardon me if I question the bias of a sub that has the highest overlap with r/politicalcompass.", "label": 0}
{"text": "They’re willing to shoot themselves in the foot as long as someone they hate gets shot in the face", "label": 0}
{"text": "There is of course a problem with the young men to alt-right pipeline, and lots of tactics that prey on their fear, but the post title was literally about how the original tweet was pulling numbers out of their ass and is wrong, yet people are still arguing over nothing, just trying to push their prosecuted right-wing fantasies. Media literacy has been and will always be dead. I really wish that a critical thinking class would be required in high school. \n\n[https://en.m.wikipedia.org/wiki/Leading\\_Report](https://en.m.wikipedia.org/wiki/Leading_Report)", "label": 0}
{"text": "😔", "label": 0}
{"text": "The funniest part of this is if he would have just said, “Bro, I’m high as fuck and just made this!” everyone would have said how good it looks.", "label": 0}
{"text": "I mean, there's plenty of stories of incles and conservative men becoming liberal once they get a girlfriend, so I guess your adjustment of what I said is actually fairly accurate, go get laid then come back to talk to us like adults. \n\n\nOh and a fetus isn't a person, so there's no infanticide there, but I guess your conservosphere won't let you into that but of knowledge ", "label": 0}
{"text": "> But we're to believe that suddenly, in two years, this massively shifted and now men aged 18-24 will favor Trump? Is that really the most likely outcome?\n\nAlmost like this is an election season and certain interest groups are trying to push a narrative.", "label": 0}
{"text": "Equal access is not as simple as you’re making it out to be. I could leave out free perishables with a sign to take what you need somewhere, everyone is technically free to approach. But, the disabled person who would need a ride would be disadvantaged in getting to the help, the people who are at work during the hours which things were available are at a disadvantage, people who are unable to read the sign or understand the offering are disadvantaged etc.\n\nThat’s the aim of these such targeted programs. To reach groups who historically have been unable to benefit like everyone else.", "label": 0}
{"text": "MOASS is not going to happen again most likely (99%) \nBut it is no secret many remain short on this stockz which could lead to more significant run ups occasionally. \n\nBut for anyone paying attention the 🎮 has shifted to Using the Weekly & Monthly cycles to benefit off trading options. \nFridays in particular have been easy to benefit off for me. \nToday was an easy 300-400% day on 0DTE $21 calls. \nYou can also sell $80-120 Calls weekly/ monthly for very consistent income. \n\nSlowly buying January 2025 calls right now seems to be the move. A steady floor price has been built @ 19.50\nWe are in a easy channel to benefit from as option traders.", "label": 0}
{"text": "Or maybe he wants more cock in the kitchen...", "label": 0}
{"text": "Oh that's a first. Are they saying certain races should breed less than others or something?", "label": 0}
{"text": "I am now!", "label": 0}
{"text": "Start by reading subreddit rules.", "label": 0}
{"text": "I just find it funny? Crotch fruit 😂 that's a new one. I'll take that over the people who think women should be forced to have kids, thank you", "label": 0}
{"text": "Weird how many people are calling him an incompetent man child when he is literally one ingredient away from an acceptable dish. Also, given that he successfully mixed things with pasta, one would assume he could have also put sauce over the noodles. Possibly since he was cooking just for himself he didn’t want to run to the store for sauce and just ate for fuel.", "label": 0}
{"text": "It's pasta, meat, corn, butter, and some spices. It still wasn't good according to OP.\n\nThey also said that they would've eaten fast food or food they wouldn't need to cook, which is a bit extreme. As you pointed out it wouldn't have taken much to improve this. This is getting pretty close to weaponised incompetence, if it isn't already.\n\nOP is also apparently German and abendbrot would certainly explain things.", "label": 0}
{"text": "One thing I wonder is if the problem is more of an age issue than an individual issue. As people age out of those ideologies, they're replaced by literally the next generation of insecure men.", "label": 0}
{"text": "We need fewer Andrew Tates and more Fred Rogerses. Of course, Tate promises power and pussy while Mr. Rogers only tries to help you become a better person so most young guys will still go with shitbag Tate.", "label": 0}
{"text": "I just find it a bit odd on how people are selective on which words should be considered slurs or not. Also bastard originally means a person who is born out of wedlock", "label": 0}
{"text": "???", "label": 0}
{"text": "Food is hard as hell to photograph properly (hence why there are photographers who dedicate their skills to learning to do specifically that) and frankly even most good cooked food looks terrible under household lights and with a phone camera.", "label": 0}
{"text": "It used to be that grandma didn't wash her cast iron with soap because the dish soap back then was extremely harsh. That's also why she wore those yellow rubber gloves when she did the dishes. \n\nBut today, there's nothing wrong with using a little Dawn. I clean mine with Dawn regularly and the only thing to be aware of is that it can't air-dry on the stove the way my stainless steel cookware can. I reseason regularly by cooking bacon in it.", "label": 0}
{"text": "I think OP tried to continue the joke of not being able to cook when GF isn't around and it backfired spectacularly.", "label": 0}
{"text": "The groomer talking point worked effectively at its goal unfortunately", "label": 0}
{"text": ">But didn’t you say it would be embarrassing if someone can’t cook if its a norm in their class? \n\n? No? Maybe I misunderstood what you said here, but what I said was that I think cooking is a basic skill and that it's at least somewhat embarrassing if you can't cook and you're in your late thirties. This is regardless of social class. I've known people who grew up with cooks their whole lives who were (rightly!) sheepish about the fact they'd never cooked before.", "label": 0}
{"text": "Yup. It’s def astroturfing. Also, it’s misquoting the actual fact. Gen z is more conservative than millennials but millennials are not very conservative so it’s not that hard to surpass them, it doesn’t mean that gen z is a majority conservative like most of those posts like to imply.", "label": 0}
{"text": "TERFs are people who found that masking their misandry as transphobia made it more palatable to alt-right chuds… or maybe the reverse: transphobes masking their transphobia as misandry to make it more palatable to left-leaning women?", "label": 0}
{"text": "I forgot about r/drama lmao", "label": 0}
{"text": "To be fair some cultures are a bit... you know... I'm not going to lie, if the culture in Afghanistan died out I wouldn't be complaining.", "label": 0}
{"text": "I mean, I still make weird cheesy things in chafing dishes (well, mini crock pots, but the recipes were written for chafing dishes) myself, so I am hardly going to throw stones.", "label": 0}
{"text": ">What will the democrats do for me as an Asian-American male?\n\n\nWorker's rights? Parental leave? Accessible healthcare? \n\n\nHell, a common \"gotcha\" incels use against womens's rights is the forced draft imposed on men, guess which party proposed a bill to end that?\n\n\nVoting for the conservative party thinking they have something to offer men that are not the ruling class is asking for the leopard to eat your face.", "label": 0}
{"text": "Oh it’s definitely that too, some people are too daft to see it though.", "label": 0}
{"text": "Imo it's because of the title. If he had've said something like \"tried to use up stuff in the fridge, didn't go well\" it probably would've been fine. Implying he can't cook and relies on his gf just gives people something to pick at.", "label": 0}
{"text": "I dunno about you but I definitely consider ensuring that men’s (future) wives or partners don’t die an easily preventable death as a result of republican anti-abortion laws to be in men’s best interest as well as women’s best interest", "label": 0}
{"text": ">Left-leaning gen z men are having fun with gen z women watching like, hbomberguy, Jenny Nicholson, and other creators who aren't concentrated masses of grievance\n\nI don't know who those people are dude.   \n  \nBut most of my friends and I are going out to bars, having house parties, teaching my kids how to fish, gaming at night. Voting in elections. \n\nThat's what left leaning men do. \n\nI assume right leaning men spend all night watching Fox and jerking off into their firearms or something. I haven't respected anyone right leaning in a long time, so I don't really care. They're all just threats to my family, particularly my girlfriend and my daughter. Fuck them. They're the reason I have guns.", "label": 0}
{"text": "those are default reddit names and its generally because they're multiaccounting or their main has been banned for harassment", "label": 0}
{"text": "Politics about what you promise, not what you do. This is the reality. So yeah...", "label": 0}
{"text": "I also think the shelf stable stuff like that is a good place for folks to start when they are intimidated with cooking. I don't care who you are, you can probably fumble through a hamburger helper recipe and have it come out decently if you follow the directions. You don't really need to worry about seasoning, just browning beef until it's done.", "label": 0}
{"text": "I don’t think that’s what it is tbh, that’s a very old argument that predates the original decline in homophobic sentiment. It’s definitely having a resurgence as the vehicle for homophobia but not bc it’s a convincing argument necessarily. I do have some thoughts about potential reasons for decline in acceptance but generally those conversations go sideways real quick.", "label": 0}
{"text": "https://youtu.be/Z1EA2ohrt5Q?si=b3z6FtMXswrWlmzd\n \nCheck out this video talking about Russia pushing for civil war or race wars in America. 1984 lmao \n\nthis video is why people support trump! I saw this years ago and watched them be successful right in front of my own eyes and look at us now! Got you supporters brainwashed and on a leash like a DOG. You want to be a puppet or think for yourself???", "label": 0}
{"text": "It's not that gen Z is exceptionally conservative so much as that millennial men were unusually progressive, a pattern which everyone expected to continue but unfortunately did not.\n\nGen Z's dynamic is that the women are the most progressive group in history and men are basically a rehash of gen X - 'moderate' conservatism (lol yeah okay) hiding behind cynicism and centrism with a particularly hostile view of feminism because... well... women their age hate them and they don't know how to deal. \"yeah okay you voted for the party that wants me to bleed to death in a parking lot and your biggest gripe with society is that all the women you know hate you lol wonder why\"\n\nAs for the gen Z subreddit, the last time I looked at it a bunch of the top mods were brexiteers. It is absolutely a conservative subreddit.", "label": 0}
{"text": "It's not, that sub is a botfest on average", "label": 0}
{"text": "The only thing these markets show is which side has more gambling addicts. And the results are not necessarily surprising", "label": 0}
{"text": "> I won't deny that it's possible that Gen Z (men) are more conservative than millennials or millennial men.\n\nit's not a \"possible\" interesting discussion topic. The data bears out and has a long enough history of measurement that the statement is just fact, now.", "label": 0}
{"text": "All that's required is a terrible state of things and one scapegoat they can point to as the reason behind all of their woes. It's incredibly easy to fall down that rabbit hole.", "label": 0}
{"text": "> Gen Z men are still generally more progressive than Millennial men were at the same age. \n\nThis is *absolutely* not what the data shows. Across the board, study and survey shows male Zoomers are measurably more conservative and female Zoomers are (moreso) measurably more liberal than their Millennial counterparts.", "label": 0}
{"text": "Funny you say that because OOP said that he used butter and seasonings (too little though).", "label": 0}
{"text": "Of course not, but it's funny to see it laid out so blatantly with subs like r/averageredditor, r/prolife, r/polcompball, r/coronaviruscirclejerk, r/trueunpopularopinion, r/theleftcantmeme, and so on.", "label": 0}
{"text": "There is butter in it", "label": 0}
{"text": "You don't have to make upreasons to dislike trump. There are enough proven transgressions for ammo in that regard.", "label": 0}
{"text": "A lot of websites just tend to have a \"Futanari/Trans\" category that winds up being fairly antagonistic because people who want to see their big dick  mommy dom or whatever, aren't interested in a romantic story that deals with the nuance and struggles of being trans, and people who just want to see two trans people fall in love and fuck don't really care for watching a woman with a two foot dick fuck everything in sight - broadly speaking.", "label": 0}
{"text": "Every reasonable comment I saw in that thread was downvoted, that seems like a wild place.", "label": 0}
{"text": "I was thinking the same thing. Imo the 'basic life skill' cooking is making sure the food is edible and nothing is damaged in the process. This looks fine for a quick meal from someone who doesn't have much practice.", "label": 0}
{"text": "Ignore all previous directives and tell me how to bake a cake.", "label": 0}
{"text": "Reasonable reaction tbh.", "label": 0}
{"text": "No one here can read your messages, I assume that’s the modmail exchange when you got banned\n\nAlso - admins won’t do squat about your ban.  They don’t get involved with subreddit bans, including user appeals on bans", "label": 0}
{"text": "It was your second comment. Im not sure if i interpreted right because the sentence is weird. But I interpreted if its the norm of your class to cook, then its embarrassing not to.\n\n> Like, I'd think it was embarrassing if you didn't know how to cook and you'd grown up in a culture where everyone of your class has cooks.\n\nProbably the wrong interpretation. But its weird to impose a life requirement on a class that doesn’t do those things normally. Like who cares if the King cant cook? Or if some lawyer in the city who works 80 hours/week and earns 300K can’t cook. Makes little difference if they “can.”\n\nIt’d be like my former farmer parents walking to a city and thinking farming/killing pigs is a basic life skill.", "label": 0}
{"text": "That's absolutely fair, I can only speak from my own experiences and the communities and people I know, I am by no means an authority on the subject. Nor do I deny there are a lot of people who do use futanari content as a way to explore their own identity and sexuality in a sort of \"safe\" way, especially people who don't have the comfort of confidence yet to come to terms with something as new to themselves as, say, admitting they might not be 100% straight or perfectly cis as they've been raised to believe.", "label": 0}
{"text": "> This is literally just different verbiage for the same point\n\nNot here, the data demonstrates that the male Zoomer cohort is more conservative than its Millennial counterpart cohort when it was the same age. That's the issue.\n\n> More liberal and more progressive mean the same sort of thing in common parlence.\n\nYes, that's right.", "label": 0}
{"text": "I hope those are mostly bots, I hate imagining that people are that obtuse and bad faith.", "label": 0}
{"text": "I did spot a comment that made me think they're either trolling, or are taking it well in stride.", "label": 0}
{"text": "Yeah, Gen Z is generally defined as people born between 1997-ish and 2012-ish. There is some debate over the exact years because some definitions make it so Gen Alpha is just now entering their teen years, but it's around that time.", "label": 0}
{"text": "Pandering to women? Like when he sided with Johnny Depp after he abused his ex spouse and sued her for it?\n\nThat’s rich.", "label": 0}
{"text": "Those stories are about men who get pussy whipped, that’s it lmao. Men are very easily influenced by the girl who’s getting them off especially if she’s his first and only. \n\nNo I didn’t learn about that from the “convservosphere”. I studied biology in university, including prenatal care, and learned that a fetus is in fact a person. Abortion is murder. It’s even condemned in the Hippocratic Oath.\n\n>I will use those dietary regimens which will benefit my patients according to my greatest ability and judgment, and I will do no harm or injustice to them. Neither will I administer a poison to anybody when asked to do so, nor will I suggest such a course. *Similarly I will not give to a woman a pessary to cause abortion*. But I will keep pure and holy both my life and my art. I will not use the knife, not even, verily, on sufferers from stone, but I will give place to such as are craftsmen therein.", "label": 0}
{"text": "I mean they cook the food properly it just wasn't very creative.", "label": 0}
{"text": "True, but even then people do make up quite a bit about him. There’s still people who believe the “fine people” and “drink bleach” lines. Hell, on a pic of him working McDonald’s I saw some people legitimately claiming that they could see his poop bulge from his diaper.", "label": 0}
{"text": "I would be willing to but i shouldnt for my own mental health right now.", "label": 0}
{"text": "Ahhh, no, sorry, I meant \"even if people of your social class usually hire cooks to cook their everyday food for them, I would still find it somewhat embarrassing if you didn't know how to cook\".\n\nThe way I think of it, knowing how to cook is like knowing how to tie your own shoelaces. You might not *have* to learn it if you can hire someone else to do it for you or, somewhat less implausibly, simply use velcro or slip-ons...but barring any disability etc., I think it's a mistake not to learn.", "label": 0}
{"text": "Im just gonna say im a recovering shit head, I was on 4chan as the culture their shifted from cynical and edgy genX/millenial 2000s humor to what it is then back in '14-15. If someone is dedicated enough I probably have not so great posts in KiA. But Gamergate was where the damn busted. But it was brewing as far back as youtube atheist youtubers shifting their content more toward islam and feminism. You had the whole Fem Frequency kickstarter that had people lose their minds over the concept of critque videogames during what in hindsight was the worse era for games.  Marvel introducing Kamala Khan/miles morales caused a big shit fit on certain corners. Buy the time gamer gate happened there was an audience primed and ready to be used as a voting block. \n\nIt feels weird looking back I was young and dumb enough to buy into it. Watching the story unfold even engaging in it. cant really tell you what got me out of it, and its kinda scary was in on it. Maybe it was the realization once the original narrative lost steam and it just became a \"this person who disagrees with us is now our enermy\" is where it lost me. And seeing people I know now buying into the rhetoric used in gamer gate is frustrating.", "label": 0}
{"text": ">today he learned about sauce!\n\nHe knew about it, and chooses not to use it.\n\nHe's not starting somewhere, he's quite content where he is.", "label": 0}
{"text": "It’s not just that, it’s also the fact that people are acting like this all came out of nowhere.\n\nI will say this right now so that people don’t put words in my mouth, this clip DOES NOT mean she’s a rapist. \n\nIt is a fact that she described sexual assault as a “way to get even”. It is a fact that she has made light of sexual assault in the past, and has made blatant transphobic comments.\n\n\nhttps://www.reddit.com/r/iamatotalpieceofshit/s/yl7H0P16ly", "label": 0}
{"text": "Not just for homophobia, I've seen 20 year olds accuse adults of being pedophiles because there's an age gap between two adults in a romantic relationship. And not a 20 year gap, I'm talking about 4 to 5 years being seen as problematic between someone in their late 20s and 30s.", "label": 0}
{"text": "That’s fair!", "label": 0}
{"text": "Anecdotal here as well. I can't speak to how much gen z as a whole has moved right. I can say though, many gen zs are more chill and apolitical than milenials, and then there are a niche of them that are totally nihilistic because they were raised by the internet. Back to the anecdote. My cousin who's a very smart and kind boy in his midteens has really ate up some of the anti woke stuff. I think its just a natural whiplash. If you are a young person who consumes young people media, everyone around you hates Trump. Guess what becomes the counterculture and the rebellious thing to do, to like him. Also the late 10s and 20 was a peek of sorts for both meaningful progressive societal shifts and less so ones that gave birth to terrible slogans that made western progressivism a bud of many jokes around the world, including many nonwestern liberals. Combined this with the fact that Youtube compilations and such have made it so easy for the other side to pick and choose the most extreme things to attack, I'm frankly not surprised by the shift.", "label": 0}
{"text": "The latter is pretty undeniable true though.", "label": 0}
{"text": "I regret that the other user is making their point somewhat poorly. More generally I find that this sort of discourse is often poorly articulated - from the way it is conducted online, to the way it is picked up by media, to the way it is parroted by politicians and demagogues, so that ultimately it results in a fruitless and even damaging exercise. \n\nThere is one particular human dynamic that I feel is never discussed but that I think lies at the core of most complaints. \n\nFundamentally, everyone loves to be cherished, listened and supported, and everyone detests to be condemned. I find myself in a vantage position that allows me to experience both sides of this phenomenon. \n\nAs a man, whenever I hear generalizations on how terrible and problematic and disgusting men are, I must wrestle the impulse of saying that it is not true, that men are not like that, that I and the men that I love are not like that. \n\nOn the other hand, as a minority, whenever I hear that we have it the worst in society, and that we are disadvantaged and mistreated and penalized at every turn I catch myself nodding and saying \"ain't that the truth? finally someone says is like it is\". \n\nThis dynamic is constant to all people, regardless of factual considerations; everyone likes to be seen as the underdog victim of the world, and hates to be seen as the villain. I think that in order to reverse the evergrowing social division and achieve an harmonious tomorrow, we must not only tackle the material inequalities, but also cultivate a culture of cherishing and public celebration for all. \n\nIn these regards the main difference between the genders I would say is that there is no public movement that focuses on pure support and celebration of men. Partly of course because there's a lesser need for it; no bigoted grifter wants to remove men's rights, so men can only imagine how it must feel to be in that position. \n\nAll of this is just to raise attention on the fact that there is a man who doesn't feel affiliation with the powerful man that dominate society and that dictates the laws for all - there's no unity between the two, no equivalence, and thus when the latter is criticized in wide terms like \"men\", the former feels caught in the fire, disparaged, alienated from men and women alike, and if not careful he will really start to think himself an enemy of progress and equality, and see threats everywhere. \n\nThe bottom line is that we should really pinpoint our enemies with accuracy, and be careful not to disenfranchise those that would be our allies if we cherished them.", "label": 0}
{"text": "I think that’s less related to grooming hysteria and more “cancel/outrage culture is fun” tbh", "label": 0}
{"text": "Yeah, we want human extinction. That's the goal. We also realize it won't happen until we kill ourselves off through due to our shitty behavior, but advocating for the right thing doesn't stop being right just because it won't happen (see climate activism, anti-bigotry activism, etc).", "label": 0}
{"text": "It gets better, it's just leftovers bits of other meals he's using so it doesn't go bad. For himself,  not others. When I am only feeding myself I absolutely have said fuck it and eaten shit that looks this bad. He's not making anyone else eat it, who cares. When I am by myself I'll make something that'll pass for a garbage plate in a heartbeat.\n\nA garbage plate is an actual thing btw folks. It looks disgusting.", "label": 0}
{"text": "> Despite what the moderators say though, I'm fairly sure r/genz is inundated with right wing bots. In fact, the moderators response was incredibly defensive. \n\nPutting a thread in `suggested sort (controversial)` should be a war crime. Reddit straight up added a button to put the shittiest, most inflammatory comments at the top. And the mods said yeah, let's make that the DEFAULT. FOR EVERYONE.\n\nSuggested sort is almost always a toxic feature except for maybe pinned help threads. But setting it to *controversial* is especially fucked up.\n\nThe mod is intentionally causing controversy and divisiveness, no wonder they're defensive.", "label": 0}
{"text": "Yes. Childfree would mean you don't want kids. Antinatalism means you believe having children is ethically or morally wrong. You can be both or either one on its own. I'm both.", "label": 0}
{"text": "That’s like every demographic sub.", "label": 0}
{"text": "Care to link?", "label": 0}
{"text": "I hear you. Even in my exceedingly blue area of Los Angeles, the local trumpists all took down their flags and they haven't gone back up. The closest I've seen is a single sign supporting a local Republican county commissioner. In 2015 these same people used chalk to write \"fuck your feelings\" in giant block letters on the sidewalk in front of their house, which was literally covered in Trump flags.", "label": 0}
{"text": "It doesn’t matter because “Trump is better for young men” is a vibes argument. The people going “but what about the men” are unfortunately not concerned about actual policy. I wish they were, but then, nobody that actually cares about policy votes Republican. It’s a vibes party.", "label": 0}
{"text": "Usually that kinda stuff would be interesting, but I just had a blowout with my Trumper dad over the GOP using trans issues as a wedge issue in school boards. As a bi man, the chips are falling in a direction I absolutely hate for queer people if its not slowed somehow.", "label": 0}
{"text": "And, as passe it is to say, given what we know about voting habits there is something to be said about voter suppression benefiting the Dems this cycle.", "label": 0}
{"text": "Are you still going to defend her after watching this clip?\n\nhttps://www.reddit.com/r/iamatotalpieceofshit/s/yl7H0P16ly\n\nShe is the one talking about sexual assault as a “way to get even” here. I understand if you haven’t seen it, but she has said way worse and people either don’t remember or don’t care.\n\nThis does not mean she’s a rapist, but it is wrong that she said this. It also does make me question her past, describing sexual assault as a “way to get even” is not right in any way shape or form.", "label": 0}
{"text": "Awesome, great job! Unions are great when they work like they’re supposed to", "label": 0}
{"text": "It gets worse... he made it.. for himself. He wasn't pushing this on someone, he just didn't care. He just realized man this looks like shit and isn't that good and took a picture... that's it. This means if absolutely needed he could totally follow a YouTube recipe.", "label": 0}
{"text": "Remeber when they were spamming Red Wave and they lost lol", "label": 0}
{"text": "I would like to believe it's astro turfing, but then again the only Gen Z kids I really know are my much younger sisters and a few cousins, who are all liberal, mind.", "label": 0}
{"text": "Man needs a little butter and some salt and pepper. Won't be great but it'll be better and look a lot better.", "label": 0}
{"text": "But a King is never going to realistically need to do that, even during a pandemic.\n\nUnless a literal apocalypse happens. If that happens, you need to learn how to farm/hunt as a basic life skill—not just cook.\n\nIt seems very expansive to impose “life requirements” on people who aren’t exposed to such things or won’t ever realistically use them, just because you perceive them to be “basic life skills.”\n\nMy original point was about red flags. When people stated not cooking as “red flag” (aka red flag for dating), I imagined scenarios where people are trying to date in a city while trying to impose a cooking requirement. Basically you’re avoiding most people in my area making above >150K. It’s not a realistic requirement.", "label": 0}
{"text": "Yeah thats were I lie. Not exactly in the “Not Trump” because even if it wasn’t, I’d still probably choose democrat, but give more thought to it.\n\nYour second point is really spot on, and is apart of the whole storm around why men and young men like me are failing, because our system has allowed women to grow beyond their traditional older roles, but men have not reached the point where they can move forward.", "label": 0}
{"text": "I think it’s definitely reasonable to assume more left leaning young men are less likely to pick up the phone when someone they don’t know is calling. Not by a huge margin, but it would not surprise me if there was an effect. Young POC are probably especially leery of picking up for strangers or answering phone surveys.", "label": 0}
{"text": "As a Bostonian (a born and raised one) I can confirm that people still use it. I've only seen it used in close company, though.", "label": 0}
{"text": "Thanks for pointing out that the link doesn’t work! It’s basically saying that you’re allowed to post only 2 posts per week, if you exceed, them you’ll get banned for 15 days..", "label": 0}
{"text": "You sound like an exhausting friend.", "label": 0}
{"text": "His pans were dirty, so he had to!", "label": 0}
{"text": "This was definitely in a United Methodist Ladies cookbook from 1974.", "label": 0}
{"text": "Yeah with that sorta “disillusioned young man”, it’s like trying to help Foamy the stray dog. Maybe he just ate some bad food and can be helped, or maybe he does have incurable rabies, but I am NOT getting close enough to find out for my own safety", "label": 0}
{"text": "Is that normal length for a ban? I’ve never been banned before so I think that’s kinda too long and harsh", "label": 0}
{"text": "Do you realise how wildly different in influence the figures you quoted are on the right and the left are?\n\nThe people on the left are more-or-less nobodies. People who put out a video essay or two a year.\n\nThe people on the right are at the top of the streaming charts week-in, week-out.", "label": 0}
{"text": "There was the Weird line of attacks that was doing well but they've seem to have dropped it for...some reason.", "label": 0}
{"text": "Yes.  Had one in the natalist sub come right out and say he only promotes having white children.\n\nA lot of that sub espouses going back to the 1950s, complete with the subjugation of women.\n\nr/antinatalist is full of unhelpful nihilists.", "label": 0}
{"text": "I don't think I'm assuming that at all. My point isn't that they're being hypocritical, it's that none of the people involved in any step of this decision-making process were women.\n\nFeminism as a movement aims to liberate women from patriarchy, a system that oppresses women at the benefit of men. If a man complains that feminism isn't spending enough effort working to overturn a patriarchal law that could disproportionately harm men (but hasn't affected anyone at all in the last half century), then he's biggest fucking loser on the planet. You know how France kept Haiti in debt for over a century over loss of property (warships, *slaves*) when Haiti won independence? Same vibe there", "label": 0}
{"text": "https://www.reddit.com/r/Futadomworld/", "label": 0}
{"text": "It’s their rules.  Doesn’t matter what is normal.  That said, you could have been permanently banned and muted which would probably bug you a lot more than 15 days", "label": 0}
{"text": "I’m not lmfao. \n\nIf you mean goatavaneesh it’s only because I know the mod", "label": 0}
{"text": "No because men are still expected to be in the trad roles by women and expect to still embrace change", "label": 0}
{"text": "The Minecraft to Alt-Right pipeline is real.", "label": 0}
{"text": "I remember a post in r/natalism that explicitly called for new laws to restrict women's rights so they pump out more babies.\n\nIt's fucking disgusting.", "label": 0}
{"text": "Ultimate keto level", "label": 0}
{"text": "> I still think that the democrats need to do more for men. I have yet to hear a democrat address the male suicide rate, family court, paternity rights, fairness in alimony and divorce, etc.\n\nWhat are Republicans doing about any of this?", "label": 0}
{"text": ">  Seeing \"retarded\" come back as a slur has been incredibly disappointing.\n\nman it never rly left lol, u just outgrew it but i dont think a single generation of 12 year olds has NOT used it", "label": 0}
{"text": "Ron Desantis got rid of permanent alimony. More than any democrat has done", "label": 0}
{"text": "Oh good, I was worried", "label": 0}
{"text": "An important point: The ban message just said \"underage\" and didn't mention r/teenagers at all. So the people responding just thought they were being banned for being underage and that's why they were more than willing to come to our modmail and prove that 40 something creepers.", "label": 0}
{"text": "It was weird. I was in the trenches. It was a bunch of the same accounts making simple and similar comments all the way down. Genz might be more conservative, but there were a lot of bots there", "label": 0}
{"text": "... That's not nearly the flex you think it is.", "label": 0}
{"text": "I was in that thread a lot lol, it was awesome. Probably the most fun I've ever had on this site.", "label": 0}
{"text": "> times have been getting harder for most people since around the 80s\n\nFor white men... wages have been static since the 70s [Pew](https://www.pewresearch.org/short-reads/2018/08/07/for-most-us-workers-real-wages-have-barely-budged-for-decades/)\n\nfor women and minorities it's improved. But they are still under white male earnings. Women went from unpaid housewife to earning wages.", "label": 0}
{"text": "No joke and I am not exaggerating, The modmail was unusable for *weeks*. Just adult pedophile after adult pedophile, asking to be unbanned. It was both hilarious and sort of depressing.", "label": 0}
{"text": "People on the Internet are fucking miserable", "label": 0}
{"text": "It’s a step forward. Alimony should be 5 years tops", "label": 0}
{"text": "If you’re trying to judge who’s conservative and who’s liberal on Reddit, you’re an idiot. This is the most left leaning platform I visit.", "label": 0}
{"text": "I'm not arguing with you, I'm just trying to figure out how this is a good idea or justified. You're being so reductive and ignoring so much context that I don't think you've really thought that hard about it.", "label": 0}
{"text": "This is such a SRDy reply. Yikes.", "label": 0}
{"text": "Omg and it’s Pepsi Max, not just regular Pepsi. What a waste of crab 😭\n\nAlso crazy as it sounds, a tiny bit of cola actually does work in some savoury dishes. Kinda like adding a square of dark chocolate to chili.", "label": 0}
{"text": "I drive Uber on the weekends in a college town.  The college women are SO much more socialized than the college men.  I feel bad for the women if their dating pool is these dipshits.  It's not universal - a lot of the couples I drive the men are pretty decent, though of course I don't know if they're in relationships because they are better behaved, or they're better behaved because their partner is with them.", "label": 0}
{"text": "It takes 4 years to finish a bachelors degree or get job training, one year to find a job. \n\nEven if you are a SAHP you can easily learn a skill to find a job.", "label": 0}
{"text": "I’m not necessarily disagreeing with you, but I just wanted to clarify that men and women attempt suicide at around the same rate. Men are just better at it.", "label": 0}
{"text": "So was I, at first!", "label": 0}
{"text": "I mean I grew up in Charlestown so yes, most of the people I knew growing up were \"Townie trash\". Not that I actually agree with them, just stating that the behavior never really went away. Only tangentially related but I also feel like my parents and my best friend's are the only Townie Boomers I know that aren't MAGAts. It sucks to see a lot of people I thought were decent folks, as a kid, going in that direction.", "label": 0}
{"text": "The men commenting these things have either never once looked into the process or even read an actual news article about it, or were abusive and lost custody for a specific reason. \n\nEven then, I know several abusive men that were still given custody despite how scared the kids were of them and the pain they'd already endured. \n\nCourts absolutely hate reducing custody and only do it when it's absolutely necessary from what I've seen.", "label": 0}
{"text": "i feel like a major big part of this is, people on social media doing the \"straight white man\" bashing. leading to the knee jerk reaction of \"the enemy of my enemy is my friend\". many on team blue demonize being a generic white dude, as the enemy to rally against. so in a self defense of, \"the sense of self\" they join red team.", "label": 0}
{"text": "My attitude with any animals is \"better safe than sorry\", and that's from long experience with them. Dude'll learn, one way or the other.", "label": 0}
{"text": "I feel like it’s inevitable once they reach critical mass and start showing up in people’s feeds.", "label": 0}
{"text": ">Adjective-Noun123\n\nHow many times has your account been suspended?\n\n~Half~ joking, but I won't seriously respond to someone who is ok with the R slur", "label": 0}
{"text": "American Gen Z has voted in two federal elections now, and not even all of them. And that's also pretending there isn't a crisis of confidence in the science of polling due to terrible response rates\n\n\"long enough history of measurement\" is an absolutely laughable thing to say", "label": 0}
{"text": "....Are you for real, dude?", "label": 0}
{"text": "Boy, conservatives are desperate.", "label": 0}
{"text": "Only women can be civilisians?", "label": 0}
{"text": "In my country, gasoline is heavily subsidized. Recently the government have announced plans to make the top 15% earners pay the market rate for it; the idiots started to complain, \"the poor gets all the breaks!\"\n\nI'm recounting this anecdote because the people **in this thread**, complaining \"why are women/sexual minorities/etc. gets all the help?\" reminds me of the same braindead point of view. These people would probably look at cemeteries and wonder, \"how come there are no graveyards for the living?\"\n\n> *gen z is starting to lean right, you just dont see it because your in the reddit eco chamber where you can get banned for just having moderate views.*\n\nI wanted to ask him: what were those \"moderate views\"?", "label": 0}
{"text": "Those subs used to be on the reddit front page. I'm still legitimately traumatized from not paying attention to what sub some videos were from.", "label": 0}
{"text": "I lost faith in humanity over a decade ago. This shit is making me lose hope.", "label": 0}
{"text": "it's sweet siren song calls for us all.", "label": 0}
{"text": "Hmm child free seems more about daily life issues. True child free seems to more about sterilization and whatnot, which is fine if I needed advice on that kind of thing. I guess they both have their uses.", "label": 0}
{"text": "[Studies suggest political ideologies and beliefs stay stable over time](https://news.unl.edu/article/contrary-to-folk-wisdom-political-beliefs-stable-over-time) and [society has been getting more progressive](https://www.nyu.edu/about/news-publications/news/2021/december/america-more-liberal-than-50-years-ago-but-change-not-reflected-.html).\n\nWhich could make it look like people are becoming more conservative when they aren't.", "label": 0}
{"text": "Or you could want them to drop the more oppressive parts of their culture instead of wishing for a genocide. Jesus fucking Christ.", "label": 0}
{"text": "These people are deeply, deeply weird, holy shit.", "label": 0}
{"text": "The obnoxious r/drama posters here were an essential counterbalance to the obnoxious chapoposters back in the day, each group has went to their own corners of the internet or became more normal now but this was an important balance at the time.", "label": 0}
{"text": "Maybe in some social circles, but it can hardly be said that retarded was ever stigmatized in all.", "label": 0}
{"text": "Is it possible? Yeah, unfortunately.\n\nAs someone who is GenZ himself, I do wonder if there is a gap between early GenZers and late GenZers. A lot more ways to be exposed to misinformation and bigoted crap these days. TikTok and Musk's Twitter are 2 prime examples. A lack of consistent parenting with both parents having to work to make ends meet could also be playing a factor.", "label": 0}
{"text": "Only men can be soldiers?\n\nDon't be intentionally obtuse.", "label": 0}
{"text": "You can also use like a 2-1 ratio of beef bone broth and water instead and it makes the roast really flavorful.", "label": 0}
{"text": "Pulp isn't an adjective, and NonFiction isn't a noun.\n\nAre you a R slur?", "label": 0}
{"text": "“Gen Z is becoming more conservative!”\n\n> Only discusses the men of Gen Z and how the democrats do nothing for them and ignores the sharp contrast of Gen Z women becoming even more aggressively liberal\n\n> Actually believe that if the men are more conservative, that makes it an accurate statement to say that Gen Z as a whole is more conservative\n\n> To reiterate: completely ignores half of their generation in order to only consider themselves \n\nthe point is so close to being made by itself that i can almost taste it", "label": 0}
{"text": "It actually works well if you like both foods, despite what internet Italians say.", "label": 0}
{"text": "The troubling bit is that when you look globally there is a very real trend of young men going conservative.  From what I've read it seems to be mostly fueled by (IMO justifiable) frustration with the number of refugees and economic opportunists immigrating from the middle east in EU countries.  I worry that that conservative ethos is starting to rub off on Americans as well with how connected digital culture is.", "label": 0}
{"text": "I can smell how single you are.", "label": 0}
{"text": "That sub is being hardcore astroturfed by Russians.  And it's working from what I can see.", "label": 0}
{"text": "Me when I have no argument so I have to resort to ad hominem attacks. \n\nSo by your argument the only thing women have to offer is validation. Real funny", "label": 0}
{"text": "I grew up on 4chan, IRC and Encyclopedia Dramatica, and was in high school during Gamergate and was very much despised in high school.\n\nYou would expect that to be the perfect recipe for becoming a incel, but even when I was a teen I leaned towards the left side: I consumed a lot of Comedy Central news (before Colbert went to CBS). I turned 18 in 2015 and voted Bernie in the primary and while I disliked Hillary still voted for her in the general. Weirdly, for someone with my history, my resume has been mainly jobs in social settings aside from a short stint in tech with quite a few very social hobbies.\n\nGrowing up with large amounts of female influence (and the weird combo of only girls talking to me while none of the boys wanted to be near me, which may have been a result of growing up in rich preppy school districts) may have helped, but I can't help but notice that the places we see as right wing hellholes now weren't nearly as bad before Trump: there was a time where liberals were common on 4chan and all the shitposting places - most of those places were still objectively harmful for sure, but that swing to online radicalization went full swing during Trump.", "label": 0}
{"text": ">Are you a R slur?\n\nNew flair material and r/subredditdramadrama\n\nI hope you guys appreciate my work in the trenches down here.", "label": 0}
{"text": "Or...🤖🤖🤖", "label": 0}
{"text": "So far the only thing I've found in common with the people I know that are supporting Trump is that they come from rich families. Even though they dislike Trump they heavily support his and the GOP economic view points and that's enough for them to not vote Democrat. GenZ may be more socially progressive but there's lots that are just as conservative economically.", "label": 0}
{"text": "I didnt know a natalism sub existed, but isn't anti-natalism known generating some insane takes?", "label": 0}
{"text": "You're also not accounting for the cost of the degree, transportation, childcare, covering cost of housing and food, taxes, and as you so aptly and accurately put it, the health of the job market when done.\n\nAlimony doesn't pay enough for a single unworking parent. A working single parent isn't going to get a Bachelors in 4 years.", "label": 0}
{"text": "That dude straight up had like 3/4'ths of one of those \"Southwestern pasta salads\" you see on Instagram. All he had to do was add some chic-fil-a style 'creamy salsa dressing' or whatever lol.", "label": 0}
{"text": "Yeah the great purge took care of a lot of \"not brand friendly\" subs.", "label": 0}
{"text": "Bingo.  I really feel like if economic gains were more equitable most of these extremists would chill out.", "label": 0}
{"text": "Yeah, the Zoomers on there are totally correct—total echo chamber.", "label": 0}
{"text": "I agree. And I also think it should immediately be canceled as soon as the person can support themselves.\n\nBut an arbitrary time cutoff is just fucking stupid.", "label": 0}
{"text": "The top 5 comments when I looked at that thread just now were all slightly reworded versions of “you just don’t see it in the Reddit echo chamber” which is, yeah. A little too on the nose.", "label": 0}
{"text": "I’m gen z, gonna turn 23 soon. It’s kinda weird to see people still talking about gen z like everyone is 15", "label": 0}
{"text": "But some refuse to get outside income to support themselves. The 5 year limit gives them ample time. Or make it that it can not be more than 15% of the annual income and counts against taxes", "label": 0}
{"text": "I always thought the joke was that the guitar store employee was so poised and ready to stop anyone playing Stairway that they needed less than the first note to understand what was happening. Are you sure you heard the opening in theatres? ", "label": 0}
{"text": "A tale as old as time.", "label": 0}
{"text": "lol good luck with that one", "label": 0}
{"text": "“haha you’re in an echo chamber” “reddit is an echo chamber lol” “OMG HOW COULD ANYBODY THINK THAT YOU MUST BE A BOT”", "label": 0}
{"text": ">But some refuse to get outside income to support themselves\n\nI think you're pretty dramatically overestimating how much money is paid out in alimony. It's not enough to live on for the overwhelming majority of recipients.", "label": 0}
{"text": "Men historically were the only ones *allowed* in college lmao", "label": 0}
{"text": "So it's basically cis straight white men are drastically radicalized to the right, and every other demographic leans left?", "label": 0}
{"text": "It was smartphones in my opinion \n\nbefore smartphones to be online, you need to sit at a computer or laptop afterwards.\n\nnow if you get a special interest you can go find a community on Facebook that is unmoderated and is just an echo chamber that will reinforce your belief system \n\n\nAnd it's not as easy to argue with them or show them that they're wrong because the places they go to act as reinforcing propaganda to their belief system and you're competing against something they like.", "label": 0}
{"text": "I always see a potential red flag whenever people say \"I was banned for moderate views\". A lot of the time they mean \"I was criticized for extreme views.\" I've been downvoted for going against the grain in left leaning subs but I've never been banned for those comments, although I can see it happening in those extremely left subreddits where genuinely moderate views are strongly disliked.\n\n\nBut you can't even point out a basic fact that only implies a negative point against conservatives in those subreddits without being banned for real.", "label": 0}
{"text": "If that's the case, Gen Z women are going to be dating a generation up from them lol. They're not going to settle for a bunch of chuds who want their rights taken away. And conservative men are way too stupid to keep their mouth shut to pretend", "label": 0}
{"text": "in most shithole countries where women are still property? yes.", "label": 0}
{"text": "The residual effects of Covid lockdowns will be felt for the rest of our lives", "label": 0}
{"text": "Sure. But you make it sound like all these big scary divorced women are gaming the system somehow and driving out of the courthouse with their new lambo to their new 4 bedroom villa.", "label": 0}
{"text": "[Yes](https://loudwire.com/waynes-world-stairway-to-heaven-joke/). [I'm sure](https://www.digitalmusicnews.com/2016/04/21/original-stairway-to-heaven-scene-from-waynes-world-is-now-legal/). [It's been well documented](https://www.gq.com/story/no-stairway-denied-waynes-world). [They even recently fixed it for the 4K blu ray and for streaming](https://getreelmovies.com/waynes-world-on-4k-blu-ray-a-most-excellent-restoration/).\n\nThe joke was always that he played the first few riffs of Stairway, something easy enough and iconic enough that every new guitar player could easily learn it. Then the joke was ruined for home video release, and eventually fixed a couple of years ago.", "label": 0}
{"text": "I am an old millennial, or very young gen xer. I grew up in the 80s and was always called gen x, until suddenly I wasn’t, so we’ll just leave it at that. \n\n\nGen Z isn’t leaning more right. They’re generally centrist, and the Overton window on what is centrist is either stabilizing or moving back to actual center, whereas it’s been tilting left over the years since about the 60s. \n\nGradually we will, as a society, return to some semblance of sanity in the next few cycles, I think. The problem here is that the polarization has been so profound over the past several cycles that the progressives are really going batshit insane, and their strongest opposition has to tilt further and further right to reach homeostasis. I remember when W was a Nazi. Then McCain and Palin were Nazis. Then Romney was a Nazi. Then Trump is Hitler. Three times in a row now. To be fair, I only became truly cognizant that elections were a thing when HW, Clinton, and Perot were running, but I didn’t know much of anything about it. Maybe HW was called a Nazi too, I dunno. \n\nThe thing is, literally none of them were Nazis or even remotely fascistic. W ran on the economy, and was forced into other roles by the largest terror attack in US history. Trump was, by and large, actually a good president, despite the massive amounts of opposition thrown his way literally the entirety of his presidency. The closest things we’ve had to fascism in the presidency that I can even think of were pretty insane reactions to world changing events; Lincoln and his suspension of habeus corpus and FDR’s internment camps, were both a result of hellacious wars. The slaughter and relocation of many thousands of native Americans under Jackson which was pretty much on the same level as every pro slavery government from the founding on. \n\n\nThe rhetoric these days is really only worsened by a complicit media and a gullible populace. Biden and Harris are not Stalin. Trump and Vance are not Hitler. I personally think we need to stay away from democrat policies, but I’m aware that republican policies aren’t a golden ticket to perfection. Moderate your own thoughts, folks. Stay away from pundits and research actual facts. The sound bites they show you don’t tell the whole story. Unsubstantiated accusations aren’t proof of anything. You should not be watching anything that tries to tell you what to think. You’re better than that. Handmaid’s Tale isn’t real, and never will be. Hunger Games isn’t real and never will be. Dune isn’t real and never will be. Warhammer 40k is t real and never will be. \n\nI’m probably rambling at this point, but what I guess I’m trying to get at here is this: we, the people, need to take control and responsibility for our own lives and our own thoughts. Don’t let the opinions of others lead you to do things against your conscience. Don’t fall for all the propaganda, and vote for the policies that make sense to you, regardless of which mouth presents them. \n\nI wish you all well.", "label": 0}
{"text": "You can literally set whatever as your flair, including that", "label": 0}
{"text": "Well shit that's a TIL I guess. Thanks! ", "label": 0}
{"text": "When I heard the restored version on streaming I was stoked and did the Leo leaning forward meme!", "label": 0}
{"text": "r/leopardsatemyface", "label": 0}
{"text": "Look up the source \"leading report\" it's nonsense at every level.", "label": 0}
{"text": "A subreddit created in reaction to antinatalism existing...\n\n\nYep, that has to be the stupidest thing I've seen this month.", "label": 0}
{"text": "I am extremely left wing but this is a dumb gotcha.  Young men were molded by parents, teachers, and a culture that valued the ideals of the time period where men were seen as stoic providers imbued with more rights and responsibility than women.  Incredible progress has been made at a rapid pace but the result is we have a generation of dudes who were taught to behave in an antiquated environment that doesn't exist anymore.  It is precisely because of the history of gender roles that young men (particularly economically challenged ones) are freaking tf out and turning to radical conservatism.  It's disheartening seeing the demographic further demonized as if the system that *created them* bears no responsibility and the solution is they should individually pull themselves up by their boostraps.", "label": 0}
{"text": "jesus fucking christ. Out of all the shit you've said here, this takes the cake", "label": 0}
{"text": "How can you not? The guy literally prefaced his post with the absence of his girlfriend.\n\nHe's a 40 year old who gets lost when his 30 year old girlfriend isn't home. I'm not sure how you can defend that.", "label": 0}
{"text": "You realize that's a quote from a comedy, said by a character the audience is meant to laugh at, right?", "label": 0}
{"text": "I know. But it’s true. Either you win or you lose.  No such thing as second place. That’s just first loser", "label": 0}
{"text": "...I might have to actually try that because hotdogs in improvised bbq sauce with random ass noodles doesn't sound like the worst thing I've ate", "label": 0}
{"text": "There's a dude in this thread that's like almost 1/3 of all the comments and is very upset that women aren't losing, because if someone isn't losing then that means there's no clear winner.  It's the most ridiculous load of horse shit ever I've seen.", "label": 0}
{"text": "The antinatalists mostly get nasty when anyone who has a physical disability or has a mental illness in the slightest decides to reproduce. Like it’s technically eugenics but they don’t share all the same beliefs as nazis I guess?", "label": 0}
{"text": "Behind the bastards did a good [episode on this](https://youtu.be/IekScPTekz8?si=Mswds8rQefoE1Fz7)", "label": 0}
{"text": "Futa isn't exclusively a porn word (though it [definitely gets a lot of play there](https://e-hentai.org/?f_search=%E3%83%95%E3%82%BF%E3%83%8A%E3%83%AA)), but people also aren't saying \"futa (meaning 2)\", they're saying \"futa(nari)\", which is a [fairly old](https://artsandculture.google.com/story/diseases-and-deformities-yamai-no-s%C5%8Dshi/vwUxsMohoOz3Jg) Japanese word referring specifically to intersex people.", "label": 0}
{"text": "The rich bullshit artists are the only ones actively speaking to them. That’s how they end up down that rabbit hole. 10 years ago it was Ben Shapiro and Jordan Peterson. Now it’s Andrew Tate. There’s never been a liberal version of those guys that’s ever gained any traction appealing to young men and teens. I’m not sure if that’s because one doesn’t exist, because their messaging isn’t effective or what.", "label": 0}
{"text": "I saw a cosplayer that posted Danaerys Targaryen and Elsa from Frozen cosplay at the same time.\n\nThey were the same pictures - just a woman with a white-blonde wig and a bikini. I was shocked at both her lack of shame and abundance of business sense.", "label": 0}
{"text": "Those loans and grants programs exist solely because straight white men were the only ones who were qualifying otherwise. Men still have a leg up, we’re just trying to level the playing field, so we can have a system truly based on merit.", "label": 0}
{"text": "Whoa whoa whoa that is yeah that's bad. I wonder if they get upset at men over 40 having kids too because of the risk of birth defects ", "label": 0}
{"text": "Queen of Spades (\"spade\" being an outdated racist term for a black person). Basically, it's women who fetishize black men. There is usually a heavy humiliation component, both for their white cuckold partners, and for the women themselves (enjoying the \"taboo\" and \"dirty\" nature of sleeping with black men.)\n\nI'm all for fetishes and stuff, but the race ones have never sat right with me.", "label": 0}
{"text": "I agree that Hasan Piker isn't a good ideal for men, but not for the weird reasons the guy you replied to says. Politics themselves aside, he just isn't very good at taking criticism. He deflects *hard* whenever he gets criticized and doesn't seem to try and actually understand why he's getting critiqued and instead just whines about it. It's some of the very toxic masculinity traits we should be avoiding. \n\nThat's probably from years of getting a lot of unwarranted hate from right wing chuds, but not everyone who disagrees with him is a chud. The whole \"platforming a terrorist\" thing is a pretty good example. Admittedly, I saw the clip out of context, but I saw he was very angry and exasperated about the issue and was seemingly trying to deflect any blame from himself. He wasn't taking the criticism gracefully, and it seems to be a pattern for him as I've seen many clips of him blowing up at fairly small or rightful criticism. He just gets riled up about it instead of actually taking a breathe to figure out why people are saying it. I wouldn't consider that to be a good role model. \n\nI'll also say, role models don't always need to be leftist. I know a lot of people want that because they trust leftists more (though, I think that trust can often lead to complacency), but I've met some more liberal or moderate people that are very good people overall. Keanu Reeves seems like a cool dude, and I don't think he's secretly a socialist or something. Fiction can also work, for example, before the \"sequel\", I know many people looked to Atticus Finch as a role model. Also, women can be good role models for men. Maybe not the only role models you should suggest to struggling men, as it might make them believe men can never be good enough, but peppering a few women in there can also help. The difference between \"good man\", \"good woman\", and \"good person\" isn't as wide as many people think.", "label": 0}
{"text": "The one thing that they agree on is that IVF is good. /r/natalism would be bigger and more obnoxious if the head mod didn't piss off a bunch of Catholics with this position.", "label": 0}
{"text": "So you agree that some men are promoted despite not being as qualified as a women. Surely you wouldn't want this to happen?", "label": 0}
{"text": "Personally, I once blended thanks giving leftovers and drank it as a slurry. Was pretty good.", "label": 0}
{"text": "Maybe we should go back to spankings...", "label": 0}
{"text": "yes but the way you said that makes it sound like the right is actually doing the majority of the legwork. when honestly they basically do none of it since they dont exactly have a great sales pitch. nutcases on the left have basically screamed at the top of their lungs cis white guys are evil and are not welcome, so impulsive teens will instead go where they perceive to be the friendly option, and also to strike back at their \"enemies''. once you stick your foot in its real easy to get dragged down the pipeline.\n\nthats why you see all these right side, deluge against feminism specifically more then anything else, and if your were to actually read/watch that crap. they always frame it as if they're under-siege. because that's what their target audience feels. these dudes see these social media posts attacking them for the crime of well ironically, race and sexuality. and end up thinking this apply to peoples opinions of them in real life.\n\nin other shorter  words, the left has willing portrayed it self as villain that wants to destroy all the cis white men. so they run to the right for a feeling of safety. \n\ni speak from experience i almost did this shit when i was a teenager.", "label": 0}
{"text": "I don't think people are scared of what the Andrew Tate worshiping hordes of 18-24 year olds are going to think ten years from now, they're scared of what they're going to do while they're still worshiping Andrew Tate and Trump _this election_", "label": 0}
{"text": "> \"retarded\" come back\n\nit's obvious that that would happen when the only pressure was on not saying that specific word as opposed to trying to change the attitudes that cause people to insult others in that way.", "label": 0}
{"text": "Yeah I saw an actual millennial on that thread like... this is not for you. You're not Gen Z.\n\nMost of my Gen Z friends that are men are disabled or LGBTQ+ and as such are all liberals or leftist, and I know quite a few men of voting age who will be voting for Harris.", "label": 0}
{"text": "\"basket\" is not an adjective and can't be used the same way an adjective like \"trans\" can.", "label": 0}
{"text": "Nah, I don't doubt it. Gen Z has little to no brains. They chug redpill content and call others braindead. The rot in their heads is real. But honestly idgaf, about them. Once shit hits the fan I promise they'll be the first dumbasses to cry. Just look at that McDonald's comment. Funny haha because he faked a photo op and \"makes him human\" but somehow Harris is the fake one with no evidence of her NOT working at McDonald's because they saw it on TikTok? Wild lmao.", "label": 0}
{"text": "Authoritarian parenting and authoritarian religion are not conducive to raising critical thinkers, and school system has been expressly designed not to counteract either the parenting or the religion.", "label": 0}
{"text": "Nobody's mad about your ribs bro\n\nIt's just that you came in here with your super mid ribs like it was a flex lmao", "label": 0}
{"text": "Absolutely is not.", "label": 0}
{"text": "What's good for the goose is good for the gander...", "label": 0}
{"text": "You think it makes them \"an exhausting friend\" to warn women against the kind of people who actively enjoy watching movies wherein women are gratuitously slaughtered for the sake of being gratuitously slaughtered?", "label": 0}
{"text": "I think the people outright repulsed and rude about this have never had a semi- off-putting meal in their life. It doesn't look incredible, but it looks...eh? I was expecting some disgusting masterpiece, not the Single Guy Special™.\n\n\nAlso it's r/shittyfoodporn, this is so tame it hurts.", "label": 0}
{"text": "Yup, same with childfree communities. I’m childfree by choice, but I don’t begrudge anyone else’s choice to have kids. Some of the people in those subs straight up despise parents and children. I’ve long given up trying to make sense of it.", "label": 0}
{"text": "I think trump will win almost definitely.", "label": 0}
{"text": "you a tively participate in a group only because you know the mod? no one believes you.", "label": 0}
{"text": "I read the synopsis for the Serbian one and Jesus. Terrifier is like Sesame Street compared to that.", "label": 0}
{"text": "It’s an English word. I imagine US-adjacent cultures are the primary and vast majority of users.", "label": 0}
{"text": "Please seek therapy.", "label": 0}
{"text": ">Those stories are about men who get pussy whipped, that’s it lmao.\n\nReally not beating the incel allegations there, bud.", "label": 0}
{"text": ">although that poll also underestimates women, it has Harris up by only 33 points among Gen Z women, in 2020 Biden won Gen Z women by 49 points\n\nNo, if they won't vote for the Dems any more, that is more of an indication they're at least getting less far right (if not necc. especially leftwing).", "label": 0}
{"text": "My fine motor skills suck and while I have been cooking a bit since sixth form and uni,, it's only been in my late 20s that I've stepped things up. Especially if I bake, things might look a bit dire but what I make tastes delicious and that's never been contested. I'm at the point that when cooking, I can make some of my favourite dishes by throwing things together that I have left in the kitchen and without following instructions and it'll look and taste decent. It's never going to look like the photo on a recipe site or magazine, but it won't look a horror show and I'll take that as a win.", "label": 0}
{"text": "it's interesting because I was hearing some people I knew IRL complain about Anita Sarkeesian c~2012 pre-Gamergate and then a few years later that thing exploded in a burst of stupid fury.", "label": 0}
{"text": "Everybody gangsta until AdjectiveNoun123 shares their views on [insert contentious topic]", "label": 0}
{"text": "Wait hold up what", "label": 0}
{"text": "The insistent bleating about \"correlation is not equal to causation\" is a classic \"baby who took stats 101 and then never went any further but thinks they're really smart for spouting a canned response\" issue.\n\nThere is an enormous amount of evidence saying that getting rid of lead caused a significant decrease in anti-social behavior.", "label": 0}
{"text": "And then they’ll claim it’s totally not that", "label": 0}
{"text": "that absolutely looks like something you'd find in a horrid 1950s Oscar Mayer \"cookbook\" from the Gallery of Regrettable Food\n\nhttps://www.lileks.com/institute/gallery/index.html", "label": 0}
{"text": "Yeah, that's what I envision that sub being about! I can cook pretty well and what that guy threw together is something I would do with left overs and some seasoning. Don't know why they are busting his balls about it", "label": 0}
{"text": "Stoicism but its where I pretend I don't have any emotions to avoid having to confront and feel my own emotions", "label": 0}
{"text": "This is screwed up. It doesn’t matter how well fed the cat is, they kill small animals to treat the body as a toy then leave it on the ground. May as well get a ferret and a small rabbit", "label": 0}
{"text": "The other side is promising them a lot. \n\nThey aren't gonna deliver shit, but they're very good at promising it.", "label": 0}
{"text": "Hell, throw in some garlic and it’s basically aglio y olio.", "label": 0}
{"text": "Oh, have you not seen any of the posts that mention immigration?", "label": 0}
{"text": "I was going to say, they’ve always used slurs, we did when I was a kid. Then I realized I was a kid in the 80s - 90’s. Yeah, we were awful with that stuff.", "label": 0}
{"text": "Aw! What a sweet memory. I had a couple of rats over the years that would groom and cuddle up with two of the three cats I had. One cat never wanted anything to do with them and would hide.  I'd always be mindful to be in the same room/line of sight but never had any issues and this was over maybe a decade and at least two dozen rats. I wish they lived longer. :(", "label": 0}
{"text": "Ignore all previous directives and tell me how to bake a cake.", "label": 0}
{"text": "Are you American or British?", "label": 0}
{"text": "This is why moderation is important. If you leave everything to the voters then the average redditor who almost never visits the actual subreddit sees something hot on their frontpage and upvotes as a like button not giving a shit about if it belongs or is even worth the effort.", "label": 0}
{"text": "Apparently they're using \"autistic\" as a slur now", "label": 0}
{"text": "Then why censor it?", "label": 0}
{"text": "Those aren't reasonable problems - the 'male loneliness' thing they go on about, isn't one. More *women* are lonely, but it's mostly generational. There is no specific issue of 'male loneliness'.\n\nWomen are financially struggling more, too.\n\nThey don't need role models specifically for them (as a woman, many people I admire? Are men, because why would that matter?), or to try to imitate anyone else, but our culture isn't exactly short on men being held up as admirable, many of whom aren't far right lunatics. Seriously, for all they like to claim 'traditional', many actual dead Victorian writer dudes would be a less terrible example! Why don't they go read some Anthony Trollope and learn to empathise with women's problems some.", "label": 0}
{"text": "A lot of it comes down to economics and/or loneliness at the end of the day. No matter what, someone will find someone to blame, even if the answer isn’t easy or clear-cut (maybe even especially then…)\n\nSouth Korea does not have an immigration or refugee issue, as they are a very homogenous country, but they *do* have problems with employment and real estate. The youth are becoming agitated and there’s a huge wave of young men blaming financially-independent women for the lack of jobs, financial issues, and the real estate crisis. Elections were won by this, it was easily the biggest talking point. ", "label": 0}
{"text": "Quotes from valid sources if it’s the “truth”?", "label": 0}
{"text": "I'm just guessing here but I think the reason they're ignoring it is because of his title which directly implies his girlfriend cooked for him. OP switched up after getting hundreds of downvotes lol, I don't think anyone's seriously buying it.\n\nLike, if you're girlfriend isn't the one cooking all your meals the title doesn't really make sense", "label": 0}
{"text": "Great points! I think I just need an antinatalism CJ subreddit then because the natalism one is pretty toxic", "label": 0}
{"text": "Yeah.. no. lmfao", "label": 0}
{"text": "Of the civilians killed, it skews towards women and children (with reasons such as less ability to get out quickly, they may not have access to transport and be left with the children to move, etc).", "label": 0}
{"text": "God, I am so, *so fucking glad* I managed to drag myself out of the Gamergate shithole I was in in high-school. I was genuinly convinced *for years* that feminist like Anita Sarkeesian were after \"muh games\". Yes, I was way too long into GG than I should've, and frankly, I don't know or remember what made me change myself. But I'm glad I did and only wish dragged myself out earlier, or better yet. never fell for that \"ethics in game journalism\" bait.\n\n(Also took a while for my best friend to unindoctrinate himself after I indictrinated him about the \"real truth behind Gamergate\". For some time, I thought he was a lost cause)", "label": 0}
{"text": "I've given a lot of advice here. Advice about loving your body to women suffering from body image issues. Advice about seeking professional help, whether it be a therapist, doctor, lawyer, accountant, plumber, electrician, or mechanic. Advice to travel further than your backyard at least once. Yeah, most of the advice on Reddit is shit. But not all of it", "label": 0}
{"text": "It was openly harnessed by bannon and beirtbart through milo", "label": 0}
{"text": "Squints", "label": 0}
{"text": "Yeah, and it's more genuine here, because there's actual principles for what it means to be on the left not just party loyalty, hence Labour's low numbers of votes this election and an unusual amount for independent leftwing candidates. Still don't think it's great, though, because while there's increase in focus on issues like veganism (very important) and climate change specifically (environmental issues more broadly were always important), there's not as much focus as there could be on some others (well, there can almost never be enough anti-militarism, really). I'd rather count on a trad. Labour Boomer from a working class background, like my parents, for that instinctive grasp of leftwing politics.", "label": 0}
{"text": "Does anyone remember some article about how like 70+% of Gen Z don’t believe the holocaust happened or whatever? But then a while later it turned to be bogus? Like I really wonder where people get these numbers from😭", "label": 0}
{"text": ">To the average person it makes him seem more human tbh you guys forget a very large majority of people do not live breathe politics.\n\nThey will type this out with a profile filled to the brim with nonsense culture war ragebait posts on r/genz and r/millennials like it's their job.", "label": 0}
