{"text": "I'm sick of living on this planet. That's it. I hate everything about the world and living in it. I'm angry that I was forced to live here without any say of my own.", "label": 0}
{"text": "If you need help with that let me know. Failure sucks.", "label": 0}
{"text": "I've already escaped. Im with my auntie now. but the trauma was there. and I just want to die every single time", "label": 0}
{"text": "Go to a professional race track pick out the nicest fastest car you can find that they will let you and drive. Go sky diving, scuba diving, bungee jumping, get that tattoo you always wanted, swim with sharks, volcano boarding, cave diving, Wingsuit Flying, swim with humpback whales, buy yourself something you’ve always wanted your whole life, do something you’ve dreamed about since you were a kid. Sky’s your limit go out have fun. Personally I’d get a really nice fast motorcycle and that’s always been the way I’ve wanted to go, go out doing something I enjoyed", "label": 0}
{"text": "Yes, it’s a weird thing to try to do a whole”my suffering is worse than yours” categorization. And it’s always a personal or general anecdote that just reads asa straw man argument because they cant grasp that two or more things can be true at the same time.", "label": 0}
{"text": "Yes. Being with nature and away from people can feel so good. Just being human yourself. Even rent a cabin by a lake. \n\nPlease yourself and not others.\n\nBe happy. I doubt you feel that a lot. But find what makes you happy and do it.", "label": 0}
{"text": "I got a cat so I’d not want to kill my self. He is the best. Some days I’m just like “I gotta feed him tonight”.", "label": 0}
{"text": "I never said he was wrong, men indeed die more by suicide than women, and women attempt more suicide than men. I was just bringing information which you can check is true.", "label": 0}
{"text": "You are the problem. \n\nMEN. DO. NOT. HAVE. IT. WORSE.", "label": 0}
{"text": "Best dressed for the funeral", "label": 0}
{"text": "Send it to me 🫶🏻", "label": 0}
{"text": "My spot was a placeholder to be used", "label": 0}
{"text": "I wish i could provide more details but i dont know where to start. Thank you for taking time to commment and making me feel seen. I want help but dont deserve it. Im sorry", "label": 0}
{"text": "I'm happy you're with someone who cares for you. What does she think about your situation?", "label": 0}
{"text": "I'm sick here. just recovered from my tuberculosis. I have been with her long before. she keeps channeling her hate from my father towards me and my other siblings.", "label": 0}
{"text": "That's not helpful 😕\n\nWhere is the hatred coming from? What unfair standard is your father holding over you?", "label": 0}
{"text": "I’m so sorry for the way your mom is treating you but trust me after you move out, it’ll be so much better. Just stick it through until you’re 18", "label": 0}
{"text": "I am so sorry. \nHave you got a group you can join near you that is about bereavement? Parents who have lost a child? \n\nIt might be good to join a group like that to talk to people who truly understand what you are going through.", "label": 0}
{"text": "Unfortunately it's true. Getting old adds all kinds of new issues. That doesn't mean that your stress as a youth isn't warrented. What's going on? 😕", "label": 0}
{"text": "Suicide statistics say otherwise. Reproduction statistics say otherwise. Men are far less likely to reproduce and leave offspring/legacy, they're far more lonely and far more likely to kill themselves. And if you complain about it, you're shut down and humiliated for not being manly enough. It is what it is.", "label": 0}
{"text": "So are you caught up in the middle of thier strife?", "label": 0}
{"text": "Give it to me!", "label": 0}
{"text": "I feel the same about myself. I went through a ringer in my attempt, but somehow it lead me back here to talk to those in my same situation...\n\nIs there anything i can help you with? 🥺", "label": 0}
{"text": "Sounds like he's the one that should be on this thread... 😋\n\nWhy is it affecting you so much?", "label": 0}
{"text": "I have my fair share of trauma. i also didn't enroll and I lost every friend I thought I once have. I don't do drug or alcohols to escape life. Do you think I should? So it won't affect me", "label": 0}
{"text": "It does. It's not much, but know you're not alone 😔", "label": 0}
{"text": "Thank you", "label": 0}
{"text": "If you need support, I'm here. I may not be able to stop you, but I can talk. I wish you well, OP.", "label": 0}
{"text": "I don't like people prying into my shit, but we're both on this public forum... what is going on?", "label": 0}
{"text": "Also the homless people, most of them are men too, just deny the statistics are not important lol my ass", "label": 0}
{"text": "I’m just explaining myself and my situation 🙏🏻", "label": 0}
{"text": "Delete Reddit", "label": 0}
{"text": "Right", "label": 0}
{"text": "oh yeah, that's totally true! I meant accessible as in affordable lol", "label": 0}
{"text": "Scout's honor I'll never tell another what you don't allow me too. Doctor-patient confidentiality. Lips zipped and key tossed.", "label": 0}
{"text": "nobody in my family wants me. i have constant meltdowns becuas wOf every little thing remindibg me that no mayter how hard.i try i will always fall back worse. My mum and i always fight and in constantly bruised or hirt in some way as a result of said fights. Im failing school. My passion for art has died and drawin mg only makes me want to kill myself even more. i dont find comfort in anytbingi love. There is truly Norhing to look forward to in. my life.", "label": 0}
{"text": "Oh, certainly no harm there. I’ve heard, read, and seen it all. It’s okay. I’ll be alright.", "label": 0}
{"text": "I too, but think about it: if you are ready to go from this world any moment you wish, then why even bother with feeling bad and suicidal? Give me reasons why I should continue feeling bad", "label": 0}
{"text": "No buddy don't do it", "label": 0}
{"text": "I'm 15 almost 16 and I also want to kill myself I don't know what to tell you since I'm in the same situation as you", "label": 0}
{"text": "this was incredibly touching as someone battling with suicide. i’m so sorry you lost your soulmate OP she sounds lovely.", "label": 0}
{"text": "I’m in the same boat friend, I know how it feels", "label": 0}
{"text": "I feel this so heavily. I can’t hold a job so i’m always having people support me. I’ve always thought spending the years i’ve already spent like this have been ENOUGH. There’s no way I can ever do 60 years of this constant cycle and I know one day I’ll do it. I hope that makes you feel less alone I’m sorry I can’t take away all your pain and depression. \n\nIt helps me to know that my pets don’t expect anything except love from me and i feel like that’s all i can give anyway. If I forget to feed them breakfast, they still love on me and appreciate i’m caring for them. They don’t know i’m a fuck up and i dropped out of school and that i have no job or money. they just love me and that helps me thinking about that ❤️ i’m sorry you’re going through this I know how hard those thoughts are", "label": 0}
{"text": "Bob the tomato is kind of cool tho.", "label": 0}
{"text": "So are you saying you do not like your own company?", "label": 0}
{"text": "There is nothing shameful in feeling lonely, no matter what age you are. In your case it's even better though, since you are only 15 - that means that you have time to fix this! But it won't be easy, nor immediate. You need to make forceful steps towards getting you out of your loneliness. I see that you don't want physical contact with your friends, but rather with some new person. That's just fine, different people play different roles in our life. So there is a goal for you: make new acquaintances and try to befriend people that you like the most. Again, action from your side is required here, I wish you strength and courage in this. Take care!", "label": 0}
{"text": "Yes it has honestly been terrible. Crack is no joke from my experience with my mother. Personally I could never do it, yet alone try it. That drug is revolting and did so much damage to both my mom and me consequently", "label": 0}
{"text": "It’s a fast money pit, that’s all I know. And seriously fucks you up. Crack users please get off it", "label": 0}
{"text": "for what it's worth, I'm hoping for the best for you. never be afraid to reach out", "label": 0}
{"text": "I do, but it doesn’t mean I can’t feel loneliness too", "label": 0}
{"text": "I said vegetable 😑", "label": 0}
{"text": "I don’t think she can prove the rape, so nothing bad will happen except maybe people will have negative views of you. The people you really care about should realize that you didn’t do it though. This really sucks but your real friends should understand they’re lying about this accusation. I don’t know if that helped or not", "label": 0}
{"text": "Can't you say was ai fake ?", "label": 0}
{"text": "Sure. What's the weather like where you are?", "label": 0}
{"text": "I tell you this: in 20 years you will remember this blackmail attempt with a smile on your face. My friend! Your life is worth more to your parents than info about you dealing some marijuana. Just ban them all and suspend all of your social media for the time being. Create new accounts. Let them do it, you live your life and won't let them take it away from you by their shit mailing!", "label": 0}
{"text": "It's a classic that has worked millions of times before. but as the other person said, a lot of people here describe their experience as painful and quick to regret, so they end up backing out anyway", "label": 0}
{"text": "Hey. I wanted to just thank you for doing the work that you're doing. And the fact that you are loved by your patients and there for them, despite your own struggles, makes me think you are a great person with a great heart.\n\nI get the way you're feeling...But I still hope you manage to get some joy out of your holiday, even though you are in a very dark place right now.", "label": 0}
{"text": "When you have a mortgage you have to have homeowners insurance it's a requirement before they would give a loan.", "label": 0}
{"text": "I really appreciate the effort, but I have no problem in making new friends, the thing is that I am not capable of creating a genuine connection", "label": 0}
{"text": "Why do you think that? I thought the same thing about myself too, but it turned out that I just need more time with the person to properly connect.", "label": 0}
{"text": "Those... are some really good tips, actually. I'm going to try to follow them as best as possible, thank you very much. I appreciate the availability you had in talking to me about these things... and, uh, I can't go to the gym either, and I'm not sure what to do, to be honest.", "label": 0}
{"text": "I'm gatekeeping it (:<", "label": 0}
{"text": "I wish I could take this pain from you. A few years ago when I was your age it was the same for me.\n\nGo through your dreams again and write them down so you don’t forget\nJournal - reflect everyday on what you’ve done and what you could do better and always end it with being grateful. You’re alive, you have that chance for happiness\nStart with doing 2 things everyday above brushing your teeth and getting yourself out of bed. Like reading a sentence or a walk!! It’ll feel good \n\nKnow that you are a valuable human being and that  are you loved. You are worthy of being happy and you owe it to yourself to take care of you. I don’t even know you, but I feel a kinship to you and platonic love for you as a fellow human being after hearing your story because I’ve been there. Believe it or not, you’re helping me deal with my own issues as well by sharing your story. It lets me know I’m not alone either and reminds me why I need to stay in therapy. I hope things get better for you soon. Feeling like you described can make you feel completely helpless and hopeless. Therapists are there for this exact purpose: to help you figure out why you feel so bad and help you find the tools you need to get your life back.\nJust take it slow and trust that if you put in the work and take the suggestion of seeing a therapist, you have nothing to lose but you very thing to gain: especially your life back. Problems all have solutions, sometimes it just takes a while to figure out what the solution is. And sometimes having another person to talk to who knows more than we do about these things can help us find those solutions. Good luck in your journey and please keep us updated. I really hope this helps you even if only a little. You can do this! I believe in you!", "label": 0}
{"text": "It feels like my parents are never going to forgive me for that day. I dont know how im going to live with myself knowing it was me behind that wheel. How am I going to enjoy the simple pleasures of life when I know Im a horrible person who nearly robbed so many people of their abilities to do so", "label": 0}
{"text": "The scariest thing you can do in a world you describe is be unapologetically kind. This I think is also the most fulfilling. Always respect the people you think feed into this and never expect anything back. Eventually will meet like minded people worth living for.", "label": 0}
{"text": "Maybe you're right, I feel like I can't be myself with my friends, maybe I'm with the wrong people, then it's hard to have them", "label": 0}
{"text": "I work at Amazon and they helped me with HRT, and getting in was easy (no interview) along with benefits from day 1- not saying you should work there but companies like that can def help you out", "label": 0}
{"text": "That's so sad you are bearing it all alone, but I also admire your strength and courage for your children. That's quite a coincidence that both men who lived with your mother commuted suicide. If your mother doesn't help you with your children then I would stay away from her. Pls, pass your strength to your children and break that circle of suicides, don't leave your children alone, they will will the same way as you now.", "label": 0}
{"text": "first of all, talk to her and show her to you arent against her. If u look through the sub you'll see that depression is something that has nothing to do with age, sex, or even the surroundings, sometimes. Its great that she got to verbalize it, tho. Please, support her. Dont get angry at her.", "label": 0}
{"text": "I did volunteer somewhere. And the organizer of thst group is who accused me.", "label": 0}
{"text": " My dreams were killed. I always wished to be a biologist but my teacher was a complete BITCH and theres no jobs for it in my country. If u want to work with animals you either invest your organs into being a veterinarian and having your own clinic or you work with animal husbandry. I dont have the money for neither. I do walk, I work, but Im disconected most of the time. My job kinda needs me to be. \n\nThank you dearly for your words, and Im happy I get to throw them back at you. You also deserve to be loved and worthy of being happy. Im just tired of this phase that simply doesnt end. I have some plans to get better but they see so far away. I dont have the strenght to. I feel like Im drowning", "label": 0}
{"text": "So as a trans person, I look at myself every day and see something I really don’t feel comfortable in. \n\nImagine waking up and being the other sex. It would maybe be fun, for a day. But then you feel something is off. People want you to fit into a box that doesn’t fit you. You look in the mirror and feel horrible every day, knowing that you’re different inside. After coming out, which is usually quite late, you have to wait years to access any sort of care. Surgeries are painful, hormones have side effects. \n\nBut another thing is how people treat you. People see me (FtM) as a “mentally ill girl that wants her titties cut off” and can’t foresee the consequences. While in reality, I’ve been trying to be happy in my body for over 20 years. Lost weight, worked out, found a style, wore makeup. But it was never me. Now, looking like a “tomboy” isn’t enough either. Because my body just feels so wrong.\n\nMy dad doesn’t respect me, my sisters doesn’t respect me, people on the street no longer respect me.\n\nBut being MtF, is so much worse in public. I’m basically invisible. My ex would get yelled at in the streets regularly. Intimidated, saying she’s a pervert, saying god will punish her. Ironically, I’m from a very accepting place and this stuff is much worse in other places and countries too.\n\nAll of this together, with the extreme cost of transitioning, it’s super tiring. There’s even more reasons, but these are the main ones.", "label": 0}
{"text": "Is that search worth the terrifying things that could happen?", "label": 0}
{"text": "What happened are u okay?", "label": 0}
{"text": "Get a lawyer, you better call Saul", "label": 0}
{"text": "Ask yourself is sitting in fear right now something that is sustainable? Some interactions are gonna be bad, some are going to be good, some you’re gonna forget about. At the end of the day you know you are putting genuine good in the world and I think thats worth a lot. Don’t think of this as a search, just think of it as something you do and try to make it a part of who you are. Compliment a stranger. Pet a dog. Pay for someone’s meal. Every day look for an opportunity to do something nice for someone. Its not going to be obvious at first but if you make a real effort to do this i think you can 😃👍🏼", "label": 0}
{"text": "Bro don't do it, your life has a purpose", "label": 0}
{"text": "For me it helped to realize it -could- get better. I only focus on what I can change. Stopped relying on others to make me happy since I can’t control what they do. Realized life will never be perfect so just find small joy where I can. Mostly video games, ha.", "label": 0}
{"text": "Psychologist here. Perfectly ok to be angry but if it’s that’s the case and taking up a lot of of your headspace, have/create a plan on how you’re gonna filter it/diffuse it or better understand it and the negative coping you may do that may affect your daughter. It certainly feels like it’s out of nowhere for most teens but as the person who’s on the chair next to the couch of these young folk, like that commenter said, there are all kinds of nuances and context that it’s been forming inside her, sometimes entirely about the family, sometimes not. Put your mask on first as the airplane goes into turbulence and go meet some of your needs or you’re just going to walk into it all angry and that never helps anyone. Sorry to hear about the hard. Parenting is endlessly difficult sometimes. Aim to understand and avoid blame as much as you can, toward yourself included. \n\nLousy 150.00 a month indeed.", "label": 0}
{"text": "Everybody knows the trans suicide rate meme. What about detrans? I.E. people that started hormones or even went as far as surgery and then stopped because that wasn't working.", "label": 0}
{"text": "I find joy in eating. Deadass", "label": 0}
{"text": "I didn’t know what I wanted to be when I grew up at 13 either.  And I never had a girlfriend really but I did get married.  I doubt you’re ugly really.  Some girls get looked over when they are young because the boys don’t even want a girlfriend.  But you get older and realize your worth.  I hope you find your worth on day.", "label": 0}
{"text": "I’m trying to stay away from relationships right now due to my mental health. I’m not in the right place to enter a relationship and all in all I’m scared to go back into a relationship rn. But thankyou for your advice 🫶🏻", "label": 0}
{"text": "I already try to be kind but none of that is stopping Putin from potentially invading or climate change potentially flooding my country.", "label": 0}
{"text": "Similar situation as you. Very similar put piled on other reasons too.", "label": 0}
{"text": "Have you tried a social service department, a shelter, in the county you're in?  Even some churches can help.  Please look into all your options, even try talking to a suicide prevention line.\nI hear how tired you are of living in your situation without a permanent home, it has to be so extremely hard.  Please keep looking for help.", "label": 0}
{"text": "Dammit. I might just chug a bottle of whiskey and a whole bunch of valium for when I do. Other than that, it's the same plan with the whiskey and valium, but throwing myself of the equivalent of the golden state bridge in my country", "label": 0}
{"text": "Exactly, I feel like a lot of people who consider suicide don’t realize the horror of their parents and family members finding out. Stay strong, I hope you can find a way through all the trouble.", "label": 0}
{"text": "Although some of the things are based on the age, but much more important part is how do you spend your time", "label": 0}
{"text": "Womp womp", "label": 0}
{"text": "It won’t matter what everyone thinks, because OP will be gone.", "label": 0}
{"text": "I actually often like to play with people in \"catching them in a lie\", but in a goodhearted way with the intention to show that even if they lied or didn't hold their word, there is nothing wrong with it in this specific case.\n\nRegarded clouded judgment, I would suggest practicing remembering yourself when you felt relatively good, and kind of saying to yourself: \"I have to trust myself when I was in good health, if I can't event trust myself then whom?\". And try to follow your judgement from when you were ok.\n\nAlso from my experience there are not many people who, if investigated, are actually not \"three cockroaches and a mesh of illness disguising as a human\". So, about this part don't worry too much :)", "label": 0}
{"text": "Please reply... Don't tell me you... No-", "label": 0}
{"text": "I am sorry you are hopeless.  You are deserving of peace.  \nYou’ll be in my thoughts.  If only that was helpful.", "label": 0}
{"text": "Good. If I may ask, are you still feeling this way?", "label": 0}
{"text": "I am", "label": 0}
{"text": "Allnosy vang breath anymore yaayyyyyy", "label": 0}
{"text": "Saying things get better after a x period of time can and in most cases will be just a lie, you don't know this person or his future it can get better or worse(although considering op's problems i suppose the 2nd option is unfortunetly more likely to happen) , its like saying everything will be alright. The only thing i can think of that would benefit him by saying those words is it might, (but i honestly don t think it will) really slightly improve his view of the future. I wish the best for u and i m sorry about your attempt (sorry if something i wrote is not understandable, english is not my 1st language)", "label": 0}
{"text": "Either way, I wouldn’t worry about it. So they have a pic of you doing something underage. You’ll be fine.", "label": 0}
{"text": "Do you think you please could/would be willing to update us tomorrow around this time if you are available? Maybe this is something we can fight through together. I don't know you friend, but I'd love nothing more than to help you right now", "label": 0}
{"text": "Iys wprking", "label": 0}
{"text": "Byr i love upu all", "label": 0}
{"text": "Call your local homeless services.  Where are you in CA?   Since you’ve only been homeless for 10 weeks, that means you’re not chronically homeless.  I don’t know the exact specifics but there are communities set up by governments that cater to newly homeless; so they offer places to sleep and shower etc for people who fell on hard times.  I believe the theory behind this is that it makes it safer for newly homeless to get rehomed and also helps you find people going through the same thing. \n\nDon’t walk across the highway, 64 is not too old.  You’re never too old.", "label": 0}
{"text": "Can you try your hardest to be alive for us at least until then?", "label": 0}
{"text": "Before uvmmmm i go i losten to my favourite mucix", "label": 0}
{"text": "Maybe even later on tonight I can check on you", "label": 0}
{"text": "I see my God", "label": 0}
{"text": "If ypu cpuld see what I see", "label": 0}
{"text": "You have your life ahead you are very young, time will solve it trust me", "label": 0}
{"text": "thank you ❤️ i hope you have fun seeing the new venom!", "label": 0}
{"text": "Thats the problem, ive been like this at 6 years old. Being interested and acting \"dramatic\" on \"purpose\". Ive always felt like this and its only gotten worse, i feel like theres no way out.", "label": 0}
{"text": "There’s nothing to look forward to, I think. I used to try looking forward to something just to keep me going but now there’s nothing", "label": 0}
{"text": "Well most of teenage years are the same for many more, but once one grows older 20+ you will change how you see life, we tend to be more \"dramatic\" on purpose until the teenage years, there are even studies about it.", "label": 0}
{"text": "Can I have just $200? it would help me massively at this moment, pretty please", "label": 0}
{"text": "Lemme hold a dollar no bs", "label": 0}
{"text": "I'm in the same boat as you. I'm 26, I'm broke, jobless, no direction, no abortion, no goal, nowhere to start. After I graduated in 2 years I had to me a place for 2 years and a car for 4 months and lost it all. I feel like a big failure. I broke up with my ex to f 7 years who was a liar, cheater, and all around she hated me and didn't like me but didn't understand why she was with me. Of even staying with me. I feel like nothing after the relationship ends, I have been jobless for almost 10 months, I moved back into my mom's place not by choice and I hate being here. I knew a reason why I didn't want to come back, but I just wanted things to go back to normal. I hate that my ex is happy, and not even thinking about me. Every day she is on my mind and I'm stuck with the heartache, the trauma, and the outright bitterness. While she is happy and doing better than me. Why am I stuck with this feeling when she doesn't feel a thing? I wake up every day, wanting to die or kill myself, but I always wonder if will I sleep. Is it lights out? Do I go somewhere else so I pussy out a lot", "label": 0}
{"text": "Is because of looks, even a 9/10 good looking guy can have so many woman even though he has an IQ of 80 lol, bro is not your foult", "label": 0}
{"text": "It sounds like you've been reliant upon external sources for your happiness for 20 years.  All I see was a thought pattern of \"if I'm thin ill be happy.\"  \"If i have the right clothes ill be happy.\"  \"If im pretty ill be happy.\"  \"If im a boy, ill be happy.\" Do you wonder how people who've gone through horrific accidents and no longer have faces, are happy?  How people who've lost limbs are still happy?  They realize that happiness comes from within.  When you rely upon things you cannot control for your mental health, you will never be happy.  Have you tried achieving things that are meaningful to you?  Have you tried being the kind of person you respect?  I don't mean someone who makes posts that get likes on the internet, but someone who behaves and acts in a way that you respect?  \n  There is so much focus on the superficial, and it's leading to mental health crisis.  You've done things to be proud of, but I just see an obsession with appearance in your post (and I know there is more to you than the contents of a short post on reddit), but I think a lot of people have never been tested.  They've never faced difficult situations and prevailed, and the privilege of western society is keeping people from gaining important insight into who they are, so they're stuck focusing on the external.  And it keeps them from practicing active gratitude.  I hope you are able to find the happiness you are searching for someday.", "label": 0}
{"text": "Sorry, hope the bleeding has stopped", "label": 0}
{"text": "Today is my birthday too. I didn't think I'd make it to today. Hoping I can make it to the next one.", "label": 0}
{"text": "You have a body that works. You can use those legs to walk across a freeway. Some people don’t have legs. Some people cannot walk, and are blind. Some people are jailed for their whole lives for a crime they didn’t commit. \n\nSo these are two things you have going for you. \n\n1. You are able bodied.\n2. You have your freedom. \n\nAnd yes you are at rock bottom as you see it for people who are able and are free. And god knows the difficulties you face tomorrow. \n\nBut you will face it and you will survive. You will have to find some way of getting money together, and only do it legally. \n\nBecause the third thing you have is your character. Your integrity. Your values. \n\nThis may sound abstract but it’s not. It’s absolutely critical to life. Some people have billions of dollars, but they have no character they can respect when they look in the mirror, and end up walking that freeway in an Armani suit. \n\nThe fact is that some people give up everything to get to the reality of life. All the bullshit can be like a weight around your neck. From Buddha to Socrates, the greatest thinkers have put themselves in a situation just like yours, giving up everything and living wild, for one reason: they knew that what is inside is the only thing that matters at all. \n\nWhen you leave that motel room, hell I know it will be terrifying. But remember this: you will be in the same position that some of the greatest minds in history voluntarily put themselves in, because they craved the freedom to be good people unburdened by the world. \n\nI hope you find a way to get back into a home, and sort the practical issues of getting money together. But please remember, you have your body and your soul, and those are incredible tools.", "label": 0}
{"text": "happy birthday!  I'm so glad you were born!!!", "label": 0}
{"text": "What happened to possibly make her say that? There always has to be a reason", "label": 0}
{"text": "drugs, booze, prostitutes.", "label": 0}
{"text": "Ur might be right blud but don't go too harsh on urself also ;p", "label": 0}
{"text": "Go to Japan! Enjoy a beach and swim with sea turtles :)", "label": 0}
{"text": "It's not gonna work", "label": 0}
{"text": "Im mostly talking about appearance because that’s relevant to being trans. And let’s be real, no one can be happy in a society where MOST people reject you. And yes, in my direct surroundings (and in most of the world) it is most. Are you trying to invalidate my feelings based on some idea that I never went through hardships? Or are you trying to say I dislike who I am? Because I don’t. I like myself. I like who I am as a person, as a friend, as a caregiver. I’m proud of my accomplishments and studies. And I have also definitely had my share of horrible shit happening in my life. Abuse of sorts, poverty etc. Stop making assumptions about me if you can’t justify them", "label": 0}
{"text": "I can chat with you beside that but I will be cool if u stick around with us thanks to that ", "label": 0}
{"text": "Thats what i am afraid of, and im pretty sure about it but nevermind", "label": 0}
{"text": "Yes I do also feel kinda socialmedially?? lobotomized. I wish u can cleanse ur mind from that", "label": 0}
{"text": "Yeah man, it all hurts, it’s not really possible to just find someone else tbh, this person was so special and understanding and I don’t think I’ll ever be able to be seen and understood as much as this person did, and the other way too, I understood them and was there aswell", "label": 0}
{"text": "Brother. I hope I was in your neck of the woods and just could take you in. Kother earth and the universe has given me just enough for you to not be homeless. I am cursing myself for not being by your side today.", "label": 0}
{"text": "Thanks man I truly appreciate it, it sums knowing they’re gone, it all really hurts knowing a close friend of yours will never appear in your messages again, but thank you man I truly appreciate it, I feel so incredibly alone right now but I appreciate you responding and showing me that there are people out there listening", "label": 0}
{"text": "It’s been going on for about a year and a half now and I do have some friends and family but they wouldn’t be able to do anything so it feels pointless to talk to them about it", "label": 0}
{"text": "Go on vacation", "label": 0}
{"text": "Do you think you’re nothing but a burden and a parasite? \n\nIf any family member starts saying that to another family member, there is definitely something malevolent going on there. No healthy family member should ever say such a thing or make another feel that way. \n\nThe pain as you know it might be over in that ocean - possibly. But so would your opportunities. You have life, which means you have the opportunity to change - something or everything. In fact, as time goes by everything will change whether you like it or not. It’s worth seeing what you can change.", "label": 0}
{"text": "Hey man, I understand what your going through to some extent, I’m trans too, ftm, young aswell. It’s hard living life with dysphoria constantly being there every second of your life, doubting everything about yourself, but I truly hope you don’t end it tonight or anytime in the future at all, one day you will be able to transition, and be the person you were always meant to be. What always helped me was imagining myself as an actual guy in society, even if I’m trans people just see me as a man, top surgery meaning I’ll be able to walk around freely without a shirt on, I may not understand the cause of all your pain and exactly how your feeling but I think you deserve to know how it feels to live your true authentic self and that one day it will get better, I’m sorry you’ve been going through all this pain and I can see that your struggling really badly? And I’ll always be here if you want to talk about it but I just hope you don’t  end it", "label": 0}
{"text": "Well my guessing is that you weren't the same before now because your life sucks you now have brain problems in brain so it activate that part of the brain. Is cause and effect, the preponderatiouns of your genetics", "label": 0}
{"text": "I didn't and i was scared they're going to see me in my pathetic state. And today i talked to them about and they said they're going to talk to me more often and that they care about me but i still can't be sure cuz they're not really showing that they care and it could be one of their lies but imma hope is not.", "label": 0}
{"text": "There's no certainty in life. You can't surely say it'll be bad forever. You also can't certainly say that dealing with it by giving up and ending your life is a simply and easy solution, it's much more complicated than that. It could make it worse. But if you keep living you may find your hope. I know you may not believe that but trust me it really is possible.", "label": 0}
{"text": "Is all genetics, we go for the best we can including girls, the white men on average sadly is more attractive facially blue eyes or cuacasian features why do you think so many asian people in korea does the eye surgery to look more ccuasian eyes, there was even one guy that over 4 year he counted couples white guy asain girl and white female asian guy the statisitcs was that is 95% of cases were withe guys asian girls and he comitted s, join the blackpill the more relatable community aka rehab room and face and lms. Is more to live than our biological needs of wanting to reproduce or having a \"lover\"", "label": 0}
{"text": "I’m a white female and I’ve always preferred Asians", "label": 0}
{"text": "I feel the exact same way. Everything is an effort that I just can’t. My best advice is to take things one at a time and as simple as possible", "label": 0}
{"text": "I’m ugly so that’s the main reason", "label": 0}
{"text": "At least half of this sub is plain terrible people", "label": 0}
{"text": "I think it may be a defense mechanism. Harden my heart in case. I’m an only child and orphan, grandparents included. I guess I should’ve said, I’m the mom, not the dad. You could say, everyone left me so why not another. I’m also feeling extremely protective of my youngest, 11yo. I’m worried it’ll put ideas in her head.", "label": 0}
{"text": "a lot of trans people are body dysmorphic due to borderline personality. You often find a history of severe abuse in their vita. That is why they have  this problem cluster you mentioned.", "label": 0}
{"text": "Yeah, knew you were the mother. Defense mechanisms are powerful creatures, all serving a purpose. Times like these you’re in, the hard part is being able to exist in that grey where you’re multitudes and not simply the woman who was left. So much easier said than done. When in doubt, lean in to your loving mom identity. As parents we’re great at times, horrible at others. Do your best, mom.", "label": 0}
{"text": "So Caucasian features are prettier. What a load of bs.", "label": 0}
{"text": "Hello - If I understand correctly you have been accused but there is no legal case against you?\nYou aren’t famous and you are young with your whole life ahead of you. This is won’t follow you forever. I know you think there is no escape but can you write about your experience of being falsely accused? Can you move to a different area? Distance will give you a lot of perspective.\nYou don’t know anything to your parents wrt grandchildren etc but it sounds like it’s something you want. Can you take a small step and travel somewhere?", "label": 0}
{"text": "Because of the possibilities.", "label": 0}
{"text": "Thank u sm!", "label": 0}
{"text": "Recent studies and discussions have examined how race and income influence dating preferences, particularly noting that Asian men face specific challenges due to cultural and societal stereotypes. For example, a study discussed by NextShark indicates that Asian men may need to earn significantly more (up to $247,000 additional annually) to match the dating success of their white counterparts. This trend appears to be linked to stereotypes in Western dating scenes, which can lead to biases on online dating platforms​\n\n[NextShark](https://nextshark.com/short-and-asian-men-need-to-earn-more-to-be-desirable).\n\n\n\nMoreover, articles from sources like *Psychology Today* highlight that Asian men often struggle with societal stereotypes portraying them as less dominant or less assertive, impacting their perceived attractiveness", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "Please do!", "label": 0}
{"text": "People ignore that. Yes, it isn't my fault but everybody acts as if it is.", "label": 0}
{"text": "What is that?", "label": 0}
{"text": "Incel with suicidal tendencies is never a good thing", "label": 0}
{"text": "I think i will get banned if i say", "label": 0}
{"text": "This is a case of grass being always greener, I could say the same how all women here prefer nordic or asian guys while we (italian, but southern Europe in general) are are all ugly, lazy and all the bad stereotypes usually associated with being from where I am.\n\nWhile I am the first that wants to kill himself due to finding life a meaningless struggle, I got in a relationship with someone who openly admitted to prefer African features (so exactly the opposite of me), your life isn't defined by your nationality or skin color, those who judge you cause of that are superficial and not someone to get in a serious relationship with, I'm hopeful that you'll eventually find that special someone for you.", "label": 0}
{"text": "You should restart too!", "label": 0}
{"text": "I am currently going through the process of dealing with false accusations made against me right now. This one DID end up in the hands of the court, and false accusations have jammed my life right up. \n\nI just want to tell you. It gets better, I promise.", "label": 0}
{"text": "I hope so", "label": 0}
{"text": "And also joining therapy would also help but I don't know that you would want to put your accused crime out there ", "label": 0}
{"text": "You’re not alone, please talk to someone.", "label": 0}
{"text": "Just stay one more day", "label": 0}
{"text": "You know, life is funny in that way. As many times I’ve attempted and not succeeded, I can’t help but feel like I’m a part of this cruel joke and I’m the punchline. Then after some time I find the “why?” answer as to why I’m still here. \n\nI know this is some cheesy shit and it’s hard to connect with when you’re super low, but I swear to god it gets better. Even if for a little, even if it takes a while, it always got better eventually and I found myself having moments where I stop and say “fuck, I’m glad I stuck it out to be here for this” for a lot of stuff. \n\nIt’s never going to be easy, I have bpd2 and cptsd so I am miiiiiserable a lot and I accept this. But it doesn’t mean I won’t have moments where i are so fucking happy i cry, or laugh until i practically piss your pants or experience love. Even if those moments are fleeting, those are the ones to stick it out and hold on to. \n\nPlease hold on. I know it’s hard and it hurts. I wish I could hug you.", "label": 0}
{"text": "I'm sorry to hear it's been so challenging and isolating. How long have you had to live on your own, if it's alright to ask?\n\n(Sorry for not responding sooner - I've been keeping this open to be sure I didn't respond without reading and understanding, since I can have some head issues sometimes)", "label": 0}
{"text": "Lol you dont know to context. Obviously", "label": 0}
{"text": "I’ve lived on my own my entire adult life so starting when I was 18 and I’m about to turn 39 in a week", "label": 0}
{"text": "I'm right there with you...but I tell myself I can't be too hasty. I do not plan to live into old age, but I will make sure conditions are set before I make my final decisions.", "label": 0}
{"text": "I'm sorry about what you're going through. Try to be there for your little brother. Be a good sibling and try to help him become a better person, if that's what gives you joy and fulfillment. At least try to spend time with him.", "label": 0}
{"text": "italians are considered beautiful by most people literally what are you on about bro 💀💀💀", "label": 0}
{"text": "i don’t even know what to say, i feel the exact same way like literally my dad is going through the exact same thing. i didn’t know that so many people felt the way i do before this subreddit. i would tell you to stick through it and it’ll get better but its never worked when people said it to me so i doubt it will work for you. what i will say, is that you should do whatever you can to prioritize your happiness first. don’t do anything too rash. ive found that romance kdramas have helped me. i’m very ugly so it’s hard for me to watch romance in english but in other languages, i feel more detached from trying to make it my “reality”. anyways, entertaining myself if what’s gotten me thus far! i encourage you to try something new, if you’d like a show to start or recommendation, i’d be extremely happy to give you one!! feel better love! i’m rooting for youuu 💕", "label": 0}
{"text": "Why would I stay one more day when I hate my life", "label": 0}
{"text": "I feel like most people aren’t in control of their emotions, their emotions are just so much less intense for them so they don’t cause as big of problems. I understand the embarrassment. It’s not fun to need professional help. It really sucks. But as a person who has been in several treatments, I can say that when you find the right approach it can become tolerable.", "label": 0}
{"text": "I do think that.  I've been struggling to be a functioning person since I was 24/25. My family is sick of me and don't understand why I just can't overcome and be normal. \n\n\nI don't think I have any opportunities in the future. I have no talent, I've fucked my whole life, and I will just keep fucking it bc I'm a moron. I'm just a waste.", "label": 0}
{"text": "It may not mean much to you, but I just said a prayer for you. I hope things get better. I really do.", "label": 0}
{"text": "What makes you feel like ending things? High school can be shit but you're near the end of it at least, soon you'll never have to deal with high school bs again and even if you're going onto higher education people tend to be less backstabbyy on the whole.\n\nWhat do you feel is wrong or missing in your life? I get you don't want to tell peolpe you feel like ending things but it might help to talk to peole around you about some of what you're struggling with or to consider seeing someone even a school consular, the school consular really helped me turn my life around when I was suciidal as a teen, and if you endured all the bs of beng in high school you might as well take advantage of whats avalible to you while you can", "label": 0}
{"text": "You have put every feeling i have into words. \nI am so sorry you feel this. It's an awful way to feel. I'm in constant chronic pain. And I'm just over it \nThank you for articulating what I felt. \nHope you feel different soon. 💔💜", "label": 0}
{"text": "It does make me feel less alone though I am sorry you're expericing these feelings and thoughts as well. \n\n\nI just wish I could give my pets more. They have given me so much in just existing, they deserve the world. \n\n\nThank you for your kind words", "label": 0}
{"text": "Why don't you give yourself plenty of other chances, it is a human thing to have setbacks just keep pushing if you feel like it, if u don't it's fine also. Just take a good care of yourself, try sipping tiny amount of water and eating even a little amount of foods regularly it will prevent your stomach from going upset. Even such a small steps are a huge deal at keeping ur body better even if ur mind doesn't feel so. But it will come time for a better mind also. I know it feels unbearably awful to have to go through all of this experiences alone but hey just try to stick around don't go too harsh on yourself now. You need plenty time to heal and it's fine to take that time. I hope u can recover and cope with ur traumas. Take care", "label": 0}
{"text": "Maybe don't dangle your upcoming hard to access surgery over the head of someone who is experiencing an acute sense of flesh prison claustrophobia?", "label": 0}
{"text": "Outside of Italy yeah, inside? Between an southern european and a northern european i've never seen someone preferring the southern one.\n\nWe always like what we find unique.", "label": 0}
{"text": "Please don’t, my dad killed himself when I was young and it f*cked me up. Please talk to someone.", "label": 0}
{"text": "Hope you'll get pass this too 💔🖤", "label": 0}
{"text": "I've loved other people so much that I've lived for them. I'm tired", "label": 0}
{"text": "I have no background in law, but I would 100% make sure that you and/or your lawyer make sure to gather all of the medical papers that you need, and have that presented to those who will be in charge of those documents in jail. It’s not the end… people make mistakes, and unfortunately people who love doing bad things also love to pull other people in who wouldn’t otherwise do what they do if it weren’t for their “social pull”, if that makes sense. Try your best to eat, as much as you comfortably can and learn what types of foods irritate you before you lose internet usage. I heard that you can sometimes use the internet in jail with special permission and if not, you can try going back to the basics, reading medical books that may relate to your medical condition. I hope the best for you, bud.", "label": 0}
{"text": "i think southern europeans look the best plus italy has the best food in europe imo", "label": 0}
{"text": "I was falsely accused of sexual harassment at work. It rocked my world, I had to go home and tell my wife and explain the situation. I was really close to my then boss too and I felt so embarrassed even though nothing had gone on.\n\nEventually it came out that she had accused 3 other men at work of the same thing, and it was all completely unfounded. She was eventually asked to leave the company. It felt horrific at the time though, and I imagine you feel way worse.\n\nBut honestly, keep your head up and the truth will eventually come out. People who throw false accusations around get found out eventually.", "label": 0}
{"text": "I’m glad you didn’t succeed. You won’t always feel this way. You put your brother first and didn’t want to traumatise him. That’s a start.", "label": 0}
{"text": "What’s a cart?", "label": 0}
{"text": "just wanted to hurt myself a little. but it feels horrible now", "label": 0}
{"text": "ya but hurts", "label": 0}
{"text": "i could've written this...you're not alone OP im a monster too", "label": 0}
{"text": "Sorry, hope it’ll lessen soon", "label": 0}
{"text": "UK, Britain, Bury St Edmunds", "label": 0}
{"text": "ill try to keep going, thank you. i just want to be loved and live a somehwhat normal life to spite my abusers rhat im still living despite everythihg", "label": 0}
{"text": "You’re allowed to use the phone?", "label": 0}
{"text": "I feel the same way sometimes. I’m what seems to be a normal guy just very short, but married, 2 kids, masculine job. But almost everyday at some point i day dream about living as the opposite gender. I get jealous of females all the time. I always wished they had the technology to to 2 peoples minds and swap them into each others bodies. Then people with gender dyphoria can find someone of the opposite gender to switch bodies with. Then soo many people would be happy. We can only dream right?", "label": 0}
{"text": "Stop talking and stop brigading.", "label": 0}
{"text": "Same :( hope you’re okay", "label": 0}
{"text": "I’m here if you want to talk, I know you’re not a monster at all", "label": 0}
{"text": "Listen man I know it really sucks but what works for me is just having some sort of a mindset. Everytime I feel suicidal I procrastinate on it and tell myself \"not today\" or \"maybe tommorow\" you never know when things get better. Dont bring permanent solutions to temporary problems. We all up and down at times. You will be higher soon, just dont hurt yourself yet. You only live once", "label": 0}
{"text": "Take his advice, just forget about him. Focus on developing yourself, you don’t need his approval.", "label": 0}
{"text": "Whatever the reality of what you are living through, there are some things I can say for sure. \n\nFirstly, you are using really extreme language to describe your situation and yourself. Many people don’t realise that extreme language is not just a response of strong emotion, it’s also a cause of it. It can be a cause of false beliefs and extremely strong feelings. Think about how sports teams get themselves fired up with language. By calling yourself a parasite, nothing, saying you have fucked up your whole life, you are doing the same thing but negatively. \n\nIs there any better way of speaking about yourself than absolutely objectively, without any coloured language, descriptions, and especially not absolutes or extreme terms. Maybe write down what is wrong with your life in your view but with absolutely no vivid description, extremity, or even judgment. You have to be absolutely rigorous.\n\nSo for example, instead of someone writing “I totally fucked up my relationship, I am a total fuck up and I’m going to spend my whole life alone”, they might write “I caused the end of this relationship by doing x. I think I did so because of y and z. I might not have another relationship, but if I do I will remember the lessons from this one”. Or something similar. \n\nTake the catastrophe out of your language, and maybe your problems will start to seem more real and tangible, and therefore approachable. \n\nThe second thing is that you evidently care for animals. You have the capacity to love, nurture and care for other lives. That is a truly wonderful thing. So many people don’t care at all about others at all. Those people are truly empty, and have a significant struggle ahead of them. \n\nThis love for your pets is the signpost to a great virtue of yours, it sounds. Would the world not be better with your inclination to care for others in it?", "label": 0}
{"text": "Yeah, me too! But killing ourselves isn’t the answer. Delete Facebook, it’s nothing but a gossip network anyways! Talk to someone, please. I regret not doing it sooner after what my dad did.", "label": 0}
{"text": "This isn’t fucking temporary. It’s not. It’s not as simple as just waiting an undetermined amount of time for me to maybe be happy. It’s not. That’s not how trauma works. That’s not how life works.", "label": 0}
{"text": "Now since I read your message I will definitely miss you, and if that sounds too naive, I'll at least keep you in mind. So here u are. Honestly I'm also feeling like trapped in a same crappy routine. Even know staying up late trying to keep others spirit up but still living a miserable life. Is it out of pity, out of loneliness or am I just distracting myself? might be both actually but screw this \nI wish I could erase your suffering but I don't even have control over my own..\nI hope u will stick with us for a bit longer so maybe some aspects will get eventually brighter and bearable (some will definitely do). Maybe life ain't no sunshine and rainbows but definitely not all storms and lightings??! (I do like storms tho). So ye I hope u will be fine.", "label": 0}
{"text": "I’m sorry", "label": 0}
{"text": "I feel your pain but suicide isn’t the answer! Please talk to someone. You will get through it as I did.", "label": 0}
{"text": "hey bubba, just try to stay calm. when they say not to let a drunk person sleep they mean someone who's already throwing up and on the verge of passing out, if he was talking and got in bed himself he's probably fine. if you're really worried you can go up and make sure he's sleeping on his side. the main concern is that the person might throw up and that's not good if they're sleeping on their back.\n\ni'm sorry that you have to go through this. seeing your parents drunk is scary. try to distract yourself, watch a TV show or a movie. my mom drank almost a whole bottle of liquor everyday and nothing ever happened to her while she was sleeping.", "label": 0}
{"text": "I knew several guys who were in jail and have criminal background. They say you meet best and worst people in there. Some swear to me that jail is an experience they'd recommend to everyone since it makes you tougher.\n\nStuff like that. So have that in mind as well.", "label": 0}
{"text": "because you can have the life you want.", "label": 0}
{"text": "Oh, yeah :( I feel like that did a number on a lot of us\n\nWhere do you usually go to for company/activity, if it's alright to ask?", "label": 0}
{"text": "If I could forget about it I would not be here.\n\nIt's called trauma", "label": 0}
{"text": "The average person dies in their 80’s so you’d miss quite a lot. I could list this out for you but it would be an incredibly long list.", "label": 0}
{"text": "I have BPD and this is exactly how I feel. It’s like minor inconveniences build up & I explode... and then I feel horrible and even \nmore suicidal after because of regret of how I acted. It’s like I know it’s irrational but someone else takes the wheel. I become a villain, a monster. I beat myself up, I feel gross in my skin, I get stuck in loops of negative and nihilistic beliefs. I don’t wanna be this way. I push away loved ones and I make myself feel undeserving of care and love. The thoughts get worse when I don’t eat all day of course, but often I simply forget to due to depression or work... \n\nWhen I’m at work distracted I’m a completely different person. I bet no one could ever imagine me having the outbursts I do at home. And the only people who know are my mom bf and sister. They don’t know what to do as they’ve dealt with similar things at a point. But I know that my mood swings / episodes are even more irrational/ intense than they may have ever experienced,  and that makes me feel so isolated. I wouldn’t wish this upon my worst enemy, being at war with yourself daily and being unable to explain why... It’s like I’m holding guilt for something, but what?", "label": 0}
{"text": "You'd miss pretty much everything", "label": 0}
{"text": "Life gets easier. I am 25 and when I look and 20yo me, i am different person. I had really bad time, but I had even really good ones. I experienced something so impossible for 20yo me. \nAnd from what I heard, 30s are even more fun. I can’t wait to see how I progress in life.", "label": 0}
{"text": "If you take a look at my post history you would see that I’m trapped. No hope, no nothing, no escape.", "label": 0}
{"text": "So before he went to bed he threw up and yes he was talking then he went to the living room went on the couch then that's when he fell asleep. But he's laying on his back and I wanna check on him but my mom is and she's right now yelling at my autistic brother. And if she sees me checking up on him she'll get real mad. The reason I wanna check on him is because he is a very nice guy I mean very nice but i don't what to do. I really need help. Plz Thank You.", "label": 0}
{"text": "You will miss the rest of your life.", "label": 0}
{"text": "Nowhere but that’s not from lack of trying I tried to be involved at church. I tried book clubs. I tried tennis club… I live in a pretty rural area and obviously without a job even if I wanted to I can’t move right now, so all of this is feeling so entirely hopeless", "label": 0}
{"text": "I hope so.", "label": 0}
{"text": "I sended you a message", "label": 0}
{"text": "You'd miss the good stuff. Every day I'm grateful I failed all my attempts in my late teens. It isn't always easy, but it is always worth it.", "label": 0}
{"text": "What is quick about that rtard", "label": 0}
{"text": "I know they can’t fix your symptoms, but maybe they could help you financially. How many appointments have you had without a diagnosis?", "label": 0}
{"text": "Good night to y'all ", "label": 0}
{"text": "Dont do this man your bringing permanent solutions to temporary problens cmon bro you can do it your better than that... dont give it all up after what you have already fought through.", "label": 0}
{"text": "not for me, nothing to look forward to.", "label": 0}
{"text": "Whats going on? Ill listen please dont hesitate to talk it out, it helps", "label": 0}
{"text": "I have met people that were real happy after realizing  that is not theyr foult for not having the looks requierment for delusional standards today for young girls in the west ", "label": 0}
{"text": "Why?", "label": 0}
{"text": "Read my post history, I’m doomed", "label": 0}
{"text": "I get that. I don’t know if school counselors have patient confidentiality as much as regular counselors do, though even they have to call someone in dire circumstances, though it doesn’t sound like you have gotten there yet. Have you ever made plans for adulthood, for anything you’d like to do.", "label": 0}
{"text": "What happened? Is the church shut down during Covid and I feel like it never really came back. They still have virtual services so most people don’t go in person. It’s really weird and no I haven’t really checked on anybody cause I never that close with anybody I mean, I have friends that I text with on the daily but They don’t know how to help because I don’t know what I need", "label": 0}
{"text": "The problem lies in assuming all the young girls are the same, it’s sexism wrapped in self pity", "label": 0}
{"text": "You can wait till 21.", "label": 0}
{"text": "To love and to be loved by a partner", "label": 0}
{"text": "You are gonna be okay. Things suck but in the end life is worth it, and if you die you don't only lose the bad things, you lose all the good and the possibility for anything good.", "label": 0}
{"text": "If you are still alive then please don't end your life. \nGive it a shot, I am sure you will be happy again.", "label": 0}
{"text": "me too im ugly too", "label": 0}
{"text": " I hope you're still here", "label": 0}
{"text": "That’s because those women are real women, you can fake it til you make it.", "label": 0}
{"text": "I can't get away from my family, sadly. I feel death is the only way out.", "label": 0}
{"text": "Hey, are you ok?\n\nPlease tell me if you are.\n\nPlease don't end it.\n\nI'm not trans, but I relate through the pain.", "label": 0}
{"text": "Even though I'm not gender dysphoric, I relate, weirdly enough.", "label": 0}
{"text": "No your not", "label": 0}
{"text": "That’s a good idea. I wish I knew more about cars, I was always more into animals than machines, but I see the appeal. I’m glad you have someone you’re close with, I would have loved to live nearby my best friend when I was younger.", "label": 0}
{"text": "Thank you, it means a lot. It means even more to me to know that a stranger online would care to write all that for me.. I appreciate you trying to bring some light into my life even when you're going through a lot, and I'm sorry you're struggling as well. It's hard to leave this endless cycle, and for me I don't even want to, I don't care anymore. \nI get what you mean by trying to help others as a distraction, I think it's easier to help others rather than face our own problems. \nBut knowing someone might miss me, even if it's all just words to comfort me, it still makes me feels a little less lonely. Thank you. 💜", "label": 0}
{"text": "The title of this made me want to cry but bc I'm a male I gotta hold it in and not", "label": 0}
{"text": "I can see myself in your shoes, and its so awful to feel. But your writing is very catching to me and I hope you know", "label": 0}
{"text": "That’s how i am with the whole trans thing I’m not trans or officially diagnosed gender disphoric but i can relate with it all.", "label": 0}
{"text": "Everyone is a number, we're just a shitty one", "label": 0}
{"text": "Get a therapist and talk to them to help bro ♥.  Trust me man there's more to life than just dieing.", "label": 0}
{"text": "What happend? I need to know what's going ? If not then try to talk to a therapist ", "label": 0}
{"text": "Mask it with something else, next time you see one hint at it, see if you can get your parents to leave the room. I've also had really abusive parents and I had to do what I could to get treated", "label": 0}
{"text": "You can also go to a planned parenthood, while it may sound odd they can check hormone levels at the very least, anonymously. Some of which can be free as well. Tell them your situation and they can do their best to help", "label": 0}
{"text": "Aren’t cis women just…biological women? Why do we have to put “cis” in front of it? Genuine question", "label": 0}
{"text": "💖 hello! Found your post and wanted to tell you i’m thinking of you and hope you are well today !", "label": 0}
{"text": "I'm so sorry that you were abused by your teacher and it's caused so many problems for you. Are you getting any outpatient therapy? I hope the teacher is being punished. I hope you stay alive, not just for your family but also for you.", "label": 0}
{"text": "Australia working holiday 3 year visa,  get a van, kit it out with a bed, get a dog, and go live life on the road for a few years", "label": 0}
{"text": "I'm so sorry your going through this firstly have you seen a therapist about this because this seems really serious like you need immediate help ", "label": 0}
{"text": "If I have to pay someone they don’t really care about my problems", "label": 0}
{"text": "Have you ever mentioned your feelings to your sister?", "label": 0}
{"text": "You're great", "label": 0}
{"text": "When you were in school did you feel like you had a goal?", "label": 0}
{"text": "Go have an awesome day you fucking wonderful person", "label": 0}
{"text": "The same happend to me last month, i feel so lonely", "label": 0}
{"text": "Depends on many things. I am 36 and I regret not killing myself at 20. I know this will get downvoted to hell but sometimes things don't improve. I think the last time I was happy was when I was a young child.", "label": 0}
{"text": "I'm sure your very pretty (not in a weird way) but in all do respect fuck those people who say your ugly and if your saying that to yourself I want you to write down why in a journal trust me this may or may not help but my advice is get a journal and write down why your bullying yourself so harshly because the more you bully yourself the more your going to fall into this rabbit hole you have to have a little bit of ego in this world but your dad should not be showing you pics of yourself that you would rather not see", "label": 0}
{"text": "Me too :( what’s your cats name?", "label": 0}
{"text": "I feel the same way I been bullied my whole life and you know why? They don't want to see anyone they judge striving in fact they want to see you down in the dumps ", "label": 0}
{"text": "Is the feeling you’re talking about good or bad or something else?", "label": 0}
{"text": "Same here mate 🙋\n\nWelcome to the club.", "label": 0}
{"text": "It's not that simple, you're right. That said, many people have healed from trauma, and there are ways to eventually overcome it to a degree where life can feel meaningful. ", "label": 0}
{"text": "Do you feel safe currently at your house?", "label": 0}
{"text": "as a cis woman i also want to die, hope this helps", "label": 0}
{"text": "Yes, it would really help", "label": 0}
{"text": "Listen, you need to realize that you are you, you are unique. If things aren't working out, they will at some point. Don't let the evil thoughts win. If you need a friend to talk to, I'll be your friend. There will be people in your life who will stand for you and back you no matter what, sooner or later. I'm being completely serious, drop that thought out of your head and get out of that dark place and kick life's ass. And like I said, I'd be willing to talk, I've been in those dark places myself.", "label": 0}
{"text": "I'm worse than you. And most people are worse than me.\n\nSo take that.", "label": 0}
{"text": "Just let yourself be in this spot man, if u got there you deserved it, and If u still doubt that u might as well take that opportunity and make something good out of it. ", "label": 0}
{"text": "Doubt it", "label": 0}
{"text": "Shoot your shoot", "label": 0}
{"text": "What do you mean by not supposed to be here?", "label": 0}
{"text": "Does writing make you feel better at all or no?", "label": 0}
{"text": "Nah nah nah boo boo 🤣", "label": 0}
{"text": "I feel you. My writing sometimes makes me feel nothing at all either. \n\nHow often do you get the flare ups?", "label": 0}
{"text": "I wish I could wish you a happy birthday but since it doesn't seem it will be happy I just wish you to experience as many those long naps, that you admire, as you can and I hope they will keep you here for a little while longer. I'm actually 21 and I'm older as fucker and u know life got them aspects man, like a bittersweet dark chocolate. Take care man ❣️", "label": 0}
{"text": "Lmk if u find out", "label": 0}
{"text": "Look bro it's not easy. And in this day and age it's harder than it ever was. Women rule the world and they only wanna fuck like the 20% or 30% of men. But you gotta keep trying.", "label": 0}
{"text": "Depends... \nI had like 3 flare-ups from the beginning of the year till 2 months ago then I had a really strong flare up 3 weeks ago and it just ended\n\n\nThe weird thing is that usually people are happy with depression episodes I'm depressed with happiness episodes", "label": 0}
{"text": "This is not the place for your “genuine question”", "label": 0}
{"text": "Thank you for explaining.", "label": 0}
{"text": "Today I was screaming and destroying my house. I took a bat and smashed all the glsss in the house because I was mad at my mom for taking my phone for a few hours", "label": 0}
{"text": "How long ago did the losing your friend happen?", "label": 0}
{"text": "Depends. There's a war so I've been losing people left n right for the past month. My bsf left me like.. 12hrs ago", "label": 0}
{"text": "Which country are you living in that’s at war?", "label": 0}
{"text": "I don't even want sex or a one night stand, I wanna lose my virginity to someone who actually loves me. But nobody even gives me the time of day, I can't even get my foot in the door. I also don't just want to start woman-hating, since I understand their decision.", "label": 0}
{"text": "It’s ok bro. I’m the opposite of you, pretty face but I’m short and built like a little boy. We all have our own strengths and shortcomings. It’s never that deep. Get drunk!", "label": 0}
{"text": "Lebanon", "label": 0}
{"text": "Give me $600 and I'm sure there are good ideas for the rest 🚶🏻‍♀️", "label": 0}
{"text": "Thanks for sharing.", "label": 0}
{"text": "Even the psychiatrist sucks so that's why I changed", "label": 0}
{"text": "I think you can find someone. A lot of people find someone in their 30s and 40s. You have time left. You're getting paid for a job, so you're keeping up. Just maybe step by step make a schedule for what you will do every day. Maybe first do something for the things that are due, something like that, and then go find the next important thing, something like that maybe.", "label": 0}
{"text": "You being stressed shows you care that's not selfish you wanted to help both of you guys out. I don't know the problem but you can try to mend your relationship maybe try doing something fun but if it doesn't work you still have uni and you'll be able to get a good paying job.", "label": 0}
{"text": "You're such a young person I can tell by the comment so you don't understand the power of being a woman", "label": 0}
{"text": "Oh sorry to hear that.  I’ve certainly had my fair share of bad psychiatrists.  I hope you get a good one soon.", "label": 0}
{"text": "Oh damn how are you all doing over there that sounds like it would be scary as fuck", "label": 0}
{"text": "I don't drink but I appreciate the sentiment :p", "label": 0}
{"text": "I was thinking about death a lot and this week there was an explosion in my house because of gas! I discovered that I was really stupid to let my mind think about it all the time! There are other things I want to do now more than ever!\nThings that are true and bring me pride and life, not things that will make me feel even more ashamed and disgraced and want to die because of a fleeting pleasure!", "label": 0}
{"text": "I'll stay off of drugs or alcohol, but I like your vibe!", "label": 0}
{"text": "Its scary, we get evacuation notices every night and there's bombings and sonic booms 24/7 \nEverything's getting more expensive and I'm stateless so I cant even leave...", "label": 0}
{"text": "Ecstasy is better than coke tho", "label": 0}
{"text": "I feel the same way, sorry you’re going through this", "label": 0}
{"text": "I think I am just gonna kill myself", "label": 0}
{"text": "Did she say when u did? If so do u remember what u where going then? If so maybe see if there are any pictures or anything", "label": 0}
{"text": "Same. Nobody around me seems to understand why I’m so depressed…. I’m already saving up for surgery lol", "label": 0}
{"text": "I'm glad you said this.", "label": 0}
{"text": "What they do is up to them. I just wasn't born good enough and I'll have to live (or soon die) with that", "label": 0}
{"text": "not all women are pretty and im tired of people pushing this myth there are millions of ugly women that no man wants and im one of them it would be better to be insulted than to recieve a fake compliment tbh", "label": 0}
{"text": "You have to keep trying.", "label": 0}
{"text": "That must suck to lose a friend on top of dealing with all of that.", "label": 0}
{"text": "the power of being an attractive or average woman yes but us ugly girls dont get shit", "label": 0}
{"text": ">My suicidal thoughts are permanent. It's not a permanent solution to a temporary problem. Experts may say this, but it really depends on the person. Yeah it's often treatable. But I genuinely never enjoyed life already when I was younger.\n\n*Finally* someone who really gets it.", "label": 0}
{"text": "I don't understand why everyone wants to be beautiful. Let's suppose you were dealing with a blind person and not a sighted person. Wouldn't the blind person think that you wronged yourself when you killed yourself? \nSuppose you were born blind ,I'm sure beauty is the last thing you'll think about in the world! You'll say! Hey, it's okay anyway! \nYou will have time away from the mirror to think, research and take care of other things! \nI'm not saying ignore it! I'm saying accept it! Accept that this is your face and move on.", "label": 0}
{"text": "She's only 4 years old :( but I asked her for forgiveness even though she doesn't understand", "label": 0}
{"text": "It's not fake as I am one of them I have no judgement regarding looks ", "label": 0}
{"text": "I'm definitely sure she has a pretty personality so she can take it that way as well", "label": 0}
{"text": "I previously told my psychologist that I believe I direct the anger from the things I went through with her father. From black eyes, betrayal, abuse, etc. but it's shit for me to repeat the shit they did to me. I had improved these points. It got 100% worse again", "label": 0}
{"text": "Hi, I am a member of that original community that you mentioned. I liked the post and was also distraught to see so much hate. I think it really can be a good idea to take some time off social media and focus on people truly important to you. Everyone you meet online doesn’t matter, you and your real life does. Please, be safe and take care.", "label": 0}
{"text": "Well maybe you need more confidence.", "label": 0}
{"text": "I don't know how to deal with anger, my psychologist said it was because I never had the space to talk when I was younger. To this day I have difficulty with this. I have no friends to talk to about it. I live with this alone. My family doesn't give me space or support with my life. I go through this alone.", "label": 0}
{"text": "I'm 22, I'm in college. My major is fine, but I'm not nearly passionate enough for studying it to be fulfilling in and of itself. Though I think I enjoy it more than I would any other major so I don't think switching is the solution.\n\nThe main issue with college, however, is how deathly lonely it is. I feel like if I died tonight, a single digit number of people would even notice (of the people on campus I mean). I'm in my fourth year and I've made 0 friends. I had friends in high school so it's not like I'm just socially incompetent. It just really feels like no one wants me around here.\n\nRecently my depression has made me miss class a lot which in turn just makes things worse and adds more and more to the self hatred.\n\nBeyond college issues, there's also romantic loneliness. My dream was once to fall in love but I know it will never happen. And that fact hurts so, so much. Knowing that, no matter what I do, how hard I try, no one would ever even consider dating me. It really just makes everything feel pointless. Like why even bother if what I want most is forever unattainable?\n\nI believe in reincarnation. That's a big part of why I want to kill myself. Because, even if my dream is impossible in this lifetime, maybe in whatever life comes next, it won't be. Maybe then, I can be happy.", "label": 0}
{"text": "I doubt it's illegal but it's probably against reddit tos", "label": 0}
{"text": "send it to me, it would change my life.", "label": 0}
{"text": "It's not the past actually. The past is mostly positive for me. It's the present and the future that are the problem\n\n>If it's the present and you're in pain, know that it will pass\n\nI don't think it will though. I think it will, at best, stagnate. And at worst, get even worse than it is now.", "label": 0}
{"text": "Yep...", "label": 0}
{"text": "Have you considered consulting a plastic surgeon? If there is something about your face that you're very insecure about, perhaps having surgery to improve the appearance of that feature/those features would make you more confident and comfortable in your skin.", "label": 0}
{"text": "I’m really sorry. The job market is literally so awful everywhere on earth right now. Do you have someone you can live with for a while? What’s making studying for your driver’s license so difficult?", "label": 0}
{"text": "I glad you're a little better ❤️", "label": 0}
{"text": "Same, maybe try to go outside that's the only thing I did today I think it relieves some stress from people and really I don't know why for some reason I still care for you as a human.", "label": 0}
{"text": "You have time, if you like games you have something play as many as you need and there's going to new games coming out always also you have your partner. I think you'll be ok.", "label": 0}
{"text": "me too! I usually wake up in a panic which subsides as I go about the rest of my day because I usually don't sleep enough. Being sleep deprived ironically gets me through a lot of the panic and anxiety", "label": 0}
{"text": "I feel like it'd make it worse, since that isn't the real me anymore. :(", "label": 0}
{"text": "Hey, what you’re dealing with sounds rough, and it’s totally understandable to feel down when everything feels stacked against you. I'm sorry that this is happening to you. A few things popped up into my mind. Maybe you'll find them helpful. \n\nLook for connections that aren’t just about looks by diving into communities like volunteer groups or hobby circles where appearance isn’t the focus. When you’re doing things you care about—projects, hobby, volunteering, whatever—it can feel fulfilling, and you’ll often meet people who connect over shared interests or values, leading to more genuine friendships with people who respect what you’re bringing to the table.\n\nIf your therapist’s advice doesn’t vibe with you, maybe try someone who’s more focused on self-worth or body image issues. Different therapists = different perspectives.\n\nStick with your fitness journey: You’re already dedicated, which says a lot! Maybe joining a group or team could help you find people who value that commitment.\n\nAlso, I'm not sure what's the size of the city you live in, but the smaller city, the bigger the oppression for any differences. Doesn't matter the country. It's just how I observed it to be.\n\nYou’re clearly doing everything you can. Try taking it a day at a time, keep looking for spaces where you feel valued, and keep building up that inner strength.", "label": 0}
{"text": "they mean COCSA which is \"child on child sexual assault\"", "label": 0}
{"text": "Yeah I'll try, If I actually get to say anything. Can't even say hi before they run", "label": 0}
{"text": "Is your therapist a man or a woman?", "label": 0}
{"text": "Can I get a hug from you please? I really need it", "label": 0}
{"text": "Man", "label": 0}
{"text": "ironically i don't want anyone else but me going through this. please don't fuck yourself up, you have too much value", "label": 0}
{"text": "I know nobody will read this, but my father passed away a few months ago. I'm finally doing alright, but I can't stop thinking about how my father was the only person I could talk to. It's breaking me every single day from dawn till dusk. It's breaking me every day.", "label": 0}
{"text": "Hmm. Strange.", "label": 0}
{"text": "why?", "label": 0}
{"text": "Do you write a lot? Or just when you feel the flare ups", "label": 0}
{"text": "I understand everything you’re saying, I can relate.", "label": 0}
{"text": "i guess being let out into the world away from my parents is gonna fuck me up. i dont see myself buying food more than once a month or some shit. dont know where to get drugs tho", "label": 0}
{"text": "we share the same problem", "label": 0}
{"text": "please don’t do it. so many train conductors go through immense emotional pain due to these situations. giving someone else a mental health condition doesn’t seem like a good idea", "label": 0}
{"text": "When you starve yourself you actually gain weight instead of losing it. When you starve yourself, your metabolism slows down and will start storing fact in order for your body to get energy. You might also start craving more food that you need because your body is going into survival mode, your body needs energy so please don’t do it.", "label": 0}
{"text": "hey please stay. I don't know you nor your life nor what you are going through but you mean to me", "label": 0}
{"text": "If you end ut now, you'll never know what you'll miss. Chances are things will get better", "label": 0}
{"text": "I’m sorry that’s happening to you. I wish I could do something but the only thing I can say is to do your best to get through it and don’t give up. It will take time, but these days of your life don’t correlate to the life you have left.", "label": 0}
{"text": "maybe they won't notice....", "label": 0}
{"text": "🫂", "label": 0}
{"text": "If you want to be skinny, you need to do it the healthy way. You can start small and do 30 minute walks each day and slowly expands. Go on runs if you want something that’ll make you lose weight faster. You can also try skipping, I’ve seen many people lose weight from doing skipping everyday.", "label": 0}
{"text": "hey, have you tried talking to an anonymous  crisis line so as not to feel lonely?", "label": 0}
{"text": "It’s basically already too late if you don’t get a girlfriend before graduating college", "label": 0}
{"text": "Don't do it bro, talk to me", "label": 0}
{"text": "Nobody gets happiness by waiting. You have to seek it out. Can you give us any more information about this trauma?  Different situations require different solutions and pretty much always some effort.  And actually, life kinda is about time. And 5 billion other things.", "label": 0}
{"text": "800 wont do it", "label": 0}
{"text": "I think ppl are more not giving advice because they dont know either rather than knowing but not wanting to say", "label": 0}
{"text": "I’m suprised that I made it to 22", "label": 0}
{"text": "dont get pregnant and ruin your life twice", "label": 0}
{"text": "I know what you are going through. I mean it. \nPlease talk to me , you're not alone. I promise", "label": 0}
{"text": "This has me fucking crying", "label": 0}
{"text": "I don’t know what it’s like to lose a loved one. I’ve always been privileged that way. But I know it would crush my mom if I died. Sometimes I get mad at her for having me. Why didn’t she consider the fact that I might be a bad person? Why didn’t she adopt a kid who was already here? Why for the love of all that is holy did she not think about the insanity that is bringing a self aware unique being into the world? But it’s wrong. What she did was the most natural thing in the world, it’s not her fault that I made the choices I made, even if it is her fault that I’m here. I won’t ever have kids. It just seems so absurd. But I can’t ever judge people for doing it. I’m sorry you’re feeling this way. You’re suffering means just as much as their potential suffering, but I would hope there is a way to end yours without starting theirs.", "label": 0}
{"text": "my point is that i want to make myself suffer and die slowly, being skinny is only an epic side effect of what i want to do to myself", "label": 0}
{"text": "Thank you, H and Nox which don’t have a cure. I don’t even have insurance either.", "label": 0}
{"text": "I don’t know much about stds but I don’t think I ever believed it was lethal. Sex in general, and sexual acts alike, are heavily stigmatized in society. For some cases there is very good reason, but stigmas around talking about stigmas is where we really stop progression without actually stopping great harm. Do you have any friends around at this time?", "label": 0}
{"text": "Yeah it's not something you \"give\" yourself or decide to do either. It's more being so traumatized by something you do it because it makes you feel better.", "label": 0}
{"text": "I wasn't happy until like 25. So happiness. That's what you'd miss. I know it sounds impossible to see a future at all sometimes, but after some courage for therapy, followed by self reflection, and more courage, it's 10000% worth it!", "label": 0}
{"text": "That’s going to take a long time, around a month to die from starvation. You’ll probably start feeling so tired and zombie like your body will go into survival mode and eat all the food you can.", "label": 0}
{"text": "I’m an idiot. If I tried to shoot myself, I’d probably end up more disfigured than dead. I don’t have the answer you want or the answer I think you need. I’m sure you’ve been told all sorts of niceties, and niceties can only go so far. Does anyone have any clue that you’re about to attempt?", "label": 0}
{"text": "I’m so sorry you’re suffering so much. You don’t deserve this lonliness at all. You aren’t a waste of space at all. You should try to reach out to your family or to your partner but I know how hard that can be. I’m wishing you the best and I’m here to talk if you want to", "label": 0}
{"text": "I can relate to this way too much", "label": 0}
{"text": "I'm going to try and escape. My mom is picking me up. They might be able to stop me still. Not sure about their security ", "label": 0}
{"text": "Btw sorry if I wrote something wrong, english is not my first language", "label": 0}
{"text": "Technically what we have as art history today is the art from history that survived", "label": 0}
{"text": "I won’t tell you you’ll find the one. There’s no guarantee. I will tell you that you have every right to mourn that fact, even if I know that you have worth outside of it. Existence is a fight. Time makes losers of us all. We’ll never beat it. All we can do is optimize the time we have. And part of that optimization is being happy. Every bit of useless joy we steal is an insult to our live to survive evolution. I’m sorry you have become apathetic. It’s often far worse than anger or sadness. Are you far from your family back home, or are you close at all with them. Halloween snuck up on me, I realized I didn’t care. That hurt.", "label": 0}
{"text": "It's all quite well done, rest assured. You don't deserve your mother acting abusive towards you like she has. You're not too ugly to love or be loved, trust me on that. And I know it's hard, but you should try talking to your grandmother. I think you might be surprised by how much it can help just to let out all these things with someone you know loves and supports you.", "label": 0}
{"text": "Life is a really dark comedy. Though, given how great dark comedy is, you’d think it’d be more amusing. It’s never the same when it’s happening to you. I’ve heard that Chaplin once said, “Life in close up is a drama, in long shot, a comedy.” It’s probably a little too pithy to properly portray the nuances of life, but I still like the quote. Making friends for some is exceedingly hard. I’m one of those people. It feels like trying to catch a stay dog. Are you close with your family by chance?", "label": 0}
{"text": "How long have you had your dog?", "label": 0}
{"text": "I adopted her in November 2022", "label": 0}
{"text": "why don't you talk to crisis line ?", "label": 0}
{"text": "Shame can color everything. I’m glad your job is so damn understanding. I would think if they’re progressive enough to not fire you, then they wouldn’t judge you for your honesty, which you should be proud of. You did the right thing. Have you struggled with shame over your mental health in the past?", "label": 0}
{"text": "Do you live alone with her? Almost two years together. Damn", "label": 0}
{"text": "Nothing; everything is stupid unless you have money.", "label": 0}
{"text": "The power of being a woman? Being more at risk of being harassed, assaulted, victimised etc and the pressure from society to look a certain way?", "label": 0}
{"text": "Have you ever attempted suicide in the past? Damn man, I wish I knew better what to say. You must be pretty fucking miserable. Does anyone know about how badly you’re suffering?", "label": 0}
{"text": "Dude, what?  Why?", "label": 0}
{"text": "You gotta get the right color match. Tarte shape tape is pretty good", "label": 0}
{"text": "I hate my body so much. Such a fat fucking potatoe. I wish i could wither away into nothing. I try to abstain from food for days at a time, but i stay as ugly as always. Partially because the idea of eating sickens me, but also because i dont deserve to eat. Fuck i just want to die already", "label": 0}
{"text": "true", "label": 0}
{"text": "Thanks for the words bro", "label": 0}
{"text": "I feel the same way. I have a son (3) and a daughter on the way. It seems every relationship I have/had has ended because of my mental illness and I continue to hurt the people I so desperately love. I wish I could successfully attempt and stop bringing pain to them.", "label": 0}
{"text": "Like you, I started feeling suicidal around 11. I’m a little older than you are now, and I won’t lie to you, I’m feeling suicidal currently as well. Following a pattern of ups and downs may be better than just pure downs, but it also feels more insulting. It’s really cool that you write. I like to as well, though I wish I was better. Do you have a favorite author or poet or philosopher of sorts? I haven’t read enough in my life.", "label": 0}
{"text": "same i grew up in a super catholic home so the fear of hell was installed deep into me", "label": 0}
{"text": "Im in so much pain. The chest pain hurts, i never seem to get used to it. Its like a boxer punched me in the chest. Im losing my mind. I cant keep this fascade up anymore. I need to not exist. I should exist. I dont DESERVE TO EXIST. Fuck just let me die. Mom may have breast cancer. I hate her but love her and im heartbroken at the thought of her dying. She put me through so much hell but i know she loved me in her own backwards fucked up way. I want to die i want to die i want to die i want to die i want to die i want to die i want to die i want to die i want to die i want to die i want to die i want to die i want to die", "label": 0}
{"text": "Change is hard. I’m glad you’re giving yourself time if not hope. When I was 11, I told myself I’d get one more year to do all the fun things I wanted to. I’m still here 7 years later, useless and even quite possibly less than, but I’m here, on the same earth a lot of useless people inhabit. What do you think is your biggest goal, your most pivotal one?", "label": 0}
{"text": "Still here man? I’m sorry. I’m sure it’s been a long damn time.", "label": 0}
{"text": "Do you know what’s causing your misery? You don’t have to answer if it makes you uncomfortable.", "label": 0}
{"text": "I have some sort of undiagnosed condition. I’m also days away from being homeless.", "label": 0}
{"text": "I can’t say whether it will get better. When I think about dying, I don’t think about missing out on happiness, I just think of missing out in general. But it takes more than a little bit of shit to make death look better than life. Are the suicidal feelings a recent development?", "label": 0}
{"text": "I’m so sorry about your dad, even though I’m sure you’re sick of hearing it by now. It won’t bring him back I know. I love my dad. I want others to love him and remember him after he’s gone. I think of one of my family members who killers themselves decades ago, even a century maybe. I wonder what he would think if he knew I cared all these years later, someone he never met. I hate that your dad is gone, but your love for him is beautiful, and it’s just as alive now as when he was alive. Do you have any passions of your own, something that makes you happy even if on a smaller scale? ", "label": 0}
{"text": "☹️", "label": 0}
{"text": "What kind of dog do you have? I hope you enjoy your time at the doggy daycare. Dogs are incapable of judgement, I hope you feel that freedom when you’re around them. I have a little guy. Ironically, I think  he would be just fine if I left, and I’m happy for him.", "label": 0}
{"text": "My parents don’t have stable housing either. They lost their house last October and none of us have found a stable place since", "label": 0}
{"text": "Perhaps this is a bit insensitive.\n\nTo be completely clear, I have nothing to say to you that would make you feel better. Or to convince you otherwise. \n\nBut I need to get this question out of my system.\n\nHave you ever written poetry? You have a great voice. In terms of writing, I mean. I think you’d be good at it", "label": 0}
{"text": "Those are not healthy relationships if your “friends” are making fun of you for your addictions. They should be offering support and taking you out to begin healthier hobbies and activities. Please surround yourself with people who have concern for you and care about you. On the other hand, please don’t worry about losing your virginity. You are 16. That is the beginning age of consent in the majority of North America. This is the start of when you can legally have sex, you literally have so much time, do not rush it. Intimacy is cultural, you may hold it to high standards which is where those wait for marriage, or lower standards where it’s something that you do because you want to and both are okay. Before you even have the chance to have sex, consider where you place yourself on that scale. Don’t have sex just because your friends are. I lost my virginity at 16 due to peer pressure from my ex because i was still a virgin and I regret not waiting until I was sure about the person I was giving my body to. That’s the standard I hold. Take time to think it through before you actually go through with it. Sex toys are good enough for teenagers if you just want that feeling of sex. Don’t put too much stress on yourself ok? Live life and have fun first. You’re still a kid.", "label": 0}
{"text": "True, there's np-one else like her but you can find someone else who is unique in a different way", "label": 0}
{"text": "Do you think any of your family members are suicidal like you are? Do you think this may be more than these horrible circumstances? I can’t imagine the stress going around.", "label": 0}
{"text": "Thank you🙏", "label": 0}
{"text": "I have the weirdest kink that we had in common and that’s what I look for in my partners, as well as them sharing my interests in video games and music and movies, and she had all of those things in common and I took her for granted. I really feel like I have no other choice.", "label": 0}
{"text": "There is always another choice", "label": 0}
{"text": "remember to put yourself at your top priority, if your relationships aren’t healthy or safe for you it may be time to reevaluate your situation. Stay safe, have fun and be a kid. I just turned 18 a couple months ago and i seriously wish I just went out and had fun with friends more often.", "label": 0}
{"text": "Yeah. It can make it hard to love what you love. Do you think you would benefit from meds or therapy?", "label": 0}
{"text": "Don’t try again. It didn’t work for a reason. \nBe happy your friends care enough to check on you. Everyone in my life is the opposite and they pretend everything is fine and normal and never ask how I’m doing. Trust me I’d rather have them checking on me. \nYou’re not alone. Your friends are there to support you, let them be that support.", "label": 0}
{"text": "Please don’t do this. Please get seen by an actual doctor. This is horrible. I’ve had anorexia too. I’m so sorry.", "label": 0}
{"text": "im losing my shit why is everything going so fucking wrong tonight why cant i have one good night where i don’t go to bed crying my fucking eyes out", "label": 0}
{"text": "Please listen to that unthinking voice inside of you that says not to do it. \n\nI wish you all the best", "label": 0}
{"text": "Is there any chance You can move to a different state? Can You save some money to make moving possible?", "label": 0}
{"text": "I wish more places allowed people to talk about this given a trigger warning. You can talk about all kinds of heavy topics but not SI.", "label": 0}
{"text": "I’m sorry you’re going through this.", "label": 0}
{"text": "That is awful, my brother is going through sobriety issues too and feels very similar to you. Like I told him, people love you. If you ever need anyone to talk to, if you ever feel like you're going on that edge. You are loved. Im open to talking with you whenever you need it.", "label": 0}
{"text": "Bro the comments 😭", "label": 0}
{"text": "seriously somebody fucking shoot me", "label": 0}
{"text": "That’s really neat man. How long have you had Frankie? My boy is still a puppy.", "label": 0}
{"text": "I want to say I'm so sorry this has all happened to you, I honestly see a lot if people on this sub saying similar things, it makes me so upset and sad how this society treats people who are not born into the expectations of beauty that western culture has set", "label": 0}
{"text": "Same", "label": 0}
{"text": "I cant live long enough to save money to move. Im so isolated, i have no support regardless if i move. Where would i go??? Nowhere would be safe for me, the whole country wants me dead. I should just fade into oblivion, everyone would be better off with me not cocking up things.", "label": 0}
{"text": "You definitely didn’t come across as a bitch. \nChange is hard, and it’s really hard to open up and talk about these things. And learning to lean on the people around will be a weird thing to get used to. But they want to be there for you. Maybe they were oblivious to the signs you thought were obvious and now they’re over compensating out of guilt for that. \nBut you definitely make an impact on those people and they want to be there for you because they care about you", "label": 0}
{"text": "Do everything you have ever wanted to do. Travel, buy a house, cook lavish meals, literally whatever you can do to make the last piece of your life enjoyable and have fun. Suicide while it’s not a solution or answer, it’s an end. Don’t spend your last moments suffering or depressed. Spend it having the best fucking time of your life.", "label": 0}
{"text": "Dude chill go to the ER please. If your parents don't care about you, I do.", "label": 0}
{"text": "Aw, what kind of puppy? I’ve had her for a little over four years—a pandemic pup. She loves people and is so-so with dogs lol. I took her to daycare with me today, and she was a bit territorial over me 😬 but she thankfully chilled out.\n\nThank you for your company 💕", "label": 0}
{"text": "Your friends need you, I need you, your life is worth more than all of that. Killing yourself will only make the people around you sadder. Hold on for me, for your family, for your friends.", "label": 0}
{"text": "Drink some cold water, and take a shower or whatever you can do to reset your system. It might be a good idea to reach out to a support for yourself if you’re comfortable with that. Once you’re okay to, set boundaries. I know it is gonna be awful and feel disgusting to tell someone struggling that you cannot help them and they need to give you space but it is for the better of your well being. You should not sacrifice yourself for others. Please put yourself at your top priority, and help your friend only if you can beyond handle it. Take as much time as you need, and do not feel guilty about it. It’s important that you do what you need to do for your well being and mental health. Keep that in mind.", "label": 0}
{"text": "I know how it feels to feel like a burden on the people around for things you can't control. But your child needs you. Be the reason your child smiles when they come home. Be the figure in there life that they can trust, they can love, they can rely on. All of that would be lost without you. Without you your child will be in shambles. Be the amazing mother your meant to be.", "label": 0}
{"text": "I hope you’re ok", "label": 0}
{"text": "I definitely am. But some days it gets to be too much.", "label": 0}
{"text": "Please 😭", "label": 0}
{"text": "its not something you can choose. as someone whos been suffering from it i wish i could live normally", "label": 0}
{"text": "Please see a doctor about your tinnitus. It seems like that's the source of a lot of your anxiety right now. In the past, I've gotten extremely depressed over health problems, but they all eventually went away or faded into the background. Health anxiety is real though, it sucks. But the body is incredible at healing. \n\nYou'd miss out on a lot if you left. Growth, companionship, love, games and movies that get released in the future, good food, going to new places, dogs/cats/animals. Life is a mixed bag with good and bad and it's hard to see the good fun stuff when you're worked up and in a depressive spiral, but I promise you don't want to miss it.", "label": 0}
{"text": "Your life is worth more than some stupid grades. I'm failing half my classes too but I know that spanish 2 doesn't dictate whether I deserve to be alive or not.", "label": 0}
{"text": "I would if it had money, unfortunately I have no insurance & my family is poor. This is my only outlet for now. Also, tinnitus doesn’t just go away, there’s no cure for 24/7 ringing in your ears.", "label": 0}
{"text": "I’m sorry, I understand. I feel like I died a long time ago.", "label": 0}
{"text": "Same 🫂", "label": 0}
{"text": "More than anything, you sound lost and vulnerable, and I’m sorry you’re going through a stressful time without support. Not being taken seriously and still trying to meet other people’s expectations is an extremely difficult thing, and no wonder you turned on yourself. I don’t think there’s anything fundamentally wrong with you, it sounds more like you’re in a dire need of an empathetic friend.", "label": 0}
{"text": "How are you? Are you coping? Reminder that just waking up and brushing teeth is a step and and an achievement.", "label": 0}
{"text": "your feelings are absolutely valid, however I think it might be a good idea to find some support right now. Please talk to a suicide line, or if you’ve done anything please go to an ER or hospital. They can help you in a crisis, whether it be physical or mental. Just because the people around you cannot appreciate your being, doesn’t mean you aren’t worth it. Please surround yourself with people who visibly care and express your feelings about that. I’m sorry it’s gotten this bad, but right now it’s a good time to ask for help from a professional.", "label": 0}
{"text": "The redemption arc is the best part <3", "label": 0}
{"text": "Hey like you said life has ups and downs, do you want to talk about some ups.", "label": 0}
{"text": "We live for a purpose please don’t", "label": 0}
{"text": "Please don’t", "label": 0}
{"text": "I know lol", "label": 0}
{"text": "Eeeeeeeeeeeeeee", "label": 0}
{"text": "They’re fleeting", "label": 0}
{"text": "They're not gone yet so talk about them, I listen", "label": 0}
{"text": "This is not the way to go", "label": 0}
{"text": "I just wanna die man its so painful living with the things she told me. I dont know how to end it. Im to weak to kill my self otherwise do the water method for me sounded the best", "label": 0}
{"text": "Other people and I lose them all", "label": 0}
{"text": "I promise you bunny your not losing my attention.", "label": 0}
{"text": "Even if I find somebody else it wont be her. I dont want anyone else she was just perfect", "label": 0}
{"text": "Thanks, he's, alive. And right now that's as much as I get to hope for. So I'll take it. For both of you, just focus on be alive one day at a time. Then focus on living.", "label": 0}
{"text": "I have nothing bro no friends nothing they all betrayed me at my lowest I don't think I'll ever be able to trust again I can't find any homeless shelter around ", "label": 0}
{"text": "If somebody told you they didn’t love you and you were just a replacement that’s not perfect. Truthfully in life nobody is perfect. Not any man or woman can be.", "label": 0}
{"text": "I’m so sorry.  Maybe a church?", "label": 0}
{"text": "you dont want that shit. it will ruin your life. it has nothing to do with willpower.", "label": 0}
{"text": "It was colour matched", "label": 0}
{"text": "Idk how to search for any of this. If I search for “jobs with health insurance” I just get sites dedicated to health insurance", "label": 0}
{"text": "I dont deserve love", "label": 0}
{"text": "I'm going to do it tomorrow. I'm driving into the mountains. Leaving my car and ending it where no one will find me for awhile. I'll leave my sister my account numbers and the car. Text message on delayed send for 7 days.", "label": 0}
{"text": "Cuz how are we doing it bc me too", "label": 0}
{"text": "It doesn’t matter", "label": 0}
{"text": "Ur parents got a knife?", "label": 0}
{"text": "Who TF is telling all these people aspirin will kill you?", "label": 0}
{"text": "I'm not sure if your comment comes from a point of empathy due to having gone through similar experiences trying to be a good person..\n\nor if you genuinely think I'm weaker for caring about others.. (honestly if you believe this, then you do not deserve having others care about you)\n\nat first I assumed the worst..\n\n but, I can't be sure what you meant..\n\nbut, if I take your comment for face value.. no, I don't think it's funny that 'trying to be moralistic or help others is seen as weak.....\n\nif so, then you truly do not deserve any benefits it may have brought you..\n\nSo, next time something bad happens to you.. don't complain about it..\n\nIf you truly believe that having morals is weak.., then you have no right to complain..\n\nBecause, i mean.. if you got your way of 'nice guys finish last' haha so funny..\n\nthen we'd have a world where only the richest would be here.. and.. i'm just taking a wild guess.. you'd probly be gone just like me..", "label": 0}
{"text": "Have you done it?", "label": 0}
{"text": "bhai dekh tune ab apne parents ko dhang se dissapoint kardiya hai this is the rock bottom isse zyada aur kuch nai ho sakta ab tujhe pata chal gya hai failure kya hai but now look at this good thing that has happened kuch kharab nai hua aap wahi par hi ho youre still breathing youre still waking up youre still eating koi dikkat nai hui bhai the world is still the same your parents are alive youre financially secure, from here you can start preparing for yourself and not for these expectations kyuki aap jab parents ki expectations ko leke padh rhe hote ho subconciously aap parents ki daant ke baare mai soch rhe ho na ki concepts ke baare mai", "label": 0}
{"text": "What’s been making life so hard to deal with all this time?", "label": 0}
{"text": "Same here and people instantly don’t like you its rough", "label": 0}
{"text": "I’m ugly too! There are lots of us!!", "label": 0}
{"text": "It does help a lot, aye. I’ve spoken to a lot of people on here and have seen the way just letting things out and expressing how you feel can help. It’s good to share these sorts of things with the people that care about you. That’s why they’re part of your support group. To support you.", "label": 0}
{"text": "‘the law dosent like men’ is bs. as a person who goes to law school, I know what I’m talking about. men also have certain benefits in the law and can get away with crimes more easily than woman in some cases. women get HARSHER sentences for more serious crimes. For example, a man who kills his wife gets in average 3 - 6 years. A woman who kills her husband gets an average of 15 years to life.\noverall men are not punished too harshly when it comes to the big crimes. In fact, they’re not pubsihed enough for a lot. 6 years for killing your wife is nothing. A 12 month sentence which is reduced to 2 months for rape is not justice. And so on.", "label": 0}
{"text": "Well, I forgive you. That was easy. You’re not disgusting, or evil, or some abomination against God. I saw your post. You’re not a monster, you’re just a kid. You don’t need to be so cruel and hateful towards yourself. It’s okay. You’re okay.", "label": 0}
{"text": "Bad news? You wanna talk?", "label": 0}
{"text": "Why did I even say anything. No ones helping.", "label": 0}
{"text": "Why not just keep your promise? She clearly cares about you", "label": 0}
{"text": "43 minutes", "label": 0}
{"text": "being ugly robbed me of a happy life since beauty is considered the most important thing for women if you cant understand how horrible it is to be ugly then idk what to tell you", "label": 0}
{"text": "How are you feeling?", "label": 0}
{"text": "Do you care about/love her too?", "label": 0}
{"text": "I think if I clam myself down and actually process it I'll start crying which I can't do right now not when people can see me", "label": 0}
{"text": "No one is uglier than me", "label": 0}
{"text": "Im at my home, but there's no locks on my door to my room, and I'm a common person to go to. I can't go outside because I live near a main road where people will see me", "label": 0}
{"text": "That’s correct, it is harder to speak objectively about oneself. It’s much easier for us to be extreme and use coloured, emoted language. \n\nBut that’s exactly why it is important you try to do it, especially if it is breaking a lifelong pattern of extreme, negative language. Problems looked at objectively will become merely obstacles to be solved rather than punishments.  \n\nTry to learn the skill. Put the work in for your pets because no one is going to love them or take care of them properly without you there.\n\nStart slow and take small steps. You will be a beginner at thinking about your life in a new way so take your time.", "label": 0}
{"text": "I really do", "label": 0}
{"text": "If you can’t cry in your own room, there’s not a lot of places you can. Just close your door and try to tell people not to come in. Even sit in your closet if you’ve got one. You’ll be okay.", "label": 0}
{"text": "I don't doubt your life is horrible. I have no reason to not believe you so I don't want to take that away from you. What I am giving you is a small challenge to your belief.", "label": 0}
{"text": "If you hurt yourself think about what that does to her future", "label": 0}
{"text": "It makes sense to feel that way, especially with what’s going on. But what I want you to try and do right now is calm down. Slow your breathing. Keep messaging your friends periodically. If you have or can get access to Tetris, I recommend playing some. You’re okay.", "label": 0}
{"text": "So distract myself? I can try and do that but also if they do die how do i tell their friends, my friends. They're also suicidal what if I make it worse. I think I was the last person they talked to. Earlier today I chose not to hang out with them because I wasn't feeling mentally okay myself. And now I'm worried I made it worse and was a factor that caused this", "label": 0}
{"text": "If I’m not here she won’t have me to have to constantly be worried about or concerned for.", "label": 0}
{"text": "Looking for a job is always disheartening. Especially when those around you are finding success.\nCould you maybe ask your friends for help with how to interview? A lot of the time it's about practice and confidence which isn't easy when you've lost that confidence after failed interviews. With some practice though you can change that! And sometimes there are key words you need to hit etc depending on the company so worth looking into that.\n\n\nPlease don't give up 💕 You will find your path, osometimes it just takes a little longer", "label": 0}
{"text": "What other people do is not your fault. You are not in the wrong for wanting to care for yourself, you deserve to do that. You didn’t and couldn’t know if anything would happen. For your other friends, they don’t matter right now. You can deal with them later. As for Tetris, it’s a good distraction, yes, but a number of studies have shown that playing it closely after a traumatic event can help lessen the effects of PTSD and such things, so I suggest you play.", "label": 0}
{"text": "You're not a bad person, you are imperfect,  we all are. I'm sorry if you had to find it out through some hard choices, or making mistakes. Self disappointment sucks and always hits hard. But I think that the fact that you are self aware enough to recognize it makes you a far better person than most. While this trauma feels awful, you need to give yourself some time to heal. Forgive yourself, and allow it in the future", "label": 0}
{"text": "Okay I'll do that. Uhm, thanks. I'll probably give actual thanks and all that once I'm calmed down and know how to actually feel. But thank you.", "label": 0}
{"text": "I’d much rather make sure you’re okay than have your thanks. Just remember that whatever happens, this isn’t your fault. You are their friend and it’s clear that you care very deeply for them. I’ll always be and if you want to talk more.", "label": 0}
{"text": "rn is the worst time to find a job tbh", "label": 0}
{"text": "While you may be right, the law definitely does not favor men in rape cases. Especially in this guy’s situation, and the girl is likely to go off scott free even if he does win the case. I think it is fucking ridiculous that a woman can get away with ruining a man’s life like that.", "label": 0}
{"text": "Do you mind me what it was today that made you decide that was it? \n\nI'm so sorry you lost your mum, an absolute hideous thing to have to go through and not something there are any words to help you. What kind of support are you getting?", "label": 0}
{"text": "Thank you for sharing your personal story. What are some of the mistakes that you have made and what makes life unbearable because of it? I am asking out of curiosity.", "label": 0}
{"text": "I don’t want to hurt her. But I can’t stand to sit through this fucking cycle I’m in. I don’t know what to do", "label": 0}
{"text": "Talk to her about it", "label": 0}
{"text": "I felt alone, I’m sorry to hear that, I can relate, people also judge me everywhere I go. Universe is unfair and people are horrible.", "label": 0}
{"text": "She’s at work. I can’t lay this on her while she’s working", "label": 0}
{"text": "Calm down, you will get better", "label": 0}
{"text": "I'm so sorry about that, I wish you get well", "label": 0}
{"text": "As someone who has been struggling with an eating disorder for almost a decade, trust me, you don't want to have this. Please speak to someone ❤️", "label": 0}
{"text": "She saved you. <3", "label": 0}
{"text": "Do not do this to yourself. \n\nI’m suicidal too and I’ve had the same feelings as you. I had an eating disorder and I starved myself of food and now I constantly hate seeing myself as big or eating more than one meal a day because of what I made myself develop.\n\nWhen I thought I was overweight and big I was extremely underweight. Even after I’ve gained weight I’m still underweight.\n\nDo not try to give yourself anorexia, it’s extreme and not worth it.", "label": 0}
{"text": "Ozempic is the new wonder drug.. Give it a try", "label": 0}
{"text": "Try to slow down and take some deep breaths. It is hard. There is a lot going on and you can’t solve it all today. Breathe and look around you. What do you see? \n\nWhat do you hear? \n\nWhat smells are there? \n\nIs it cold, warm? \n\nWhat are you touching right now? \n\nHow does it feel? \n\nWhen your mind starts to wander back to those thoughts and feelings, that’s okay. Bring your focus back to your breath and observe the things around you. \n\nWhen you feel up to it, check out Dr. Scott Eilers on YouTube. You may find his words helpful.", "label": 0}
{"text": "I think you can't change your relationship with food", "label": 0}
{"text": "can't my sister's wont let me", "label": 0}
{"text": "All understood but why the virgin part?", "label": 0}
{"text": "Stay strong hun 🫶🏼. I know that’s such a cliché thing to tell you, if only it were that easy. But there’s so much to live for, you just gotta find it. It’s not easy, but I think you should do what ever it is that makes you happy. But you also gotta put in the work to earn that happiness ya feel me? and to continue rolling with that vibe and then spread the love and them good positive energies with others 🤗", "label": 0}
{"text": "But what's the difference between your first two points. Wouldn't someone with ?ahor depression end up in a place where they have no one because they've pushed everyone away?", "label": 0}
{"text": "What country? Do you live in to where being gay is bad in 2024 or am I missing something knowledge is power?", "label": 0}
{"text": "What about just speaking to the doctor or a quick trip to Mexico for some Ozempic jabs, you might feel better about things generally if you lose a lot of weight?  I think there are also some thyroid meds that can cause dramatic weight loss, but that can be dangerous and leave you with thyroid issues for life if you aren't careful...", "label": 0}
{"text": "Unhinged is the right word. What on earth?!", "label": 0}
{"text": "my attempt failed multiple times miserably it wasn’t supposed to fail", "label": 0}
{"text": "It’s unhinged because you can’t get random search warrants for women’s bodies or force them to get a rape kit, which is only possible *immediately* following an assault. Even taking a shower is likely to cause any evidence to be lost. No, there are not always scars or tearing. Where did you get these ideas? \n\nWe don’t know anything about the circumstances, so it’s impossible to say whether OP has any legal recourse. There are countless possible scenarios and it’s highly dependent on the very specific circumstances. It’s one thing to suggest that OP talk to an attorney about their options, but what you suggested is so far outside the realm of reality that I do think unhinged is an appropriate response.", "label": 0}
{"text": "\"Bro\" can be a figure of speech.", "label": 0}
{"text": "Ya know what. I'm just gonna step away at this point.\nI've had enough of reddit today. \n\nYou've made your point, and I don't feel like debating. Nighty night.", "label": 0}
{"text": "Alright. Get some help, best of luck to you.", "label": 0}
{"text": "sounds like passively suicidal", "label": 0}
{"text": "Haha", "label": 0}
{"text": "Don't need help.", "label": 0}
{"text": "atleast I'm trying to keep bro alive", "label": 0}
{"text": "i felt this a lot when i was 18, and hadn’t really planned beyond that. it sucks, it’s so difficult when you’ve felt that way for so long that you can’t think about a future.\n\nyou have things you enjoy - the gym and talking to your best friend. throw yourself into those! you’re 18, and that’s so young in the grand scheme of things. you’re only a baby adult! it’s so okay not to have it all figured out just yet. i’m 22 now and i feel so different now to how i did at 18", "label": 0}
{"text": "There is no reason why see should be stigmatized, we all have sex.", "label": 0}
{"text": "i’m also physically disabled and have experienced similar. it sucks that where you are requires a doctor to be able to get benefits. have you looked into local charities for support? food banks? there are options, there’s so many people in similar positions", "label": 0}
{"text": "Lmao not me. But I get your point. On a much more serious note, have you talked to anyone about what you’re feeling in real life?", "label": 0}
{"text": "I have tried and \"failed\" several times from the age of 14-30. I can lose weight, but I'm never actually too thin, I just feel like absolute dog shit to the point I can't even take a shower. But being healthy looking and not skinny, no one would ever know. \n\nIt's not worth it. While I totally understand the desire (and can't even begin to phrase why...I just get it)...it's a slow and tiring process and is not likely going to work the way you want it to. \n\n\"I am very suicidal but I do not want to die now.\"...hold on to whatever is providing the \"do not want to die now\" part of that. It's gotten me through the last 17 years, as much as I fucking hate it sometimes, there's a lot I've enjoyed experiencing in that 17 years.", "label": 0}
{"text": "Sounds like fun. I love animals, I know we are animals too technically, but boy do we suck at it.", "label": 0}
{"text": "thank you, i will :)\n\n<3 for you too", "label": 0}
{"text": "People disgust me\nWe are all made in Gods image we are all beautiful", "label": 0}
{"text": "Anyway please don’t \nI love how you keep it so real\nThat’s what’s nice about you", "label": 0}
{"text": "Hey I hope you’re doing better I feel the same way", "label": 0}
{"text": "It will stop when we surrender our wills to god", "label": 0}
{"text": "Seeing the truth", "label": 0}
{"text": "I love how we all come on here to discuss real shit\nFor real", "label": 0}
{"text": "That’s a bad idea !", "label": 0}
{"text": "I don’t know what there is to reflect on. I’m trans and others aren’t and I wish I wasn’t because it’s factually a fuckton more work to pass as the gender I want. What is there to reflect on?", "label": 0}
{"text": "Sad this entire thread is making me cry", "label": 0}
{"text": "When god wants to", "label": 0}
{"text": "How old? I’m 36\nPlease don’t die\nYou will break my heart and gods heart", "label": 0}
{"text": "What? It bad ?", "label": 0}
{"text": "The suffering out here is insane\nI hate seeing people in distress it hurts me\nI love everyone", "label": 0}
{"text": "Doesn’t help but thanks I think?", "label": 0}
{"text": "Hey, friend I’ve lived for 25 years now and I have hated my face and body my whole life. I can’t even look at mirrors or if I see someone take a picture I try to stand wayyy out of it. I’m a person I shouldn’t feel like I’ll never like how I look but I just push through. I have maybe 10 pics of myself on my phone along with 18,445 pictures and videos. You shouldn’t have to care so much about how you look and getting around that is impossible. Just find someone who likes you for you. People can be shit and bad for your mental health especially family. You are more than a face, more than a body. You have a beautiful brain in there. We all do. I know it can be hard but find a hobby, something that is distracting and takes a long time to perfect. People on this sub are on here because either they care about others or they want someone to show them they matter. Well you do matter, and you are more than just a face or body.", "label": 0}
{"text": "me too:\") wannna b friends?", "label": 0}
{"text": "i promise im uglier", "label": 0}
{"text": "Do you believe you could do anything while you're alive to improve those circumstances?", "label": 0}
{"text": "same:( im hideous", "label": 0}
{"text": "im also a monster", "label": 0}
{"text": "thats so true..idk what to do", "label": 0}
{"text": "bless ur soul u are amazing<3", "label": 0}
{"text": "thats so true:((", "label": 0}
{"text": "I pretty much starved myself to the point of totally losing my appetite last year. Lost around 60 pounds. It was so easy I was actually thinking/hoping I might have cancer or some shit. But it sucks, you get cold all the time and you're extremely moody. So I forced myself to overeat and got way back into alcoholism. Even typing this out I feel insane LOL but yeah, don't do it.", "label": 0}
{"text": "do you wanna talk to me? i feel the same way im hideously ugly and i want it to end idk what to do", "label": 0}
{"text": "Your suicide is going to affect her for the rest of her life *even if* you are as flawed as you claim in your comments.", "label": 0}
{"text": "Im so sorry that happened to you, this stuff has happened to me too im hideously monstrously ugly:( do you wanna talk? im here for u", "label": 0}
{"text": "Hey, it’s ok. You just need to distance yourself from people who are negatively impacting your life. The truth will come out sooner or later. Just keep your head down and work on yourself. Whether than means working on your body or mind. Don’t give people the satisfaction of saying you did something wrong. I can’t tell if this happened in high school or college (reading comprehension is definitely not my strong suit) but if it is in high school you only will deal with it for school four years. Then never hear about it again. In high school the whole time I was called Jeff (that’s not my name or even remotely close) and a Jew (which started in middle school). People who I’ve never met or talked to would think my name was either Jeff or I was Jewish. This was in Hawaii too so the whole island thought I was Jewish or my name is Jeff. As soon as I turned 18 I left home. And yes I miss home but I couldn’t be around that. I doubt anyone even remembers me but if anyone from Kauai High school reads this you made me move from family but thank you. You made my life so bad that I understood why people might end their life. You gave me a reason to work on trying to help people. Anyway people care and schooling is always temporary, you never have to be around the people that make you feel\nLike shit forever. Make the move, make the change, and remember if you’re innocent then talking to people who don’t know that, won’t help you or make you feel like you should push on, but you have too. You got this. I believe you (And sorry I talked about myself so much I just wanted to show you people saying things should just roll off your back.)", "label": 0}
{"text": "You seem like such a caring friend and I know this is really scary especially when you feel powerless to help. Have you gotten ahold of them yet?", "label": 0}
{"text": "I agree having something to look forward to really helps. You have some good coping strategies.", "label": 0}
{"text": "Still no answer. I'm heading to bed soon so all I can hope is that when I wake up they'll be okay. I'm at the point of losing hope, and feeling pretty numb right now. I know I'll probably break down once I try going to asleep, but not yet.", "label": 0}
{"text": "How did you deal with the urge to commit suicide.", "label": 0}
{"text": "Trans women aren't robots, we are also biological women.", "label": 0}
{"text": "Well, one step at a time. You did what you could and now you deserve rest. I hope you are able to get some and wake up feeling better.", "label": 0}
{"text": "Why you Dont do it on monday instead?", "label": 0}
{"text": "I probably won't wake up feeling better since it probably will actually sink in, but I'll figure that out when I get there. But thank you.", "label": 0}
{"text": "why monday? im getting drunk tonight and want to do it then", "label": 0}
{"text": "Get that bitch thrown in jail man call the cops. She doesn’t deserve to walk the streets making accusations like that.", "label": 0}
{"text": "Just to think a little more you situation. You will not lose anything if you try. I was about to do it today too but I postponed it to monday.", "label": 0}
{"text": "ive been postponing for years now. i just want the pain to end.", "label": 0}
{"text": "It would be a slow painfull death my friend, it's very hard.", "label": 0}
{"text": "Dont give up, ok ?", "label": 0}
{"text": "No I meant stabbing in heart", "label": 0}
{"text": "The thing is that people left behind will still have questions/guilt no matter what you say. Words will never be enough.", "label": 0}
{"text": "ok nothing against butlers, but wouldnt that also be for upper class people someone below ? ans actually also is, because you are serving them?\n\nAnd where to learn upper class manners?\n\nI speak a bit french and had latin, so maybe you are suggesting me a way how to thrive than survivw in Germany 😥", "label": 0}
{"text": "It doesn't matter, it would still be a horrible time.", "label": 0}
{"text": "3 seconds is not bad", "label": 0}
{"text": "Do you want to talk about it?", "label": 0}
{"text": "Unfortunately most of us on this subreddit live in Western ‘democracies’. In our societies it’s all too easy to be reminded of our physical inadequacies as defined by a society that prioritises consumption over humanity. \n\nA society that likes to remind us of what we don’t have as opposed to appreciate what we already have. A society that creates unrealistic ‘beauty’ standards. A society that has us all believing that beauty only happens when we add a filter to our pictures or if we get surgery so we look like we have a filter on us 24/7. \n\nIf beauty is in the eye of the beholder then we all need to go to an optometrist and get our eyes checked because society has ruined our standards of beauty in all humanity. \n\nI’m sorry this world has shaped your experience in such a way that has led you to this subreddit. At least in here we just value you as the perfectly imperfect human being you are, the perfectly imperfect human we all are.", "label": 0}
{"text": "Hey, I understand. I always think of negative things and I’ve just grown up like that. Every time I get upset it’s not that I’m getting upset with a person or thing, sometimes it’s with myself but I reflect it on the closest person. Growing up in a divorced family, it was hard. My dad left my mom after having me and my brother and moved away and never talked to us. Your little one would not be better off without you. You aren’t alone, self harm feels like something that spreads. You shouldn’t hurt yourself or do anything to hurt anyone else, you deserve happiness. I mean you have a child, that’s a dream for a lot of people, they care for you, they can’t imagine their life without you.", "label": 0}
{"text": "I think you’re right. But I aim to mitigate all “damage” done to those who stay. Something is probably better than nothing I reckon", "label": 0}
{"text": "What are you dealing  that makes you feel like ending things? I know you don't want to tell your friends that your suicidal but if you feel on the verge of ending things you should talk to them about at least some of what you're going through or struggling with maybe ask for their help with some of it", "label": 0}
{"text": "I understand not being happy after everything seems like it went right when it should’ve gone wrong. I told myself I didn’t want to live past 18 and look at me I’m 25. Of course I have regrets (who doesn’t) but like you I’m here because of the choices that were either made for\nme or I made. I complain a lot because I feel like my life isn’t how I imagined it would be (even though it’s better than I thought.) honestly besides the kid and great job I feel like I’m talking to myself. Sometimes we have to make changes either mentally or physically. Have you tried learning a new hobby or exercising? Something that would take time to learn and master. Or something that will make you feel positive about the outcome. Life is very weird, it’s not like I’m not grateful for what i\nhave. It’s like I didn’t have plans for life after 18 and I’m upset about it. It’s crazy but people on Reddit come from all ways of life but there are some really interesting coincidences.", "label": 0}
{"text": "Everyone I personally know accepts me and I’m on hormones. I know I’m a woman, and yet it all remains the same.\n\nUnfortunately, money.", "label": 0}
{"text": "It doesnt come as tone deaf bro 😊. I understand what your saying and ive been thinking about the future alot. My large issue is that I dont know what I can do to separate completely from my parents. When I turned 18 I will not have enough money to not be homeless", "label": 0}
{"text": "😂 thanks man. it feels good to know that im not alone on thinking that", "label": 0}
{"text": "Never give up.", "label": 0}
{"text": "Ypu are so lucky brother, i wish i had someone like her.", "label": 0}
{"text": "Thing is I don't have her. She isn't with me anymore.", "label": 0}
{"text": "In 2 months I turn 19. Life gets better", "label": 0}
{"text": "They found out on the weekend (it's Saturday), a few friends who knows are scared of me now", "label": 0}
{"text": "Are you in middle school or high school?", "label": 0}
{"text": "Grade 9 high school", "label": 0}
{"text": "Have you tried accepting that things will be bad again \nIdk sometimes it helps changes things", "label": 0}
{"text": "What happened? \n\nI can relate to hurting someone dear to me and still being haunted by it. I don't know if you can make things right with them, but focus on treating others better, learn what you can from this. You can grow from this. And if people still keep you around even if they get frustrated with you  they dont view you as a burden", "label": 0}
{"text": "I'll try and live for a week at least and see how they treat me when the shock wears off", "label": 0}
{"text": "?", "label": 0}
{"text": "How high is the fall? Are you ansoloutely sure you will not survive?", "label": 0}
{"text": "Exactly what I thought - you just straight aren’t happy.  You need evaluated asap.  Get off Reddit and go immediately get professional help.", "label": 0}
{"text": "Put your phone away if you are serious. The urge will come naturally.", "label": 0}
{"text": "oh, that sounds like you need a lot of vitamin b ..", "label": 0}
{"text": "Beauty truly is in the eye of the beholder. I'm not disputing your lived experience at all, just to be clear. There are however other ways to express yourself regardless of your natural features if you're not happy with them. Wear bold clothes, have your own style, let your personality shine through!", "label": 0}
{"text": "yep!\nam in the uk", "label": 0}
{"text": "I drank water like an hour ago right after doing this post. Im to weak sadly", "label": 0}
{"text": "thank for the nice words. but i cant anymore, i cant.", "label": 0}
{"text": "my life is over. I cant tolerate abuse again and again. no one gives a fuck about me. there's no escape. thank for everyone who reached out. goodbye.", "label": 0}
{"text": "I have been in therapy since April 2017 but recently moved and have been having trouble getting my authorization renewed to see my therapist. So I’ve only been able to see her three times in three months when before I was going weekly. I was in intensive outpatient twice in 2019 and was inpatient for a month in 2019 as well. I have been diagnosed with MDD, PTSD, anxiety with panic attacks, and adhd. I had an attempt in April 2017 but that’s what drove me to seek help. I was actually doing really well up until everything that happened this year. It’s one thing after another this year like right when it seems like I’m catching a break or things are looking up I get hit with another big thing to deal with. It’s just exhausting.", "label": 0}
{"text": "Please don't do this", "label": 0}
{"text": "I have to. it's too late.", "label": 0}
{"text": "Edit just like me fr\n\n(In all seriousness, I do hope you’re alright…)", "label": 0}
{"text": "Sorry, but no, there's no escape. I should havs done It before.", "label": 0}
{"text": "Give your brother a hug. When I am at my lowest I always give my sister a hug and rest in her knees while she is playing with my hair(she loves my long hair and piercings lol). Love is cure to everything. Love yourself, love others, learn to love, love the life, love everything.", "label": 0}
{"text": "Not bragging, but being pretty is not always a great thing too.\nI was targeted by perverts and abusers since I was a child. It forced me to hide, to cave in, to stop making myself stand out. So no, physical appearance doesn't matter. Life is unfair to everyone, which makes it fairly shitty. Life is just not a good place to live.", "label": 0}
{"text": "I was called bulldog and monkey in middle and high school. I believed them when they said those things and could see what they saw when I looked in the mirror. It was a devastating and helpless feeling because there was nothing I could do about it. I felt trapped in an ugly suit that I couldn’t take off. But then in my mid-late 20s, my bone structure settled and I started suddenly getting compliments on my appearance. Our musculoskeletal system continues to change over our lives, which I didn’t know before. It was very strange to me to get compliments. I rejected many of them in my mind or just thought they pitied me and were being nice. Also, beauty standards seem to change like the wind. When I was a kid, being rail thin was considered ideal, but overtime that has changed and now my figure, which is thicker, is like what people are literally paying thousands of dollars for. I hope you will give yourself time to see that your appearance will go through many changes in your life. There are many versions of you that have yet to emerge, but they are in there.", "label": 0}
{"text": "We’re all fucking exhausted with trauma. If I can make it through this shithole fuckednup bullshit u can too I guarantee it. People survived the holocaust. Move to a Foreign country , tattoo your face , be selfless in a way most people wouldn’t because it puts their lives at risk and they don’t wanna compromise themselves.. maybe like some kind of animal rescue or something. Please", "label": 0}
{"text": "Please I request you... I will pray for you wait for a week? Please", "label": 0}
{"text": "I don’t matter shit but you do!", "label": 0}
{"text": "I cant anymore i cant i cant i cant sorry but i cant", "label": 0}
{"text": "I tried everything i cant anymore the world is a better place without me in it", "label": 0}
{"text": "I’d advise you not to do it. there’s no perfect suicide note. \nBut if ur asking about if you missed anything, maybe clarify how your belongings n stuff should be handled, or plans for your funeral n stuff. Stuff old people have to think about.", "label": 0}
{"text": "Inspirational bullshit 101", "label": 0}
{"text": "I see a lot of good things in that post above. Try living your life by this one creed. FORGET ABOUT WHAT PEOPLE THINK!", "label": 0}
{"text": "Thank you. I already have 95% of my funeral wishes taken care of, but I guess I should make sure I have thought of everything. Much appreciated 🙏", "label": 0}
{"text": "22M, I have shit teeth as well. Been insecure about them since I was in elementary school so I just stopped smiling. I cover my mouth when I laugh. Tried to do some work but only had so much money and they just fucked my mouth up a bit more. I am extremely resentful of normal, healthy people.", "label": 0}
{"text": "paracetamol can actually kill you tho lol\nI mean an overdose\n(Srry if I’m understanding this wrong)", "label": 0}
{"text": "It's ok don't lose hope you still have time...u can change paths as long as you are alive... please don't think about hurting yourself 💚", "label": 0}
{"text": "yo bro what river", "label": 0}
{"text": "cause your the lone wolf", "label": 0}
{"text": "plastic surgery chat?", "label": 0}
{"text": "What?", "label": 0}
{"text": "Thanks. Thanks for commenting and, once again, sorry for misunderstanding and taking the worst possible meaning.", "label": 0}
{"text": "it might make you look better, idk", "label": 0}
{"text": "I have depression and sometimes think the same. But talking to people that understand help so if you want to... I'm here \nI'm aware that theese days most people are shitty and have no empathy. It truly scares me. Sorry that your close ones are not able to understand and help you", "label": 0}
{"text": "idk then", "label": 0}
{"text": "Aww, it does get better x", "label": 0}
{"text": "You’re totally right, it is the absolute worst. It shows us how easily we fall victim to biology, but also how much we are able to stand to still be able to function, notwithstanding the very broad definition of “function”. I think that it is always a day-to-day bargain, and that we have to constantly renegotiate the meaning we want to cling on to.", "label": 0}
{"text": "Jumping in front of a car will destroy the driver's life. If you're gonna destroy yourself don't take anyone else with you.", "label": 0}
{"text": "If it’s something so bad, perhaps it’s morally wrong to take it to your grave. \n\nPerhaps it is something which when you tell someone - if not here then a counsellor or therapist - it will be like a weight lifted off your shoulders. Or maybe not. \n\nMaybe by actually putting it out there, you will see\nThat there is actually a way to make amends for it in some small way. Perhaps not all in one go but as a journey in your life.", "label": 0}
{"text": "I don't have much i care to hang on to anymore that I dint feel I'm doing more harm than good being around", "label": 0}
{"text": "I fell victim to one off side effects of meds that have just spiraled to an issue with almost every organ in my body and there is no resolution really for any of it", "label": 0}
{"text": "Are you ok? We're here if you need to talk.", "label": 0}
{"text": "How are you doing harm?", "label": 0}
{"text": "In my experience it's pretty useless. The best they can do is refer you to therapy or admit you to a psych ward. If you get lucky, they may give you some sedatives", "label": 0}
{"text": "I understand this, BPD is hell on earth. I’m just chasing that hope shit will change. There are some things I like doing like petting cats and i don’t want to ruin my roommates lives or partners lives by offing myself and giving them that guilt. ", "label": 0}
{"text": "Hopefully you can find a few other things too!\nI’ve already slipped up, I’m a jinx. Upset over my family again. But I feel like one good rant will really help. Ha. It’s all progress. One step backwards, two steps forward. Hope I’m not doing exactly what OP hates but I try to be very ying/yang. Things still suck but not everything. xD", "label": 0}
{"text": "I don’t ever tell anyone about the stuff I’m dealing with, and if it’s one of the rare occasions where I do - it’s very subtle, out of place and barely noticeable. It’s my own fault I guess.\n\nI’m just too embarrassed to tell anyone anything and I’m just anxious about the results it might bring jf I did. I have to maintain this image also. I just don’t know.", "label": 0}
{"text": "Pero parte por ir a un gym bro.... erih de la rm?", "label": 0}
{"text": "you're probably right. I guess well a small example of something horrible I did, I think around 10-12 years old, was that while my parents were fighting or when my mom would have her freak outs I'd flood the ant hills outside my house. crush pill bugs. think about offing my own mother, watch and read horrible things. I just had so much anger but its no excuse. i stopped going to school, I pushed all my friends away. \n\nturning from 15-to now 20 years old, it clicked how absolutely horrid I was, still think I am even when I avoid hurting anyone, anything at all costs. I push people away now because I'm terrified of saying something mean by accident. I just want to be reborn as someone naturally kind and innocent.", "label": 0}
{"text": "Lowkey start doing drgs, they make ur metabolism faster and youre never hungry, simple pills work", "label": 0}
{"text": "These assholes don't know beauty lives on the inside!\n\nAnyone who feels the need to put down a woman for the way she looks is the ugly mf!\n\nImagine being the type of person who harasses women from the safety of their car. THATS UGLY\n\nIf I were ever with you in one of these circumstances Id be throwing hands.cops would be involved.\n\nI'm really sorry how horrible people can be and that you've suffered from this. \n\nI think it's beautiful you reached out to us here, people who appreciate your story and experiences. Thank you for sharing. You are beautiful, people are just blind. Please continue to reach out when you need it. We'll show you the love and respect you deserve. ❤️‍🩹❤️‍🩹❤️‍🩹", "label": 0}
{"text": "No thank you - I’d rather be dead", "label": 0}
{"text": "Same to you", "label": 0}
{"text": "Please reconsider, im here if you'd like to talk :(", "label": 0}
{"text": "Truly evil people don’t think of themselves as horrid or evil. That’s what makes them evil. No moral compass. \n\nThese are no great crimes but you feel them like a crime - against your own moral standards if nothing else. \n\nWhat was it like when your parents fought or you mother freaked out? It sounds like you had to live through a difficult home life beyond your control", "label": 0}
{"text": "No, its okay, if you are suffering from such an addiction; try to break the cycle, i know its hard but you'll feel happier once you break out of it, maybe download some apps, or add a screentime limit blocking such content?", "label": 0}
{"text": "I talked To my parents about it they said they will do something but until then I’ll try to find an app", "label": 0}
{"text": "thanks didn’t think of that", "label": 0}
{"text": "Is your sister someone you feel like you can still rely on or talk to?", "label": 0}
{"text": "Don't blame your family. It looks like you do want to take away this responsibility by suggesting that you didn't want to go. No, this doesn't work like that. You did something, not your family.\n\nSo now you have to be considerate. If you tell your girlfriend, you might think that it will be helpful to be honest, and many people tell you this, but in reality, you will make your girlfriend suffer with you. It may hit her harder than you think. \n\nMy friend felt into depression after her guy cheated on her. He was honest, so he told her, but he was also an asshole who didn't want to keep the weight of the situation for himself. She suffered much harder and longer than him.\n\nThis really depends on who you both are if you should tell her or not. Good luck.", "label": 0}
{"text": "Honestly I feel relieved. I'm glad shits ending soon yk...", "label": 0}
{"text": "Do you have access to psychiatrists in your country?", "label": 0}
{"text": "In my case is probably genetics. my dad offed hims", "label": 0}
{"text": "It might help to talk to them about some of it, it can be hard for people to understand otherwise", "label": 0}
{"text": "I’d say it’s pretty horrific living with things that cause/lead to suicidal ideation. I mean I don’t condone suicide, I’m not “pro suicide” but I am “pro-stop guilt tripping people”. Maybe if these parents and family considered what the person was going through to lead them to suicide in the first place, maybe if they cared enough to ask them how they were doing, maybe if they got them some help.. because a lot of times there are many signs and lots of cries for help, especially with younger people. I just read a post on here about a younger kid who wants therapy but his parents won’t let him.", "label": 0}
{"text": "“This won’t comfort him LMAO.” Was what was replied with and imlostinmusic didn’t understand the rudeness there. Neither did I, which is why I downvoted that person. It made no sense to be rude and yes, that was rude. Someone else also mentioned that it was a weird start of a reply and that imlostinmusic didn’t do anything wrong either and then they explained why it may have been “lacking in comfort” because of their disorder. The second part of your comment is great, but again the first part of “you don’t need to do this,” is dismissive of them in general, especially after they already explained why they said it.", "label": 0}
{"text": "I love your username btw. 💕", "label": 0}
{"text": "Ik something about it", "label": 0}
{"text": "Ngl same. Committing is too hard I need someone else to do the job for me", "label": 0}
{"text": "Your kids need you. Imagine a life where your mother killed herself. Be the positivity in their life. Be the reason they come home smiling.\n\nBest wishes", "label": 0}
{"text": "You are worth more than that. Doesn't matter what you did in the past no one deserves what youre going through. Try finding interests or hobbies. Give yourself a reason to live.", "label": 0}
{"text": "What?", "label": 0}
{"text": "About having crash taken", "label": 0}
{"text": "Did you go to a psychotherapist?", "label": 0}
{"text": "Oh okay", "label": 0}
{"text": "Me too I feel depressed more on my birthday it feels like a year wasted. I don't how to proceed ahead in life", "label": 0}
{"text": "How much alcohol, and how many benzos, paracetamol and ibuprofen did you take ?", "label": 0}
{"text": "I know what happened at that community, it’s all drama and im leaving there because of that whole ordeal with nazis, if your mental health is affected by that community then I would explore you to lève it too.", "label": 0}
{"text": "Millions of people have HIV, it isn’t over but it’s a life lesson. Be safe and maybe stay away from it! Especially now, because you could also be harming other sex workers if you have it and continue to use them. So stay far away and inform every future partner\n\nGet tested and find out properly rather than overthinking\n\nLife isn’t over, you can live a fruitful life regardless\n\nBest of luck", "label": 0}
{"text": "I’m not sad at all", "label": 0}
{"text": "Alright thanks", "label": 0}
{"text": "I'm in the same boat as you, no real friends, parents don't really care, no one to go to. But my saving grace is going on here and helping others through their tough times. I 100% recommend.", "label": 0}
{"text": "you are forgiven", "label": 0}
{"text": "don't leave them", "label": 0}
{"text": "No matter what you did whatever your sorry for. Everyone deserves forgiveness.", "label": 0}
{"text": "Like 30g paracetamol, 6g ibuprofen, like a bottle of liquor and a fuckton of xanax and valium, like 1.8 grams of diazepam and about 500mg of alprazolam. Took about 500 pills in total, all I had left\nI was collecting them before, I took them very rarely so no tolerance or addiction", "label": 0}
{"text": "The doctor in the psych ward checks me somewhat regularly and he said my liver is almost recovered. But I think you're right, I should tell him about these symptoms Im still experiencing", "label": 0}
{"text": "I'm not able to forgive myself. I Don't know what am I doing.😭\nI'm just really sorry", "label": 0}
{"text": "Oh gosh yes I feel this too. I’d say for me it’s more a weekly basis tho. I’ll have a week or two where I don’t feel like ending it and then there a week of just wanting it to be over and those weeks get worse and worse each time. \nSorry you feel similar ): Best wishes to you and your son", "label": 0}
{"text": "Ill gladly talk to you🙏🏻 your not alone 🙏🏻", "label": 0}
{"text": "Try to find a interest and people who share that interest. Try going on this subreddit talking to other people it's what I do.", "label": 0}
{"text": "Stay for yourself. Believe in yourself that life will get better. Trust me it will get better. It may get worse first and its never so simple. My advice to speed up that process of making life more enjoyable and less miserable-\n\n-cut out whats making you feel negative\n-treat yourself. you really deserve it man.\n-hang out with the friends that are always supportive. if there are none, then focus on yourself first but when you feel like it, go out and explore the city, join a club or group and meet some new people", "label": 0}
{"text": "Safest way to figure out if you have HIV is to get checked, I think HIV doesn't show up on a test until 6 months after contact with your partner, but don't quote me on that.  Your best bet is to go see a doctor & get tested.  They don't even do the swabs for tests for males anymore, which is a Godsend.\n\nIf you are tested positive with HIV, the medical industry has developed many resources to live a long, full, healthy life with HIV.  As far as sex & dating goes, I've known people who have joined dating sites with HIV positive people, and a couple of people I know even got married and are still happily.\n\nAs far as Chlamydia is concerned, I've had that in the past myself and you have nothing to worry about, especially having it discovered early.  The doctors just give you a pill, and it gets flushed out of your system.\n\nHope this helps, I've been in your position where I've had panic attacks when I was younger because I was afraid of contracting diseases.  Your best bet is to go talk to a doctor, get tested, and treated if necessary for peace of mind.", "label": 0}
{"text": "yes absolutely it does like I'm kinda speechless. I didn't know the right words for it, but my parents definitely have to be emotionally abusive codependent. my dad always talked about divorcing her but he never did, never does. and she completely and utterly goes insane at the mere thought of him doing that, of us leaving. definitely because of the even worse abuse she faced from her own mother, and her childhood being actually a nightmare from what I've heard. \n\nI feel like in her attempts to keep me close, a codependent, she did the opposite. I dont hug her, I dont like hugs at all actually. though I want one all the time. but I guess she did make me afraid of everything enough to where I cant leave this freaking house. setting the narrative that this is normal, she most definitely did because after everything, every single conflict the next day, or even an hour later, she acts like nothing, NOTHING happened, even asking me if I want to watch TV or eat dinner with her. I hate that. I hate she still pretends.\n\nbut yes everything you've said sounds right, and thank you, because I feel like I have a better understanding now.", "label": 0}
{"text": "I hear you", "label": 0}
{"text": "I completely understand that feeling that its the end now. I know swallowing sounds very painful right now, but see if you could try to take a small melatonin pill if you have any. If you are in so much pain please please call 911 and get the care you need and deserve. Hang in there buddy 🤗\n\nAbout the affection thing I also get that. When I am breaking down, all i want is this kind of image of a perfect mother to hold me. My mom is still alive but very toxic and is the reason for my fucked life. Your 18, maybe once you get better see if you can sign up to Tinder or something like that. I actually really think you should go to the hospital. They can put you to sleep and make the pain more mild and shorter.", "label": 0}
{"text": "Not the time or place dude.", "label": 0}
{"text": "That really makes me sad. Your so young and no one your age should EVER feel like that. You are not unlovable. I really wish i could give you a hug 🤗🫂\n\nPlease hang in there. 18 may feel like a long way away and it is. 5 years is a lot of time. That can be a good thing or a bad thing. Please please just try to love yourself and STOP being so hard on yourself. When you accept yourself and surround yourself with real genuine people then those 5 years will be a joy and not such a pain", "label": 0}
{"text": "Being in pain doesn’t make you weak or stupid.", "label": 0}
{"text": "I just want to be held so tightly that I feel real. I want to feel like a person. A beautiful loved person. I feel empty I feel ugly I feel all alone like a small child. I want to be held so tightly I can not float away.", "label": 0}
{"text": "You may not think it, but you do deserve to live! It seems like you are scared by committing suicide but have no other choice when life is so unbearable. Just try and focus day by day and if you can learn to love yourself, others will too. 🤗 love ya buddy", "label": 0}
{"text": "hang in there buddy, maybe someone else will show up. i am just like you, if i had one wish in life i would just wish for a normal brain.\nmaybe it will get better maybe not idk", "label": 0}
{"text": "Please trust me. When I was 13 i felt like you and you are probably sick of hearing this but you really do have your whole life ahead of you. I havent had a relationship yet and i have barely had my first kiss (it was a dare). And also your looks will get better TRUST ME. I was ugly as SHIT and puberty really hit", "label": 0}
{"text": "drugs wont do it, you might just wake up with some disability", "label": 0}
{"text": "I am truly sorry for everything that has happened to you. It was truly horrible, f\\*cking horrible. The persons who did that to you should be the one to be ashamed and hate themselves. They're the ones who need to be haunted and feel guilty all throughout the rest of their lives -- not you.\n\n  \nI hope you can find good people around you, while you are in a different place. I am also 24 like you, and I am truly rooting for you in this life.", "label": 0}
{"text": "can you explain why are you doing it? get it off your chest atleast", "label": 0}
{"text": "i dont care for how the future is gonna be like (which noone knows btw but I assume its gonna be horrible) im sad now i want to die now and its not fair that i look like a fucking pig while everyone else looks like a model its not fair its not gonna get better and no way im getting better at my social skills (we moved to a different country 3yrs ago and they never taught me how to speak the language) not even therapy is helping me but its the only thing keeping me sane bcs shes the only person that will talk to me but even then its literally her job i cant be human this isnt normal", "label": 0}
{"text": "try to find something you enjoy doing", "label": 0}
{"text": "So, now she plays the victim, invalidating all you’ve endured all these years.", "label": 0}
{"text": "Take a deep breath, find a place to lay down, rest.", "label": 0}
{"text": "some advice i heard before from somewhere, if you waited your entire life, maybe wait for a couple weeks more before you try again. maybe you'll change your mind.", "label": 0}
{"text": "Im fat, ugly, and stupid.", "label": 0}
{"text": "I almost committed suicide, I texted my friend before I did it and she convinced me to stay. I’ll try my best to not think about those thoughts anymore.", "label": 0}
{"text": " Why meat grinder", "label": 0}
{"text": "The way that country works has always rubbed me the wrong way, things like the “reimmigration” some extremists wanna do now being normalized, for example, to say I’m only at some few hours from there.\nU really can’t blame you for how you feel but your disappearance would be favorable to the scum that resides under that system. \nDo you think there would be a way to cause some type of outrage? There might be other people around that feel the same as you.", "label": 0}
{"text": "Make the state itself pay you.\nAim for the top, auto ransom.", "label": 0}
{"text": "I would but american hospital stays cost an arm and a leg, tho thanks for the advice i decided to find a motherly affection asmr and im gunna try to sleep in hopes the pain just goes away", "label": 0}
{"text": "Damn that sucks. Just remember that if it gets so bad, you should pay for the hospital as your wellbeing and health are priority", "label": 0}
{"text": "Because of \"autistic\" ppl claiming it exists", "label": 0}
{"text": "That sounds incredibly difficult but hang in there..don't give up hope.", "label": 0}
{"text": "It could also be a sign that there is something you're meant to achieve and you have another chance at completing it. Please hang in there.", "label": 0}
{"text": "I truly believe that life will only throw at you as much as it knows you can handle. Stay strong. There is hope.", "label": 0}
{"text": "if i sat her down, asked her why did you treat me like that you made me feel confused snd frustrated and utterly miserable, while simultaneously making me think I had to have done something wrong for her to act that way- she would most likely reply with something along the lines of harming herself. or even take the car and drive off.\n\nI think I did ask her after a breakdown once but I blocked out her sobbing, I can't remember what she said but it made me feel incredibly guilty and scared. I've definitely accepted all the blame, I always tell myself it's my fault, for quite literally everything. I'm an idiot, im worthless, unlovable and hideous. I gave up on myself, dropped out, and now I live at home, watching my parents fight while thinking about every way I could kill myself. I probably do need therapy, if I could just get past the fear of people, the fact that I think everyone sees me the way I see myself. everyone is better than me and nobody likes me, im not worth anyone's time.\n\nI want to believe I can change this, be the parent I wanted to myself, but the self hatred runs so deep i dont see myself as a person. I'm that annoying pebble stuck in your shoe, or a hangnail that keeps coming back. but I really wanted a good childhood, I beg to whatever is out there to let me go back, somehow fix it all. maybe its why I like childish things now, I still own plushies and watch kid shows, still mentally feel like a child. trying to recreate what I missed.\n\nall of what you've written has helped, I've never gotten a reply so in depth and eye opening. thank you really, for taking time out of your day to talk to me.", "label": 0}
{"text": "The way the sun hits closed eyes and makes everything red \n\nRandomly hearing your favorite song coming from someone else’s car and you quickly changing the radio station to find it, and you do \n\nA white bread, salami provolone sandwich with mayo. \n\n(I’m near the edge myself lately, life’s been really fucking tough. So thank you for making me think of the first 3 things that came to mind. You helped me with this post)", "label": 0}
{"text": "Don’t mistake ambivalence for being a pussy mate", "label": 0}
{"text": "Sound good enough for me! \n\nI'm sorry that's how you're feeling, it's really shit. \nWhat kind of help have you had recently?", "label": 0}
{"text": "suicide is definitely not the way to solve this...the best would be to seek therapy...that usually helps a lot... and if you can't seek therapy right now ...I would suggest to talk to your closest friends, doesn't matter if they hate your ex... you need to vent ... talk with friends, people you trust or anyone you feel comfortable sharing your thoughts with. I know it hurts a lot... but all we can do is cope and move on yk...", "label": 0}
{"text": "Count from zero to 456 thousand and see how you feel after that fam", "label": 0}
{"text": "https://www.reddit.com/r/SuicideWatch/s/b95GgmQDj4", "label": 0}
{"text": "It is absolutely reasonable of you to just want to feel wanted. Please give yourself a bit more time, your so young and all pain is temporary so its just a matter of waiting. in the meantime i will be praying for you 🤗", "label": 0}
{"text": "You're courageous for following your dreams. Stay strong.", "label": 0}
{"text": "Please hang in there for your daughter. There is something bright beyond this darkness.", "label": 0}
{"text": "Stay strong. There is hope.", "label": 0}
{"text": "Please don't give up. There will be tomorrow and it will be better than today.", "label": 0}
{"text": "i've experienced some of the same things. I called the police for my dad physically assaulting me and they did nothing, didn't give me any resources or anything. I've shut down. No one cares. All i wanted was to be cared for and treated like i deserve but that's not possible.", "label": 0}
{"text": "Please don't find the courage to do it. There is still hope.", "label": 0}
{"text": "Please don't give up. It gives me hope knowing there are others out there who feel like it's the end. Find comfort in knowing you are not alone.", "label": 0}
{"text": "if you're trying to fight the fear of doing it, ask yourself why the fear is preventing you from doing it.  If no one else is, i'm glad you're still here.  Asking questions.", "label": 0}
{"text": "I don't know how it's possible to deny that something is different in behaviour of this people? Maybe Autism diagnosis is wrong, and doctors will come to another description in future. But there is something with chemicals in brains of this people that makes them act differently.", "label": 0}
{"text": "Oh hey im about to start, my family hates me, i dont like interactions and i have many flaws, i have many other reasons and issues with this world/life, thanks anyways", "label": 0}
{"text": "Ah it’s the dysphoria yea i can see from rereading now. \nSorry, was just trying to be helpful. I can see from the downvotes no one wants to hear it lol", "label": 0}
{"text": "That is literally lawsuit worthy.", "label": 0}
{"text": "Hi. Shall we chat? Need someone who understands to talk.", "label": 0}
{"text": "You're on a road to discovery--that's why you should live, at least for now. \n\nI mean, why would you give up art? Why would you assume you have neither the talent nor the drive? This is you now, and, even if you'd been pursuing this passion from the moment you were born, I'm sure you'd still consider yourself a novice. You haven't had a chance to collaborate with other artists, see dramatic, inspiring vistas, or likely even had access to a variety of mediums that growth in life can bring. Being a teenager is limiting by its nature...luckily, this period, too, shall pass.\n\nTry to take the long view and enjoy continuing to discover what makes you unique. Like you, I'm sure your art style will change over time...and if the passion in pure art wanes, I'm sure you'll find a way to incorporate it into your life in fulfilling ways. \n\nThere are a lot of amazing things in the world, and you're just beginning your journey. Good luck.", "label": 0}
{"text": "It’s not a natural talent. I write in my free time.\nBut thank you. That’s very kind of you to say", "label": 0}
{"text": "I have sort of once, a friend threw a small party. I need to reconnect with them sometime ", "label": 0}
{"text": "Si tay cerca de provi te apaño, vay a cachar que en realidad es re piola, pero entiendo que se requiere un primer empujoncito y parece muy intimidante al principio. Honestamente vi tus otros post y creo que varios de tus issues se pueden aliviar ahi", "label": 0}
{"text": "It's sad that this is a legitimately good idea.", "label": 0}
{"text": "I feel hate & resentment in this world too. I still work my butt off just to keep going on vacation. I’d still be depressed but still somewhat manage it. Traveling is my thing I don’t know about you. My family & friends can’t fill the void in my heart anymore. I wanted to show love to an another human being & hug them for so long without them making me feel alone by talking me out of it. They will just fuck up the vibe. It is too much to ask what I want. I walk at night because my life is just depressing like that. F*ck a 2nd chance in life. The 1st chance was tormenting enough, barely having any strength, hope faith to stay alive. I even wish I can stop existing and still be alive without kms. ", "label": 0}
{"text": "Ooooh, comprendo. La verdad, voy a ver si puedo, aunque me da caleta de miedo :').", "label": 0}
{"text": "I started to hate him at one point... He threatened me...", "label": 0}
{"text": "It will really mess your stomach up.", "label": 0}
{"text": "10/10 rage bait. Looking at ur profile really just says it all.", "label": 0}
{"text": "I wish someone would invent a cafe where we could all go and hang out when we needed some company. Like a no judgement place\n Like a compassion cafe.", "label": 0}
{"text": "Yep, unfortunately its very difficult to predict when good or bad times are ahead. You are really brave and it makes me so sad that you feel like you have no support. My advice is to find some kind of support. Friends may be hard so you can try counselling/therapy or free hotlines", "label": 0}
{"text": "thats a blessing. have tons of protected sex i suppose. STDs wont kill you right away, you'll just suffer.", "label": 0}
{"text": "When I talk to someone I feel slightly better, but as soon as I’m on my own again I start getting all kinds of thoughts", "label": 0}
{"text": "get addicted to doing something that is unhealthy and makes you lose track of time and also gives you anxiety", "label": 0}
{"text": "I’d say change your plans. Good to be away from social media anyway…as they say, comparison is usually the thief of joy.", "label": 0}
{"text": "Okay heres this what could prove to you that autism exsists. Im not saying you have it but what \"evidence\" would you need.", "label": 0}
{"text": "Your english is fine, thx for your comment :)\n\nYeah you're probably right, this will take a while to get back to normal", "label": 0}
{"text": "I can’t tell if this is a joke or", "label": 0}
{"text": "We all need a little help now and again", "label": 0}
{"text": "Ur not a coward in the back of ur mind ur body can keep going ur mind is the thing getting to you the bad parts there is good there is something im I still fighting to live out", "label": 0}
{"text": "if this is about a relationship I feel this.", "label": 0}
{"text": "his family members or maybe sit down at a cafe or a library talk to him", "label": 0}
{"text": "Go to evening college sometimes even has better pay and less hours of college for you to teach and also have less number of students", "label": 0}
{"text": "It's about life.", "label": 0}
{"text": "Whatever you did, it’s forgiven", "label": 0}
{"text": "I would make people remember me", "label": 0}
{"text": "They are so pathetic, why can't they just shut up...", "label": 0}
{"text": "how are you doing man? you still with us? i’m here as someone that cares and i’m paying attention and i’m concerned even if no one else is. you’re wanted and cared abt. the world is cold and unforgiving and ppl aren’t nice anymore and they only care for themselves but the ability for you to exist and have that thought means there’s other people that feel the same and that care and i’m one of them. i’ve really been there man i know what it’s like. hope you’re still here", "label": 0}
{"text": "i’ve been there man. people who haven’t experienced this don’t know what to do or say. they can’t help. not saying he’s a bad person but i promise there are people out there that understand and can tell you what you need to hear. even things like taking a shower is debilitating with mental health issues. you aren’t alone and there is not anything wrong with you. it feeds off of you not opening up to people because you’re met with negativity or misunderstandings. i understand you and it’s not your fault. you deserve to be gentle with yourself and to take things one step at a time. i hate when ppl say suicide is a permanent solution to a temporary problem, because sometimes problems ARE permanent. i can’t promise it gets better, but i can promise that with time you CAN and WILL learn how to be gentle with yourself and give yourself the love you wanted. it’s within you, my friend. much love <3", "label": 0}
{"text": "perfect", "label": 0}
{"text": "as long as you didn’t kill a person for just some unjustifiable reason, you deserve to live. Dont be shy to seek professional help", "label": 0}
{"text": "its a medically/neurological response that your brain makes because of reasons (idk exactly what/how) but I THINK it's some kind of \"relief\" happiness if that makes any sense \n\n\n\n(But still don't do it (idk much about you I looked through your profile but that didn't tell me much but I'm sure you have something to live for)", "label": 0}
{"text": "Yeah. I don’t have any worth either. My parents love me, but I did nothing to earn that. And if an orphan dies, does that mean they didn’t matter? I don’t think so. The best I can do is make as much fucking money as I can, live in a tent, and donate blood. There is my physical worth. That’s all I have. I can’t be a good person, but I can be objectively useful. That’s why I’m here. That and fear. I should be afraid, better people are suffering far worse.", "label": 0}
{"text": "Nope nothing but misery, many many problems with no way to resolve them, a situation impossible to get out of, not one second ever of feeling happy, loneliness, upcoming homeless, sadness and absolutely dread every second of being alive and only getting worse. Knowing I’ll be dead is the only minor sense of relief.", "label": 0}
{"text": "What's going on? I'm also feeling the urge tonight. I cant stop crying and I'm just tired.", "label": 0}
{"text": "Take things one day at a time. Recite and take to heart the Serenity Prayer. Find a support group of some kind to help you in your path.", "label": 0}
{"text": "You are wrong", "label": 0}
{"text": "These are beautiful words, thank you.", "label": 0}
{"text": "OP, you can redeem yourself.\n\nWhat you have done may have irreparably hurt someone.\n\nBut I’m sure you had your reasons.\n\nRevenge or vengeance can indeed bring closure.\n\nDon’t forget why you did it, and the pain that led you to do it.\n\n“Fear the wrath of a good man” is a thing for a reason.\n\nYou are loved. There are more people out there you will have opportunities to love, and for them to love you.\n\nDon’t look back. Just keep moving forward. Take care of yourself daily, don’t neglect yourself, and don’t beat yourself up. \n\nTreat yourself with the same compassion you’d give a friend.", "label": 0}
{"text": "There is a high risk of remaining alive and becoming a vegetable. The process would also highly likely be very slow and painful. \n\nWould you be willing to share what are you going through?", "label": 0}
{"text": "I don't think so. Everyone would just spend all the money they get every month, because they know they have it coming back again.", "label": 0}
{"text": "Most people climb out of poverty eventually. Even while you're in poverty, you can still appreciate the simple stuff like walking", "label": 0}
{"text": "I would say one week of insomnia is no reason to go permanently", "label": 0}
{"text": "Ugh me too", "label": 0}
{"text": "I’m tired, very tired", "label": 0}
{"text": "More like acceptance that my brain won’t work anymore and I won’t exist and won’t have to deal with this terrible shitty life anymore. I used to have a decent life but everything got stripped away and there is zero chance of ever getting back.", "label": 0}
{"text": "I feel you with the ambitions and dreams. I feel like I am not me, but it also feels like that \"me\" will never come back. I don't know who I am anymore. Every day is a new pain and a new thing to take care of so it doesn't trigger a symptom. As you said, it feels like one is trapped in a body and paying some sort of divine punishment. I was not the kindest person ever but every evil act I committed I for sure paid for it already. I have lost friends, family, money, and a great partner. Family is far from me and I am scared of living alone. The exit has been in my mind for quite some time and at the moment, in this depreciated state of mind, I cannot conceive a different scenario for the end of my existence.", "label": 0}
{"text": "Unfortunately my\nCredit cards are maxed out, it’s hard being a single dad when the mom just abandoned us .. I love my kids to death but it’s just so embarrassing when your kid ask why we don’t have the same stuff as other families", "label": 0}
{"text": "i feel the same. i’m so sorry you’re going through all of that right now. i hope you can feel better soon!", "label": 0}
{"text": "Evening college and do what though", "label": 0}
{"text": "Don't do it,  it's worth having hope, nothing is eternal, not even the problems you may have, I want you to stay, please live, things will get better", "label": 0}
{"text": "Same thing you did in the morning one but it will be better for you", "label": 0}
{"text": "Yes, I'm very tired.", "label": 0}
{"text": "U will have time for activities, friends and everything you want to do", "label": 0}
{"text": "i hope you’re still here.", "label": 0}
{"text": "Have you communicated with this person", "label": 0}
{"text": "yes we talked about it", "label": 0}
{"text": "Very much so and I would imagine that anyone who has ever attempted or committed suicide feels that unbearable pain of fighting against the survival instinct. It's what keeps us alive and actually overriding that instinct makes the pain you're already experiencing a hundred times worse. I have been there so many times. You are not alone in what you're experiencing. Maybe you don't have anyone IRL, but at least you have this forum to relate to other people who have those feelings. If you think it might help, please post on here what you feel it is that makes you feel the way you do.", "label": 0}
{"text": "I didn't feel pain throughout the trip ", "label": 0}
{"text": "You summed it up so well \nWhat's wild for me is losing my dad broke me but being trapped with all these dreams and unable to do them just makes me feel like I'm going insane along with the pain and the ever changing symptoms and what it could be or if it's something new. \nI use the word tired a lot but it's so much deeper than that.", "label": 0}
{"text": "life isn’t worth living if i can’t be beautiful :( it affords you so much automatic respect/kindness/affection. i wish we could all look the way we imagine ourselves to be. it’s just not fair.", "label": 0}
{"text": "I feel you bro. For me the world is just revolving, I'm just surviving. Why can't I just live like other human beings?", "label": 0}
{"text": "What you said resonates pretty truly with what I’ve been experiencing for the last year. It’s basically surreal, some miserable holding pattern amongst the living, who are somehow immune to these demons that I’ve always had to fight.", "label": 0}
{"text": "First of all, I am sorry for your loss. Could it be a severe case of depression? Or extreme fatigue? I don't know your illness but any chronic pain is hell on Earth. I am sorry you are going through this. I continue to go deeper into depression as I continue to lose people and things, therefore getting more tired every day. I would not wish this for anyone.", "label": 0}
{"text": "thats not what i want", "label": 0}
{"text": "Why do you want that?", "label": 0}
{"text": "Extremely fatigue is probably fair. \nNot being able to get proper nutrition \nNot resting \nTrying to work still and be a productive member in society.  \nEverything is just hard", "label": 0}
{"text": "You don’t need someone to punch you in the face or hurt you. You need someone to help you help yourself", "label": 0}
{"text": "Uhm. No reply. Trying to think on how to tell people. Fear of people killing themselves and leaving me had heightened.", "label": 0}
{"text": "Thanks for these.  I needed this 💜😞", "label": 0}
{"text": "I'm so sorry about what you are dealing with. I younger and have not dealt with such things, so I'm sorry that I don't have any experience to share, but are there any resources out there to get you food or financial aid? I would really hope so, please try to find things. Does your kid go to school? Could you perhaps get help from the school or from fellow parents?", "label": 0}
{"text": "I want to die to but can’t do it ", "label": 0}
{"text": "It's not okay, but I can understand why someone would act this way. I feel hate towards others sometimes because of my struggle. But you shouldn't hate others. Please be kind to others.", "label": 0}
{"text": "Fair", "label": 0}
{"text": "I understand it can be shameful, but you have to understand that it's also for your kid, and that any good person would want to help you. I know it's not the easiest thing to ask others, but just explain the situation and try to get some help at least. Please", "label": 0}
{"text": "You shouldn't cause harm to others at all, please. I don't think this will make your self hate better. In fact, it might only make it worse.", "label": 0}
{"text": "Thank you I appreciate your support", "label": 0}
{"text": "I really do hope things work out and that things get better. I wish you nothing but the best, and you can always reach out to me if you need someone to speak to.", "label": 0}
{"text": "It might sound rude but in my opinion i can harm if the situation needs it\nFor exemple if person is bullied and at some point it takes self defense its okay right? Im not talking about some serious threatening to life or something like that", "label": 0}
{"text": "Hey, u ever thought about running away tho ?", "label": 0}
{"text": "Everything you could have possibly done or ever could do is absolved. You are human. You deserve aid when it’s needed.\nWe all need assistance sometime. It’s part of being on this earth. Stay with us and reach out. Plenty of amazing folks on this earth.", "label": 0}
{"text": "Please help me, please", "label": 0}
{"text": "Hey, u ever thought about running away tho ? It’s something I’ve been thinking about a lot lately cause mostly what makes us feel miserable is the environment we’re in. Run and live life on your own terms, u got nothing to lose atp, I’ll take the leap too very soon. I won’t take my life for some loosers 🙄(personal opinion)", "label": 0}
{"text": "No they will put you in a position of extreme pain. Just get help from your peers. Remember I'm always available to talk if you need it. I'm here for you 🤗", "label": 0}
{"text": "He’s not doing his job right, record a conversation with him and get that bag. Or just switch therapists, it’s really easy if you’re able to get this dude. I can’t afford one tbh or my parents would be weird abt it", "label": 0}
{"text": "Wow that means everything is better and fixed right? One post on reddit with a couple sentences and OP is cured! Why didn't I think of that 🤔 ..\n\n\nYou're an idiot", "label": 0}
{"text": "I know, but saying you will always be there while not being there isn't the best thing to be on the ither side of", "label": 0}
{"text": "They're alive. They wish they did it last night, but they're alive. Trying to figure out best thing to do.", "label": 0}
{"text": "I can relate to it i don't have a solution but you can talk to me if you want this may help you", "label": 0}
{"text": "Unfortunately, I feel you so much.", "label": 0}
{"text": "It all feels eternal, I've been suicidal for months and depressed (probably not the most accurate description of it but best I could think of) for longer than I can remember and I just want it all to fucking stop.\n\nI'm in a cycle of trying suicide, getting talked out of it, trying to fix things, failing, and then back to suicide again. If I don't kill myself tomorrow I'll end up killing myself next month when things are even worse than they are now", "label": 0}
{"text": "🙏\nAnother worst thing in life to go through, another worst day of my life and then realising I've had the same thoughts for other past events in my life. \n🙏\nSo now which event was really the worst? \n Have I now had my quota?\n  Are there really still worse events for me to endure? \n🙏\nFeeling numb, just floating, zombie like, am I really here? What matrix am I in now? \n\nI'm a packet of instant noodles, where is the beginning & where is the end ?", "label": 0}
{"text": "There are BETTER events for you to EXPERIENCE. I know the feeling of being incredibly numb to things, and not feel like you have much to look forward too. But you do, you have so much to look forward too", "label": 0}
{"text": "2 weeks?? This is beyond fucked up. I'm so sorry.\n\nDo you have anything you look forward to? Anything at all, even some silly little things like a certain video game being released, or seeing how everything gets decorated for the Christmas?", "label": 0}
{"text": "🙄", "label": 0}
{"text": "Have children and repeat the legacy of your abusive father", "label": 0}
{"text": "Hey there,\nWhere do you live?\n\nHold on to your precious life -  the failures of our modern society and capitalism are the root of your pain and the ignorance of the others. Don’t let society win. Don’t let capitalism win. Life is so much more than these systems. \n\nLet’s chat 💬", "label": 0}
{"text": "Try to learn something new or just drop life and just live Travel and don't care about anything", "label": 0}
{"text": "i want to know what series of events influenced you to write this comment", "label": 0}
{"text": "Yup national healthcare is amazing if it’s physical. They pretty much told me to such it up and blamed it on my autism.", "label": 0}
{"text": "report it there are tests to prove it", "label": 0}
{"text": "Same tbh I’ve only had relationships that last two weeks bc I found out they’re just playing with my feelings", "label": 0}
{"text": "It’s exhausting, constantly feeling this way. I feel so weak & helpless.", "label": 0}
{"text": "Yeah, you don’t want to jump. Or do you want to take the risk of surviving and being stuck in a wheelchair for all your life?\n\nWhat do you think is so ugly about you?", "label": 0}
{"text": "You feel bad about doing it so your on the road to change.\n\nMy dad beat the living shit outta me and saw nothing wrong with it.\n\nIf its any consolation, I thought beatings were normal, I didn't know any better. Maybe she does too.", "label": 0}
{"text": "The mind is strong. Just know you will get better ", "label": 0}
{"text": "But how would the government afford it? Increasing taxes? Printing more money? That is a recipe for runaway inflation. Even if everybody got $1,000 or $2,000 a month, that wouldn't mean much if inflation erodes purchasing power. We would be left with $50 loafs of bread. \n\nThe key here is that this money is being given out for zero productivity. If people are rewarded for not being productive, then no one will want to be productive. \n\nWith that being said, I dislike capitalism and many things that come with it. I think many things should be a human right that are not currently.", "label": 0}
{"text": "Please, tell me you're still here.", "label": 0}
{"text": "I am in the same situation I know it is hard truly very hard but your life can change please consider some other options :)", "label": 0}
{"text": "Perhaps planning something preoccupies your brain and makes you happy?", "label": 0}
{"text": "I'm thinking the same. Comfortably in bed, but I don't want it to look so obvious", "label": 0}
{"text": "normal for people like us if you're that far into \"this\"", "label": 0}
{"text": "imho not only are you enough Adriana, I have to say this:\n\nI believe, regardless who you are, where you are in life, you are actively enriching life. You are actively making life more beautiful with your sheer existance, your innate essence as a highly cherishable human being is infinite! its terribly heartbreaking you have been crying and not being able to sleep, i have ideas of what you feel, obviously not 100% as no experience is 100% the same, and i just wanna say i can only hope your emotional and mental wellbeing will improve\n\nwishing you all the loving kindness, compassion, empathy towards you, you are entiteled to it Adriana!", "label": 0}
{"text": "Sue your parents", "label": 0}
{"text": "Wait, that’s not even a bad idea😩", "label": 0}
{"text": "no doubt, I always fail at any primitive animalistic activities, thank every God..", "label": 0}
{"text": "good luck 😉", "label": 0}
{"text": "I feel ya on the laundry list and it's like every dr visit we add more.", "label": 0}
{"text": "Hey - yeah. Was out enjoying sun on my skin sitting in a park 4 hours ago - and now am - well, let’s just say I posted to this sub 5 minutes ago :)\n\nI get you - I have been forgotten and alone - and in a crowd and alone - and honestly - both are just as bad…\n\nGiven that - meds are bad - ESPECIALLY if you are unlikely to be found. Hard to die from them - easy to non-fatally break several important internal organs. Wouldn’t happen if you are found quickly - but if you are lying on the floor for 2 days after an overdose - expect kidney, spleen, and liver damage at least - and probably some neuropathy. And this will really suck for years when you come to. \n\nSo please don’t :)", "label": 0}
{"text": "Thanks! I still trying to fight with myself and I will be here as long I can do", "label": 0}
{"text": "You can always allow yourself comfort friend❤️", "label": 0}
{"text": "There is always another solution, think about it :-). How are you feeling right now? What is bothering you?", "label": 0}
{"text": "You’re more than welcome! \nStick some headphones in and listen to Alan Watts - It Is All A Show. He subscribed to spiritual based beliefs and from that, some of what he said gives me reason to feel more hopeful when I am full of dread. Listen to rain and buy a ‘crackling’ slow burning candle. Be kind to yourself!", "label": 0}
{"text": "I’m sorry you feel this way! Just know that other people also feel this too; you are not alone. I’ve seen your posts on r/Blahaj and you make me smile every time you post :).", "label": 0}
{"text": "I’m sorry man, being alone sucks", "label": 0}
{"text": "I think a lot of women, including myself, feel unheard and alone in our marriages. We continue on for our kids in the hope that they live brighter days.", "label": 0}
{"text": "Hey, thank you so much. I know this would really be the best option. I’m really happy to hear your therapist has helped you too and has made a difference. I’ve called the suicide hotline but I understand they can only do so much, it’s better to have a professional therapist who works with you one on one. Thank you again 🌼", "label": 0}
{"text": "Do you want to talk and have a friend? I won't judge you and u seem rlly cool", "label": 0}
{"text": "A lot of us feel like we have no friends. I always chat with random people and that little connection, no matter how short, really helps.", "label": 0}
{"text": "Real", "label": 0}
{"text": "When you said you always feel like you have to make people like you, it just resonated with me. It's hard to be \"on\" all the time. You take time for yourself. Sometimes you're all you have and that's okay.", "label": 0}
{"text": "Well, let's add that to the list of things I wish to unhear and unsee lol", "label": 0}
{"text": "Hey, If you need somebody to talk to I dealt and dealing with the same problems and Its super hard", "label": 0}
{"text": "It's difficult to find help, but keep trying. Something or someone is around the corner to step up for you.", "label": 0}
{"text": "I did it 2 months ago, I swallowed a high dose of diazepam, then after 20 minutes I lost my balance and I fell, the next thing that I saw were 2 doctors and my family in the hospital room window crying, I felt so sad because of them especially my dad who never cried in front of me but in the same time sad because It didn't worked out... since then I got ups and downs in my life but it was never been the same and sometimes I still think that I should finish what I started because I cannot have the power to fix what I destroyed", "label": 0}
{"text": "You just have to have faith. It will all work out according to my plan.", "label": 0}
{"text": "I've fallen for scams too. People might say we're naive but I always want to give people the benefit of the doubt. Hang in there.", "label": 0}
{"text": "I'm on board on that", "label": 0}
{"text": "I hope it gets better for you darlin i truly do im here if you need anything", "label": 0}
{"text": "I feel the same way. I always feel trapped", "label": 0}
{"text": "I feel you so much. All those points read like mine… besides the age and instead of my father it’s my mother. Every good thing I found or achieved twisted itself against me and I just see no way out. Every gift from life turned into a nightmare… I am 15 years your senior. All I wish for is a nice hypoventilation death.", "label": 0}
{"text": "Damn is it usd $25,000?", "label": 0}
{"text": "I strongly advise against doing anything with a pocket knife. You will not succeed and just scar yourself", "label": 0}
{"text": "Being a sobbing mess helps Adriana. You have to let all that negativity out of you. You're going to be okay.", "label": 0}
{"text": "People can't see your pain but don't let them not see you. Be strong.", "label": 0}
{"text": "It’s alright :-)", "label": 0}
{"text": "I think about this all the time. I wish so many times I could have gone through with it 7 years ago. life is horrible and it just endlessly is bad always. I don’t know what else to do anymore. it’s so lonely and hard", "label": 0}
{"text": "I've never died or had an attempt I've planned attempts but never followed through. But one night I was so depressed that without thinking I sliced a massive cut across my face. Seeing my parents disappointment in their eyes. For context they see people who have killed themselves as pussies who couldn't handle life. They knew of my severe clinical depression but have hated me ever since.", "label": 0}
{"text": "That must be really painful. A whole group of my best friends stopped talking to me this year and it was really painful. Rejection just hurts in the deepest place after it first happens. \n\nIt doesn't mean you're bad. It doesn't mean no one will love you. \n\nWhat happened with the breakup?", "label": 0}
{"text": "In general - getting 2 things right is harder than one. So - I wouldn’t.\n\nOn another note - what’s so bad you are willing to take long term pain? That’s the one thing most people are afraid of more than death!\n\nCan it maybe be ameliorated? As you see from my post - I hung on for 3 extra yrs - and I don’t really regret it. Didn’t enjoy it always either - but it was interesting :)", "label": 0}
{"text": "I don’t really know. He just told me I can’t connect with anyone it just was like oh ok there really is no point to my life cause I really can’t", "label": 0}
{"text": "I hope you can one day love yourself as much as your mom loves you.", "label": 0}
{"text": "I am married but feel completely alone.  It's not just simply having a partner but the right one.  It seems so effortless for so many people. Yay for them I guess.", "label": 0}
{"text": "I’d want my parents to know the truth before I died. I would owe them that. How long have you been planning this?", "label": 0}
{"text": "I totally agree that society is what makes us suicidal.  The earth is a beautiful place… people have made it a shit show.", "label": 0}
{"text": "Fucking hell man you’re young. How long have you been struggling?", "label": 0}
{"text": "How long have you felt this way? Does anyone show you true care?", "label": 0}
{"text": "Most moms are selfish in that way. I hope you talk to someone.", "label": 0}
{"text": "I'm always here for you I dont have any friends either.", "label": 0}
{"text": "Hey you’re great at being you, you don’t need some grand hobby to be determined a “good human”. Living is pretty weird idk why I’m here or my goal in life but I continue on because if I were to die I’ll come back and still be suffering. You’re a great person no doubt because there is no such thing as a worthless life.", "label": 0}
{"text": "Look for alternatives to use art. Meaning you could find a way to incorporate art in a job. Or study something that allows you to work in arts.", "label": 0}
{"text": "Going through the same dilemma. I just wish things could've been different so that I didn't want to die but it's not our fault for feeling this way.", "label": 0}
{"text": "Who told you this? There is no right answer to what we are \"supposed\" to do in life.", "label": 0}
{"text": "Everyone is downvoting this but the idea is right. If you honestly stop thinking about it and just get used to it, one day you’ll remember back to these times and you’ll see the huge difference.", "label": 0}
{"text": "Do you worry about telling your family what you feel? School years are stressful, the beginning of the rest of your life can often make one contemplate the end. This is a tough combination. I’m sorry.", "label": 0}
{"text": "hey you're fine, no offense taken! ive not really thought about it, but for me i find i tend to use it cope as an \"long way\" to death i suppose? in a way just like self harm its almost like my mental suffering is real enough when its physical? its not rational obviously and i dont believe the same for anybody else but its like im the exception? i think most of it is control too, i dont really desire to lose weight or be like this anymore and ive been mostly relapse free for a long while now but it seems to be this time of year i always end up relapsing.\n\ni hate the feeling of being hungry so much, but when i restrict i cant feel anything because im too busy thinking about food and my body and how i can avoid eating, i dont want to obviously but its better than the constant thoughts of death and committing suicide which makes me panic and really want to do it. \n\nsorry for the rant 🫠", "label": 0}
{"text": "Do you mind me asking what specific condition you have? Chronic pain sounds awful. Life has so many diverse ways of fucking people over.", "label": 0}
{"text": "probably longer than i’ve even realised. I know this answer isn’t helpful sorry", "label": 0}
{"text": "feeling the same as you are", "label": 0}
{"text": "It’s good to have self awareness and to try and change one’s behavior. But I hope you don’t torture yourself over forgivable offenses, I would know all about that having ocd.", "label": 0}
{"text": "i can say wholeheartedly that people will find it very very funny if you end your own life over some r6 scriptkiddie with a photo of you & a cart", "label": 0}
{"text": "I'm in the exact same place as you word for word. If you want to talk I'm almost always available just reach out.", "label": 0}
{"text": "My apologies for the delay, I should have written sooner.\n\nI'm sorry the church has been so silent since then. A friend has had a similar experience, and it sounds very disheartening to have that disconnect. Do you feel like you still want to stick with that church, or do you feel like you would be okay looking into other congregations in your area?", "label": 0}
{"text": "Naw, that one actually got a chuckle out of me. Proves my point that anyone can and would push me down even deeper than six feet under.", "label": 0}
{"text": "yeah i think that's like the second law of thermodynamics", "label": 0}
{"text": "I am in the same situation. I don’t know what to do", "label": 0}
{"text": "You shouldn't necessarily rely on your friends for help, they are kids too. Its unfair to expect them to read between the lines and somehow provide what you need. You need to go to adults that have the power to help you and tell them. You need to be clear about how you are struggling. Because if everyone \"thinks\" you're fine, its because they literally cannot see how you are suffering. You cannot cry for help without saying the words. You have to advocate for yourself. I know how you feel, but I can also tell that you don't truly want to leave this earth. So please stay and confide in those that love you.", "label": 0}
{"text": "perfectly acceptable and good quote, I still do think the name is silly but only responded because I was (am) super butthurt and want/need/should die👍 honesty is a decent policy ig", "label": 0}
{"text": "That’s ok. It’s hard to pinpoint a moment when it all started. Sometimes it creeps up on you. I remember the day mine got worse, but I don’t remember the day that started the days leading up to it. Are you alone tonight?", "label": 0}
{"text": "I am scared and hopeless as well", "label": 0}
{"text": "yeah i am", "label": 0}
{"text": "I don’t know, I honestly think it’s something deeper than that, almost just like me and life are incompatible you know? I also hold down jobs ok. I shockingly have very good people skills and it’s made me some genuine friendships but outside of that I just fall short in every way.", "label": 0}
{"text": "If it means anything to you, I don't want you to. From what you've said it sounds like your life is very very painful at the moment. I do not think that online school makes you a failure. Maybe it's just best for you right now. Try to take things as they come. Focus on what you can hear, see, smell and touch. Maybe try not to think too hard right now. Just focus on your senses and try not to get stuck in your thoughts. Much easier said than done I know. You should never have to be in this situation. I am sorry that you are. You are worth a damn. You are already so much stronger than you think considering how you reached out.", "label": 0}
{"text": "If you want to talk just reach out.", "label": 0}
{"text": "Just reach out. Let's just talk about it.", "label": 0}
{"text": "But is that a reason to not do it? Would you rather your son still be here, and suffering horribly? (I know, the hope is that if he was still here, he would have found a way through it, but here I am fifty years into my suffering and I just want it to end). Sorry, I know you're suffering too....", "label": 0}
{"text": "Hey man just reach out. Let's talk.", "label": 0}
{"text": "Your life is worth going to the ER. This decision must be agonising for you but I think that it's something you must do. I'm so sorry you're in such a bad situation and I'm so glad you made this post.", "label": 0}
{"text": "Since I lost my baby sister", "label": 0}
{"text": "I too have OCD and I suspect this maybe a factor behind my issues. \n\nI don’t really know, honestly. I just want to be at peace and not feel like that peace comes at the price of success, or to be successful at the price of peace. I just want peace, I guess. I have been so stressed these last several years that I have began noticing white hairs at the age of 20.", "label": 0}
{"text": "i don't think so. he's just clicking on the most recent posts to bait a reaction. \n\ni actually really wanted to respond to this when i first saw it, but i'm working through an episode and i relate to you too much to trust whatever response i could come up with. i'm ugly, disabled, formerly homeless, in poverty, and my parents also suck. \n\ni really wish i had words to make it better, but i haven't found them yet. all i can say is that you're not alone. i know how tempting it is to let it all go, but i hope we're both able to hang on a little longer. \n\nif you need to talk, don't hesitate to reach out. i understand. i'm still figuring things out myself but i would be more than happy to listen.", "label": 0}
{"text": "I’m so sorry. Sibling love is a perfectly unique love, I couldn’t imagine losing one. I wish I knew better what to say. I doubt grief like that can be described much less cured with words. Do you have any support?", "label": 0}
{"text": "Do you talk to her?", "label": 0}
{"text": "Some time outside could be good :)\nIf you can make it through to your counselling then you can do anything. I'd be very happy if you could. Spiralling thoughts are such a bitch. The best thing to stop them is to just focus on anything else. Maybe try to listen to some music on your walk. Wishing you all the best things in life.", "label": 0}
{"text": "OCD is a tough one. I’ve lived with it for nearly a decade. I’m still learning to navigate it. Antidepressants helped me for a time, have you ever tried those yourself?", "label": 0}
{"text": "And if you can I think it would be very helpful to talk to your counseller about these thoughts.", "label": 0}
{"text": "3 years. Has anyone offered help in that time?", "label": 0}
{"text": "no need to apologise youre all good, i get what you mean so much about making your mental suffering \"real\" with stuff like SH. feels like there's some build-up you have to release. i also really struggle with this time of year aswell even after trying all those silly lamps and everything, oh well\n\nim super lucky to not struggle with my eating but a close relative i never met starved herself to death after her husband died. in this context i thought that someone suicidal might starve themselves to feel physically closer to death and  unconsciousness rather than as an actual attempt on their life or something. sorry that you're hurting", "label": 0}
{"text": "Then maybe drugs weren't the root of your issue. Please stay. There's people you can talk to.", "label": 0}
{"text": "ive always been at an understanding with myself that killing myself is too much effort and im too lazy, and then sometimes it sounds so good im genuinely afraid. i tell everyone its just a joke and i know i wont kill myself but theres that 10% of time i genuinely think im gonna attempt again fml", "label": 0}
{"text": "I never have, but I’m definitely open to it", "label": 0}
{"text": "Shitty is an understatement", "label": 0}
{"text": "I care. It seems like things are getting better but you can't believe it. You can get the help you need and all of us here want you too. I'll be your friend.", "label": 0}
{"text": "idk really. thank you, the schedule thing sounds pretty good", "label": 0}
{"text": "They really stabilize your mood. There is no specific drug for ocd, but several antidepressants are proven to help with ocd.", "label": 0}
{"text": "yeah i dont think i could genuinely starve myself to death considering my history of losing a bunch of weight then gaining it back because my body cant take it. im so sorry about your relative tho, that honestly sounds like a really painful way to go x \n\nironically enough im in the southern hemisphere, so my winters are spent a certain type of depressed because of the lack of sun etc, and then the end of the year comes rolling around and im like yikes ive been depressed all year and achieved nothing, time for crazy time depression 💀💀😭 maybe as well since theres longer days im more likely to walk obsessively or something?", "label": 0}
{"text": "YOU, don’t know that it’s a temporary problem. How dare you say that to the OP??", "label": 0}
{"text": "It'd be the first time for me but i don't think i'd be afraid to go through with it even if it involves pain for a few minutes. It's been way too long and i don't really see a way out anymore. I hope you find the way to a life that doesn't make you feel that way. I think it's dangerous to stay in that headspace for one too many times if there's a chance to turn around you simply don't see, which might also be the case for me but i've still got some time left to figure that out.", "label": 0}
{"text": "It's impossible to find love, it finds you. And it does help for a while. You forget why you feel the way you feel. you forget the pain, even if only for short moments. Unless you solve the problem at its core, no relationship can fix what goes on in your head. Adding a person to your life while Yes will improve certain aspects of it. If you need that person in order to be okay, there will still be problems. Trust me i've been a relationship for eleven years and still think about suicide constantly", "label": 0}
{"text": "And that's just at that moment. You're not alone. Stay strong and be kind to yourself.", "label": 0}
{"text": "No worries bro. This whole subreddit is here for you so never feel alone", "label": 0}
{"text": "If you’re going to have an incel’s attitude, you’re going to get an incel response. I’m a female and I can tell you that we can tell if someone is feeling sorry for themselves and that is not an attractive trait. I’m sure you are handsome/beautiful in your own way and maybe you haven’t met the right person", "label": 0}
{"text": "I hate that feeling :( too.", "label": 0}
{"text": "Because it might get better and you’d miss out on everything you would have experienced during you cut short. Maybe there are people/whatever that your not ready to let go of yet. Though that isn’t always worth it.", "label": 0}
{"text": "yeah i feel the same.... no way out.... its why my brain defaults to telling me i deserve to die and that i \"need\" to kill myself i think...last times i tried to i got sick and backed out but it just made me feel worse lol.... maybe thats why im so perfectionist about how i go about it :/ it sounds really dark but i want a guarantee'ed death without the possibility of living an even lower quality of life. im scared if i fuck up too bad my family will genuinely believe id rather live than have the plug pulled on me or something", "label": 0}
{"text": "Don't end your life. I felt that same exact way at 13. It's a hard age. You have a lot of runway ahead of you.", "label": 0}
{"text": "If getting used to it was possible, you wouldn’t self harm. But hey.", "label": 0}
{"text": "I feel every word of this  im exhausted", "label": 0}
{"text": "omg hey i just realised youre the person who replied to my post yesterday that i deleted out of embarrassment :3 anyways imma go smoke the fuck outta some weed and distract myself🤡", "label": 0}
{"text": "thanks for ur words", "label": 0}
{"text": "This touched me. I'm feeling this pain right now. You hang in there. I'm just taking each day one at a time.", "label": 0}
{"text": "I’ve done everything I can do. You won’t even notice I’m gone and neither will anyone else the sun will still shine. Though I appreciate your kind words and appreciate you ❤️", "label": 0}
{"text": "What do you feel when you see it?", "label": 0}
{"text": "Uhm, i'm sorry if i made you feel that way. Would you remind me what post it was exactly? I'm around these places a lot as of late. We can still talk if you want. I'm not going to laugh anyone out of the room for telling me they feel like this and i'm sure a lot of people here feel the same way...", "label": 0}
{"text": "omg hey sorry lol i didnt mean bc of you!! i just mean i got embarrassed and impulsively deleted it and then realised youre the same person sorry!! i shouldve phrased it better (whenever i am not in the mood anymore where i was like depressed im like EW CRINGE DELETE ITS EXISTENCE)", "label": 0}
{"text": "I would feel it in the atmosphere. Your passing would be an unjust tragedy with no meaning. The sun would still shine but you wouldn't be here to appreciate it's splendour. There's so much more to life than this storm you're caught in. You can make it out if you only make it through this night. Please.", "label": 0}
