{"text": "A few years back (in 2018 IIRC) they did shoot down one F-16", "label": 0}
{"text": "Israel has been bombing Syria for years now and they never really responded back ever only managing to shoot down one F-16 in 2018.", "label": 0}
{"text": "Reminds me of when many pro-Palestine accounts posted the image of the Kurdish boy who was burned from what seemed to be some type of gas as victims of Israeli war crimes. The Kurdish boy was actually targeted in a Turkish air strike and had to go to Iraqi Kurdistan for surgery. \n\nIn this day and age everything must be verified yourself.", "label": 0}
{"text": "Pilot survived?", "label": 0}
{"text": "Yeah he did.  Lol", "label": 0}
{"text": "imagine how many more could return if the sanctions were lifted...", "label": 0}
{"text": "At which point will everybody stop letting Iran use them as their puppets?\n\nIs it not enough that Iran used Lebanese shia as cannon fodder in its proxy war in Syria?", "label": 0}
{"text": "And then his pager 'went off' 🍻", "label": 0}
{"text": "Al-bab is in Euphrates Shield zone. Under Turkish control.", "label": 0}
{"text": "Been a while since this big a airstrike.", "label": 0}
{"text": "Nice. Keep em down.", "label": 0}
{"text": "kurds aren't a religion and there's no christian or alawite armed opposition groups. There were probably some people from those groups who fought against the government early on and surely regretted it when the headchoppers took prominence", "label": 0}
{"text": "That was Russia and Syria's air force nearly a decade ago.", "label": 0}
{"text": "The US is much better than Russia and Assad, but I am suspicious. The tribal coalition would need more than the SDF to be put down.", "label": 0}
{"text": "Glad to see Iraqis with their priorities in check", "label": 0}
{"text": "The first ones have guns, the second don’t.", "label": 0}
{"text": "Also, many in Iraq's security apparatus are quite literally the same people as the former.", "label": 0}
{"text": "Kind of an obvious conclusion to shit like this: [Iran preparing major retaliatory strike from Iraq within days, Israeli intel suggests](https://www.axios.com/2024/10/31/israel-iran-planning-attack-iraq)", "label": 0}
{"text": "Are they the same so called reisstance that killed syrians in the name of war criminal assad regime?\nNever forget", "label": 0}
{"text": "Because those iranian made,financed ,controlled, etc... militias never ever considered themselves part of the national entity they live in...\nThey are proud to be agents of a foreign country,to do its evil bidding even if against their own country.\n\nReminds me of the communist parties back in the day.\nFor example, did you know that the Egyptian communist party was for Israel in 1948 war because it was a war between a socialist movement against backward féodal regimes.\nOr when Hitler invaded France, the French communist party didn't object or anything because at that time, Stalin and Hitker had signed a treaty and started to fight against Germans only when the ussr was attacked.", "label": 0}
{"text": "Nothing, the US military simply refuses to follow orders if they don't like what they hear.", "label": 0}
{"text": "Trump has Tulsy Garbage as an advisor, and she is a fierce war criminal apologist...\nTrump is also a Putin minion...\nTrump will be catastrophic for Syria (and Ukraine)", "label": 0}
{"text": "The US military will what now???\nNo they will not unless it goes against the constitution or their oath.\nIf Trump command them to nuke the shit out of a contrey, they will still obey", "label": 0}
{"text": "Only catastrophic for Syria if you’re an opposition supporter", "label": 0}
{"text": "Trump ordered them to withdraw from Syria and they refused.", "label": 0}
{"text": "That's wrong \nThe president is the commander and chief and head of the executive branch and thus the military. \n\n\nHowever the president isn't a dictator and also has the legislative branch and his own party to deal with. \n\n\nTrump ordered the Military to leave Syria but the legislative branch, his own party and public opinion forced him to keep a token force. \n\n\nThe military doesn't just refuse to follow orders", "label": 0}
{"text": "He changed his mind later probably was adviced against it or some third country conviced him not to", "label": 0}
{"text": "Trump better  but neither side will change its stance in syria specially with the war in palestine", "label": 0}
{"text": "The legislative branch actually does not have any direct power over the military, neither does anybody else in his party, but it's very cool that the military can debate with and negotiate their orders.", "label": 0}
{"text": "Armed services committee and they control the budget. Yes they don't directly control the military but they can out severe pressure ", "label": 0}
{"text": "Only catastrophic for syria if you love syria and syrians you mean", "label": 0}
{"text": "“If you love Syrian and Syrians”\n\nLike I said, it’s not catastrophic for those who are pro government ☺️", "label": 0}
{"text": "> but it's very cool that the military can debate with and negotiate their orders.\n\nDelusional take.", "label": 0}
{"text": "Have any of these attacks caused any damage or provided the axis with any tactical or gains?", "label": 0}
{"text": "They are drawing too many pararel lines...", "label": 0}
{"text": "Glad you could agree that Congress does not have direct authority over the military.", "label": 0}
{"text": "Apparently the US military has to ask Israel if it's ok to follow their orders.", "label": 0}
{"text": "Fuck all", "label": 0}
{"text": "any source whatsoever that they refused?", "label": 0}
{"text": "Those two statements are at odds.", "label": 0}
{"text": "https://www.nytimes.com/2018/12/19/us/politics/trump-syria-turkey-troop-withdrawal.html#", "label": 0}
{"text": "Nothing, the real decisions are made in Tel Aviv.", "label": 0}
{"text": "I deployed under Obama. I deployed under Trump. I deployed under Biden. \n\nI can honestly say that it’s hard to say, but it probably won’t really change much.", "label": 0}
{"text": "She’s pro keeping the USA out of Syria. This is good for us Syrians. She understands the funding of terrorists by the us, turkey, uae, saudis, etc caused this whole debacle", "label": 0}
{"text": "Your point? I support the Russian position in Syria, you’ll live", "label": 0}
{"text": "How?\n\nHe said it’s catastrophic if you love Syria and Syrians, government supporters love their country and their fellow citizens.", "label": 0}
{"text": "Probably an escalation. Putin's gonna throw Assad under the bus to focus on Ukraine. Israelis are going to stack dead shia militiamen to the skies. \n\nBiggest winner is probably going to be Erdogan, bad news for the Kurds.", "label": 0}
{"text": "nothing there said they refused", "label": 0}
{"text": "Israeli intel said Saddam has wmds too", "label": 0}
{"text": ">so your source is just: i made it up\n\nHe literally gave you the source lol. NYT. \n\nRest is basic comprehension skills.\n\n\"President Trump has ordered the withdrawal of 2,000 American troops from Syria\"\n\nAmerican troops are still in Syria. Thus Trump's order was defied.\n\nIs it really hard to understand?", "label": 0}
{"text": "Those are Iraqis, not the Iranians in Iraq. Maybe if Israel didn't constantly lie like their lives depended on it they would have more credibility.", "label": 0}
{"text": "US influence did not help Syria in any way. Tulsi’s ideology of not being involved in Syria is good for us", "label": 0}
{"text": "Rule 1. Warned.", "label": 0}
