{"text": "\"You say that as if it's a bad thing. Back then, people weren't aware of how extreme he was. Their opinions shifted once they saw his true nature. Unlike some on the far right who believe their leader can do no wrong, which is how cults are formed.\"", "label": 0}
{"text": "It's really quite useful as a tool, but in reality it's just another thing you have to code around.", "label": 0}
{"text": "Turns out they'll only enforce review bombing not fake review to inflate a rating.", "label": 0}
{"text": "I'm not they have ads and will sell your data.\n\n\nYou pay them both ways and it's BS.", "label": 0}
{"text": "If someone's gonna try something, you might as well ban every BRICS country.", "label": 0}
{"text": "lol you think he’s not ugly with the hair?", "label": 0}
{"text": "Yes, I stand corrected. The brain isn’t 100% done at 25 and I shouldn’t have posited as such. I don’t know if it’s *as* arbitrary as 20 or 30, but I’ll agree it’s at least a little arbitrary", "label": 0}
{"text": "Oh i will. And I’ll have 4x of that left over to put in my savings don’t you worry.", "label": 0}
{"text": "“AI is useless.”\n\n“AI can’t do any professional-level work.”\n\n“AI is just a toy.” \n\n- This subreddit every single day", "label": 0}
{"text": "First sentence of the article you’re commenting on, my dude.", "label": 0}
{"text": "This man secretly works for Tim Horton's. A timbit two bit snack saboteur", "label": 0}
{"text": "This seems pretty unremarkable, yeah?  Like it's on par with Ford and GM.", "label": 0}
{"text": "Was Disney producing anything other than slop recently anyway? ", "label": 0}
{"text": "At the beginning maybe.  But now Amazon is so full of shitty made up brands, filled with fake reviews I avoid it and prefer buying direct or local when possible.", "label": 0}
{"text": "And bringing them back in 2035 … maybe.", "label": 0}
{"text": "Begging for people to read the article. The subscription is for things like increased video quality and profile customizations. It won't boost your posts.", "label": 0}
{"text": "TLDR:\n\nInternational researchers have developed a way to re-create clinical trials of new treatments using ‘digital twins’ of real cancer patients. The technology, called FarrSight-Twin, is based on algorithms used by astrophysicists to discover black holes. They used the digital twin to recreate published clinical trials and found that all digital trials accurately predicted the outcome of the actual trials. While the research is yet to be peer-reviewed, the team says this approach could be used by cancer researchers to run virtual clinical trials before testing treatments on new patients, potentially helping them select the most suitable treatment ahead of time.", "label": 0}
{"text": "Ffffffuuuuuuuucccccckkkkkk those guys.", "label": 0}
{"text": "Lol. \n\n\"I must have huwt youw feefees\" is exactly the kind of ancient and boring ass play I expected from you. Nonsense deserves derision and you keep spouting it. That's all this is. \n\nI am honest with myself. You're demanding that I align my morals with yours - which I won't do because they're offensively naive - and admit to *your* idea of wrongdoing. Think about this for a second. The irony here is that I would have to lie to myself to do that. Lol. \n\nThe problem with the hypothetical is that it's never going to happen. It's pointless to consider impossibilities. People like supporting things they like. That's why the games industry still exists in spite of how trivially easy it is to pirate games. That's why I buy games I've already pirated. That's why Patreon and a dozen other clones of it exist. That's how charities function. Humans aren't going to stop throwing money at things they want to see more of. It's not going to happen. I won't entertain nonsense hypotheticals. You may as well ask me to consider the effects of DC's Speed Force merging with all of humanity in a discussion about the future of the aviation industry. This is complete fantasy bullshit. No. \n\n>You can only download games illegally because other people pay.\n\nAnd those people can only download games illegally because I pay. How many times do I need to tell you that pirates buy games before you acknowledge it?", "label": 0}
{"text": "Can we start prosecuting these people as what they are, traitors?", "label": 0}
{"text": "Because there is little waste which means you can trust the production lane.", "label": 0}
{"text": "I’m saying in exchange for none of that I would be open to a non-shitty model.", "label": 0}
{"text": "they need to start enforcing this for anti-woke people who review bomb movies and tv shows before they’re even out", "label": 0}
{"text": "Kinda hard to prove or enjoy.", "label": 0}
{"text": "Your data no matter what is for sale.\n\n\nYou can pay them but they still will sell it or it will be scraped because we have no privacy laws ", "label": 0}
{"text": "can confirm playable on yuzu💪🏾", "label": 0}
{"text": "So did the creator of Terminator movie decades ago", "label": 0}
{"text": "Money Over Everything", "label": 0}
{"text": "Don’t downvote the man. He is partially right.\n\nRegarding Elon Musk, there were reports that he attempted to unlock $40 billion in Tesla equity by proposing a loan structure. Instead of selling shares, which would trigger capital gains taxes, Musk sought to borrow against his Tesla stock for tax avoidance, as borrowing doesn’t create a taxable event. By using his shares as collateral for loans, he could extract liquidity without selling and thus avoid an immediate tax burden.\n\nMusk’s move was more about navigating tax loopholes within legal frameworks. And don’t forget the $55B bonus if the stock didn’t drop.\n\nTLDR; Musk planned to back out of the deal to avoid taxes & also a Tesla stock price drop for his $55,000,000,000 bonus", "label": 0}
{"text": "New fear unlocked.", "label": 0}
{"text": "There is nothing wrong that communication.\n\nYes he can do better and he’s improved but the baseline was fine.", "label": 0}
{"text": "It’s so pathetic how much Elon needs Trump and MAGA. He has no future without them and I agree completely that he’s gonna carry the torch on his dumpster fire of a social media platform.", "label": 0}
{"text": "Had a contractor offer me $2500 to remove a review.", "label": 0}
{"text": "yuzu works just fine on it i made it to Rumbla island just fine idk what version of yuzu they're using lol", "label": 0}
{"text": "And that’s exactly what’s meant by unregulated capitalism has own built in self destruction mechanism", "label": 0}
{"text": "Gym membership cancellations are so bad, they're a sitcom trope", "label": 0}
{"text": "Treason. It's treason.", "label": 0}
{"text": "Sorry to say I think you're probably using it wrong, I've never used it with Swift but it works great with other languages as long as you know enough to correct its mistakes.", "label": 0}
{"text": "No idea why your getting down voted. This is late stage capitalism. It's going to be subscription + ads + your data getting sold. All in search of the Almighty profit for shareholders.", "label": 0}
{"text": "Maybe the 50 billion hasn’t been touched because Satoshi is sitting on $200B from creating TSLA and SpaceX…", "label": 0}
{"text": "https://i.redd.it/jrb4e1wr9ll31.png", "label": 0}
{"text": "The US has gradually been introducing new sanctions on Russia for the past three years, they didn’t all come into force at once. I assume that the foundation’s actions are the result of new restrictions imposed on IT exports to Russia that went into force in September. Depending on how you interpret the sanctions, they could include the export of source code to people located in Russia. \n\nhttps://www.mofo.com/resources/insights/240618-the-united-states-imposes-new-sanctions?t#_ftn6\n\nHowever, from what I understand, the contributors were removed because they worked for companies that had been directly sanctioned by the US, so I gather that the foundation was spooked enough by the indirect link to sanctioned entities that they wanted to avoid the risk of unintended sanctions violations entirely. For example, if the contributor was being paid in their employer in part for their contributions to open source, this could interpreted as the Linux Foundation being the beneficiary of a transaction involving a sanctioned entity.", "label": 0}
{"text": "Downvoted cos asking for facts. Lol. Ah reddit.. dont ever change \n\nIt's one thing to dislike elon (i dont like him too.. especially after he namecalling the cavedivers who risked their lives rescuing the thai boys)\n\nBut it's another thing to simply refuse facts.", "label": 0}
{"text": "Making chips is super difficult and TSMC is really good at it and considered the leader currently.  No one has been able to dethrone them yet.", "label": 0}
{"text": "But…but.. Huawei said they make their own chips now! A Chinese company lying? No way.", "label": 0}
{"text": "My folks are big proponents of Linux so it’s nice to see it getting more popular, I used to play all these old ass computer games on the Linux we had when I was little", "label": 0}
{"text": "I wonder if this means Amazon will have to go through their store and purge hundreds of thousands or potentially millions of fake reviews from products.  I would be so so happy if this happens, and as a result, all the cheap Chinese crap disappears from the store because there will be no fake reviews left to prop them up. ￼", "label": 0}
{"text": "Can I get $51,744 for writing a legit review. Ya know to keep the universe balanced.", "label": 0}
{"text": "I mean… isn’t that the point?", "label": 0}
{"text": "It’s unreal. Uncanny valley", "label": 0}
{"text": "Yet another traitor", "label": 0}
{"text": "same like twitter blue", "label": 0}
{"text": "Yeah, your opinion is my concern here.", "label": 0}
{"text": "Current felon, born with a silver spoon in his mouth. Do you need some mouth wash?", "label": 0}
{"text": "Kinda weird here- I don’t like it. Can we pick some people with morals to prop up next? lol", "label": 0}
{"text": "Yeah that kinda telling...\n\nEven trump's kids love their dad (maybe dad's money.. but they seem to be nice to him at least)\n\nBut elon's kids.. yeah. Like not even money can do anything", "label": 0}
{"text": "It hasn’t spurred a “debate”, it has spurred Russian bots, trolls. and activists to stir up controversy and spread misinformation because that’s what they do best. This is merely about legally binding adherence to international sanctions and failing to do so would be much more damaging and costly to Linux as a whole than keeping these Russian devs even assuming they’re not bad actors and great contributors.", "label": 0}
{"text": "What do you mean?", "label": 0}
{"text": "Both of them are nepo-babies, ya mook. Donnie's daddy gave him his money to become a real estate tycoon, and he blew it all on shit investments. So then his daddy kept selling off pieces of his empire to keep his son afloat so the world wouldn't know what a complete and utter fuckwit his son was. Leon's daddy owned an emerald mine in South Africa, so literally the beneficier of hundreds of years of colonial exploitation and apartheid.  The only reason those fuckwits have any money is because their daddies had money. \n\nLeon got lucky betting on PayPal with his daddies money. At the time, everyone and their mom were trying to figure out pay-over-internet because they saw how lucrative it would be. PayPal got a critical mass of market share first, but not because of some genius business plan from Leon, but because PayPal was lucky enough to get a critical mass of market share first. If it wasn't PayPal, it'd be some other startup, and you'd be slobbering the knob of some other tech billionaire, maybe even one with talent. \n\nThey're both weak men who pretend like they're strong, and the only ones who believe them are other weak men who think their pretense is what strength looks like.", "label": 0}
{"text": "Actually that’s just a myth. In reality, the state of cancer causes California.", "label": 0}
{"text": "How does he need Trump and MAGA? He is one of the richest people in the world. He has more public accomplishments than most of us could ever dream of. He is a generally well thought out person who has been put in the spotlight because of his success. There is a reason no one wants to be prime minister or president and it is this. People hate whoever they can.\n\n\nBut I can't say that.... ", "label": 0}
{"text": "Dude are you brain dead? 😂 you have to consider the ethical implications of those decisions. Just because a CEO can generate significant value doesn’t mean their compensation should be disproportionately higher than the average worker especially if it comes at the cost of layoffs or reduced benefits for employees. Using Microsoft products doesn’t mean people can’t criticize the company’s practices. It’s possible to appreciate the technology while advocating for fairer treatment of workers and more equitable business practices.", "label": 0}
{"text": "Statistics rarely represent reality, they often represent the biases of the methodology.\n\nIf we use rape as a statistic, the vast majority of reporting will show an overwhelming bias towards men as rapists. Conversely the vast majority of people who forced someone to penetrate them were women. These are two different statistics but both represent sexual abuse. \n\nSo someone doing a study today based on historical data before “forced to penetrate” was considered “rape” means there will always be a statistical bias which will show a significant gap between male and female perpetrators of “rape”.\n\nOr the racial biases of policing in marginalized communities vs high income communities, or even rural vs urban based on population density.\n\nThese aren’t realities, these are biases in methodology and the collection of data, and the application of those statistics are inherently flawed and should be heavily criticized. But llms merely regurgitate whatever they’ve been trained on, so they will never address disparities because they have little to no context about what the words mean and how the definitions of those words have changed.", "label": 0}
{"text": "jfc man you're missing the point completely", "label": 0}
{"text": "Corporations are people under the law (thanks repugnicants)", "label": 0}
{"text": "So sick of this crap", "label": 0}
{"text": "This cutting people jobs, and then giving yourself a raise thing just never looks good. How the hell are these people STILL able to do this and not be removed? It feels obvious that their interest isn't in the company, but their own wallet. Like painfully obvious, do we really just live in a shitty simulation?", "label": 0}
{"text": "You are so right. They are preparing the ground for the rumoured trump abuse of a minor on tape. They did not, and do not, give a fuck about the deepfakes of Kamala that even Elon is putting out", "label": 0}
{"text": "No, just that the AI team had a lot more to do with those number than his fearless leadership.", "label": 0}
{"text": "Hope everyone here has a bad day", "label": 0}
{"text": "This is a typical mode of operation and has been for sometime. Company doing bad layoffs no work. Companies doing good layoffs increase efficiency.\nLayoffs = ceo bonuses", "label": 0}
{"text": "Guess they should applify all the news on his crimes. ", "label": 0}
{"text": "Who decided to build and invest in the AI team ahead of their peers and competition? And you do realize even before their stake in Open AI they were a $2T+ company (still 7x when he joined)?", "label": 0}
{"text": "It’s a power of 2, minus 1. The margin of this comment is too large to contain the full number.", "label": 0}
{"text": "It really begs the question of as to what the companies true motives are when they do stuff like this. Maybe there was a CEO previously who was okay with not being paid as much so they made their environment more lenient, then they moved on and then this person took over and thought they weren't being paid enough? Is that how situations like these happen because they seem to happen all too often I guess is what I'm trying to get at.", "label": 0}
{"text": "Yea, this headline seems a little gaslighty....", "label": 0}
{"text": "We all complain about it, but we can't do anything about it. The guy should be fired because of the layoffs. I hate this whole fucking business of paying a CEO absurd, obscene money.", "label": 0}
{"text": "The USA sanctions don't prohibit communication with Russians and the USA government didn't ask the Linux Foundation to do anything.", "label": 0}
{"text": "The truth in reality is scary enough, throwing more gas in a dumpster fire doesn't keep the trash from burning.", "label": 0}
{"text": "Grab em by the pussy.", "label": 0}
{"text": "Despite? Because of.", "label": 0}
{"text": "A group of peers is not friends. There’s tons of competition and infighting among these groups just like any group. Directors represent other shareholder and stakeholders interests and have zero incentive to pay someone a salary because they’re buddies. If they don’t another company will pay them though so it must be competitive or you will end with who’s willing. \n\nI don’t disagree that it’s wack but the market isn’t distorted it’s doing what it’s meant to do. Regulation might be lacking but I would look at Europe as a cautionary example of ineffectively handling the issue in a world of global competition.", "label": 0}
{"text": "But it isn't true.", "label": 0}
{"text": "his admin could most probably do a better job than him, they know more, they have better contacts and they make 150K a year tops.", "label": 0}
{"text": "I appreciate the answer. I'm still a little confused of course, but if this is the typical mode of operation, that DOES explain why it keeps happening, lol", "label": 0}
{"text": "Xiaomi founder Lei Jun is one of the most passionate CEOs. He worked only on car business after 2021. One of the fun stories is that he learned how to drift so he can understand how to build a sport car. He also tested SU7 ultra himself in Nurburgring.\n\nLei Jun Drift\n\n[https://www.youtube.com/watch?v=Wfvxi6bH9R4](https://www.youtube.com/watch?v=Wfvxi6bH9R4)", "label": 0}
{"text": "The people voting for Trump don’t really care what he does or says. They are voting to dismantle this nation and institute a Christo-Fascist state.", "label": 0}
{"text": "Sanctions don't prohibit all interactions with Russians.", "label": 0}
{"text": "Don't need Russia for Kamala to lose, she says enough on her own.", "label": 0}
{"text": "Apple Intelligence is a ____ joke. \nThis is where they have failed considerably and what Google has done with their AI is what Apple should have done. I have latest iOS and it Apple Intel SUCKS", "label": 0}
{"text": "This is Intel's frame of thought now. Fire everyone and save money.", "label": 0}
{"text": "Read the article. Hacks against privacy for example.", "label": 0}
{"text": "private businesses don't 'censor' you fucking illiterate grandstanding bumpkin. you can't build a legal case on the strategy of stamping your little feet and sniveling \"but it's not FAIR.\"", "label": 0}
{"text": "Well aware but that doesn’t change the market. Look at how the perceived value of running backs has sharply declined over the past decade.", "label": 0}
{"text": "He should be terminated.", "label": 0}
{"text": "He made $18,000 MORE for every person laid off. \n\nThat should be shameful and a sign of executive failure, not a reason for a RAISE.", "label": 0}
{"text": "Eat. The. Rich.", "label": 0}
{"text": "How the fuck can someone else give permission to use a dead person", "label": 0}
{"text": "Their hitman is on the clock", "label": 0}
{"text": "We will take our chances of that never happening.", "label": 0}
{"text": "Bottom line is this, his workers should make more and he should make less. Balance it out a little bit. No one needs that much money", "label": 0}
{"text": "isn’t that the intent?", "label": 0}
{"text": "Wait until he discovers what the Google search results for  \"Santorum\" (R) describe.", "label": 0}
{"text": "what is sad is that it is a fake claim, and Bailey knows it is a fake claim.   He doesn't want the algorithm.\n\nIt is just an election stunt, because Bailey is basically begging Trump for a position in his cabinet, like federal AG I guess?\n\nIt is absolute bullshit, a terrible selfish act by a terrible person. Shame on him.", "label": 0}
{"text": "I googled “world’s dumbest fuck” and the top result had nothing to do with Donny, so I have to agree that something is off with their algorithm.", "label": 0}
{"text": "why worry about giving consumers quality when the industry is already monopolized?", "label": 0}
{"text": "\"they're following the rules that they themselves set\".\n\nYou and I are playing a boardgame of monopoly. I make the rules in my favor, and we both play by those rules. I'm just playing by the rules like you!", "label": 0}
{"text": "He probably got the pay raise *because* there were so many layoffs.  His salary is based on profit - it is not based on how people feel.\n\nI'm not saying its good, I'm just saying every single decision these corporations make is related to dollars.  Nothing else.", "label": 0}
{"text": "So what?  First amendment rights. Corps are people too right?  Fuxjinf bunch of hypocrites", "label": 0}
{"text": "Stock is up", "label": 0}
{"text": "Exactly. SCOTUS wrecked us with that ruling. I wish we would remove lifetime appointments for them. You may already know this and this is for others, some of the justices are still politically active. Thomas is one who I dislike the most.", "label": 0}
{"text": "My brother was one of those let go", "label": 0}
{"text": "if a bunch of other computers can do it too then what makes this one so special?", "label": 0}
{"text": ">the actual content of the discussion\n\nThis discussion is about semiconductors.", "label": 0}
{"text": "I thought this was News of the Stupid", "label": 0}
{"text": "Hmmm, maybe this is the case for endgame players. I am honestly just playing casually, so I never get to the parts where money has any real value. At least I have no idea what I could buy with it which would make the game more enjoyable for me.\n\nAt some point I get bored and jump over to FF14 and later back again. So I never get to the endgame parts, or let's say that, when I jump back again, there is so much new content available, that I, again, do not make it to the endgame parts before getting bored again \\^\\^'", "label": 0}
{"text": "The raise was *to* 73 million, not a raise *of* 73 million. 73 million / 1.63 = 44.8 million, a difference of 22.8 million. Divided by 2550 employees is about 11k per employee.\n\nStill, think about it that way: \"Every employee I chop is another 11k in my pocket\"", "label": 0}
{"text": "Because we're trying to figure out the net number of jobs created or eliminated. Acquiring a company doesn't actually create any jobs.", "label": 0}
{"text": "A few months ago a post on the official instagram for the game Zenless Zone Zero had posted an image, which on the app version of instagram used AI to expand it to a square shape. People figured out that is likely wasn't the social media team using AI like that on purpose, but Instagram fucking around (There was also a non-cropped non-AI official version of the art used which proved that it wasn't intended to look like how it did).\n\nI have no idea if this link will post, but here's a forum post (with AI-generated text, annoyingly enough) which shows the instagram-expanded parts of the post. Only sharing this since the reddit thread was deleted and can't view the attached images there now. [Forum post with example.](https://www.icy-veins.com/forums/topic/81307-is-hoyoverse-using-ai-in-zenless-zone-zero-promotional-material/)", "label": 0}
{"text": "I find the implicit thought that all of these employees were actually good and capable of their jobs, unconvincing.\n\nSome probably were, but everyone has worked with people who just cant do the job.  2500 out of Microsoft's headcount is miniscule.  This is pretty silly.", "label": 0}
{"text": "You know too much", "label": 0}
{"text": "> We all complain about it, but we can't do anything about it.\n\nThere's always something that can be done.", "label": 0}
{"text": "If the process is anything like extracting gold from seawater, it will never be economically viable.", "label": 0}
{"text": "I mean its whole purpose is for that. To close vulnerabilities before the wrong actors exploit them", "label": 0}
{"text": "What ever happened to free speech? Only applies when you want to say something dumb or wrong and can’t fathom being corrected. While others can’t say or do something that you don’t like.\n\nYou know for the party that calls others “snowflakes” they do Karen about everything that does agree blindly to whatever shit falls out of their mouths.", "label": 0}
{"text": "I doubt it. Most posts that are going to go for extreme headlines will most definitely be torn apart as soon as it enters the playing field. No one is going to believe a picture or video of either candidate using a tank to mow down the street. Well... For at least one candidate that seems abnormal. The other... Probably just another day at the golf course.", "label": 0}
{"text": "Every time it becomes blatant how unsustainable capitalism is, rich people default to fascism.", "label": 0}
{"text": "73 million smackarinos a year for conferences and meetings. F that.", "label": 0}
{"text": "It's because of the way these boards set up pay packages for CEOs. They need to hit certain profit or revenue goals. These CEOs don't do what's best for the company or it's employees or even its consumers so long as they hit their goals.", "label": 0}
{"text": "I remember a couple years ago his bonus was based on Game Pass growth but when they didn’t hit the numbers they just changed it so he got the bonus anyways. lol", "label": 0}
{"text": "> despite\n\nlol.\n\nhe got the raise BECAUSE of the layoffs", "label": 0}
{"text": "He must work very hard!", "label": 0}
{"text": "It’s crazy that their paychecks, whether biweekly or monthly, are still more than a good percentage of the populations entire yearly pay. If their paychecks are monthly, that monthly pay is higher than the average yearly pay. Fuck that.", "label": 0}
{"text": "Are you Satya? Or a family member? Microsoft is not leading sh*t…..", "label": 0}
{"text": "Googles lawyers wouldn’t even need to get out of bed to crush this", "label": 0}
{"text": "my mom did a bunch of my comics smh... still luh her tho lol", "label": 0}
{"text": "Conjunction Junction, what's your function?\nHooking up two boxcars and making 'em run right.\nMilk and honey, bread and butter, peas and rice.", "label": 0}
{"text": "Oh no I'm so suprised and shocked I can't beleave it who would have seen this coming *i saying in a very monotone non suprised voice with my eyes rolls*", "label": 0}
{"text": "Alphabet gives tons of money to liberal political candidates. And their ai software is racist. Who would be surprised by this.", "label": 0}
{"text": "I've worked pretty closely with various Microsoft teams over the years and since 2023 it has been pretty terrible for them in terms of layoffs and responsibilities getting dumped on the remaining team members. Its rare to meet a Microsoft FTE and they not be exhausted and wrung out these days.", "label": 0}
{"text": "Yeah when you put it in perspective, it makes zero sense that anyone makes over $10 million a year. I say $10 million to humor capitalists. The reality is, no one needs to make over $1 million a year. It’s obscene.", "label": 0}
{"text": "For anyone wondering that's $28627.45 per layoff", "label": 0}
{"text": "Trying to understand is your example with car navigation not waymo? Or are you referring to something else?", "label": 0}
{"text": "Adguard on mobile just uses DNS right?  Just use a different DNS server that blocks ads.", "label": 0}
{"text": "Glad he’s focused on the real issues affecting citizens of Missouri.", "label": 0}
{"text": "Even if each of those jobs was paid 100,000$/year which they didn't - they likely cost the company more, that's a savings of 255 million dollars.\n\nSatya got a bump of 29 million dollars, so basically 10% of the savings.\n\nSeems like a decent finders fee.", "label": 0}
{"text": "Jealous much.", "label": 0}
{"text": "But why should the CEO get rewarded for hiring those guys to begin with? Or okaying those projects/parts? If they deserve to be fired for not being profitable/wanted…why doesn’t the people who okayed it …take accountability and leave with them?\n\nFunny how people like you always think anything good happens…it’s because of the people on top….if anything bad happens…it’s the bottom level people", "label": 0}
{"text": "Can't wait to see The Revolution hang every single last one of these CEOs from their own \"golden parachutes.\"\n\nEat. The. Rich.", "label": 0}
{"text": "Whether they do or not, and I personally doubt that they do, there's nothing illegal about doing so.", "label": 0}
{"text": "Honestly it's a pretty easy temporary solution to avoid this crap. Stay off social media and get your news by visit the main outlets or just under the news section in various search engines.", "label": 0}
{"text": "Honestly, at some point it's mostly for fun. It might help advance some branches of math a tad, but thats an added bonus.\n\nSome people enjoy following sports, and get excited by who wins the championship. Why can't math be the same way? There's a certain puzzle solving aspect to designing algorithms that can efficiently search for large prime numbers. Some find it a fun challenge. Discovering a new largest prime is exciting to some in the similar way to a swimmer breaking the world record is to others. I enjoy both. \n\nInterestingly, there is another sports analogy here. Just as money can advantage those in the sports world (people with means can often afford better trainers, equipment, etc), money played a role in finding this prime. The person who found it spent fortune on computer time (several million dollars). Most amatures cannot afford to spend that amount on the search. Historically, one of the great things about the Great Internet Mersenne Prime Search, was that anyone could get involved and make a contribution. Anyone had a chance of finding the next prime. But now, that might have changed. To be clear, I find no fault with the person who found the prime.", "label": 0}
{"text": "To be fair, it was worth trying and Reagan should be thought of as a pioneer for having executed it.  But it failed. Hard.  As a society, we need to admit that failure and move onto more realistic options.", "label": 0}
{"text": "Does the increase headcount count the Activision employees which would be part of that(", "label": 0}
{"text": "Nobody can escape that asshole Trump. He's everywhere. Give me a fucking break.", "label": 0}
{"text": "How come people can't praise a steakhouse anymore?\n\nNow you guys will bash me if I say my favorite fast food burger is a quarter pound with cheese?", "label": 0}
{"text": "When it goes to shit they get a nice golden parachute and move on to the next company to maximize their quarterly reports.", "label": 0}
{"text": "Ah the good old memories of mechanical drawing class in middle school", "label": 0}
{"text": "Interesting take Russia, please tell us more.", "label": 0}
{"text": "Hoarding wealth and impoverishing thousands in this way, how does he ever feel safe appearing in public?", "label": 0}
{"text": "It's usually cheaper for them to laterally transfer employees where possible rather than hire new ones. They still hired a net 7k new roles but you can't just shoehorn an acquired accounting team from a merger into suddenly being a software engineering team.", "label": 0}
{"text": "It could possibly be a bug but 100% apple will frame it as working as expected and sends it as an enhancement request.\n\n\nThey're looking for like if 5+10=13", "label": 0}
{"text": "Hey now, the McDonald's Quarter Pounder with cheese is the best burger in the US over $20.", "label": 0}
{"text": "Different industries, most did not return to the energy industry.", "label": 0}
{"text": "He got $11064.5976/ laid off employee. That's not much. He should have got at least twice that.", "label": 0}
{"text": "Wow so interesting, thanks for sharing! That's wild.", "label": 0}
{"text": "whats up with all these tech ceos being of indian origin?", "label": 0}
{"text": "that might have mattered 30 years ago before 1/4 of the country got their news from facebook.", "label": 0}
{"text": "It's a default sub with nearly 20 million subscribers, you can bet the majority of people don't even know shit about technology, much less anything else", "label": 0}
{"text": "Now will people in the US and understand see that unions are a good thing and not a bad thing?\n\nThis would never happen in countries with strong unions.", "label": 0}
{"text": "You've got the chops to be a shitbag CEO.", "label": 0}
{"text": "What are you trying to say here?  The value in a CEO comes from their connections, their ability to organise and dictate movement, and their ability to make the right choices under enormous pressure.  This value can pretty typically be measured monetarily, especially after a few years in the job, it might not be 100% accurate but it’s good enough.", "label": 0}
{"text": "What law is Google breaking?", "label": 0}
{"text": "Eh, the ruling about companies having free speech rights wasn’t exactly novel. It’s kind of like the immunity ruling. It might really piss some people off and it might have kowtowed to interest groups more than necessary, but it isn’t as outrageous as you’ve been led to believe\n\nDobbs was super outrageous and completely out of left field", "label": 0}
{"text": "Too much outrage in these comments. CEOs pay is attached mostly in the stock value of a company.\n\nI don’t see a problem here. This is how the economy works.", "label": 0}
{"text": "This article is misleading. I’m against crazy executive comp. His salary is only high this year because the stock went up. He didn’t give himself a raise.", "label": 0}
{"text": "Found it! \n\n    public static void SearchResult(Trump) {\n         System.out.println(\"Trump is weird\");\n    }", "label": 0}
{"text": "It's like Thanos absorbing peoples power, except it's a CEO stealing people's salaries", "label": 0}
{"text": "Putin makes too much money", "label": 0}
{"text": "The headline isn’t a quote.\n\nThis is an offer to whitehats to find vulnerabilities.\n\nThis is what they should be doing, lol.", "label": 0}
{"text": "Everybody is selling AI these days, but does anyone actually want it?", "label": 0}
{"text": "If they manufactured cars with the same safety standards as us cars, *and* their software didn't spy on you in the car I'd have no problem driving one. I really just can't get past the fact that I'd have big brother in my car. I know the NSA spies on us and China hacks our companies, but just willingly buying a car that you know for a fact has Spyware is too far for me.", "label": 0}
{"text": "Goddamn the man’s biweekly is 2.8 million. I too like\nMoney but holy that a little wild", "label": 0}
{"text": "Should we get rid of cars altogether so that we can get back jobs for stable boys, hay farmers, and carriage drivers?", "label": 0}
{"text": "Also not mentioning that after the Blizzard acquisition there were probably a lot of redundant positions.", "label": 0}
{"text": "Microsoft stock is up over 26% in the last year, so he’s been doing a pretty good job.", "label": 0}
{"text": "Pay isn't an indicative of how much work you do - it's indicative of the monetary value your work produces for the company.", "label": 0}
{"text": "I disagree. If I search for, convicted felon ex-president, I always get results with Trump on Google.", "label": 0}
{"text": "Damn the median salary in the US is just below $60K, no one can convince this man works 1,216x harder than the median worker.", "label": 0}
{"text": "They make all the high-level decisions, and we get to pay the price for the bad ones, while they pat themselves on the shoulder and give themselves raises. I’m sick of it.", "label": 0}
{"text": "Thank you for the new reading materials!", "label": 0}
{"text": "Bro Microsoft stock price was $30 in 2012 - before Nadella even took power. Since he took power the stock 10xed. Without AI their stock still 5xed. He's been an amazing CEO for Microsoft. So \"not long ago\" was 12 years ago.", "label": 0}
{"text": "Also, the CEO wasn't paid much before this either.\n\nIf he needed a 63% raise to earn $73m now then you have to wonder how little he earned prior. Microsoft is one of the biggest companies on earth, I would've expected him to be paid much much more than that already.\n\nHe was making what, $30m (i'm not good at math) per year before this?\n\nLook at the highest paid CEOs and what they earn, https://aflcio.org/paywatch/highest-paid-ceos", "label": 0}
{"text": "You know it’s not out yet right…?", "label": 0}
{"text": "Rarely lies? He told more than 30,000 lies while in office. How is that rare?", "label": 0}
{"text": "It doesn't matter how hard you work - that's not what decides how much monetary value you generate for the company.", "label": 0}
{"text": "Isn't that what democrats acuse Elon Musk and X of being? Politically biased.", "label": 0}
{"text": "Also you never know how safe your driver will be. I’ve been in some absolutely TERRIFYING Ubers before.", "label": 0}
{"text": "My bonsai tree has more brain activity than the MOAG.", "label": 0}
{"text": "Really? Last I knew shareholders own Google, not the government", "label": 0}
{"text": "Lmao you think the pet thing wasn't completely made up?", "label": 0}
{"text": "Sort of. A 63% raise to 73M implies it was at about 43M earlier, so thats $30,000,000, spreading it out over 2550 positions is a little less than 12k per person.\n\nThat said. Im pretty sure no one else at the company got a raise over 50% that year.", "label": 0}
{"text": "By that logic, laying people off from acquired companies wouldn’t be eliminating jobs either then. And the figure of 2,500 people laid off wouldn’t be the correct number to use for determining if more were hired than laid off.", "label": 0}
{"text": "Hey! That’s my atm pin. Now I gotta change it.", "label": 0}
{"text": "Why? The incentives are different, so why wouldn't it be different?", "label": 0}
{"text": "At this point just add it to the already huge pile of evidence that he's unfit for office.", "label": 0}
{"text": "I guess you don't understand how compound interest works. I work as an engineer at a similar company to Microsoft and make around $200K a year, which is a bit below board for that position, and I invest maybe $60K a year into the markets. Assuming I get no additional bonuses or pay raises and retire at 60 (30 years out), my net worth simply on my brokered investments will be right at $10 million assuming 10% compounded returns. If I worked until the regular retirement age of 65, I will be worth about $15 million.\n\nThis is ignoring any other investments I might have like property or land.", "label": 0}
{"text": "Who said anything about being a solo engineer? We’re in agreement here. Tech is one of the few industries where “being good at your job” can make you incredibly successful.", "label": 0}
{"text": "This shit is not good. This satellite was in geostationary orbit, this is *way* out there. This debris will take thousands of years to come down. It is less busy in those orbits, so it presumably will be less dangerous. But still, holy shit", "label": 0}
{"text": "probably not, but that is unknown.\n\nIt's a Mersenne prime, meaning it conforms to the formula 2^n - 1. all of the largest known prime numbers are Mersenne primes because there is a formula or algorithm or something that you can follow to confirm it's prime, which dramatically reduces the computing time.", "label": 0}
{"text": "No clue. This is a pretty consistent trend though. Microsoft increases headcount nearly every year and hasn't cut headcount since 2016.\n\nhttps://stockanalysis.com/stocks/msft/employees/", "label": 0}
{"text": "And currently the only burger with an active FDA investigation into a Listeria outbreak. Thats a fine pedigree!", "label": 0}
{"text": "Why?", "label": 0}
{"text": "Lidar can drive in a blizzard and covered roads that you can't see the lines?", "label": 0}
{"text": "Adding taxis to traffic congestion isn’t the solution to the problems you have.", "label": 0}
{"text": "And first amendment protects people against government", "label": 0}
{"text": "I know it's fun to rail on CEOs but as a worker the difference between a good and bad executive is night and day. My current company got a new CEO a year ago and also a new exec was hired to be in charge of my area of the company. Went from being on the verge of quitting to actually enjoying working here.", "label": 0}
{"text": "Well it was gradual. It's been going hard since the 80s but really it was inevitable since the beginning. This land was stolen by rich white slave owners and set up to benefit rich white slave owners. Only now we're considered workers because we get \"paid\" for our labor", "label": 0}
{"text": "This is his trump cabinet application", "label": 0}
{"text": "Now how long would it take to write it on the post-its and type it all out and type it out once more for confirmation.", "label": 0}
{"text": "What’s more valuable, the captain of the ship or 10 crew hands? \n\nFAANG CEOs earn their pay", "label": 0}
{"text": "so you type 5 + 10 = 15  then you do 100 / 3.2 = 31.25 then you can collect the 15 from the history and still use the 31.25 without copy and pasting or typing one of them?", "label": 0}
{"text": "It's a grift to pump up stock prices.", "label": 0}
{"text": "It will only affect Harris. The slugs wont let anything stop them from voting for papa slug.", "label": 0}
{"text": "[Matt Parker did write it out on his Stand Up Maths video](https://www.youtube.com/watch?v=zsyGRDrDfbI)", "label": 0}
{"text": "I single-handedly rolled out over 20 different customized sticker designs for a small team in my work that just wanted something fun to stand out with, despite having incredibly minimal experience with AI, photo editing or label making software in general. \n\nAnd also saved me from digging through and understanding the process for particular way of splitting an Excel workbook and instead just iterated on my question until it worked exactly as I needed it.", "label": 0}
{"text": "Despite? You mean because...", "label": 0}
{"text": "Any process for identifying new viruses now is superior to this tool. Don't forget there is a certain sunset of these findings that will be hallucinated.\n\nAnd it's not sheer randomness, that doesn't even exist in the digital realm. It's randomness within certain parameters.  \n\nLet's imagine you told the ai to find all the ways to build a house using only the materials that one would use to build a house. But when it came back, it would have put the ceiling as the roof and the roof as the ceiling along with 30k slight variations of this because it doesn't actually know what the fuck a house is, and because it fit within the parameters, each of these 30k variations of building a house would fit properly into the accuracy measurement. Ie, it didn't include material that would not be used in building a house. \n\nIs it technically correct? Yes, but also useless because no one would use ceiling material to build the floor. That is clearly what is happening here just replace a house with a virus.", "label": 0}
{"text": "I think you mean to say it rose 63% BECAUSE of devastating lay offs.", "label": 0}
{"text": "Because they are lying.\n\nThere are millions of people who would love to be able to purchase a 2-door economy car that seats 4, but you don’t make as much money on that as selling that same person an F-150 Lariat for $70k.\n\nFord has done the math and they have determined that fuck you you’ll buy what they build and you’ll make a social media post about it (and your 8year loan at 12%).", "label": 0}
{"text": "It's complete opposite for me, I get the slowest drivers! \n\nGoing 30 in a 45, stopping at green lights because they are confused about the map telling them to go straight.", "label": 0}
{"text": "That's the tech cycle it's a good thing. Lots of smaller start ups will be coming out in the next couple years if VV backing is still there... However rumor has it VCs are not looking to hand out capitol like they did in 2020 it's really only the big players getting funding for AI ATM.", "label": 0}
{"text": "The median comp at Microsoft is $220K a year in case you were unaware.", "label": 0}
{"text": "Why didn't they just offer to bribe them? That would've worked, too.", "label": 0}
{"text": "It might be me, it might be you, it might be anyone in this thread. What is even this question, really?", "label": 0}
{"text": "I’ve been saying this a lot lately because it all makes sense, these people are all about pageantry. Performative politics is how you get those people on your side. You don’t have to actually do anything just look like you are. Hence the McDonald’s situation. This is why I blame their politicians more than I blame their base. They know that they are rubes and can literally get them to think whatever they want. And so they have to disastrous effect.\n\nI’m not trying to absolve your common Republicans of guilt, but it’s very clear to me that these people can be duped", "label": 0}
{"text": "Former president", "label": 0}
{"text": "Why are you pretending he didn't give another reason as well?  Did you not make it to the end?", "label": 0}
{"text": "Nice lie, it's not even out yet.", "label": 0}
{"text": "Well, it's apparently a good way to separate $2M from the hands of a former nVidia engineer.", "label": 0}
{"text": "Oh, you sweet summer child.  I hope you were at least chuckling to yourself when you typed \"rarely lies.\"   \n  \nAn actual fact hasn't passed his big mac tainted lips in decades.  Please stop with the \"media spin\" bullshit.  You don't have to spin a perpetual lie machine.  \n  \nHe is a liar.  That is a documented fact, and I refuse to believe anymore that his sheep don't know that.  You know he lies, and you like his lies.  \n  \nYou want him to keep lying because you like that he hurts the people that you hate.  Your life is owned by hate.   And that's the bottom line because Stone Cold said so.", "label": 0}
{"text": "All digits in which the digits sum to a number divisible by 9 is also divisible by 3, so that'll rule out a few more in a shorthand way.\n\nNumbers divisible by both 9 and 3 end in every digit, including 1, 3, 7 and 9.\n\nEg: 9 x 1237 = 11133. \n\n1+1+1+3+3 = 9\n\n11133 is divisible by 9, also 3.", "label": 0}
{"text": "https://www.youtube.com/watch?v=zsyGRDrDfbI\n\nMatt Parker also put out a good video on the subject on his Stand Up Maths channel https://www.youtube.com/watch?v=zsyGRDrDfbI", "label": 0}
{"text": "Now, he can work 2550x harder than they did", "label": 0}
{"text": "If they don't submit the right paperwork then uh, yeh perhaps they should be? Lol", "label": 0}
{"text": "Please, please try to outlaw Google in Missouri.  It would be epic.", "label": 0}
{"text": "Yes.   \nLiving for us at this point should be given. We should nurture the skills of people whatever they might be.  \nSinging, dancing, painting, math w/e brings them happiness since why shouldn't we? \n\nThe only reason we have \"you can't do what you like is profitable\" is because of reality that we live in.   \nAnd if we can change that we 100% should.", "label": 0}
{"text": "Wait till you see what happens in November….", "label": 0}
{"text": "I mean their whole point is to get people to read their site. If someone doesn't read their article they could probably give a fuck if they're misinformed or not", "label": 0}
{"text": "Sensor Trump?  Every news site has him on the front page.  You can't get away from him.  I hope I live to see the day when Trump is no longer a story.  I think even after his death, there still will be revelations about what he did.  Ugh, then to think of Barron getting into politics.", "label": 0}
{"text": "My ‘14 fiesta ST was the best car I ever owned. The only things I changed were carbotech brake pads/rotors, and I added an oil cooler and racing radiator to make sure the turbo always had cool oil coming to it. I could race all the way up Pike’s Peak with the ac on without overheating.\n\nVery nice car. Would buy again.", "label": 0}
{"text": "So in generous terms, 500 to 700-ish employees were laid off just to pay this guy.\n\nWhat a fucking joke.", "label": 0}
{"text": "I think they can afford it", "label": 0}
{"text": "I agree.  I searched for the worlds biggest, ugliest, fattest, most despicable excuse for a human being.  Trump was only 5th.  The algorithm has been manipulated.", "label": 0}
{"text": "Ben and jerry used to have a ceo cap salary and bonus.\nThey could get as high as they wanted but we're capped at 150 times lowest hourly wage. So if they wanted bigger salary they needed to increase wages for everyone and still make a profit. Not sure if this is still true.\n\nIn 40 years working for corporations. The typical play is buy a company , merge them in. Fire a bunch of folks. Repeat,then sometimes split off new companie,s fire a bunch of folks repeat merging repeat splitting dumping and adding  folks as you go. On occasion have a hiring spree but then continue on and on occasion fire a bunch of folks.\nOr maybe move two thousand folks to some small town. Then three years later close and sell the office and leave the employees behind. \nThe new CEO play book for each of these are the same. \nSell offices, cut benefits, sell assets, fire people, offshore cost centres claim profit collect bonuses.\n\nI worked for at least two dozen managers across several organizations across three companies and never once changed my actual job , though I was renamed and reorganized and moved several times.\nIn the end all processes and procedures work as long as the employees care, management actually believes changing the name of a team, means something has been accomplished.\n\n\n\n\nSorry i have seen a lot done in the name of synergy lol", "label": 0}
{"text": "Trade secret.", "label": 0}
{"text": "Too big fail isn't someone overspending on their credit card. \n\n\nIt's, the damage this company collapsing would do, would cost significantly more to the country than us bailing it out. \n\n\nThat's why you regulate, to stop allowing it to gett to the point of failure. ", "label": 0}
{"text": "Definitely a jackass, but surely they got paid more than $10,500 a year.", "label": 0}
{"text": "Sucks to be Trump then", "label": 0}
{"text": "Truly make it make sense. Some one, spin this for me. I don't get it outside of \"ha ha fuck you cause I can\".", "label": 0}
{"text": "s/despite/because of/", "label": 0}
{"text": "Imagine being so useless they don’t even replace you with someone better, they just fire you lmao", "label": 0}
{"text": "Oh so what they have on Kamala is that bad huh?", "label": 0}
{"text": "I use Waymo over Uber/Lyft in SF, because I actually feel safer in them. \n\nUber/Lyft/Taxi Drivers go over the speed limits, have abrupt turning, accelerating/braking, looking at there multiple phones on the dash, smelly cars…\n\nThe last human driver I had was pumping the accelerator pedal so much I was getting sick. I mentioned something to him, but he didn’t speak english. \n\nI’m done with humans.", "label": 0}
{"text": "How does this benefit the company and shareholders?", "label": 0}
{"text": "Can a deepfake be worse than Trump saying “Hitler did some good things”?", "label": 0}
{"text": "From the article:  \n  \n\"'Google is waging war on the democratic process. It's time to fight back,' Bailey [wrote on X](https://x.com/AGAndrewBailey/status/1849605767722131717), the social network owned by notable Trump supporter Elon Musk.\"\n\nAfter reading this, I had to wait a good 20 minutes or so to stop laughing enough to write my post.", "label": 0}
{"text": "he is literally a pathological liar he can't stop lying every time he opens his mouth, there are fact checks going back years literally showing that he's lied more times than he's actually said the truth", "label": 0}
{"text": "The number itself isn't significant, but sometimes the search for arbitrary things like huge prime numbers can lead to useful discoveries. In this case, it's the first time someone used GPU farms to discover a largest prime number, so maybe that process could be useful for a different purpose?", "label": 0}
{"text": "It's all bullshit, my guy. Every bit of it.  The system has been gamed, we just got to wait for the money to run out or the government to start giving a shit. So let's just wait for the money to run out", "label": 0}
{"text": "\"Ag....lorith. um alrogith..... Athgorilla.... Aw heck. Investigate Google!!!\"\n\nThat f'n mouth breather doesn't even know what an algorithm is let alone anything else. Mouth breathing cretin", "label": 0}
{"text": "Why is this a thing or why is it allowed?", "label": 0}
{"text": "Reddit has become full communists and Hamas supporters.", "label": 0}
{"text": "Your curiosity can take you directly to Amazon to purchase his book, or you could possibly reach him at his university email address.", "label": 0}
{"text": "People often say CEOs and athletes make way too much money, but they’re missing the big picture on how much value these people actually bring and why they’re paid what they are. Both roles require extremely rare skills, and if they were easy to replace, they wouldn’t command such high pay. It’s the scarcity and impact of their abilities that sets them apart.\n\nFor CEOs, their pay is mostly tied to company performance, so when they make smart moves, it doesn’t just mean profit—it creates jobs, drives innovation, and sometimes even impacts entire industries. Their decisions don’t just stay within the company; they fuel growth across the economy and benefit a lot of people beyond shareholders.\n\nAthletes, especially in European soccer, also have a massive impact. Teams like Manchester United or Manchester City are huge employers, from chefs and security staff to groundskeepers. A star player can boost ticket sales, media revenue, and tourism, creating a ripple effect that supports the entire local economy. When they succeed, it’s not just the team but the whole community that benefits.\n\nSo yeah, the high pay might look wild, but when you look at the bigger picture, these roles are worth it for the broad economic value they generate.", "label": 0}
{"text": "Because this hollow speculative economy is not sustainable. Money-movers generate very little in terms of actual tangible value. When they are generating a lot of money, something is going horribly wrong.", "label": 0}
{"text": "Probably cheaper to pay internet folks to find vulnerabilities early than to manage the fallout if they’re discovered too late.", "label": 0}
{"text": "It’s not a raise people.. it’s already agreed upon executive compensation for hitting performance goals. He didn’t just walk into the board room and ask for a 63% raise - Microsoft is doing better this year, hence the increased compensation from last year.", "label": 0}
{"text": "And funny enough Citizens United means that any argument accusing Google of making a campaign contribution by manipulating rankings fails", "label": 0}
{"text": "Bro gonna be a prime target after the callapse.", "label": 0}
{"text": "muh capitalism", "label": 0}
{"text": "And??", "label": 0}
{"text": "Yea, let's make 170,000 people unemployed!", "label": 0}
{"text": "Saying Trump rarely lies is the biggest lie I've ever heard. You need your brain examined.", "label": 0}
{"text": "Meanwhile on X algorithms go rampant disinformation and these folks dont bat an eye.", "label": 0}
{"text": "Fuck this guy. Then has the audacity to make posts on LinkedIn talking abo8t how people just need to be passionate about their jobs", "label": 0}
{"text": ">Clearly intentional, in reality we all probably agree or can find common ground on 90% of issues but they then lose power if we're not divided by fake news. \n\n\nThat 90% is totally meaningless when the remaining 10% is shit like siccing the military on your political opponents.", "label": 0}
{"text": "How did he pass the bar not knowing that its their right to cencor trolls on their own private platform? \n\nAsk8ng for freedom of speach on someone else's platform is like saying I should be able to paint a sign on your house.", "label": 0}
{"text": "Glad we are using this power productively", "label": 0}
{"text": "Fascists like these current Republicans are why everyone keeps saying AI tools are dangerous ", "label": 0}
{"text": "> Trump may ramble but rarely lies\n\nAnd that's how people keep supporting him, by *lying to themselves.* If you truly believe this, you are completely detached from reality. And looking at the rest of your post, you clearly believe a lot of inaccurate things other liars say. Why so gullible?", "label": 0}
{"text": ">Trump may ramble but rarely lies\n\nHOLY. FUCKING. SHIT? Is this for real?", "label": 0}
{"text": "You don't want to change captains mid sinking-ship.", "label": 0}
{"text": "I remember this ruling when I was younger and hearing how bad it would be but didn’t really understand why. Boy do I comprehend now.", "label": 0}
{"text": "228,000 employees to be exact. Well, it’s now a measly 225,500", "label": 0}
{"text": "I do think that it's a bit concerning when Google controls ~80% of Internet traffic\n\n\nAt a certain point it's more of a public utility", "label": 0}
{"text": "This is why people want to tax the rich. Back in the 50s the highest tax bracket was nearly 80-90 percent. That would dissuade a lot of this stuff.", "label": 0}
{"text": "Im growing more and more convinced the traditional studios are going to wreck themselves going down this route, and that some of the best live action work will be done on the lower budget level. \n\nthat being said, I could easily see disney \"filming\" live action material as basically black box theater, then designing one of these systems to basically animate over that. would basically just be a modern version of what they did on the earliest disney animated films, where most of the key animation was painted over live action material.\n\nthough god save us if people just adapt to AI slop", "label": 0}
{"text": "We really aren't, this is a 100% dumbfuck take.", "label": 0}
{"text": "And I’m sure those workers can go find other jobs with their skill set if it’s high in demand", "label": 0}
{"text": "Hah...Join the club.  \n\nAfter that he should get Coca Cola to give him their secret recipe.", "label": 0}
{"text": "What a deal!", "label": 0}
{"text": "Microsoft's PE ratio is still at 30x, which is well within the healthy range for the projected future earnings of a tech company. Even if the stock were to overcorrect, it would very quickly recover. Unless the company incurs cataclysmic losses, the stock price is never going back to $30.", "label": 0}
{"text": "To be fair, the article is also a few days old.", "label": 0}
{"text": "Fuck expansion, they need to get their pricing to a more reasonable level. I fail to see any good reason for why they're consistently 25-50% more expensive than Uber and Lyft in my city, despite having no drivers to pay.", "label": 0}
{"text": "If they did their jobs, nothing could disrupt them. Instead they’ve been collecting a check and self enriching so anyone will believe anything said about them.", "label": 0}
{"text": "The EvoSport was also built in India was had a lot of differences from the rest of the lineup under the hood.", "label": 0}
{"text": "So you want the government to use its antitrust power. \n\nIt's still not the government, it's still a publicly traded corporation.", "label": 0}
{"text": "30,000 pages of binary in 2 point font.  Let him prove it's not the algorithm.", "label": 0}
{"text": "Yes, it's totally Japan Studios fault that stupid dipshit suits stopped them from making fun games and had them develop fucking Knack which they did not even internally create because director was Mark \"dipshit\" Cerny. Maybe if you had let Japan Studios make their own ideas they would have made a good game.", "label": 0}
{"text": "Remember folks, the FTC only has jurisdiction in the USA. Be sure to use a VPN to setup a foreign homes account before submitting fake reviews.", "label": 0}
{"text": "I'm honestly surprised we haven't already seen a flood of deepfake videos during this election cycle.", "label": 0}
{"text": "To be fair, Microsoft has been absolutely abysmal at QA and support for many years now, especially for Windows and Office. That's nothing new. Can't forget about how they constantly change their enterprise offerings. A new admin panel! With new features! But it only covers 75% of the old features, and some critical ones are missing so you still have to use the old admin panel. Rinse and repeat until you have to go to 4 different configuration pages to properly manage one of their services. And if you're really lucky, the documentation will actually point you to the right spot instead of a deprecated page.", "label": 0}
{"text": "I actually did a calculation to see how much more expensive it is to do that. Turns out it’s about the same cost as owning and insuring a car. Besides, this person crashed their last 3 cars so I feel safer with them doing a ride service.", "label": 0}
{"text": "If I gorged on a consistent diet of corporate boot, I would probably say the same thing.", "label": 0}
{"text": "Cool, next we'll do Fox 'News', OAN, NewsMax, a myriad of AM Hate Radio liars across the country, Alex Jones and his ilk, and then we'll get into the crazies on YouTube.", "label": 0}
{"text": "*Texas would like a word*", "label": 0}
{"text": "Not sure what you think a CEO job entails, but Nadrlla's decisions generated billions in monetary value last year.", "label": 0}
{"text": "Does that cost extra?", "label": 0}
{"text": "Inb4 they'll make fedora ad-infested or harvest & sell your data.", "label": 0}
{"text": "Because of the leadership.  If you chase increasing profits at all costs there will come a time where the only way you can continue to do so is by cutting corners, and that's exactly what the previous leaders did.", "label": 0}
{"text": "Damn.. thank you for this snippet of insight into a world I barely understand, it's very interesting. If just the slightest bit depressing. It might just be my lack of knowledge on the subject, but buisness doesn't even seem good for the individual businesses anymore.", "label": 0}
{"text": "I'm sure both were in the cards.  Hack them first, then record when you bribe them, and you can move straight to blackmail on the next round.", "label": 0}
{"text": "It's your question, so you tell me.", "label": 0}
{"text": "…was it Optimus?", "label": 0}
{"text": "And he’s now looking forward.", "label": 0}
{"text": "Shoutout to GIMPS in Ireland!", "label": 0}
{"text": "I think you misunderstood my point. I’m perfectly aware how absolutely massive a number $250 billion is. The problem is that these companies have no issue laying people off to “save money” and in the same breath feel it’s reasonable to give their ceo a 63% pay raise. No single person contributes that much to a company and it’s laughable that people who will never come close to that level of wealth will boot lick the rich in the off chance they one day get the same chance.", "label": 0}
{"text": "Food for thought:\n\n\nIf we 'ate the rich', tracking jets wouldn't even be practical nor necessary.\n\n\nNecessity of the latter occurs due to lack of success in **doing** the former.", "label": 0}
{"text": "The entertainment industry crashing is in no way comparably to the crash of 1929.\n\nEntertainment is entertainment, that's it. Don't make it bigger than it is since it's not. We can live without it, we can't live without houses and money like the 1929 crash had as a result.", "label": 0}
{"text": "With the amount of misinformation that has been making the rounds since 2016, I don't see how this is now such a big issue. I love freedom, yes, but misinformation is out of hand.", "label": 0}
{"text": "ah, i was thinking it was a NEW bus related incident lol", "label": 0}
{"text": "Nope. It's a proper full-fledged blocker which uses custom https certs.", "label": 0}
{"text": "Ok, with that argument both Truth Social and X must be prosecuted as they spew disinformation and misinformation against the “radical” left. But no you wont agree cause that “free speech “", "label": 0}
{"text": "Are there any Democratic AGs demanding info on X's recommendation algorithm?", "label": 0}
{"text": "Milk it till there is a bit left", "label": 0}
{"text": "Gladly voted against him this morning! Hope we can get this freak out of office", "label": 0}
{"text": "Florida enters the chat", "label": 0}
{"text": "Androids have so many bugs and crash so often compared to iOS. It’s not even close", "label": 0}
{"text": "He is going to demand information about democratic voices being suppressed ever since Leon bought Twitter?\n\nIs he?", "label": 0}
{"text": "This.\n\nCEOs get paid to increase stock price & bottom line. Layoffs are only a consideration if a union might fight back.", "label": 0}
{"text": "LOL Are you joking? Try double or triple that.\n\nSource: Former Microsoft employee\n\nYou are being underpaid.", "label": 0}
{"text": "It's a bug bounty program.  specific for hackers that find vulnerabilities", "label": 0}
{"text": "you don't think it's common sense to be as efficient as possible? You don't apply that same principle in your life? \n\nNo wonder people are so bad with money if this is such a foreign concept to them and they equate it with bootlicking.", "label": 0}
{"text": "You are wrong. Top tier devs are in the half mil range. No one really gets paid less than 100k at a Microsoft job", "label": 0}
{"text": "Cmon guys. “Devastating?” They laid off 0.87% of their staff. That’s like a single person at most companies. \n\nThere’s the ethics of laying off anyone while increasing compensation for executives, but can we please have an honest conversation", "label": 0}
{"text": "Yeah websites modeled into becoming echo chambers dominated by single political ideologies or catered towards serving and reaffirming followers of a singular political party and infested with the said party's propaganda and any deviating thought is cast in mockery, ridicule and accusations of malice are really bad for the health of the society.", "label": 0}
{"text": "The tech industry is an absolute dumpster fire right now. I know fucking insanely good engineers who were let go. Some of the smartest people and highest performers I’ve ever met. \n\nThe low performers thing is bs. If anything it’s probably more to do with compensation rather than performance.", "label": 0}
{"text": "Trumps literally posting fake AI pictures of him self lmao", "label": 0}
{"text": "So then the ceo should be paid slightly more, not 300 times more than the average worker. Your stock won’t go up if people aren’t creating, building, etc… a sustainable, meaningful product. The ceo doesn’t work in a vacuum.", "label": 0}
{"text": "I do feel like Sancho watching the GOP and MAGA smack their heads into the side of a windmill after saying ' Please don't do that'\n\nAll we can do afterwards is say a smart ass remark, shake our heads and ride off on our donkeys", "label": 0}
{"text": ">human brains are infinitely more powerful than the most powerful supercomputers\n\nThat's not true anymore, the top supercomputers are close. They're a hell of a lot less efficient though, the brain consumes watts and supercomputers consume megawatts.", "label": 0}
{"text": "lol okay good luck", "label": 0}
{"text": "The layoffs were about 1% of their 228,000 employees and any \"savings\" was irrelevant to their $240 billion in annual revenue.\n\nBut sure, things are falling apart.", "label": 0}
{"text": "I'm not good at math but a 63% increase in pay means he was making around $48.8 million and was increased by $28.2 million to reach $73 million.\n\n$28.2 million / 2550 = $11,058...", "label": 0}
{"text": "I mean we could step it up and start culling them", "label": 0}
{"text": "Layoffs are a part of business. The larger the business the larger the layoffs. We live in an owners economy. \n\nOwners pay management to run a profitable business and they pay them more when the business is more profitable or has more revenue. It's that simple. \n\nThe problem with our system is we feel that by having no safety net it leads to a stronger economy with more innovation. That may not be true, but it's hard to argue with when the US has been the economic leader in the world for the last 80 years coming out of WW II.\n\nSo vote for universal healthcare and decouple that from employment. Vote for housing reform. Vote for more safety nets. In the end that is the only thing we can do. And hope that enough people in our society agree that we can increase our safety net without harming our economic advantage.", "label": 0}
{"text": "Yes, from what I understand.", "label": 0}
{"text": "I understand that. What I’m arguing against is the knee-jerk reaction to complaints of astronomical CEO compensation packages by people who retort that if a CEO makes X dollars, they are therefore “worth it” because money equals value. It’s circular logical that rejects any counterpoints because it’s self-validating. People talk about stocks and the price of goods the same way because they have been conditioned to accept that these terms are effectively interchangeable and while that may be true in a strictly economic sense, it holds much less water in any other context.\n\nI think we need to acknowledge that no single individual’s contributions are ever “worth” 10,000x someone else’s despite how they are compensated and I think we should make changes as a society to reflect that.", "label": 0}
{"text": "Wait until it hits gaming. Zelda multi-verse Hyrule.", "label": 0}
{"text": "AI should not be affecting what career decisions you go into. The projected labour shortages in will outpace any replacement by AI. It will be an economic miracle on the same level of the industrial revolution of AI even comes close to closing that gap, much less exceed it. ", "label": 0}
{"text": "There's karma to be reaped by stirring up the clueless.", "label": 0}
{"text": "Tilting elections", "label": 0}
{"text": "He increased their market cap by $2.7 trillion over 10 years.", "label": 0}
{"text": "Come one, we're really complaining that Microsoft is shifting focuses to address market demands? \n\nSorry, but Fabric and AI is the focus, and both are getting a ton of investment, some offerings will always move down the pecking list, and it's not exactly a shock that Exchange and Modern Work aren't huge priorities right now. \n\nAnyway, Teams is constantly growing and actually IS good in 2024, which is a shock to say. That team certainly hasn't been gutted.", "label": 0}
{"text": "Okay, so ETLI5 since you think it’d be childish:\nHow does it in any way make sense for a CEO to get a raise when losing so many employees? Lack of jobs decreases the economy output. 🙄", "label": 0}
{"text": "Skilled workers can find jobs. Embarrassed CEOs have a harder time.", "label": 0}
{"text": "Damn. You're right", "label": 0}
{"text": "I treat people with dignity and respect. Not like a commodity. It's not a hard concept if you're not soulless and selfish. My business is just fine.", "label": 0}
{"text": "This really depends on the level of the employee. Annual bonuses are a % of profit sharing, and that % is based on your level. 10-25% added to that amount is pretty unimpressive unless they’re Manager level. Source: former Blizzard. ", "label": 0}
{"text": "Whatever. All the boomers dumb/gullible enough to fall for deepfakes are already in the bag for orange Hitler anyway.", "label": 0}
{"text": "> they only hire the best of the best \n\nFWIW I lived in Seattle for a time and worked with some ex MSers. I can say based on my experience this is simply not a true statement. 🤣", "label": 0}
{"text": "They had $240 billion in revenue last year.\n\nThese layoffs represented 0.1% of revenue.", "label": 0}
{"text": "Thats a different issue.  \nThis jackass is talking about the claim that Musk is biasing the twitter algorithm towards conservatives, which he is. The thing is, people are just pointing it out, they aren't launching legal investigations or creating bullshit lawsuits.", "label": 0}
{"text": "this is a standard bug bounty program...\n\nthey'd be delighted if a whitehat found an exploit for them to fix.", "label": 0}
{"text": "You first need to understand how the bonus structure actually works before thinking it’s some large amount, and you don’t. ", "label": 0}
{"text": "I keep hearing about labour shortages. How come it’s so hard to find work? \n\nBesides, all the fun jobs will be taken by AI. No one is gonna pay an artist again once it gets good enough. \n\nWoooo. I get to scrub floors. \n\nNo, AI will be no miracle unless UBI becomes a thing.", "label": 0}
{"text": "Yeah looking through the list of games they've made and there's a ton of great ones. Not sure wtf this guy is talking about as Astro's Playroom was the last game they made before getting the chop and that seems like a success to me.", "label": 0}
{"text": "These layoffs represented like 0.1% of their annual revenue.\n\nMath is hard.", "label": 0}
{"text": "This is a different crew. The ones you're thinking about are still planned to return in February and are currently still aboard the ISS", "label": 0}
{"text": "> without any maintenance,\n\nYea, things have broken and they just no longer do the science that one thing was for. \n\nOne rover had to give up on going forward and only use reverse because suspension bits broke. \n\nAnd they all have received regular software updates. Beginning as soon as they land. They generally are launched before the rover software development is even complete.", "label": 0}
{"text": "And Microsoft’s profitability continues to reach all time highs\n\nSeems like a win for the company", "label": 0}
{"text": "In gaming? No you don’t. There are studios that pay almost double the base with multiple bonuses per year, not just one. ", "label": 0}
{"text": "You can respect people and still make common sense business decisions. And seeing how successful Microsoft has been under this CEO, clearly he makes the right decisions. \n\n\nBtw, employees and employers are both commodities. They're both using each other to get what they want. I don't know why you think a job = friendship or anything like that. A job is a job.", "label": 0}
{"text": "You could manage 228,0000 people to $240 billion in annual revenue and 10x market cap to over $3 trillion in 10 years?\n\nSure.\n\nBut you're here on reddit instead.", "label": 0}
{"text": "They don't think the two are related?  That seems quite the coincidence, but coincidences do happen.", "label": 0}
{"text": "Send him all the code after removing all comments.", "label": 0}
{"text": "No but in my phone, computer, TV...", "label": 0}
{"text": "\"So many employees\" made up 1% of their employee headcount, and worked in divisions that no longer fit in the company's goals.\n\nBut I mean, they *only* made $240 billion in revenue last year and *only* have a market cap over $3 trillion.  Clearly he's a hack.", "label": 0}
{"text": "Interesting that Huawei engineers aren't being targeted yet.", "label": 0}
{"text": "When does it become acceptable to eat the rich?", "label": 0}
{"text": "It doesn’t do shit. Send me my $.", "label": 0}
{"text": "This is called bug bounty and companies use it all the time to test their products.", "label": 0}
{"text": "Not at all, scientists and researchers are still discovering that theorems and theories so many geniuses in the past discovered are actually true and they have no idea how that would be possible to discover that at that period of time. For example, [theorems and conjectures from Ramanujan](https://www.quantamagazine.org/srinivasa-ramanujan-was-a-genius-math-is-still-catching-up-20241021/)\n\nEven if you took the best supercomputers, it would not be able to come up with the solutions, conjectures, and theorems many geniuses have made.", "label": 0}
{"text": "Yeah, but it would be legal.  \nGo back to WW2, it would be totally legal for you to have a pro-Hitler rally. It would be totally illegal for the guy who organized that rally to send a letter to Hitler telling him that the US wouldn't attack him if Hitler murdered all the Jews in Germany\n\nBut, the fucking Nazi who did that would only be tried for the letter. His political bias and love of Hitler would be completely legal under the 1st amendment", "label": 0}
{"text": "Anyone who thinks it’s not out yet is wildly dumb, I have had it for a while and every beta update I have done - I expect it to get better and it doesn’t. If it’s supposed to get better, I sure hope it does, revise what they have now is stupid and ineffective.", "label": 0}
{"text": "> i hope the the economy takes a shit. Its not a far fall for me i just need the people above me to lose their stuff so i can buy up their broken dreams.\n\nThis you?", "label": 0}
{"text": "The button that turned my old phone off and on is an AI button now. It took me a bit to figure out how I was supposed to restart the damn thing.", "label": 0}
{"text": "“I’m done with humans”\nHopefully this doesn’t happen in a recession due 5 years from now", "label": 0}
{"text": "They have profiled every human on the internet, what can be more dangerous?", "label": 0}
{"text": "It’s fucking insane. Like anyone that keeps their job would be lucky to see a 10% raise even with great perfomance. The CEO gets a crazy 63% bump for making people jobless and not much else. Feels like everything he’s done has been a failure.\n\nCEO pay in this country is out of control and it’s literally coming at the expense of the workers.", "label": 0}
{"text": "Article neglected to mention that he spent $2million on computer resources to find the prime", "label": 0}
{"text": "I want the devs to have jobs. I want the execs and shareholders to get fucked. I know I can't have both in this world, but I want it just the same.", "label": 0}
{"text": "Sadly, guys whole argument is corporations = bad.\n\nEven though he buys their products and receives value from them every day.", "label": 0}
{"text": "2500 people out of customer service and support, 5000 into legal 💪", "label": 0}
{"text": "I keep saying lots of things are dangerous, but some of you are really struggling with that for some reason.", "label": 0}
{"text": "The Ubisoft I cared about back in the day is long gone. Stopped paying attention after AC Black Flag.", "label": 0}
{"text": "Just because it's normal doesn't mean it should be normative", "label": 0}
{"text": "These day, there doesn't seem to be \"enough\", for the billionaire class.", "label": 0}
{"text": "It’s funny how his mentally slow supporters are anti China and he does a lot of business with them.", "label": 0}
{"text": "Yes, actually that’s exactly what they’re known for.", "label": 0}
{"text": "They do the calc on the mod so it’s not so bad", "label": 0}
{"text": "This is a silly response.  Someone looking to buy a 13k car isn't going to switch to a 70k truck they are going to buy an 18k kia or similar.\n\nNumbers show that Ford sells more trucks in the USA than all Camrys and Accord sales combined. So clearly there is a demand for trucks.", "label": 0}
{"text": "I think something is wrong with that formula", "label": 0}
{"text": "It’s not but it’s divisible by 1.", "label": 0}
{"text": "Redditors have no fucking idea about LIDAR, but because Tesla don't use it, it must be good.", "label": 0}
{"text": "What do you propose outside of just bitching about it online?", "label": 0}
{"text": "Point 20 in the document I provided. Not sure what you mean, or even what you're arguing about. It's pretty transparent.", "label": 0}
{"text": "So human brains can beat supercomputers in certain tasks but the opposite is also true. That has a lot more to do about how they work than raw power.", "label": 0}
{"text": "These layoffs represented like 0.2% of their $240 billion revenue last year.\n\nThey were laid off because they were no longer needed, not because he had to scramble to find savings to appease investors.", "label": 0}
{"text": "The article says \"despite\", but should actually read \"because of\"", "label": 0}
{"text": "Yesterday they were worried one or two bom stories from Trump would fuck everything up, now they are worried a \"deepfake\" will be released.\n\nInteresting, but not quite.", "label": 0}
{"text": "Ubisoft should get used to not having customers.", "label": 0}
{"text": "Title is misleading, first paragraph of the article clarifies this is a bug bounty program. Apple is simply stating it will compensate whitehats for disclosing flaws they find in their software that could lead to a data breach. This is a common industry practice, it’s good for Apple and for consumers of their products.", "label": 0}
{"text": "Me tooooo! Ape escape was amazing", "label": 0}
{"text": "Same and they showed they’ve still got it with the Astro bot level!", "label": 0}
{"text": "Man have you spent all day replying in this sub? Get a job and move out of your moms house", "label": 0}
{"text": "The US needs this mine to be less dependent on outside sources", "label": 0}
{"text": "Ubisoft is a turnover machine, they already fully embody \"developers not having jobs\"", "label": 0}
{"text": "They employ over 250k, so laying off 2500 is not that much.", "label": 0}
{"text": "And I have to fight for my life for a 3.5% pay rise", "label": 0}
{"text": "It’s because anything that divides the exponent also divides the number, which is why the exponent has to be prime", "label": 0}
{"text": "There is nothing gaming specific about this topic. I don’t work in gaming. My comment was about me. So please enlighten me about my own situation.", "label": 0}
{"text": "Lol typical American mindset. Poor people should be punished for trying to make money", "label": 0}
{"text": "**NASA** has instituted Intersectionality into 'daily work' and its contractor Boeing has strong DEI requirements. Seasoned engineers are retiring or leaving and race and gender based hiring has eroded Boeing's human capital and has decreased responsibility and accountability in DEI hires. \n\nLike the collapse of quality and rigor in US military recruiting, white and Asian men avoid organizations whose primary goals have been replaced by DEI.", "label": 0}
{"text": "First time on Reddit, huh? /s", "label": 0}
{"text": "Finally a comment here worth upvoting!", "label": 0}
{"text": "See you condescend, but a chorus of common people is the only way this is ever going to change. The 1% are never going to cede any of that wealth back unless we make them, and the only way that's ever going to happen is if the public conversation reaches the critical height it needs to usher in a new set of common values around what an equitable society looks like.", "label": 0}
{"text": "Bingo. Apple is notoriously never at fault or wrong in any product, policy, or design.", "label": 0}
{"text": "How many skulls cousin Greg?", "label": 0}
{"text": "You run a large restaurant with 60 workers. You are rich, and the business does well. But you are constantly facing new restaruants opening and competition. You can save a ton of money by investing in new software that lets you churn out more takeout orders, but it means firing 5 people. \n\nBut you're rich. Those were humans with jobs. What are you goingto do? \n\nMaybe *you* are a great person and you keep the humans.\n\nBut a public corp CEO has a mandate to run the company efficiently. \n\nThe board and shareholders approve CEO salary and bonuses. They clearly believe Satya is worth it. And guess what - if you're piloting Microsoft, Apple, Google - then these big salaries are a drop in the bucket compared to the scale of the operation and what's at stake.", "label": 0}
{"text": "Exactly this. Not despite the layoffs, because of the layoffs. These bosses get bonuses for using less payroll and fucking over employees.", "label": 0}
{"text": "Right. THAT'S what illustrates the perils. \n\nNot the confidently wrong information wedged in at the top of the search results, not the legally dubious IP stolen to build the \"AI\" models, not the massive amount of energy needed to achieve an output with less quality than 20 years ago.\n\nIt's the user.", "label": 0}
{"text": "Absoutely *wrong*. \n\nLook at what Ballmer did with Microsoft and then look at Satya. If Ballmer was appointed MS Dictator for life, they'd look like IBM by now. \n\nWhere would Apple be without Steve Jobs coming in the second time to ressurect them?", "label": 0}
{"text": "No. It's the difference between black-box and white-box attacks. In this case the bounty is for black-box attacks, where you don't have access to the model or code.", "label": 0}
{"text": "Why do people focus on satya particularly lol. All tech ceos are doing the same thing. Must be an anti south asian thing as usual. Bunch of bigoted fucks", "label": 0}
{"text": "When Rupert Murdoch of News Corp (Fox News, NY Post, Wall Street Journal, the Sun, the Times and \\~70% Australian print media), sues Perplexity search engine for “illegally copying” some of his US titles’ journalism this seems to be problematic given News Corp's history of involvement in AI. \n\n[News Corp and OpenAI Sign Landmark Multi-Year Global Partnership](https://newscorp.com/2024/05/22/news-corp-and-openai-sign-landmark-multi-year-global-partnership/)\n\n[News Corp using AI to produce 3,000 Australian local news stories a week ](https://www.theguardian.com/media/2023/aug/01/news-corp-ai-chat-gpt-stories)Not just Australia, what about the rest of their US and UK publications?", "label": 0}
{"text": "The title of the articles references 2550 jobs lost - those were all in gaming. I was part of the 1,900 at Blizzard. I probably could, but I’d need your title. ", "label": 0}
{"text": "so it's despite then?\n\nenglish is hard.", "label": 0}
{"text": "Despite, or because of?", "label": 0}
{"text": "This thread opened my eyes to how completely uneducated people are about any of this stuff. They just compare 5000 layoffs with a huge CEO salary and get angry, all while typing on their windows/mac/google device.", "label": 0}
{"text": "Same reason the only time OnlyFans is mentioned in headlines it’s about porn, sex, and prostitution…", "label": 0}
{"text": "This guy talks like a casino punter not game developer. All these execs are that.", "label": 0}
{"text": "Nah man, the rover needs to know how to duel, so it can teach aliens.\n\nhttps://www.youtube.com/watch?v=mMcwg6EQDNM", "label": 0}
{"text": "It took calling out an entire industry to make that happen, and should in no way be considered the norm of what they were saying. ", "label": 0}
{"text": "So what exactly is your plan to make sure top CEOs in the world don't make millions?", "label": 0}
{"text": "Being ripped out of ones comfort zone and thrown into a no income situation is quite taxing on the mind.", "label": 0}
{"text": "I actually buy this argument for athletes, but I don't for CEOs. CEOs get golden parachutes while they absolutely destroy companies just as often as they get rewarded for a successful vision. They get high pay because pay for every corporation in the country is decided by a board of directors that is invariably made up of *other CEOs* who all prop each other up because that's what's best for them as individuals. It has little to do with how rare their skills are.", "label": 0}
{"text": "It would be so easy to have them charge themselves. Would be pretty hilarious if a human does it. I can understand typical maintenance....for now. Total world automation baby!", "label": 0}
{"text": "[I work from my own home as a software engineer.](https://imgs.xkcd.com/comics/compiling.png). Sorry to disappoint you.\n\nBut yeah, it's a slow day after a long week, my ADHD is winning, and I'm feeling ornery and my brain decided to be active in this thread today.", "label": 0}
{"text": "Gosh, you truly are clueless on the subject of Boeing's finances.", "label": 0}
{"text": "The republicans have wasted so much of our money on bogus investigations and phony court cases. How great would it be to see our funds put to useful causes?", "label": 0}
{"text": "There need to be laws that C-suite can't bonuses for, say, 24 months after mass layoffs. \n\nEither you're struggling enough to justify layoffs or you succeed enough to justify bonuses. \n\nNot both.", "label": 0}
{"text": "That's not what jailbreaking means, and Apple's context sandbox is an inherently safer approach to the problem. You would need to compromise the software or hardware powering the cloud intelligence implementation, and if this is happening, you have FAR bigger issues on your hands.", "label": 0}
{"text": "Keep that tinfoil hat on bud! Don't want you getting zapped with too many rays", "label": 0}
{"text": "Fuck the wage gap of ceo to the actual workers.", "label": 0}
{"text": "Most useless \"feature\"", "label": 0}
{"text": "Figured what out? People are just regurgitating the same misinformed stuff here.\n\nMicrosoft has a market cap of over 3 trillion. The spike in his pay is nothing and completely unrelated to the layoffs. Microsoft isn't suffering and with a company that huge, layoffs happen when things get restructured and shuffled around.", "label": 0}
{"text": "Now imagine being Bezos or Musk and get many more per month due to dividends alone", "label": 0}
{"text": "...and they're not! I have them in my restaurants and they are the crudest things you can imagine. It's about a dozen moving parts and some really simple electronics. Ours haven't had a failure in five years, I really don't understand what's going on with McD", "label": 0}
{"text": "lol it would be really funny if the algorithm actually helped trump and then made both Google trump and republicans look even worse.", "label": 0}
{"text": "What a scum", "label": 0}
{"text": "The shit that was real.", "label": 0}
{"text": "No the number is actually significant because large prime numbers are used by rsa encryption keys. If we know a very big prime number, it increased the security of encryption and likelihood the secure messages can get cracked. This played a big role in wwII when secured messages were important.", "label": 0}
{"text": "I blame all these religions that revolve around human sacrifice (looking at you, Christians) for normalizing the idea that people should suffer for the perverse pleasure of some powerful prick.", "label": 0}
{"text": "Im 52 hours into my week fridays are slow though", "label": 0}
{"text": "Damn. We have to make new whipping canes for these new racist species!", "label": 0}
{"text": "I have a theory that Microsoft has signed a big deal with the department of defense to be their go to partner in the AI arms race against China. You don't get approval to buy a nuclear power plant without some kind of close relationship with the US government. I think the stock is gonna go up steadily for the next few years.", "label": 0}
{"text": "Exactly. It's a private company. They can censor and lie all they want to. Even to influence elections by hiding positive results about Trump.", "label": 0}
{"text": "is 1% of the workforce considered a mass layoff", "label": 0}
{"text": "In two countries, no less!!", "label": 0}
{"text": "Too little too late. You let Trump use you and I'm done with you McDonald's.", "label": 0}
{"text": "The layoffs were irrelevant to Microsoft's performance or his pay package, and were representative of employees no longer working on things that fit his very successful business's direction.\n\nIt was added to the headline as ragebait.", "label": 0}
{"text": "There no possible reason for people to be paid that amount let alone for doing less then the people down the chain. Fuck I hate that everything has to revolve around making profit.", "label": 0}
{"text": "Gotcha. Was just wondering compared to the other mid-sized trucks on the market.", "label": 0}
{"text": "So, same as always, then? Cool!", "label": 0}
{"text": "Right so many bugs like when you open a picture your iPhone crashes, or it shuts off in the middle of the night causing you to miss alarms, or maybe like your old deleted photos reappearing? Or the boot looping issues in iOS 17, or the app switcher coming up when typing, or iOS overheating the iPhone 15?\n\nI have an android phone with over 1000 hours uptime that has only restarted because of an update.\n\nThere is a ridiculous amount of major issues that have been in iOS for a company that is slow and meticulous about their software updates.", "label": 0}
{"text": "They should be taxed and fined.  \nIf you lay off without experiencing real losses (not investments labelled as losses, no more tax breaks for advertising and CEO salaries and bonuses), corps are taxed on that too.\n\nNo more work at will.  Invest in who you hire and only fire people that aren't working/performing.  They know a revolving door means they don't have to pay into our retirements.", "label": 0}
{"text": "Unfortunately, this post has been removed. Links that are affiliated with Amazon are not allowed by /r/technology or reddit. Please edit or resubmit your post without the \"/ref=xx_xx_xxx\" part of the URL. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technology) if you have any questions or concerns.*", "label": 0}
{"text": "So now we can multiple this huge number by 2 to rule out another potentially larger prime. Then by 3 to rule out another. Then by 4. Then 5, 6, 7, etc. Doing it this way we could eliminate an insignificant amount of future possibilities!", "label": 0}
{"text": "They fired them IN AN EMAIL.", "label": 0}
{"text": "I’m still gonna downvote your joke maybe", "label": 0}
{"text": "In other words, he layed them off so he can get a bump in his compensation.", "label": 0}
{"text": "This decision really hurts access to gaming  when about 95% of games made before 2010 are now hard to find legally. It’s a big loss for anyone trying to study or preserve the culture around them. Without legal ways to play or research these old games, we’re losing a piece of history. And it’s all because publishers are more focused on protecting their profits than letting people explore the roots of gaming.", "label": 0}
{"text": "But look how happy he is 🥹", "label": 0}
{"text": ">  one complaint about uber and Lyft\n\nit's not that. I've not encountered any chatty drivers in the past many months. \n\nHowever, I frequently have to sit in dirty/no-so-clean cars, that smell bad, mostly prius. Basically poorly managed cars. \n\nWith Waymo, I get to sit in a clean car with extra leg space. Not talking to a driver is an added benefit", "label": 0}
{"text": "You yadda’d the best part! No, I mentioned the bisque.", "label": 0}
{"text": "https://www.apple.com/newsroom/2024/09/apple-intelligence-comes-to-iphone-ipad-and-mac-starting-next-month/\n\nIt rolls out with 18.1. What you’re describing is ML tools that have already existed, which will also be refreshed by Apple AI roll out.\n\nI’m not defending it, I’m pointing out that there’s no data to draw conclusions either way. It’s interesting you’re calling people dumb while 1) making incorrect assumptions and 2) calling others dumb for calling out your mistakes", "label": 0}
{"text": "When Ubisoft said get used to not owning games, that was a hard line in the sand that I wouldn’t cross even though the new PoP game looked fantastic.\n\nThen they took licenses away from those that bought their games, and that solidified I’m never buying a Ubisoft game again.", "label": 0}
{"text": "Ifixit did a whole expose on it. McDonald's forces franchises to buy a specific machine with obscure error codes to drive service calls", "label": 0}
{"text": "Exactly, people in this thread have an extreme misunderstanding of how the company operates and how the stock market works.", "label": 0}
{"text": "Ah, yes, all those \"non-hits\" like Ape Escape, Ico, Shadow of the Colossus, and Astro Bot. A shame none of those games ever got popular.", "label": 0}
{"text": "What do you think paid for that raise?", "label": 0}
{"text": "But..but…we didn’t want YOU to do it. It was just for us.", "label": 0}
{"text": "Presidential candidate \"I love Hitler and what the army to be like the German army in the United States!\", then, \"hey, a social media site didn't publish that thing I said\".\n\nWhich one do you think the attorney general of Missouri that was important enough to the United States to investigate.", "label": 0}
{"text": "Don't forget to add WAPO to your list.", "label": 0}
{"text": "Why should a business be forced to keep people who worked for divisions that no longer fit with the direction the company is going?", "label": 0}
{"text": "I get where you’re coming from on CEO pay, but if you look at the growth of the market and economy since 1978, it starts to make a lot more sense. Here’s a side-by-side comparison that gives perspective:\n\nCEO Pay: Up around 1,460% since 1978.\n\nS&P 500 (SPY): Up more than 4,000% since 1978.\n\nNASDAQ: Grown over 13,000% in the same time.\n\nGlobal Market Cap: From about $1 trillion in 1978 to over $100 trillion now.\n\nWhen you see these percentages next to each other, it’s clear that while CEO pay has grown, it’s actually more modest when compared to the massive expansion of the market and global economy.\n\nToday’s CEOs aren’t just managing local or regional companies anymore. They’re leading massive global corporations with responsibilities that extend far beyond what was required in 1978. Their decisions affect thousands of employees, supply chains, and shareholder value worldwide. Take the Fortune 100 companies—combined, they’re worth over $25 trillion, and boards want top talent who can handle the scale and complexity of these roles.\n\nGolden parachutes? I totally get the frustration there; it’s hard to justify for poor performance. But the high-performing CEOs are expected to bring billions in value, which has a huge ripple effect on employees, shareholders, and the broader economy.\n\nAthletes, for sure, bring major value, but they’re not steering multi-trillion-dollar corporations or driving entire industries. CEOs impact whole economies and create massive job opportunities. Their pay might look wild, but in today’s globalized market, it aligns with the scale.", "label": 0}
{"text": "> CEOs get paid based on the company's performance.\n\nJoke of the day.", "label": 0}
{"text": "I have no need for it in my life. ", "label": 0}
{"text": "Of course, all those jobs cuts saved Microsoft a ton of money", "label": 0}
{"text": "I didn’t read that that in what you linked, what I read is that I have Apple intelligence and the update I got said that, the features listed in your article are on my phone. Writing tools, image playground, enhanced Siri call recording etc.\n\nThey all suck.\n\nNow if they push updates to this later that’s different. Right now, on my phone. Literally called Apple intelligence and it sucks", "label": 0}
{"text": "As a retail Microsoft shareholder, I love the guy. He pulled MS to the top. I'm happy to pay him whatever it takes as long as he plays that well.", "label": 0}
{"text": "If I understood what that meant or how to do it, then I would", "label": 0}
{"text": "I just setup a whole automated dashboard for a private equity firm to monitor the health and revenue/sales of their companies - a week after I completed the work I was told that my job would be disappearing and further development and maintenance would be performed by a couple of offshore dudes I had been asked to train in a few aspects of it. I worked at this company for 8 years prior to being acquired by this private equity firm. Good luck to them.", "label": 0}
{"text": "Well that's cause he doesn't have to pay all those employees anymore. So more money for him!", "label": 0}
{"text": "People are resorting to Putin insults to defend billionaires now.", "label": 0}
{"text": "I know that people will not like to hear this, but, as someone who works in libraries, this article really misses the mark. This ruling is *not* about game *preservation*. This ruling is about *access*, which is not the same thing. The article glosses over it, but it's right there: \"The Register concludes that proponents did not show that **removing the single-user limitation for preserved computer programs or permitting off-premises access to video games** are likely to be noninfringing..\" That's access. The issue at question was whether VGHF could provide *remote access* to games (without any kind of mechanism in place to ensure that each copy could only be accessed by one person at a time).\n\nThe article also says \"More importantly, this also ignores the fact that libraries *already* lend out digital versions of more traditional media like books and movies to everyday people for what can only be described as recreational purposes.\" which is *very* misleading. \n\nIt's true that libraries lend out digital versions of books and movies, *because libraries pay for licenses to do so.* We do not have the legal authority to buy a random book, digitize it, and then provide unfettered access to it. If 100 patrons can access Book X online, it's because the library *paid* for 100 digital licenses. It costs libraries a TON of money to provide access to those books and movies; we're not just winging it and giving out digital access willy nilly. \n\n(For the record: I'm not unsympathetic to their goal; I, like a lot of library workers, think that our current understanding of copyright law is ridiculous and overly restrictive.)", "label": 0}
{"text": "Yep, the increasing financialization of companies is a huge problem, every decision becomes stupid short sighted accounting tricks. Organic growth and long term thinking goes out the door. \n\nIt usually coincides with a drop in quality of output as well as toxic work culture.", "label": 0}
{"text": "And you will do the least amount of work to not get fired. Whats the problem? Workers job hop to maximize wage growth and companies replace overpaid employees to control costs, seems fair to me", "label": 0}
{"text": "I can't swim and I'm fat 🫤 I'll be the first fatality", "label": 0}
{"text": "The $240 billion in revenue they made last year, and the stock having a market cap now of over $3 trillion under his watch?", "label": 0}
{"text": "Not necessarily, Im sure more could have been done to keep them/retrain them, but its far easier to just hand out pink slips.", "label": 0}
{"text": "I wish people brought up Knack more often. It just makes me smile. What a silly situation that was, though it didn't really slow down the PS4.", "label": 0}
{"text": "The dangerously growing White Hot Orb of Hate that Ubisoft has unleashed in gaming forums, on Reddit and beyond, is a sight to behold. \n\nUsually, indifference is the worst thing you can find yourself on the other end of. It’s gotten straight up vitriolic. An “I’ll pass on this one” is just as much of a lost sale though, so I’m not sure what the impact will be in the grand scheme of things.", "label": 0}
{"text": "His job is to make top-level strategic decisions for a $3 trillion company. Microsoft’s stock price is up over 26% in the last year, meaning under his leadership, Microsoft has delivered over $650 billion dollars in the last year. That’s why shareholders decided to pay him $73 million.", "label": 0}
{"text": "Oh mr wise guy with the numbers, if jobs cuts only equate to 0.2% of their revenue, why cut jobs then?", "label": 0}
{"text": "actually good critism for once", "label": 0}
{"text": "Together with Tim Cook, Satya has to be one of the most overrated CEOs in history.", "label": 0}
{"text": "I mean the article verbatim says:\n\n> will start rolling out next month with iOS 18.1\n\nAre you on iOS 18.1?", "label": 0}
{"text": "Legaly twrosust who killed bot isralie  and amrican\nNot to mention isralie  christain  which small part of israle", "label": 0}
{"text": "The only real way to become a berserk apostle in real life. Sacrifice many to profit one.", "label": 0}
{"text": "Agree, giving themselves bonuses in a failing company is just straight up looting the sinking ship.\nIn this case, you're maybe right.  Nadella has made a lot of good choices the last decade, and 225k/2550 is very close to 1%, which can easily just be performance issues.\nI'm still leery of how companies essentially use the 'fire, then rehire for less' chicanery to avoid lowering stock prices/showing weakness while also lowering costs, but it's probably not what's happening here.", "label": 0}
{"text": "The numbers you're presenting here are apples and oranges to paint a totally misleading picture. If your argument bore out and CEO pay increased by 1460% while the overall pie increased by multiple times more than that, we wouldn't be looking at an economic situation with rapidly increasing wealth inequality.", "label": 0}
{"text": ">How about just close your wallets for mediocre games \n\n\n\nLast game I was gifted was killing floor like pre 2010~\n\n\n\n\n\n>keep spending on good ones, regardless of their publisher?\n\n\n\n\nI haven’t bought a game since. I would say I’m “still waiting” but just pointlessly clicking the same button over and over lost it’s fun for me. It just felt like a 24/7 grind, a second job, not fun or recreation.\n\n\n\n\n\nI have more fun dancing to music with glow sticks these days…", "label": 0}
{"text": "I like pushing science, but imagine how much energy it took to achieve this?   Lets hope that solving massive prime numbers leads to something useful.", "label": 0}
{"text": "Also very short sighted, as its highly disruptive though out the company and the loss of a very narrow specific skill set which is not easy to replace and takes years of actual experience on specific products .. let alone the loss of trust ..", "label": 0}
{"text": "So how does this negatively affect the people of this assholes state??", "label": 0}
{"text": "Because they worked in divisions that no longer aligned with the company's direction.\n\nIf I'm not mistaken, they were mostly from a video game development studio they were shutting down.", "label": 0}
{"text": "Gamers are already used to not owning their games so I don’t even know why the ubi guy felt the need to state that.", "label": 0}
{"text": "Yeah… you get $0", "label": 0}
{"text": "It's learning by consuming the internet.\n\nThis is the old \"I learned it by watching you, dad\" anti-drug campaign redressed for the modern age.", "label": 0}
{"text": "I’ve worked in fabs in both Arizona and Oregon, and you definitely notice the difference in labor rights between the two states.", "label": 0}
{"text": "The rest went to mandatory team building “pizza parties”", "label": 0}
{"text": "As someone who was on a team that recently got laid of. I was surprised at the number of developers who are indeed used to to not having a job", "label": 0}
{"text": "let me guess you work in HR and your college degree is corporate talk 401?", "label": 0}
{"text": "Lidar my sound like radar, but radar it is not - it can not penetrant snow or ice and is effected by inclement weather.", "label": 0}
{"text": "That has been true of any computer since the nineties. You can’t do a million floating point operations per seconds but the computer they put in your microwave can.", "label": 0}
{"text": "I remember being so disappointed with the Ape Escape PlayStation Move game -  literally was the perfect IP for that and it failed so badly in every way it could have.\n\nWould have been interesting to see a VR title in the franchise but then again any new title would have been awesome to have.", "label": 0}
{"text": "God damn even NVIDIA’s computer is addicted to Logan Paul’s new drink?? We’re screwed 😔", "label": 0}
{"text": "...of their paychecks", "label": 0}
{"text": "It’s levels a large retailer that “competes” with them in the cloud if you consider azure competitive", "label": 0}
{"text": "You could... Read the article\n\n>The series C round brings Waymo’s total capital raised to $11.1 billion, after raising $3 billion and $2.5 billion in two earlier rounds. Alphabet CFO Ruth Porat said earlier this year that the company would invest $5 billion in the self-driving unit over several years.\n\nThey got 5.6B cash", "label": 0}
{"text": "Precautions were missed and everyone is blaming text on a screen when the child clearly had mental health issues. Everyone seems to be blaming computers and technology and not pure negligence. I have difficulty blaming text on a screen when the text wasn’t what ultimately ended a life. There must have been other things going on in the household and I think blaming text on a screen is ignoring an unlocked, loaded firearm in a child’s hands.", "label": 0}
{"text": "Good luck understanding the algorithm if they can’t even understand internet", "label": 0}
{"text": "Oh thanks for the correction, CS student btw", "label": 0}
{"text": "that's a vulnerability as well.", "label": 0}
{"text": "So we can speak about how companies think of it? I think we all agree it's unethical to do mass layoffs while people while you're profiting but there's value in understanding why things are done.\n\n I think it's a mistake to say \"they're comically evil let's ignore their motivations\" rather thank of their motivations so when policies are pushed we're prodding in the right direction. You're not going to pass \"companies can never lay people off\" laws easily, and if you limit it when they profit - they'll use financial magic like hollywood so that they never 'profit'. \n\nBy recontextualizing it as wasted money - it now is something that actually affected the retirement accounts of millions of people and it may get easier to figure out how to curb this behavior and sell it as a positive for even the owners of a company.", "label": 0}
{"text": "No it isn't lol there is absolutely zero objective measure for how companies choose to compensate their leaders. \n\nUsually it's just one of their mates from Bain or McKinsey who recommend they get a pay rise as part of a very fair and independent \"compensation review\", then they pay back that favour down the line some how and round the carousel we go...", "label": 0}
{"text": "Probably not a multiple of 69,420 either", "label": 0}
{"text": "it’s not odd, it’s *special* 😇", "label": 0}
{"text": "When will people figure out this is the system working as intended.", "label": 0}
{"text": "What's with this weird entitlement complex people have gotten with companies? Nobody owes you a job.", "label": 0}
{"text": "What a fucking shithead", "label": 0}
{"text": "This should have never even be an issue in the first place.\n\nThere's no reason for a soft serve ice cream to need a CPU and to have error codes (unintuitive or not).  Those things have been around for nearly 100 years now and worked perfectly fine for many decades without needing any of that overly complicated crap.", "label": 0}
{"text": "> I know I can't have both in this world\n\nYou absolutely can, but it takes more than us posting comments on the internet about it.", "label": 0}
{"text": "Mother. Fucking. Mantra", "label": 0}
{"text": "It's probably the number we need to go to hyperspace", "label": 0}
{"text": "I'm a software engineer. And no, I don't work for Microsoft.\n\nI've been around long enough to understand the ebbs and flows of business cycles.  Priorities change and sometimes groups fall out of favor and find themselves on the outside. Sometimes they just run out of things for you to do and can't justify keeping you around.\n\nThese cuts were from two video game studios and trimming duplicate job roles following their acquisition of Activision Blizzard.", "label": 0}
{"text": "I like the looks of it the most, and it's got great reviews from the people i know who own one.", "label": 0}
{"text": "Weren't the robber barons richer relative to their time than the guys today?", "label": 0}
{"text": "Stop boot licking dude, their is absolutely no way you can objectively come up with a CEO's value  that equals the ridiculous ceo pay scales we have today, it's all just a racket.", "label": 0}
{"text": "I think there is a lot of interpretation of what was said and the courts will determine what’s what, but there is a definitive fact that a child accessed an unlocked and loaded firearm and sadly ended his own life, and that’s just horrible.", "label": 0}
{"text": "They don't, that's why they got fired. How can you people be so stupid?", "label": 0}
{"text": "That sucks man, hope he got a good redundancy package and is alright.", "label": 0}
{"text": "this is literally the answer to everything that is currently wrong with society and the human race. just talking about it wont solve anything. movements need to be made.", "label": 0}
{"text": "It's pretty funny that you people think world leaders are responsible for the economic condition... Jeff Bezos thinking up of Amazon has had a bigger impact on the economy than anything a president did.", "label": 0}
{"text": "Well, the point of this probably isn’t to win the lawsuit. It’s to get press coverage of the lawsuit so that people will see in the news that there’s something going on about Google censoring Trump. The average person’s takeaway from this will be that Google is censoring Trump. Boom, that’s a win for MAGA, even if they lose the lawsuit.", "label": 0}
{"text": "Right, so what's the solution? Government intervention that forces a company to keep you hired? That's outrageous.", "label": 0}
{"text": "What exactly are we looking for? Is it just a pipe dream?", "label": 0}
{"text": "And the rich get richer", "label": 0}
{"text": "I realize that this is going to get downvoted because people on Reddit think that anyone making more than them at their dead-end dollar store job is a greedy money-hoarding pig, but on the off chance that someone is willing to listen to reason instead of getting swallowed up by the outrage echo chamber that Reddit is infamous for:\n\n1. They laid off 2,550 people, but also hired more. According to [this page](https://stockanalysis.com/stocks/msft/employees/), they hired a net additional 7,000 employees since 2023.\n\n2. Layoffs can happen whether a business is doing good or not. Sometimes roles become redundant or replaced with software, departments close down, business priorities shift, someone is performing below expectations but hasn't committed any fire-able offenses, etc. They are not only tied to the company's profits like most people believe, and a company is not obligated to keep someone around just because they have the money to do so.\n\n3. Executives of public companies are mainly compensated with cash and stock incentives, and the targets are hashed out ahead of time. The board doesn't just randomly decide to \"reward\" the CEO with a bunch of money, it's agreed on long beforehand. Imagine if you signed a contract with your manager to give you a bonus for meeting a performance target by the end of the year, you met it, but then they said \"we're gonna withhold your bonus because we had to lay off some people\". That's not how it works.\n\n4. Stocks are paper money, have no real value until sold, and go up and down with the market like the tide. Everyone loves pointing out how so-and-so CEO \"made\" $xyz million like it's being deposited into his bank account, but nobody ever points out when they \"lose\" $xyz million when the market goes down.\n\n5. Microsoft has [$75.53 billion cash on hand](https://companiesmarketcap.com/microsoft/cash-on-hand). Satya's payout was $73.9m, and even assuming it was all cash, that's just 0.0978% of the cash that Microsoft has. He's not \"stealing\" anyone's salary.", "label": 0}
{"text": "Really, the music industry has a much longer history of scummy practices than what the video games industry is experiencing.", "label": 0}
{"text": "I mean what normal working class job doesn't get a 63% pay raise each year", "label": 0}
{"text": "The problem isn't that companies have free speech. (They always did)  \nThe problem is that the ruling equated MONEY to free speech.", "label": 0}
{"text": "Ah fuck it.. just send him some random quadratic equation a middle schooler could understand... it's not like he could tell the difference.", "label": 0}
{"text": "What are you even on about? Zebra puzzles are an AI benchmark and used for training and development. They can solve them. Also what does that even have to do with what is a pretty standard bug bounty program?", "label": 0}
{"text": "Who are you to decide what is and isn't moral financially?", "label": 0}
{"text": "It needs to learn to harvest potatoes first.", "label": 0}
{"text": "It was a bonus on your bonus. So % of a %. For an averge employee this was around an extra $2-4k. Hardly extraordinary.", "label": 0}
{"text": "He gets paid in stock, so it literally depends on how much monetary value he generates.", "label": 0}
{"text": "For me I got \"what makes the ugliest woman in the world feel beautiful\" using your exact search of \"the worlds biggest, ugliest, fattest, most despicable excuse for a human being\". Not even 1 political thing on the first page. Win for me because politics are so damn annoying and filled with hate (can be proven by your comment and the one before and this entire comment section) I'll start caring about politics when people can be civil and not just bash someone on their looks or how they talk. I'll also start caring about politics when BOTH sides can actually answer a question. Kamala can't answer anything and trump can't answer anything. They always go off on some random rant not even related to what the interviewer asked. Yet nobody calls them out for it live (except online when it doesn't matter anymore and people have moved on) If I was the interviewer I would tell them straight up a yes or no question and if they said ANYTHING but yes or no I would stop them and tell them yes or no only. Rinse and repeat until I got the yes or no. Which judging by the time I've been alive I'll never get that yes or no.", "label": 0}
{"text": "I think he makes too little money. Now what? Who's right? This is why such things aren't tied to what you or I think is right.", "label": 0}
{"text": "This or this whole thread is a good example of why the internet needs to be age restricted. I believed the same shit when I was dumb teenager.", "label": 0}
{"text": "Every industry is going to go through the trend of diminishing quality. We really shouldn't be looking at video games as an exception but more as a part of the whole entertainment economy.", "label": 0}
{"text": "Do you not know what moral means? It's you're own opinion, man.", "label": 0}
{"text": ">Why are they only suing tik tok?\n\n\n\n\nThe disease that is vertical format videos needs to die.", "label": 0}
{"text": "~~despite~~ because of", "label": 0}
{"text": "What are you even talking about….", "label": 0}
{"text": "It also ignores that Microsoft’s employee count went up overall in that time.", "label": 0}
{"text": "Microsoft CEO's pay rises 63% to $73m, ~~despite~~ because of devastating year for layoffs", "label": 0}
{"text": "Have you done anything to warrant a 63% increase to your salary?", "label": 0}
{"text": "Scum of the Earth ", "label": 0}
{"text": "The stock price went up because he delivered $240 billion in revenue last year, not because he saved 0.2% of that from layoffs of 1% of employees.", "label": 0}
{"text": "Your very first source was a news article about a single event that had little to do with what you used it to argue. \n\nThe UN document is 23 pages without it being evident what you were referring to. Thank you for clearing that up, though. I still have no clue how this all means that ChatGPT is more racist because of self-censorship on issues of race disparities. Plenty of countries, including the US, collect a lot of data pertaining to race and ethnicity.", "label": 0}
{"text": "On one hand if he doesn’t do this he gets fired so see that point of view.\n\nShareholders and elites created the root cause of the problem", "label": 0}
{"text": "If value doesn't equal money - why do you care that he's paid so much more? His monetary compensation depends on the monetary value he generates. Of course there's more to value - but we're discussing his compensation, specifically the monetary aspect of it. There's also stuff like gratitude he got for it, sense of accomplishment, etc, and that's probably also proportional to other parts of the overall value. But we're discussing the monetary part here.", "label": 0}
{"text": "When he took over, Microsoft's market cap was $300 billion.  It's now over $3 trillion.\n\nWtf are you talking about?", "label": 0}
{"text": "The fact that he keeps talking about “AA Games” as if they aren’t plentiful on PC shows how out-of-touch he is with the overall gaming landscape.", "label": 0}
{"text": "That wasn’t even new to the Citizens United ruling", "label": 0}
{"text": "That is disgusting. No loyalty to country there. Hope he gets a world of hassle which is what he deserves.", "label": 0}
{"text": "Crazyto think that motorola is now known by many for cheap phones you can find in a dollar general", "label": 0}
{"text": "Lol look at the hypocrite.", "label": 0}
{"text": "Sorry that’s not how it works", "label": 0}
{"text": "The second link and the first link were not intended to prove distinctly the subset of compliance requirements that are being cited for the reasons these maintainers were purged - because at this time only the Lawyers, a few key individuals and perhaps the US DOS are in the know. The point is there are a large number of sanctions and terms for compliance and whether individuals like it or not - they are legally binding and not the types of things you want to run afoul of. \n\nhttps://www.phoronix.com/news/Linux-Compliance-Requirements\n\nMore info has come out and likely will continue to come out. It should be very clear this is not a political issue this is a legal issue.", "label": 0}
{"text": "Lol assign it as a password hope they db can handle it", "label": 0}
{"text": "Companies often lay off employees to boost stock prices (somehow always manage to squeeze in a raise), but has any CEO ever volunteered to significantly reduce their own salary to achieve the same goal without massive firings?", "label": 0}
{"text": "Imagine how much money the company would save if they fired all of their employees except the CEO. Then he could get paid a percentage of all that savings and no downsides.", "label": 0}
{"text": "Microsoft has nearly a quarter million employees, shedding 1% of your work force is basically churn.  Meanwhile they've had tremendous financial results that has boosted their stock price to new highs....", "label": 0}
{"text": "\"ERROR: S4I# I5 F$€D\"", "label": 0}
{"text": "Hey, if you hackers have any ideas on fixing my migraines, take a gander at my chart and lemme know, cuz my docs are stumped.", "label": 0}
{"text": "It's about wall street investor's expectations, not the company", "label": 0}
{"text": "It’s savvy cheap (for them) marketing to get you to try it out", "label": 0}
{"text": "Big \"I'm mad at the ace student for making my grades look worse\" energy.", "label": 0}
{"text": "~~despite~~ **because of**\n\nFixed.", "label": 0}
{"text": "You can repair the majority of issues a John Deere tractor has. The wording of Right To Repair were a poor choice.  Bring on the downvotes, but I own and repair a lot of John Deere tractors.", "label": 0}
{"text": "Jesus how do people like you do this and not fall apart mentally? I mean money is nice obviously but 60-80 hour weeks just sound like they’d break me.", "label": 0}
{"text": "It's just corporate Yenga, \"I wonder if we can also cut corners on this, without everything falling apart\"", "label": 0}
{"text": "He boosted Microsoft's bottom line income 22% last year, to $88bn.  You can not like how much the raw number is, but in relation to how much extra money the company brought in under his leadership, $73m is arguably *underpaying* him.  Put another way, it makes great business sense to pay someone $73**m** if they're going to *make you* and extra ~$20**bn**.  I agree that the number is gross in an absolute sense, but its not like there isn't a strong business case to reward him for his work.", "label": 0}
{"text": "https://cdn.geekwire.com/wp-content/uploads/2024/08/msft-employment.png", "label": 0}
{"text": "We have a word In our country for such a person, it's \n\"absolute fucking Piece of shit\"", "label": 0}
{"text": "I’m so sick of seeing shit like this", "label": 0}
{"text": "Don't get your hopes up. They trust TikTok now.", "label": 0}
{"text": "They think they are the center of the universe", "label": 0}
{"text": "I’m not in software development but I’m an engineering manager. So my comparisons in my area tend to be other industries. If I held the same position at Amazon or Google they would probably pay more. But the same position in another industry would likely mean a significant pay cut.", "label": 0}
{"text": "Your mistake is saying it's him that generates it, stock price changes as much as the wind.", "label": 0}
{"text": "He and Ken Paxton (TX AG) are cut from the same waste-of-tax-payer-dollars cloth.", "label": 0}
{"text": "Totally unrelated: I love gog because there I actually own the game I buy.", "label": 0}
{"text": "I’ve advocated that CEOs should only be able to exercise a small portion of their option during their tenure. The majority should be restricted until 3 years after they leave. \n1. Removes the incentive to cut corners and put profit over quality. \n2. CEO’s are highly incentivized to leave a well run and stable organization when they leave. \n3. They are 100% vested in making sure the next CEO is a good one.", "label": 0}
{"text": "Because they are the only ones doing it? No it’s because the us gov wants to seize china because the of US governments will to keep western hegemony amongst the world", "label": 0}
{"text": ">When asked if he fears “low quality, shallow content generated by AI” will make its way onto Reddit, Huffman answered, in part, that the source of AI is “actual intelligence,” and that “there’s a general lowering of quality on the internet because more content is written by AI. But I think that actually makes Reddit stand out more as the place where there’s all of this human content. What people want is to hear from other people.”\n\nToo bad Reddit is increasingly overrun with garbage AI bots.", "label": 0}
{"text": "Already disproved, more than once. Next.", "label": 0}
{"text": "Well he did save the company a crap load of money", "label": 0}
{"text": "You're confusing head count with layoffs (not everyone who leaves gets laid off, people can quit too), and those are old figures from a year ago. As of fiscal year 2024, which is from Jul 1 2023 to Jun 30 2024, there was a net increase of 7,000 jobs. And in fiscal year 2023 there was no net change in headcount.", "label": 0}
{"text": "LLMs do *nothing but* analyze statistics. They are a statistical model of internet text.", "label": 0}
{"text": "You don’t get the timing:\n\n1) Lay off a bunch of people.\n2) Report cost savings on your balance sheet in your annual report.\n3) Pay bonuses for meeting cost savings KPIs.\n4) Rehire people.\n\nRinse and repeat.", "label": 0}
{"text": "Lena Khan kicks ass", "label": 0}
{"text": "A surprising number of people don't realize that books, movies, etc that allow for \"renting\" cost a lot more than the random retail copy you can pick up at Walmart.", "label": 0}
{"text": "It's doing exactly what it was designed to do - summarize the articles returned in the search results.\n\nIf those articles have incorrect IQ numbers that's hardly the AI's fault.", "label": 0}
{"text": "Amazing how people forgot how to fix their own things due to greed and aggressive capitalism.", "label": 0}
{"text": "Until game developers form unions and create collective bargaining power, they'll keep getting treated like shit", "label": 0}
{"text": "That might be true; I don't know enough about it. I will say that one of the reasons Americans prefer not to operate in a union is because of our \"American Exceptionalism,\" where we would rather have the chance to negotiate higher salaries for ourselves and potentially make more rather than negotiate on behalf of our fellow employees.\n\nMany people say they would prefer a union here, but I think if they were faced with the dues they would pay and the lack of individual negotiating power it leads to, they would change their minds.\n\nIn tech especially, unions are hard because it isn't as simple as \"X years of experience confers greater value,\" which is typically how union salaries are determined. In tech, the value difference between a decent programmer and an exceptional one can be 10X, and that difference isn't necessarily tied to your years of experience. For that reason, most would prefer to negotiate for themselves.", "label": 0}
{"text": "When you’re that inbred, everything seems like censorship ", "label": 0}
{"text": "Nah, zipping and unzipping would slow things down a lot\n\nThe solution is to 1) make code that can read from multiple memory sources in the correct order (sharding) 2) treat it like a really big stick of RAM / GPU", "label": 0}
{"text": "I love this dude more and more… Should finally finish BG3… Stuck at the early stages of act 2 for months now…", "label": 0}
{"text": "There's a difference between outputting the most statistically likely reply based on the input it's given, and analyzing statistics within their training data for meaning.  All that data is just a series of characters to an LLM, it's just a Chinese Room that hands back a reply without any inkling of what it means.", "label": 0}
{"text": "I think it’d be closer to $610k after tax, not that it makes a big difference lol", "label": 0}
{"text": "Not devastating to the company, devasting to the workers, their family, and their local economies where they pay for goods, services, and taxes...\n\nThat shouldn't have to be explained, but go off I guess.", "label": 0}
{"text": "omg you work for my bank?!?\n\n20+ char password but app/website only accepts 8 chars. 🥲", "label": 0}
{"text": "I’d also appreciate it if they just deleted everyone’s debt while they were at it, thanks", "label": 0}
{"text": "I wonder how many times each person in the U.S. has had their data leaked?", "label": 0}
{"text": "The fiduciary responsibility is great and all but you could quite easily create an equally weighted legal responsibility towards the employee.", "label": 0}
{"text": "Citizens United did not say that companies could bribe politicians. They determined that a film, which was made for propaganda purposes, could not be blocked under campaign contributions.\n\nCitizens United explicitly is about NOT giving money to politicians directly", "label": 0}
{"text": "Back when engineers ran things.", "label": 0}
{"text": "I don’t want to defend the second  biggest faceless company in the world - but Microsoft had 221k employees in 2022 and 228k employees in 2023. And not much change since then\n\nBig corporations like MS HAS to fire and rehire employees as time passes to stay agile. VP’s promise ROI on their big projects, and if after a few years that ROI isn’t achieved, entire departments are let go. This isn’t related to the CEO, it’s how giant corporations have to operate\n\nOn the other hand - nobody will know that Microsoft hired a of new head counts in areas such as their cloud department (Azure) because those don’t generate clickbait headlines", "label": 0}
{"text": "Microsoft completed their acquisition Activision in 2023, so none of the employees gains from the acquisition have anything to do with their employee increases in 2024. In fact, the layoffs that Microsoft conducted in relation to their Activision Blizzard acquisition took place in January 2024, so the layoffs are included in the 2024 numbers while the acquisition of employees were not. Further bolstering my point. \n\nIs that a bit more clear now?", "label": 0}
{"text": "I can get used to not owning Ubisoft games, but Ubisoft will have to get used to not getting my money", "label": 0}
{"text": "As a regular person, can you imagine getting a 63% raise without a promotion?", "label": 0}
{"text": "Sorry, I have a job.\n\nResponded to their double-down on misinformation.", "label": 0}
{"text": "Because he presided over what shareholders wanted to see and the richest are EXPECTED to be rewarded for being toadies to their shareholders.", "label": 0}
{"text": "IQ scores are related to race though. This is well known.", "label": 0}
{"text": "I would legitimately cry my eyes out as that is literally life changing money for me … ::sigh:: fucking system man..", "label": 0}
{"text": "We really should bring back the 90% tax bracket.", "label": 0}
{"text": "I know it does from other similar cases, I don't feel like checking this time. \n\n\nDid you check that it doesn't? Because their stock sure did rise this year ", "label": 0}
{"text": "Proud owner of a lovely letter from this breach!", "label": 0}
{"text": "Oops… sorry …here’s 15 minutes of “credit monitoring”.", "label": 0}
{"text": "You have your timeline wrong on this. I suggest doing 3-5 minutes of research.", "label": 0}
{"text": "There's always securities fraud or crypto scams.", "label": 0}
{"text": "Me neither, but my suspicion is that if you caused enough trouble with a prompt-based attack, the courts wouldn’t see a legal distinction.", "label": 0}
{"text": "Small price to pay for traffic", "label": 0}
{"text": "Idk. I use digital assistants daily, I make routines and automations, use Google translate with my camera, take and edit photos, etc. It would be nice to have more of that power locally instead of relying on a server somewhere being active just so my phone or alarm clock can make sense of what I am saying.", "label": 0}
{"text": "Hahahahah.  My previous company pays google hundreds of thousands of dollars a year and when our search traffic tanked we asked them why and what we need to do to fit it and they told us to go fuck ourselves.  They claimed it would give us an unfair advantage.", "label": 0}
{"text": "Can we just, like... unplug the internet for the few days before election day? Have the I.T guy pull a \"service down\" trick and tell America \"Yeah, just go outaide for a bit, I'll get it fixed\", and then miraculously have it come back on at 12:01 on Nov 6th?", "label": 0}
{"text": "So they can justify charging you more", "label": 0}
{"text": "> while other publications will refuse to publish anything <period>\n\n\n\nFTFY\n\n\n\n\nCan’t racistly report that minorities are committing crimes if you don’t collect race data <bigBrainMeme>", "label": 0}
{"text": "As long as youre oushibg for abtitrust legislation and lawsuits by the government *everywhere it exists*, i for one am perfectly fine with breaking uo google as an entity. Lets bring back the Fairness Doctrine while we are at it.", "label": 0}
{"text": "He wants google to say no, which will be “proof” that they are anti-Trump.", "label": 0}
{"text": "Maybe we should just make all data free and legal. Then the street value would tank and it wouldn’t be worth stealing. \n\nPerhaps authorities could offer free data at public clinics. Of course it might make sense to limit the quantity you’re allowed to have on your person for personal consumption. Above a certain quantity would net you a charge of intent to distribute. \n\nAuthorities could further undermine the market by cutting pure data with impurities to dilute its potency and make it less desirable.", "label": 0}
{"text": ">This ruling is not about game preservation. This ruling is about access, which is not the same thing.\n\nIt is to redditors trying to justify piracy.", "label": 0}
{"text": "that's actually becoming a new type of pentest, which is breaking LLM into doing stuff it shouldn't do. So yes it kind of is hacking, a gray area yet, but it is depending on what you do with it", "label": 0}
{"text": "Can you imagine how great it would be if there was a 'steam' for movies and TV series? The current model of paying 10 different streaming providers is terrible, yet that's what Ubisoft wants to do to gaming", "label": 0}
{"text": "The news should \"_because_ of layoffs\", not despite.", "label": 0}
{"text": "Thanks for the rabbit hole lol", "label": 0}
{"text": "Going, Boeing, Gone!", "label": 0}
{"text": "Making like 6 million a month lol", "label": 0}
{"text": "It was the president of Wisława Szymborska's Foundation, he knew her and apparently has rights to her creations, etc.", "label": 0}
{"text": "true comment. apple's fight against right to repair is the next level.", "label": 0}
{"text": "Can we sue this guy for wasting our taxpayer dollars?", "label": 0}
{"text": "Now that Twitter is effectively dead.  Why are you trying to create a new one?!", "label": 0}
{"text": "There should be a law against executive pay raises during a financial year the company had layoffs.", "label": 0}
{"text": "God I hate the new outlook.", "label": 0}
{"text": "Freaking ban buybacks and strictly regulate dividends so all workers get a cut, proportional to whoever gets the biggest cut, so no one can be paid more than a certain number of times more than the lowest paid.", "label": 0}
{"text": "Amount of work isn't the driver of salaries. Marginal product is.", "label": 0}
{"text": "> The UN published a report a while ago suggesting many countries stopped collecting or made it illegal to collect demographics on race\n\n\n\n\n\nIt should be illegal to *not* include this information. ¿What is everyone afraid of discovering? ¿That certain groups might actually commit more crime than others? ¡Shocking!", "label": 0}
{"text": ">“As we move forward, our D&I commitments remain unchanged,” Microsoft spokesperson Jeff Jones told The Post.\n\n>“Our focus on diversity and inclusion is unwavering and we are holding firm on our expectations, prioritizing accountability, and continuing to focus on this work.”\n\nIt sounds like they're just cutting funding to programs to increase DEI hires. Not changing their attitude, at least publicly, towards diversity.", "label": 0}
{"text": "How would such a big number be stored? How do you compress that kind of info? It sounds weird to me as there’s no intuitive way to compress prime numbers", "label": 0}
{"text": "It's okay us sheep will sit here and take it and do nothing about it. Who cares right? We get iPhones and Netflix, who cares about the evil dragon hoarding gold made of the backs of Chinese slave kids?", "label": 0}
{"text": "Wake me up when they find an odd perfect number.", "label": 0}
{"text": ">The state doesn't directly dictate what the media say but the outcome is the same. The media is in lockstep with the official stance in international matters, that involve a non western entity.\n\n  \nYou are obviously blinded by your view of the world, otherwise there would be no FOX news or media writing about Snowden or criticizing the Iraq war and so on. You think America dictates everything in the west, but that's not how it works. It's remarkable how close you are to how Putin views the world. He wants to talk directly to the president of the US, because he only think they are the ones that matters in Nato for example. He doesn't understand that Nato for example, or EU, is made up of multiple nations working together with different viewpoints, but common goals. But since he thinks everyone is like him, he can't really grasp that. Seems like you are stuck in the same train of thoughts.\n\n>  \nMy example illustrate that countries do extreme things in war time.\n\nAnd those deserves to be condemned. I think you underestimate the severity of Russian abuse of civilians. Bucha, Izium, Mariupol. That's the main reason Russia get sanctions and is why Linux cut of russian people from it's projects. It's a small loss, compared to the insane suffering of the Ukranian people that they have to suffer every day.\n\n>  \nSaid war crime are said to be \"abduction of children in warzone\" aka **evacuation**.\n\nIt's genocide. ICC don't accuse people lightly.\n\n>  \nHe did no such thing. They were violence and the police handled the violence. The vote to remove him didn't even reach the threshold oh 3/4 of members of parliament as required by the constitution. [https://www.rferl.org/a/was-yanukovychs-ouster-constitutional/25274346.html](https://www.rferl.org/a/was-yanukovychs-ouster-constitutional/25274346.html)\n\n>\n\nI mean, my point was that no one supported him and his pro-russian views. Ukraine, like a lot of USSR countries just don't like Russia and it's easy to guess why. Russia could've chosen a peaceful road, but they wanted to dominate those countries and in return they turned to the west.", "label": 0}
{"text": "you're not starting a \"revolution\" with $16 million...", "label": 0}
{"text": "Well only once", "label": 0}
{"text": "Then the sub has the power to prevent posts that have already been posted. If mods want it down they can take it down. I would think it is uncomfortable to have your skivvies in a bunch this often over less than nothing, but you should do you. Just leave me out of it. Me, if I don't want to read it I just keep going but then I'm not the average person on here. YMMV.", "label": 0}
{"text": "Societal Cancer", "label": 0}
{"text": "Rich people Suck", "label": 0}
{"text": "Another boeing bites the dust 🕺", "label": 0}
{"text": "Why would anyone need so much money. After all he needs same food every one eats and a house to live in. Look at Biden , he private home in Delaware is not too big and he is the commander in chief of County.", "label": 0}
{"text": "Wow. Yeah I didn’t read it yet of course!", "label": 0}
{"text": "what makes this one better than all the failed wearable AI widgets that come before it?", "label": 0}
{"text": "News of layoffs are almost always followed by an increase in stock price, especially if the reductions save the company billions in the fiscal year.", "label": 0}
{"text": "There should 100% be a CEO max pay cap , only business owners should profit like that.. not CEOs of publicly held companies", "label": 0}
{"text": "They're not \"bombshells\" if they're fake", "label": 0}
{"text": "CEO pay is obnoxious, it needs to come WAY down.\nI have no clue why stockholders sit by and allow this shit to happen.", "label": 0}
{"text": "Nothing but capitalism everywhere", "label": 0}
{"text": "You can't honestly say you're surprised.", "label": 0}
{"text": "Exactly- it’s not “despite “ it’s “because of”.  Board rewards CEO for short term gains - that’s all they care about.", "label": 0}
{"text": "To the surprise of no one. ", "label": 0}
{"text": "Of all the stuff he is worried about Trump, all to appease the cult", "label": 0}
{"text": "GTFOH with this goofy-ahh headline. \n\nApple: “We’ve introduced a bug bounty program for our AI features”\n\nGizfraudo: “Apple *dares* anyone to find a single fault fault with its beautiful, perfect darling! Does their arrogance know no bounds?!”", "label": 0}
{"text": "What’s the point of Disney if sucks all the human out of its movies and media??? Seriously, these greedy MBAs at it again! Disney needs to go back to human basics and focus on doing everything they do live action without the dark moody tones and with absolute minimal amount of cgi/vfx and use only particle effects, and for 2D animations use human hand-drawings, human American effort arts only. It will cost lots of money but worth it in the long run.", "label": 0}
{"text": "Missouri AG looking for insider information to pass on to fascists looking to create their own special search engine; that's what I get from this. \n\n\nHow it works. If I search up Hickory BBQ, I get hits for that. Then, upon my next search, I'll likely see ads for Hickory BBQ.\n\nIf someone isn't seeing Trump \"info\", they likely aren't searching for it, so it's not going to show up. \nWhat this useless AG is wanting is for Google to push pro-Trump propaganda upon everyone, even if they aren't searching for political information. \nOr, as above, he's wanting insider information so they can figure out how to push their propaganda.", "label": 0}
{"text": "In this case it's doing neither. Perplexity and Google AI use LLMs as a text summarizer on the articles returned in the search results, and so they will say whatever the search results say. \n\n>All that data is just a series of characters to an LLM\n\nThis isn't correct either. The entire thing that makes neural networks interesting is that they form internal representations of high-level concepts. They manipulate the objects inside the data, rather than the characters or pixels that make it up. \n\nThis allows you to prompt it to, say, 'extract the complaints from these reviews' and it will know what a complaint is and return only the parts of the reviews that are complaining.", "label": 0}
{"text": "So what response should I have to my husband who says they get paid that much because of the tough decisions they have to make. Make it make sense to me. He says we live in capitalism and we vote for laws where such things are legal.", "label": 0}
{"text": "I mean they've been doing that for over a decade now.", "label": 0}
{"text": "Your time to do this is running out. Enjoy it!", "label": 0}
{"text": "Hi I work at Dell and they are trying their best to make us quit? 5 day workeeek, tracking login and logout timings, reduced pay on holidays", "label": 0}
{"text": "Nope, pretty much the same.\nIf one is legal then the other is legal. What “election interference” law would this violate. Those are about access to polling stations, not access to messaging", "label": 0}
{"text": "Sorry you have to use special characters and mixed case alphabets. Re-type your password", "label": 0}
{"text": "Wow that took forever! This is great since the people who McDonalds tried to sue out of business made the machines better than McDonalds had designed them to be!  [https://www.wired.com/story/they-hacked-mcdonalds-ice-cream-makers-started-cold-war/](https://www.wired.com/story/they-hacked-mcdonalds-ice-cream-makers-started-cold-war/)", "label": 0}
{"text": "Takes his cut from the layoffs the shareholders take the rest.", "label": 0}
{"text": "You didn't read the article at all, did you?", "label": 0}
{"text": "Step 9: password missing special characters, need to roll over", "label": 0}
{"text": "In the last year I'm aware of six times for myself based on mail I've received from various companies. It is completely out of hand.", "label": 0}
{"text": "Weird, the Chinese hackers are operating from inside the Pentagon.", "label": 0}
{"text": "Pretty sure this is where some executive gets a kickback from the private company getting the lock-in service.\n\nBig corporations have this kind of cannibalism all the time.", "label": 0}
{"text": "Homeboy needs that extra cash to pay for his mistresses", "label": 0}
{"text": "That’s a feature not a consequence. That’s why they did the lay offs, that and stockholder returns.", "label": 0}
{"text": "Listened to this this morning. Hosts point out the hypocrisy of GOP muppets like this claiming censorship & wanting tech platforms to be completely unbiased but are SILENT about Elon with twitter. Ultimate hypocrites \n\nBailey is also one of the biggest tools in the country \n\nhttps://podcasts.apple.com/ca/podcast/hard-fork/id1528594034", "label": 0}
{"text": ">I subscribe to Reddit and I'm happy to pay a fee to avoid advertising\n\n\n\n\nAnd I’m happy to use an adblocker for free. If I can do something for free, why would I pay out of my limited budget with no disposable income?", "label": 0}
{"text": "So you support Hamas killing Israeli children?", "label": 0}
{"text": "I'm wondering about Russian influence. Earlier this year they were messing about with a satellite that [was put in the same orbit as a US satellite and was \"likely a counterspace weapon\".](https://www.npr.org/2024/05/30/nx-s1-4975741/what-to-know-russia-satellite-space-weapon-cosmos-2576)", "label": 0}
{"text": "How about instead of *me* paying a subscription to *them* the government drafts a law making it *illegal* to sell any users data ***without compensating them for it***. Even dairy farms feed their cattle. Under our existing system we’re expected to ***find our own food*** while we are milked for profit.", "label": 0}
{"text": "For sure I definitely didn't put any effort it lmao. Workers are only overpaid, and do minimal work. Higher ups and those in charge definitely don't fit either description.", "label": 0}
{"text": "wtf is this?\n\ndid u link to a video that just confirmed what i said?? 🤣", "label": 0}
{"text": "Fuck these fucking bilionaires", "label": 0}
{"text": "At this point, I'm certain that is the whole point of social media.\n\nGive the plebs a platform where they can all whine together about the same thing, and they won't feel the need to actually do anything about it.", "label": 0}
{"text": "Happy Cake Day.\n\nBeen running into this at work with a coworker recently(two developer team). The consequences of his actions are finally coming down on him after months of shitty behavior. \n\nI'm both sympathetic to the BG3 Devs, and enjoying the schadenfreude of a coworker trying to do the same to me, and it blowing up in his face.", "label": 0}
{"text": "The franchises would but McDonald's corporate doesn't care about that", "label": 0}
{"text": "His comp is likely overwhelming in long term stock (RSUs). RSUs are typically calculated at current stock prices and then the share count is spread over a period of ~4 years.\n\nMSFT is up 83% since 2021 and more the further back you go. So — a lot of the comp increase is due to Wall Street driving the price of the stock up significantly under his tenure.\n\nI’m not sure I’ve ever seen an exec contract that stipulates no-layoffs — but I bet they’ve existed.\n\nIt’d be an interesting way to force a counter-balance onto executives. Essentially forces them to only hire exactly who they need and have greater predictability of the future.\n\nLonger term impact would likely be that many of the layoffs never would’ve occurred because those people wouldn’t have been hired in the first place.\n\nUnclear if that’s actually more ideal…", "label": 0}
{"text": "Do you understand that for MS year is from June to June?", "label": 0}
{"text": "I think this is why they're increasingly targeting medical data. Things like social security number, name, address, phone number etc. are already leaked for every American and part of numerous datasets.", "label": 0}
{"text": "So they do have the money... just not for us", "label": 0}
{"text": "Down this mean the McDonalds ice cream machine will now start working?", "label": 0}
{"text": "Pretty much every Republican AG.", "label": 0}
{"text": "Thank God, he’d have been homeless trying to live on a $45mil a year salary.", "label": 0}
{"text": ">> People can get in on the wealth as well\n\nSweet! Would you be willing to let me know which company will give me these returns over the next 10 years? Thanks!", "label": 0}
{"text": "Oh please. You are condemning a entire corporation based on the decision that was likely made regionally. \n\nTheir nonsensical resistance to not only using needlessly complicated machines, and aggressively resisting making them more reliable on the other hand, is worth some energy.", "label": 0}
{"text": "Only 63%.. rookie numbers", "label": 0}
{"text": "reminds me of a [prank](https://youtu.be/pM4hOXlnYzo?si=Avxjij2cTWM-5LxH&t=288) involving third-party repair of the ice cream machine", "label": 0}
{"text": "Making increased profits year-after-year is only one model of business.", "label": 0}
{"text": "100% agree. I want a presentation outline, check my tone on an email, or come up with a way to do something in excel the ChatGPT is where I’m going first. Why would I waste my time coming up with extra words when the base thought is what I’m best at?", "label": 0}
{"text": "I had a peer tutor who worked with my Spec Ed class. He was awful. One day, he came in and promptly fell asleep on the couch at the front of the classroom. We all sat, looked at each other, and waited. Several students asked if we should do something. I told them we would just wait him out. Eventually, he woke up. I told him that I hoped that the day that a class full of kids with sub-average I.Q.s asked what was wrong with him was not his best day. We failed him. Admin said his parents would throw their weight around and insisted he get a decent grade. In the end, I guess we all learned a little something.", "label": 0}
{"text": "It’s taken a toll. No question.", "label": 0}
{"text": "Very stupid.", "label": 0}
{"text": "Ima find the next one 😎😎😎", "label": 0}
{"text": "Honestly, from ethics to security, people probably would be better off as open source.", "label": 0}
{"text": "I think it’s just the first time. It takes forever to put together a case. Especially one where the crimes too place a while ago. ", "label": 0}
{"text": "Because \"succes\" is measured by profit made for shareholders, not number of people employed. Capitalism in all its glory.", "label": 0}
{"text": "Nothing like spacecraft designed by accountants!", "label": 0}
{"text": "Mine came yesterday.", "label": 0}
{"text": "Not \"despite\" but \"because\".  \n\nThe CEO runs the business for the benefit of the business.  Cutting down on unnecessary operating expenses while still delivering on the strategic goal is a good thing.", "label": 0}
{"text": "What’s he’s really done is cut into the long term earning Microsoft could have gotten with these employees skills if they were technical \n\nMicrosoft is an Integrator he cut into Microsoft’s earning potential but cutting loose talent that can now be hired by companies that relied on Microsoft’s talent bench \n\nShort sighted but whoever wa scored may they get scooped up for their Microsoft knowledge", "label": 0}
{"text": "Where the hell did you get that formula?", "label": 0}
{"text": "No MFA. It’s not rocket science. If I was in charge of that system and it had no MFA I wouldn’t be able to sleep at night.", "label": 0}
{"text": "Claims with no evidence. Not how head of legal system of state should act. Unqualified.", "label": 0}
{"text": "At this point every American alive and dead has had their data leaked.", "label": 0}
{"text": "these comments are cancer. AI plz wipe out mankind.", "label": 0}
{"text": "Like released and declared innocent if that is what the evidence suggests? \n\nI know this is the internet (and worse, reddit) but seriously, what happened to \"innocent till proven guilty\"?", "label": 0}
{"text": "Take it you’re a stock holder. Anyways, don’t shoot the messenger. That’s the situation on the front lines, while the generals are sipping champagne and eating caviar. It is what it is.", "label": 0}
{"text": "A company that big will always have lay offs as they drop projects and change products.", "label": 0}
{"text": "There was a toilet paper shortage because people were TAKING MORE THAN WHAT THEY NEED.", "label": 0}
{"text": "Neat, but I can't help but wonder how much power was used to achieve this ostensibly useless outcome.", "label": 0}
{"text": "The entire team he lead made a lot of money. Microsoft notoriously compensates very well with RSUs. \n\nBuilding a trillion dollars of value in a year deserves compensation. \n\nHow much is fair? \n\nThis clickbait bullshit is ridículos. Microsoft ended the year with 7000 more employees than it started with. The company cut divisions that it didn’t think were the right strategy and we come here on Reddit and demonize success. \n\nMaybe it gets me downvoted, IDC. It’s dumb.", "label": 0}
{"text": "Hello! **Please read this message very carefully.**\n\nUnfortunately, since your account is less than a week old and spam from new accounts makes up a significant portion of all spam, your post was automatically, temporarily removed. **Have a tech support question?** Please head over to /r/techsupport, /r/asktechnology, or other tech-centric subreddits listed on the sidebar.\n\nYou may still contribute and earn some karma by *commenting* on other existing posts in /r/technology instead. Additionally, you may make meaningful contributions to [other subreddits](/subreddits) to increase your karma count. Tech support questions/opinions/suggestion requests, surveys, blogs, and videos will **NOT** be approved. If this is a legitimate submission that is not covered in the previously listed criteria, please message the moderators to have them manually review your post, or wait a few days and try again. \n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technology) if you have any questions or concerns.*", "label": 0}
{"text": "Clickbait is fucking cancer", "label": 0}
{"text": "Start \"backing up\" your games. 🏴‍☠️🏴‍☠️ Some people I know have 50TB of \"backups\" 🏴‍☠️🏴‍☠️", "label": 0}
{"text": "There is some **Gravity** to these allegations.", "label": 0}
{"text": "You mean in the observable universe. Otherwise, there are infinite number of atoms in this universe", "label": 0}
{"text": "There’s a Google extension called ‘bye-bye AI’ - There’s a similar one for Firefox. Gets rid of the stupid AI result and brings back peace to my mind.", "label": 0}
{"text": "I honestly thought they knocked it out of the park when the consolidated their mobile and PC software into a broad “Windows 10” experience and tied the two up with things like UI synergies and Continuum etc.\n\nHow a decade changes things. They obviously closed down their phones and they’ve sold their PC soul to Big Data a bit too willingly for my liking. \n\nI will be using Macs for the foreseeable future, sadly. ", "label": 0}
{"text": "Do people even buy ubisoft games anymore? I feel like nothing they put out ever looks good anymore.", "label": 0}
{"text": "Are you really so deep in an echo chamber that you think it’s election interference if my website doesn’t show links to your favored candidate’s content?\n\nYou think that I should be held legally responsible because my self-hosted website only has links to other candidates?\nBecause here is the deal, there is no threshold of popularity. If it’s legal for me not to host Trump links, then it’s legal for Google not to host Trump links", "label": 0}
{"text": "And here’s Cuba without power this week - I’m not saying it’s connected - just damn glad we got that next prime number.", "label": 0}
{"text": "Hey look it's the yet you participate in society guy.", "label": 0}
{"text": "It hits brutally hard once you put it like that.", "label": 0}
{"text": "Hit me baby one more time", "label": 0}
{"text": "Roll on new encryption", "label": 0}
{"text": "Didn't they play this card last election and lose?", "label": 0}
{"text": "To be fair, the only metrics CEO pay are tied to are relative to the performance of the company in the markets and any other goals the board has established for them to achieve. If they successfully reduce labor costs while delivering value, that’s technically job well done.\n\nCompanies exist to create value for shareholders, they don’t exist to serve the greater good (that’s what non-profits and government agencies are for), nor are they there to create and preserve jobs for the sake of creating and preserving jobs (that’s what job programs are for).\n\nUltimately, what jobs are created or retained will have an impact on the business (positively or negatively), and that is on the management team to deal with.\n\nThe closer to the top you get, the more the impact from decisions. They aren’t paid tens of millions because their daily work is tens of millions of times harder, it’s because each decision they make can create a multi-billion dollar swing for the business and shareholders, whereas the decisions made by someone making $60k likely only swing the company by six figures or less.", "label": 0}
{"text": "Listen, these are high paying competitive companies.  High performers get paid a lot.  The middle tier still do well.  The bottom are done. Even if they didn't cut you they wouldn't pay you so you might as well get cut.", "label": 0}
{"text": "I agree that McDonald’s Quarter Pounders with cheese are by far the best burgers ever! Highly recommend, 5/5 stars.", "label": 0}
{"text": "Rage bait. CEO compensation is not the same as employee pay.\n\nAlso, MSFT added more workers than were let go.", "label": 0}
{"text": "That’s not possible. I’ve been told he’s in their pockets so no hacking is necessary.", "label": 0}
{"text": "Yeah even if I had 10000BTC when it was worth fractions of a penny I would have sold when it was worth $10000 and never waited long enough to see it go to millions", "label": 0}
{"text": "Tech is always about people", "label": 0}
{"text": "Did you read the article? Lol\n\nThis is more an infosec bounty where they’re asking to find vulnerabilities if you can \n\nThey feel good enough to be offering this for their bounty program which is pretty standard across tech security programs", "label": 0}
{"text": "You're certainly so deep in an echo chamber that you don't see any problem with it. If it was my side doing it, you'd probably be burning down buildings. We don't want to suppress Kamala content. Everything about Kamala makes her polling worse. You should be asking why your side is doing it and why you support it.", "label": 0}
{"text": "Awesome, thank you very much for the detailed writeup! I'll try Sleep/Standby out for a couple of weeks and see how it goes!", "label": 0}
{"text": ">Federal minimum wage\n\nWhich hasn’t been raised in 15 fucking years. 🙃", "label": 0}
{"text": "Is it real or is this something schemed up by the Fox news because they cant stand him paying his employees a good wage?", "label": 0}
{"text": "Hey, I meant the math notes section of the app, as the post was talking about using AI. If you still want proof, I have attached it to the main comment.", "label": 0}
{"text": "someone needs to bash his face in.", "label": 0}
{"text": "Why does he look like clippy?", "label": 0}
{"text": "Greed wins again\n\nFIFY", "label": 0}
{"text": "Hey, I meant the math notes section of the app, as the post was talking about using AI. If you still want proof, I have attached it to the main comment.", "label": 0}
{"text": "When you see a greedy boss, it should be duty for the workers to leave immediately.", "label": 0}
{"text": "Hey, I meant the math notes section of the app, as the post was talking about using AI. If you still want proof, I have attached it to the main comment.", "label": 0}
{"text": "They are the same i agree. But from the company perspective its not wrong to do whats best for the company and shareholders, just like how workers only care about themselves", "label": 0}
{"text": "Its 41.8 MB", "label": 0}
{"text": "The fact that this is even acceptable let alone encouraged in our society is one of the biggest problems. We could be so much better.", "label": 0}
{"text": "They also targeted Harris and Walz.", "label": 0}
{"text": "They did say they hope he gets what he deserves. And the guy is a fucker for many other reasons so I don’t know what your issue is", "label": 0}
{"text": "It's a parasitic mindset to destroy future research and technology for short term materialistic gains. I am saying this as a value investor.\n\nFinance provides no benefit for society. All it does is skim off the top of every transaction with no real work. This excessive compensation to CEO's after gutting the research and development departments is just a waste of money.", "label": 0}
{"text": "Stupid Bixby.", "label": 0}
{"text": "They can revoke his clearance and force him to limit his access to information at the same level of an investor.  What else could he do? Sell the company? Move it overseas? Not gonna happen. Bonus... this will likely make it easier for Gwynne and the actual engineers to do their jobs without dealing with his manic and impulsive behavior.", "label": 0}
{"text": "Hey, I meant the math notes section of the app, as the post was talking about using AI.", "label": 0}
{"text": "https://en.m.wikipedia.org/wiki/Dan_Price\n\nGo to Personal Life -> Legal Issues.\n\nBro has a history.\n\nDoesn't make him guilty but the presumption of innocence is so the court doesn't rail road you, not to protect you from your neighbors.", "label": 0}
{"text": "And I can't even get a fucking raise after busting ass on certifications..", "label": 0}
{"text": "Depends, have they SLAMMED anyone recently?", "label": 0}
{"text": "what profit?Those game are not sold anymore! They could very well put a limitation to what can be freely accessed/shared, like, only game 20 year older", "label": 0}
{"text": "Hey, I meant the math notes section of the app, as the post was talking about using AI. If you want proof, I have attached it to the main comment.", "label": 0}
{"text": "Oh no, what will /r/antiwork do for content now?", "label": 0}
{"text": "BG3 is developed by Larian Studios.\n\nThey're Indie in the literal sense, independent.  \"Divinity: Original Sin\" was self funded via Kickstarter, its quality has been deemed AAA while its game budget wasn't, which is why they got the nod for BG3.", "label": 0}
{"text": "Remember when this dude pretended to be the moral high ground when it came to tech CEOs.", "label": 0}
{"text": "To be fair that's like 2 to 500 million dollars.", "label": 0}
{"text": "Another big woopsadaisy? If you think about, they really just sold everyone's PHI to an unnamed entity. It could be anyone and now they have full access to it. Maybe it is in their best interest to leak our info and claim it was stolen (since they literally allowed it to happen even though they are expected to uphold data security standards in order to store PHI). Good thing no one will investigate that one", "label": 0}
{"text": "Yeah no one is arguing that. Of course if I could hire 1 person to 5 people just I would do that as a business owner. It's the moral dilemma of it. Kinda fucking scummy to lay off a bunch of people who's lives depend on having a stable job vs CEO mcfucknut #4 getting another hefty paycheck for his mansion and yacht club", "label": 0}
{"text": "How shitty is their system security when one unsecured virtual desktop got them throughout the system?\n\nThey have almost half a million employees.  MFA alone won't do shit.", "label": 0}
{"text": "Price’s 2015 decision to raise minimum salary to $70,000 coincided with an ongoing lawsuit with his brother, Lucas Price. Lucas alleged that Dan’s actions financially harmed the company and reduced shareholder value. Some critics speculated that the high-profile pay raise was partly intended to build public goodwill and potentially counterbalance the legal dispute.", "label": 0}
{"text": "But then how will they keep the grift they have going?", "label": 0}
{"text": "Right…it’s an important distinction, because the people who are able to pull strings with money/favors would have had to offer something of value in return (the balancing act no one enjoys talking about as a reaction to headline porn like this). \n\nIn an oligarchy, there doesn’t need to be any rationale for decision making…it’s just whatever the people in charge want to impose.", "label": 0}
{"text": "Good ol ‘Yes I’m Right’", "label": 0}
{"text": "Whats the point of these posts? All it does is further prove that 1 good CEO is worth hell of a lot more than X # of normal employees.", "label": 0}
{"text": "65% seems quite a bit higher than I've seen (Pew, 55 -57%). Don't get me wrong, I'd like your number better.", "label": 0}
{"text": "Yeah, but these are some decent bounty payouts.", "label": 0}
{"text": "Now calculate how long it would take to type in the password. :D", "label": 0}
{"text": "Probably laid them off to afford his ridiculous salary", "label": 0}
{"text": "It most likely means that NASA is unaware of Elon's security clearances and this information about the communication Elon is involved in was never supposed to be made public. He has top secret security clearance for a reason. Emphasis on top secret.", "label": 0}
{"text": "He has a good shot at President now", "label": 0}
{"text": "Not as uncommon in the tech industry as you might think!", "label": 0}
{"text": "I mean, Google does manipulate search results", "label": 0}
{"text": "Are you seriously unable to understand the issue, or just playing ignorant? Maybe not from the US?\n\nMy issue is people are ignoring a fundemental part of the legal system in favor of mob rule. \n\nFeel free to list reasons he is a douchebag, but those are all entirely besides the point of the article. When that is illegal, put him on trial for that. Till then, maube the bloodthirsty reddit mob can wait for a verdict.\n\nYou know, basic American law.", "label": 0}
{"text": "DQ, where your order comes out in either 30 seconds or twenty minutes regardless of what it is.", "label": 0}
{"text": "[The real reason McDonalds ice cream machines are always broken.](https://youtu.be/SrDEtSlqJC4?si=2fUI6NtgPbtcekse)", "label": 0}
{"text": "plant the seed and watch it grow comrade", "label": 0}
{"text": "What does eat the rich even mean to you? Tax em? Kill em? Would be nice to have a proper discussion", "label": 0}
{"text": "I’m fine with that as long as we also go after the actual ISPs and cell phone providers. ", "label": 0}
{"text": "It is both, actually. We in America have a history of mob lynching, in case you forgot.", "label": 0}
{"text": "The one upside to all of this is how eye-opening it’s been. I always assumed these things were gradual too, and driven by a crisis or extreme situation. It’s fucking unreal to me every single day that humans are so evil and stupid.", "label": 0}
{"text": "I keep thinking about your complaint. What “iconic content” is scrubbed from Google?", "label": 0}
{"text": "Socialism for the win. Federally capped CEO salaries!!", "label": 0}
{"text": "I mean that is the capitalism for ya. Hate the game not the player", "label": 0}
{"text": "I'm not a big math's person, in fact I think I've got dyscalculia so this may be a stupid question...\n\n... What is the point of doing this? Do we actually learn anything other than there's another bigger number that meets the criteria of a prime...? Like, why spend this much cash and energy to find another prime... Does it have a practical use?", "label": 0}
{"text": "Is every billionaire a sexual deviant?", "label": 0}
{"text": "Yeah and lynching mobs was the regular occurrence during the founding of our country and we literally required jail houses to release mug shots so we knew who they were holding.\n\nThe presumption of innocence and evidentiary standards for criminal liability exist solely to protect you from the state.", "label": 0}
{"text": "I get you, but I disagree that this is like every innovation in history.\n\nAI will go the step further and remove jobs almost entirely. \n\n\nWe will see in 10 years", "label": 0}
{"text": "Ice cream is a loss leader. It serves its purpose, whether it works or not. The idea of the ice cream gets people there to buy things they otherwise wouldn't have bought if not for the prospect of the ice cream.\n\nIt's a fucking racket, and McDonald's couldn't care less.", "label": 0}
{"text": "This is what I think happened in the case of National Public Data. That leak was SSN's for every American and it was stored on $500 Dell servers in a guy's house. The guy was also not an engineer but just some shitty actor. He just declared bankruptcy and says the only thing he owes if $50K because that's the assets the company had. Meanwhile he keeps his mansion etc.", "label": 0}
{"text": "Ok I see you are not willing/able to have a proper discussion.\n\nI hope that you will find ways to be less miserable. Good luck", "label": 0}
{"text": "After reading the article, I’m going to reserve my judgement until the trial. He wasn’t arrested so that seems a bit odd to me.", "label": 0}
{"text": "lol you couldn't understand it anyway, you fucking dimwit.", "label": 0}
{"text": "I got a great idea. Why don't we give the Chinese their own log-ins and passwords? Okay? Save everybody a lot of time.", "label": 0}
{"text": "Please be nice and give the corporation hugs and kisses.", "label": 0}
{"text": "Haha isn't this the super prescriptive influencer on linkedin that virtue signals to companies about fair pay for employees or some bullshit?", "label": 0}
{"text": "Just over here eating my cake and sharpening my pitchfork.", "label": 0}
{"text": "Yes.\n\n* automotive\n* cable television\n* streaming services\n* Hollywood movies\n* Windows OS\n* US healthcare\n* US education\n* US politicians\n* news websites\n\nThese are the just the ones complained about in the last week or two in this sub and similar top subs, regarding paying more for worse quality overall.", "label": 0}
{"text": "and I bet you can find the rest of it in the rest of their executive team", "label": 0}
{"text": "Was it proven that he was guilty in court? Or is this just the start of the trial process?", "label": 0}
{"text": "Yes, corporations should not be able to weigh in on partisan, electoral topics", "label": 0}
{"text": "https://www.agriculturedive.com/news/deere-right-to-repair-ftc-investigation/730432/\n\nYou, apparently, know more than the government.", "label": 0}
{"text": "Not as uncommon as you might think\n\n\nFtfy", "label": 0}
{"text": "Listeria is a healthy choice.", "label": 0}
{"text": "To be fair, he was. He did cut his salary, he did raise the wages of his employees, and I guess he *allegedly* raped someone. People can be two things, but he'll now forever be tied to a rapist charge/claim unless he very publicly beats the charge.\n\nSucks cause that company probably going down, and all those employees will be out that decent job, salary, and benefits.", "label": 0}
{"text": "Neither was Donald Trump.  Rules are different for rich people.", "label": 0}
{"text": "It is okay for them to do it. It is dishonest to claim it is NOT that if it is.", "label": 0}
{"text": "This is fascism. It's using known lies and government power to forcibly suppress the opposition ", "label": 0}
{"text": "It's not despite the layoffs, it's because of them.", "label": 0}
{"text": "Again, NO ONE CARES ABOUT THE HEALTH OF THE COMPANY.\n\nYou think when the bubonic plague wiped out 1/3 of Europe, the public sentiment was \"It's ok because there's still people left for the plague to infect. It'll just backfill the positions it needs and keep trucking on?\"\n\nOr is your self worth defined by long winded replies that closely relate to the topic but completely miss the point?", "label": 0}
{"text": "His top priority is to maximise profits and return on investment for his shareholders. No surprise he gets a pay rise when laying off staff, if he's achieving these goals. Not good for those layed off, but that's capitalism.", "label": 0}
{"text": "Thought this was /r/nottheonion", "label": 0}
{"text": "Not on the content, but yes, I would be fine with the speech rights of corporations being heavily curtailed. This same line of “corporations have rights on par with individuals” is what allows Hobby Lobby to sue over the birth control mandate.", "label": 0}
{"text": "Speaking only for the United States: the physical copies we buy don't, because the first sale doctrine protects us. We buy a copy and we can let other people use that copy as many times as we want. Digital editions cost a *lot* more, and we lose access to it after a certain amount of time or a certain number of loans (whichever comes first).", "label": 0}
{"text": "Just like they stopped the investigation into the corrupt New York mayor and the corrupt senator... Wait a sec they just have missed those.", "label": 0}
{"text": "Okay, let’s see the tangible proof please.", "label": 0}
{"text": "You spelled R wrong", "label": 0}
{"text": "Roast him like a pig", "label": 0}
{"text": "It’s hard to tell with Reddit.\nI have people telling me that companies shouldn’t be protected. Also, you comment makes no sense because Citizens United didn’t say you can give unlimited money to a candidate. That was the whole point. They said you could give money to a non-profit who advocated for issues you care about AS LONG AS THAT ORGANIZATION was not being run by the candidate. It’s why we have Super PAC and there are still donation limits to candidates", "label": 0}
{"text": "If you have such a great understanding of the topic, then why do you think one person is equivalent to another person? They dropped a ton of developers, and then hired a ton of support. This article is honestly bullshit and does not scope nearly enough of the stupid decisions that Microsoft has made in the past 10 months. It focuses on two mass layoffs that don't cover half of the product teams that they've dropped.", "label": 0}
{"text": "How do you know that this didnt happen precisely because and after he got security clearances? The government probably knows about it and theres probably some intentional communication there. Ofcourse the public and anyone else not in the MIC or part of the security clearance circle will misunderstand.", "label": 0}
{"text": "500 of those jobs could realistically be in play if they allocated his salary.", "label": 0}
{"text": "I mean, (1) we've been saying that for a decade now (and instead it's gotten more competitive, not less) and (2) you can always buy a car then?", "label": 0}
{"text": "\n>Citizens United explicitly is about NOT giving money to politicians directly\n\nThe ruling barred restrictions on corporations, unions, and nonprofit organizations from independent expenditures, allowing groups to independently support political candidates with financial resources. \n\nNo, it's about not allowing states or federal government to set limits on certain types of campaign contribution.\n\nSuper Pac are set up to take advantage of this.", "label": 0}
{"text": "More cars, i dont care if gas or battery, is not the way forward. We need world class public transportation that goes wide. We also need laws that make it suck even more than it does to drive a car.", "label": 0}
{"text": "I honestly do blame them after all the shit he has talked about them. Hope they find a way to take him down before the election.", "label": 0}
{"text": "My youtube feed is right wing fascist needle dicks, I click do not reccomend constantly and yet they keep coming.", "label": 0}
{"text": "So, you think states should be able to pass any law they want restricting speech by companies.\nThey could fine a company out of existence for sponsoring a gay pride parade?\n\nThe problem is that I’d rather have the Hobby Lobby decision than a decision that allows the govt to terrify companies into kowtowing to their political whims. Florida is an excellent example.", "label": 0}
{"text": "They don’t say how much his cash component went up by which I’m very curious about.\n\nMSFT is up nearly 25% in the last year, so a CEO with millions of shares and many, _many_ option contracts he can exercise, my gut is that the majority of this boost comes from his stake in the company.\n\nStill shitty that he gets this fat pay bump while thousands got laid off.", "label": 0}
{"text": "Cut his pay down by 90 percent and take away his vacation days, then make him work swing shifts while building a half hour a week in sick time to show him how it feels to be on the shit end of a job.", "label": 0}
{"text": "Steam: https://i.imgur.com/9wFffSy.png", "label": 0}
{"text": "Yes, and super pacs are set up to skirt this fact.\n\nIf a billionaire can donate millions to a super pac to advocate for issues, then their preferred candidate can spend their actual money on other things. \n\nNo one is telling you companies shouldn't be protected from government over reach they are telling you that they shouldn't be allowed to donate unlimited money.", "label": 0}
{"text": "Linking mug shots and lynchings is pretty wild. Please enlighten us with historical evidence.\n\nSecond part is just factually incorrect.", "label": 0}
{"text": "While I appreciate the anecdote, given the enormous amount of reporting and evidence to the contrary I've seen over the years, unless you can provide some significant 3rd party evidence this is the case, I'm not going to believe some random guy on the internet over that mountain of information to the contrary\n\nThis isn't to say you're wrong (or right for that matter) and especially not intended as some sort of personal attack. In this case I simply feel like it falls under the category of very slightly extraordinary claim needing very slightly extraordinary evidence", "label": 0}
{"text": "Right. You can give tons of money to a super PAC but not a politician and legally a politician can not run his own super PAC", "label": 0}
{"text": "Some background from Price's wiki page: \n\n>In April 2022, Price was under investigation by the Palm Springs Police Department for felony rape of a drugged victim stemming from an April 2021 incident in Palm Springs, California. On August 15, 2022, Palm Springs Police told The New York Times that they had referred the case to local prosecutors. In September 2024, Price was charged in Riverside County Superior Court with rape of an unconscious victim. \"I have never physically or sexually abused anyone. I’m going to fight this charge and prove my innocence in court,\" said Price on October 25, 2024, a day after the court records were unsealed.", "label": 0}
{"text": "So BS, seriously why is this allowed?! CEO and any executive pay should be frozen if the company isn't performing or laying people off. It's that simple!", "label": 0}
{"text": "Social media is not food, and no adds would not mean that the company is not selling your data.  They could be selling it to 3rd parties for use on other sites or other add targeting outside of blue sky", "label": 0}
{"text": "So either you are or are named after the guy who militarizes the border and hates trans people/ abortions. Not exactly a moral high ground you stand upon", "label": 0}
{"text": "I assure you, the Missouri AG has zero ability to understand anything to do with “search algorithms”.    We’re still wondering how well he understands American Constitutional Law, based on his last several lawsuits.", "label": 0}
{"text": "That you think IBM proved your point pretty much proves mine lol", "label": 0}
{"text": "1. People are telling me companies shouldn’t be protected from over reach\n2. Super PACs certainly help politicians, but they aren’t giving money to politicians, which is what I was responding to", "label": 0}
{"text": "The original statement of mine that your replying to was making a point that Citizens United was not the right for companies to donate unlimited money to candidates, but rather that they could donate to tangential organizations that might align with the candidate.\n\nHonestly, you might hate Super PACs, but how else would this work? Salvation Army can’t get unlimited corporate donations any more because they are a right-wing charity?", "label": 0}
{"text": "What do you mean? Like you're the one who was making him look bad and he kept bitching?", "label": 0}
{"text": "When TF are we going to see some of the money from these lawsuits?   I have no less than 4 free \"credit monitoring\" subscriptions because of these. I want $$.\n\nHarris.....do your job Madame President.  Get these penalties away from Government and the lousy scumbag lawyers.", "label": 0}
{"text": "Not happening in our lifetimes, sorry to burst your bubble Mr. Cultist", "label": 0}
{"text": "https://en.m.wikipedia.org/wiki/Mug_shot_publishing_industry\n\nYou think I need to provide historical evidence that lynchings were a thing at the founding of our country?\n\nThe second part is considering why they would require jailhouses to publish records of who they are holding if they were concerned with protecting the public perception of the accused.\n\nThe founding of the government was way more libertarian than society today.  \n\nAlmost everything was relating to concerns of state overreach because they were so vehemently opposed to the British Monarchy and their overreach.", "label": 0}
{"text": "No, the terms have well established meanings in tax law, especially for nonprofits. A 501(c)(3) organization can talk about gay rights, they can even advocate for specific policy ideas, but they can’t advocate for a specific candidate or specific bill. A comparable restriction could exist for for-profit entities. Similarly, if one wants to run a corporate business, as opposed to a sole proprietorship, you should not have the right to impose your religious beliefs through that business.", "label": 0}
{"text": "I fucking hate these ceo's. Cancers to society", "label": 0}
{"text": "This is why need democrats in power…", "label": 0}
{"text": "It's a song:\n\nhttps://youtu.be/o-0lAhnoDlU?si=sf1rOhkLCtOOw3yR\n\nEverything is a cycle. The excesses of the ownership class will eventually prompt revolution. We are not there yet, and even when it happens it's just a matter of releasing the pent up anger, because we cannot create any system that defies our own nature. All you can do is reign in the excesses for a time.", "label": 0}
{"text": "But I hate to be rude.\nWhat point that you are making do you think I’m missing /u/amazinglover?\n\nAnd sorry if I don’t give you all the gravitas you deserve", "label": 0}
{"text": "Found it, can I have my money now?", "label": 0}
{"text": "Games use plenty of AI, already did for years before it was \"cool\". It's just more under the hood and in support of the experience and not in use to replace actors and developers.", "label": 0}
{"text": "We hear you, and we appreciate your feedback. We are now adding Recall to Android!", "label": 0}
{"text": "My original comment was expanding on that comment to why citizens united was a bad ruling.\n\nIt was a continuing of the conversation, but you're too stuck in your original comment. \n\n\nhttps://www.forbes.com/sites/saradorn/2024/09/05/trump-says-musk-will-lead-new-government-efficiency-commission-heres-what-we-know-about-it/\n\nElon got this because of this\n\nhttps://www.forbes.com/sites/alisondurkee/2024/10/24/elon-musk-donates-another-436-million-to-pro-trump-america-pac/", "label": 0}
{"text": "Yes. But these accusations didn't come out of no where.  Even before Dan rose to fame because of his business approach being featured.  \n\nWomen in his home town and university/highschool have been calling him out for being a predator.  \n\nIt would be like if Brock Turner's rape trial never got nationwide attention. But everyone in his university town knew his story.  \n\nAnd then 4 years later he goes on shark tank and gets famous.  \n\nWhen the accusations that he is a sexual predator come out.  For everyone that doesn't know about his past.  It makes sense for the general consensus to be \"we still don't know the truth.  Let's wait for the trial\" \n\nBut we do know.  Because this isn't the first time. This is just the first time it's happened since he's gotten famous for another reason.", "label": 0}
{"text": "Except that they do actually provide access to the PCC code. It’s on GitHub. You can examine it and compile it.", "label": 0}
{"text": "Go be a wind bag somewhere else.\n\n>And sorry if I don’t give you all the gravitas you deserve", "label": 0}
{"text": "That’s totally different and you know it. \n\nOr at least you should if you researched why it’s a crime to do so. \n\nHints: it’s not a federally stated crime. Nor is it a crime in all US states.", "label": 0}
{"text": "1. That’s not the term of art in the tax code\n2. That exists because organizations doing that are 501c4", "label": 0}
{"text": "I asked what kind of problems do they bring. That’s the only question I asked", "label": 0}
{"text": "No.  This isn't the first time. He has a very long and confirmed history of this.", "label": 0}
{"text": "No way anyone ever deserves this kind of money. However these layoff numbers are a little taken out of context too. Subtract out the number of new jobs Ms hired and then report the totals. Not trying to give these douches a break but this is lazy reporting for rage bait. They hire a ton every year - and lay off a lot every year. Also I am not a fan of Microsoft products in general because it’s all ass. The extra money should go to making their software not terrible.  From my lazy research it appears they hired 7000 new jobs in 2024 [link](https://www.statista.com/statistics/273475/number-of-employees-at-the-microsoft-corporation-since-2005/). That means they actually hired way more than fired. Maybe those 2550 people sucked at their job? Maybe not. Either way this is the kind of lazy ass reporting that makes people not understand reality.", "label": 0}
{"text": "You mean somewhere beyond my own post?", "label": 0}
{"text": "No it’s not, IQ itself hasn’t even been considered a scientifically grounded metric for many years. It was invented before we had basically any neuroscience, and before we figured out the very concept of “intelligence” is hugely complex. Attributing a single number to a person’s intelligence is about as logical as measuring the universe with a single number. There’s no single observable phenomenon that you can call “intelligence”, the brain does many different things all at once, involving a variety of structures and chemical signals, and all those processes are affected strongly by the rest of the body, sleep, education, context of examination, psychological phenomena like self awareness and mood, etc. \nJust confidently saying baseless race “science” (not at all scientific) as “widely known” is either proud ignorance or pathetic disinformation which shows a total disdain for empiricism and rationality", "label": 0}
{"text": "I didn’t say the tax code, I said tax law. \n\nYes, and I’m fine with partisan, electoral advocacy being limited to those organizations and others that are explicitly political. I fundamentally disagree that for profit entities should have speech or religion rights on par with individuals.", "label": 0}
{"text": "I disagree. I’m ok with the current status quo", "label": 0}
{"text": "Oh, in classic reddit style I skipped looking at the actual article.", "label": 0}
{"text": "By your logic if you roll a dice it is either 5 or no 5 so the odds of getting 5 are 50% the odds of getting 1,2,3,4,6 are 50%.   Just because there are 2 outcomes doesn’t mean that they have the same probability", "label": 0}
{"text": "China is jealous that Russia got all the good stuff to blackmail Trump.", "label": 0}
{"text": "Sure, but parts of what you’ve been saying are just factually incorrect, and many others are intellectually dishonest.", "label": 0}
{"text": "Another victory for Dark Brandon!!! Ice Cream for ALL, FOREVER!!!", "label": 0}
{"text": "What that I’m saying is factually incorrect?", "label": 0}
{"text": "Absolutely believe we need a law in the US that makes C-level bonuses illegal in any year in which layoffs occured. Exec bonuses go first, THEN discretionary spending, THEN people.", "label": 0}
{"text": "Ugh, I hate it when headlines use the word “slammed”. Do they have no imagination? Where’s the love for *skewered*, or *demolished*, or *annihilated*… I want some variety in my meaninglessly extreme verbiage.", "label": 0}
{"text": "did you take a poll or your biased assumption led you to such conclusion?  your question is not relevant to the discussion on her accomplishment as vp\n\nlist her top 5 accomplishments as vp? in 4 yrs, i'm sure she have done at least 5 sigfig things. \n\nduring the debate, she claimed that she worked to secure the border.  what exactly did she acvomplish?", "label": 0}
{"text": "The idea that the term “partisan, electoral speech” isn’t a term of art in tax law, for example.", "label": 0}
{"text": "The idea that the term “partisan, electoral speech” isn’t a term of art in tax law, for example.", "label": 0}
{"text": "Man this guy isn’t even guilty yet and the Reddit mob is already out to get him. What the hell? \n\nHow many cases have there been where this has happened and the guy has been found innocent. Not saying he is but you definitely need to reserve judgement until AFTER the judgment lol.", "label": 0}
{"text": "I wonder.. were they able to see activity of some sort.  I would imagine that, were there any kind of consciousness, it would have been a particularly miserable experience...", "label": 0}
{"text": "Your original comment to me was they can “hand billions to whoever they want”", "label": 0}
{"text": "Imagine you die and then are brought back to life but it's just your head on a blood pump and you can't move a muscle.", "label": 0}
{"text": "Thank you for the additional info, I legitimately had no idea.", "label": 0}
{"text": "How soulless.", "label": 0}
{"text": "212 million will get you a lot of Goteks… :/", "label": 0}
{"text": "Admittedly, I’m no expert on tax law, but I can’t find it anywhere and when I looked up the relevant tax code it wasn’t there.\n\nIf you can cite it, I’ll gladly apologize", "label": 0}
{"text": "didn't she claim during the debate that she had worked to secure the border?  🤔", "label": 0}
{"text": "All of these layoffs are basically the result of massive hiring from 2020-2022. Meta nearly doubled their workforce. These layoffs were inevitable and the CEOs compensation is tied to financial performance so naturally making the same money with lower costs is going to get him paid.\n\nI don't like billionaire influence in politics, and I think it's dumb of shareholders to pay CEOs that much, but it doesn't make sense to employ a bunch of people to stand around and do nothing. There is still high demand for tech talent in the broader economy.", "label": 0}
{"text": "... and then reverted it a few days later.", "label": 0}
{"text": "Not if the E. Coli machine is broken.", "label": 0}
{"text": "Jobs are a cost. Not a benefit.", "label": 0}
{"text": "\\>The government probably knows about it and theres probably some intentional communication going on. \n\nI see we've already reached the \"making sweeping assumptions without the tiniest shred of evidence\" level of coping.", "label": 0}
{"text": "EAT THE RICH", "label": 0}
{"text": "I explained how they do though Super pacs by using that money to spend kn things that candidates then don't have to.\n\nMeaning they get to use their money on other things. \n\nIf I paid your rent for a year, would you then not have more money to spend elsewhere?\n\nI'm done since you can't actually prove anything I asked.", "label": 0}
{"text": "You don't understand what the actual issue is, so you've convinced yourself that you think you do.\n\nThe issue isn't that you can't repair your own stuff, it's the difficulty in repairing it without the OE manufacturer being included somewhere in the repair process. It also concerns the ability for warranties to be invalidated if not repaired by the company or by authorized repair technicians.\n\nFor instance, you buying a part and installing it yourself, which means that you might not be able to have a warranty claim on a completely different component because of the component you replaced.\n\nThis is also ignoring deliberately obtuse software systems that are unique to their products, which exist for no other reason than to lock third-parties out of easily working with and diagnosing problems related to those systems. Then, having those systems not serve anyone not authorized in order to aid in the diagnosis of mechanical issues because the person wasn't privy to the appropriate diagnostic tools.\n\nBut, yeah, sure, you know everything because you turn wrench good.", "label": 0}
{"text": "Step 10 profit?", "label": 0}
{"text": "The existing machines will break down at the same rate, yes.\n\nThe cleaning problem will be reduced noticeably when looking at the entire network of them, though. One of the biggest problems with the cleaning cycle is that they run it overnight and if at any point there is any problem with any part of the process it fails. There isn't any indication of WHY it failed because the local store doesn't have access to the onboard computer to check error codes. So they start it again. Hours later, they realize it failed again. They contact the company for support, but you can ONLY contact the company for support so they have to wait for one of the company techs to come out and fix the problem (along with the hefty fee). Now, stores will be able to use devices that will let them know what's actually wrong or 3rd party technicians that can fix the problem for cheaper and possibly sooner.\n\nThe problem is that the company making the ice cream machines has monopolized the market with a contract. The corporate office gets a great deal, but the stores have to pay the exorbitant price. This ruling will give the franchise owners OPTIONS. Those options will mean that the company no longer has as much incentive to make a sub-par product and then charging out the ass the repair and maintain it. It's a good ruling that will help the problem from several sides all at once.", "label": 0}
{"text": "Shit, caps lock was on", "label": 0}
{"text": "I’d absolutely have money to do other things, but that doesn’t mean you can hand money to whomever you want\n\nYou seem to be very poorly making a point and then getting mad at me because I can’t read between the lines", "label": 0}
{"text": "You keep saying tax code, as if I’m talking about statute. I’m talking about the function of the law, and how existing speech regulations on 501(c)(3) organizations operate. You even acknowledge them with your reference to 501(c)(4) organizations. Those restrictions clearly exist, or every c4 organization would be a c3 for the better tax situation. \n\nYou can disagree with whether for profit entities should be held to similar standards, but they clearly exist.", "label": 0}
{"text": "Um no. You can see the frame rate hiccups and lag very clearly on earlier android videos.  They didn’t fix the underlying issue of the UI not taking priority, they just brute force the issue with processing power.", "label": 0}
{"text": "I can get behind incentive-based marketing!", "label": 0}
{"text": "The Deadelus Encounter", "label": 0}
{"text": "In the wikileaks vault 7 dump, we learned the intelligence organizations spoof country of origin attacks.", "label": 0}
{"text": "He was never elected. Our stupid governor appointed him.", "label": 0}
{"text": "You just told me it is a term of art in tax law. Yet you can’t cite it from anything.\n\nSo, are you really bad at explaining or just obtuse.\nIf it’s a term of art in tax law, then it should be in all kinds of easily citable documents. I’ll wait", "label": 0}
{"text": "I'm sick of listening to AI generated voices on ads. It's EVERYWHERE now.", "label": 0}
{"text": "Interesting read, but it didn't mention any link to lynchings or mobs, etc. I mentioned the history of lynchings first, so save the snark.\n\nThe second part is you continuing to speculate without the evidence I requested.", "label": 0}
{"text": "Microsoft always chops the bottom 5% every single year, regardless of", "label": 0}
{"text": "\"if it's Boeing, I ain't going.\"", "label": 0}
{"text": "He asked for a pay cut.", "label": 0}
{"text": "So we have lithium just sitting around underground in the US?", "label": 0}
