{"text": "That really got under your skin though, didn’t it? Bet ya a shiny nickel my comment will live rent free in your head for a while.", "label": 1}
{"text": "Oh no no, friend, that got under YOUR skin because you fucking reported me to Reddit Cares 💀 only the most butthurt of the butthurt do that shit. Also, just so you know you can be perma banned for false reports like yours. You can also be permabanned for advocating for violence. \n\nI’m sure that’s a terrifying thought for someone chronically online", "label": 1}
{"text": "Where’d you want me to send the nickel?", "label": 1}
{"text": "They clearly do, the vast majority of their top news stories are left leaning as well and less than 10% being right leaning. They are a big variable to the far left media echo chamber that has brainwashed the country.", "label": 1}
{"text": "> Microsoft CEO's pay rises 63% to $73m, ~~despite~~ because of devastating year for layoffs | 2550 jobs lost in 2024. \n\n\nFTFY. Investors salivate on efficiencies.", "label": 1}
{"text": "Trump may ramble but rarely lies, the media spin is outrageous and has divided the country by falsely claiming many things Trump says are lies (pet scandal in ohio, that he will issue an abortion ban, crime being up - fbi quietly updates their stats weeks later and Trump is right again, etc) while also pushing trump falsehoods and lies from his opponents (Russia, \"very fine people\" hoax, Hunter's dealings and laptop).\n\n  \nClearly intentional, in reality we all probably agree or can find common ground on 90% of issues but they then lose power if we're not divided by fake news.", "label": 1}
{"text": "You're like 15 and probably get anxiety from answering a phone call. You ain't taking off anyone's head keyboard warrior.", "label": 1}
{"text": "Oh there we go someone just had to say it", "label": 1}
{"text": "Before anyone brings it up, I'd just like to say that I'm sure Putin doesn't have kompromat on him, not from Epstein's island with underage girls, or anywhere else. He's definitely NOT owned by Putin. Same as Trump—NOT owned by Putin. NOT.", "label": 1}
{"text": "Time to bring back the Guillotine….", "label": 1}
{"text": "Nah just a troll in my free time. Got at least two today. Happy Friday, love.", "label": 1}
{"text": "Let’s go trump!", "label": 1}
{"text": "Pissed off cat ladies dropping every subscription except that Amazon Prime! 😂🐈", "label": 1}
{"text": "> Tax the billionaires.\n\nI favor proscription. Execute them and confiscate all their stuff. Then post a list of the next batch.", "label": 1}
{"text": "Trump is not just leading in the polls, he is surging farther ahead, lolololol!! N", "label": 1}
{"text": "Kamala Harris is qui pro quo.   She literally blew her way to the top starting with Willie Brown.", "label": 1}
{"text": "Hahah, wahhhh.    Are you kicking your feet too?", "label": 1}
{"text": "Maybe the Democrats could pick a candidate who’s not a warmonger or a genocide accomplice?", "label": 1}
{"text": "Show us on the doll where the man hurt you.", "label": 1}
{"text": "Oh that's TERRIBLE! And you read it in the paper that wouldn't endorse Kamala. Your butt must be ACHING.", "label": 1}
{"text": "Usuarios de Reddit, si los animales pudieran hablar, ¿qué crees que sería lo primero que te diría tu mascota?", "label": 1}
{"text": "You and your kind are going in cages soon.", "label": 1}
{"text": "He's nothing if not a dealmaker.  Imagine that skill in service of your country.", "label": 1}
{"text": "RoboPig", "label": 1}
{"text": "It’s unfortunately the best system we’ve created so far. Obviously communism doesn’t work IRL but what we need to do as a species is rein in the excesses and built-in inequalities that are intrinsic to Capitalism.\n\nEssentially if a form of ethical and socially conscious form of Capitalism could be developed, it would be better than what we have now where “might makes right” in the form of using money and power to shield oneself from the consequences of one’s own actions or to destroy (buy out) future competitors from usurping their monopoly.\n\nBut any form of taxation to corporations nowadays is basically considered unfair thanks to powerful industry lobbyists, when in reality corporations succeed because of the underlying education and work effort of the people they hire, and the infrastructure that was built up around them using taxes. Products don’t ship themselves without docks, airports, highways and freeways being available.", "label": 1}
{"text": "How is this related to technology? Seems to be a post for /r/politics. Does this sub have any moderators?", "label": 1}
{"text": "Since when is it normal for our news sources to endorse a candidate? I know they all have some bias but as soon as they endorse a candidate they are no longer news and are just entertainment", "label": 1}
{"text": "why do you think theres a politics flair? A lot of funding for certain tech companies (like Blue Origin) comes directly from the government so you cant avoid that with certain technologies", "label": 1}
{"text": "From the sidebar:\n\n/r/technology is a place to share and discuss the latest developments, happenings and curiosities in the world of technology; a broad spectrum of conversation as to the innovations, aspirations, applications and machinations that define our age and shape our future.\n\nHow does this article fit?", "label": 1}
{"text": "Blue Origin will thrive as a company if it gets government funding. It will not thrive if it does not. Trump has said he will support Elon and Bezos in their space endeavors repeatedly, obviously the space industry and technology will advance. Technology typically doesn't advance or develop if you dont fund it.", "label": 1}
{"text": "Report it for breaking rules.", "label": 1}
{"text": "This meeting is probably more about satellites.", "label": 1}
{"text": "yeah, and it'll get like.. exponentially more, i cant even imagine.. and theres never enough money for these billionaires and their companies is there? free money printer", "label": 1}
{"text": "Sure bud", "label": 1}
{"text": "You mean like the COVID lab leak or Biden’s laptop that were suppressed?  Or the White House pressure Facebook to censor certain information?\n\nI’m confused with what we are talking about.", "label": 1}
{"text": "Go back to your daddy Vlad and choke on his tiny thing.\n\nI'm born red blooded American that will never vote for you blue commies.\n\nStop trying to force your lunatic beliefs onto everyone. You're the real fascists. Every time you call others those things you're just projecting your sickness onto others.", "label": 1}
{"text": "Okay maroon.", "label": 1}
{"text": "Both sides leveraged each other’s platforms. Accountability was ignored until it explode", "label": 1}
{"text": "Says the nutjob with no proof.\n\nKeep supporting biological men in girls sports. Just sick.", "label": 1}
{"text": "Upvoted for truth. Reason will prevail!", "label": 1}
{"text": "Idiotic take.", "label": 1}
{"text": "Who cares about them fucks over there. Let them kill each other.", "label": 1}
{"text": "What about Ukraine?", "label": 1}
{"text": "Morality too. You're employed to do a job, not be a human. It's disgusting what workers think is acceptable these days.", "label": 1}
{"text": "Zionists’ day will come", "label": 1}
{"text": "Why do our employees in Washington have AIPAC handlers?\n\nIs it the United States of America or the Divided States of Israel?", "label": 1}
{"text": "Stupid question", "label": 1}
{"text": "Well, they just can't help themselves. WHAT ABOUT is in their blood.", "label": 1}
{"text": "It’s like us Arabs are just lesser humans waiting to be exterminated by higher powers", "label": 1}
{"text": "They aren’t winning prices in NC either. The response could be much, much better. \n\nNow, let’s not go all in on the FEMA’s going to take your house nonsense. However, FEMA is absolutely ignoring rural communities based on real journalism that I’ve seen.", "label": 1}
{"text": "Probably because Trump is a moron.", "label": 1}
{"text": "The downvotes are wild lmao, Biden had a ministry for truth for a bit too.", "label": 1}
{"text": "It also explains why the rinky dink resistance can stand a chance. Their improvised tactics and sheer will to do things that defy logic make them difficult to account for. If Skynet is an analog system with set parameters and no imagination it wouldn't have an easy time keeping up with the unpredictable nature of hit and run guerilla attacks from scared and desperate humans. Suicide runs and last stands don't make sense to a machine.", "label": 1}
{"text": "Just imagine how sick in the head these people are, wanking off to cartoon children...", "label": 1}
{"text": "yes calling out a pedophile posting sexual images of cartoon children is so wrong..", "label": 1}
{"text": "You must be so stupid to have never heard of doing it on purpose to make a point.", "label": 1}
{"text": "I mean, most Trump supporters are old and/or overweight, so I doubt you really need to worry about", "label": 1}
{"text": "The hypocrisy of both sides are absolutely wild.", "label": 1}
{"text": "Not when the bar is set that low, it’s not. \n\nWe have actual pedophiles and rapists donating money to both sides. It’s insane.", "label": 1}
{"text": "Just glossing over the laptop, I see. Figures. Considering it was proven.", "label": 1}
{"text": "I have no idea what that game even is...", "label": 1}
{"text": "Lay off the kool aid. It's making you look kind of dumb.", "label": 1}
{"text": "They haven’t stopped fighting misinformation, they just feel it’s more important to not censor free speech and shape the political landscape with leftist views. If there’s misinformation Elon will get rid of it.", "label": 1}
{"text": "An the dumbocrat played no role at all? Sure.", "label": 1}
{"text": "Funny, I’ve been a lifelong Democrat and I went Republican this year. I’ve never seen media attack someone so much in my life. From Google altering search engines to outright lies from the media. “The bloodbath” commented taken so far out of context. I am literally scared of the propaganda machine that has taken over so many platforms.\n\nWe live in very odd and strange times. But I cannot elect someone who was chosen by elites and not by the people. Rug pulling Bernie Sanders was a hard pill to swallow but to be forced into Kamala. That was the last straw. The democrats have a lot of apologize for to the people. Stop treating us like idiots and stop lying / twisting words.\n\nhttps://youtu.be/KMvYxMgD0pw?si=wkAdfLUrXFwQ6Ifi\n\nTime stamp 16:55\n\nCrazy how everyone has changed but Trump has remained the same. Nothings changed about Trump but they want to change your views now on him. Don’t let them control you…", "label": 1}
{"text": "Go outside buddy", "label": 1}
{"text": "Uh, yeah, the Whitehouse administration literally told social media companies to suppress dissenting voices against COVID restrictions and vaccine mandates.\n\nThe receipts for this are available freely and publicly.\n\nThe beef I have with the term \"misinformation\" is - who gets to decide what is \"misinformation\" and what is not? For instance, early on in the COVID era, \"natural immunity\" and the \"lab leak theory\" were considered \"conspiracy theories/misinformation\".\n\nBut later on these two things were determined to be true.\n\nThere's a lot of pearl-clutching on the left when it comes to \"misinformation\" - but only when it is inconvenient statements that contradict their ideology.\n\nNow, for having said this, I'll bet good money that someone is going to respond with an ad-hominem attack, or report me as \"spreading misinformation\". It's the leftists way lol.", "label": 1}
{"text": "This is SUCH bullshit!  All the liberals now love censorship: controlling what people say and read on the Internet in the name of \"democracy.\"  You don't like what someone says?  Tough shit.", "label": 1}
{"text": "Misinformation usually means truthful facts one party doesn’t like", "label": 1}
{"text": "What about Palestine? Those posts are censored into oblivion.", "label": 1}
{"text": "It’s sad", "label": 1}
{"text": "Is anyone needs a whole bunch of ROMs to borrow and give back to me after they download them and use them for an indiscriminate amount of time for it original NES 8-bit, let me know.", "label": 1}
{"text": "The name Indonesia derives from the Greek words Indos (Ἰνδός) and nesos (νῆσος), meaning \"Indian islands\". - Wikipedia\n\n\nBasically it's one of Indian states, Akhan Bharat yo! Lol", "label": 1}
{"text": "A muslim country like indonesia should not have access to technology like smartphones and ARTIFICIAL INTELLIGENCE given that recreating the creation of god (for example images and AI) and music is prohibited in islam.\n\nThe international community needs to respect their religion and ban all access to such technology for muslim countries like indonesia.", "label": 1}
{"text": "Idiots tbh", "label": 1}
{"text": "HOLD ON! give me 10 seconds of your time reading this (this is not a bot):   \n  \nWhat is writing without a book, am I right? I recently found this amazing book on amazon. I have NEVER seen a journal like this before. Most of the journals are just plain and contain no bright colours. It is SCIENTIFICLY Proven that bright colours improve your mood, so having this bright coloured journal is a advantage. Never lose motivation again!  \n  \n\\- Get free delivery if ordered before 3 days  \n\\- Limited stock, only 5 left. They are selling out quickly  \n\\- 83% percent discount almost gone!!- BUY NOW before it's too late!!!  \n  \n(Even if you don't intend buying it, check it out anyways, and show some love). Thanks!  \n  \n[https://www.amazon.co.uk/dp/B0DKNS6Q45](https://www.amazon.co.uk/dp/B0DKNS6Q45)", "label": 1}
{"text": "> We don't use AC because it's more efficient than\n\n> The thing that makes AC attractive is the fact that it's more efficient\n\nLiterally the first to sentances.", "label": 1}
{"text": "That's fair, I just like to temper a lot of fear surrounding new weapons systems with the reminder that we've had \"destroy entire civilizations\" weapons for a while.\n\nDrones with AI assisted targeting  seems like it's a lot scarier for politicians than normal people.", "label": 1}
{"text": "Which is why the smartphone has essentially remain unchanged since its inception nearly 20 years ago.", "label": 1}
{"text": "i tried it on my dad (he is 60 years old) and it looked good :)", "label": 1}
{"text": "An ad for a discontinued product? Bose doesn't make sleep buds anymore.", "label": 1}
{"text": "I had chat gpt try giving me all of the dialogue from the WKUK abraham lincoln sketch and it literally made up the whole thing. I had to call it out on lying. \n\n     The “Whitest Kids U’ Know” Abraham Lincoln skit is a popular comedy sketch that humorously portrays an exaggerated and fictionalized version of Abraham Lincoln’s assassination at Ford’s Theatre. The script includes some aggressive and absurd dialogue, blending historical context with a modern sense of humor. Here’s a rough outline of the dialogue for that particular skit:\n\nSetting: Ford’s Theatre, Lincoln is watching a play, and John Wilkes Booth is preparing to assassinate him. However, in this parody, Lincoln is portrayed as being loud, obnoxious, and confrontational, which leads to a very different assassination scenario.\n\nAbraham Lincoln: (Yelling loudly at the stage, disrupting the play)\n“Hey! Hey! What the hell is this? This play sucks! I could write a better play in my sleep!”\n\nTheatergoers: (Shushing him) “Shhhhhh!”\n\nAbraham Lincoln: “Shut up! I’m the president! I can do whatever I want! You suck!”\n\nMary Todd Lincoln: “Abe, calm down!”\n\nAbraham Lincoln: “Don’t tell me to calm down! This play is garbage!”\n\nJohn Wilkes Booth: (Sneaking up behind him with a gun, whispers to himself) “Sic semper tyrannis.” (Approaches Lincoln)\n\nAbraham Lincoln: (Noticing Booth) “Oh, great, what do you want?”\n\nJohn Wilkes Booth: “I’m going to assassinate you.”\n\nAbraham Lincoln: (Standing up, confrontational) “Oh, you think you’re gonna assassinate me? Why don’t you sit your [bleep] down, John?!”\n\nJohn Wilkes Booth: “I’m not sitting down, Mr. President. I’m here to free the South from tyranny!”\n\nAbraham Lincoln: “Tyranny? You wouldn’t know tyranny if it bit you in the [bleep]!”\n\n(They start bickering loudly in a comical, over-the-top fashion.)\n\nJohn Wilkes Booth: (Getting frustrated) “I’m doing this for the good of the country!”\n\nAbraham Lincoln: “You don’t even know what the country is! You’re an actor! Why don’t you go cry about it in your dressing room?”\n\nJohn Wilkes Booth: (Getting angrier, yelling back) “I’m going to kill you!”\n\nAbraham Lincoln: “You couldn’t kill time, John! Sit down!”\n\n(The argument escalates as Lincoln taunts Booth more, leading to Lincoln mocking him for several things, with the scene ultimately ending in an exaggerated comedic version of the assassination.)\n\nThe skit is meant to be absurd and a clear parody of history, where Lincoln is intentionally portrayed in an extremely out-of-character, loud, and obnoxious way to create humor. The sketch’s humor comes from the juxtaposition of historical figures in modern-day attitudes and absurd interactions.", "label": 1}
{"text": "That is one pathetic way to get tax cuts if I have seen one. Glad I am no longer a shareholder.", "label": 1}
{"text": "All I want AI for is fish ID. Otherwise if they would like to train AI to improve the relevance of search engine results, then be my guest, that is needed in 2024. I won't be using it to pen letters to Grandma. ", "label": 1}
{"text": "So then stop using it to “clean up “ your movies , dunbass", "label": 1}
{"text": "Regardless of that number your concern doesn’t show an accurate understanding of geothermal energy. You can’t “use up” a heat flow. There’s an inherent temperature gradient from hot to cold of any heat source. Extracting energy along that flow does not “use up” the heat. That would be like saying dams “use up” the water by having it push a generator down hill. For a dam’s purpose gravitational potential energy is where the energy is being extracted from. For a geothermal source it is the temperature gradient. Extracting energy from the gradient doesn’t make the source cool off faster.\n\nSure, we would be limited in that the maximum we could ever generate is based off the total heat flow. Nothing is ever truly limited, but it wouldn’t cause it to run out of heat. Just like the limit for what we could produce from a river depends on the gravitational potential energy gradient of the water. Essentially k*delta(T) vs m*delta(h) up to the efficiency limits of the methods we can extract with.", "label": 1}
{"text": "Then what’s your excuse for ignoring and downvoting my comment not even referencing anything in the other persons AI comment? I tried to respectfully explain your misunderstanding of geothermal energy extraction and you just downvote it hammering away at an AI response no one cares about and using it as an excuse to ignore actual information you don’t agree with.", "label": 1}
{"text": "In response to your @, idk why you wouldn’t be able to reply either. But you’re really just exemplifying your misunderstanding of thermal energy. Yes the main core will forever cool. It will do that regardless of if we extract the energy in the process. Just like a river will always flow down, us putting in a dam to harvest the energy doesn’t change the fact that it will still eventually flow down and no it isn’t going to flow any faster.\n\nIf the earth were going to take 1,000,000 years to cool (it will take far far more than that) it will still take 1,000,000 years while we’re harvesting energy. Just like the sun is going to radiate solar energy until it burns out, us putting up solar panels isn’t going to drain the sun of its energy faster, we’re just taking advantage of the energy already being emitted. \n\nVery very slowly, as the earth eventually cools down, our generators will be less and less efficient because the temperature gradient gets smaller. Again, this will happen anyways and our interaction physically does not affect this. It’s not about it even being minuscule, that’s just not how physics works here. This process will also take far longer than this planet is even going to be livable.\n\nWe might have a fixed amount we can actually generate from the earth, simply because there’s only so much energy being radiated at a time from earths heat, but that is the only limiting factor. We are not capable of having an effect on this process.", "label": 1}
{"text": "He's not gonna fuck you, bro.", "label": 1}
{"text": "Let’s build about 10 nuclear power plants. That should satisfy our power needs for a while. Or we can build 100 million wind mills", "label": 1}
{"text": "This!", "label": 1}
{"text": "So I’m texting you to see if you need some money to payoff some bills and I will be glad to help you out", "label": 1}
{"text": "This is a significant step towards enhancing renewable energy access in rural areas, promoting sustainability and reducing reliance on fossil fuels.", "label": 1}
{"text": "Functionality and design are also important over AI features. These days, companies may need to focus on user experience rather than just AI.", "label": 1}
{"text": "Max Planck does some really good and authentic researches to reply on. One of my nephew is there and talks about how rigorous their process is", "label": 1}
{"text": "This is a groundbreaking move for renewable energy, connecting countries through clean power. It highlights commitment to sustainability and energy innovation.", "label": 1}
{"text": "Yea.. its dangerous for overthinkers & hypochondriacs", "label": 1}
{"text": "Yea.. its dangerous for overthinkers & hypochondriacs", "label": 1}
{"text": "What are you dealing with (only if you are okay to ans) ?", "label": 1}
{"text": "Oh great, just what we need—more species that can’t handle modern life. Can’t wait for the Thylacine to show up and start a TikTok channel!", "label": 1}
{"text": "'child abuse material'\n\nFTFY", "label": 1}
{"text": "DLSS is a hardware feature. Welcome to reddit. Youve been played. Played by reddit, Hub, and a few other channels.\n\nDLSS is hardware accelerated FSR, and there is NO more accurate way to describe it.", "label": 1}
{"text": "Arrest people like Donald Trump who have create REAL CRIMES, and not FAKE PORN! Giving a person 18 years in prison for using Photoshop is what LOSERS spend thier time on, instead of prosecuting child abusers and rapists like Donald Trump!\n\nYOU PEOPLE ARE SICK, PERVERTED, FREAKS!\n\nI would NEVER even consider charging this person with an a FAKE OFFENCE. And if is a FAKE OFFENCE because involves the creation of FAKE PICTURES! If you have some MORAL ethics, then SCREAM AND YELL ABOUT THE POLITICIANS, HOLLYWOOD ACTORS, EUROPEAN ROYALITY whom YOU stupid and ignorant Americans WORSHIP with your time and money! YOU STUPID AMERICAN HYPOCRITES. You allow the rich and famous to rape children, and punish abused children, like the Menedez brothers, for being sexually, physically, and psychologically abused.\n\nYOU AMERICANS ARE PSYCHOLOGICALLY SICK!\n\nAnd you keep banning my comments because YOU CAN'T HANDLE THE TRUTH!\n\nFUCK YOU! FUCK OFF! KILL YOUSELVES!", "label": 1}
{"text": "Trump’s criticism seems politically motivated, especially with upcoming elections in mind.", "label": 1}
{"text": "WOW lol. Ur actually a pedo. Not only am i underage, the fact you think animated child porn is okay fucking wild, you should end your life holy shit", "label": 1}
{"text": "Chips act has been amazing for Michigan. Anyone that understands what happened to our industrial base due to decades of offshoring and uninvesting in America knows the effect this has had. Biden/Harris have been the best friend blue collar workers could have in a generation.\n\nThe only problem is loud magats that lack critical thinking and don't understand trump has no economic plan.\n\nTrump: Tariffs!\n\nLiterally everyone: Do you know how Tariffs work?\n\nMexico will pay for it! /s", "label": 1}
{"text": "Expanding. Working in senior manufacturing sales, my income is deeply tied to sales commissions. When tariffs increase, so do the costs for the products I sell, which means my commissions take a hit if I have to raise prices because customers order less. Under Trump’s administration, tariffs rose by 25% on basic materials, and Biden didn’t remove them—so these tariffs remain. The truth is, American importers pay these tariffs, not the foreign countries. It affects the cost of materials like rubber, corrugated, bottles, and wood, which has been climbing, and that gets passed on to consumers.\n\nAs an example, we don’t have alternatives here in the U.S. for things like shoes, as there’s no significant manufacturing base for them domestically because of consumer demand for brands like Nike and Adidas.\n\nThis tariff impact isn’t just about rubber or shoes—it’s felt across grocery store shelves, especially in packaging costs. Prices fell slightly in September and October, but that’s largely because annual contracts are renegotiated then, and grocers have been pushing hard for lower prices while maintaining their high markups. The constant pressure on manufacturers to absorb these costs, while prices continue to climb for everyone, is beyond frustrating.\n\nSo, if we want prices to drop, tariffs are a factor we need to address. They’re just another burden on American businesses and consumers that keeps driving up everyday costs.", "label": 1}
{"text": "  \nNPR's Marketplace has been doing a lot of coverage on the effects of the CHIPS act. Short answer is that the subsidies, while large, are are an investment that should pay dividends.\n\n[https://www.marketplace.org/2024/04/30/us-semiconductor-industry-phoenix-chips-science-act/](https://www.marketplace.org/2024/04/30/us-semiconductor-industry-phoenix-chips-science-act/)", "label": 1}
{"text": "> Buddy. What the fuck do you bring to the table that an A.I. doesn't?\n\n> What makes you worth keeping alive? It sure isn't your attitude. It isn't your humanity.\n\nSubtle death threats are what I expect from hopeless \"artists\", sadly.", "label": 1}
{"text": "Why wouldn’t it be?  Everyone is happy the GDPR applies to every website in the world.  The US arrested some British dudes a while back because Americans were using their site to gamble. The internet is a world wide phenomenon and if the US and the EU can decide the entire thing is within their jurisdiction, why can’t India?", "label": 1}
{"text": "Do you deny that Israel is committing a genocide with US tax payer money provided by the Biden administration and soon to be Harris administration? Are you a holocaust denier as well?", "label": 1}
{"text": "Lol", "label": 1}
{"text": "It’s fraud, but it’s almost laughable to me. JP Morgan, the same institution with multiple bailouts on record, that had to pay some odd multiple millions for fraud in 2020, wants to go after these guys. I guess if anyone can spot a fraudster, it’s another fraudster 😂", "label": 1}
{"text": "Reported me for what? Not coddling your feelings? Telling you that you should think of others? Telling you to make friends?\n\n\nPut the meth pipe down and touch grass.", "label": 1}
{"text": "The harassment, now. There's a whole category for it just for people like you.", "label": 1}
{"text": "Harrassment?", "label": 1}
{"text": "Google it bro, you'll make more friends by doing it less", "label": 1}
{"text": "You sound like you could genuinely use a friend. If you ever feel like chatting, my DM's are open.", "label": 1}
{"text": "You'd be the last person anyone would pick, look at the garage you spew before even knowing someone. Your whole game is to be as shit as possible. Good luck with that.", "label": 1}
{"text": "So the GDPR, which protects the PII of EU Citizens, does in fact apply to websites world wide - just like I originally said.  Thanks for the confirmation.", "label": 1}
{"text": "I happily concede that point - in fact I brought it up myself above.  Not being able to travel to the EU, or any country that is willing to enforce the EC judgement is apparently enough of a threat that it appears a significant number of websites outside the EU are unwilling to test it.", "label": 1}
{"text": "So you just contradict the statement and we are suppose to not see that?", "label": 1}
{"text": "So destroying property = not okay\n\nBut murdering women and children = okay\n\nGot it", "label": 1}
{"text": "Words are words, both parties sick the cops on them. Also you seem to forget how Democrat run cities handle the BLM protesters. Both parties are the same when it comes to protesting and this is all pointless to talk about anyways because anything short of a national strike won't get the government to change. Protests are useless without action.", "label": 1}
{"text": "Another guy [did](https://amzn.to/4e2YDcT) something like this 7 months ago", "label": 1}
{"text": ">If you would take regular (clothed) images of young kids and hand draw explicit things around them, would that already fall into the same category like This guy using 3d rendering/ai software?\n\nThe difference is he was selling this to pedos who used images of real life children, often who they knew in real life. I think 20 years ago if anyone was making that much money off very explicit realistic images of real children it would cause the same condemnation", "label": 1}
{"text": "I have. It's actually a commentary on adults sexualizing children. From the point fo view of the predator. Most people can't get passed the concept and see what is trying to do. ", "label": 1}
{"text": "ngl that’s a pretty nasty thing to say\n\n“ Republicans hate America and are ALL evil hypocritical liars. Drink bleach.” \n\ntheres people that are republican and don’t hate America and aren’t evil wtf??? I could say the exact same thing about Democratic Party with that kind of logic, it applies to both sides. very toxic mindset to have either way about the Republican Party .", "label": 1}
{"text": "If there werent so many fantastic content creators I'd be done. There are so many great educators on youtube making phenomenal works and youtube continues to ruin the platform they work on.", "label": 1}
{"text": "This grinds my gears. I'm not a fucking incel, why is YouTube *so determined* to show me \"WOKE FEMINIST gets DESTROYED by [conservative dickhead of the moment]\", ad infinitum? Just because I watch videogame videos here and there, and some Ukraine war coverage? I keep telling it to knock it off, but that garbage still creeps in.", "label": 1}
{"text": "“To go back to the MCU, I am not worried about them hijacking my character’s soul because there’s like three or four guys and gals who make all the decisions there anyway and they would never do that to me, with or without me,” he added.", "label": 1}
{"text": "jericho", "label": 1}
{"text": "Too late my freind", "label": 1}
{"text": "Supposed to be a warning, not a how to...", "label": 1}
{"text": "We had ELIZA decades ago, and it fooled people into thinking it was a real person. \"AI\" aka LLM is just Eliza, and everything else you're talking about is ML, not AI.", "label": 1}
{"text": "At least they're making it easy to decide to quit using their product. Sigh. Why the fuck is technology taking such a disastrous turn? There's so much possibility, but instead people just used it to figure out how to capitalize on taking advantage of mush brains. This sucks.", "label": 1}
{"text": "Kinda funny this comes right after Trump breaks the internet with Rogan.  Just like they removed the dislike button once The Biden Admin came around.", "label": 1}
{"text": "Perfection", "label": 1}
{"text": "t's unsettling to see the reaction to this article in the comments. This hive-mind mentality—on both the left and right—is alarming and explains how so many terrible mass movements have happened in the past.", "label": 1}
{"text": "Can you tell my why you think that I am mentally ill ? Just curious", "label": 1}
{"text": "You're job is pointless, you're probably in sales or a trade,  \n\nguess what all that shits a luxury too, don't need it.", "label": 1}
{"text": "Thank you for this list of companies to avoid working for", "label": 1}
{"text": "Maybe I’m a hopeless romantic for music but that was part of the fun for me. You bought a ticket and took the ride, hoping for the best that the album your money paid for was a good one. \n\nIt made me listen deeper to songs I’d skip over these days if they pop up. Streaming makes it a little too easy to only hear the best of the best when there’s plenty of good music outside of the greatest hits. Music has become disposable and just another thing “trending” for the week/month these days.", "label": 1}
{"text": "The ambient background noise on the map will be Kamala cackling non-stop.", "label": 1}
{"text": "wat", "label": 1}
{"text": "I think it’ll just be completely ’new’ Ai actors. The creator or author can do anything they want with them. It’s kind of already happened with digital influencers. Some, like Imma created by  Aww Inc. with 394k followers, have even appeared alongside ‘real life’ models and promote everything from fashion brands to company products.", "label": 1}
{"text": "Extremely.", "label": 1}
{"text": "30 years from now history books will be burned as fuel.", "label": 1}
{"text": "You're not that far off from [reality](https://amzn.to/40o0oy9)", "label": 1}
{"text": "We can cut data center power costs by eliminating the 30-40% of electricity used for cooling costs from our SOLID STATE cooling tech!", "label": 1}
{"text": "You don't genuinely believe that, do you?", "label": 1}
{"text": "Because we'll be living in a Mad Max hellscape?", "label": 1}
{"text": "Typical retard “Enlightened” centrist.", "label": 1}
{"text": "I'm Brian Kilmeade", "label": 1}
{"text": "So long as it isn't seen as cringe.  (And it likely will be)\n\nBy contrast, republicans know how to reach children effectively, and permanently: through cult indoctrination.", "label": 1}
{"text": "Your quotes prove my point. \"While AI and machine learning are very closely connected, they’re not the same.\"\n\nCan't you read?", "label": 1}
{"text": "AI is the attempt to make computers like humans and uses machine learning as one technique out of many. All cars have nuts and bolts, but not all nuts and bolts are cars. Maybe now is the time I tell you I worked at the Institute of Machine Learning. Maybe finish your degree first.", "label": 1}
{"text": "https://www.adelaide.edu.au/aiml/", "label": 1}
{"text": "Just get one of these. Make sure its the Sintec one as they just work.\nThen get something like a Crucial 4TB - or whatever you can afford - make a bootable drive so you can get into disk utils and format it, or if you already have an os use an external nvme device to format it then put it in your mac and your good to go.\n[SSD to NVME 2 converter](https://amzn.eu/d/gQJ1Dp0)", "label": 1}
{"text": "Classic 'I had no idea' moment? 👀 Wonder how many more surprises like this we'll see in the space race and big business world! Anyone else think this was a calculated move, or just another day in billionaire land?", "label": 1}
{"text": "Sam’s Reddit investment popping off! 🚀 Gotta wonder, what would *you* do if you suddenly found yourself with a cool billion from an online forum stake? 🤔 Share your wildest ideas!", "label": 1}
{"text": "F$&k Putin!!", "label": 1}
{"text": "/r/endFPTP", "label": 1}
{"text": "And unfortunately, there are tens of millions of people just like that. Very susceptible people.", "label": 1}
{"text": "The real problem is the drunk *crashers*!", "label": 1}
{"text": "They are going to get their asses kicked", "label": 1}
{"text": "And all you mods work for free", "label": 1}
{"text": "He just became the new Trump and Elon in the eyes of Liberals. If one is nit with them, then they are against them. Ket the bad publicity and lawsuits begin!", "label": 1}
{"text": "About [1/5 reddit accounts](https://amzn.to/4hB15dM) are bots", "label": 1}
{"text": "No do pizza!", "label": 1}
{"text": "“But I’m doing it for the community”", "label": 1}
{"text": "Reddit became profitable because we stopped calling mods slurs", "label": 1}
{"text": "Don’t forget to use Firefox browser and ublock origin extension!", "label": 1}
{"text": "Nonsense he didn’t know", "label": 1}
{"text": "Lmao", "label": 1}
{"text": "👏💀", "label": 1}
{"text": "I didn’t add this because i don’t know the if the source is legit, but here https://sputnikglobe.com/20190423/Chinese-University-Tests-New-Hypersonic-Aircraft-1074395625.html \n\nThis was the 2019 test though. \n\nmy point was they’re legitimate. That’s all.", "label": 1}
{"text": "well said RDJ!", "label": 1}
{"text": "Chinese propaganda. Zero connection with reality. ", "label": 1}
{"text": "I once tried to create an account there, unfortunately they banned me immediately. I've never used Twitter before. I won't complain. ", "label": 1}
{"text": "Is India, anything happens like smearing cow dung on themselves. Anyone wants left hand curry?", "label": 1}
{"text": "bro, i vomited reading that…", "label": 1}
{"text": "Why don't you scoop up some delicious Chinese gutter oil with the G Shock hand?", "label": 1}
{"text": "politics has no place in this sub", "label": 1}
{"text": "Haha triggered cuz India is doing better that your god forsaken homeless country 🤪, half of your people can't even afford basic healthcare in your country lol.", "label": 1}
{"text": "Sure, after I finish my bat soup starters", "label": 1}
{"text": "they are.  gay people exist and they will see gay couples holding hands.  gay teachers exist.  acknowledging the existence of gay people isn't something to hide from adolescents.   they're fucking 12, not idiots.\n\n\nand have you turned on a TV or radio, youtube, streaming service, anything with ads?  80% of the commercials on TV discuss banning or not banning abortion.   it's literally inescapable.  having conversations about it with kids is important. \n\n\nnow, the poster also didn't say they ban these in school.  they said they ban them, period.", "label": 1}
{"text": "Looks like a foreign influence campaign post right here. Why doesn’t Reddit have that listed as a reason to report a post?", "label": 1}
{"text": "and no one is advocating that.\n\n\nbut there is a center point between \"shut your eyes and pretend the world doesn't exist\" and \"this is how you jerk a cock off.\"", "label": 1}
{"text": "I was actually a little shocked when I heard my kids say this was ever allowed in the first place. When I was in school if I busted out anything even remotely approaching that during class I wouldn't see it again till the end of the school year.", "label": 1}
{"text": "Cringe", "label": 1}
{"text": "The scale of tech smuggling operations like this is hard to grasp.", "label": 1}
{"text": "If true or not I can't be bothered.  Just finished almost 4 years of hearing, from all members of the current administration, that there is no border crisis despite the current administration stopping almost all enforcement of immigration law at the southern border, and even further, spending so much money helping and rewarding people coming in without following the legal process.\n\nIdk, the current administration, all politicians for that matter, large corporations, social media.  All doing stuff to benefit small interest groups but not the average person.  How is the current superpower of the world being controlled in such an unfair unequal manner?  Too bizzare.", "label": 1}
{"text": "no, I live in a deep red state, but swing state adjacent so sometimes IP geolocating puts me in it, and TV ads run cross border.", "label": 1}
{"text": "No it doesn’t.   Literally no one talks about it IRL apart from internet trolls like you r/technology drumming it up", "label": 1}
{"text": "I'm 37!?!?\n\nDont suck any dick on your way through the parking lot!", "label": 1}
{"text": "At the same time, Teslas are full of cameras. They make sure they protect their own.", "label": 1}
{"text": "Imagine fighting with your neighbor over turd sandwich and douche nozzle.  Neither of which know you or give a flying fuck about you once the votes are counted.\n\nPeople are just plain stupid and there is no other reasoning I can come up with", "label": 1}
{"text": "This isnt that.\n\nIts just another \"trump bad\" spam post because the election is around the corner. Thats ALL it is.\n\nAnd yes i would say the same if it was some post about walz or harris.", "label": 1}
{"text": ">He has posted about election interference, philanthropist George Soros, the 2020 election being stolen, the deep state, the replacement theory that Democrats are taking in immigrants to replace Americans, foreign influence, January 6 being a hoax, Biden not being the one in charge, and about Kamala Harris cheating.\n\nSo mainly the truth then? And I'm POSITIVE Biden and Harris haven't lied or bent the truth, pure saints they are. Fuck this \"article\" and fuck this divisive ass bias ass sub about \"technology\".", "label": 1}
{"text": "Unlike last time, this time we are free to shoot them when they come out from under their rocks.  We've had enough of this shit.", "label": 1}
{"text": "If Trump wins democrats will destroy communities like blm", "label": 1}
{"text": "Globalextremist.org is predicting violence...you don't say.", "label": 1}
{"text": "yea any post that hits the front page, you'll be sure to see again in 2-3 days reposted on various other subs. very algorithmic. and lame. so many posts but 50% are the same thing you saw the other day", "label": 1}
{"text": "Y’all forgot about Hillary?", "label": 1}
{"text": "It was a day of love. (:", "label": 1}
{"text": "lol because they actually go by the constitution?", "label": 1}
{"text": "Tech being bias again (:", "label": 1}
{"text": "Kamala behind a lot of this: \n\n- [Complete Fraud Harris Set Up Phony Reddit Posts to Look Popular](https://www.independentsentinel.com/complete-fraud-harris-set-up-phony-reddit-posts-to-look-popular/)\n- [Report: Harris Campaign Manipulates Reddit with Sophisticated Astroturfing Plan](https://www.breitbart.com/tech/2024/10/29/report-harris-campaign-manipulates-reddit-with-sophisticated-astroturfing/)\n- [Harris Campaign Caught Red-Handed Manipulating X To Censor Criticism](https://thefederalist.com/2024/10/30/block-community-notes-we-dont-like-harris-campaign-caught-red-handed-manipulating-x-to-censor-criticism/)\n\nNearly all the top subs are ran by leftist mods. In fact, 6 people control 118 out of the top 500 subs.\n\nReddit has been ran by Democrat activists for years.", "label": 1}
{"text": "Shapiro literally predicted it - the whole thing, including the primary.", "label": 1}
{"text": "Are you not aware Harris debated Shapiro, arguing for Kamala?\n\nI know you’ve been told “center left” is evil, but believe it or not, classic liberalism is still a thing. \n\nWhat a joke, aha.", "label": 1}
{"text": "Liberals in the US love violence", "label": 1}
{"text": "Drink up your gutter oil and feed your babies tainted baby formula B boy\nWuuuuuhaaaaaan", "label": 1}
{"text": "Yes, Harris argued for Kamala, Shapiro argued for Trump. It was a great 2.5 hour debate, and as I said, I liked Harrises responses to Shapiros claims.\n\nDo you not pay attention to thought leaders of the other side? That’s a serious question.", "label": 1}
{"text": "Is that really what you think he said? lol.\n\nAlso, when did I say I took advice from him? Again, reading the opposition, especially the intelligent opposition is kind of a good thing.\n\nI find your take really interesting, but I suspect you’re the one who should be embarrassed - as unlike you, I know exactly what Shapiro said about his wife.", "label": 1}
{"text": ">is it a constitutional violation?\n\nNo. There's a mountain of legal precedent that permit restrictions on Constitutional rights for children.", "label": 1}
{"text": "Elon playing dirty. So many people shill to this guy. I listened to Joe Rogan, and I heard a cash register cha ching, after he said, “Elon is one of the smartest people alive” like “this show is sponsored by Brawndo it has what plants crave.” Lex says the same phrase in his podcast: Elon is one of the smartest people alive. Ching Ching Ching.\n\nNot sure if he needs the false confidence but it reminds me of my youngest kid who used to deliberately get lost in Walmart just to hear his name on the loud speaker. \n\nThey are all shills for his money, Trump does it too. \n\nAnd Madison Square Garden? All these people on stage are his new cabinet. Are we gonna let a bunch of 12 year old boys “infcukeed your mom hur hur hur,” run the country? They all sound like COD audio.", "label": 1}
{"text": "This is what I mean, I already told you I’m voting like you, but you literally think it’s a thought crime to listen to the opposition, but you think you being wrong about something he said is somehow admirable, over being a “dirty centrist”.\n\nAre you aware of what classic liberalism even is? That’s a serious question, call me whatever names you’d like, I’m sincerely curious.", "label": 1}
{"text": "Ignore everything except the need to get out & vote BLUE", "label": 1}
{"text": "I mean he ran on the fact he’d likely serve one term, and called himself a transitional president and played up Harris quite a bit. I don’t think “planned” is maybe the best description but yeah I think he knew it was an option and a possibility even before the debate, but it’s also a big decision.   \n\nhttps://thehill.com/opinion/white-house/4718993-did-biden-break-his-one-term-pledge/amp/", "label": 1}
{"text": "Charlotte Clymers super pac did this. You can google 'her' and find out", "label": 1}
{"text": "No, lol, he was “analyzing” the video for WAP, and asked his wife what could cause liquid to pour from a woman’s genitalia to the point the floor was covered.\n\nIt was a lame joke, but the fact you actually are convinced he said that shows the value in actually being intellectually curious. \n\nI’m voting for Harris even though I know the oppositions main claims and have defenses to them. You’re voting for Harris and consider the other side literally poisonous to even consider.\n\nAgain, classic liberalism really is a thing with an actual meaning.", "label": 1}
{"text": "I actually agree that it’s not a sinister plot and that Occam’s razor says that what can easily be explained by incompetence is most likely to be so.\n\nI was simply I get the concerns - I felt uneasy with these things, but in the end, human processes are filled with humans.", "label": 1}
{"text": "Vote 🗳  Blue 💙 ", "label": 1}
{"text": "With the Free Palestine people firebombing ballot boxes here in the Seattle area, we certainly won't here.", "label": 1}
{"text": "Conservatives only know how to cheat.\n\nVote blue down the ballot", "label": 1}
{"text": "Movementlabs are behind Allvote.", "label": 1}
{"text": "Actually we totally misunderstand 1A, especially when we use the term \"free speech\" when in reality it is \"freedom of speech\".\n\n1A is not as much about protecting the speech itself, but protecting the person behind the speech.\n\nSocial media rarely ties real person to the speech and there are no consequences of speaking other than account ban (no one goes to prison for example), it is full of bots.\n\nThere's nothing really for 1A to protect there.\n\nNow, if I would say something that current leader wouldn't like, that he would find who /u/CSI_Tech_Dept really is, then tried to put me in prison for my comment. This is when 1A supposed to protect me.", "label": 1}
{"text": "Just pointing out your own words, and the fact that you’re actively misrepresenting his words hilariously and proving my point aha.\n\nStill voting D, just very embarrassed of members of my own party. Luckily y’all aren’t as bad as the crazies on the other side though.", "label": 1}
{"text": "“I’m voting D”.\n\nNow “Nazis” are even people who vote with you who air their concerns?", "label": 1}
{"text": "I know you’re not, you’re very obviously a crazy leftist, and one of the biggest problems we face in this election, as yalls rhetoric matters.\n\nKeep talking about classic liberalism like it’s a dirty word, it helps expose the idiocy and beliefs counter to the very democratic parties ideals that run rampant.", "label": 1}
{"text": "Absolutely furious and right with you. It’s interesting how many people think I’m lying about who I’m voting for because I literally shared what I was thinking and watched a debate where I said I agree with the guy who argued for Kamala.\n\nWon’t change my vote, but it sure is embarrassing, and not for me.", "label": 1}
{"text": "I am not an American. Everyone sees sick medieval rules in china.", "label": 1}
{"text": "So now you admit it was a joke? I haven’t doubled down, I pointed out your initial claim was a really weird conclusion to draw from it, I’ve been perfectly consistent.\n\nI even in a different comment said why I don’t like Shapiro, which unlike you - I root in his views - I don’t like his stance on gay marriage (I’m gay), I don’t like his stance on socialized health care, and I think he takes a crazily conspiratorial stance on Kamala, that’s why I agreed with Sam Harris when he argued for Kamala against Shapiro.", "label": 1}
{"text": "Gee, I wonder who is behind that, Elon…", "label": 1}
{"text": "Yes, ignore all the good capitalism and classic liberalism has done and blame all our current problems on it and no other possible factor, very coherent worldview. Definitely no reason it’s falling out of favor, like it always does when people figure out the idiocy behind the ideology.\n\nYour bullshit almost ruined our party and got us Trumps first presidency. Happy people are waking up now.", "label": 1}
{"text": "And most Americans totally misunderstand 1A, as it is all about to protect the person from the consequences of their speech.\n\nI guess the problem is that Americans don't really understand what 1A is for because they never lived in a country where you could go to prison or worse for saying something \"wrong\".\n\nI mean just from the recent example. In 2022 when Russia decided to do full invasion of Ukraine, many Russians were protesting this war. It ended up with all of them being sent to jail for 15 years. It was so absurd that people were arrested for holding blank paper on the red square.\n\nIf you watch some interviews of Russians they generally say they are not interested in politics. The real reason is because they are afraid of consequences of speaking out.\n\nThis is what 1A is meant to protect, not some social media traffic generated mostly by bots and anonymous people.", "label": 1}
{"text": "Yeah I can't believe leftists would do that.\n\nhttps://www.reddit.com/r/technology/comments/1gfohmw/thousands_of_pennsylvania_voters_received_a_text/lujb7zs/", "label": 1}
{"text": "> There are no progressive groups trying to lie and suppress voter turnout.\n\nLook at the history of the person running that group, because they are. I know you think your side is perfect and would never do such a thing sweetheart but they do.", "label": 1}
{"text": "I will. Because the alternative is your group winning, and we all know what comes next, at least the ones who pay attention to history and know where socialism takes us.\n\nAnd I’m fine with socialized institutions - I’ve been openly pro socialized health care and I love our programs in this country, but we both know that’s not enough for the true left, and you’ll keep spinning and circling and churning until the predictable oft-repeated end - as “true socialist utopia” just never seems to materialize, right? It’s always someone else’s fault, someone limiting you, someone “not doing it right”, right?\n\nIdiots, lol.", "label": 1}
{"text": "MAGA election interference in full swing.", "label": 1}
{"text": "Democrats are always doing election fraud /s", "label": 1}
{"text": "It’s really interesting to me to see people pretend major chunks of the history of this exact stuff aren’t known and were well taught until very recently.", "label": 1}
{"text": "That’s just whataboutism, of course trump is much more fascist and has a chain of actions to prove it. \n\nThat doesn’t disprove what OP said. What OP said was that the Dems lied about Joes condition just long enough to install an unfavorable candidate and forego primaries. \n\nWhile Donald Trump is decidedly _more_ undemocratic, I can’t imagine someone saying that the above paragraph is anything but interference in the democratic process", "label": 1}
{"text": "Biden ran on the fact he may only serve one term, this isn’t news to any of us who voted for him. https://www.politico.com/news/2019/12/11/biden-single-term-082129\n\nThe idea that there was a successful conspiracy to rig the 2020 election in several states and the evidence is Joe Biden’s 2024 debate performance is just a bizarre grasping comment, and the fact you find it persuasive says a lot.", "label": 1}
{"text": "Or he said he might do it, and she was more popular than him so he did it. ", "label": 1}
{"text": "Do you really not know the difference between liberal and left and right wingers?\n\nAgain, serious question.", "label": 1}
{"text": "So this is relevant to technology because it's said on the internet?", "label": 1}
{"text": ">who voted for her\n\nI did, she was on my 2020 ballot when Biden said he was a transition candidate. Then I voted for her again a couple weeks ago. \n\nHope that helps.", "label": 1}
{"text": "the same Russia collusion FBI?  The same suppress hunter Biden laptop FBI? \n\n  \nOk.....", "label": 1}
{"text": "Did you read it? I specifically said I had concerns over those things, and reading the other sides takes helped me feel better, as Occam’s razor says people screw up much more likely than conspiracies. \n\nPeople can call me whatever names they want, I’ve been very consistent - and I’m openly something that apparently is hated now, IE an actual liberal.", "label": 1}
{"text": "I mean, you just accused me of being a right winger because I said I’m a liberal and don’t like the left, IE actual socialists or the modern versions. \n\nIt’s weird to not be aware that’s a big standard liberal view.", "label": 1}
{"text": "The amount of cheating is crazyyyy. The GOP is a bunch of losers.", "label": 1}
{"text": "Text posts are exclusively for discussion and discourse of technology and or it's effects on society. That means at a minimum requirement they must have some short synopsis of what the topic is about and, ideally, present links to back up the hypothesis and links to show any counter points as well.\nTech support questions/opinions/suggestion requests, surveys, blogs, and videos will **NOT** be approved. Text Posts will be approved by-request only. If your post does not meet the above criteria, please edit and expand your post before messaging the moderators for approval. \nThank you for your understanding.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technology) if you have any questions or concerns.*", "label": 1}
{"text": "You can be a Democrat and dislike Harris. Any good Democrat should find her political background completely unacceptable", "label": 1}
{"text": "Hard to rig the vote if Republicans show up again moreso than 2020.", "label": 1}
{"text": "Yeah...kids also can't buy guns despite the 2nd amendment saying the government can't \"infringe\" on the right to bear arms. I'm definitely OK with kids not being able to purchase firearms. Pretty sure the first and second amendments were created so that adults can defend their country from within and without, not so kids can bully each other online.", "label": 1}
{"text": "RTO is so stupid in most cases. Let’s go back to the office so I can get on a Zoom call with other colleagues across the country.", "label": 1}
{"text": "The only sensible response would be to reject any/all correspondence beyond your stated working hours.\n\nCompanies who want to push RTO have determined that work occurring outside of the office is not productive and as such individuals should follow suit and no longer perform work related actions outside of the four walls.", "label": 1}
{"text": "True, but it 5 million is still a better deterrent compared to $500, and there's a risk that you might get a judge that will get offended and throw a book at you.\n\nAlso the more we show that no one is above the law the less socially acceptable will be for rich to bypass the law.", "label": 1}
{"text": "Your vote matters. If it didn't, MAGA extremists would not be going out of their way to get rid of your right to vote or burning ballot boxes. VOTE EARLY 🌊 🗳 ☑️\n\nWe are witnessing history 🌊🌊💙\n\nTHANK YOU REPUBLICANS FOR HARRIS 🫶💙🗳🌊🌊❤️", "label": 1}
{"text": "Almost always is", "label": 1}
{"text": "Nah, we're manipulating everyone because our president is a Zionost Jew. \nYou're also an American cum rug at the same time via Israel as a proxy,", "label": 1}
{"text": "Jsus how many fucking schemes do right wingers get to pull for this election? \n\n\n\n\nThis is absurd and crazy, yet a very real danger. I pray Harris/Walz win despite this bullshit.", "label": 1}
{"text": "This highlights a growing issue with misinformation in political advertising. Deceptive ads can manipulate public perception and mislead voters, which undermines the democratic process.", "label": 1}
{"text": "WP lol sorry I don’t listen to anything that shitrag says", "label": 1}
{"text": "Talking about Hillary again?", "label": 1}
{"text": "This character.Ai software can be quite addictive for kids. The immersive, always-available nature of these AI characters can lead users to become emotionally attached, and spend excessive time engaging with them, potentially isolating themselves from real-world relationships. We need to put an end to this before it's too late.", "label": 1}
{"text": ">Any legal precedent for adults having their constitutional rights restricted until they prove their age \n\nYes, for purchasing a firearm.", "label": 1}
{"text": "Seriously what the hell? 90% of the laws they want to pass act like kids don't have parents. Maybe they are just shitty parents themselves and want the government to be the parent. It's wild. Read a book, don't read a book, I don't care. Banning shit cause you don't want to parent your kids ends up affecting responsible people including adults.", "label": 1}
{"text": "Kids can see R rated movies when accompanied by a parent. In most states, believe it or not, underage drinking is legal when at home with parent supervision. Whether or not a kid should be using social media should be the parent's decision even if we agree it can be bad.", "label": 1}
{"text": "Don’t ignore it if you’re voting Democrat.   If you’re Democrat,  you did already vote so stay home or if you want to vote, you can vote for Trump.   The choice is yours.", "label": 1}
{"text": "Ah, so Harris can lie about Trump being connected to Project 2025 but if Trump/Elon lie about Harris' connection to Project 2028 it's OK? Gotcha! 🤣🤣😂😉", "label": 1}
{"text": "Yes, Republicans who hold one-half of one-third of the government have managed to defund whichever police force you think handles this?\n\nAlso as equally amazing is how Republicans have blocked Senate Majority Leader Schumer from getting the necessary 50 votes to confirm whichever presidential appointment you are claiming is being blocked.\n\nOof you need a civics class or at least stick to the talking points that are based in reality.", "label": 1}
{"text": "Why is this being posted in r/technology? It has nothing to do with technology.", "label": 1}
{"text": "Democrats and rigging elections, name a more iconic duo.", "label": 1}
{"text": "This is the most interesting tech ever.  Well done.", "label": 1}
{"text": "Another MAGA criminal trying to steal the election", "label": 1}
{"text": "It’s not funny when trump does things like this but when the dems do it it’s fine!", "label": 1}
{"text": "Man the dems just keep rigging this thing /s\n\nCmon MAGA, if you’re god is so great you don’t need fuckery to win", "label": 1}
{"text": "Freaking republicans are trying every trick in the book, they know they can’t win a fair election, so the cheating is on them…they’re all projectionists…", "label": 1}
{"text": "GOP is at it again \n\nWhat icky weirdo losers", "label": 1}
{"text": "Incorrect, restrictions on the purchase and sale runs contrary to the language of the second stating \"...shall not be infringed\".\n\nAge gating the purchase of firearms has been deemed an acceptable restriction for children and is constitutional.", "label": 1}
{"text": "ALL. REPUBLICANS. ARE. DOG. SHIT.", "label": 1}
{"text": "Republicans held neither majority in the House or the Senate. In the 2022 elections they narrowly won the House and was hunky dorry for about 8 months and they then kicked out their speaker and has shown a fine example of legislative ineptitude ever since. \n\nRepublicans have not controlled the Senate since the 2020 election when the Georgia run-off went to the Dems. You need 50 votes in the Senate to confirm presidential appointees and Supreme Court Justices, and 50 votes to invoke cloture on them. Legislation requires three-fifths to invoke cloture and a majority to pass. Also holds require cloture to overcome, so also 50. \n\nIf President Biden doesn't have a nominee in place, it's because the nominee doesn't have support from his own party, or it's because Leader Schumer has not prioritized the nomination; likely after a political calculation of the lack of support.", "label": 1}
{"text": "My neighborhood is full of happy looking signs saying \"Save Hamas, Vote AOC\"  and other such variations.", "label": 1}
{"text": "Just to be clear: are you trying to argue that making the purchase of an object illegal in no way impedes someone's ability to own that object?", "label": 1}
{"text": "There is a Reddit chart on which it appears that the Dems tax low incomes higher and high incomes lower, but I don't think that it claims to be authentic.", "label": 1}
{"text": "If Trump wins, Biden needs to use his presidential immunity. You don’t have much time left Joe. Take one for America. Do your presidential duty to remove the orange shit stain.", "label": 1}
{"text": "Let's talk.", "label": 1}
{"text": "Get a life lol", "label": 1}
{"text": "This is some Weimar Republic shit. The democrats are so weak against fascists inflicting long term damage to the remnants of the US democracy. I imagine they are either incompetent or think they can ride the lightning. They don't have to run on anything but \"not trump\" and can continue to inflict inequality based on class.\n\nWith a surveillance apparatus like the NSA they should already know who is organizing this. They should be able to squash this like a bug. Instead they are weak. No strength or power or resolve to do their god damn duty.\n\nTrump is probably going to loose, but the one after that will usher in a fascist regime in the US.", "label": 1}
{"text": "These tactics undermine democracy and create misinformation chaos. It's dangerous.", "label": 1}
{"text": "RTO definitely seems like a pretext for deeper issues in management.", "label": 1}
{"text": "Harris continuously references Project 2025 which has nothing to do with Trump.", "label": 1}
{"text": "When mom or woman fks it up, you Americans surely try to attach a man to it. \n\nNo wonder gender wage gap exists in America.  Huh", "label": 1}
{"text": "That’s genius!", "label": 1}
{"text": "And the Democrats flooded this country with rapists and murderers for the illegal vote to rig the election. Hmm what’s worse?", "label": 1}
{"text": "TDS is rampant.", "label": 1}
{"text": "Because the democrats have been so honest and angelic this political season.", "label": 1}
{"text": "They're using a loophole to sound like they're a Democratic ad with that name.  At least I assume that's how they're getting away with it.\n\n\n\nIt would be like if Democrats founded something under the name Project 2025 and used fake propaganda to seem like the Republicans wanted to dismantle our country.  If only that was what Project 2025 was....", "label": 1}
{"text": "This is funny on reddit of all places. Where all the major subs have been hijacked by  non-stop U.S democrats propaganda and shilling.\n\nThis whole spectacle is sadly hilarious to those from outside the U.S.\n\nAs is always the case in these matters, you're only preaching to your choir, and the way you folks are going about it, you're pushing more undecided voters away from your side than towards it.\n\nYou catch more flies with honey. You ever heard of that saying?\n\nInstead of shit talking the other side every 2 seconds. How about you talk up your candidates policies like grown ups instead?\n\nI could tell you what a few of Trumps policies are. But all I could tell you about Harris is, \"Orange Man Bad!\" based on the way you redditor are promoting her.\n\nThat should say a lot about your current efforts.\n\nWhat happened to you The U.S of A? You used to be a beacon of the west, now you've become the laughing stock of the western world, and it's been going down since long before Trump came along.\n\nIf someone were to ask me to describe U.S politics in a single word I'd have to say \"childish\".", "label": 1}
{"text": "https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/", "label": 1}
{"text": "The second Amendment is a Constitutional right, just like the first Amendment. There are multiple precedents for restricting Constitutional rights for children.\n\nIf you want to make it about the first amendment specifically, pornography is protected under the first and is age gated as well.\n\nChildren don't have the same legal rights as adults and the USSC has made that clear on multiple occasions.", "label": 1}
{"text": "Imagine that. The other way around", "label": 1}
{"text": "This has nothing to do with technology", "label": 1}
{"text": "Don’t politicians miss-represent their opponents regularly? This seems like nothing new.", "label": 1}
{"text": "Please, describe what in the ads misrepresents her actual, past and present policies?", "label": 1}
{"text": "This made me laugh way too hard.", "label": 1}
{"text": "Imagine believing this bs.", "label": 1}
{"text": "Can two camera images offset like a human's eyes at least perceive depth, or does it not work across two images overlapping in the same way that a pair of eyes focus and converge on an object at a certain distance?\n\n\nAlso, didn't Tesla's used to have LiDAR but was removed for cost reasons?", "label": 1}
{"text": "So Republicans are finally playing the same game Dems have done for years and you're mad", "label": 1}
{"text": "I don't understand why the Democratic party is so stupid. Can't you learn how to fight? You're at war.... What the fuck are you doing?", "label": 1}
{"text": "is there anything in those ads that are false?\n\nthe website links directly to Harris' statements that back up their claim", "label": 1}
{"text": "Suuuuuch fake news", "label": 1}
{"text": "Get this poltical aids out of this sub", "label": 1}
{"text": "And yet not a single example is shown...", "label": 1}
{"text": "Redditors complaining about someone else misrepresenting facts.... The irony", "label": 1}
{"text": "mega.io also has a Linux client.", "label": 1}
{"text": "I thought Zuckerberg was a lefty? Did he flip too?\n\n\nSo that's Elon, Bezos, and now Zuckerberg flipping from the left? 3 of the wealthiest people in the world.\n\n\nIt's not looking good for the left. Next week should be quite entertaining.", "label": 1}
{"text": "They are just stating facts and exposing the Democrats.", "label": 1}
{"text": "I'm so happy that you took the time to read it. Now please fuck off. Thank you.", "label": 1}
{"text": "It's really sad imo. It's easy to cast stones from behind a computer screen and go on about your day without thinking about those you hurt. Social media disconnects people from others as well as decimating empathy.", "label": 1}
{"text": "Kamala is doing the same swear y'all neanderthals", "label": 1}
{"text": "More real than toys from china. ", "label": 1}
{"text": "Sensor size too small. In the evenings, recordings will be of poor quality. I did research a few years ago and a mirrorless camera always wins. So no changes. ", "label": 1}
{"text": "Didn't a news station the other day let slip that the PA results were already in with 100% turnout, Harris winning?", "label": 1}
{"text": "Sounds like healthcare, tuition, and grocery stores these days. ", "label": 1}
{"text": "It takes 50 votes to confirm an fec commissioner. If one isn't confirmed why isn't Senate Majority Leader Schumer moving him on the floor? That's a question only his office can answer because they have the sole ability to do it. They don't need Republicans to confirm anyone and they have 51 votes.\n\nAs passionate as y'all are, you have a basic misunderstanding of how the government works.", "label": 1}
{"text": "Yes.. everyone else...", "label": 1}
{"text": "Another non-technology post, sigh.", "label": 1}
{"text": "This subreddit has just become another political sub with a touch of Luddite thrown in.", "label": 1}
{"text": "Yes, by Gemini XD ", "label": 1}
{"text": "Remember to tell older people to delete their accounts from fb. ", "label": 1}
{"text": "Impacted printed McMansion here I come", "label": 1}
{"text": "The real question is why havent they?", "label": 1}
{"text": "The dems should respond by sending a straw man to trumps campaign organizers along with some boxing gloves, gasoline and matches.", "label": 1}
{"text": "Text posts are exclusively for discussion and discourse of technology and or it's effects on society. That means at a minimum requirement they must have some short synopsis of what the topic is about and, ideally, present links to back up the hypothesis and links to show any counter points as well.\nTech support questions/opinions/suggestion requests, surveys, blogs, and videos will **NOT** be approved. Text Posts will be approved by-request only. If your post does not meet the above criteria, please edit and expand your post before messaging the moderators for approval. \nThank you for your understanding.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technology) if you have any questions or concerns.*", "label": 1}
{"text": "Yes, you read that correctly.", "label": 1}
{"text": "How did Reddit become full of these trash lefties? Do they use AI to make sure that almost no one with any common sense that isn't brainwashed by corrupt media are on here? It's astonishing.", "label": 1}
{"text": "boTh SIdes!!", "label": 1}
{"text": "Sounds similar to Democrats saying Trump is associated directly with Project 25. Its a misrepresentation.", "label": 1}
{"text": "In just over 5 days he will be President elect. He doesn’t care.", "label": 1}
{"text": "Karma farmmmmmmm", "label": 1}
{"text": "12 yo can vote now?", "label": 1}
{"text": "The cheapest tourbillon watches cost around $400 to $500.", "label": 1}
{"text": "Except this isn't really true.", "label": 1}
{"text": ">My entire question was regarding the first amendment…\n\nAnd my statement, which you were responding to, was in regards to the constitutionality of restricting rights based on age and there is. \n\n>Except I don’t have to verify my age using personally identifiable information to access it. Even in a physical store.\n\nIrrelevant. The question raised was a Constitutional one, and the USSC isn't on your side in regards to age restrictions. \n\n\n>They don’t take my id, scan it, and save it forever on an unsecured server.\n\nAgain, irrelevant. The question posed was if requring verification of age is constitutional. \n\nStoring someone's identifying information isn't a violation of a constitutional right.\n\n>Why should adults have to jump through hoops to verify their age to engage in basic speech on social media?\n\nI see your confusion. You seem to believe \"bad legislation\" is synonymous with \"unconstitutional\", it's not. It can be, but in this case, age gating rights to adults is perfectly Constitutional.", "label": 1}
{"text": "I know it's not a direct comparison, but the AI generated results on Google search are AWFUL. They are factually incorrect like 9 out of 10 times, or otherwise just completely irrelevant. Answering the completely wrong question. \n\nThey're wrong so often that they just take up space, I will never just trust the AI summary without looking into results myself.", "label": 1}
{"text": "Do we even know if the \"losses\" aren't due to trump cashing out the stock?\n\nIt's very clear that this stock is just a way to send money to trump.\n\nI mean with the valuation looks like each user Truth owns is worth nearly $150k, the company has no IP, the instance running is fork of Mastodon (also violating their AGPL license).\n\nWhat's possibly there would make it worth $10.3 billion? From the IP standpoint it's actually more like a liability, I guess they bet Mastodon won't sue.", "label": 1}
{"text": "Being 5 years out of security updates is never a good idea. \n\nThere are numerous unpatched vulns and privilege escalation methods for a fully patched windows 7 install. Super bad idea to stay on it just cause it’s better than the latest version. \n\nWhen windows 10 hits end of support the same thing will happen and unaware users will undoubtedly stay on it well past the last security updates just like they did on 7 and XP.", "label": 1}
{"text": "It really isn’t just the US. It’s everywhere. Anywhere with new cars", "label": 1}
{"text": "It's going to be tough getting food when most Liberals are city dwellers. Please, come out to the country and try to start some shit. Towns like ours are ready and waiting. You'll be walking into an ambush.", "label": 1}
{"text": "Putin and the BRICS nations are [baiting the US and NATO](https://amzn.to/3An6ZhE) into wasting economic and military power, so BRICS can become rhe dominant superpower of the world. That's what all these wars in [Ukraine, Israel, and Taiwan next](https://amzn.to/3An6ZhE) are all about.", "label": 1}
{"text": "Hmm, that's concerning if true. Using AI to influence voters seems pretty shady, no matter who's behind it. We gotta be vigilant about tech being misused for political agendas. Hopefully the relevant authorities are on top of monitoring and addressing these kinds of issues. As citizens, staying informed and thinking critically about what we see online is key", "label": 1}
{"text": "yes yes yes:)", "label": 1}
{"text": "Yikes! Talk about a rough day for Trump! Losing $1.3 billion in net worth is no joke, especially after a social media stock crash. Guess the \"Art of the Deal\" didn’t apply here! What’s next for him? 🤔📉", "label": 1}
{"text": "Wow, just wow! Facebook cashing in over a million bucks to spread election lies? 🤦‍♂️ It’s like they’re running a misinformation factory. Can’t wait to see how this blows up in their face! 💸🗳️", "label": 1}
{"text": "The entire model industry could become obsolete if AI glam bots keep churning out cheap, soulless designs. It’s not just fashion; it’s creativity at risk.", "label": 1}
{"text": "Creative roles being replaced by AI feels like we’re losing a part of what makes us human. It’s frustrating to see art turn into just another output.", "label": 1}
{"text": "Ghost jobs are the new tech zombies—haunting the job market and leaving despair in their wake. It's like a bad horror movie where everyone’s stuck applying to jobs that don’t even exist. No wonder morale is tanking!", "label": 1}
{"text": "Sophos vs. Chinese hackers: a five-year digital showdown that feels like an espionage thriller! Imagine the plot twists as they battle over network devices. Who needs Netflix when the cybersecurity drama is real life? 🍿🔒", "label": 1}
{"text": "Samsung’s hitting the brakes, shutting down 50% of its foundry production lines! Looks like even tech giants are tightening their belts. Is this a strategic move or just a sign of the times? 🏭💸", "label": 1}
{"text": "A wet dream for now, but I see a big company replacing their entire C suit with AI in the near future. It's not like these people come up with new brilliant ideas, they just repeat the same steps over and over until they're fired, and do it at the next company. Why pay a CEO 20 million when you can subscribe to a business management focused AI to present all the best options that have worked to solve X problem in the past? No ego to deal with? C suites should be sweating. Bar something like a CTO; CEO's, COO's, CPO's, CMO's are all extremely easy to replace with essentially a 'brand ambassador' team to meet clients and do the leg work, and there's no reason to pay them millions.", "label": 1}
{"text": "why would that matter?", "label": 1}
{"text": "Fraud in the pursuit of increasing stock price, aka securities fraud", "label": 1}
{"text": "Sounds fair", "label": 1}
{"text": "I’ll never forgive them for making me side with Google.", "label": 1}
{"text": "My sister in-law worked in security for Wegman’s. She said the security system was so good she could zoom in and read the texts on people’s phones.\n\nI’m not saying they read people’s texts, just saying that’s how good the camera’s are.", "label": 1}
{"text": "I worked in the court system in New Jersey and worked on a relevant case. My local grocery store caught someone in the act of shop lifting while using facial recognition. The system alerted when the thief walked through the doors, he was recognized from past incidents. The cameras followed him, the crime was captured on video, cops were called and he was arrested in store. Had no clue it was a thing.\n\nI wonder how mask usage has impacted this tech.", "label": 1}
{"text": "That’s why they should all wear masks. Not to defeat Covid.. to defeat facial recognition!", "label": 1}
{"text": "Oh thats why", "label": 1}
{"text": "This could be huge for people in remote areas or disaster zones.", "label": 1}
{"text": "> We 'won' that race to the moon\n\n\nSure. Except, there never was a race to put a msn on the moon. The UUSR won every other spsce accomplishment.\n\n\nAs you say though, it doesn't help you are the first and then do nothing with it for 55 years.", "label": 1}
{"text": "Oh i stop using anything that uses AI and everyone else should to. If they're using AI to create fake voices or create fake images, it's a huge red flag. ", "label": 1}
{"text": "Haha I worked at a deli in the early 2000s for $5.15/hr and we were allowed to make one sandwich for ourselves at half price per shift if we worked at least 4 hours. And the owner was VERY adamant about weighing out all the ingredients.\n\nBut fuck that man, I made myself a free Reuben with an assload of meat on it almost every shift. The owner was selling weed out the back in Texas so he probably didn’t want to make any of us too mad lmao.\n\nI also hooked him up with my dealer who then helped him source better product, so fuck off Mike, I’ll take my free sandwiches.", "label": 1}
{"text": "as someone with arthritis, I rely on tactile feedback from buttons. Touchscreens are often too small and fiddly for me to use accurately.", "label": 1}
{"text": "I deleted my account long ago.", "label": 1}
{"text": ">Is this bullshit still going on ?\n\n\nWhat, you thought it stopped because every full moon a thread on how Islamic countries like UAE and SA kill their slaves, is upvoted to the front page on Reddit?", "label": 1}
{"text": "GIGO", "label": 1}
{"text": "People should use a script blocking extension that shows them what tracking is being done on each site. Linkedin had trackers on those sites.", "label": 1}
{"text": "People said the same during the 2016 elections and nothing happened.\n\nMaybe it's time to calm with the fear mongering a bit.", "label": 1}
{"text": "The economy did fine with his first term.\n\nWhat truly would crash the economy is everyone putting their assets into gold, so I guess you are worse than Trump", "label": 1}
{"text": "Hell no.", "label": 1}
{"text": "Did this happen the first time around with Trump?", "label": 1}
{"text": "I do think Elon is a douche, but I clicked the Rolling Stone article you linked and it’s pretty clear that you’re blatantly misrepresenting what he was actually saying.", "label": 1}
{"text": "Atleast it's [not China](https://amzn.to/4hqq5nV)", "label": 1}
{"text": "Edit: If anyone has a link to Ars Technica, I wish that news site would publish this news also. People need to know just now bad the problem of tracking can be.", "label": 1}
{"text": "Read the article. They didn't use LinkedIn to get to the sites. LinkedIn used a tracking pixel. Just having a LinkedIn account was enough.", "label": 1}
{"text": "No dude, you don’t have neither the manpower or the need to go back in time and waste human resources on manual labor.\n\n4% is pretty close to the limit of how low you want the unemployment rate to be what you’re suggesting is super inflation.", "label": 1}
{"text": "The WHAT?! National sales tax?!? So they're actually insane", "label": 1}
{"text": "And... yet the official number of unemployed is still 4% or are you suggesting that the illegal immigrants should be included in that number?", "label": 1}
{"text": "Biden left most of the Tariffs in place and even added to them in May of 2024. How pissed were you about that? He left them in place and fleeced China for 50B more than trump did. That was passed on to retail and consumers.\n\nBut now it is going to affect you? It should have already. Trump is a clown. No question about it. But you are leaving the party in place that increased tariffs and put even more strain on the consumer and worker.\n\nBiden had a worse track record with tariffs than trump did but now that is all going to change with Kamala? She has shown no indication of reducing tariffs.\n\nIf this is such a major indicator of your future well being, why have you not taken a closer look at the actual numbers?", "label": 1}
{"text": "End of days!!!!! Hurry nowwwww", "label": 1}
{"text": "And vote for the duo who brought us skyrocketing inflation? Okkk", "label": 1}
{"text": "Not true in this case. LinkedIn secretly took it.", "label": 1}
{"text": "Don't think there is one. It opened for me.", "label": 1}
{"text": "Assuming ~5lbs of meat per chicken, 40 chickens buys an iphone?\n\nMaybe I should get into the chicken business...", "label": 1}
{"text": "Absolutely. Tariffs can often exacerbate inflation. By shielding native industries from global competition, these industries feel less pressure to keep prices competitive. This lack of competition can lead to higher prices for consumers, contributing to overall inflation. It’s a reminder of how interconnected our economies are and the importance of considering global market dynamics.", "label": 1}
{"text": "Not that simple. AdBlock doesn't stop all tracking pixels. People would need the NoScript extension to see/block all the tracking scripts sitting on a site.", "label": 1}
{"text": "At the very least, use a different email address. (Though they're tracking much more than that.) If you have real Firefox (not the fake one on IOS), put LinkedIn in a container, too. Still won't be perfect, but better than nothing. And know that job hunting on the site is rapidly becoming a joke. You can't trust a lot of stuff there.", "label": 1}
{"text": "No one can possibly be this dumb.", "label": 1}
{"text": "Also because if employers pay more, LinkedIn will happily provide them with information you thought you hid on the site.", "label": 1}
{"text": "Campsites... National parks... Quiet neighborhoods...\n\nArgumentative lil shit aren't ya", "label": 1}
{"text": "I think they just don't like your tone", "label": 1}
{"text": "bing.com/chat was decent for like 2 weeks and then they hosed it up", "label": 1}
{"text": "This traitor cant wait to destroy the middle class yet they are his biggest supporter. Might as well be in the movie Dont Look Up or Wall E at this point. Absolutely unreal people are actually voting for this clown. Make a list and deport them all to Russia like fr.", "label": 1}
{"text": "Lol so corporations with lower profits for direct taxes, but not for increased good prices?", "label": 1}
{"text": "So, who’s taking over the shitty jobs?\n\nThe 4% is extremely relevant, if you know how this shit works", "label": 1}
{"text": "Not heard of beat buy ever😂😂😂", "label": 1}
{"text": "Lol. So I still dotlnt know.  Do you want farm subsidies or no? Or the key point is you get to complain about them", "label": 1}
{"text": "Lol. So what's the point of you proselytizing. Just to pat your own back? Or cuz you don't think you'll ever get challenged or at least the admin will ban anyone who does.  \n\nThere is nothing more pathetic than people who spend their free time on Internet forums suddenly pretending it's a waste of time", "label": 1}
{"text": "Some more hard hitting journalism", "label": 1}
{"text": "Oh, but it played a big part, I'd say.\n\nIn order to harvest more data for their AI, Google started ranking Reddit posts at the very top of Google search, driving massive amounts of traffic to Reddit which it otherwise wouldn't have received.\n\nBut regardless of that, it's well deserved. It's only downhill from here, most likely, as per usual with these companies expecting a bigger profit every single year, stuffing more and more ads and paywalls down the users' throats to that end.", "label": 1}
{"text": "Show me the farm bill turned for the last 30 years...b", "label": 1}
{"text": "Uh? No paywall there when I clicked.", "label": 1}
{"text": "Youve literally made 0 claims about why they are different.... But Im the one acting in bad faith.... I've told you multiple times why I think they are the same ..  cuz they have the same impact on the bottom line. Either you can say why they are different or you can't and at best so this thinly veiling appeal to authority. \n\n\nPlease continue. I know you literally are incapable of stopping. Either a bot.... Or worse", "label": 1}
{"text": "It's a classic tactic: stir up anger and fear over immigrants to distract from the real issues, then quietly profit while everyone's looking the other way. It's a strategy that preys on people's emotions and diverts attention from the policies that actually harm them.", "label": 1}
{"text": "Habibi, \n\nWe are literally in a war against Putin right now thanks to Biden and Harris. Yes she deserves the credit bc she literally started the war. Guaranteeing that \"Ukraine will be apart of NATO\" is what led to invasion. \n\nThe threat of nuclear war has NEVER been higher. \n\nThe influx of Iraqi refugees destabilized Syria. You are brainwashed to believe that about Assad bc Hillary, Obama wanted to take him down. Trump saved us from WW3 bc surely Hillary would have invaded in 2016. \n\nWe had no business in Iraq, Syria, Libya or in any of the other Arab spring countries. They weren't as organic as you think, google \"CIA regime changes.\" \n\nBoth my parents were born in Iraq, I know a little bit. \n\nSo you want to credit the death toll of COVID on Trump? More people died \"due to covid\" under Biden, which is interesting bc the vaccine was out by the time Biden took office. And conveniently they turned off the COVID death toll ticker of all the \"news\" channels on January 20, 2021.  Btw, It came out of a lab in Wuhan, China called the Wuhan Lab for Coronaviruses.", "label": 1}
{"text": "I sure have.\n\nThe statement still stands though - only downhill. Except now it'll likely get Much worse.\n\nSince the sudden 6x spike from Google's deal in 2nd half of 2023, once this bump starts to flatline, the users will be in a world of shit when the company then has to figure out how to keep up those same kinds of profits, or else they'll be seen as performing \"badly\" (from investors' pov), and then being forced to fuck users with the hardest possible dildos in their arsenal as an emergency measure.", "label": 1}
{"text": "thats like saying \"crime is down.\" yeah, its down, from the astronomical levels it had surged to in the last few years", "label": 1}
{"text": "just because it was worse 40 years ago means it wasnt bad a few years ago?  i dont think you know lmao", "label": 1}
{"text": "More like when not if 🤣", "label": 1}
{"text": "lmao i cant take you seriously anymore", "label": 1}
{"text": ">Former President Donald Trump has proposed a wide variety of tax policy changes. Taken together, these proposals would, on average, lead to a tax cut for the richest 5 percent of Americans and a tax increase for all other income groups.\n\nhttps://itep.org/a-distributional-analysis-of-donald-trumps-tax-plan-2024/", "label": 1}
{"text": "I didn't have to. It was a straight click and read.", "label": 1}
{"text": "Look at these ziobots comments 12 upvotes within 5 minutes of posting with a companion bot reply as well! How unusable the internet has become", "label": 1}
{"text": "I love how Ben Shapiro quickly shut up lefties with their strong defense of Israel...\nMaybe you should watch a few videos of him to understand what's going on.", "label": 1}
{"text": "Except Biden literally just raised tariffs on China: https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/14/fact-sheet-president-biden-takes-action-to-protect-american-workers-and-businesses-from-chinas-unfair-trade-practices/", "label": 1}
{"text": "It's disheartening to think that some people might prioritize harmful policies over the well-being of the economy and society. Even one person making such a choice is too many. It's a stark reminder of the importance of informed and compassionate decision-making in the voting booth. ", "label": 1}
{"text": "This is why they hate tiktok harder to spew nazi propaganda while showing your face...", "label": 1}
{"text": "Yup the zionazis always try brush the nakba under the rug lol they always say their enemies want to kill them but never why, serious persecution fetish", "label": 1}
{"text": "Brother just tried explain Tariffs as if it was a Corporate tax. Go open up an Econ book again my friend.", "label": 1}
{"text": "How can you support the active killing, maiming, raping, torturing, their homes and lands being stolen by Zionists for the past 7 decades? Have you looked at how Palestinians are treated by Israelis? How can you call yourselves a human and support Israelis?", "label": 1}
{"text": "China's been kickin everyone's ass a while", "label": 1}
{"text": "God damn it google STOP already!", "label": 1}
{"text": "It made search lie to me... even worse than before", "label": 1}
{"text": "No but if you vote Kamala get ready for a China invasion!", "label": 1}
{"text": "You accidentally gave the game away there, bud.", "label": 1}
{"text": "I wish that everything the Israelis are doing to Palestine is done to you. Nothing more, nothing less", "label": 1}
{"text": "Same!", "label": 1}
{"text": "Guys I would like to buy a zero flipper, can anyone help?Metamask:0xB80722d97F63b0bF58f8cf4289ABEa56964F22Ed", "label": 1}
{"text": "God you're dumb", "label": 1}
{"text": "*Next time open your garage door before starting your engine.*", "label": 1}
{"text": "**Vladimir Lenin:** \"The capitalists will sell us the rope with which we will hang them.\"\n\n**Vladimir Putin (probably)**:  \"Don, you should implement tariffs so you can use exemptions to extort your corporations for money and favor.  Make America an oligarchy.\"", "label": 1}
{"text": "More likely to be killed or kidnapped for random by the members of the \"religion of peace\"", "label": 1}
{"text": "The shittiest people I’ve met in my life have been Israelis.", "label": 1}
{"text": "> I know you didnt just use the word holocaust to describe the israel-palestine\n\nA Nakba, to which I will henceforth refer to by it's western name a Holocaust is appropriate here.\n\nNo amount of crying, or using the anti-semitic slur or victimhood will change the facts on the ground.", "label": 1}
{"text": "> You don't understand the difference between employees purposefully disrupting business to push their political agenda and a business giving money to charity or following the law?\n> \n\nI understand, one is when the employees help Ukraine, which whilst bad, is a normal war. The other is when employees help prevent a genocide by a nuclear state, backed by the most militaristically powerful state in the world, against an open-air prison with a militia army that has 0 tanks, 0 planes, 0 helicopters and whose best weapon is a homemade rocket made from pipes.", "label": 1}
{"text": "One of us makes up shit to support genocide.\n\nThe other gives facts and backs it up:\n\nhttps://x.com/Kahlissee/status/1827274798298222937", "label": 1}
{"text": "> They ain't helping helping anybody.\n\nThey're helping... certainly more than you. They raise awareness, they put pressure on the company. Many companies in my country the UK have no stopped trade with Israel precisely because of these activities, the latest being Barclays.\n\n> British banking giant Barclays has sold all of its investment shareholdings in Israel’s largest weapons company Elbit Systems Ltd.\n\nhttps://www.middleeasteye.net/news/barclays-israel-elbit-systems-sells-shares-weapons\n\nThe mood is shifting, israel today is seen, treated and shown as VERY DIFFERENTLY to 1 year ago. It's all baby steps, and thanks to the bravery and sacrifice of these patriotic americans the hasbara in this thread are attacking.\n\nIsrael is a genocidal state and should be treated as a Nazi apartheid regime. They should get no respite anywhere.\n\nThe most powerful thing I heard, that applies to you and others here now:\n\n\"If, during your history classes you've ever wondered what you would do during slavery, the Holocaust, or civil rights movement, wonder no more: **you're doing it right now**\"", "label": 1}
{"text": "Israel targeting peacekeepers…no, never. What next…targeting aid workers, schools, and hospitals?", "label": 1}
{"text": "They won’t give up. It’ll be the same twelve year progression of those in power in Germany in the 1900s. \n\nThey’ll try to deport them, realize it’s too difficult and find it’s more cost effective to gas and incinerate them instead.", "label": 1}
{"text": "By killing over 40.000 civilians? They probably just created the strongest generation of terrorists ever.\n\nIt's a toxic loop you can't throw bullets at.", "label": 1}
{"text": "https://x.com/afshinrattansi/status/1772639915676782897\n\n\"He grabbed a woman, young and good looking, prepared a bedroom and wanted to fuck her... the girl came back half dead, like a rag\"\n\n\"one guy raped there a sixteen year old girl\"\n\n\"he just took them, and murdered them in the enclosures... surrounded by barbed wire\"\n\nYea that's a genocide, and after the events of last year I now support the notion that israel needs to be wiped off the map. The people can return to where they came from except those who committed genocidal acts: they need to be tried in nuremberg style trials and executed if guilty.", "label": 1}
{"text": "It's not a 1-day thing, but it's happening. **Breaking news from 19 hours ago:**\n\nMore than 100 BBC staff accuse broadcaster of Israel bias in Gaza coverage\n\nBBC staff:”We often seem to prefer to leave Israel out of the headline if at all possible or cast doubt on who could be to blame for airstrikes. The verification level … for anything related to Gaza hugely outweighs what is the norm for other countries.”\n\nIt's happening, the tide is turning... every day, there is some more of me, and a lot less of the zionist genocidal apologists.", "label": 1}
{"text": "Serves the irish right. They have been supporting hamas and hesbollah since day 1.", "label": 1}
{"text": "ITT loads of Israeli shills looking to justify the attacks on international observers with banned weapons like white phosphorous. \n\nStay classy Zionists.", "label": 1}
{"text": "Just take a look to /r/worldnews", "label": 1}
{"text": "Worldnews is by far the most toxic far right pro genocide sub on reddit\n\nI'm surprised it hasn't been taken down already", "label": 1}
{"text": "That sub’s mods are complete shit lmao", "label": 1}
{"text": "Most of you are bots or state actors", "label": 1}
{"text": "You can't open it?", "label": 1}
{"text": "Haha, maybe it’s bots all the way down! Who knows. I think public opinion is shifting against Israel for sure though, especially with younger folks. Whatever your position on the topic is.", "label": 1}
{"text": "> That's a very racist and Islamaphobic view you hold. \n\nGrasping at straws, I see. This comment would be funny if you weren't serious.", "label": 1}
{"text": "Shifting? As in were different? \n\nIm an israeli and i have no clue myself of the complexity and nuance, history and such.   \n\nYour comments, ( saw a few) seem very strong and decisive, is that how you feel? \n\n Can israel exist?", "label": 1}
{"text": "Every single human rights organization trying their best to help despite the Israel regime? Start there. ", "label": 1}
{"text": "The next generation of battery tech has always been just around the corner according to the manufacturers. If you want an EV, buy what's currently available, don't stress.", "label": 1}
{"text": "SS batteries have always just been a delaying tactic by certain car manufacturers.\n\nWe dont need them, they shouldn't delay electrification, and our current cells (esp LFP) are plenty good enough and safe enough.", "label": 1}
{"text": "I have noticed that Zionists, despite using Nazism and the Holocaust as the moral justification for their project, understand exceptionally little about Nazi ideology and genocide or even antisemitism. They understand far less about these things than the average person. \n\nBecause they need to. Because if they actually understood these things, they would have to face that Israeli Jewish Law is identical to Nazi Race Law, that Zionism is identical to Nazi Lebensraum, that the forced sterilizations and \"sperm retrieval units\" are Nazi Lebensborn, that their belief in an Islamo-terrorist conspiracy against the Jewish Nation is identical to the Nazi belief in a Judeo-Bolshevik conspiracy against the German Nation, that Gaza is a veritable Warsaw Ghetto, and that what Israel is doing is genocide by every measure. \n\nThey need to close their eyes to this fact and disrespect their own history as Jews, essentially rejecting that Nazism was bad for any reason other than that it targeted Jews. Not because it was a racial and civilizational supremacist ideology based on colonizing, displacing other peoples and eliminating their resistance for the proliferation of european industrial capital. They need to somehow carve out a definition of Nazism and the Holocaust and genocide which allows Zionists to do all of these things just under a different name. \n\nThis distortion of what Nazism actually was and what genocide actually is, as well as the deliberate ignorance about these subjects among Zionists, is tantamount to Holocaust denial. \n\nZionism put a fresh coat of paint on Nazism and moved its target to the middle east and Muslims. It is no coincidence the pogroms against Muslims are occuring in Europe at the same time as the genocide in Gaza is coming to a head.\n\nIt's not just modern day zionists never cared about jews in general and  It's also why a future prime Minister of Israel tried and ally with the n4zi's citing shared values. \n\nhttps://allthatsinteresting.com/lehi\n\nIt's why racists from South Africa moved there when apartheid ended so they could still live in an apartheid regime \n\nhttps://archive.ph/mTZs4\n\nIt's why Richard Spencer the neo n⁴zi uses them as a model\n\nhttps://www.haaretz.com/hblocked?returnTo=https%3A%2F%2Fwww.haaretz.com%2Fisrael-news%2F2018-07-22%2Fty-article%2Fisraeli-nation-state-law-backed-by-white-nationalist-richard-spencer%2F0000017f-dbb1-d3ff-a7ff-fbb1567d0000", "label": 1}
{"text": "I have noticed that Zionists, despite using Nazism and the Holocaust as the moral justification for their project, understand exceptionally little about Nazi ideology and genocide or even antisemitism. They understand far less about these things than the average person. \n\n\nBecause they need to. Because if they actually understood these things, they would have to face that Israeli Jewish Law is identical to Nazi Race Law, that Zionism is identical to Nazi Lebensraum, that the forced sterilizations and \"sperm retrieval units\" are Nazi Lebensborn, that their belief in an Islamo-terrorist conspiracy against the Jewish Nation is identical to the Nazi belief in a Judeo-Bolshevik conspiracy against the German Nation, that Gaza is a veritable Warsaw Ghetto, and that what Israel is doing is genocide by every measure. \n\n\nThey need to close their eyes to this fact and disrespect their own history as Jews, essentially rejecting that Nazism was bad for any reason other than that it targeted Jews. Not because it was a racial and civilizational supremacist ideology based on colonizing, displacing other peoples and eliminating their resistance for the proliferation of european industrial capital. They need to somehow carve out a definition of Nazism and the Holocaust and genocide which allows Zionists to do all of these things just under a different name. \n\n\nThis distortion of what Nazism actually was and what genocide actually is, as well as the deliberate ignorance about these subjects among Zionists, is tantamount to Holocaust denial. \n\n\nZionism put a fresh coat of paint on Nazism and moved its target to the middle east and Muslims. It is no coincidence the pogroms against Muslims are occuring in Europe at the same time as the genocide in Gaza is coming to a head.\n\n\nIt's not just modern day zionists never cared about jews in general and  It's also why a future prime Minister of Israel tried and ally with the n4zi's citing shared values. \n\n\nhttps://allthatsinteresting.com/lehi\n\n\nIt's why racists from South Africa moved there when apartheid ended so they could still live in an apartheid regime \n\n\nhttps://archive.ph/mTZs4\n\n\nIt's why Richard Spencer the neo n⁴zi uses them as a model\n\n\nhttps://www.haaretz.com/hblocked?returnTo=https%3A%2F%2Fwww.haaretz.com%2Fisrael-news%2F2018-07-22%2Fty-article%2Fisraeli-nation-state-law-backed-by-white-nationalist-richard-spencer%2F0000017f-dbb1-d3ff-a7ff-fbb1567d0000", "label": 1}
{"text": "Oh shut the fuck up. Sorry I wasn’t a part of the mass hysteria and fearmongering following 9/11.", "label": 1}
{"text": "Hopefully the truthful Uber Ads will come out.\n\n\"Be your own boss. Earn $4 an hour with Uber.\"", "label": 1}
{"text": "DCI reported several abuses of children by Israeli forces, including the rape of a 13 year old boy, and shortly later, Israel invoked a law designating them and five other NGOs as terror groups, raided their offices in the middle of the night, stole all of their computers.  But they never returned the confiscated items, never presented any evidence, and never arrested any of the supposed \"terrorists\" who worked at the terror organizations.\n\nFrom DCI itself:\n\nhttps://defenceforchildren.org/israeli-forces-raid-and-seal-shut-dcip-and-5-other-civil-society-organisations-offices-leaving-an-official-notice-declaring-the-organisations-unlawful/\n\nThe UN statement:\nhttps://www.ohchr.org/en/press-releases/2021/08/un-experts-condemn-raid-west-bank-ngo-urge-israel-meaningfully-probe-child\n\nCorroboration by former US State Department official: https://www.npr.org/2023/10/19/1207037984/josh-paul-resign-state-department-military-assistance-israel-gaza\n\nThe Dahiya doctrine and use of collective punishment \n\nhttps://en.m.wikipedia.org/wiki/Dahiya_doctrine\n\nhttps://www.hrw.org/news/2023/02/02/israel-collective-punishment-against-palestinians\n\nA prior head of Mossad (Israel's CIA) appointed by Netanyahu has described the situation as apartheid along with South Africans who have experienced it and all of the major human rights orgs including Israeli ones. \n\nhttps://www.btselem.org/apartheid\n\nhttps://www.amnestyusa.org/press-releases/israel-must-end-its-occupation-of-palestine-to-stop-fueling-apartheid-and-systematic-human-rights-violations/\n\nhttps://apnews.com/article/israel-apartheid-palestinians-occupation-c8137c9e7f33c2cba7b0b5ac7fa8d115\n\nThey have been trying to starve them for decades now. \n\nhttps://www.bbc.com/news/world-middle-east-19975211\n\nhttps://news.un.org/en/story/2024/03/1147656\n\nHere is a list of unequal laws in Israel\n\nhttps://www.adalah.org/en/law/index\n\nAnd the fact that they made it so only jews have a right to self determination\n\nhttps://www.timesofisrael.com/final-text-of-jewish-nation-state-bill-set-to-become-law/ \n\nNot all of the unequal laws only hurt Palestinians. That's the thing about racism it hurts everyone including the Israeli who are forced to serve in a genocidal war and ordered to conduct collective punishment on civilians.\n\nhttps://www.breakingthesilence.org.il/\n\nhttps://www.hrw.org/news/2023/02/02/israel-collective-punishment-against-palestinians\n\n\"Unlike the beginning of the war, now about half of the Jewish public (51% compared to 37% in November) believes that the IDF uses firepower appropriately against Gaza, compared to 43% (58% in November) who believe that there is use of TOO LITTLE FIREPOWER. An absolute majority (88%) also justifies the scope of casualties on the Palestinian side when considering the goals of the war.\"\n\n43% think they haven't got far enough and 51% thinks they have gone the correct amount which means, ONLY 6% are undecided or think they have gone too far.  And while 88% think the war goals justify the civilian casualties a majority don't even believe the government has war goals. \"the majority (53%) of respondents still think that the government has no clear goals in the war.\"\n\nhttps://web.archive.org/web/20240127054853/https://en-social-sciences.tau.ac.il/peaceindex/archive/2024-01\n\nYou do realize that the Israeli government and population have made it very clear they don't want more Palestinian citizens right?  That was a major sticking point of the 2000 Camp David Accords. Israel rejected a reduced right of return for Palestinians outright. Most Israeli politicians say adding Palestinians to the country as equal citizens would destroy Israel. \n\nIsrael wants to be Democratic, Jewish, and control the Palestinian Territories. It can only pick two. Annexing the territories and their populations makes Israel majority Arab, which means the Jewish nature of the state is lost if they remain democratic. If they refuse to give Palestinians voting rights, they aren't democratic but they keep the Jewish state. Or they can remain Jewish and Democratic and leave the Occupied terrorities. The Israeli state has been stuck in desicion pararalysis over this paradox for over 50 years.\n\nhttps://www.timesofisrael.com/liveblog_entry/global-index-israel-falls-out-of-liberal-democracy-category-for-first-time-in-over-50-years/\n\n\nThe IDF's chief rabbi said that in the interests of maintaining warriors' morale and fighting fitness during armed conflict, it was permitted to \"satisfy the evil inclination by lying with attractive Gentile women against their will\".\n\nhttps://archive.ph/S2Elb", "label": 1}
{"text": "Tal Hanan, 50, a former special forces operative who goes by the pseudonym “Jorge,” was named as the mastermind behind the Israeli operation, which runs a sophisticated software known as Aims that is capable of hacking social media accounts of senior officials and of easily creating networks of up to 30,000 propaganda bots on social media.\n\nHanan’s team, known as “Team Jorge,” says it has meddled in 33 presidential-level elections around the world, with successful results in 27 of them, according to The Guardian, one of the 30 investigating news outlets. The exposé only named one of these elections — the 2015 presidential vote in Nigeria — while saying no elections in the United States are known to have been affected.\n\nThe report said the Israeli initiative was behind fake campaigns — mostly on commercial disputes — in some 20 countries, including Britain, the US, Canada, Germany, Switzerland, Mexico, Senegal, India and the United Arab Emirates. There was no mention of campaigns in Israel itself.\n\nhttps://www.timesofisrael.com/expose-unmasks-israel-led-disinformation-team-that-meddled-in-dozens-of-elections/?origin=serp_auto", "label": 1}
{"text": "Oh i read it and replied accordingly.", "label": 1}
{"text": "\n\n[A](https://forums.opensuse.org/t/opensuse-15-6-tiger-lake-lp-smart-sound-technology-audio-controller-no-output/178311/16) |   a\n---|---\no | [ㅇ](https://youtu.be/QnAhnxmSNFw?feature=shared&t=101)", "label": 1}
{"text": "And they are all very active in r/worldnews", "label": 1}
{"text": "Israeli astroturfers or propagandists are on mod level and West support israel so maybe that's why.", "label": 1}
{"text": "Wonder how many of the \"unpaid\" mods are really just working for foriegn govts. If they weren't before they will definitely be trying to get in now.", "label": 1}
{"text": "A better question: Why doesn't Palestine exist yet?", "label": 1}
{"text": "Damn, sorry i struck a nerve or something. 😂", "label": 1}
{"text": "😂 https://www.cnn.com/2024/08/09/world/video/israel-sde-teiman-alleged-prisoner-abuse-footage-diamond-tsr-digvid", "label": 1}
{"text": "This isn't at all a perfect solution but I find if you go through the subs and preemptively block all the most aggressive ones particularly on world news , your comments don't get  downvoted to oblivion and mobbed with abuse.\n\nBAMO  :)", "label": 1}
{"text": "They’re targeting me too 💀", "label": 1}
{"text": "And a few concerned Irish people finally happy they themselves are called out and how it’s OK they are actively being targeted.  If we wait enough cousins will show up expressing how they are greatful and call for the UN to be disbanded.", "label": 1}
{"text": "Useful idiots.", "label": 1}
{"text": "https://www.youtube.com/shorts/MHQe1HBsUdM", "label": 1}
{"text": "Im copying to you because he deleted his seemingly genuine comment of everyones right to live, and the apartheid regime or something similar \n\nThank you, stuff can coexist, politicians in israel is an absolute clown show(every representative in facets of life) , including arab politicians. in knesset 99 theres between segments, small clips, one politican in a clip said “ now i know why this channel is called 99, because non of you is 100” meaning wonky or goofy.  I assume you mean bibi ben gvir and smotrich, they can be corrupt or selfish politicians but theres also real stuff, decision making, diplomacy, people kept saying bibi wants war but while people died to direct anti tank missles to houses from hizbulloah, for a year till now they call for resolution 1701 and only recently invaded. When you see inside israel just now in a arab town in tira a missle hit a house and a town governor said theres no shelters in tira, same as ashkelon (there’s some) thatsso much unevenness in a society who faces real threat be it whos at fault and what to do about it now.  It all exists and unless it’s straight up nazi, labeling things are complex, it feels yucky writing this because all i want is stuff to go back before all this suffering, our kids die, good brave young adults, going surgically into boobytraps and get called genocide, aid and info warfare. To fight goofy ideology like settling gaza is to want genuine good even at cost of co existing. Gaza living in peace with us would be the biggest middle finger to iran and ideologies who want to simply not see us exist sooner or later. Its real sht. I have no clue how to ammend when i cant even ammend my own life or my family and its nuances. But seeking bloodlibels and barbaric rhetoric is not the answer if you want less suffering.", "label": 1}
{"text": "Tal Hanan, 50, a former special forces operative who goes by the pseudonym “Jorge,” was named as the mastermind behind the Israeli operation, which runs a sophisticated software known as Aims that is capable of hacking social media accounts of senior officials and of easily creating networks of up to 30,000 propaganda bots on social media.\n\nHanan’s team, known as “Team Jorge,” says it has meddled in 33 presidential-level elections around the world, with successful results in 27 of them, according to The Guardian, one of the 30 investigating news outlets. The exposé only named one of these elections — the 2015 presidential vote in Nigeria — while saying no elections in the United States are known to have been affected.\n\nThe report said the Israeli initiative was behind fake campaigns — mostly on commercial disputes — in some 20 countries, including Britain, the US, Canada, Germany, Switzerland, Mexico, Senegal, India and the United Arab Emirates. There was no mention of campaigns in Israel itself.\n\nhttps://www.timesofisrael.com/expose-unmasks-israel-led-disinformation-team-that-meddled-in-dozens-of-elections/?origin=serp_auto", "label": 1}
{"text": "Can Palestine exist?", "label": 1}
{"text": "We own the media!", "label": 1}
{"text": "That subs mods are all complicit in the crimes. They are trying to whitewash genocide to the broader public.", "label": 1}
{"text": "Why are Irish troops in Lebanon? Does Lebanon have potatoes that need protected?", "label": 1}
{"text": "DCI reported several abuses of children by Israeli forces, including the rape of a 13 year old boy, and shortly later, Israel invoked a law designating them and five other NGOs as terror groups, raided their offices in the middle of the night, stole all of their computers.  But they never returned the confiscated items, never presented any evidence, and never arrested any of the supposed \"terrorists\" who worked at the terror organizations.\n\nFrom DCI itself:\n\nhttps://defenceforchildren.org/israeli-forces-raid-and-seal-shut-dcip-and-5-other-civil-society-organisations-offices-leaving-an-official-notice-declaring-the-organisations-unlawful/\n\nThe UN statement:\nhttps://www.ohchr.org/en/press-releases/2021/08/un-experts-condemn-raid-west-bank-ngo-urge-israel-meaningfully-probe-child\n\nCorroboration by former US State Department official: https://www.npr.org/2023/10/19/1207037984/josh-paul-resign-state-department-military-assistance-israel-gaza\n\nThe Dahiya doctrine and use of collective punishment \n\nhttps://en.m.wikipedia.org/wiki/Dahiya_doctrine\n\nhttps://www.hrw.org/news/2023/02/02/israel-collective-punishment-against-palestinians\n\nA prior head of Mossad (Israel's CIA) appointed by Netanyahu has described the situation as apartheid along with South Africans who have experienced it and all of the major human rights orgs including Israeli ones. \n\nhttps://www.btselem.org/apartheid\n\nhttps://www.amnestyusa.org/press-releases/israel-must-end-its-occupation-of-palestine-to-stop-fueling-apartheid-and-systematic-human-rights-violations/\n\nhttps://apnews.com/article/israel-apartheid-palestinians-occupation-c8137c9e7f33c2cba7b0b5ac7fa8d115\n\nThey have been trying to starve them for decades now. \n\nhttps://www.bbc.com/news/world-middle-east-19975211\n\nhttps://news.un.org/en/story/2024/03/1147656\n\nHere is a list of unequal laws in Israel\n\nhttps://www.adalah.org/en/law/index\n\nAnd the fact that they made it so only jews have a right to self determination\n\nhttps://www.timesofisrael.com/final-text-of-jewish-nation-state-bill-set-to-become-law/ \n\nNot all of the unequal laws only hurt Palestinians. That's the thing about racism it hurts everyone including the Israeli who are forced to serve in a genocidal war and ordered to conduct collective punishment on civilians.\n\nhttps://www.breakingthesilence.org.il/\n\nhttps://www.hrw.org/news/2023/02/02/israel-collective-punishment-against-palestinians\n\n\"Unlike the beginning of the war, now about half of the Jewish public (51% compared to 37% in November) believes that the IDF uses firepower appropriately against Gaza, compared to 43% (58% in November) who believe that there is use of TOO LITTLE FIREPOWER. An absolute majority (88%) also justifies the scope of casualties on the Palestinian side when considering the goals of the war.\"\n\n43% think they haven't got far enough and 51% thinks they have gone the correct amount which means, ONLY 6% are undecided or think they have gone too far.  And while 88% think the war goals justify the civilian casualties a majority don't even believe the government has war goals. \"the majority (53%) of respondents still think that the government has no clear goals in the war.\"\n\nhttps://web.archive.org/web/20240127054853/https://en-social-sciences.tau.ac.il/peaceindex/archive/2024-01\n\nYou do realize that the Israeli government and population have made it very clear they don't want more Palestinian citizens right?  That was a major sticking point of the 2000 Camp David Accords. Israel rejected a reduced right of return for Palestinians outright. Most Israeli politicians say adding Palestinians to the country as equal citizens would destroy Israel. \n\nIsrael wants to be Democratic, Jewish, and control the Palestinian Territories. It can only pick two. Annexing the territories and their populations makes Israel majority Arab, which means the Jewish nature of the state is lost if they remain democratic. If they refuse to give Palestinians voting rights, they aren't democratic but they keep the Jewish state. Or they can remain Jewish and Democratic and leave the Occupied terrorities. The Israeli state has been stuck in desicion pararalysis over this paradox for over 50 years.\n\nhttps://www.timesofisrael.com/liveblog_entry/global-index-israel-falls-out-of-liberal-democracy-category-for-first-time-in-over-50-years/\n\n\nThe IDF's chief rabbi said that in the interests of maintaining warriors' morale and fighting fitness during armed conflict, it was permitted to \"satisfy the evil inclination by lying with attractive Gentile women against their will\".\n\nhttps://archive.ph/S2Elb", "label": 1}
{"text": "Only an evil psychopath could see how 80% of Gaza has been demolished, 2 million people have been displaced, and then act like everything is fine. You’re a disgusting piece of filth and in many ways, the blood of those children is in your hands. ", "label": 1}
{"text": "New users are not allowed to comment?", "label": 1}
{"text": "Buddy, the pro-Nazis are also pro-Israel.  That's how fucked up thing have gotten in Israel that the far right of Europe and the US support Israel. So spare us the antisemitism card this time.", "label": 1}
{"text": "r/Israel sub growth is minimal, while r/Palestine doubled since October 7, 2023.", "label": 1}
{"text": "Do you denounce Nat Turner's slave rebellion which targeted civilians?", "label": 1}
{"text": "First thing I looked up; Huge surprise. \n\nPeople's United destroyed this country.", "label": 1}
{"text": "For me, it was when 10 got forced upon the masses.  I was unable to fix the security issues, and maintain positive control, so I ended up using mint instead.  It is surprisingly much easier to use than linux has been in the past.   I still find myself spending hours trying to do a few mundane tasks through google-fu.", "label": 1}
{"text": "Go on worldnews and it’s basically Israeli and Ukrainian bots and shills, never seen a more deluded sub. The whole website in general has gone to shit though.", "label": 1}
{"text": "I wouldn’t say pro genocide in general, just shamelessly pro for one particular genocide being perpetrated by one particular country.", "label": 1}
{"text": "I got instabanned without context when I brought up that oct 7th happened because Israels harrassment of the Palestinians.\n\nAfter trying to repeal they lied and said the comment didnt exist anymote and they cant do anything about it. I sent them a link to the still existing comment and they ignored me.", "label": 1}
{"text": "Toxic genocide supporters", "label": 1}
{"text": "Yes, when users get targeted by shill mods for having an opinion thats different to theirs, they'll likely move to a space where they can talk freely.\n\n\nIt only shows how bad the censorship is for anyone that's Pro-Palestine. ", "label": 1}
{"text": "They actually are, sorry. They are part of a \"western styled democracy\" as they so proudly claim and as such, the Israeli society they are a part of has chosen to subjugate the Palestinian people by voting for parties that have the continued subjugation of the Palestinian people as a party platform (and worse)", "label": 1}
{"text": "It happened after Ireland sent their condolences to Germany after Hitler’s death.", "label": 1}
{"text": "They’ve become a paranoid, isolated and erratic ethnostate. The Israeli government is in no position to decide what’s reasonable. They see every person on earth who doesn’t bow down to them as a threat", "label": 1}
{"text": "That really should be a bannable offense it is supporting terrorisim that goes against these companies stated goals and standards.", "label": 1}
{"text": "I wholeheartedly agree", "label": 1}
{"text": "i got banned for messaging the mods saying I was concerned about the state of the sub-banning people. The reason: “trolling”", "label": 1}
{"text": "Ahh, I see. Failing crypto start up?", "label": 1}
{"text": "Meanwhile o1 is top 500 in the AIME math competition. It's quite obvious that LLMs don't think and function like humans. The only thing that counts is the outcome.", "label": 1}
{"text": "They tested o1-preview on the GSM8K symbolic but didn’t include the results in the main paper, only in the appendix. Those results seem to show the result variance for o1 -preview from the GSM8k and the symbolic variants are all within the margin of error. Am I missing something or does this directly go against their statement “adding seemly relevant clauses to the question that do not impact the reasoning process required to solve it significantly drops the performance of all models”\n\nAdditionally, I would agree with other critics that it’s difficult to conclude much from these results without a human baseline.", "label": 1}
{"text": "Looking at the results at page 9 and 20 o1 performs MUCH better here than the other models. One thing they did rather deceptively is that the x axis for every models is different. o1 mini only drops from 93-98% accuracy to 80-95% accuracy, and o1 preview seems to not degrade at all. Honestly the conclusion should be the o1 IS a huge step forward in actual reasoning.", "label": 1}
{"text": "It’s been on reddit since October 7th. Say something negative towards Israel and watch. Absolutely atrocious", "label": 1}
{"text": "White phosphorus isn’t banned. It’s banned to use on people but it is allowed for lighting up areas at night and as a smoke screen", "label": 1}
{"text": "No matter how nutty they got, Hamas still never gave them all their hostages back. It would stop then. At least in Gaza.\nWith Hezbollah, they’d have to stop sending missiles and attack drones, etc to kill civilians in Israel. Then it would stop. \nWhy not ask them to stop? Really nicely. Bet that would work.", "label": 1}
{"text": "r/worldnews is just one big IDF bot orgy these days. \n\nThere will be a post for an article titled \"IDF soldiers disembowel puppy\" and the top comment will be \"Dog was probably a terrorist, thank god for the IDF!\"", "label": 1}
{"text": "Oh ffs! You guys are hilarious! Billions trash Israel everywhere everyday, and it’s still not enough for you guys? \nNo one is asking Hamas to give back the ppl they stole from Israel, are they? There’s a 4 year old and a 10 month old (though chances are Hamas and their friends already killed them) ) , and their dad, still  being held captive in Gaza. \nBut that’s ok , right? No one’s even talking about the 100 plus hostages. Like the 20 or more young women, Hamas was bragging about “being able to be impregnated” still in captivity.", "label": 1}
{"text": "Pointing out that neither party is 100% the good guys isn’t supporting terrorism but blindly supporting Netanyahu certainly is.", "label": 1}
{"text": "I guess that is a good excuse to bury children in rubble and blow them up, huh?", "label": 1}
{"text": "Mine’s not! And I can also confirm that the Irish UN troops in Lebanon are at best absolutely useless or  forbidden from doing their job, and at worst actually aiding and abetting terrorists. Unless we somehow think they failed to notice the Hezbollah tunnels being dug next to their compounds? They’re a disgrace to Ireland really", "label": 1}
{"text": "Im canadian, dumbass. More inferencing based off reddit information… thats surely verifiable!!", "label": 1}
{"text": "Is there another country that has tried this?", "label": 1}
{"text": "Maybe there should be more Facebook groups for positive things like rabbits and cute recipes.  Nowadays everyone is so woke they don’t even  cook at home or have alternative pets I guess 🙄", "label": 1}
{"text": "It seems you're obsessed with Trump. Is the sex good when you masturbate to him?", "label": 1}
{"text": ">anyone with an IQ above 50\n\nThat’s not the maga base so not a problem", "label": 1}
{"text": "\"Ohhhhh Trump yes! Thank you for fixing the economy. Yes! I won't tell my friends I voted for you! Yeah just like that, KAMALAS A FUKING IDIOT OHHHHHHHHHHHH!!!!!!!\"", "label": 1}
{"text": "What did he say to offend you so much", "label": 1}
{"text": "\"That's right daddy Trump. I post about you all day every day then call other people unhinged. I can't stop thinking about you. Inflation has far outpaced wage growth under the dumb fucks in office right now and that's not even including housing and groceries. Keep doing that to me, you're all I think about ohhhhhhhhhhhh!!!!!!!\"", "label": 1}
{"text": "He's a gay dude trying to make it up by pretending to be Christian.  Flick that dweeb.", "label": 1}
{"text": "I work at a semiconductor fab in the US, ITAR restricted chips have been keeping us alive for the past year.", "label": 1}
{"text": "Forget it bro, you won't be able to have a rational calm discussion here on reddit. Left leaning people don't believe in bad IQ scores for minorities. It's a big no no for them. ", "label": 1}
{"text": "smh", "label": 1}
{"text": ">>imagine having to manually update your OS at all  \n\n>Imagine being forced to update to something you don't want\n\nthen imagine having to consult with the Grandmasters of the Sacred Codex to roll back said update instead of just, like, two clicks in Windows Update LOL", "label": 1}
{"text": "Act was good", "label": 1}
{"text": "Whoa, this post sounds wild! 😳 It makes you think about how AI can really mess with privacy, especially in schools. Like, just imagine the chaos if someone gets a hold of fake nudes and spreads them around. That's gotta be a nightmare for all those involved.\n\nOn a lighter note, I recently tried M​i​​ah AI and I have to say it’s super cool! The voice and photo features really made the conversations feel alive, almost like texting a friend. It’s wild how real it feels—definitely way more engaging than those generic chatbots.\n\nHas anyone else had experiences with AI that either blew your mind or totally freaked you out? I'm curious to hear more thoughts!", "label": 1}
{"text": "Whoa, this post definitely catches your attention! It’s wild how technology can be used for some really shady stuff, like fake nudes. It feels like every time there’s a big advancement, it’s not long before it gets twisted into something for adult use. Remember when deepfakes first started popping up? That was a total game changer, but also pretty scary for privacy and consent.\n\nI had a buddy who got caught in a similar situation where some fake photos of him ended up floating around school, and it caused a ton of chaos before the truth finally came out. It's crazy how fast rumors can spread, especially with social media involved.\n\nAlso, if you're into exploring the boundaries of what AI can do, I’d recommend checking out Mu​​qh AI. It’s one of those platforms that really embraces the uncensored side of AI companionship, letting users connect in various ways, whether through chats, photos, or even videos. It's fascinating how tech is evolving and how we interact with each other.\n\nWhat do you all think? Have you heard similar stories or had experiences with AI going too far? Let's chat about it!", "label": 1}
{"text": "I know about many TP-Link routers which didn’t get updates since years and years ago. Not surprised", "label": 1}
{"text": "From the article, there's no specific indication TPlink devices were compromised by design or in the supply chain, they're just \"concerned\" because they had a bunch of vulnerabilities like every other manufacturer.\n\nThat said, they're calling for an investigation and I'm fine with that. If they don't find anything, that's great. If they do, I want to know. But until there's some actual evidence, I wouldn't castigate TPlink just yet.", "label": 1}
{"text": "Copilot only \"mines\" user data of whatever one enters into it, it no longer has any system integrations.\n\nAlthough for what it is worth, from what I'm seeing the reception of Apple Intelligence is just as lukewarm as Copilot's in the real world.", "label": 1}
{"text": "Ha", "label": 1}
{"text": "Why do Republicans hate chips? Did they have a bad experience at a snack bar? 😂", "label": 1}
{"text": "Samsung is an absolutely HORRIBLE company. Will never purchase another one of their products until the day I die. 🔥 💣 ☢️ 👺", "label": 1}
{"text": "So about those copilot pcs", "label": 1}
{"text": "> A US-Japanese trade mission where SSC funding was supposed to be discussed ended in the [George H. W. Bush vomiting incident](https://en.wikipedia.org/wiki/George_H._W._Bush_vomiting_incident).\n\nLOL that's unfortunate. Also now I get where the [Hot Shots scene](https://www.youtube.com/watch?v=-nHkJ6ycnDg) came from.", "label": 1}
{"text": "Do you have a hard time understanding 'Go away'?", "label": 1}
{"text": "Waana go there? I will make you look like a COMPLETE a\\*s in about eight words or less. 💪", "label": 1}
{"text": "I copy with ctrl-c then paste with ctrl-v……nuthin’.  The context menu doesn’t even list the shortcuts. Small issue, but annoying. Windows has places where you would expect those shortcuts and they aren’t there, either, so it could possibly be a Windows thing. Both 10 and 11 have the issue.", "label": 1}
{"text": "\"Report\" → \"Spam\" → \"Excessive posting or commenting in a community\"\n\n👋", "label": 1}
{"text": "this could be a game changer. excited to see how it performs", "label": 1}
{"text": "\\>\"Buy this thing because I'm telling you that you need it even though you didn't know it. It will do great things for you. I swear. Send $250M here.\"", "label": 1}
{"text": "It's an advertisement for vaporware. But look, it has 3000 updoots so let's watch it. . . fuckin' Toyota. Why do they have to suck like this?", "label": 1}
{"text": "It might not be perfect, but considering that most governments are way behind the times in regulating tech, this is pretty good and pretty fast in the scheme of things.", "label": 1}
{"text": "Now if we can just get strict rules for political campaigns and super PACs. Can’t wait until my friend posts a deep fake video of Hunter talking about the time he killed a hooker with his dad.\n\nOr worse, Trump really killing a hooker on tape and then telling people this perfectly clear high definition video of him is a deep fake and his base believes him.", "label": 1}
{"text": "It's incredible to see a century-old mystery finally solved! This shows how much history can be hidden in plain sight and the importance of ongoing research in uncovering our past.", "label": 1}
{"text": "I'm not antisemitic, but I am very much anti-Israel since they are Nazis committing genocide.", "label": 1}
{"text": "If the Trump gameplay is to lie cheat and steal. The democrats might as well fight fire with fire. We've seen how well fighting it with water or ignoring it works...", "label": 1}
{"text": "Good to know. I assumed the democrats were finally fed up with playing by the rules.", "label": 1}
{"text": "The Torah advocates for the genocide and enslavement of all non-jews, so the more serious you take the Torah the less you care about others. When interviewing extremely religious Jews in places like Brooklyn or parts of Israel, they will say they think it is blasphemy for Israel to exist because the Messiah has not come, but that has nothing to do with support for Palestinians. It is just about taking a literal translation of the Torah. When pressed further, most will say that Palestinian or not, all non-jews or \"goyim\" are the same, and all will be slaves of the jews.", "label": 1}
{"text": "From the article:\n\n“To be clear, Trump has not endorsed a pornography ban. And his campaign has repeatedly distanced itself from the conservative blueprint Project 2025, although it was crafted by Trump allies and it does not call for all pornography to be outlawed”\n\nSo… Its kinda true. But it does exaggerate said truth a bit.", "label": 1}
{"text": "What subreddit am I in? Technology or politics?", "label": 1}
{"text": "Porn, rife with sexual exploitation of women, will be wholeheartedly defended by the party that says they are the only choice for women. Interesting.", "label": 1}
{"text": "You seem like a miserable person", "label": 1}
{"text": "If you don’t know, just say so.  No need to be a vag.  ", "label": 1}
{"text": "You sound smart.", "label": 1}
{"text": "Remember when Elon bought Twitter and said he had to let both the right and left get equally criticized?\n\nSo that was a fucking lie.", "label": 1}
{"text": "r/technology", "label": 1}
{"text": "This situation highlights the troubling trend of misinformation in politics. Deceptive tactics undermine genuine discourse and mislead voters about candidates’ true positions", "label": 1}
{"text": "Election season is truly the most insufferable; the real benefactors of this aren’t the American people, but ad-placement and SEO companies.   \n  \nIf you have 20 minutes to burn, go poke around the Google Ads Transparency Center. Alphabet has been raking it in hand-over-fist.", "label": 1}
{"text": "I don’t know how else to say it but most Chinese citizens are spying, at least a little bit, on foreign companies. If you’re a US tech firm you really should be scrutinizing your Chinese visa holders.", "label": 1}
{"text": "Because chinese are selfish nazzies, that see other humans as a mere playdough.   \n  \nWorld arrangement actually is:   \nCivilized world = china, then long nothing and then jungle wasteland to raid, that we call usually call the international zone. They don't respect you, they will easily eavesdrop at you at any of owns whims.   \nYou are all just dogs to them.", "label": 1}
{"text": "I agree 100%, the only way we can continue our global hegemony on technology is by making sure we have a constant supply of highly educated and capable labor force", "label": 1}
{"text": "What clearance level do you carry?", "label": 1}
{"text": "I seriously doubt that OP's speculation on denying visas will happen either.  The US government might *want* to do that, but corporations with ties to China will pressure them not to.", "label": 1}
{"text": "I give up", "label": 1}
{"text": "As we all know… A capitalist will sell you the rope that you will hang him/her with. We can be surprised but not shocked", "label": 1}
{"text": "Yes I'm stupid and what I said is dumb but those who don't comprehend what it is I'm actually saying are even more so.", "label": 1}
{"text": "The Chinese are not a race and notice how I said Russians too?", "label": 1}
{"text": "Keep fighting the demons in your head, crazy boy.", "label": 1}
{"text": "They need to treat all Chinese nationals as foreign agents until they demonstrate otherwise.", "label": 1}
{"text": "Funny how people always overlook that it was the East India company more than any government.\n\nLiterally just a bunch of greedy power hungry capitalist fuckheads.", "label": 1}
{"text": "Here you go again, just switching one goal post to another. Typical communist tactic tsk tsk tsk.\n\nThe only idiot here is you playing semantics. The only idiot here is the illiterate one that is getting their jimmies rustled over something they can't grasp. Why are you so upset over you being unable to read and comprehend basic english...? is this why you ran away from your other comment? \n\nWhat I originally said is very explicit, Chinese and Russian internationals, as in noncitizens, should be kept away from the tech realm and higher education. They are not the same because a foreign national is nowhere near the same as an American citizen in the eyes of any entity. My god you are fucking dense. \n\nThe only channel for naturalization isn't a student visa and there are plenty of other industries you communists can work in. \n\nDude, you need to learn how to read LOL. KEEPING CHINESE AND RUSSIAN INTERNATIONALS AWAY FROM TECH AND HIGHER ED IS NOT THE SAME AS BANNING WORK AND STUDENT VISAS\n\nIf you commies like tech so much, go start your own companies in your own country! Go create your own country with liberal and democratic ideals! You don't have to come here!", "label": 1}
{"text": "Says the idiot calling people idiot they can't understand lmao\n\nHow dense are you to not realize taking you communists also comes with inherent risks to our national security? \n\nThat's awesome man, try loving America more than our adversaries.", "label": 1}
{"text": "I like my 2011 4runner.\n\nIt has bluetooth, but everything else can be set up via tactile controls.  No bullshit touch screens.  And it doesn't spy on me (as much as a modern car, anyway.)", "label": 1}
{"text": "Still better than using win11", "label": 1}
{"text": "Eat the rich!", "label": 1}
{"text": "I definitely believe that seeing how you were crying this whole time. It's not a stupid insult, it's just what you are. Lol keep crying. Most communists like you here can't hold a basic conversation without a tantrum LOL", "label": 1}
{"text": "> The Chinese are not a race\n\nRacists like you use that logic all the time, like “Mexicans aren’t a race” or “Muslims aren’t a race”.\n\n\n> notice how I said Russians too?\n\n“I’m not a racist because I am bigoted toward *multiple* groups” isn’t the best defense, genius.", "label": 1}
{"text": "What an absolute little bitch\n\nI hope he ends up proverbially entangling himself in his own rope", "label": 1}
{"text": "And most of them are supporting a Harris presidency, kind of odd if you think about it", "label": 1}
{"text": "lol douchemobile driver over here", "label": 1}
{"text": "For finding niche, old-as-dirt blogspots on specific topics, it’s good. Anyone who uses it beyond that reaps what they sow.", "label": 1}
{"text": "[here is a more complete list vs your cherry picked numbers](https://punchng.com/list-billionaires-celebrities-endorsing-donald-trump-kamala-harris/?amp)\n\n[and here is another link showing 83 Billionaires support Harris vs Trump getting 52](https://theweek.com/politics/us-election-who-the-billionaires-are-backing)\n\nThe fact of the matter is that Democrats are the party of Billionaires and elite, and republicans have become the party of the union and working man. I know that’s not what you’ve been brainwashed to believe, but that’s the facts jack.", "label": 1}
{"text": "They shouldn’t , but Kamala trying hard to influence that vote with celebs", "label": 1}
{"text": "I use SearXNG. No ads at all. Privacy. I host the search engine, I control it.", "label": 1}
{"text": "I like them for all, especially vent directions.", "label": 1}
{"text": "They have the option to donate a lot of money to the government and live like one of us; but they are a special and they know they are a special. \n\nThey’ll live their 1% democratic elite life and you’ll celebrate it.", "label": 1}
{"text": "I’m tired of us suffering for these pigs. Literally take them out. Holy sh*****t", "label": 1}
{"text": "Replace \"China\" and \"CCP\" with 'america' and USA and it is still 100% accurate", "label": 1}
{"text": "As long as the line goes up in the short term, they don't care.", "label": 1}
{"text": "He was just demonstrating how Kamala got her start in politics", "label": 1}
{"text": "Well, all they need is a bunch of Indian commuters to hang on to the outside of a SpaceX rocket.  $0 spent.", "label": 1}
{"text": "Good time to learn to look before your comment then; that's your learning moment for the day!", "label": 1}
{"text": "Do not eat the rich: K*ll the rich!", "label": 1}
{"text": "She's never going to fuck you.", "label": 1}
{"text": "Sounds like your friend was getting ripped off severely. Just at a glance a 2024 VW/Audi power window motor clocks in at ~$25. Labor includes taking off the door panel. I replaced a car window in my driveway and took apart/reassembled the door in about an hour.\n\nPower windows only have the motor that can go bad. Crank windows have a ton of moving parts that might last longer, but if they break you're totally screwed trying to get it fixed.", "label": 1}
{"text": "I hope to live long enough to see the first billionaire torn to shreds.", "label": 1}
{"text": "OP is manipulating the people. \n\nHey, youre one of those guys that manipulate reddit! Nice to meet you!\n\nhttps://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/", "label": 1}
{"text": "You have school shooter vibes", "label": 1}
{"text": "Kill them all", "label": 1}
{"text": "You keep quoting stuff I never said. Is the only thing you can come up with are Strawman fallacies?\n\n  \nIf you people are so mentally weak crying all the time over what someone else has, you people are going to love when WWIII finally goes hot.\n\n\n\nIts going to be absolutely fun watching the most pampered generation in history lose their shit when they cant even enjoy anything in time of peace.\n\n  \nAnyways, seems like you want to blame everyone but yourself.  \nGood luck with that.", "label": 1}
{"text": "They also all have addresses where they live and sleep.  Just saying.", "label": 1}
{"text": "Eat. The. Rich.", "label": 1}
{"text": "And yet, the Democrat green policies are aimed at the average people, not the wealthy.", "label": 1}
{"text": "I vote we reinstate the guillotine", "label": 1}
{"text": "Lol. The problem isn't me, mate. A bot can't do my job. You should be worried that a bot can do yours.", "label": 1}
{"text": "You mean you heard the truth of the matter and threw a mentally regressive tantrum screaming \"Nu-uh\".  Dude you are fooling nobody, EVERYONE can read every reply you've posted.  \n\nJust another Dunning-Kruger Syndrome sufferer -Embarrassing.", "label": 1}
{"text": "Kill all billionaires then", "label": 1}
{"text": " I don't need to eat intensively produced meat and dairy and nor does anyone else. I didn't decide to put all the small suppliers out of business with predatory pricing and then force people to buy cars so they can visit huge shopping centres and buy rubbish because, in most parts of the world, there's no choice. The choice has been taken away by the greedy bastards.\n\nI live in rural France, and most of my food comes direct from farmers, thanks, particularly the meat. But we're still stuck with a system built around out of town shopping and workplaces that are a long way from the people doing the job. The rich are fighting tooth and nail to prevent change. Stop blaming granny for using a plastic bag.", "label": 1}
{"text": "Mazda never really gave into that trend. There cares were ahead by being behind lol", "label": 1}
{"text": "It’s a good change", "label": 1}
{"text": "Cause people like the platform", "label": 1}
{"text": "And we have bands like Coldplay to remind us how bad we are when they are on their world tour.", "label": 1}
{"text": "Did you miss the bit about ML?", "label": 1}
{"text": "So like Reddit?  A bigger echo chamber?  \"anything I don't like or agree with is a Nazi\"", "label": 1}
{"text": "Actually, you just told on yourself. You're the second kind of person I mentioned. The kind who just doesn't want to be exposed to contradictory opinions. But nevertheless you validated what I said since you clearly fit into one of those two categories I spelled out.\n\nFeel free to tell yourself I'm \"trolling\" and block me too.  Cognitive dissonance is there for a reason. I wouldn't want to break your brain or anything.", "label": 1}
{"text": "It's not billionaires' fault that Karens like to get a feeling of power by telling people off.", "label": 1}
{"text": "Yeah, the point of muting/blocking people is to keep you from seeing their posts, not to keep them from seeing yours. There was never a way to keep them from seeing your public posts, if they really wanted to. This is simply a return to the way blocking has worked since the creation of the internet.", "label": 1}
{"text": "reject modernity, embrace tradition", "label": 1}
{"text": "Kill All Billionaires!", "label": 1}
{"text": "so... your theory is this 15 year old killed themselves because mom and dad bought them a cell phone as toddlers?", "label": 1}
{"text": "Wrong. It’s Algorithms are being twisted so that domestic content in china promotes ideals like education and stem and community engagement and in Europe and the US it’s Furry content and crazy antics that have been documented to lower IQs", "label": 1}
{"text": "what kind of psychological preparation are we talking about here?\n\n\nand whats the plan for kids who go against their parents wishes and download it anyway? ", "label": 1}
{"text": "So the sun gets regular deliveries from Interplanetary Delivery Oil CO.? WELL WHY TF AIN'T WE GEETIN EM.\n\n(You're a shit bird idiot)", "label": 1}
{"text": "Eat the rich, tax them into millionaire status.", "label": 1}
{"text": "And we haven't even started burning them yet", "label": 1}
{"text": "Guillotines are long overdue", "label": 1}
{"text": "Jfc it’s so sad cuz it’s not actually easier to do that. But we still do it anyways.", "label": 1}
{"text": "Wait until you hear about the trades…", "label": 1}
{"text": "Just put the fortune cookie in the bag little bro", "label": 1}
{"text": "Okay buddy, try not to eat my cat", "label": 1}
{"text": "Guillotines. Works every time", "label": 1}
{"text": "Interesting move! I wonder what new features they’ll introduce with this rebranding.", "label": 1}
{"text": "This has AI buzzword so it must be good right?", "label": 1}
{"text": "Why you are to stupid too be entertaining. Your shit talking is as dumb as you are. Boring but expected", "label": 1}
{"text": "Well, the devs don’t seem to think so, mostly they’re doing FQDN subscriptions and later instance hosting and I am not sure how ads would work with custom AppViews, but if you’re sure…", "label": 1}
{"text": "Ginat Consultants has A-Z business solutions for restaurant and FMCG companies. Visit the website for more details: [www.giant-consultants.com](http://www.giant-consultants.com)", "label": 1}
{"text": "It’s NYT’s engineers who are striking, not journalists. \n\nhttps://thehill.com/blogs/blog-briefing-room/news/4970734-nytimes-tech-workers-strike-before-election/", "label": 1}
{"text": "Nationalize them.", "label": 1}
{"text": "It’s only 24%? Chinese people world wide are some of the most racist, misogynistic people I’ve ever encountered. I’d have expected more than just 24%.", "label": 1}
{"text": "So, those engineers actually own their own bodies and NYT isn’t entitled to their labor as if they were slaves. Them choosing not to work to show the value of their labor during a contract negotiation is smart and good.", "label": 1}
{"text": "Ghost accounts inflate numbers everywhere. It’s a serious distortion of online influence.", "label": 1}
{"text": "Great choice! Classic riffing can’t be beat.", "label": 1}
{"text": "Beautiful", "label": 1}
{"text": "It's kind of garbage from the start though, isn't it?  The character limit leads to lowest common denominator discussion and the inability to sort or search means everything's controlled by the invisible hand of the algorithm.\n\nI really wish it hadn't become *the* place for artists to go.  If you want to find something that's more than a week old you just have to hope they put it on a *booru, Pixiv, or DA.  If not, sorry, it's lost media now.", "label": 1}
{"text": "For some add’l context on that, the NYT Guild which covers journalists had a no-strike clause included in their 2023 contract", "label": 1}
{"text": "Yeah and it’s time the Chinese start getting called out more for their draconian ideals on race and sex.", "label": 1}
{"text": "So if i make someone do something illegal, not my responsibility", "label": 1}
{"text": "Its not new but it should be alarming.", "label": 1}
{"text": "you are not an expert . . you seem like poor trash to be HONEST", "label": 1}
{"text": "you helped write it #biopic", "label": 1}
{"text": "You think the man spent 44b to be even more popular? He cares about freedom just like Donny J", "label": 1}
{"text": "All these articles are written by ai bozo", "label": 1}
{"text": "how the fuck is a yaris a 6-figure vehicle????? \n\nJesus, its a yaris. It shouldn't be more than 30K with maximum options.\n\nLet me write out how many figures 30K is. \n3 0 0 0 0.\n\nThat is 5 figures. (Assuming you're talking about the Yaris from the other dude's comment).\n\nEither way - ego too big, drive a car within your wage.", "label": 1}
{"text": "please please please tell me you have a 6-figure salary and bought a yaris. Then that would be enough for me to stop replying.\n\nBut if you seriously bought a yaris for 6 figures....man... I may have just met the biggest idiot on this planet.", "label": 1}
{"text": "Absolutely! Competition could lead to better user experiences all around, attract advertisers looking for a fresh platform.", "label": 1}
{"text": "There is a lot of stuff that gets recycled, but from what I remember reading about:\n\n*Pure organics that can be composted is great recycling. \n\n* Paper gets recycled, but for chemical reasons only a certain amount of recycled paper can be used in new paper. They receive far more used paper than they can use. IIRC, this is also true of aluminum and glass. \n\n* Plastics are the most recycled material, but here’s the thing; just because your plastic bottles got turned into plastic chips that were turned into polyester fleece doesn’t mean that plastic was recycled out of the ecosystem. It just means those microplastics will enter the environment as discarded fleece vests instead of discarded bottles.", "label": 1}
{"text": "lmao \n\n>implying im a white Australian\n\nnice try tho.", "label": 1}
{"text": "This is why social media are so interested in LLM as it helps control the community even further.", "label": 1}
{"text": "Well journalists and artists are not hard to replace, so yeah.", "label": 1}
{"text": "Nope!", "label": 1}
{"text": "Give me a stereo in, a USB port, and a mount.  There we go.", "label": 1}
{"text": "[This user is a Kamala Harris campaign post bot.](https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/)", "label": 1}
{"text": "If anyone deserves a raise it’s the people responsible for the catastrophic failures of a company. Good job Boeing!", "label": 1}
{"text": "[Sir? ](https://imgur.com/a/VNq1HEw)", "label": 1}
{"text": "That's peanuts", "label": 1}
{"text": "Interesting. I actually use youtube over spotify to find new bands. I find their recommendations algo to be vastly superior.", "label": 1}
{"text": "Totally! Movie creators seem to have a unique way of showing how AI can spiral out of control. It’s like their stories are warnings wrapped in entertainment. Although sometimes it might feel a bit overdone, those themes hit close when thinking about real tech advances.", "label": 1}
{"text": "AAA studios are struggling for years to produce a great game and now someone thinks he can take a shortcut by doing halfbaked AI generated content and gamers won't notice...\n\nNetlix should stay doing what hes good at, but lately thats been literally nothing. No redemption for them because of how they handled Witcher and destroyed what could have been a great series.", "label": 1}
{"text": "Agree, most people by now can recognize an AI generated text from a first look and it's offputting in a way.\n\nIf someone attempts to take a game, lets say like Starfield, and fill it with millions of worlds and every world full of AI generated content and quests, people will see through it, it will not have success and it will be offputting in its own way.", "label": 1}
{"text": "There are some in tech that are so used to being abused by employers they don't know how to handle being treated well and work normal hours.  And they're very anti-union.", "label": 1}
{"text": "Biden will ban it in 3… 2… ….\n\nI want my $13k electric car, Biden, wtf!!!!", "label": 1}
{"text": "GOOD FOR MACHINISTS.....", "label": 1}
{"text": "Except for all of the decades of that being objectively not true and the fact that Asian Americans as a population are like...consistently doing at or above average in most metrics that matter? Also that like objectively, policy-wise, much more of that success has been due to dems politicians than not, especially when a lot of said population *legally would not have been able to live here without the Immigration Act of 1965?!* Like it's not just a coincidence that the Asian population in the US exploded starting in the 70s lol.\n\nI'm not going to argue that the Democrats are anywhere near perfect (I have more complaints than nice things to say about the party) but the idea that they're causing this wave is like objectively not true and easily disproven because reporters have been watching this happen and *saying it was happening* in real time for years. The same way they watched gamergate spiral into this weird right wing gaming culture and pinpointed Steve Bannon as a big part of the radicalization effort. If you trace these things back to their origins, it's legit always some monied right wing dweeb using a bunch of people with more rage than sense to do their bidding. And those people don't realize they've been used until the person gets what they want and drops them because they don't actually *care* about their problems. \n\nWhich is straight up exactly what happened with the affirmative action case. Right wingers spent months using asian people to throw jabs at the programs, and then it was struck down and at most ivies the asian enrollment rate either didn't change *or went down* but now their support has evaporated and you don't hear from them anymore. They've been trying to run the same game on Black people too, it just doesn't work because most of us remember how many objectively racist policies Republicans have pushed within our lifetimes and inherently dislike them. None of this is new, it's the same playbook being run over and over again on different groups and people keep falling for it.", "label": 1}
{"text": "Taiwan has gone all In on their chip manufacturing. They have quite literally poured trillions of dollars into this process.  And the idea that we can spend a few billion and start competing with them in 10 years is an absolute joke.", "label": 1}
{"text": "\\> technology sub\n\n\\> look inside\n\n\\> people hate technology", "label": 1}
{"text": "Local 751 member here. \n\nI'm pissed about it.\n\nBoeing used scare tactics and fucking intimidated workers to vote for a contract that still falls far short of what we deserved.\n\nWhatever. \n\nJust know you have thousands of disgruntled workers building your airplanes for less than we deserve.\n\nDon't fly Boeing.\n\nYou may not live to regret it.", "label": 1}
{"text": "Fantastic how?? It took a team of scientists and AMERICAN taxpayer money to use glue??", "label": 1}
{"text": "If it was socialism then the *workers* would own and operate the means of production.", "label": 1}
{"text": "Nationalize them, split them up, then sell them.  And enforce the fucking anti-trust laws we already have to stop them buying each other up again.", "label": 1}
{"text": "We have a lot of very nice anti-trust and anti-monopoly laws.  We don't need new ones, we need to enforce the existing ones.", "label": 1}
{"text": "I dunno. i kinda like the guy.", "label": 1}
{"text": "Thank you for your submission, but due to the high volume of spam coming from self-publishing blog sites, /r/Technology has opted to filter all of those posts pending mod approval. You may [message the moderators](/message/compose?to=/r/technology&subject=Request for post review) to request a review/approval provided you are not the author or are not associated at all with the submission. Thank you for understanding.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technology) if you have any questions or concerns.*", "label": 1}
{"text": "Cool then you're a fuckwit too.", "label": 1}
{"text": "I love Elon.", "label": 1}
{"text": "because he's allowed to without having to explain himself", "label": 1}
{"text": "sad they had to go on drike with how obliterated mairiupol was last year or whatevert", "label": 1}
{"text": "Hilarious the amount of \"Elon is a joke\" comments, yet 4 years ago when he was still a vocal Democrat, he was praised like a god for making EVs and rocket tech.\n\nYou guys' bias is just next level it is hilarious how much you let a political party define your feelings and identity", "label": 1}
{"text": "If you're equally fine with either winning then yes.  Otherwise, you're an idiot.     \nIt's not about whether they're owed your vote.   If A or B is going to win, but you vote C, you have made it more likely that B will win than if you voted for A.   If A is better for you than B, that's a pretty stupid thing to do.", "label": 1}
{"text": "Fuck Elon. What a degenerate weirdo", "label": 1}
{"text": "DE&I has no place in corporate America. It should be merit based", "label": 1}
{"text": "Lmao I found the DE&I here", "label": 1}
{"text": "Found the other DE&I hire", "label": 1}
{"text": "So many DE&I hires here 😂", "label": 1}
{"text": "Spotted the they/them", "label": 1}
{"text": "Not only is it Chromium based, it’s also run by a… well a weird dude.", "label": 1}
{"text": "I saw a Kamala ad making false statements.  So false claims are only wrong when they are successfully done?", "label": 1}
{"text": "Elon and Trump are what Putin would call \"useful idiots,\" because they have big egos that are very easy to stroke. They also happen to be some of the most powerful people in the United States, meaning we are in the danger zone as far as Russian subversion is concerned.\n\nI can only hope someone high up in the military has more than a peanut brain to realize just how dire the situation is.", "label": 1}
{"text": "AC/Heater and audio should ABSOLUTELY be on physical controls. It's like... 3ish knobs.", "label": 1}
{"text": "Is it a crime if it’s true?", "label": 1}
{"text": "The number of people who still fall for the 'Bernie bro' meme is disgusting.  You'd think the Democrats would have learned by now to stop punching left, but I guess they'd rather lose than give people free healthcare.", "label": 1}
{"text": "https://www.npr.org/2024/08/23/g-s1-19232/kamala-harris-israel-gaza-dnc\n\nThe standard Democratic line.\n\nSo the texts aren't actually 'inaccurate,' as such, just phrased to be inflammatory and make it look like she's been flip-flopping...which she hasn't as far as I'm aware.", "label": 1}
{"text": "The messages are effectively stating Harris' position in an inflammatory way to make it look like she's flip-flopping.  The content is factually correct.  She supports Israel and basically tows the standard Democratic line.", "label": 1}
{"text": "Yes haw 💯", "label": 1}
{"text": "They do, I went Samsung this time around and it's 90% as good as Pixels. Probably going back to Pixel next time tbh, for that sweet sweet extra 10% and call screening", "label": 1}
{"text": "You sure? No-ID laws…", "label": 1}
{"text": "Which is what they've been trying for since the 2010s at least.  AMP, the chrome monopoly, their legal maneuverings...ugh.", "label": 1}
{"text": "I've been involved in the campaign in Pennsylvania. Turnout for her is going to be unlike anything we've seen. I was reporting at Trump rallies too and the energy was totally gone. Harris is to Trump this election what he was to Hillary in 2016. I'm calling it 302 or 313 for her or I'll eat my hat.", "label": 1}
{"text": "I’ve seen so many libs this week use “dipshit” as their go to offense. The flock follows one another. Weakest insult haha", "label": 1}
{"text": "If I post a picture of a Green box on X and call it Red, that is a lie. \n\nSo, it should be removed? Or is it free speech because that’s what I believe?", "label": 1}
{"text": "MASSIVE diaper wearer here. Comfy as fuck!", "label": 1}
{"text": "All of the articles make this sound like it’s focused on the United States.", "label": 1}
{"text": "One question for you. Is the Democratic Party guilty of spreading misinformation?", "label": 1}
{"text": "Likewise. Good use of your freedom of speech! I’m not offended, don’t worry.", "label": 1}
{"text": "Since she’s not a legitimate candidate. Binden was nominated. This whole election is a waste of time and Trump now rules this country.", "label": 1}
{"text": "Indeed. And people complain about the extension limitations for things like adblockers but I’ve had zero issues with adguard for safari. When I do the same Adblock tests and my usual browsing it blocks 100% just like ublock origin. I never see any ads and I can load in my own user filters etc. sure it lacks some of the power user features ublock origin has but tbh I never used those so it doesn’t matter to me. What matters is the blocking and that works fine in safari. Sure some people may need the ublock origin power features and so Safari won’t be a good option for them but I would say the majority could use safari with adguard no issue tbh.", "label": 1}
{"text": "lol if Trump wins X will give it to ya 🤣 ", "label": 1}
{"text": "progressives/liberals being straight prejudice towards people they don’t even know. Your lives must really suck to hate so many people you don’t know. \n\nLet me guess your poor, white, nerds with no friends. Guessing you talk far to much about your feeling, trauma, safe space, while simultaneously accomplishing nothing in life because all you do is complain on the internet 😂", "label": 1}
{"text": "i've never seen anything like that before. Anything you want to tell us about your searching algorithm?", "label": 1}
{"text": "It's very addictive. Took me a few days.", "label": 1}
{"text": "Why is it that only Harris voters feel the need to make posts on Reddit (historically far-left politically and not a single aspect of a representation of the entire country) about who they voted for?\n\nYou got 3.9 likes, the vast majority of them being recycled likes from other Pro-Harris posts, so make sure you adjust your hypothetical count accordingly.\n\nWe shall see what occurs when the counts complete. Don't get giddy yet ;)", "label": 1}
{"text": "I mean Reddit is far left and that’s far right.", "label": 1}
{"text": "This kind of thinking is one of the main reasons why the election is so close. \n\nIf you demonizing anyone who doesn't agree with you or has different views you make yourself seem unhinged and extreme and push moderates and independents the other way. \n\nThe election shouldn't even be close but here we are.\n\nMuch of Reddit itself is an extremist echo chamber and totally detached from what the majority of real people think and feel.\n\nYOU are the problem.\nIF Trump wins, YOU are part of the reason why.", "label": 1}
{"text": "These biased opinion pieces are why the MSM has lost half of the country and why the stuff they write no longer matters.", "label": 1}
{"text": "You forgot the /s", "label": 1}
{"text": "What about the neoliberals, same difference", "label": 1}
{"text": "No it is not lol. All kinds of people exist there and it’s far more free than Reddit.", "label": 1}
{"text": "Unfortunately, it's not surprising.", "label": 1}
{"text": "Funny because every piece of blatant MSN/Regime propaganda gets trashed by based Latinos.", "label": 1}
{"text": "Neener neener ass post", "label": 1}
{"text": "The cope has never been stronger", "label": 1}
{"text": "But, IMAGINE IF THEY HAD A SOCIAL MEDIA ACCOUNT!!!! Moron.", "label": 1}
{"text": "You're not allowed to wrongthink. t. Redditors", "label": 1}
{"text": "The Atlantic is fucking trash.", "label": 1}
{"text": "Reddit is a fascist site bans all non echo chamber voices that aren't communist", "label": 1}
{"text": "It's socialist not communist, dipshit. Get your insults right.", "label": 1}
{"text": "And this is why nobody take the Atlantic seriously", "label": 1}
{"text": "The Atlantic has no credibility.", "label": 1}
{"text": "The left: “everything not pro left is white supremacy”", "label": 1}
{"text": "There's a bot network doing the same for Harris. It's called Reddit.", "label": 1}
{"text": "Are they actual white supremacists or is it like Reddit where if someone says white people have the right to exist and have their place on this planet like everyone else, they say “oh they must hate other races” and ban them. 🙄", "label": 1}
{"text": "The Atlantic is upset that people can say what they want, and they can do nothing about it. They’re fundamentally upset over the constitution of the United States. This type of bullshit has no place in journalism and or politics. It’s really a dark stain on the country. I have no problem saying this on a censored democrat controlled site.", "label": 1}
{"text": "Wait...does mean if we load X with lots of CSAM that moderation will have to happen?", "label": 1}
{"text": "😂😂😂😂😂\n\n\nFree speech is not white supremacist. \n\nFree speech is for everyone. \n\nOnly Democrats demand controlled speech.", "label": 1}
{"text": "The Atlantic: \n\n*”We, Omnicorp, can’t feed you the right Information™️ to manufacture your consent on X, therefore we will use our other media outlets to imply that X is a hotbed of racism, in order to manufacture public opinion in such a way that allows us to either drive it into bankruptcy or have it outright censored”*", "label": 1}
{"text": "I mean, by that logic then reddit or Tumblr are tankie sites.\n\nAlso, X still has plenty of far left leaning content, it's just no longer propagated to the front of the website anymore and all that has happened is right leaning views have finally been given a fair share of airtime. Anyone that only cares about it *now* when one side is suddenly treated *fairly* is probably a tosser.", "label": 1}
{"text": "\"everyone I don't agree with is a white supremacist\". Grow up.", "label": 1}
{"text": "The Atlantic is a cr@p liberal rag", "label": 1}
{"text": "Rare to find someone with a brain on reddit these days.", "label": 1}
{"text": "Words have no meaning anymore.  This title is looking to gain the most eyeballs.", "label": 1}
{"text": "lmfao cry more", "label": 1}
{"text": "Oh are the early numbers getting people scared? See all the young male college students turning up and voting for the 'wrong' party. Joe Rogan did wonders for this demographic", "label": 1}
{"text": "That's really rich that a publication that endorsed a candidate whose party is actively perpetrating a genocide and has pledged to continue that genocide once in office has the audacity to call anybody else a \"Nazi.\"\n\nThe thing that supposedly made the Nazis so horrible was the whole genocide thing, right? But when the US does it (via Israel), we just look the other way?", "label": 1}
{"text": "I wonder what they would call Reddit", "label": 1}
{"text": "There’s literally race bait accounts all over X, wouldn’t really say that it’s solely a white supremacist site lol.", "label": 1}
{"text": "Get wrecked liberal Reddit hive mind!!!", "label": 1}
{"text": "Oh please.  Just because its not a liberal stronghold any longer doesn't make it a white supremicist site.  \n\nLast I checked anyone could sign up for it and they don't actively monitor every post.", "label": 1}
{"text": "Still pushing this same tired ass white supremecist rhetoric? Really? You all need to cling onto something new.", "label": 1}
{"text": "> If you demonizing anyone who doesn't agree with you or has different views you make yourself seem unhinged and extreme and push moderates and independents the other way. \n\n110%. Liberals are insufferable.", "label": 1}
{"text": "Jahahahahahah cope Reddit… cope!!! This is trumps America now!!!", "label": 1}
{"text": "😂 you fucking people…what a joke", "label": 1}
{"text": "Do you guys actually believe this? My god you idiots are insufferable", "label": 1}
{"text": "They’re just mad that X finally allowed free speech and they’re gonna lose the election due to not being able to censor everyone", "label": 1}
{"text": "So I’m a white supremacist because I vote for Trump and use X? I’ve never considered myself racist and have lots of friends of all races and genders. In general I love all people.", "label": 1}
{"text": "if the left calls everyone a white supremacist then no one is a white supremacist.", "label": 1}
{"text": "god shut up loser", "label": 1}
{"text": "Only one major social platform has community notes. Only one of them is open source.", "label": 1}
{"text": "Many South Africans at my work.  Without fail, all racist as fuck....  If the stereotype fits...", "label": 1}
{"text": "The Atlantic is agitprop for very gullible people and has been for a long time. They have no room to talk and are not an authority", "label": 1}
{"text": "The Atlantic is nothing more than a propaganda outlet….", "label": 1}
{"text": "The Atlantic is a notoriously racist rag.", "label": 1}
{"text": "This may come as a surprise to many. But years ago, reddit was actually a decent place to get news. Stay in touch. \n\nNow.  You have to pretend Twitter is a white supremacy website to fit in on reddit. \n\nAnything bot considered far left is considered Hitler and nazis. \n\nIt's insane how shameless the propaganda is now. It's honestly insulting how blatant and outrageous it is too.    Just crazy stuff", "label": 1}
{"text": "The Atlantic is literally trash. So embarrassing", "label": 1}
{"text": "How did you check?  You have an X account?\n\nFound the white supremacist.", "label": 1}
{"text": "cool story bro 👍\n\nno one outside Reddit cares", "label": 1}
{"text": "Lmao, The Atlantic is such awful \"journalism\".", "label": 1}
{"text": "The Atlantic is a silly magazine", "label": 1}
{"text": "So buying it from a far left owner and allowing more speech on there makes it a white supremacist site? God, democrats are so weird and low IQ.", "label": 1}
{"text": "How does it feel woke people sjw sick minded people", "label": 1}
{"text": "so then what is reddit?", "label": 1}
{"text": "👏👏whats wrong with that ?", "label": 1}
{"text": "it’s how blocking should’ve always worked", "label": 1}
{"text": "Can't wait till Trump wins and there's no longer a pressing need to spam all these subs that aren't about politics with astroturfed politics.", "label": 1}
{"text": "The Atlantic is pure propaganda", "label": 1}
{"text": "Give it a rest", "label": 1}
{"text": "The Atlantic is a shit rag", "label": 1}
{"text": "And reddit is a communist wasteland, what else is new", "label": 1}
{"text": "right.  super white supremacists.  all of my sports content (centered around mostly black athletes btw) really shows how much of a wHiTe SuPrEmAcIsT website it really is.", "label": 1}
{"text": "Oh look people calling for stricter media control and celebrating it.\n\nCant wait until all I can consume is black mirror esque government approved media. ", "label": 1}
{"text": "tldr; mainstream media big mad that it can no-longer manipulate the Twitter/X algorithm for political gain.", "label": 1}
{"text": "This has so much to do with technology. I love reddit!", "label": 1}
{"text": "Throwing a horrible word like that out there all willy nilly really discounts the meaning of it", "label": 1}
{"text": "Or you could just not use X", "label": 1}
{"text": "CNN/REUTERS FACT CHECK: this article is gay as fuck!!!", "label": 1}
{"text": "Delusional woke 🐑 and what was it before the aquisitin? Oh that’s right, a liberal echo chamber silencing and canceling just like Reddit 🤡", "label": 1}
{"text": "And now the left is villainizing and dehumanizing lol", "label": 1}
{"text": "LETS FUCKING GO", "label": 1}
{"text": "Dear Atlantic, Pssst, it isn't 2016 anymore.  Not nearly as many people take your unhinged Leftist ramblings and ridiculously biased articles seriously anymore.", "label": 1}
{"text": "Ahahah that’s all they can come up with??? 😂😂😂 X is uncensored and it just bugs the shit out of them all. Trump 2024!!!", "label": 1}
{"text": "Laughably false", "label": 1}
{"text": "Trump has been called Hitler, practically non stop, since 2016.\n\nYou really think this article coming out is going to change things? \n\nThe boy who cried wolf, read it, you might learn something from that.", "label": 1}
{"text": "Reddit is a socialist site", "label": 1}
{"text": "Free speech", "label": 1}
{"text": "oh yeah, they are Atlantic is a reliable source /s", "label": 1}
{"text": "The level of stupidity I've seen in the last couple hours as panic sets in is unfathomable.", "label": 1}
{"text": "Free speech includes speech most people don’t like or disagree with", "label": 1}
{"text": "The Atlantic, no bias here.", "label": 1}
{"text": "the kool aid is strong here..lmao and smh", "label": 1}
{"text": "Reddit is 100% anti-free speech. Wouldn’t be surprised if I get banned for this comment", "label": 1}
{"text": "The Atlantic is clearly a radical left wing fake news website focused on disinformation", "label": 1}
{"text": "But when someone calls out how absurd it sounds to cut off your genitals and scream at others for misgendering them, they should shut up and keep their bigoted and sexist opinions to themselves, right? I’m not saying that’s something you’d do but there are reasons why people are hesitant to “be heard”", "label": 1}
{"text": "Statements/articles like this is why democrats lose elections", "label": 1}
{"text": "Fuck off. Any time the left doesn’t agree with the right, they label them white supremacist. And isn’t the owner photographed with gislane Maxwell.", "label": 1}
{"text": "Reddit is a liberal white supremacist site", "label": 1}
{"text": "Reddit is a liberal supremacist site. That lost the election 🤣🤣", "label": 1}
{"text": "get fucked, you twats.  hahahahahaha", "label": 1}
{"text": "lol well the Atlantic is state sponsored propaganda", "label": 1}
{"text": "Cope and seethe losers.\n\nReddit lost Dems the election.", "label": 1}
{"text": "Reddit is a globalist communist site", "label": 1}
{"text": "Looks like a lot of bots must have voted tonight you pleb! Cry me a river.", "label": 1}
{"text": "U mad bruh hahahha", "label": 1}
{"text": "And Reddit is infected by the woke mind virus.", "label": 1}
{"text": "X is great like America is about to be again", "label": 1}
{"text": "Surely DNC funded propaganda would never exaggerate to make a platform run by one of Trump's allies look bad, right?", "label": 1}
{"text": "Not everything is White Supremacy, and doubling down on this is getting the rest of us four more years of Trump.", "label": 1}
{"text": "And Reddit is a leftist cesspit.", "label": 1}
{"text": "bitch and cry more", "label": 1}
{"text": "Trump won lmao", "label": 1}
{"text": "And Reddit is a leftist site, given how the popular page is just full of this bs", "label": 1}
{"text": "Can the left stop with their alarmist and extremist rhetoric ? Ffs", "label": 1}
{"text": "Laurene Powell Jobs, through her organisation Emerson Collective acquired a majority stake in The Atlantic in 2017,￼ and has been a significant contributor to Democratic campaigns and causes. For instance, during the 2016 election cycle, she donated approximately $2.7 million to Democratic-aligned groups and candidates. ￼", "label": 1}
{"text": "Already getting sour are we Reddit ? Bahahahah", "label": 1}
{"text": "Nonsense propaganda.", "label": 1}
{"text": "And reddit what it is?", "label": 1}
{"text": "Lol, what? Is Trump ahead, and is this one last attempt at fear mongering from the sub? Lmao.", "label": 1}
{"text": "Reddit is afraid of freedom. That's why we have Trump again.", "label": 1}
{"text": "Lmao the dumb shit you see on Reddit", "label": 1}
{"text": "Yawn. Get new material Reddit.", "label": 1}
{"text": "It’s so pathetic lmao this site used to be good.", "label": 1}
{"text": "Keep blaming white people for your problems democrats and the media, absolute morons. See how well that worked out for you.", "label": 1}
{"text": "Lmao the seething has started.  You lost Reddit! It’s over!", "label": 1}
{"text": "You guys need to get some new material ", "label": 1}
{"text": "No. It’s just not an echo chamber like Reddit", "label": 1}
{"text": "Everything we don’t like is nazi", "label": 1}
{"text": "saying a trump thing is a nazi thing is so played out i don't think any real people even fall for it any more.", "label": 1}
{"text": "Omg this is getting old", "label": 1}
{"text": "Is there proof of this white supremacy? Please provide all sources.", "label": 1}
{"text": "The Atlantic is liberal propaganda.", "label": 1}
{"text": "Reddit is a black supremacist site", "label": 1}
{"text": "Hispanics and blacks are voting for Trump more than ever before ", "label": 1}
{"text": "If Dump wins I hope everyone who aided it realizes their children and grandchildren will grow old as slaves! Too bad for all of us!🤡🔫", "label": 1}
{"text": "This is true.  We aren’t a white supremacist nation.  But we have a large percentage of people who don’t think critically and buy the tagline of, “are you better off than you were four years ago?”\n\nThe assumption that Trump being elected in 2020 would have prevented inflation is questionable at best.  If he wins again tonight/tomorrow, only time will tell.  He may have pulled off his most impressive con yet.  🤔", "label": 1}
{"text": "This is the kind of headline that lost us this election.", "label": 1}
{"text": "Awwww because they don’t agree with you what a buncha clowns this is exactly why people hate the left and why the left failed miserably tonight buncha crybabies", "label": 1}
{"text": "A bunch of subreddits mods are showing their ass tonight too", "label": 1}
{"text": "Notice all the reddit bots are gone. Those did not help.", "label": 1}
{"text": "Jesus. Shitty hit pieces like this are why trump won the election. People are fatigued from all the bs virtue signaling name Calling. Well done on giving trump the W thoigh", "label": 1}
{"text": "X is the only website that isn't censored to hell. The platform of true free speech", "label": 1}
{"text": "the most idiotic article i've ever read", "label": 1}
{"text": "This sort of stupid commentary is whyteump was reelected. You did it to yourselves", "label": 1}
{"text": "propaganda machine", "label": 1}
{"text": "Could've used a little more Jedi training for that effect.", "label": 1}
{"text": "Impressive tech, but it felt more like a gimmick than serious journalism.", "label": 1}
{"text": "This sub is so trash now", "label": 1}
{"text": "There are countless subs that ban you for posting in other subs, regardless of the comment or so called \"rules\". Stop playing around and think that the Jannies of left leaning subs are super fair and won't ban you just for feeling like it. Conservative may be shit but so is every other bis subreddit.", "label": 1}
{"text": "No, X is just uncensored. Unlike reddit.", "label": 1}
{"text": "L take from an unironic propaganda site", "label": 1}
{"text": "Oh no they dare to make up their own minds and form their own opinions on a free platform, they’re all extremists, white supremacists!!! \n\nI better post this on the exact platform l am bitching about, said the Atlantic", "label": 1}
{"text": "No", "label": 1}
{"text": "Or they can stop lying and being unhinged, but that's too much to ask of the mockingbird media.", "label": 1}
{"text": "guys elections over you don't have to post this crap anymore", "label": 1}
{"text": "And the BS fear mongering begins.", "label": 1}
{"text": "So heroic. Much service. Such wow.", "label": 1}
{"text": "NordVPN is having a Black Friday sale right now. Not sponsored. Never even used a VPN before, but I think it’s time.", "label": 1}
{"text": "Fuck you Nazi.", "label": 1}
{"text": "Trump bad. 👌 got it.", "label": 1}
{"text": "Lay off the meth pipe you stupid moron supporting pedophile \nDon't act like you don't know harris wanted to decriminalize being a  pedophile", "label": 1}
{"text": "exposed -  democrat news bubble", "label": 1}
{"text": "I didn’t know that for 4 years the US had concentration camps for any other than the illegal migrants, weird", "label": 1}
{"text": "Someone got hurt", "label": 1}
{"text": "As it was used against him and his family", "label": 1}
{"text": "Less than 6 hours and the leftist insanity spiral is already in full spin cycle. 4 years of tears", "label": 1}
{"text": "Love how you guys went from \"They arent putting illegals in concentration camps\" to \"Yeah he had concentration camps but just for illegals!\"", "label": 1}
{"text": "Ahhh let the liberal propaganda begin 😂🤡", "label": 1}
{"text": "Could be worse, could have been a FEMA camp", "label": 1}
{"text": "Jesus christ here we go!", "label": 1}
{"text": "WAHHHHHHHHHHH", "label": 1}
{"text": "Knowing something exists == being Nazi. Never change Reddit", "label": 1}
{"text": "I didn’t vote after 2020!! But glad they pulled it off", "label": 1}
{"text": "My goalposts!", "label": 1}
{"text": "Im not even american but seeing redditors hating democracy that much after calling the oppostion nazi and facist is hilarious, but a bit sad too", "label": 1}
{"text": "There is no better world when trump supporters are across the aisle. Every single one of their voices silenced is that better world you want and I’ll sure as fuck take it one account at a time.", "label": 1}
{"text": "Your one of the reasons i had to unsub a bunch of the default subs. Get out of your reddit echo chamber.", "label": 1}
{"text": "Cope harder reddit", "label": 1}
{"text": "I love how reddit is now treating the election night as a weather report now that Trump has won lol", "label": 1}
{"text": "Ah the Reddit seething has already started", "label": 1}
{"text": "That just makes it a state issue.  You can still abort your mistakes", "label": 1}
{"text": "Holy shit man. Log off the internet and take a walk in reality.", "label": 1}
{"text": "Lol fear mongering eh?", "label": 1}
{"text": "Trust me and listen to me", "label": 1}
{"text": "You'll get answer out of this echo chamber", "label": 1}
{"text": "What I just said is the reality. Do I need to say it again? \n\nThere isn’t a better world when that world is shared with trump supporters. Their vile and disgusting examples of human beings who only want peace for themselves and will stop at no line to seize their power. \n\nI’m not sure how you can expect to make an argument that a serial rapist, conman with more felonies than many voters have years on earth is somehow for the better of this country or its people. Stripping rights, fought for generations and paid for in blood isn’t some win coming from idiots who can’t read at a jr high level.", "label": 1}
{"text": "You do realize that it was former Democrat voters and especially minorities (black and latino communities) that secured Trump this ein, right?\n\n\nSo if you wanna shit on people, shit on your own people who switched and vote republican.", "label": 1}
{"text": "Translation: Donald Trump can now do what the Democrats would have done and have done", "label": 1}
{"text": "Trump won because minorities and former Democrat voters switched. If you want to blame someone for Trump winning... Go yell at the Democratic party. They made their voters run away to the other side. Touch grass buddy ", "label": 1}
{"text": "Wait, are you saying the US was worse off in 2016-2020 when the orange guy was running it?", "label": 1}
{"text": "You mean like DemonRats did for last 4yrs?", "label": 1}
{"text": "Enough with the propaganda.", "label": 1}
{"text": "Oh here we go. A few hours passed and there are already doomsday dystopian America articles.", "label": 1}
{"text": "I’ve got four but only one who confirmed non bot", "label": 1}
{"text": "Or, hear me out, you’re yelling down a hall of the left wing. Maybe, just maybe, branch out to where the other 52% of the popular vote came from, because you’re just hand-holding on Reddit with other left wing voters. \n\nI was an undecided and decided to not vote.", "label": 1}
{"text": "Queue the propaganda lmao. This shit started under Bush.", "label": 1}
{"text": "You’re going to get bent over like the rest of his rape victims, so smile and enjoy that grass while you can. \n\nTrump won because we’re a country full of selfish cowards where half the voting population lends their support to a twice impeached and multiple convicted traitor who hasn’t even had fuck all of a successful policy to campaign on. \n\nAnd I do blame democrats just as much, why wouldn’t I? You’ll never see me stoked that Mr one term decided to wait until the last minute to actually make that reality. Too little too late is their mantra. They also don’t keep their streets clean, anyone who was a self proclaimed dem who was too much of bigot to vote for a women was never a reliable vote anyways. Always appeasing the wrong people.", "label": 1}
{"text": "Ironically the Democratic Party was a major contributor to the founding of the KKK", "label": 1}
{"text": "Reddit is majority American users. Plenty of gop voters on here by aggregate.", "label": 1}
{"text": "lol cope harder", "label": 1}
{"text": "TDS is strong this morning", "label": 1}
{"text": "Fuck you Nazi.", "label": 1}
{"text": "There’s not, it’s actually wildly left. Most of them were chased out by the platform years ago when the Trump saga unfolded. /r/conservative is your best chance to fulfill your wishes. If you’re sincere about your comment, post it there. If you’re not, then you’re just continuing to yell in the echo chamber. \n\nLet’s see how **serious** you actually are. Go post it there, I challenge you.", "label": 1}
{"text": "The media will not stop with the fear mongering.", "label": 1}
{"text": "4 more years of reddit meltdown articles lol every other post. You people are scum and deserve every ounce of mental anguish you have coming to you. Triple down on political posts in a Tech sub? yea you deserve the anguish because you cant separate anything from politics. Enjoy the next 4 years of complaining", "label": 1}
{"text": "Yep, I haven’t deleted my account like many others including the thousands in the last 12 hours who are going to pretend they didn’t shill for Kamala.\n\nJust like you can find my comments how last time we had 3 houses we did fuck all for 2 years although we may not have the house as of this comment.\n\nI joked with my fellow right wingers, what do we expect to be done legislatively in the next 2 years? Maybe no tax on tips and that’s about it. \n\nTrump in 16,20,24 and hopefully Vance if he really steps up or someone better in 28.", "label": 1}
{"text": "Why are you even here?", "label": 1}
{"text": "I dunno man, last time I checked, it was the democrats (and their leftist followers) that were too keen on regulating the internet and having tabs on everyone to garantee they don't use their speech for hate", "label": 1}
{"text": "Did you happen to vote for trump? Care to own it or just be cringey? I’m only saying everyone will know and you’ll get their opinions of that? Why would that scare you?", "label": 1}
{"text": "Like it’s not already weaponized?", "label": 1}
{"text": "Lmao! He's not even in office yet. Keep these crap articles coming. Nobody cares. ", "label": 1}
{"text": "You sound like Obama, just stop. It's embarrassing. You lost. America rejected communism. Move on. MAGA!", "label": 1}
{"text": "FFS we’re already starting with this BS", "label": 1}
{"text": "Or a black politician being set up to appear as a white? supremacist? Funny how Trump wasn't considered a racist until he started getting into politics. Name me another White Supremacist racist with an NAACP award, I'll wait.", "label": 1}
{"text": "Whataboutism? \n\nTrump won the popular vote. Get fucked 🤡🤣", "label": 1}
{"text": "Trump immediately called for unity and putting the past behind us. Kommiela? She's still in bed and disappointed all those young deluded girls last night who waited for her. Joyful!", "label": 1}
{"text": "...So you made your own echo chamber?", "label": 1}
{"text": "He didn’t say anything about being scared. You’re projecting.", "label": 1}
{"text": "Y’all are crazy", "label": 1}
{"text": "There really is no reasoning with your like. Totally fanatical...", "label": 1}
{"text": "Quit being a fucking coward and post this to /r/conservatives instead of /r/technology. You are literally crying right now, man up and \"debate\" people that are actually on the right.", "label": 1}
{"text": "The President didn’t do that, the courts did.  It was a sound legal decision as well as abortion (unlike other rights) aren’t protected in the US Constitution", "label": 1}
{"text": "Trump hasn’t even been sworn in and the fear-mongering has already started. Lol.", "label": 1}
{"text": "Oh good. Fear mongering for clicks!", "label": 1}
{"text": "Roe v Wade was a supreme court decision it had nothing to do with Republicans. Stop with your Facebook news disinformation/misinformation. You're a dense dolt.", "label": 1}
{"text": "Lol, the tears have begun 🇺🇸❤️🇺🇸❤️🇺🇸❤️🇺🇸\n\nTrump 2024 baby!", "label": 1}
{"text": "the nazis didn't win FYI the democrats lost you idiot.", "label": 1}
{"text": "because they didn't put people in concentration camps you idiot.", "label": 1}
{"text": "Can’t wait for these “authors” and “publications” to begins squarely becoming rejected. The majority of America is not listening and rejects the extremism. MSM will need to pivot center or officially die. Same goes for all these extreme left publications. Reddit is not reflective of the majority of America. Looking forward to seeing it all change or die. “Elections have consequences.”", "label": 1}
{"text": "\"How Obama weaponized US Surveillance against a Presidential candidate, then sitting President\".\n\n...there, fixed it for you.", "label": 1}
{"text": "Here is the fundamental disconnect between libs and sane people. Just because someone shows up and claims asylum, that does not make someone a legal immigrant. They should not be released into general society until their background is verified and their asylum case decided.\n\n-Sincerely, a legal immigrant", "label": 1}
{"text": "This is why he won bro lol", "label": 1}
{"text": "Not enough people wanted a woman who did a weird fake laugh at every single comment I guess", "label": 1}
{"text": "Interesting to see how geopolitics influence business decisions.", "label": 1}
{"text": "100% this site is a terrible representation of the American public. It's extremely left leaning, the folks who don't see it live in a left bubble. I mean just read the comments here and look at the upvotes for them anyone who Trashes Trump gets upvoted by a large margin. If we compare that to the election we literally just had the comments would be closer to average as people would up and downvoted almost evenly.", "label": 1}
{"text": "Smh give it a break fake media", "label": 1}
{"text": "Bro the Dems are way more likely to coordinate weaponized surveillance. Let’s cut the shit", "label": 1}
{"text": "I like how you start off based on hate and disinformation, your comments are the reason trump won in a landslide again this time around.", "label": 1}
{"text": "You mean how Kamala and Biden did ? I doubt Trump will do it but are you scared Trump will use all the same tactics democrats did ?", "label": 1}
{"text": "Accurate. Reddit is piss poor sample size of Americans. Reddit lives in a bubble where it thinks its opinions represent the majority or the internet - last night it learned a hard lesson that they’re just yelling to themselves.", "label": 1}
{"text": "I tried pretty hard to listen to the other side. Im generally a fence sitter who dosent bother with politics, in a state my vote dosent matter its going one way.\n\nTeam blue was pretty insufferable for me. Calling red every misused  -ist word in the known dictionary. Interviews with kamala were horrible. Not somebody i trusted to be the face of the country. She pandered both ways to different states and i could not tell what she stood for. The fleeing of democrats over to republican side. Trump surrounded himself with promanant figures I like instead of bought celebs. I saw first hand the absolute bullshit they pulled with the afgan retreat and kamala wouldent have changed anything that happened during bidens term.\n\nI could not find a good reason to root for the other team. They need to step back and reaccess what they are about.", "label": 1}
{"text": "I personally look forward to the next 4 years of endless threads about how anything Trump or his team does is world ending.", "label": 1}
{"text": "Trump has the answers boy", "label": 1}
{"text": "Like Biden weaponized the government?....but Could? So this is hypothetical? Maybe but...maybe not..", "label": 1}
{"text": "How does that make sense. She had over 15 million less votes then Biden received. Was bidens economy so bad that 15 million democrats had to return to work so many hours to the point that they couldn’t vote are any point in the past few weeks? \n\nYikes. \n\nWell thank god we ain’t going back to that!", "label": 1}
{"text": "You are so deluded it’s hilarious.", "label": 1}
{"text": "Hahaha cope more Reddit, good lord...", "label": 1}
{"text": ".........So you made your own echo chamber?", "label": 1}
{"text": "ROFL nothing like the scum that’s been in office  had weaponized the doj and other 3 letters", "label": 1}
{"text": "😄 and so the TDS begins", "label": 1}
{"text": "The democrats are the nazis.", "label": 1}
{"text": "I see the media is already back on board to the fearmongering. If Harris won it would be all roses and butterflies. I hope this signals the end of the DNC in its current, unwilling to compromise form. It's scary how obviously evil they've become.", "label": 1}
{"text": "yes of course hitler was famously pro israel. go back to your Russian bot farm.", "label": 1}
{"text": "Your exact attitude is why D lost. Try to reflect on yourself.", "label": 1}
{"text": "Oh no! The horror! Imagine being such a loser spending this much time on Reddit crying.", "label": 1}
{"text": "Vote for your child to grow in a country with a strong economy, jobs, no wars, and with ability to debate.\nDon't vote in someone who got tons of money for the media, forced censorship (like the one META admitted), and who will call you a facist if you disagree with them.", "label": 1}
{"text": "The fear mongering is insane, no one is getting genocided or sent to concentration camps", "label": 1}
{"text": "LMAO", "label": 1}
{"text": "Just more endless dribble of TDS.", "label": 1}
{"text": "Wow I can’t imagine how your party lost this election in the worst possible way. Electoral. Popular vote. Senate. House. \n\nLooks like it’s time for you to put your big boy boots on, bozo! 🤡🤣", "label": 1}
{"text": "Some of these TDS posts are pure gold.", "label": 1}
{"text": "AZ went for Trump and also legalized abortion this election though. \n\nOh wait that doesn't fit your narrative.", "label": 1}
{"text": "If i named them it would be the same responce i get anywhere in reddit. Not worth.\n\nTrumo isnt perfect. The -ist words i find more offensive to misuse. Basically lost their meaning. Not the most important thing though from either side.", "label": 1}
{"text": "These hit-pieces are fast", "label": 1}
{"text": "Oh shut up you crying fear-mongering liberal wanker. Your tears will feed me for at least the next four years. \n\nVote me down to oblivion and I will laugh and grow more powerful than you can ever imagine!", "label": 1}
{"text": "Medical procedures are not a natural right", "label": 1}
{"text": "Yeah, but he leaves in January, so it’ll be ok.", "label": 1}
{"text": "Wired was actually useful before it became a lib rag for agenda pushing.", "label": 1}
{"text": "It’s okay. It takes awhile to get slapped back to reality. They can cry for the next 4 years. I’ve got plenty of popcorn lol", "label": 1}
{"text": "Plenty of states have taken up legislation where it belongs.", "label": 1}
{"text": "And here we go with round 2 of democrats never shutting up about Trump for 4 years. Ugh this is going to be tiring. CNN, aka the Trump News Network, is gonna be Trump 24/7\nI would take a worse candidate than Trump if it meant we didn’t have to hear this complaining for 4 more years", "label": 1}
{"text": "“Cultist” is funny to hear from a group of people that voted for a women who wasn’t even elected for the position.\n\nI think any sane person would view the group who just tried to circumvent our democracy as the “next enemy.” \n\nTake care though, and enjoy the next 4 years of peacefulness!", "label": 1}
{"text": "So basically Trump insulting people doesn't matter, promising to \"purge political opponents\" doesn't matter, but your fee fees being hurt matters.\n\nGotcha.", "label": 1}
{"text": "And liberal meltdown and scare mongering starts. Queue in blm and antifa terrorist riots soon", "label": 1}
{"text": "LOL...did Biden write the patriot act?\n\nThe propaganda continues....", "label": 1}
{"text": "What about how the democrats weaponized social media to suppress speech?", "label": 1}
{"text": "Back to your regularly scheduled propaganda posts. 😂😂😂", "label": 1}
{"text": "Media propaganda is so pathetic.", "label": 1}
{"text": "Sounds like you should file a hurt feelings report. We’ll get back to you.", "label": 1}
{"text": "Nope, not close to obama", "label": 1}
{"text": "Yeah, HIPA was removed when? \n\nFirst you want choice, so we vote it in. It's not even one day old and you're already crying about a different topic. No wonder your side lost. Bunch of children.", "label": 1}
{"text": "You can’t have a right to someone else’s labor. The doctor doesn’t owe you anything.", "label": 1}
{"text": "Thank you for leaving.", "label": 1}
{"text": "You said nothing good.", "label": 1}
{"text": "Definitely not as attentive to him as he is attentive onto his phone (even in between sets)", "label": 1}
{"text": "Liberal tears \"slurp,slurp,slurp\" delicious", "label": 1}
{"text": "Again, incapable of staying on topic. It’s called “Whataboutism”. They are going to be studying you guys for years to come.l 🤣🤡", "label": 1}
{"text": "Oh so zero thought from you. Well done. \n\nClearly you're clueless with an agenda. \n\nOrange Man won, women got rights. Go cry more.", "label": 1}
{"text": "So people are afraid that he will do what the democrats already have been doing.  So they literally spied on him and his campaign weaponized surveillance against him and his administration and now they complain.  What was done by democrats especially in regards to elections and campaigns is the real threat and all this freak out about the exact thing they are currently doing is like eating all the oreos and then when called on it you with a straight face say you ate it.", "label": 1}
{"text": "Sounds like another potential Naypyidaw. Such a weird city.", "label": 1}
{"text": "Lmao MSM already started , no one read your shit . Your propaganda doesn’t work", "label": 1}
{"text": "One of those things is enumerated in the US constitution as protected. The other is just something you feel strongly about.", "label": 1}
{"text": "Damn straight voted for him this time and can't wait to see who's up in the next election", "label": 1}
{"text": "Oh I'll be there for every major, minor, federal, state, local election for the rest of my life", "label": 1}
{"text": "All this fear mongering… the war machine was backing Harris.", "label": 1}
{"text": "We’ve watched you try and fail to put him in prison so many times for so many reasons, I’ve lost count. Cry wolf more, it will certainly work eventually.", "label": 1}
{"text": "[r/technology](https://www.reddit.com/r/technology) is currently 50% hit pieces on Trump and Musk. Unsubbed this trash.", "label": 1}
{"text": "We need more Machine Gun operated cameras!", "label": 1}
{"text": "It’s hilarious you’re still in full on panic mode about project 2025", "label": 1}
{"text": "I love how you guys are too dense to figure out why regular dudes voted the way they did.", "label": 1}
{"text": "It has already been weaponized by the democrats......", "label": 1}
{"text": "This conversation started with me correctly pointing out that the Democratic Party was a major contributor for the formation of the KKK. And your talking about what now? Ok, great job being “on topic” \n\nAgain, can’t imagine how you lost the electoral, popular,senate, house…", "label": 1}
{"text": "I've followed these cases closely and I did not walk away with the impression that Trump is a felon. My take is that he hires incompetent legal representation and the New York DA targeted him. While the former isn't great, the latter is DEEPLY concerning.\n\nThey took what would in nearly any other instance be considered a misdemeanor with a roughly $5k fine, split it into 30+ cases and created an entirely new interpretation of \"intent to defraud\" simply because it was Trump and not someone else. And, because he was convicted, this is now precedent.\n\nI get that people don't like Trump, but people really should be much more concern with the abuse of power in this instance.", "label": 1}
{"text": "Hahaha are you kidding me. This happened more than 20 years ago, 9/11 was the catalyst. Ya'll are acting surprised over something that's been in place for over 20 years", "label": 1}
{"text": "I still feel Obama doesn't get enough criticism for summarily executing 2 America citizens with a drone strike, one of them was 16 years old.", "label": 1}
{"text": "I mean there is a reason we left Europe and created our own country. You aren’t making me regret that decision at all lol.", "label": 1}
{"text": "Let him go to work, it has only been a day. Just celebrate for a bit", "label": 1}
{"text": "Lmao. The people that wanted Kamala to win are the ones that wanted this.", "label": 1}
{"text": "You absolute fascist dictator lover. I hope you are one of the first victims of his regime", "label": 1}
{"text": "Don't change the subject, Obama directly violated the US constitution by intentionally putting American citizens on a kill list and executing them without trial.", "label": 1}
{"text": "> If you're going to take Trump being called a racist piece of shit personally that's on you.\n\nJD Vance's wife is Indian.\n\n> She wound up being way more personable than I expected, but how was she less trustworthy than gestures wildly at everything?\n\n\"What would you change about Biden's term, if you were president?\"\n\n\"nothing comes to mind\"\n\nThat comment alone probably sunk her chances.\n\n> This is such a weird thing to get mad at Kamala for while siding with Trump who would literally change his stance if he got booed or not, sometimes in the very same sentence.\n\nThe comment was about Kamala, not Trump. It's possible for Trump to exhibit the same behaviors, but be preferred for other reasons.\n\n> Who? Joe Rogan?\n\nTrump went after the young male vote and did pretty well. Turnout was the highest it's been in a long time.\n\n> Also, if you think the Dems have the money to buy anyone compared to Trump having **billionaire upon billionaire backing him**, including the richest skipping dipshit in the world, I dunno what to tell you.\n\nCome on now - BS like this is why people are turning on democrats:\n\n- Kamala wears Hermes for God's sake\n\n- She was backed by massive celebrities such as Eminem & T Swift\n\n- The Biden/Harris campaign literally **raised 3x as much** as Trump: 997M versus 388M\n\n> The one negotiated by Trump in which he invited the Taliban and not the Afghan government? The one where Trump got 5,000 Taliban fighters released? The one where he started the withdrawal back in February 2020 and set it to conclude in August 2021? That one?\n\nBiden took over, scrapped the existing plans, and pulled out immediately. The failure is on him, not Trump.", "label": 1}
{"text": "Netanyahu is not a despot and there has been no genocide you idiot.", "label": 1}
{"text": "Hope so you pukes", "label": 1}
{"text": "Enjoy your anxiety.", "label": 1}
{"text": "No he didn't, he spoke to a religious group while courting their vote he said vote for me this one time and you won't have to vote again. I actually implore you trump is the president for the next four years take in right wing sources and look into what they say don't just listen to main stream or left wing losers like chenk or sam. Actually take the fact that Trump not only won the electoral college but the popular vote, take that and try to understand what's going on in America and the rest of the world and why these major populist candidates keep winning over liberal establishment governments.", "label": 1}
{"text": "Let's test this real quick. What specifically did Trump do that he was criminally liable for? Again, I've studied the case very closely and am convinced NY came after him on grandiose charges specifically because of who it was and not because of the crime that was committed. My stances is that what was essentially a clerical error likely performed by Trumps team in ignorance was turned into a felony.\n\nPlease correct me. What did Trump do specifically and why is it deserving of a felony conviction?", "label": 1}
{"text": "Hitler used toothpaste!\n\nJust because the 10th amendment was used to defend slavery does not mean that any usage of the 10th amendment is as evil as slavery.\n\nIt's actually a pretty important part of the way our system works.", "label": 1}
{"text": "Not even close to a good comparison. Slavery wasn’t imposed on everyone and freeing slaves was just an accidental by product of civil war. Lincoln had no intention on freeing slaves nor was it the cause of civil war. Not saying it isn’t a good result but seems like you’re Coping pretty hard there. Not surprised though.", "label": 1}
{"text": "And here I thought that Presidents like Biden nominated Justices and the people we elect like US Senators confirmed the nominee.\n\nTell us, which dark money pool backed President Biden and got Justices like Brown confirmed.  \n\nBecause you’re about to state that dark money is backing the Democrats.", "label": 1}
{"text": "Did the little baby leftist block me don't cry widdle baby Leftist because no one cares suck it", "label": 1}
{"text": "You said his supporters when he was specifically talking to one small group of people not all of his supporters", "label": 1}
{"text": ">     If you're going to take Trump being called a racist piece of shit personally that's on you.\n> \n> \n> \n> JD Vance's wife is Indian.\n\n\"I have a black friend.\"\n\n>The comment was about Kamala, not Trump. It's possible for Trump to exhibit the same behaviors, but be preferred for other reasons.\n\nThen why bring it up as a minus since it's only a minus to her for you not to him?\n\n>Trump went after the young male vote and did pretty well. Turnout was the highest it's been in a long time.\n\nThe young male vote is a \"promanant figure?\"\n\n>The Biden/Harris campaign literally raised 3x as much as Trump: 997M versus 388M\n\nThis ignores all the dark support like from Twitter and the fact that total is campaign only and ignores PACs which cuts that down massively.  Also, Harris' campaign received Over $400m from donations under $200 while Trump's was only $100m.\n\n>Biden took over, scrapped the existing plans, and pulled out immediately. The failure is on him, not Trump.\n\nYou're right, my bad.  Trump set the full withdrawal *for May 1st 2021* while Biden extended it.\n\nAlso, just glossing over the Taliban shit, eh?\n\nAnyways, just wanted to let you know we're going to be \"insufferable\" as we point out how his tariffs are killing the economy, as his foreign policy emboldens Russia and China (weird how he always does what's great for China, eh?), as he kills the ACA and get your medical coverage taken away due to a pre-existing condition, as his \"mass deportation\" increases the cost of food and housing and winds up putting people in camps because you can't just deport people en masse.  We won't ever let you live it down, because I guess the truth is \"insufferable.\"", "label": 1}
{"text": "Let's hope, we could reopen the salt mines and make more cope distilleries", "label": 1}
{"text": "No you wouldn’t because Obama signed indefinite detention into law.  They can arrest you and hold you for years without even giving you a trial.  Biden’s admin did it for some of the Jan 6 rioters.", "label": 1}
{"text": "The scenario where trump is the first Republican president in 20 years to win the popular vote", "label": 1}
{"text": "Somebody didn’t go to school and it wasn’t me.", "label": 1}
{"text": "The 9th amendment doesn’t specifically mention abortion. You can make a case that it could, but it’s not certain because it’s not specifically named.", "label": 1}
{"text": "Let's cut the B's your just trying to infer trump will become a dictator and the US won't have any more elections and my response to that disingenuous argument is simply liberal tears nom nom nom", "label": 1}
{"text": "Load ze fearmongering astroturf campaign", "label": 1}
{"text": "Oh the classic random redditor replying for a different one.  Bye bye.", "label": 1}
{"text": "Well just look how the Democrats did it the last 20 years!", "label": 1}
{"text": "Irony the Dems would have made it so these propaganda ass posts would stop straight up dregs of ppl", "label": 1}
{"text": "Stating something is a right doesn’t make it one.", "label": 1}
{"text": "According to polls most people don't agree with you, which is the reasons Trump won. He won because many Democrats voters now voted Republican. He made the biggest gains in minority groups.  Are you going to call black people and Latinos racists fascists? Because those are the people who predominantly switched to th republicans party.  There was not a single state or county where Kamala gained ground compared to Biden. Democrats performed worse in every single county and state ", "label": 1}
{"text": "Now post election all I get in my feed is fear mongering. It never ends.  The bots have been re activated lol", "label": 1}
{"text": "He could just use the tools Biden set up.", "label": 1}
{"text": "And I didn’t, so good.", "label": 1}
{"text": "Cry harder pussy", "label": 1}
{"text": "We had to save you from the last fascist dictator, so maybe you aren’t the best judge.", "label": 1}
{"text": "Then I'll give you one last chance he was talking to a group of low propensity voters and his pitch was vote for me this one time and I'll fix your problems and you won't have to vote again that's it, just some political promises to get people unlikely to vote to get out there and fill a ballot.", "label": 1}
{"text": "Sure lefty don't od on that cope", "label": 1}
{"text": "lol.\n\nthe fear porn starts early this go around huh", "label": 1}
{"text": "Wait wait wait so when the dems add an expansion to the patriot act 2 years ago to include all online purchases under surveillance that’s not mentioned. but the president who is talking about dismantling the CIA and the surveillance state now we’re talking about the president weaponizing the patriot act??? make it make sense", "label": 1}
{"text": "You don't need to hope, actually look at his presidency he was outrageous with his speech but never actually pursued anything like locking Hillary up its always talk", "label": 1}
{"text": "Dang here we go again with sensational articles. ", "label": 1}
{"text": "You are really unhinged.  The fact that you want to shame people, have them delete their account for voting Republican shows me you are not well.\n\n\nApparently you think Trump and Republicans are the antichrist. That would mean according to you more than 50% of people in your country are evil assholes. And again, Trump gained votes compared to 2016. So democrats switched sides. Maybe they were dissatisfied with what the Democrats did during the last 4 years. Maybe the Democrats should try to do better. People lived under trump and Biden and decided they want Trump again. Deal with it. Apparently Democrats are not delivering.", "label": 1}
{"text": "So it begins... The endless tirade of daily shock headlines of what Trump can do tomorrow and the day after...", "label": 1}
{"text": "You didn't save anything your grandparents did, and you just shit on everything they build. They did it for you, me, and the entire Western culture.  Europe won't forget how you betrayed freedom and democracy by electing tyrannical fascist. And Europe didn't elect anyone for that Germany did.", "label": 1}
{"text": "You're dipping back into disenguine again. At the end of the day trump is a bragard and bostous be he said he'd build a wall and he started it while crafting remain in Mexico, he said we were done with war so he created a plan to pull from the middle east while brokering peace deals and crossing into North Korea. He isn't a dictator or a threat and that's just obvious.", "label": 1}
{"text": "The felonies were mainly driven by Trump political enemies and the people in court were simply bought.", "label": 1}
{"text": "Democrats lost this one because they've lost touch with the Average Joe and the perception - key word here: perception - among those voters is that the Democrats don't care about them and worried more about identity politics while they struggle to the pay the bills or buy groceries.\n\nAnd I hate to say it, but they're not entirely wrong. Democrats don't know how to speak to voters who aren't in the big cities anymore. 2020 might have been a bit of an outlier because of Covid, but I think since at least 2016, it's become a pretty consistent pattern\n\nControversial as he may be now, the Democrats need a Southern or Midwestern Bill Clinton-like candidate who can relate more to people in rural and middle America if they want to appeal to a majority of voters again.", "label": 1}
{"text": "You all really do live in your own world.", "label": 1}
{"text": "Yeah, those who supported a man to beat up a woman on the ring by repeatedly punching her skull on live TV and make the beat up woman to apologize -again- on live TV was definitely NOT “manosphere”. /s", "label": 1}
{"text": "Incapable of blaming themselves or their own flawed rhetoric, leftists start to seek culprits of their own failure. This is what democrats should be really taking home:\n\nYour platform, your rhetoric, your propositions are so bad and detached from reality, that people would rather vote the worst republican candidate in history.", "label": 1}
{"text": "Well do you have one? Because running Tim Walz would be as dumb as running Mondale against Reagan in 84", "label": 1}
{"text": "Oh no, a country that sympathizes with a rapist with a rap sheet that makes Capone look like a straight up guy thinks I’m wrong. Color me surprised that the uneducated make poor decisions. \n\nIt’s lived through, not loved through, I even had to autocorrect it because my phone thinks you’re something special. And did they, I guess the millions that died were already forgotten?", "label": 1}
{"text": "Too many conversations going I guess. Doesn’t change anything fundamentally.", "label": 1}
{"text": "I’d didn’t say you elected them, I said we saved you from the last one. \n\nTwo of my Grandma’s voted for Trump, so I’d say im upholding everything they built and didn’t want taking away from me. \n\nEurope can be as mad at us as they want, again there is a reason we left and made our own country lol.", "label": 1}
{"text": "From a lawyer: \n\nhttps://youtu.be/RJbgKP-2cFg?si=gwHAGHIx6A43-Ris\n\nSince neither of us are lawyers, watch what an actual lawyer says.", "label": 1}
{"text": "After you finish blaming everyone else you only have yourself to blame. This one is firmly on the democrats shoulders.", "label": 1}
{"text": "Say it ain’t so!!\nI think this post just backfired \nMic dropped", "label": 1}
{"text": "who would have guessed that intolerance of certain groups makes them vote for the other side", "label": 1}
{"text": "Oh, look, it's the Russian rumormill trying to gain traction and relevance 🙄🙄🙄 about a topic that isn't even a topic. \n\nGo take your astroturfing gossip and plant it in a country that cares. \n\nThis is absurd.", "label": 1}
{"text": "Liberals have already weaponized it the last 4 years we kept it from getting any worse", "label": 1}
{"text": "Let’s see, my great grandparents fled Europe and served in the US military, and my grandparents voted for Trump were raised by the ones that had to flee. I’m not seeing how I’m dishonoring any of them lol. I’m having fun watching you foam and progress into more insults though, so keep going. \n\nOh! I also don’t use TikTok, or instagram 🤔.", "label": 1}
{"text": "You mean like when the Dems did it in 2016 on the Trump campaign?", "label": 1}
{"text": "Yes you are. Thankfully.", "label": 1}
{"text": "But then where will the top Reddit subs get their content?", "label": 1}
{"text": "Cue the liberal nonsense from all press to stir the pot and spread bs across reddit to cope with their own failures", "label": 1}
{"text": "[wired] 🏢🔫:  this is a stick up, give me your clicks and nobody gets hurt", "label": 1}
{"text": "You obviously haven’t watched a single media outlet from the US in the last 8 years if you think this lol.", "label": 1}
{"text": "U got 4 years to cry a river and then JD Vance in 2028 good luck 👍🏾, stay off the news enjoy America", "label": 1}
{"text": "Dude Hillary paid the Russians to spy on Trump with Steel Dossier she should be in prison. The so called coup attempt is a joke how can you claim trump was involved when he wasn't even there. If I'm a Russian bot, why did I work for twenty years in American military defense AGAINST the Russians.  You democrats really are delusional liars.", "label": 1}
{"text": "OMG the TDS here never stops.\n\nSigh.", "label": 1}
{"text": "Its obvious that propaganda bots dont work.   \nWhy you keep going?", "label": 1}
{"text": "Lmao its the world economic forum not trump! Trump will try to avoid it but they are very powerful and influential!", "label": 1}
{"text": "We can only hope he stays in the shadows this time.", "label": 1}
{"text": "The blame game is the same every election, regardless of who’s in charge.", "label": 1}
{"text": "Keep listening to the news you’ll be shocked in 2028 as well when Vance wins 😂", "label": 1}
{"text": "Gasp, can you imagine a president wire tapping their political opponent's place of business?\ncough cough Obama cough Trump Tower cough cough", "label": 1}
{"text": "Biden already did it crybaby", "label": 1}
{"text": "The fear mongering and TDS is about to hit defcon 1", "label": 1}
{"text": "Don’t get me excited lol, this is exactly what I voted for.", "label": 1}
{"text": "I mean, yeah, it could be very easy.  Joe Biden and Kamala's administration did it to near perfection", "label": 1}
{"text": "Brother in Christ not everyone who disagrees with you is a Russian bot. I literally sell missiles to the us.", "label": 1}
{"text": "The government buys things from private companies", "label": 1}
{"text": "Consumers don’t need protection from monopolies. If anything they benefit from them, regardless monopolies only form in the first place due to government intervention.", "label": 1}
{"text": "You’re stupid, fuck you!", "label": 1}
{"text": "A disagreement does not equate to a lack of understanding. I made a claim because I have done research to back it.", "label": 1}
{"text": "We’ll just either keep records or resell US debt to other countries who are happy to wait longer.\n\nHistorically, even the worst fascist debts get inherited by the rebuilt country - Italy took decades to recover and pay back their stuff, but they did - and that was after Mussolini bombed his own industry.\n\nOf course, the Italian Lira inflated like a party clown’s baloon giraffe. But that’s another issue.", "label": 1}
{"text": "Good, large part of it is based on stolen technology.\n\nMaybe don't prop them up anymore.", "label": 1}
{"text": "So basically...Orange Man Bad.", "label": 1}
{"text": "Since when are consumers electronics \"tech industry\"", "label": 1}
{"text": "Glad you aren't letting politicians ruin your personal relationships lol", "label": 1}
{"text": "How are they even gonna enforce this? Kids will just lie about their age like they've always done.", "label": 1}
{"text": "If you just put in tariffs in a vacuum sure... That's going to be the only thing that impacts prices.  And we aren't comparing to a status quo situation. \n\n\nAs much as reddit loves saying tariffs get passed to consumers.  They can't seem to articulate why increased minimum wages or corporate taxes don't....", "label": 1}
{"text": "Thank goodness. Tell us more!", "label": 1}
{"text": "we'll just make the gpus in the us.. how hard can it be?", "label": 1}
{"text": "Sick. Finally", "label": 1}
{"text": "Is this a propaganda sub for next year’s election already?!", "label": 1}
{"text": "ahhh yes, the tolerant left. \"lets burn down the country\" glad you assholes lost", "label": 1}
{"text": "You won't be for long.", "label": 1}
{"text": "Is that a threat?", "label": 1}
{"text": "Of course not.  The irony is your taking liberals not doing anything as a threat.", "label": 1}
{"text": "I’m not even bitter. I’m just having a laugh at all y’all crying. X today is like Christmas.", "label": 1}
{"text": "He never said that \"we should inject bleach\", he never even used the word bleach. That is disinformation fed to you by the MSM propaganda machine. Go back and watch the video.\n\nThe \"nuke hurricanes\" story is unverifiable, only anonymous sources cited by Axios. No evidence that he actually said it. No video, either...\n\nTrump didn't say *windmills* cause cancer, he said their *noise* can cause cancer. While there is no evidence of this specifically, he was likely citing multiple studies that have shown links to various forms of noise and cancer, so the idea itself is actually not unfounded: \n\n[https://pubmed.ncbi.nlm.nih.gov/36064622/](https://pubmed.ncbi.nlm.nih.gov/36064622/)\n\n[https://breast-cancer-research.biomedcentral.com/articles/10.1186/s13058-018-1047-2](https://breast-cancer-research.biomedcentral.com/articles/10.1186/s13058-018-1047-2)\n\n[https://www.hsph.harvard.edu/news/features/noise-can-harm-your-health-even-if-you-sleep-through-it/](https://www.hsph.harvard.edu/news/features/noise-can-harm-your-health-even-if-you-sleep-through-it/)", "label": 1}
{"text": "Whats wrong with you, you dont see yourself saying something you hate? Ur becoming what you hate.", "label": 1}
{"text": "another bullshit article", "label": 1}
{"text": "Don’t worry. Nobody was fucking you before and Trump being in office won’t make that worse.", "label": 1}
{"text": "Good.", "label": 1}
{"text": "lol why the fuck is your non Taiwan and non Chinese ass lying.", "label": 1}
{"text": "Womp womp cope and seethe", "label": 1}
{"text": "Damn, two replies? The cope you need is high!!!", "label": 1}
{"text": "Owwie owwie, the little mean low-T redditor insulted me again😫", "label": 1}
{"text": "> Also, using that language is a reportable offense, I’m afraid you have been reported👆🤓\n\nOn my christian reddit thread, how terrible. /s\n\nYou're on fucking reddit, you clown.", "label": 1}
{"text": "> People are acting like nukes are coming the moment he becomes president.\n\nWAY more likely with a far left president. Trump is anti-war.", "label": 1}
{"text": "Another report👆🤓", "label": 1}
{"text": "You used another bad word, another report for you👆🤓\n\nMake yourself useful and just go get me a coffee. Two sugars, and make it quick. Will give you a chance to blow off some steam!", "label": 1}
{"text": "Not only is it low-t to call me a bot, but it is also low-iq I’m afraid. Have a better night, though might be hard over the next 4 years😂", "label": 1}
{"text": "Bud. A simple Google search shows that I'm not lying. There's plenty of other sources out there to confirm: [https://www.theguardian.com/world/2023/may/02/china-barring-thousands-of-citizens-and-foreigners-from-leaving-country](https://www.theguardian.com/world/2023/may/02/china-barring-thousands-of-citizens-and-foreigners-from-leaving-country)", "label": 1}
{"text": "in this context, you're a nobody though. Why wouldn't they let you leave? I'm talking about the people who would be working on engineering the most advanced chips in the world.", "label": 1}
{"text": "Go on Weibo and say that Taiwan is an independent country and that Xi Jinping's policies are a disaster. We'll see if after that you can still leave the country whenever you want.", "label": 1}
{"text": "Well that should go well for the rest of us. GPU prices go up in the US, sales go down, prices come down for the rest of the world, sales go up, I get a new GPU for less money. Thanks Trump, you fucking moron.", "label": 1}
{"text": "Yea I could have made that clearer", "label": 1}
{"text": "Agreed.\n\nI'm not even mad at the result—only morbidly curious about the looming reactions to Project 2025, Trumponomics, mass deportations, and RFK Jr.'s approach to public health.", "label": 1}
{"text": "roflmao tesla or some Elon-affiliated company would replace them immediately, you utter tool.", "label": 1}
{"text": "Imagine blaming the progressives for this. Your fucking centrist neoliberalism has failed us time and time again. Get fucked you piece of shit", "label": 1}
{"text": "What a fucking idiot", "label": 1}
{"text": "It's actually so funny how Catholics are so happy over this. Like how moronic can you be most of the other Christians don't believe Catholics are even Christians so they're on the chopping block along with anyone else they hate.", "label": 1}
