{"text": "We don't need no stick-on badges.", "label": 0}
{"text": "Listen, Peter Thiel isn’t paying him to know anything, he’s getting paid to be a troll bitch online", "label": 0}
{"text": "I don't understand were all three of those cancelled because someone was a rapist?", "label": 0}
{"text": "Why is that relevant?", "label": 0}
{"text": "Oh, I can. I just don't particularly care to do so when someone lost my patience. A big character flaw of mine, I know (hence I understand the downvotes to my comments, it's quite fair and if anything I'd get me some more). But, same as with teaching people how to read (because I do consider I explain my points pretty clearly, if not someone can call me out on that), I ain't in the internet for popular points.", "label": 0}
{"text": "I do! Did he refuse to leave the White House last election? The mainstream media painted the J6 insurrection as Trumps fault, which is completely false. I believe J6 was terrible, and anyone involved should be jailed. However, Trump told his followers to protest \"peacefully and patriotically\". I know you won't believe me, so here's a 30 second clip! https://youtu.be/UILCtm_ALMI?si=K1JbiyGOQa0rFlBb", "label": 0}
{"text": "If its a matter of comparison, she did amazingly well.", "label": 0}
{"text": "Yeah, sorry she didn't decide to stop answering questions and dance, I know you guys love that shit", "label": 0}
{"text": "I haven't felt compelled to rewatch Staged, which is actually quite good. I don't think I share your view. It'll be shite.", "label": 0}
{"text": "Ok, make Jackass 5 instead!", "label": 0}
{"text": "Trumps dancing is iconic!", "label": 0}
{"text": "Watch Preaching Evil, it's gonna keep me from sleep for about a week. ", "label": 0}
{"text": "Every major actor or actress has a production company", "label": 0}
{"text": "If Lorne felt that strongly about keeping him he should have played the \"if he goes, I go\" card. But he didn't. He just stayed quiet in the background and allowed Shane to get eviscerated, only speaking up to defend him years later. Pretty lame.", "label": 0}
{"text": "Ah comedians can’t be funny if they don’t share your political beliefs. Sad. I have no clue who Shane Gillis supports politically and I love that.", "label": 0}
{"text": "I think we should keep Diddy in the music and fashion business because employees might have to find another job is also a very reddit thing to say.", "label": 0}
{"text": "Are you a bot? \n\nCompared to trump she was stale?", "label": 0}
{"text": "Good 3.3 million people saw first hand what a complete fool she is", "label": 0}
{"text": "Hey, I prefer *that* ad to hearing \"this thing is nicer than my apartment!\"\n\nRegal apparently stopped running that ad though.", "label": 0}
{"text": "I just threw up in my mouth.", "label": 0}
{"text": "I kinda think it was due to Charlie's movie bombing so terribly. I don't think he was in any mood to joke around and so they took a break, but then just never got back to it.", "label": 0}
{"text": "Sure was", "label": 0}
{"text": "Yeah we had a very peaceful four years under the first Trump Administration.", "label": 0}
{"text": "I feel sorry for the stars 😢 💔 ", "label": 0}
{"text": "This has to satire at this point", "label": 0}
{"text": "Pratchet co wrote good omens??", "label": 0}
{"text": "You should go brush your teeth then!", "label": 0}
{"text": "I agree, but you're the only other person I've seen with this theory. His character reeks of a Tyler Durden situation, or at least a hallucination. I think it'll be a big reveal that he's not real and Sofia actually is mentally ill.", "label": 0}
{"text": "And you think the peadophile should be?", "label": 0}
{"text": "You mean like how Trump was fired by the American people for being fucking terrible at his?", "label": 0}
{"text": "I do not think Shane Gillis getting the SNL job would have been as good for his career as not getting the SNL job.", "label": 0}
{"text": "Oh god nooooo why?! \n\nI mean yeah get him the fuck out, I just... loved his work so much", "label": 0}
{"text": "This doesn't matter as much as you think it does. We're the ones driving the engagement. Obviously what's being posted is popular either way. If this account didn't post it another one would.", "label": 0}
{"text": "> because she’s a nepo baby sue me\n\nHer dad was a psychologist and her mum was a nurse, that's not a nepo baby.", "label": 0}
{"text": "They definitely go softer on the left. Claiming otherwise is laughable. \n\nThat is not to say they don’t go after the left. It’s just different degrees", "label": 0}
{"text": "Could it be that a certain number of people watch political TV?? lol", "label": 0}
{"text": "Season 1 of the show is the book. Season 2 and 3 were based on plans between Gaiman and Pratchett for a sequel.", "label": 0}
{"text": "It is not an exaggeration though, because they are not exaggerating anything about the way they talk or act. A parody that gets nothing right about its subject is a bad parody. \n\nIt lacks the foundation of a good parody, which requires a meaningfull understanding of the subject. They didn't exaggerate the way the Gallagher bros talk, because that was not used as a reference point. \n\nAlso I am not British so chill out lol", "label": 0}
{"text": "So nobody won from this virtue signalling\n\nThe same message couldve been sent finishing a proper season but without NGs involvement", "label": 0}
{"text": "It's more the fact that they're smaller budget/production so as a result the execs go more hands off and let the writers and showrunners tell an actual new and interesting story instead of re-hashing the same old tired story that gets told in basically every other marvel property.", "label": 0}
{"text": "Good, I like that millions of people watched her fail so badly.  A total embarrassment.", "label": 0}
{"text": "In a few dats we could lose our USA to its first dictator. Glad my vote for HARRIS/WALZ has already been counter in  deep red MAGA Miami-Dade county. \n\nGood luck to us.", "label": 0}
{"text": "No shit .", "label": 0}
{"text": "So you think if you Cohen didn't die that week they still would have had Kate playing a different song at the piano?", "label": 0}
{"text": "You poor thing. Only MAGA knuckledraggers believe your dumb stories.", "label": 0}
{"text": "Don't worry we know you don't understand much", "label": 0}
{"text": "I am talking about the total, which includes the super PACs, for example Elon Musks, which don’t count toward the totals you just shared.", "label": 0}
{"text": "Excuse fucking me??\n\n>He made those jokes when he thought no one was listening\n\n>The video in question is excerpted from a 2018 episode of Gillis’ podcast “Matt and Shane’s Secret Podcast\n\nDude, he said it into a microphone that was uploaded to the internet? What part of that was not meant to be listened to?", "label": 0}
{"text": "A tv movie. Better than nothing.", "label": 0}
{"text": "Sending a redditcares over this is very normal behavior thanks so much bud", "label": 0}
{"text": "Everyone lies but Trump. Sure buddy, whatever you say.", "label": 0}
{"text": "> Either she alone loses, or everyone loses\n\nand to chose to lose alone still means something", "label": 0}
{"text": "She loves to work. We love to see her. \n\nWin win.", "label": 0}
{"text": "Lmao seriously, you can’t post something to a podcast and then go “I didn’t think anyone was listening” like this isn’t a private conversation my dude", "label": 0}
{"text": "Internet can't be cheap on your planet.", "label": 0}
{"text": "I love the show and Stallone’s wig", "label": 0}
{"text": "Good. It should never have gotten a second season to begin with.", "label": 0}
{"text": "Now please shoot in LA.\n\nThanks!\n\nLove,\n\nLA crew", "label": 0}
{"text": "Her performance is being criticized even by her allies and leftist media allies, so it's not good for Kamala that there was such a large audience to see it.", "label": 0}
{"text": "It still sucks in 2024.", "label": 0}
{"text": "Oof. Imagine thinking she did bad lol", "label": 0}
{"text": "No I read the article…\n\nIt’s still weird PR", "label": 0}
{"text": "My lord, you're going to need consoling in 13 days when Trump wins. I'll make sure to stop by and check on you!", "label": 0}
{"text": "> A-list actors. \n\nThe whole notion of tiered actors is an absurdly flawed concept, like ignoring the fact that the show has Kathryn Hahn, Aubrey Plaza, Debra Jo Rupp, Sasheer Zamata who are all phenomenal in their own right and immensely successful and talented actors, they literally had Patti LuPone who is a straight up fucking legend, like if anyone was to ever be called the GOAT, it's absolutely Patti.\n\nThe fact that none of them would be considered an A-lister just shows how absurdly silly the entire concept is. So I think it's a little more than just good writing(but that's also amazing), it's hiring actors that not only have wonderful chemistry with each other, but that have an actual love and buy in to the project because it absolutely shines through.", "label": 0}
{"text": "So not a reliable source. Also, I looked it up, and it 100% comes off as a joke. \n\n\n> “Explain why,” Gillis replied. “Because he was offered to play Trump on the entire season of SNL and he turned it down to f*cking be here, folks,” Gomez added. Gillis said, “They said, ‘Are you serious? You’re going to say no?’ I said, ‘Lorne, I’ve got to go to Coke Magic.’”\n\n\nDoesn't come off serious at all. ", "label": 0}
{"text": "One Hour Photo 😍", "label": 0}
{"text": "All of those, it’s just so entertaining and fun to take your mind off things and into a crazy drama. ", "label": 0}
{"text": "Let me know what you think! \n\n\nAnnie Murphy is an absolute star and steals ever scene she’s in.", "label": 0}
{"text": "Emily in Paris. Give me 50 seasons.", "label": 0}
{"text": "Neutral bc it won’t change the minds of the American people. Just more bs word salad. Donnie is going to wipe the floor with her lol", "label": 0}
{"text": "It’s a take on the traditional sitcom trope.\n\n\nWhenever the husband is on screen, it’s a sitcom.\n\n\nWhen he’s not on screen, it’s a drama akin to Breaking Bad. \n\n\nAnnie Murphy is the main character who’s married to Kevin, the husband that’s always shown in a sitcom setting. \n\n\nThe show follows their relationship and her coming to realize she doesn’t want to be part of his traditional house wife role anymore.", "label": 0}
{"text": "It’s in the trailer.", "label": 0}
{"text": "Hey The OC is a straight up classic.\n\nWell, I do get what you mean, but I also think there's some genuinely very strong elements to the show, I think calling it bad is really selling it short.", "label": 0}
{"text": "Lol, you need to read up a little more on arbitration", "label": 0}
{"text": "I'm not looking forward to the trickle down effect", "label": 0}
{"text": "Don’t love it but I kinda enjoyed the blockbuster show", "label": 0}
{"text": "Neutral.  It just means there's roughly the same amount of people watching Harris speak as Trump - hopefully that means enough people still care enough to watch both candidates talk before voting, but in all honesty it probably just means the nation is still roughly split right down the middle.", "label": 0}
{"text": "And I’m sure the money you get is another reason lmao", "label": 0}
{"text": "As Adam points out, they are harder to find, have a much shorter shelf life, and are quickly cancelled before they can find an audience.", "label": 0}
{"text": "It's the sweaters.", "label": 0}
{"text": "Thanks for the Teacup reco I'm onto it sounds like just my kind of thing.\n\nGrotesquerie - agree, like the AHS I find I have lost interest and its starting to be a chore to keep watching so have given up.", "label": 0}
{"text": "You mean shows where the plot only progressed once every 7 episodes, and glacially at that. Nah, glad they're gone. 80% spinning their wheels.", "label": 0}
{"text": ">Whenever the husband is on screen, it’s a sitcom.\n\n>When he’s not on screen, it’s a drama akin to Breaking Bad.\n\nNot sure how this would work but I'll give it a try", "label": 0}
{"text": "IMHO, it is the perfect way to adapt anything that has a \"big world\". \n\nDon't try to adapt the story that was told in a game or even a book. It never actually works, because these things are oftentimes FAR too big in scope to be adapted properly. So don't try to adapt some big story and make the LotR trilogy happen again. That was lightning in a bottle.\n\nAdapt the world. Tell a unique story in that world. Tie it to some important aspects of \"the real story\" and you'll have a good adaptation in your hands.\n\nThe other recent adaptation of something big and geeky that really stood out to me was the D&D movie and that one also told a unique story, but simply took the aesthetics of D&D and weaved that into the story. \n\nI think you could adapt other big series like that and just do an original story.", "label": 0}
{"text": "I didn’t either, but it honestly works really well. It’s surreal almost. Definitely say give it a try!", "label": 0}
{"text": ">For every 100 dollars a white family has, a black family has 13 dollars, last i checked.\n\nthis is a group statistic based on culture/race. but we should take it at an individual level. because each individual has different circumstances despite whatever culture/race they belong to.\n\n>For every 100 dollars a rich family has, a poor family has 13 dollars\n\nthis is real problem. \n\n>So your reasoning is fundamentally flawed because you are seeing the reduction of privilege for a specific privileged group as discrimination\n\n\"privileged group\" is a misnomer because it is a generalisation. corner cases exist such as rich blacks, poor whites. the system should work based on real factors such as income, not generalisations such as race. when an employee looks at a resume, they should not see race or sex on that form, but instead the education level, the history, the work ethic. when you are giving grants, you should look at who is poor, not who is colored.", "label": 0}
{"text": "It feels like one of those adaptations where the writers take pride in declaring they never saw the source material.", "label": 0}
{"text": "Yes the seasons are way too short! I’m finally watching Lost and I remembered how good we had it with 20 episodes per season.", "label": 0}
{"text": "He's Peter Bishop to me but I getcha. I'm gonna check it out. Hope it is so bad it's good stupid.", "label": 0}
{"text": "Gregg Araki's \"Now Apocalypse\".  Think the old MTV series \"Undressed\", but more nudity and worse acting. Loved everything about that show.", "label": 0}
{"text": "How is ***Disclaimer***? Synopsis is kinda vague so", "label": 0}
{"text": "I forget the details, I think it involves Robin taking off his mast. Its a flashback to the original style and reveals Robin got the original team blown up by rockets. \n\nThere is also an episode where they get to meet their only fan", "label": 0}
{"text": "It only didn't work in Salvation because of  script(?) leaks and subsequent studio shitting themselves and ordering emergency reshoots to \"fix\" the ending.\n\nWhen the cut plot points were introduced in the graphic novels/comics they were hailed as pretty good twists in the lore. Even the expanded continuity where they explore the timeline in its entirety is pretty solid.", "label": 0}
{"text": "And for some inexplicable reason, Angela Bassett has graced us with her presence 😂", "label": 0}
{"text": "https://youtu.be/xclUAPGYyqc?si=Af6pfqxPZHXwAYBM", "label": 0}
{"text": "as someone who only saw Anno's recent movie, and thought it was mid, which kamen rider series do you recommend?", "label": 0}
{"text": "I recently went through the process live action robocop show. It’s far from the quality of the first two movies, but it had some moments that made it really stand out", "label": 0}
{"text": "I do--which makes it all the more infuriating.", "label": 0}
{"text": "CSI Miami….god I love it. It’s terrible but I love it", "label": 0}
{"text": "Velma had a bunch of episodes batch made and was forcibly cut into 2 seasons.\n\nIm not sure about the production of tomb raider, but i imagine its very much the same scenario.\n\nIm positive its still going to get canned, if we have history to go by anyways.", "label": 0}
{"text": "It’s a data point. I don’t think it’s an indication of anything.", "label": 0}
{"text": "I'm very glad that Trump picked Vance instead of Haley otherwise it would've lined Haley up to be the Laúra Montez of real life.", "label": 0}
{"text": "It’s not Yakuza until every season is interspersed with random filler episodes where Kiryu does karaoke or stars in a Michael Jackson video or something.", "label": 0}
{"text": "Since 2016:\n\nStranger Things, Chernobyl, The Boys, The Queen's Gambit, House of the Dragon, Last of Us, Dark, Ted Lasso, Severance, Silo, Mindhunter, The Haunting of Hill House, Fallout, The Bear, Succession, The WHite Lotus, Fleabag, The Good Place, Mare of Easttown, Shogun, Andor, The Night Of, Midnight Mass, Beef, The Morning Show, Barry, Black Bird, Dark Matter, Normal People, Unorthodox, Station Eleven, Babylon Berlin, Slow Horses, Dopesick, Heartstopper, For All Mankind, The Penguin\n\nAll well-rated to highly acclaimed", "label": 0}
{"text": "Diddy do something naughty?", "label": 0}
{"text": "I watched the video, I’ve seen the whole speech several times. It’s funny how the right ignores all of the rhetoric about fighting like hell to save your country and focuses just on this 30 seconds. Almost like he included this part of his speech to give him an out to say he didn’t send those people to attack the capitol. Then he sat on his ass and watch Fox while they rioted. He tweeted that Mike pence failed them, called congressmen to tell them to reject the electors. It took 3 hours before he called his dogs off. \n\nWhat about the fake electors that Trump, Giuliani, and Eastman coordinated? The riot was meant to delay the certification and scare Pence into bringing in the electors that they forged. Or did you not read any of Trumps indictments because the DOJ is corrupted by democrats?", "label": 0}
{"text": "My kids played this song so much in the car that I had to perma-ban it.", "label": 0}
{"text": "The pilot was kind of rough, but I think it has potential. Seeing Reba and Melissa together again is a treat, and most sitcoms struggle in the beginning until they can find their footing. Hopefully they can pull it off! Especially because we know that Steve Howey has a guest appearance, I’d love to see more of the original Reba cast make appearances too", "label": 0}
{"text": "Internet reviews are such a joke for any remotely controversial piece of media. It’s honestly sad to look at a shows reviews, and see an otherwise normal distribution skewed by like 50% one star reviews. Then you see the flip side with that Reagan movie, and the Matt Walsh one sitting at like 98% audience scores on rotten tomatoes, as apparently they are among the best films ever made.\n\nMedia reviews have been monopolized by a group of people trying to push a political agenda, and it’s genuinely sad.", "label": 0}
{"text": "I've heard of that happening with a couple of shows now. I suspect it might be some kind of trick to screw the production staff over. Like you contract them for a season of work and then you chop into two shorter seasons and get something like a two-for-one deal.", "label": 0}
{"text": "The movie was basically Deadpool for kids.", "label": 0}
{"text": "I was against it until they made the song (Night Begins to Shine) which is definitive PEAK", "label": 0}
{"text": "I stopped watching procedurals for the most part like twenty five years ago and don't miss them for a second.  I watched Person of Interest this year since this sub raves about it non-stop.  It sure is a slog to get through a show where 95% of the content is filler where the exact same thing happens over and over.", "label": 0}
{"text": "my mother was watching it and i lasted maybe 2 minutes before i had to leave the room. The boy with the curley hair, i just wanted to slap him. The over the top animated facial expressions, the constant smug look on his face, his voice. Im not a violent woman but that show made me rage within 120 seconds", "label": 0}
{"text": "In a similar vein, I genuinely like Dawson’s Creek. It took itself way more seriously than the OC, but as far as those teen soaps go, it’s pretty solid. The biggest downside is that the main character is easily the worst one.", "label": 0}
{"text": "When you've made 4 films, and the weakest is 'Where The Wild Things Are', you have some damn talent.\n\nI look forward to whatever he does next, probably a new movie in 12 years.", "label": 0}
{"text": "Matt Williams was right again.", "label": 0}
{"text": "Ya'll were talking about Person of Interest on this sub last week and when I saw people discussing the plot I knew I had to see it. I'm on episode 18 and I can't stop. Send help.", "label": 0}
{"text": "My daughter has me watching that  9-1-1 show with Angela Bassett. I roll my eyes at it every two minutes, yet enjoy watching it as an unintentional comedy.", "label": 0}
{"text": "this shit happened to one of the best animated shows ever, Scavengers Reign. not only one of the best animated shows but a truly original and dreadful sci fi story. criminally underwatched but anyone who has seen it knows it's value.", "label": 0}
{"text": "Meh. Would have preferred a second season to Kaos.", "label": 0}
{"text": "Time to block Jenny", "label": 0}
{"text": "Got damn it", "label": 0}
{"text": "Star? Star???", "label": 0}
{"text": "Seriously? You know how many continuity errors or plot holes you can poke in your average sitcom? But they're still enjoyable because they have other redeeming qualities.", "label": 0}
{"text": "As bad as the show was, the acting was either really hammy (Jada Pinkett, Barbara, late season Lee) or really really good (the three you named, Alfred, Lucius). Some takes of the villains were different and fun. I loved the show and watched every episode but I don't fault anyone for thinking it was bad.", "label": 0}
{"text": "Star Trek Picard S1 and S2. They had some real issues with planning and production that made the execution real iffy, but having gained some life experience myself since watching TNG as a kid in the 90s, it feels like a show that has grown up along with me and wrestled with some of the same things I do - what it means to age physically and socially, and dealing with things like guilt, shame, and regret.\n\nThe third season was good, but overreliant I thought on nostalgia, especially the last episode or two.", "label": 0}
{"text": ">You’re passionate about making us - who are passionate about this terminology - give up the use of a word that means almost nothing to you\n\nAnd now we’re just jumping head first straight into making up shit. \n\n>I don’t even watch anime more than once in  several months.\n\nThen you sure as hell got no business picking fights with me, little weeblet. Do us both a favor and go start with a Tower of God fan over whether or not it’s an anime.", "label": 0}
{"text": "It was a fun little show.\n\nWas it good? (bobbles head side to side)", "label": 0}
{"text": "I didnt see Salvation until a few years ago and I was stunned that it got as much hate as it did over the years. It certainly wasnt amazing but I really enjoyed it and didnt think it was nearly as bad as history has made it out to be.", "label": 0}
{"text": "Prob between 6-7", "label": 0}
{"text": "Not necessarily you think is bad. What's a show people say is bad or had poor production but you like? This question or premise is not a new one.", "label": 0}
{"text": "R Kelly would be though", "label": 0}
{"text": "I didn’t even know the show got a lot of hate. I loved the first 2 seasons of that show. It was so much fun.", "label": 0}
{"text": "*You* made the claim, so *you* get to prove it. It’s not anyone’s job to disprove *your* claims.", "label": 0}
{"text": "Oh apparently he was already like that while he was filming POI.", "label": 0}
{"text": "I’m actually kinda glad Lonestar is ending because I know I’ll always watch it if it’s there. But I love 9-1-1. Literally my favorite weekly show that I watch.", "label": 0}
{"text": "It’s my wife’s favorite show and she runs it on repeat so I’ve seen it all a few times. Another favorite story line is rich-sports-agent-forgets-he-has-a-son-as-a-trauma-response-to-his-wife-dying. But that’s after a woman who looks like his dead wife (same actress) tries to take the place of his dead wife and ends up shooting rich sport agent and his new fiance. \n\nThe rich sports agent drives a nice corvette tho, so he’s my favorite.", "label": 0}
{"text": "Kaos couldn't get 20m views in 4 weeks. Compared to its budget, it was doomed. You and a lot of people seem to think that if something is good by your measures than Netflix should continue it. That's not how things work...", "label": 0}
{"text": "Punctuation is a last resort in a good headline 🤷‍♂️", "label": 0}
{"text": "Exactly", "label": 0}
{"text": "Trump is still doing TV pretty regularly though and has been increasingly bizarre each time.", "label": 0}
{"text": "It’s so funny how many people mention 9-1-1 here. I’ve been watching the show for like 5 years now. It’s so fun. It’s nice to have a break from more serious/bleak type shows.", "label": 0}
{"text": "Which is interesting, because *Fringe* is an example of a mythology-heavy show where they were basically making it up as they went along, and yet still manages to feel cohesive because of how outstanding the performances were (Noble in particular) and the sheer confidence it has in its core premise. \n\nThings that *seem* planned from the beginning only feel that way because early on, they knew they wanted there to be *something* going on with X, Y, or Z—they just didn’t know **what** quite yet. It’s pretty remarkable how well they tied many of these open-ended questions together (even if there are still others that ultimately went nowhere).", "label": 0}
{"text": "Oh, so you want my review of his review.\n\nSure, here it is:\n\n- He makes jokes about this Lara lacking the pyramid boobs.\n\n- He takes offence to the fist fighting that Lara had with that woman  in the wrestler mask, and says that Lara is supposed to be smart and sophisticated. (Despite that in his other videos, he complains about female characters being smart and sophisticated calling them girlbosses).\n\n- He says that Lara being fighter and knowing how to throw a punch is wrong, Lara should be an archeologist that carries a gun for self-defense, not a seasoned warrior.\n\n- He mocks Jonah and Zip calling them \"non-threatening male sidekicks 1 & 2\". \n\n- He complains that Lara wanted to give the stuff in the Croft Mansion to a museum.\n\n- He is also complains that \"***LARA IS GAY NOW***\" *cue the thunder and lighting*.\n\nAnd let's not forget what he said about the showrunner.", "label": 0}
{"text": "When she waited for the laugh after the trunp wall comment I about died.", "label": 0}
{"text": "One of the best pieces of advice I got when learning how to drive, and it's stuck with me for 30 years...\n\nYou might be right, but you might be dead.", "label": 0}
{"text": "They just put out so many shows and people feel way more attached to the ones they like.", "label": 0}
{"text": "You should check out the podcast \"Inside Conan: An Important Hollywood Podcast\", hosted by his writers Mike Sweeney and Jessie Gaskell.  They interview tons of the crew and writers behind the scenes that made Conan's shows on NBC and TBS really work (including a few interviews with Jordan Schlansky!)", "label": 0}
{"text": "Was the OC considered a bad show? My memories of the 2000’s are hazy but I always thought it was regarded as a 00’s classic.", "label": 0}
{"text": "Gas is $2.60 here in SC. 🤷‍♂️ did she do that?", "label": 0}
{"text": "I think this is partially incorrect. There have always been cop serials since the early days of television. There haven't been good sci-fi serials since the streaming era began because no one gets more than 8-10 episode seasons. Evil would be the closest imo but that also just ended", "label": 0}
{"text": "wait why did Dan kill his own brother??", "label": 0}
{"text": "Just because someone *should* know that something will occur if they take an action does not mean that they *do* know it will. And if they didn’t intend for something to happen, that is - by the most basic definition of the word - an accident, regardless of how careless they were being or whether they should have known it would happen. \n\nIn seriously asking you - what is your definition of “accident”?", "label": 0}
{"text": " For the week of Sept. 23, the [already-renewed rom-com](https://tvline.com/news/nobody-wants-this-renewed-season-2-netflix-new-showrunners-1235332984/) racked up north of a billion minutes viewed for its 10 episodes, (distantly) trailing repeat chart-topper *Monsters: The Lyle and Erik Menendez Story* (which was p 40% from last week with 2.4 bllion minutes viewed.)\n\nNetflix’s *Mr. McMahon* docuseries placed third this week with 908 million minutes viewed/six episodes, followed by Prime Video’s *The Rings of Power* (733 million minutes/15 available episodes) and Netflix’s *The Perfect Couple* (556 million minutes/six episodes).\n\n  \nOn Nielsen’s *overall* streaming ranking, Pixar’s 96-minute *Inside Out 2* trailed *Monsters* with 1.8 billion minutes viewed in Disney+.", "label": 0}
{"text": "I understand the reflexive desire to use your phone while driving, but my god the danger is still so underestimated. One split second to finish reading that last word of a text or to finish typing it is incredibly all it takes.", "label": 0}
{"text": "I’ve been saying for a while that people have started driving here like we are in a developing country with no law enforcement or education. If you’ve ever been to a country like that you know exactly what I mean.", "label": 0}
{"text": "Power Rangers. Sure, the better seasons are, well, better, but even Time Force and RPM have a LOT of narm due to being forced to be for kids and adapting Sentai material. And as bad as Season 1 is, it still has a LOT of charm to it.\n\nBoth Hawaii Five-O and NCIS: LA survive due to the insane chemistry of the core cast. They get muddled during the later seasons when they do cast expansions, but the core stuff still shines through at times.\n\nI don't care how obvious a toy commercial they are, I still love G.I. Joe and Thundercats.", "label": 0}
{"text": "For the last 2 years of a presidency? Shmaybe. There have been worse VPs. Especially if you want to rehabilitate the party and put distance from someone like Nixon redux. It would be a smart way to try and force a reset so you could have a real shot in the next election.", "label": 0}
{"text": "why wsa she ragged on? what was so bad about those ads?", "label": 0}
{"text": "I said it peaked in 2015.  I didn't say it died.\n\nAdam's point is that, which is obvious you didn't watch, is that shows are unable to find their audience.  Netflix et al. pump out new shows that are foreign to viewers.  These shows are meant to be streamed within a week and then forgotten.  Older shows would come out once a week and would build an audience over time.\n\nBecause these shows fail to find an audience, they are cancelled after a season or two.  Unlike older shows like the Office, Friends, Love Boat, Golden Girls, which have hundreds of episodes, these new shows barely get a dozen and are gone before anyone notices.", "label": 0}
{"text": "They’re doing what’s supposed to be done and leaving it up to the individual states", "label": 0}
{"text": "Decreased attention span also plays a huge role. Even being a passenger of someone who is usually a patient person, that “bing” sound when they get a text while at a red light; they can’t not grab the phone. Just look at other drivers when you’re at a red light.", "label": 0}
{"text": "Below deck.", "label": 0}
{"text": ">Adam's point is that, which is obvious you didn't watch\n\nI saw his video months ago when it came out.\n\n>Netflix et al. pump out new shows that are foreign to viewers. These shows are meant to be streamed within a week and then forgotten. Older shows would come out once a week and would build an audience over time.\n\nThis is true, but this does not mean the shows are somehow of worse quality.\n\n>Because these shows fail to find an audience, they are cancelled after a season or two. Unlike older shows like the Office, Friends, Love Boat, Golden Girls, which have hundreds of episodes, these new shows barely get a dozen and are gone before anyone notices.\n\nThese are all sitcoms you mentioned. Sitcoms have died.\n\nThere's way too much competition now for a long-running show to emerge and pick up the capital of the older shows you mentioned. There's simply much more TV being made, and people's tastes are way more splintered than they were.", "label": 0}
{"text": "Because they haven’t announced a second season or the same company worked on both shows?", "label": 0}
{"text": "If you are suggesting The Office (UK) comes under the banner of “bad show” you’re being deliberately disingenuous. The Office has always been recognised as a hugely significant series.", "label": 0}
{"text": "Can confirm. They say this nonstop.", "label": 0}
{"text": "The average sitcom isn’t plot centered so why in the world would a continuity error be such a big deal that it would ruin the show?", "label": 0}
{"text": ">He makes jokes about this Lara lacking the pyramid boobs.\n\nWhat?\n\n>He takes offence to the fist fighting that Lara had with that woman in the wrestler mask, and says that Lara is supposed to be smart and sophisticated. (Despite that in his other videos, he complains about female characters being smart and sophisticated calling them girlbosses).\n\n[Here's](https://youtu.be/xPE7-PRL0M8?si=RwBlVdO_ax-cgp5R) his video about \"girlbosses\". Point to where he complains about a \"smart and sophisticated\" characters. \n\n>He says that Lara being fighter and knowing how to throw a punch is wrong, Lara should be an archeologist that carries a gun for self-defense, not a seasoned warrior.\n\nAnd? He explains why he thinks that. What is your problem with that opinion? \n\n>He mocks Jonah and Zip calling them \"non-threatening male sidekicks 1 & 2\". \n\nAnd? \n\n>He complains that Lara wanted to give the stuff in the Croft Mansion to a museum.\n\nAnd? \n\n>He is also complains that \"LARA IS GAY NOW\" cue the thunder and lighting.\n\nOK...? \n\nLet me ask you. Do you understand the difference between not liking his opinion and him actually saying that's factually or in some other objective way wrong? Because so far you mischaractarized what he said and complained that he has a different opinion.", "label": 0}
{"text": "Awesome", "label": 0}
{"text": "What're the odds looking like it ends in his favor? Looking to place a bet online at DRAFTKINGS. \n\nThat's right DRAFTKINGS is where you can bet on court case outcomes and if you use promo code DIDDYORDIDNTHE you'll get a credit of $100!", "label": 0}
{"text": "I want to live in the reality where Richard Splett is president.", "label": 0}
{"text": "Same goes with bikers in the bike lane. Almost every single time I’m on the road, I will spot someone who swerves a little outside the driving lane and would have hit a biker if there was one there.", "label": 0}
{"text": "I thought Almost Human was pretty good, shame it didn't last long ☠️", "label": 0}
{"text": "Fringe was so good. Can't imagine it making its way beyond a season 2 of it were made today.", "label": 0}
{"text": "> yet society continues to normalise the risk by manufacturing even larger, more hazardous vehicles\n\nIronically, the growth in size of most smaller cars and trucks over the last 30 years is primarily due to collision standards. See Civic, Tacoma et. al.", "label": 0}
{"text": "I've watched Seinfeld three times through over the years; I would have been concerned if I'd missed this lol. Thanks for the clarification!", "label": 0}
{"text": ">you don’t need to know about fantasy football to enjoy The League\n\nIs this still true nowadays? There are quite a few storylines that revolve around specific players, and if I remember right, from S2 onward there were a large number of players that appear on the show. \n\nI'll admit I haven't watched it in years, I'm asking sincerely.", "label": 0}
{"text": "tomb raider subreddit seems liking it", "label": 0}
{"text": "Doh. Of course! 🙈", "label": 0}
{"text": "It really wasn't till this show that I fully realized what \"hate-watching\" was.\n\nEmily In Paris is so damn fun to watch but my god, it is so awful, lmao.\n\nJust campy, silly, nonsense.", "label": 0}
{"text": "Made extremely racist remarks about Asian people that some tried to play off as a joke.", "label": 0}
{"text": "It gets even better, the son who was kidnapped was a retired NBA player who turned into an agent and was in Europe trying to sign a recruit.\n\nBut do you know what team the son played for?\n\n….the Charlotte Bobcats.", "label": 0}
{"text": "“In addition to airing on Comedy Central, the special will simulcast on MTV, Paramount Network, TV Land, CMT, Pop and Logo.”\n\nLooks like all TV but it *might* be on Paramount+ or you could look for a stream.", "label": 0}
{"text": "Olympus. It has only one season, but my god I love it. I randomly watchted it with my girlfriend and we both love it.", "label": 0}
{"text": ">Haley Atwell is fantastic ~~as Lara Croft~~\n\nFTFY", "label": 0}
{"text": "FWIW Reddit mod tools exist that let you see someone's most active subs just by hovering over their name. Someone doesn't need to visit your profile and be labeled as a stalker to see your history.", "label": 0}
{"text": "> Like a 90s cartoon.\n\nWhat a strange thing to say about the best era of TV cartoons.", "label": 0}
{"text": "So being controlled by the government is fine as long as it's done at the state level? (Never mind that Republicans currently want this at the federal level,  anyways)", "label": 0}
{"text": "And make no mistake about it if Martin Short wants to destory you he can and everyone around you will be laughing.", "label": 0}
{"text": "*“From” - finished season 1, on to season 2. I just hope we get more answers in season 3*  \nYou don't get more answers but they make up for it with more questions", "label": 0}
{"text": "> Do you understand the difference between not liking his opinion and him actually saying that's factually or in some other objective way wrong?\n\nWhat facts could there be in there in the first place ?\n\nIt's a 10 minutes video opinion from a culture war grifter. Why are you defending him anyways ?", "label": 0}
{"text": "BIG Kristen Stewart fan and after this a big Adrien Brody fan. The charisma and charm he emits on screen is electric.\n\nDefinitely not usually a fan of this genre but really enjoyed this one.", "label": 0}
{"text": "There was no joke. He was just having an unfunny racist moment.", "label": 0}
{"text": "Is there a source for this or just speculation because hes been to diddy parties before?", "label": 0}
{"text": "Hey Similar_Bug5106! Thank you for your submission. Unfortunately your post has been automatically removed [for being too short](https://www.reddit.com/r/television/wiki/rules#wiki_15._text_posts_with_little_to_no_text). Text posts in television require 100 characters or more in the \"text\" field of your post. It is recommended that you resubmit your post instead of editing it, as AutoModerator will not know to reapprove your post if you edit it to comply. If your post is a simple question or you are asking for recommendations for shows to watch, consider commenting in the [Weekly Thread](https://www.reddit.com/r/television/search?q=flair%3A%22Weekly+Rec+Thread%22&restrict_sr=on&sort=new&t=all). If you are trying to find where a show is streaming, try justwatch.com. If you are trying to find the name of a show, consider r/tipofmytongue.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/television) if you have any questions or concerns.*", "label": 0}
{"text": "9-1-1 season 8\nAgatha All Along\n\nI am also watching season 1 of Succession and I’ve been slowly making my way through season 2 of Dark (for months lol).", "label": 0}
{"text": "Watched it and I liked it, Yumi actually has character and isn't just there for plot, majima isn't forced into almost every cutscene for you to fight him and tbh the show is it's own universe, like the sonic movies for example. Sure, I don't like some of the changes either like changing some character names and putting some story lines from 0 in the flashback, sure, etc. But I also love some changes that they did/stuff that they added like giving the characters more moments and showing more of sunflower etc. \n\nOverall it's not as bad as people say and it's fine if you disagree.", "label": 0}
{"text": "RT percentage scores are absolutely worthless for judging the quality of something. It’s more about mass appeal.\n\nThey average Pass/Fail rather than the actual numbers given by reviewers, so you could have 100 out of 100 reviews giving it 7/10 and it would have a 100% on Rotten Tomatoes.\n\nThe actual critic score average on Rotten Tomatoes for this show is 6.5/10. Incidentally, the Metacritic score is 65", "label": 0}
{"text": "Honestly. I said it. Bad 90s. Not the good ones. They were ace. It just seems dated and unfinished. Couldn't finish first ep. \n\nI love anime and cartons. Just watched bob's burgers. Solar opposites, archer. But this. Just fell flat. Almost like the opposite of Castlevania", "label": 0}
{"text": "I don't even think it would matter if they did prep. Kathie Lee and Hoda basically just drank themselves stupid every morning. It's not like she'd remember the interview notes.\n\nI sincerely think this flippant attitude to weekday, day drinking fueled a ton of the \"wine mommy\" sentiments over the last decade. It basically just normalized alcohol abuse for stay-at-home moms.", "label": 0}
{"text": "Hmm. I get where you’re coming from with Agatha All Along. I do think having watched related stuff makes it more enjoyable.", "label": 0}
{"text": "Telemundo", "label": 0}
{"text": "If you haven't watched the Americans, go watch the Americans.", "label": 0}
{"text": "What if shows just decided to go from 20-13-8-6-1 episodes, just give us 1 really good episode and make it like the length of 3 episodes.\n\nAnd maybe just since they are just making the 1 episode they can spend more money on it to make it better, and if the people really like it they can decide to make another season of 1 episode 5 years later or something. Just a thought I had I wonder if TV people have considered this or if it's a new idea?", "label": 0}
{"text": "Vehicular collision", "label": 0}
{"text": "I like how they made her look more manly and then made her a weak wuss that literally breaks down and cries all the time.\n\nLara Croft is supposed to be feminine and a tough as nails badass. She's also supposed to be straight. They literally made her Lame and Gay.", "label": 0}
{"text": "They totally changed Lara here. She's not an actual thief/Tomb Raider anymore. She's become a whiny crybaby. Most of all, she's got more masculine features now, which totally goes against her femme fatale figure that she originally was intended to be.\n\nIf you loved the original games, this isn't the Lara Croft you know.", "label": 0}
{"text": "Fire Country fits that bill for me. It's SO STUPID, I like to chat with my girlfriend while I watch it with increasingly unbelievable updates.", "label": 0}
{"text": "I tapped out when they had a golden opportunity to kill off Jada Pinkett and didn’t take it.", "label": 0}
{"text": "I also didn’t know. I don’t keep up with Short of Gifford. To be honest I didn’t even know he was married. ", "label": 0}
{"text": "In other words he's a grifter because you don't like his opinion. That's it.", "label": 0}
{"text": "Watch the movie called Permanent Midnight which is about a TV writers adventures with drugs while writing for ALF and other 80's shows.", "label": 0}
{"text": "That’s cute as hell", "label": 0}
{"text": "Comprehension can be difficult. At least you have The Penguin to talk to you on your level.", "label": 0}
{"text": "Yes. And anyone who wants to give it a try - stick with it. It turns into a completely different (and much better) show pretty quickly. Not sure when it got good - start of season 2? Sooner?", "label": 0}
{"text": "Cameron Monaghan's performance as Jerome/Jeremiah stole the show imo. I still hold out hope that he gets to portray the actual Joker in some piece of media, be it live-action, animated, or video game because he nailed that role even it wasn't technically the Joker.", "label": 0}
{"text": "Kristen ***Bell***", "label": 0}
{"text": "Kind of ironic given that Cartoon Network obsessing over this show has caused ratings to drop so far Comcast took them off the basic tier and caused a ton of CN originals (and the Checkered Past block) to jump over to Adult Swim.", "label": 0}
{"text": "I thought about giving it a shot just for Elodie Yung.", "label": 0}
{"text": "You sound fun.", "label": 0}
{"text": "It would work with Halo I think. Halo Reach showed you don't need the narrative to pivot around the Chief. The world itself can be interesting as long as you have badass powersuits shooting aliens.", "label": 0}
{"text": "Single gaff? Bro that’s only the most recent one, everytime she’s spoken it’s been the same thing, i dont know what you’ve been watching.\n\nMurdering political candidate? Are you feeling ok? You realize only 1 candidate has had attempts on their life rite? Are you bringing up hearsay as an argument? \n\nIf changing opinions is ok, why is it that when trump says something different he’s always a lier? Why don’t you believe him when he says he feels different about something?\n\nLmfao it’s crazy you’re missing the whole point, my point is t the bribe part is bad, I’m sure trumps done shit like that too, everything I said about Harris has most likely been done by trump, that’s the point, you really don’t give a shit about what they do, or say, you just don’t like trump for whatever reason. I mean, in almost everything I said you’re comparing it to trump, so why would ppl vote for her again? You’re really not doing a great job at convincing someone by saying “he did it too, but I think it’s worse” and bringing up random lies and misconstrued statements. \n\nYou’re rite tho, I have identified the problem, you left wing Reddit vets, who fall for post like this, post obviously made by a paid op, but, unlike you guys, I’m not willing to “fix it” because even if I don’t agree with, YOU GUYS, I still think you have a rite to your own opinion, and shouldn’t be penalized for it.", "label": 0}
{"text": "It’s canceled, but Zero Hour was so bad it was awe-inspiring. Give me more Nazi clocks that will bring about the second coming of Jesus and Judgment Day.", "label": 0}
{"text": "Loser siblings made the show for me. Definitely loved the comedy in this", "label": 0}
{"text": "Except HBO is saddled with the infuriating David Zaslav whom no artist in their right mind wants to work for.", "label": 0}
{"text": "Sorry I don't get watching a show you think is bad. But maybe I misinterpreted what OP meant. If you like the show then that's different.", "label": 0}
{"text": "Citadel: Diana. Just bear with the first three episodes while it builds a story. At the end I was like....more, please.", "label": 0}
{"text": "I mean, the show basically accelerated the death of Cartoon Network as a brand, so much so that it's no longer on basic cable, all their shows are moving to Adult Swim, and still has the reputation for 24/7 TTG despite that not being the case for years, so yay?", "label": 0}
{"text": "I know Joel McHale from Community, but I’ve never heard of the Soup. Didn’t know Paul Rudd had a Matt Damon/Jimmy Kimmel thing with Conan. I guess I had different channels. Does this community typically downvote people when they haven’t seen something on TV?", "label": 0}
{"text": "At least you didn't read it as \"Star Wars Rule 34\" 😂", "label": 0}
{"text": "People don't want to hear anything more complex than he's ____. I don't think he's racist. His humor can be incredibly immature and simple. He did a good job with his stand up special getting right up against the line.", "label": 0}
{"text": "The only thing that can stop 1bln min. Netflix show from reaching top spot on Nielsen chart is another Netflix 1bln+ min. show.", "label": 0}
{"text": "You didn’t just say it peaked, you said we get nothing new, which is totally nonsense, as @skavau has demonstrated", "label": 0}
{"text": "Do you want to live in a communist country? That’s what Harris and Waltz want. They will control everything in your life. They will tax you by the point you won’t be able to own anything. So you want a man going into your daughter’s bathroom? Republicans aren’t the best either. But at least you’ll have your right to search, own weapons etc.", "label": 0}
{"text": "It's a commercial, I simply don't give a shit about it.", "label": 0}
{"text": "Shows from last week's [thread](https://www.reddit.com/r/television/comments/1g6k3yh/what_are_you_watching_and_what_do_you_recommend/?sort=top) mentioned in at least 10 comments:\n\n|**Show**|**On**|**Comments**|**Upvotes**|**Consec. Weeks**|**Comment Gain**|**Total Weeks on Top**|\n|:-|:-|:-|:-|:-|:-|:-|\n|The Penguin|HBO|30|29|5|\\-6|5|\n|Slow Horses|Apple TV+|15|15|9|\\-14|19|\n|Agatha All Along|Disney+|15|13|1|6|3|\n|The Devil's Hour|Prime Video|13|11|1|8|1|\n|Shrinking|Apple TV+|12|12|2|1|3|\n|Disclaimer|Apple TV+|12|12|2|\\-2|2|\n|Only Murders in the Building|Hulu|11|10|4|\\-1|8|\n|English Teacher|FX|10|9|2|0|5|\n\nShows Dropped From 10+ Comments List this Week: Pachinko, The Sopranos, Silo, The Lord of the Rings: Rings of Power, Nobody Wants This, Bad Monkey, Severance\n\n\\*Total Weeks on Top began on 12/8/23, as did all data collection.\n\n\\*\\*I took up grubster11's mantle after their retirement. You can view the original code they created to tally comments here: [https://github.com/GrubHubGitTub/r-television-Weekly-Thread-Data](https://github.com/GrubHubGitTub/r-television-Weekly-Thread-Data).\n\n\\*\\*507 comments in last week's thread. All-time high comments on 3/23/24 thread - 901 comments. All-time low comments on 9/13/24 thread - 422 comments.\n\n\\*\\*\\*\\*All-time high shows with 10+ comments on 5/31/24 thread - 15 shows. All-time low on 2/23/24 thread - 3 shows.\n\n\\*\\*\\*\\*\\*All-time high comments for a show in one week: Fallout (127) on 4/19/24 thread.", "label": 0}
{"text": "Time to serve up them sour grapes.", "label": 0}
{"text": "I love mulaney as a comedian and that was one of the hardest watches of my life. It wasn't meta or satire at all. Mulaney himself admitted it was terrible.", "label": 0}
{"text": "Pro Wrestling. \n\nIt can be really really stupid sometimes. But sometimes it strikes gold.", "label": 0}
{"text": "Outer Banks. It's ridiculous but Im still watching smh", "label": 0}
{"text": "And Adam Brody. Has to be on purpose to get them both wrong.", "label": 0}
{"text": "*Adam* Brody.", "label": 0}
{"text": "They wouldn't even bother with outsourcing the animation, they'd just cheap out and make it in flash, like they did in the movie.\n\nIn which case I'd rather it stay dead.", "label": 0}
{"text": "Your zero effort ignorance has made Reddit a worse place than it was before you joined.", "label": 0}
{"text": "Sasha catfishing a teenage boy was the best thing I’ve ever seen on tv", "label": 0}
{"text": "That’s the movie I’m referencing. Not only was it a brilliant crossover, it also brought together many other versions of the Teen Titans, including the DCAU versions. It’s what an animated Crisis story could have been instead of the nonsense we got. \n\nGranted, no Crisis animated movie will work if Kevin Conroy’s Batman isn’t front and center, and sadly that will never happen. At least he got one final performance so his final line as Batman is a good one to go out on. ", "label": 0}
{"text": "Is it fuck", "label": 0}
{"text": "Don't forget about Oprah' vajayjay pain.", "label": 0}
{"text": "That's way too much to read!\n\n\nI'd much rather make wild assumptions based on a click bate headline... Are you new here or something? That's why I come to the comments to tell me what to think!", "label": 0}
{"text": "I know what you mean. I am on my second watch of it. Saw it the first time it came out in 2023. Waited an entire year purposely. I think it’s OK. The first half was absolutely chaotic and all over the place. Each child dying per episode like a whodunit was exhausting. But the back half I thought was much better once the reveal took place. I think it’s maybe the second best of his works on Netflix honestly. He will never capture the utter magic of the haunting of Hill House. That was in its own category.", "label": 0}
{"text": "Supernatural", "label": 0}
{"text": "Haha. I say I'm immortal yet here I am at 59 laying in a hospital bed going on 5 weeks now. Caudia equina syndrome. Fucking brutal to go from paddling across lake Superior to laying on my back \nPlay while you're young buddy. Protect your spine at all cost.", "label": 0}
{"text": "Both Nicole Kidman's efforts to create opportunities in Hollywood and the 18th-century English aristocracy's patronage can be seen as self-serving actions that primarily reinforce their own influence and status. This approach may offer limited and superficial benefits, perpetuating existing inequalities and dependency rather than fostering meaningful systemic change.", "label": 0}
{"text": "Better than Walker, at least.", "label": 0}
{"text": "I miss the original Teen Titans", "label": 0}
{"text": "I wonder how the hat stays on when he’s swinging around", "label": 0}
{"text": "Chef's Kiss", "label": 0}
{"text": "You just didn't read what OP wrote:\n\n\" It could be a show that is criticized by a lot of people, have low ratings on IMDB, Metacritic, etc. Or it could be a guilty pleasure.\"", "label": 0}
{"text": "Again, you just assume anyone voting 1 is a troll and not someone who genuinely didn't like it and is trying to impact the average. Funny how you don't say anything about the over abundance of 10's relative to every score but 1 though, I guess anything to keep the TROLLS VOTE BOMBING narrative going. It's almost as if culture war zealots on both sides could be spamming unjustified reviews but that's unfathomable.\n\nThe show was mid, stop acting like the fact it's rated mid is proof of anything other than it being mid, there's nothing wrong with that and crying about trolls as if they've made a difference to a mid show getting a mid rating is daft.", "label": 0}
{"text": "Okay", "label": 0}
{"text": "Sadly the more serious action oriented cartoons are very expensive to make and in the current day where toy sales aren't what they used to be its very hard to financially justify making a show like Young Justice.", "label": 0}
{"text": "Read the article, it’s the stunt double.", "label": 0}
{"text": "I recently got into wrestling again after a 20 year hiatus. I watch both AEW and WWE and I'm getting a little bit of Attitude Era vibes now.", "label": 0}
{"text": "The common thread in a lot of shows with overlapping actors is the executive producer and or director.  This is true in the case of Scrubs and Spin City.  People form relationships and like working with each other.", "label": 0}
{"text": "Finally, some good fucking food.", "label": 0}
{"text": "5 appearances isn't too shabby.  I don't remember her though", "label": 0}
{"text": "His longest serving chief of staff called him a fascist. A former general. He knows a thing or two more than you about that term.\n\n\nYeah remember when he said mexico will pay for the wall.?\n\nAlso yeah believe him when he says something. He said he grabs women by their genitalia and he raped a women. \n\n\nAt this point my man you're willfully ignorant.  But it's ok. It's a free country... So far.", "label": 0}
{"text": "Since this is staring Nick Cage, is this supposed to be the literal Spider-Noir from the spider-verse movies? Or is this just an adaptation of the Spider-Man: Noir comic?", "label": 0}
{"text": "Wrestling has been a lot better since Vince left.", "label": 0}
{"text": "It’s fitted!", "label": 0}
{"text": "As somebody who is half Mexican, I can attest that Mexicans really know how to throw a party and have a good time. I always have an over the top good time when I visit my Mexican side of the family.", "label": 0}
{"text": "\"Unlimited (karma) power!!!\"", "label": 0}
{"text": "Cage is a one of the biggest Hollywood comic book fans outside of Del Toro, so I bet this is a huge kick for him.", "label": 0}
{"text": "I just assumed he would apply a little bit of webbing every two hours or so.", "label": 0}
{"text": "so she's.... making movies better?! hell yeah", "label": 0}
{"text": "This is the most refreshing taking I’ve seen, coming from someone who likes the show and my kids love it lol. I thought it’s been nice to see it be appreciated but it’s always love or hate with this show so your take was a different one I’ve seen", "label": 0}
{"text": "**resident alien** \n\nOnly first two seasons are out where I am and wow this show is underrated. Alan Tudyk is at his best and every line is hard not to laugh at", "label": 0}
{"text": "Chris Rock was let go because his salary was too expensive, and Sarah Silverman was let go because she didn’t fit in with the “boys club” that was the snl staff. In Shane Gillis’ case he was fired before appearing on the show because of a racist joke he made, not for being unfunny on snl.", "label": 0}
{"text": "What are the chances it’s actually Nicolas Cage under the costume? I bet it’s like in Mandalorian where they’ll use a double and Cage will only do the voiceover.", "label": 0}
{"text": "Is there hole at the top of his mask so the hat is stuck to the skin? Otherwise the hat sits on the mask. Does the stickiness go through the outfit?", "label": 0}
{"text": "Season 2 every bit as good as Season 1 so far", "label": 0}
{"text": "All they had to do was just make him look like his comic book counterpart and that's exactly what did. \n\nGood job.", "label": 0}
{"text": "That is unfortunate.", "label": 0}
{"text": "Stitched into his mask!", "label": 0}
{"text": "That’s frickin baller 🔥🔥🔥🔥", "label": 0}
{"text": "I feel like other than some animated stuff Japan really churns out a lot of low quality garbage.  I think the newest love action thing I've liked has been Battle Royale (the first, NOT the sequel) and some good horror stuff.   There's probably been more it's just that they're few and far between.\n\nStill good for some corny/camp stuff though.  Robogeisha will always have a special place in my heart.", "label": 0}
{"text": "No, this is supposed to be Ben Reilly. Whereas the version in Spider-Verse was Peter Parker", "label": 0}
{"text": "Thanks for your time and reply!", "label": 0}
{"text": "That’s why I’m asking. Or is this something we just don’t talk about?", "label": 0}
{"text": "It's not skin. It's radiation that makes him sticky. Originally Peter Parker had no \"spider-powers\". He was made radioactive and that made him super strong and also very staticky. Because that's how comic book radiation works.\n\nHe called himself Spider-man after he got his powers, not after the powers themselves.\n\nIt's only much later did he get all literally spidery.", "label": 0}
{"text": "Definitely possible, though I’d fall back on Gwen’s banter with the Vulture variant in the museum where she says something like “let me guess, you were sipping espresso in some old timey Leonardo DaVinci dimension…” and he responds with “yes, that’s pretty much it.”", "label": 0}
{"text": "It is [rumoured](https://www.whats-on-netflix.com/news/terminator-zero-renewed-for-a-second-season-at-netflix/) to have been renewed in a leak by a Netflix Latin America social media account. \n\nAs for Tomb Raider? This renewal means nothing. It was given a two season order upfront. It missed making the weekly ratings charts so it is 100% cancelled after that initial 2 season run they ordered is over.", "label": 0}
{"text": "I’m not comics expert but I figured the sticky was always going through clothing.", "label": 0}
{"text": "Heartily agree, have rewatched the series several times and its one of my favourites along with POI.", "label": 0}
{"text": "That is so sad. I have actually heard driving in Hawaii is super dangerous before, but i have never been there so its only from friends that traveled there.", "label": 0}
{"text": "What’s the details here? Is this a tape he took of someone without their consent and is being sued for 12 million?", "label": 0}
{"text": "Good, please be quiet though. thanks haha", "label": 0}
{"text": "Oh I remember that! He’s so sweet", "label": 0}
{"text": "**Elsbeth** -  Was a big fan of Good Wife and Good Fight, but this just isn't working for me. The format is so boring and I miss the serialized/satire of its predecessors. I was hoping that season 2 would refine things, but I think I'm out.\n\n**Penguin** - Definitely my favorite show on at the moment.\n\n**Agatha All Along** - feel like the plot's barely decipherable. Looking forward to this wrapping up after a strong start.\n\n**What We Do in the Shadows** - so great to have this back! I'm going to miss it when it's over.\n\n**Only Murders in the Builiding** - Thought the season was shaky at times, but have really enjoyed these last three episodes.\n\n**Love is Blind season 7** - this season has been so boring/most of the cast is really unlikable.", "label": 0}
{"text": "Is I wasn't an accident I might have feelings. \nNo one will care my if I die, thank you", "label": 0}
{"text": "4 or 5 the production cost balloons. Those shows are short mainly because they cost a lot just to exist to make them look good.", "label": 0}
{"text": "Shrimps and prime rib!", "label": 0}
{"text": "Why is Tomb Raider relevant right now?     \n\n-------------------   \n   \nTomb Raider    \nTom Brady   \nTom Brady part-Owner of Raiders   \nBrady Evidence", "label": 0}
{"text": "Potential all time best player ever (Ohtani), vs a generational all-star (Judge) on the largest market teams in their respected leagues...\n\nWorld Series is going to shatter records.", "label": 0}
{"text": "Less Americans would have died under any other president than that piece of shit.", "label": 0}
{"text": "I have *literally* done that before, so no shade! Just thought you'd want to know ;)", "label": 0}
{"text": "I didn’t watch a ton of the show, it was too “zany” I guess. none of the characters felt genuine", "label": 0}
{"text": "Personally I'm glad as hell those shows are dead. But opinions are opinions.", "label": 0}
{"text": "“What’s your ‘big beef’ with Nazis?”", "label": 0}
{"text": "People are saying Lara looks like a man and are calling her \"Larry Croft\". \n\nThey're also mad a character that had previously been known to stalk women who for some reason people are describing this behaviour as \"being a ladies man\" now has a boyfriend because apparently Bi people don't exist.", "label": 0}
{"text": "People tuning in to see how  bad she does.", "label": 0}
{"text": "Thankfully there were ways to not have wasted your time, such as not going several comments deep into a thread about celebrity gossip.", "label": 0}
{"text": "Julie Bowen has been my dream girl since Happy Gilmore. Nothing has ever challenged that, and I’ve seen plenty of things to support it.", "label": 0}
{"text": "I want you to know that I NEED Kung Pow 2", "label": 0}
{"text": "Man, I love The Batman. I was fully expecting to hate Patterson but he played that depressed and brooding year 2 batman so well.", "label": 0}
{"text": "But Harris isn't anywhere near being a communist... Listen to what she actually says, not just what Fox News tells you that she says. They haven't stated any actual communist talking points. \n\nNo,  I don't care about trans people using the bathroom. Everyone's gotta pee. They have stalls for a reason. Are you also afraid of men going into your son's bathroom? \n\nAnd she's not going to take away your guns just like Biden/Harris haven't taken away your guns these past 4 years. Just like Obama hasn't taken away guns when fear-mongerers kept swearing he would.  \n\nHarris and Walz both own guns, too. (Plus Trump is legally barred from owning a gun.) Every 4 years, Republicans keep panicking about guns being taken away if a Democrat wins, and it's never happened.\n\nI'm not sure what you mean about your right to search..? If you mean your right *from* unreasonable, warrantless searches, then let's start with getting upset at the party that constantly defends police when they perform illegal searches.", "label": 0}
{"text": "I fully support win-win situations.", "label": 0}
{"text": "People learned during COVID that, en masse, they can pick and choose which laws to ignore. Harmonious society has always taken a degree of self-policing and people just won't do that anymore. I truly believe we are the approaching the end stages of what an extremely individualistic society looks like.", "label": 0}
{"text": "The even more surprising part about Fringe is that the main creative leads completely fail to recreate that level of \"making it up as they go\" in their future endeavors. JJ Abrams... nuff said. Alex Kurtzman should be sent to directors jail for his recent output (sans Strange New Worlds). Roberto Orci has had a thoroughly meh career post-fringe. Jeff Pinker worked on such works such as Citadel, Zoo, and Cowboy Beebop. And J. H. Wyman hasn't had a show run past a season since Fringe.", "label": 0}
{"text": "I say this all the time to my husband and dog lol", "label": 0}
{"text": "He was actively crazy while shooting the show; I think part of why he played it so well is that he thought it was real", "label": 0}
{"text": "You don’t need to agree with Hemingway nor even believe his prose is particularly unique. \n\nBut you can’t deny his role in pop culture, literature, art and adventure travel. He truly lived his best life despite being plagued by his “black ass.” His depression or anxiety or mental illness of some type stalked him yet he fought it and produced. \n\nIn the end it won. \n\nBut he fought it hard and for that he has earned his respect.", "label": 0}
{"text": "I enjoyed Noir in the spider verse and I like Nick Cage but I didn’t really enjoy the character in the comics. Just not a big fan of the 1930s detective genre as a setting. I know some people like it but with limited films that can be made this doesn’t really excite me all that much.", "label": 0}
{"text": "They still took the time to look at it.\n\n\nSpeaks volumes about a person.\n\n\nFor instance, I would never care enough to look at something like that. If someone's opinion upset me... I would either debate their points or move on. \n\n\nNot worry about where they post on reddit and then try to insult them...\n\n\nSeems like a petty, sad, and honestly pathetic thing to do, FWIW.", "label": 0}
{"text": "Wynona Earp", "label": 0}
{"text": "Thanks lol I think a lot fans of the original series tend to forget this show wasn’t made for them. Being the longest running series clearly proves it has fans and they’re not to be discounted just because they don’t carry nostalgia for the original", "label": 0}
{"text": "Remember when they constantly joked about Sanjaya?", "label": 0}
{"text": "Thankfully I’m in a subreddit whose content and usership I generally enjoy, and where derisive dipshits with little else to add, like yourself, are mercifully scarce.", "label": 0}
{"text": "Ha ha I appreciate it and no shade felt :)", "label": 0}
{"text": "You should try 12 Monkeys!", "label": 0}
{"text": "I just assume that somewhere, there’s a comedic genius waiting to be discovered whose name is “Short Steve” and who will one day complete the trifecta.", "label": 0}
{"text": "go take care of your mental health instead of spamming then lol", "label": 0}
{"text": "Wait has there been new seasons???", "label": 0}
{"text": "To be honest he strikes me as the kind of guy that would suit up where the scenes allow", "label": 0}
{"text": "Watching fringe as I type this lol. Great show", "label": 0}
{"text": "Hope this is true - but the tweet could have been deleted because labelling it as having a season 2 might have been an error", "label": 0}
{"text": "It's been a while since I watched but players were typically just cameos and otherwise, the characters often said stuff like \"Marshawn Lynch has been great for the Seahawks! He put up the most points/yards for a running back 3 games straight!\"\n\nBasically, you could tell within the context of the scene. Sometimes it was pretty heavy handed.", "label": 0}
{"text": "I highly recommend listening to Martin Shorts Memoir. I gained a much deeper love and respect for the guy, great storyteller and greater human.", "label": 0}
{"text": "Sasha and Morgan were my favorite parts too.  And Esther.", "label": 0}
{"text": "Tomb raid is basically female Indiana Jones with the supernatural tuned to 10.it should be extremely easy to work with that premise if you are a good writer. There are so many cool myths you can explore and have 10 different story lines. It's not difficult.", "label": 0}
{"text": "I miss having downtime in the stories. I feel like with shorter series there's no release or chance to just hang out with the characters.", "label": 0}
{"text": "Yeah... isn't she frequently drunk with Hoda on the Today's show?", "label": 0}
{"text": "And twilight of the gods, terminator zero and exploiting kittens???", "label": 0}
{"text": "Audience scores is something I don't pay super close attention to. Except when it aligns with my viewpoint. \n\nBut mostly jokes aside, I find audience reaction can be manipulated by brigading and folks with agendas. And sometimes it does feel like the reaction from actual audiences. It's context is important. \n\nI don't think Tomb Raider is any worse than the Netflix Castlevania series in quality for instance. But there is more of an agenda driven audience reaction by Tomb Raider.", "label": 0}
{"text": "As good as Justified season 1 was, she elevated season 2 beyond my expectations.", "label": 0}
{"text": "I you like the show, yes. 5 times on the show meant she could rough it out and deal with starvation in the elements. With all the bugs and sun, etc.", "label": 0}
{"text": "I never understood how that works if his suit is over his fingies though", "label": 0}
{"text": "> or even worse hate-watch something\n\nHate-watching something also produces the opposite effect that it intends.  You don't tell Netflix \"This is bad, cancel it\".  You're telling them \"I'm willing to watch this\"  Views count more than ratings.", "label": 0}
{"text": "She was on Andy Richters podcast recently and was very funny!", "label": 0}
{"text": "Yeah that's only in Virginia", "label": 0}
{"text": "Two huge market teams with generational players?\n\nMLB salivating at the upcoming ratings for this thing.", "label": 0}
{"text": "It sounds like she going down the same road as Mama June.   I hope she gets help before her drug use gets worse.   The children are the only one that will pay for her bad decisions.  Does she want that bum Michael to get custody?", "label": 0}
{"text": "Lmao I still can’t believe Obama took Luther to a correspondence dinner irl.", "label": 0}
{"text": "> People are saying Lara looks like a man and are calling her \"Larry Croft\".\n\nIs that just because she has noticeable (but not exaggerated) muscles in her harms? What did they expect of a girl that would put most olympic gymnasts to shame? 🤔\n\n> They're also mad a character that had previously been known to stalk women who for some reason people are describing this behaviour as \"being a ladies man\" now has a boyfriend because apparently Bi people don't exist.\n\nFrankly I didn't even notice that, or maybe I just didn't get to that episode yet. :) I've no idea who he is because I'm not into games - but Lara's black friend with little dreadlocks sounds gay-ish. Oh, I just googled it and yes, it's him, the Zip guy.\n\nIn that case, maybe if I had played the games that would bother me. ^_^", "label": 0}
{"text": "Don't see how they can adapt the comic since they can't use any other MCU characters. They'll be doing their own thing, I suppose. Hopefully Noir Morbius will be in it. It's Noirbin' Time!", "label": 0}
{"text": "And Norm MacDonald, who does a famous impression of Turd Ferguson on SNL also played Little Chubby.", "label": 0}
{"text": "Close, one of the brothers who becomes an NBA agent gets kidnapped while in Europe and held for ransom, and Dan along with the brother’s brother in law and someone who tried to sleep with his wife bust him out. \n\nDan ends up getting shot in the process and eventually dies in a hospital, where he is taken to the afterlife by Keith who forgives him.\n\nThe scene itself is very poignant but it’s a far departure from where the series began.", "label": 0}
{"text": "I've heard about this for ages.... and I always assumed it was an animated move.", "label": 0}
{"text": "Calling this show \"woke\" is so funny to me, lol. Y'all really will just call anything you don't like \"woke\" to the point of the word being meaningless.", "label": 0}
{"text": "I fucking *love* Riverdale. It's the worst show I've ever seen, and that's what's so great about it.\n\nI think my favourite moment is the cult leader who escapes the FBI using a fucking Wile E Coyote rocket while dressed like Elvis. Or Cheryl's bee cult. It's called like... Our Lady of Perpetual Honey or something, fucking *lol*.\n\nIt reminds me a little of The Room - it's definitely the sort of bad that is *so* hilariously entertaining. I'm kinda surprised that there isn't a bigger cult following that watches it for the same reason people watch The Room. Though I will admit that there are a *lot* of filler episodes, so that certainly doesn't help things. Maybe someone should edit together an abridged version of Riverdale. That'd be awesome.", "label": 0}
{"text": "Mate the prompt is “bad show”. The Office is not known as a bad show.", "label": 0}
{"text": "Need those first 2 renewals stat", "label": 0}
{"text": "Suits ended years ago", "label": 0}
{"text": "Watch those AAA animes. Or Arcane or something.", "label": 0}
{"text": "It was pretty good, but IIRC there were very few DCAU references, which was disappointing. Most of the \"universes\" involved were made up for the movie, and the few that weren't made up were ones that I didn't care about.\n\n[This](https://youtu.be/XHLI6Vyr90g?si=4Xi9o7t3m6fSv0pC&t=57) is still the best Teen Titans/DCAU crossover.", "label": 0}
{"text": "Gary deserved his comeuppance. He backed Selina doing all those shitty things.", "label": 0}
{"text": "“Hi Im Richard T. Splett, I don’t know why I said T my middle name is John’", "label": 0}
{"text": "I'm like 90 episodes into House lol. Just finished Bones a while back. Up to date on NCIS as well. I like to the long running procedurals. They should definitely make a comeback. \n\nThe new shows are higher quality, but they're short and often get cancelled (looking at you Netflix).", "label": 0}
{"text": "My massage therapist has done wonders on me. It's a night and day difference in how it was before. Dr. just made the pain go away with addictive drugs. Now able to function way better with no horrible side-effects.", "label": 0}
{"text": "I’ll always contest that her and Regis did have great chemistry… \n\nBut, gosh darn it was she a terrible ignorant, thoughtless drunker than a person.\n\nAnd that kid of hers and that football husband, so boring, tedious and obnoxious. \n\nMet her a few times over the years and my goodness those people that don’t even know what they’re saying, except that they want to hear their own voice…", "label": 0}
{"text": "Dude I think I need to watch One Tree Hill now", "label": 0}
{"text": "Sometimes it's 10 episodes, sometimes it could be 6! And none of them will have the same episode run time.", "label": 0}
{"text": "I started Kaos late.  The more I watch it, the more pissed off I get that it was already canceled", "label": 0}
{"text": "I love Star Trek. I prefer the standalone episodes. I like to see what cool new sci fi stuff they come up with. The overarching plots are okay, but I watch Star Trek for the sci fi elements, not the species drama.", "label": 0}
{"text": "Lol I can hear in my head the “kiss my ass!”", "label": 0}
{"text": "> Well, let's take a peek at the metacritic user reviews which include reasons:\n\nYou're literally comparing the most engaged users who are going to be those either negatively or positively addressing a thing to anyone who hits a star rating. It's not clear evidence of anything but what people who specifically go out of their way to write reviews for something they're emotionally invested in think. Newsflash: most people don't put that much effort into caring about a thing.\n\nIt's always the mediocre to shit properties getting this *HATE CAMPAIGN* defence because anything that's actually good does well. [Here's the Castlevania show for comparison,](https://imgur.com/a/Ln5lo65) made by the same people, has plenty of strong female characters with complex motivations, hell the entire final season is literally a coven of vampire women as the main antagonists and it was great and has outstanding reviews. It's almost as if strong female leads aren't the problem and bad writing is.", "label": 0}
{"text": "Comics aren't known for perfect consistency either.", "label": 0}
{"text": "She doesn’t open up at all", "label": 0}
{"text": "Wow. I'm sure he feels better after noon appearing in the second Spider-verse movie. Huge win for us too.", "label": 0}
{"text": "Yooo that looks sick. Happy for him.", "label": 0}
{"text": "Down in my *plums*", "label": 0}
{"text": "Don't feel bad. Apparently the commentor ran for Congress as a Republican. Logic doesn't exist to him.", "label": 0}
{"text": "How do you think one would go about eating a melon carved to look like a co-worker that abruptly quits?\n\nDo you just stare at it? Start from the back of the head? Go right for the cheek meat?", "label": 0}
{"text": "Chin strap.", "label": 0}
{"text": "> I still feel mostly \"invincible\"\n\nI pose this question to you and anyone else who feels this way. How? I have been aware and worried about my own mortality since I was young. I've never once felt like I was \"invincible\" or never had a feeling of I'm never gonna die. \n\nI'm the complete opposite of you. I feel like a ticking time bomb. Like, any minute my life could end. It doesn't hinder my life or anything but it is a constant thought in the back of my head and whenever I see shit like this where a young woman dies in a car crash or that boy band dude falling off a balcony, it just reminds me how fragile life truly is.", "label": 0}
{"text": "> Because if you use your brain for 5 seconds, the exact same labels can be applied towards people you like just as easily. \n\nYou mean what has been called the deep state and fake news for the last 8 years ?", "label": 0}
{"text": "Didnt make it past ep 3", "label": 0}
{"text": "I expected no less different seeing that this episode was directed by (crazy) Joe Davola.", "label": 0}
{"text": "https://youtu.be/Gk3TxOnqyCA[https://youtu.be/Gk3TxOnqyCA](https://youtu.be/Gk3TxOnqyCA)", "label": 0}
{"text": "> it did have potential for higher \n\nDid it? I mean it could've been a bit better, but let's not pretend Tomb Raider is some crazy awesome IP that's just ripe for epic storytelling. Even the recent survivor trilogy, while good games, aren't that well-known for their narrative or characters.\n\nThere's a pretty solid upper limit for how good a Tomb Raider movie/show can be, in my opinion. The Netflix show falls below it but not by much.", "label": 0}
{"text": "Uhhh ohhhhhhh!", "label": 0}
{"text": "Charles Boyle", "label": 0}
{"text": "> You're literally comparing the most engaged users who are going to be those either negatively or positively addressing a thing to anyone who hits a star rating. It's not clear evidence of anything but what people who specifically go out of their way to write reviews for something they're emotionally invested in think. Newsflash: most people don't put that much effort into caring about a thing\n\nSo first you say that all the 1 star reviews aren't overwhelmingly chuds because how could we know, and when I provide evidence of that claim you're now saying that ALSO doesn't matter because it doesn't account for everyone who didn't write a review? OK man, have a good one.", "label": 0}
{"text": "Martin seems like a lovely guy, i could definitely see someone falling for that", "label": 0}
{"text": "I believe Rami's movie had a quick close-up of the grippy hairs poking through the fabric of the suit around his *fingies*", "label": 0}
{"text": "If i recall correctly, spidermans actually one of the few comic books cage doesn't even read all too much.\n\nIm sure he went hard to learn for the role, but im pretty sure he even said he has no idea who Spider Noir was before he was offered the role.", "label": 0}
{"text": "I can't find the article anymore but I'm pretty sure it was 2016.", "label": 0}
{"text": "\n\nfind documentaries about Nat'l Lampoon... they'll have interviews with all the OG writers.. think of the guys who wrote the iconic SNL bits.. Belushi era. \n\n\n\n>Conan O'Brien\n\never watch a \"straight\" interview with him? he's *smart.*\n\n\n\nHe served as president of [*The Harvard Lampoon*](https://en.wikipedia.org/wiki/The_Harvard_Lampoon) while attending [Harvard University](https://en.wikipedia.org/wiki/Harvard_University), and was a writer for the sketch comedy series [*Not Necessarily the News*](https://en.wikipedia.org/wiki/Not_Necessarily_the_News)...     and SNL and the Simpsons.\n\n  \nHe said (basically) SNL was very hard, but very fun... if you can write for SNL.. you'll be OK.\n\n\n\n[https://en.wikipedia.org/wiki/National\\_Lampoon\\_(magazine)](https://en.wikipedia.org/wiki/National_Lampoon_(magazine))\n\nThe magazine was a springboard to the [cinema of the United States](https://en.wikipedia.org/wiki/Cinema_of_the_United_States) **for a generation of comedy writers, directors, and performers.** Various alumni went on to create and write for [*Saturday Night Live*](https://en.wikipedia.org/wiki/Saturday_Night_Live)*,* [*The David Letterman Show*](https://en.wikipedia.org/wiki/The_David_Letterman_Show), [*SCTV*](https://en.wikipedia.org/wiki/Second_City_Television), [*The Simpsons*](https://en.wikipedia.org/wiki/The_Simpsons), [*Married... with Children*](https://en.wikipedia.org/wiki/Married..._with_Children), [*Night Court*](https://en.wikipedia.org/wiki/Night_Court), and various films, including [*National Lampoon's Animal House*](https://en.wikipedia.org/wiki/Animal_House), [*Caddyshack*](https://en.wikipedia.org/wiki/Caddyshack), [*National Lampoon's Vacation*](https://en.wikipedia.org/wiki/National_Lampoon%27s_Vacation), and [*Ghostbusters*](https://en.wikipedia.org/wiki/Ghostbusters). The characteristic humor of [*Spy*](https://en.wikipedia.org/wiki/Spy_(magazine)) magazine, [*The Onion*](https://en.wikipedia.org/wiki/The_Onion), [Judd Apatow](https://en.wikipedia.org/wiki/Judd_Apatow), [Jon Stewart](https://en.wikipedia.org/wiki/Jon_Stewart), and [Stephen Colbert](https://en.wikipedia.org/wiki/Stephen_Colbert) is difficult to imagine without the influence of *National Lampoon*.[^(\\[3\\])](https://en.wikipedia.org/wiki/National_Lampoon_(magazine)#cite_note-Wayne-3)\n\n\n\n>One thing I marvel at is Mystery Science Theatre, in that they make it look like effortless riffing when they must be watching these films 30 times and stepping over one another in trying to make the best jokes.\n\nthey have all the time in the world to write those.\n\n\n\nyou have 3-4 days to write an SNL episode.  similar to having to write a cold open based on THAT DAYS news for the late night shows.", "label": 0}
{"text": "Tell me you know nothing about the economics of making media.", "label": 0}
{"text": "Cage is a coinflip, but his comedy roles have always been spot on imo. If they keep the tone of Spiderverse, this will be a success.", "label": 0}
{"text": "Haha nooo there's a shot like :19 in on the season 2 date announcement vid that shows Helly crawling through the goat hallway.", "label": 0}
{"text": "American Werewolf in Paris (97) builds on Bowen crushes", "label": 0}
{"text": "The spider man 1 (movie) explanation is unironically probably the most simple explanation for it, even if its debatable whether thats canonically accurate. \n\nBasically microscopic hairs that would enable him to climb on objects. I think the comics themselves actually dont go too indepth into it.", "label": 0}
{"text": " WHERE’S HIS GUN", "label": 0}
{"text": "Yes, best pirate show ever made imo", "label": 0}
{"text": "As in real life or their characters?", "label": 0}
{"text": "> So first you say that all the 1 star reviews aren't overwhelmingly chuds because how could we know, and when I provide evidence of that claim you're now saying that ALSO doesn't matter because it doesn't account for everyone who didn't write a review?\n\nNo, I'm saying comparing people who leave a star review to people writing diatribes isn't a fair comparison because of the level of engagement but hey heaven forbid you actually respond to what I said.", "label": 0}
{"text": "still bothers me why he refuse recasted as ghostrider on deadpool & wolverine. blade & ghostrider would've bounce of each other", "label": 0}
{"text": "Haha just had one call my phone I'll check it out hbo has great shows : sorpanos obviously , the wire , GOt , true detective , Barry , the deuce , the last of us ,", "label": 0}
{"text": "Yeah, he's a real actor. Dude's going to want to be in that suit", "label": 0}
{"text": "Read her damn dad’s book!!!!! Listen to her statement going forward. It’s communism.  You’re obviously too young to remember that Russia said USA won’t fall from outside but inside. Look at all the thugs she let cross the border.  She’s communist through and through. She has so many people totally brainwashed. Are you actually better off than you were 4 years ago???? I’m not. I had to come out of retirement to work to try and survive.", "label": 0}
{"text": "Yep. Or.\n\nOR.\n\nYou just made a bad call.", "label": 0}
{"text": "Thing is that it's not even a major plot point in the games and he's never called a \"ladies man\". There's a thing in his bio where it's mentioned he stalked ex-girlfriends. That's it. \n\nSomehow stalking ex-girfriends turned into \"ladies man\"", "label": 0}
{"text": "Does Selena’s acting get any better? I really wanted to like this show but i couldn’t even get past the second episode. Her acting is so atrocious.", "label": 0}
{"text": "Christopher Moltisanti", "label": 0}
{"text": "Make it where she kills people that annoy her and I'm in", "label": 0}
{"text": "Oofa.", "label": 0}
{"text": "The algorithm decided that this wording works well for klicks.", "label": 0}
{"text": "Another thread filled with salty fanboys lmao. I for one am looking forward to it because I give 0 fucks about the game.", "label": 0}
{"text": "Hope we get more rom com shows like this. It was funny but not heavy handed and also charming thanks to Kristen Bell and the other actors. They really did a great job with the casting. Both pairs of siblings and Esther were great.", "label": 0}
{"text": "Yeah I mean she has like two memorable sketches? I don't think she got enough screen time to really develop.", "label": 0}
{"text": "thanks for this!!", "label": 0}
{"text": "*Donkey Kong starts pummeling Yoshi in a field of flowers*", "label": 0}
{"text": "Round and Round was one of the best Hallmark movies I’ve watched", "label": 0}
{"text": "Or perhaps you’re just a dork.\n\nGet over it.", "label": 0}
{"text": "Is that character actress Margo Martindale?", "label": 0}
{"text": "Looking at your comments there's no way possible I could provide you with an answer that makes you say \"you're right\" so you can just pretend you win this one and I'll move on away from your negativity. I'm sure you want the last word here so go ahead.", "label": 0}
{"text": "I hope it’s like Sin City", "label": 0}
{"text": "Suits was the top streamed program last year.", "label": 0}
{"text": "Hard to argue with that. It has Kevin Conroy’s Batman, after all. ", "label": 0}
{"text": "Lord and Miller left their Sony deal over this show.  They were upset about the budget.  We don't know if it was too high or too low but either way that's odd.", "label": 0}
{"text": "I can’t believe I watched that show sometimes, lol.  😂", "label": 0}
{"text": ">Looking at your comments there's no way possible I could provide you with an answer that makes you say \"you're right\"\n\nYes, because YOU CAN'T PROVE IT, I'm not here saying they're absolutely not chuds I'm saying you can't prove it so claiming it either way is just an ignorant assumption based on your preconceived notions. They very well could entirely be chuds but it doesn't seem reasonable in respect to the quality of the media. Sorry being told \"don't make claims you can't justify\" is so offensive to you. I didn't win anything there's nothing to win here, I'm just trying to highlight how you're just making shit up if you argue either way without proof. \n\nSorry you're so offended by being expected to justify your position with consistent logic. Heaven forbid you just say \"well i think it's likely this is just bad faith reviews but I can't prove it so claiming it isn't justified\" that's a perfectly valid statement and I wouldn't challenge it at all.", "label": 0}
{"text": "Epic post.", "label": 0}
{"text": "Elementary was SO good, still one of my favourite shows ever. Such a good comfort watch.", "label": 0}
{"text": "Ok, so this isn't as bad as i thought", "label": 0}
{"text": "Yeah, AEW storylines kinda suck right now, but the wrestling makes up for it. If there's a Takeshita, Ospreay, Ricochet, Swerve, or Omega (among many others) match on the card, I'm watching it.", "label": 0}
{"text": "So many abusers and so many victims. Maybe it’s time Hollywood dies off.", "label": 0}
{"text": "Thanks for reminding me, I gotta finish cleaning lady! \n\nThere was an older show somewhat like it called [Spotless](https://youtu.be/mrWahn_MSjE?si=OMwjtDTW09cLnbnX) about a guy that cleans crime scenes professionally for the police. He gets hired by mobsters to make certain murders look like accidents. It was pretty good.", "label": 0}
{"text": "If the showrunner says it, then I believe him.", "label": 0}
{"text": "Cage voiced Spider-Man Noir in Into the Spider-Verse back in 2018.\n\nSo he probably had some idea before he was offered the role.", "label": 0}
{"text": "Mr Bates vs The Post Office if anybody is into \"docuseries\". A story about UK post office operators who got screwed over by HQ. Heartbreaking, well-acted 4-episode ITV miniseries. My favorite new show this year.", "label": 0}
{"text": "Man is that s good looking suit 😘 ", "label": 0}
{"text": "Surprise, surprise. People on this sub are pedantic losers. Who knew? I suppose even people like you need a place where you fit in.", "label": 0}
{"text": "It's just something that happens to the body when shaken!", "label": 0}
{"text": "https://www.indystar.com/story/news/crime/2022/06/17/car-crash-death-indianapolis-police-reckless-homicide-charges/7662741001/\n\nThis shit is everywhere nowadays, local example above. You can kill *multiple* people in obviously reckless, distracted, or drunk driving and still keep driving around free. She doesn't have epilepsy, she's just an asshole who habitually speeds and runs stop sights and stop lights, but she keeps getting released. The last kill was over two years ago and they haven't even had a trial for it yet. Presumably, she's spent that time driving around town. \n\nThe reality is many American cities have essentially surrendered the notion that people who kill others on the road should be taken off the road.", "label": 0}
{"text": "You have no idea what communism is.", "label": 0}
{"text": "~~Speedforce~~ Spiderforce", "label": 0}
{"text": "I haven't watched much Japanese cinema in a decade, and I kind of agree with you in that on average the quality feels lacking in the modern era. There seems to be a distinct lack of budget available to Japanese filmmakers, which leads to very cheap looking movies and shows, and their storytelling in general just doesn't seem to hit the highs of previous eras when they had iconic directors like Kurosawa (both of them), Miike in his crazy prime, Kitano, etc.  \n\nTheir last two Godzilla movies were excellent though.  \n\nMeanwhile Korea is *still* riding a high that they kicked off in the early 2000s. Even when their movies and TV shows have low budgets their creativity is insane, both stylistically and narratively. Hell, even their reality TV is great.  \n\nWhen people sometimes recommend me Japanese stuff like the live action Rurouni Kenshin movies or Kamen Rider TV shows, I look at them and I'm like \"am I crazy or is this shit actual garbage?\".  \n\nOh well, they're still the best when it comes to animation at least.", "label": 0}
{"text": "I was trying to think which is my favorite episode and I gotta say, I think I actually have enjoyed each equally!", "label": 0}
{"text": "He's very mercurial. That's why we all love him.", "label": 0}
{"text": "Abusive relationships aren't something unique to Hollywood.", "label": 0}
{"text": "This and the looking both ways even if it’s green seems impossible to follow. There’s already so much stuff to remember and pay attention to while driving", "label": 0}
{"text": "Sooooo meaty", "label": 0}
{"text": "That movie had an absolutely stacked cast.", "label": 0}
{"text": "There's the link. Its from\nA Stanford study.  \n\nhttps://med.stanford.edu/news/all-news/2024/08/massive-biomolecular-shifts-occur-in-our-40s-and-60s—stanford-m.html", "label": 0}
{"text": "Sohei Dojima is the head of the Dojima family that they robbed.", "label": 0}
{"text": "They're referring to before he was ever cast as Spider-Man Noir...so before Into the Spider-Verse.", "label": 0}
{"text": "God damn that was six years ago!?!?!", "label": 0}
{"text": "I have faith that Lindelof is a better person now, he responded to this in a pretty respectful way, and he also did stuff like making sure to assemble a diverse writers room for Watchmen in order to accurately represent people who weren’t him. Cuse basically denied the accusations and said nothing else, which I feel is quite telling. \n\nAlso I do think Whedon is worse - he also slept with a lot of people he shouldn’t have in addition to being a shitty boss. ", "label": 0}
{"text": "If Jim and her kept having problems, I could see it happening. But Jim valued her more than Roy ever did and saw the problems and jumped in to fix them", "label": 0}
{"text": "The writers had a vision and they saw it through to its natural conclusion. Have to respect it.", "label": 0}
{"text": "This is a political theory derived from Karl Marx, advocating class war and leading to a society in which all property is publicly owned and each person works and is paid according to their abilities and needs.", "label": 0}
{"text": "they should’ve adapted Yakuza: 0. That’s the only one with a good story, rest are too wacky.", "label": 0}
{"text": "Its…its beautiful.", "label": 0}
{"text": "Honestly, you could have been a huge fan and still not. It was a side book in a completely different publishing line.", "label": 0}
{"text": "You just earned yourself a trip to the testing floor.", "label": 0}
{"text": "If you want a real treat, watch Three Amigos. Short, Martin, and Chase. Total 80s dream team.", "label": 0}
{"text": "If you never stop rewatching it's like there hasn't been a wait.", "label": 0}
{"text": "Yeah it's way too much story spread far too thin and S1 of POI especially had so many filler episodes which added very little to the characters, overarching story or both. I've thought the same thing about any season of a show that has 20+ episodes that are 40-60 minutes long. It's just too much.\n\nFor me 10-15 is the sweet spot as it allows for a focus on the overarching story with just enough wiggle room for character development and \"filler\" without becoming a distraction. Doctor Who in it's prime from 2005-2008 was so good at doing that.", "label": 0}
{"text": "Ah, mate. You are not helping your cause.", "label": 0}
{"text": "> Sony can use Peter Parker in shows with episodes longer than 45 minutes\n\nIP Rights are a hoot aren't they?", "label": 0}
{"text": "World domination.", "label": 0}
{"text": "> They still exist on network tv, those crime, medical, etc. procedurals. Plenty of them in fact.\n\nExactly. Almost all of those American procedurals have always been made by NBC, CBS, ABC, Fox and CW.\n\nThey still exist. But they are still on these five networks. Most streaming services and cable tv networks never produced procedural dramas with long seasons.", "label": 0}
{"text": "And can you point where Harris advocates for that?\n\nNo you can't because she doesn't.\n\nIt's all in your brainwashed head,", "label": 0}
{"text": "Oh god that’s gonna be great", "label": 0}
{"text": "Can you give me a good list of when he's bad in a movie? The overall film may be a coin flip, but I feel like he's great in everything I've ever seen him in.", "label": 0}
{"text": "Line too - I am really impressed that they kept such a high quality for so many episodes ", "label": 0}
{"text": "I think that was about to turn into an orgy.\n\nI'd suggest at least 3 total watches. There will be New things you didn't even know you didn't understand.", "label": 0}
{"text": "That is the thing with him, hes very kind and giving, always down to earth but I swear he just picks something to say no to. Then he sticks with it, not sure it has a reason", "label": 0}
{"text": "Yeah. It’s because they call them trucks and avoid car crash standards. It’s not much to do with requirements from new law.", "label": 0}
{"text": "Yep, I was just thinking of the x.Fi was I think it was 218 epitoday.There might have been only ninety.", "label": 0}
{"text": "I can name that gaffe in three notes", "label": 0}
{"text": "My cause isn’t to get upvotes, so not really. I’m not here to make friends, I’m here to make points. As long as I’m right, I don’t care if you don’t like me.", "label": 0}
{"text": "Esteemed character actress Margo Martindale*", "label": 0}
{"text": "raising hope was a fine successor series", "label": 0}
{"text": "\"Oh, I'm getting in that suit. I'm getting in that suit and I'm taking it home after we wrap.\"", "label": 0}
{"text": "take the people who made the Dirk Gently series and we shouldcget something (very) good", "label": 0}
{"text": "If anything the only reason why we hear about them in Hollywood is we pay attention to celebrities as a culture, whereas the abuse of regular people is ignored or unknown", "label": 0}
{"text": "I feel like Young Justice did a good job of carrying the torch of OG Teen Titans.", "label": 0}
{"text": "The y kill the dog and use it’s heart.", "label": 0}
{"text": "https://tvtropes.org/pmwiki/pmwiki.php/Main/CampStraight", "label": 0}
{"text": "You’re being a little vague but I think I know what your answer is 😆", "label": 0}
{"text": "Quite odd that for such a popular series it feels like there's barely anyone talking about it", "label": 0}
{"text": "Imagine matching with the PoS on a dating app then reading this... bullet fuckin' dodged.", "label": 0}
{"text": "Yup. Defensive driving. Where no matter who has the right, you'll always do your best to avoid stupid driving.  That's why I  always find it amusing when two cars try to merge and the car within his \"right\" doesn't do anything to avoid an obvious stupid driver trying to merge. He likes to hold his ground, like it means something.", "label": 0}
{"text": "Well, that and her husband cheating on her over and over and over again.", "label": 0}
{"text": "They got renewed for season 3, so still more to come", "label": 0}
{"text": "Imagine calling yourself a writer and this is what you write...", "label": 0}
{"text": "No, I don't mean that because I have no clue what you're talking about.", "label": 0}
{"text": "That's actually a thing you weren't kidding. Never even heard of it.", "label": 0}
{"text": "OMG, yes. Nothing of interest to us!!", "label": 0}
{"text": "Thank you.", "label": 0}
{"text": "I am fairly certain he said that during the release of Season 2 of Only Murders, just before he was fatally stabbed near the end of the season specifically in order to sell that episode, and what happened to his character.", "label": 0}
{"text": "I used to love this show. I bet if I watched this now I’d laugh my head off at how ridiculous it is.", "label": 0}
{"text": "It's a masterpiece! I've waited so long for season s2 and currently on episode 2. The writing the story is just outstanding!", "label": 0}
{"text": "Good for them. Both seem like cool people.", "label": 0}
{"text": "I started this last week and have two episodes left in season one and am loving it. Lowish budget, campy, and fast moving. I love it for all of that but it really isn’t a great show. Oh, and it’s Canadian if you couldn’t tell.", "label": 0}
{"text": "Most new shows these days get two seasons as a part of their initial contract. When they announce a show is being \"renewed\" for a second season, they're only saying it for appearances since the second season was already signed off on and approved in the first place. \n\nIt's the whole reason that Mindy Kaling Velma show got a second season before being cancelled; two seasons were already a part of the initial contract, so S2 renewal was never necessary", "label": 0}
{"text": "Webbing, duh.", "label": 0}
{"text": "I just can’t get past the premise that 70 year old Reba has a half-sister in her 20s.", "label": 0}
{"text": "I disagree. More people are involved in internet discourse than even five years ago. I don't think it's fair anymore to say \"Reddit/the internet is not representative of real life.\" \n\nBesides, the number of users of Reddit and internet social forums are MORE than enough data points to infer trends on a wider scale. Kind of how statistics work.", "label": 0}
{"text": "Because it's unpleasant?", "label": 0}
{"text": "Exactly. I'm still watching in season 2, largely because i like the cast, except for her pointless family (seriously, you cast latifah, we get that the character has heart, i don't need extraneous boring domestic issue drama too.)\n\n\nI really wish they'd  made her more of an enigma. I don't want her to try and contort herself into a tortured soul, because that's not her deal, but there really don't seem to be any stakes as to why she left.", "label": 0}
{"text": "Except by literally most people. I assume you’re a Brit and have never once been to America, and thus are living in blissful ignorance of how many stupid people here think it’s bad. I’ve lost count of the number of times that I had to explain to some moron that it came out first, because they thought it the knockoff. \n\nAt least those people are just stupid, and not intentionally embracing ignorance like you seem to enjoy doing.", "label": 0}
{"text": "Can't get everyone from everything", "label": 0}
{"text": "Keith is kinder man than I am, I would have told God get him yourself.", "label": 0}
{"text": "I was shocked to find out they were the same person. She looked 20 years older in happy gilmore than in modern family.", "label": 0}
{"text": "Still can’t believe this got greenlit, its wild.", "label": 0}
{"text": "Orphan Black - excellent first season, never recaptures the magic however usually entertaining, decent ending, ignore the sequel Echoes", "label": 0}
{"text": "Wait did bozo do the dub or someone else?", "label": 0}
{"text": "I would just like everyone to know that this show was not trying to be funny. It was consistently bending over and stretching to be as serious as possible.", "label": 0}
{"text": "Yep, I sung it", "label": 0}
{"text": "Well in these shots it's explicitly *not* him: \n\n>though we're told this isn't him in the pics, but his stunt double instead.\n\nHaving said that I'd guess that we're going to see a lot more of Nic than of Pedro. Part of Mando's creed is that he never takes off his helmet but over 50% of any Spider-Man adaptation so far is also playing Peter Parker.", "label": 0}
{"text": "In America, yes. You’re a Eurocentric prick who doesn’t seem to want to acknowledge the existence of the rest of the world, and that’s your problem.", "label": 0}
{"text": "For the stunts, probably minimal. But it's not like Mando just because obviously Spider-Man doesn't HAVE to keep the mask on at all times and there's likely to be plenty of unmasked Nic Cage time", "label": 0}
{"text": "I don't think any creative ever complains about having too HIGH of a budget, especially when somebody else is paying.\n\n\"Oh no! Please don't give me MORE money to achieve my goals and fulfill my artistic vision!\"", "label": 0}
{"text": "TNG is actually my fave of all the ST series. This is because Patrick Stewart's Jean Luc Picard is easily the best of all the Enterprise captains by a fair margin IMHO. It's worth watching all of it just for his brilliant acting", "label": 0}
{"text": "“Most” people in America is so far from being most people in the world that I can’t imagine why you think that would help your case.\n\nI suspect you’re just doubling down because you can’t bear to admit you fucked up.", "label": 0}
{"text": "Meanwhile, Elon is just *buying voters* directly.", "label": 0}
{"text": "He chose Cage as his stage name after Luke Cage and he named his second son Kal-El", "label": 0}
{"text": "Have you even watched the Outrage trilogy?", "label": 0}
{"text": "Benjamin Linus.", "label": 0}
{"text": "To reach an audience that doesn't play video games.\n\n\nSame as any adaptation.", "label": 0}
{"text": "Ugh I had a drunk moment when I asked an old friend (not close since elementary school) how his mom was doing and he reminded me that she had died of cancer a couple years prior. I must admit I've had too many drunk moments over the years, but that is one in particular that mortifies me. I remember the look on his face", "label": 0}
{"text": "Who are you talking about? I haven't seen anyone criticize Bluey at all.", "label": 0}
{"text": "Person if Interest had some fantastic episodes, including one of the best episodes of television ever made, but it also had episodes that were utter trash filler. It would have benefited greatly from a prestige TV format of 12-16 episodes instead of the assembly line of too many writers/directors rushing to crank out the episodes.\n\nWhen people defend the old 20+ episode format, there's usually just a handful of genre shows that always come up as examples out of decades of television history. A handful of shows out of thousands of shows that were crap. And TBH most of those examples could have dropped a few episodes a season and been better off for it.\n\nIf shows were made that length again, the same problems would rear up most of the time.\n\nOf course things have gone way too far with shows doing 6-8 episodes every two years, that is ridiculous and bad for the medium. A show should be able to be 10-14 episodes annually. Long enough seasons to truly take advantage of the medium, but not so long it turns into the cranked-out assembly line of too many cooks.", "label": 0}
{"text": "I didn’t even know this released. Netflix has the worst marketing team in modern history.", "label": 0}
{"text": "Power Rangers. Sometimes I just want cheesy writing and badass monsters, zords and fights xD", "label": 0}
{"text": "Dont know why you are being down votes.. it is the scene after he beats Flash and rund away from school and then climbs the wall in the alley. ", "label": 0}
{"text": "I did its called Disney's Standards and Practices department.", "label": 0}
{"text": "Right, although I would say it’s less “enjoyed it” and more “found it at least serviceable”", "label": 0}
{"text": "Are you familiar with yakuza crime dramas?", "label": 0}
{"text": "Sid Caesar dangled Mel Brooks out of a hotel window. There’s probably more out there since alums of Sid Caesar’s writers rooms have practically won every award you can win except for the Nobel Prize.", "label": 0}
{"text": "There's a lot of subjectivity in your comment here, and I'm not really sure how to respond. Be well.", "label": 0}
{"text": "I'm still sad that Limitless was canceled. That was such a fun show.", "label": 0}
{"text": "Yeah really confusing for weird reasons.", "label": 0}
{"text": "1. Everytime I have done Bluey mentioned it is in the context of it being really good, so we're you are getting the idea people are criticising it I don't know\n\n2. Just because something is \"aimed at kids\" doesn't make it above criticism. One can still analyse and critique things that aren't aimed at them.", "label": 0}
{"text": "Probably after what happened with The Flash and his Superman cameo he’s done with cameos even though they used AI", "label": 0}
{"text": "It's definitely a norm in animated shows, but I don't know if it's necessarily a cynical \"avoid giving them a payrise.\" Like don't get me wrong, it could be at least partly that, but also if you're already putting all your time into designing these animation assets I'm not surprised that it's just cost effective to bulk up with a double order.", "label": 0}
{"text": "Which of the founding fathers can be the butt of a joke? We had a king called Ethelred the Unready. Do you have Jon Hancock the hammer collector?", "label": 0}
{"text": "Wait. Nick cage is a getting spider man spin off show? How the hell did this squeak by me . I’ve heard nothing of this: that’s amazing . If there’s anyone who can pull off a random comic book character it’s gonna be nick cage. ", "label": 0}
{"text": "It's a really fun thought exercise to sit down and consider that people *tried* to tell her, from PAs to producers, and she still carried through with this.  People know how to hide malice behind ineptitude because it's easier to beg for forgiveness than to admit that you're wrong.", "label": 0}
{"text": "Right there with you on that.lok", "label": 0}
{"text": "Yeah I enjoyed this show, but there were quite a few points where I was like \"this feels more like a sequel to TR2013 than to Shadow\".\n\nBetween Lara suddenly having Roth issues (on top of her already existing daddy issues) which had basically been resolved by Rise, and Jonah initially being against Lara's quest and then her not treaating him right (again, something not remotely present in Shadow), it felt like an awkward wedge.\n\nI still enjoyed it based on what it did, but it didn't really easily gel with my understanding of where the characters are based on the canon we had so far.", "label": 0}
{"text": "Ahhh this clears it up, thanks!", "label": 0}
{"text": "I loved the quick cutaway to Anna texting while semi-paying attention in the audience.", "label": 0}
{"text": "Oh man, I could copy and paste this with Joss Whedon subbed in for my disappointment about *The Nevers*. \n\nOne of the best seasons-end twists in television and no next season.", "label": 0}
{"text": "nail gun.", "label": 0}
{"text": "thank you for actually explaining the main deal of teacup, definitely got me more interested", "label": 0}
{"text": "Shrinking", "label": 0}
{"text": "I mean, these shows are made *by* adults. They should obviously be critiqued with the intended audience in mind but do you really think that nobody should think analytically or critically about children's shows at all? Or that children should be the only ones critiquing and reviewing these shows? Come on.", "label": 0}
{"text": "Bluey in particular has become famous for being a favorite of the parents of toddlers in that it has story lines and themes that would mostly go under or unappreciated by the age group it is ostensibly targeted toward, but that resonate strongly with the adult parents who also watch. One part of this seems to me to be (as someone who doesn't have children or watch the show) that the parent characters are an important and integral part of the show, and the stories often revolve around the struggles and life events of young parents. You can imagine that those stories are going to resonate strongly with an audience of young parents who are in the exact same situation / stage of life that the show's parents are going through.", "label": 0}
{"text": "It doesn't. She remains awful throughout.", "label": 0}
{"text": "Yeah, Lindelof seem to at least acknowledge that he did a lot wrong. It's... something I guess. Cuse seems to be beyond any help.", "label": 0}
{"text": "Seems like most of the shit “adults” watch today is made for children.", "label": 0}
{"text": "Gangster period piece starring Nic Cage as Spider-Man, this is pretty much checking all my boxes except the “all episodes directed by Scorsese” one.", "label": 0}
{"text": "> \"aimed at kids\" doesn't make it above criticism.\n\nDepending on the age demographic of a kids' show, yes, it absolutely matters who the target audience is. Some movies and shows might be aimed at kids but are designed for a wider audience to enjoy. For example, a five-year-old can watch *Paw Patrol* and have a blast, but a 25-year-old is likely going to be bored out of their mind—because it’s *Paw Patrol*. It’s for toddlers.\n\nNow, take something like *Toy Story*, *The Wild Robot*, or *Inside Out 2*. These are also aimed at kids, but they’re what we call “family movies”—meant to be enjoyed by everyone. A five-year-old can watch *Inside Out 2* and enjoy it on a surface level, while a 16-year-old might connect with the main character’s struggles, especially with anxiety being the antagonist. Meanwhile, a 25-year-old can watch *Inside Out 2* and find meaning in its messages about mental health. Family films have layers that offer a deeper meaning or message, something that might go over a young child’s head but will resonate with older kids, teens, and adults.\n\nTake *The Wild Robot* as another example. On the surface, it’s about a robot, but dig deeper, and it’s a story about motherhood, adoption, and learning to let go—complex themes that hit differently as you get older. A toddler might just see a cute robot story, but older viewers will appreciate the broader message.\n\nIn contrast, *Paw Patrol* and *Bluey* are specifically made for toddlers; there’s no hidden depth, no profound message that kids might miss. Want to know if *Paw Patrol* is “good”? Ask these questions: Is it fun and exciting? Do kids enjoy watching it? Does it teach good messages? Are the characters positive role models? If the answers are “yes,” then it’s a good show *for its intended audience*. No need to overthink it.", "label": 0}
{"text": "I mean that’s what the appeal of a lot of those kinds of shows that came out in the 90s through the 2000s were. Yes they were ultimately for children but it was a darker more mature overall show with moments of levity to throw into an overall thought provoking show. Now it seems like everything they are making is just immature and childish like they don’t respect the intelligence of the people watching it and overall either producing / catering to a lower standard.", "label": 0}
{"text": "Good riddance to bad trash. I had no idea she'd gone over to the Dark Side. Funny thing is, I'd always assumed she was gay. Not sure why. I enjoyed the whole Brady Cast Gets Together to Renovate the Actual Brady House show. But I don't think we need a Brady Bunch show in today's world anyways, certainly not with toxic people like her starting in it", "label": 0}
{"text": "I’m not sure why either, I’d love for them to provide a screenshot.", "label": 0}
{"text": "Exactly.", "label": 0}
{"text": "So you have a comment about how only Ohtani and a commment annoyed about Ohtani coverage. I assume this is the sarcastic one but I think you’re kind of working at cross purposes. You’re the one making this highly visible baseball post about only Ohtani. \n\nAll that to say, you suck.", "label": 0}
{"text": "Season 2 is where she gets her boobs, can't wait!", "label": 0}
{"text": "Yeah, but who plays it like that? The whole appeal of the games is the sidequests.", "label": 0}
{"text": "Hi TheLaraSuChronicles, your [post](https://www.reddit.com/r/television/comments/1gc5o1l/king_of_the_hill_revival_unveils_first_look_at/) has been removed for being from the domain \"cbr.com\" or having a link to it. Please consider submitting from an alternate domain, or messaging the moderators to get this submission approved if you think it should be.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/television) if you have any questions or concerns.*", "label": 0}
{"text": "I cannot _possibly_ spend all this, even corruptly. You people are insane and I’m leaving out of principle.", "label": 0}
{"text": "How long did she make people awkwardly listen to music?", "label": 0}
{"text": "ROFLMAO!", "label": 0}
{"text": "Wait, they're doing that in live action, not animation?", "label": 0}
{"text": "They ban and censor things for Disney, but the DVDs and upcoming Blu-ray set are released by WB and BBC, as the show isn't made by Disney, and include the censored stuff.", "label": 0}
{"text": "I got Mandela effect, swore after the first verse it was announced that it was animated version film with Cage.", "label": 0}
{"text": "Wait until this guy hears about the police force", "label": 0}
{"text": "no European would ever write that show and be allowed to keep their citizenship. its so painfully American that i was surprised everyone wasn't wearing a beret.", "label": 0}
{"text": "industry season 3 is the best season of television in 2024 imo", "label": 0}
{"text": "The Rotten Tomatoes list is a good one.\n\n\nhttps://www.rottentomatoes.com/celebrity/nicolas_cage", "label": 0}
{"text": "I’m getting 5-6 ads every 5 minutes now wtf Amazon", "label": 0}
{"text": "Arnold Schwarzenegger manages to be generally well liked despite being a Republican, it’s not just garden variety conservative opinions that people are getting in trouble for.", "label": 0}
{"text": "Yup, she’s gonna burn it all\nDown if she loses.  That’s why her DOD changed the guidance about lethal force against US Citizens last month.", "label": 0}
{"text": "Her role in weeds was interesting. ", "label": 0}
{"text": "You should watch raising hope and the guestbook.", "label": 0}
{"text": "Caveman. I thought it was great when it aired and was very disappointed it got cancelled. I’ve only ever seen people talk bad about it.", "label": 0}
{"text": ">deserves all the criticism it gets, on the double.\n\nWhy? *Paw Patrol* is a show meant for toddlers—there’s no deeper meaning here. It’s a fun, exciting show that kids enjoy, plain and simple. And clearly, children like *Paw Patrol* a lot; it’s been on longer than *Bluey* and even had two theatrical movies. Kids love it—maybe even more than *Bluey*—and that’s the point.\n\nI’m not saying *Bluey* is a bad show, but *Paw Patrol* and *Bluey* are essentially the same in purpose. I can’t sit down and genuinely enjoy either, and I don’t go around calling *Paw Patrol* “bad,” because, again, it’s a kids’ show. Do the kids enjoy it? If yes, then what’s the problem? Why trash something they like just because it’s “not for you”? It was never meant for adults to critique.\n\nAnd if your issue with *Paw Patrol* is that it features “underage dogs as first responders,” then, by that logic, *Teen Titans* should also be “bad” because it’s about underage kids fighting supervillains and living alone in a tower funded by adults. Shows don’t have to make sense to adults if they bring joy to the kids they’re meant for.", "label": 0}
{"text": "If you want me to take it seriously, stop saying it’s name. \n\nI do like it, but I like the original show it was based on better, Cougartown Abbey.", "label": 0}
{"text": "Nearly finished it 6/10 and I'm being nice.\n\nSome of the animations was choppy even in the first episode.\n\nLara is incredible boring in this, the only time she becomes exciting is when she is possessed by an evil red emerald and throws a dude into an attacking lion. After losing the emerald she begins crying over the body of a dead merc who was serving a warlord who was trying to kill her. \n\nIt comes of a weak and pitiful, Lara has lost all the edge from the 90's and comes of as a character out of her dept. \n\nI wish modernising a character didn't make them so boring.", "label": 0}
{"text": "Yep, you just know you've nailed it with a piece of utter perfection.", "label": 0}
{"text": ">Have you even seen Bluey?\n\nNo, because I am an adult.", "label": 0}
{"text": "I love Animal Control, think it’s one of the best sitcoms in a long time and am so glad it’s been renewed for a third season.", "label": 0}
{"text": "Not a whole lot of them, though I've seen a bunch of movies. I'm familiar enough with the tropes though.", "label": 0}
{"text": "Good point about Godzilla, I haven't seen the older one but Minus Zero was actually pretty good.  It definitely suffered from some budget issues but they did really well with what they had - Godzilla was a good mix of CGI and \"Guy in a suit\" and was probably the most terrifying version of Godzilla I've seen.\n\nAnd yeah, someone suggested the Death Note live action movies and... woof.  Bad.  Probably better than the Netflix one, but that's not saying much.\n\nI've honestly fallen out of most Anime at this point because I don't like Isekai and I'm an old fart that is both uninterested and weirded out by the hypersexualization of underage girls in Anime.  I gave one a shot because a friend said it was EXCELLENT and it had a (40?) year old man in the body of a 12 year old talking about how sexy his 12 year old friend is.  No thanks. \n\nEdgerunners was amazing though.  Cells at work was pretty interesting as well.", "label": 0}
{"text": "That is the stupidest thing I have seen in a long time. Please tell me it wasn’t supposed to be an emotionally sad part.", "label": 0}
{"text": "HAPPY LOOK OUTTTAAAAHH!", "label": 0}
{"text": "International boycott of Amazon ???", "label": 0}
{"text": "Trips has been nailing it. Love all the little connections between storylines/characters and long term booking is a thing again. \nI had stopped watching the ‘E bc I couldn’t take VKM’s bullshit stories and bookings but it’s the best it’s ever been now.", "label": 0}
{"text": "As herself. There's an episode where Kramer is a guest on Regis and Kathy Lee", "label": 0}
{"text": "Terrible headline", "label": 0}
{"text": "It took me a whole season to get into sopranos", "label": 0}
{"text": "I liked it but I didn’t like Travis and Laurie getting together. And it took forever to actually start watching it because of the name and I think it had shitty ads.", "label": 0}
{"text": "Tbh Kal El is a Hebrew name as well, but you’re right. Cage is a legendary nerd.", "label": 0}
{"text": "They've both had a partner die. Gives people perspective and teaches them to appreciate partners.", "label": 0}
{"text": "Part of my job is transporting a minibus full of kids. It stresses me out doing that more than when I was literally shot at in my past once. I have callouses on my hands from gripping the wheel so tight. That may sound ridiculous but I live in the city with the most aggressive drivers and most road rage in the entire country, while also having one of the highest rates of DUI and wrong way driving in the country too. Driving on our freeways is already stressful, add in being responsible for 12 little ones and in a minubus that people loooovvveee to cut off and drive like assholes around because my speed is limited to 70(i stay in the right 2 of 6 lanes) and acceleration in that thing is dogshit. They get mad and impatient and cut you off, try to prevent you from merging onto the freeway, etc.. I'm not exaggerating when I say we are nearly hit by someone almost daily. I could get out of driving, but I do it better than the other staff(I'm 37, and have worked as a driver of bigger vehicles in the past, spotless driving record, etc.., rest of the staff who would drive are 20-25 with no experience with larger vehicles, why I drive the big boy). I don't trust anyone else to take over that route because of how difficult it is. So I keep doing it even though I'd love to not.", "label": 0}
{"text": "Yup", "label": 0}
{"text": "I can’t believe they’re letting Cage ruin another comic book movie.", "label": 0}
{"text": "Currently watching Star Trek: Enterprise. People tend to say it's the weakest Trek show, but it has such a 90's vibe that I'm super nostalgic for right now, so I'm really enjoying it.", "label": 0}
{"text": "lmao, I'm totally with you when it comes to anime's creepy side, I have a low tolerance for that kind of thing now that I'm getting older. Its honestly getting harder to find anime that only have a cast of adults. I still need to watch Edgerunners, been on my watchlist for ages.", "label": 0}
{"text": "Disappointed definitely. But wont affect me from buying every next yakuza game coming ❤️❤️", "label": 0}
{"text": "If somebody should be criticised, it's adults who think they can throw random shit at children because \"kids are stupid\". Treat kids like idiots and you end up with adult idiots. Brainless consumers are good for business.", "label": 0}
{"text": "To be fair though, until Steep or Short confirm it, it's not a fact, so I can kinda understand the skepticism.\n\nThat said: smoke, fire, something something.", "label": 0}
{"text": "They go on about it being electrostatic or him being able to make himself stick to stuff. It’s very inconsistent. \n\nIt’s best not to think about it", "label": 0}
{"text": "Nah there are plenty of shows with more mature and thoughtful themes still. Netflix in particular has been putting out some great stuff and Hilda, She-Ra and Kipo. Transformers EarthSpark has some really dark and powerful stuff in it. I’ve also heard Infinity Train and Amphibia have some more mature storytelling. Gravity Falls is fantastic and I hear its spiritual success Owl House is good too.\n\nThere was also plenty of inane crap on TV in the 90s and 00s, easily way more dumb stuff than the few shows with more serious elements. SpongeBob has been running for 25 years, and I’d easily rate Titans Go as a smarter and better written show.", "label": 0}
{"text": "It was more of a that guy was a terrible human being and doesn’t get his life saving procedure now.", "label": 0}
{"text": "It's weird that became a meme because that was one of the **least wacky things** anyone said or did on Riverdale.  It made relative sense in context even though people hating on the show leaned on part the context to make fun of it while removing it from the context", "label": 0}
{"text": "God Tier Suit.", "label": 0}
{"text": "Yeah just finished it. I enjoyed it for the most part, the odd slight plot-hole, although they did also cover some bits well too. \nBeing picky:\n\n1: She’s so strikingly beautiful that her being overlooked is hard to buy (although they do kind of a good job of making her seem plain at times, in fairness). \n\n2: Two murders and a missing person in a short space of time. When Julia is found, her story is only of interest to the small regional paper. (The character of the main newspaper editor is hilarious, though).\n\nQuite like the idea of another season, although wondering how they’d begin to start.", "label": 0}
{"text": "Yeah, it’s a great scene", "label": 0}
{"text": "So why are you in the bluey sub?", "label": 0}
{"text": "*Rivals* is amazing. I was shocked.", "label": 0}
{"text": "For awhile he was in tax trouble so he was taking whatever trash project, he’s doing well today but still works constantly today cuz he said it keeps him away from alcohol which he seems to have had issues with. That being said even tho he’s working almost nonstop the quality of his projects has increased a lot over the last 5 or so years and he’s pretty consistently popping up in good stuff even if there are dude mixed in still.", "label": 0}
{"text": "I find it funny that adults with no kids watch a show meant for toddlers at the same time. It's sad and pathetic, though.", "label": 0}
{"text": "*Agatha* has been epic. Love the cast and the story.", "label": 0}
{"text": "The Travis-Laurie thing was definitely - as kids would say today - cringe.\n\nIt was fun how the postcard in the opening credits started making fun of the name too.", "label": 0}
{"text": "I met a guy in rehab on his third DUI.\n\n\nEvery DUI he had was from hitting parked cars.", "label": 0}
{"text": "I have been enjoying Shrinking and Nobody Wants This", "label": 0}
{"text": "[https://www.youtube.com/watch?v=zlwaUJzGqns](https://www.youtube.com/watch?v=zlwaUJzGqns)\n\nThere ya go!", "label": 0}
{"text": "Get ready to hear Peace Frog every 2-3 episodes...", "label": 0}
{"text": "How is this si bad? Its made by Alfonso Cuaron? I seriously dont get it. So corny. The shots are insane? Looks like its made by a 13 year old", "label": 0}
{"text": "Sorry, grumpy this morning.", "label": 0}
{"text": "High Potential is a police procedural but I love Kaitlin Olsen and she carries it beautifully", "label": 0}
{"text": "Nailed it, really hoping this is dope. Sony tv has a much better track record than Sony films", "label": 0}
{"text": "Sad cast on a sad movie!", "label": 0}
{"text": "Ohtani alert: he’s going to bat in 2 hours! Get your popcorn!", "label": 0}
{"text": "Loving The Penguin and Tulsa King (it's a bit cheesy but a fun watch). Patiently waiting for S2 of Lioness and Arcane.", "label": 0}
{"text": "Whoa, never realized that one. Funny that Kathy Griffin is also in that scene, who also was in Seinfeld", "label": 0}
{"text": "*Mistresses* 🙈", "label": 0}
{"text": "Woke dogshit", "label": 0}
{"text": "I was just thinking about the Healthcare episode the other day where they defeat the evil Healthcare system by racking up so many injuries that it explodes their deductible.  Absolutely brilliant.  This show deserves more credit than it gets.", "label": 0}
{"text": "Isn't he in his 60s? How is this gonna work??", "label": 0}
{"text": ">No adult should watch Paw Patrol or Bluey and come out thinking, “This is deep, thought-provoking stuff.” You’re a grown adult watching toddler shows. Maybe leave the reviews and critiques to the kids they’re actually made for.\n\nTell me you don't have kids and have never watched Bluey without saying you don't have kids and have never watched Bluey.\n\nKids may not consciously understand the difference between drivel like Paw Patrol and a masterpiece like Bluey, but deep down I think they do.\n\nI grew up on cartoons that existed only to sell toys as well, but thankfully some of the medium has advanced beyond that.  So many smart shows made for kids in the last 20 years.", "label": 0}
{"text": "Mercifully scarce is sadly not be said of equally lightweight contributors such as yourself.", "label": 0}
{"text": "She supports equity which is equal outcomes for all regardless of skill, education, initiative, perseverance, and effort.  This is a step in the path to socialism and ultimately communism.  Equal outcomes would create equal wealth for all, which would approach zero wealth for all and utter dependency on an all powerful central Federal government.  The states would be powerless in her vision of the world.  \n\nReal Americans believe in equal opportunity, not equal outcomes.  Everyone gets the same opportunity regardless of factors outside their control.  Factors like race, sex, sexual orientation, religion, etc.  Sone fail. Some make it.  This is why people have come to America for generations.  If you want equal outcomes go to China, Russia, or some other communist hellhole.", "label": 0}
{"text": "She is a joke!", "label": 0}
{"text": "Yea I enjoyed the first four episodes then they introduced new people n ruined it I liked Phil when he was going crazy ", "label": 0}
{"text": "This series has like 6+ future hall of famers including the most popular baseball player of this century. It features the 2 biggest market teams who were both top seeds in the regular season. It’s the first time 2 MVPs have faced off in the World Series a decade (and the first time ever that 2 players with 50 hrs in the season will face each other in the WS). \nNot only will it be the highest rated World Series in the US in many years, it’s going to get like 20 million viewers per a game from Japan.  If ever there was a chance for MLB to occupy the cultural spotlight again, this is it.", "label": 0}
{"text": "Are you speaking about the actor who played Lyle? I don’t think I have seen in any other series / film- thought he was excellent performance, (when that mother ripped his hair off his head at the table- b/c he called her a Hippacrit-(?) not allowing him to marry a girl he loves at a young age) \nI literally was sick to my stomache-( this boy WANTS TO COMMIT to someone at such a young age)- is commendable!! He was in love-( he was not a sociopath…..he was not born a sociopath- or likely anything wrong psychologically) \nI won’t go into detail- personal experience of abusive - narcissistic- maybe sadistic-‘mothers’ but they exist….( it’s terrible) but on top those boys were being MOLESTED AND MOTHER JUST LET THEM BE - lock door- she stood by-( \n\nIt kills a person- child- when they know parents see and know they are in danger- and THEY DONT DO ANYTHING TO STOP IT) they perpetuate it-:( \n\nThe show had some kind of funny humor at first- but then they portrayed the boys as ( sociopaths) but I DIDNT think it was balanced—- and gave idea that the kids maybe lying about abuse? \n\nWhen that father calls his mother- ins lavish or whatever tells the crying she abused him when he was younger- and she would t admit it…..( THIS WAS REAL) horrific- ( of course other ways to handle things) but IF THEY TOLD DR -( I’m 99.1% sure) THEY COULD NOT TWLL ANYONE- or they’d be beaten- RIP skin off layer by layer - so they just came to accept that:( till Luke spoke up and THEN stood up to his father- said DONT TOUCH MY BROTHER.  No one knows what happened- aside from the boys- and yes they did lie ( and that was probably - worst part- b/c that made them look like they didn’t care if another took fall for them- and that they wanted “to get away with it” \nAnd honestly- THAT TAPES WOULD NOT BE ADMISSABLE-( legal front-) none of that made sense…..( and Eric had to trust Kyle and he betrayed him and went to DR- THE ONE THAT KNOWS THE FAMILY) and tells him…….(?????)\n\ndoes anyone know what is real? What really happened? What was fiction? Fabricated?", "label": 0}
{"text": "Oh give me a break.", "label": 0}
{"text": "I don't know where you got the idea she looks like a man and is gay? Did we even watch the same show? \n\nThe art style of her outfits certainly downplays her curves (which women can do in real life!) but she gets in dresses multiple times as well as takes a bath at one point and yep, definitely a woman. \n\nMaybe listen to less right wing grifters opinions.", "label": 0}
{"text": "Yeah, that was what made those appearances so....creepy yet great.", "label": 0}
{"text": "Those About to Die.", "label": 0}
{"text": "The woman had an unrelenting drive.", "label": 0}
{"text": "Not really a Cavill fan tbh. \n\nAnd if we’re going for nerd I’d rather throw in Joe Mangienello. Dude is one of the most legendary nerds in Hollywood.", "label": 0}
{"text": "Meh. He's still not a strong swimmer.", "label": 0}
{"text": "Jolly Green J\\*zzface! 🤣", "label": 0}
{"text": "I really liked it, it was a fun group of actors/employees.", "label": 0}
{"text": "Dan Da Dan is a great anime that's still premiering on Netflix. There's a tough to watch abduction scene in the first episode but it's incredible regardless", "label": 0}
{"text": "I love the Splett!", "label": 0}
{"text": "Would you recommend rewatching the first season again before starting season two of Devils Hour ?", "label": 0}
{"text": "I can't wait for Philadelphia 2 to come out!", "label": 0}
{"text": "Can just start except that some people win and some lose. That is ok. It happens, I feel every time someone loses or doesn't get picked. There has to be a reason,  there is. They were not the best or what was needed and that is ok.", "label": 0}
{"text": "9-1-1 is amazing.  The drama with the cast combined with the totally absurd emergencies.  There was an episode with a shark on a highway.\n\nHave you watched Doctor Odyssey?  It's the same sort of absurd.", "label": 0}
{"text": "Read the link at the top of the page, without any other context it sounds like she was naked and afraid when it happened.", "label": 0}
{"text": "\"It was already in the syrup\"", "label": 0}
{"text": "Naah, too high of a budget means more higher up interference, unrealistic expectations, \"just cgi it\", etc.", "label": 0}
{"text": "I cannot stand her at all . \nShe pulled tackled a kid and pulled a gun on him , cheated on anton for Lundy yet she wants to be mad at Dexter for being with Lila \nIdk how Dexter can put up with her", "label": 0}
{"text": "The thing with the Fringe crew is that I didn’t consider any of them star writers like Damon Lindelof or Drew Goddard, so I’m not surprised they haven’t been able to catch lightning in a bottle again.", "label": 0}
{"text": "911 combines engaging relationship drama with totally absurdly dramatic rescue scenes.  Nothing is too unrealistic for them.", "label": 0}
{"text": "The last ship is the best and most realistic show based around a destroyer because they actually used a real decommission destroyer when shooting the series.\n\nI agree that as seasons go on, the plot gets further away from the ship and naval combat which is disappointing because that’s my favorite part of the show, but all seasons are still entertaining and it’s also a really good show to rewatch", "label": 0}
{"text": "why do people care about this Nicholas cage is one of the worst famous actors of all time 😭", "label": 0}
{"text": "After fallout I'll take anything man. Sega keep giving up them IPs like sonic. I know you have plenty.", "label": 0}
{"text": "I think you mean  Jonah and willa", "label": 0}
{"text": "“Former ex-boyfriend” does that mean they are dating again? Or just bad copy?", "label": 0}
{"text": "I was not expecting this, but I love me some crossovers.", "label": 0}
{"text": "[“I have a butterfly for each year the South African apartheid was enacted, so that is 72 butterflies ….. !Extraordinary! (but not for the obvious reason)”](https://youtu.be/dKSwIuom5c8?si=KVf-8PsqJw5SMWHV)\n\nIt’s been more than a decade since this was released, and Kristen Bell is still delightful.", "label": 0}
{"text": "And yet you have a problem with people having seen it or talking about it? Awfully condescending.", "label": 0}
{"text": "Exclusive update from Attorney Greg Gutzler: \n\n\nhttps://x.com/chrisprolific/status/1849848399782093250?t=ztDVouCwcJsEc4iT-1zMNA&s=19", "label": 0}
{"text": "I have a 1.5 hr commute twice a week, it is so hard to accept being on the highway that long. I’ve got my head on a swivel, looking out for semis or vans or little racing Hondas, eyes peeled for motorcycles splitting lanes.. it seems there’s a good amount of people who feel safe enough in their own vehicles with zero regard for  how their actions and presence on the road affect other drivers.", "label": 0}
{"text": "The gang hires a tutor for Charlie", "label": 0}
{"text": "RELEASE DATE DETAILS!!!\n\n...\"so we don't have any specific release date set in stone yet here are the potential months in which it could come out....\"", "label": 0}
{"text": "The one where he danced?", "label": 0}
{"text": "I tried Elementary and I remember the audio really annoyed me.  I think the dialogue would sometimes be wayyy to low.  Even though I typically have subtitles on anyway it really annoyed me.", "label": 0}
{"text": "there's a release date, also in the 'article', but that also has fuck-all to do with selma blair. they could try interviewing people actually involved with the show but that would require some effort.", "label": 0}
{"text": "This is why I mean when I say people lie and we become a society that accept lying and why Trump is being elected.\n\n>Unfathomable reason? Biden literally won 2020. 100% she helped in Georgia, Penn\n\nKamala Harris is from California and she wasn't popular before which is why she didn't run on the convention. She quickly stopped her financial campaign in 2020 because she wasn't popular and wasn't raising money. She didn't bring anything to the team other than how she looks and her average trajectory. \n\n>2) Biden wasn't senile for years. Thats straight up crazy talk.\n\nYou mean the oldest president in history was sharp as ever? You speak as slowing down and \"accelerating\". As if he was capable for the job. He was a bad candidate. Beating Trump would be easy for any good candidate.\n\n3) No one can force Biden to step down. He did so on July 21st.\n\nYes. They can, by withdrawing support early. By having a second candidate ready for the democrat conventions. Instead, you know what is a fact? They handpicked the runner up.\n\n4) Its amazing that she built it up to Tie! That's impressive.\n\nShe's losing and been on a losing streak for a while.\n\n5) 3) SHe's at net <1% negative favorability which is pretty impressive for 1) where she started 2) for any candidate for national office\n\nI think it's dishonest to look for some random poll and say this random useless metric is impressive. When she's losing to the biggest liar, thief, misogynistic swindler that has ever run for office.", "label": 0}
{"text": "It's a bit like how the 3D Maneuver Gear in Attack on Titan works. How the hell are they latching and then unlatching onto buildings? There's canon documentation on how it works, but there's some scenes where the action completely contradicts any sense of in-show logic in terms of how the stuff works.  \n\nTodd Howard said it best. It just works.", "label": 0}
{"text": "the looks they were giving each other at the emmys seemed to me they were closer than just co-workers. ❤️ if it is true, i am happy for them.", "label": 0}
{"text": "BBC's Merlin. It's awful, they reuse the same easily recognizeable tunnel for every scary cave in the show, the John Hurt dragon has maybe 5 animations that they recycle over and over, the plots are cheesy, the amount of suspension of disbelief you need to accept that people don't find out the big dramatic secret is insane, and it's just low quality shlock in general.\n\nBut damn if it isn't just hecking charming and fun despite all that, I've rewatched it twice.", "label": 0}
{"text": "Q Who was also the first ep featuring the Borg", "label": 0}
{"text": "I hope you’re doing okay friend. People would care. I’d care. Take care of yourself. ❤️", "label": 0}
{"text": "Some of these shows yes, absolutely but I’m going to say no on The Boys.  That would just give them an excuse to have even more over the top weird sex episodes and i think they’ve already hit their limit.", "label": 0}
{"text": "Creating jobs for her glam team and cosmetic surgeons lol", "label": 0}
{"text": "that's why it's in quotes", "label": 0}
{"text": "> I lost interest in POI when the Carrie Preston and Sarah Shahi plot lines ended.\n\nSo...when the show ended?", "label": 0}
{"text": "Yeah, I miss good genre procedurals", "label": 0}
{"text": "Charlie and Ava go rat hunting", "label": 0}
{"text": "My headcanon is that they were laughing so much between takes that this was the best thing they could put together in post.", "label": 0}
{"text": "Well, you might like the show then.\n\n\nIt's \"Yakuza\" if it were a yakuza crime-drama (which the games are, but people tend to forget that due to the wacky hijinks that the games are known for).\n\n\nIt's more grounded than the games, which brings it more in-line with yakuza movies/shows.\n\n\nAn important thing to note is that it was never suggested it would be a \"faithful\" adaptation. It is very much it's own thing. There's the basic plot of Y1 (with some 0 thrown in there).", "label": 0}
{"text": "I felt the big change from 35 to 40. My experience backed up by the NBA - a bunch of guys are still balling out at 35 - there’s only one 40 yo in the league - and he spends $1 million a year in personal trainers and nutritionists.", "label": 0}
{"text": "Talk about jumping the fucking shark", "label": 0}
{"text": "I've never seen Abbott Elementary, does this matter?", "label": 0}
{"text": "I haven’t watched too much Abridged. And it’s still a work in progress: it’s only available for Campaign 3, and only about 30 episodes in. I’ve heard good things about it. It cuts a lot of the dice rolling and tries to focus most on the story. As someone who enjoys the non-story shenanigans it doesn’t have as much appeal to me. \n\nSo if length is an issue, you can try Abridged or give Calamity a try. It’s only 4 episodes and while it’s not completely typical of Critical Role (Matthew Mercer doesn’t GM it) it’s for dipping your toes in.\n\n(But honestly, I can’t recommend the campaigns enough. Yes, they’re long, but the in depth and long form storytelling scratches an excellent itch for me personally, and if you treat it as a marathon rather than a sprint, it’s quite rewarding.)", "label": 0}
{"text": "Thanks man. Gas leak didn’t affect me.", "label": 0}
{"text": "No", "label": 0}
{"text": "I felt that way. Then when I was 31 I was diagnosed with cancer. I beat it, but I'm much more conscious of what I eat and such.", "label": 0}
{"text": "My 5-year-old is making me sew a suffragette costume for her this Halloween because of horrible histories.", "label": 0}
{"text": "I'm going to. Went it to watch then realized I remembered fuckall", "label": 0}
{"text": "The show is funny and the show is well written the characters aren’t bad and there actually tones of funny and good jokes in the show", "label": 0}
{"text": "WTAF", "label": 0}
{"text": "'the link at the top of the page'", "label": 0}
{"text": "This is the most Reddit comment ever I love it\n\n- Did not read the article \n\n- Comment is full of confidence despite total ignorance \n\n- Something something Netflix bad amirite fellow redditors something something", "label": 0}
{"text": "I think his life can be summed up in one picture:\n\nhttps://laststandonzombieisland.com/wp-content/uploads/2013/07/hemingway-and-son-jack-waiting-for-a-bite-on-the-pilar-with-his-tommy-gun-in-hand-note-the-massive-size-of-the-reel.jpg\n\nI hope they somehow recreate it!", "label": 0}
{"text": "The show is really funny I respect your opinion but saying it’s not funny at all is insane and honestly it’s better than the office in my opinion the office isn’t funny at all to me", "label": 0}
{"text": "CW is almost getting out of scripted content altogether unless it's imported ", "label": 0}
{"text": "Drumhead is amazing. That and Living Witness from VOY are just very powerful pieces of storytelling imo.", "label": 0}
{"text": "we are the princes of the universe", "label": 0}
{"text": "I mean when it comes to hitting people, stalking people, showing how romance is in tv shows", "label": 0}
{"text": "Spoilers!", "label": 0}
{"text": "> I don't think any creative ever complains about having too HIGH of a budget\n\nRyan Reynolds for ***Deadpool 2.*** \n\nIt's why Tim Miller was replaced, Miller wanted a much bigger film. But Reynolds knew the more money they took from Fox, the more they would interfere with the production and demand the jokes be toned down. \n\nIn interviews, he firmly believes that the reason Fox let them do what they did in the first film was because it was such a low budget for a fantasy film, $58M. In comparison, ***Doctor Strange*** which also featured just one superhero and also did not have a  big name cast cost $165M (on the low end of estimates, the high was $236M)", "label": 0}
{"text": "About 15 years ago I ran into her at an airport. She doesn’t seem like it, but I can say she is possibly the most attractive woman I’ve ever seen in real life.", "label": 0}
{"text": "I have only just finished the Rishi episode in season 3 but so far I would agree with you.", "label": 0}
{"text": ">  mean when it comes to hitting people, stalking people, showing how romance is in tv shows\n\nYou are going to need to be more specific.", "label": 0}
{"text": "Her damn dad wrote a book about it. She was raised in a communist family.  Do your damn research. Locking in prices on products will cause shortages beyond belief. You’re brainwashed.", "label": 0}
{"text": "I'm a little late to the party and only watching this series now and WOW. As a former film student I was just BLOWN AWAY by this episode. Best acting I have seen in a long-ass time and I really hope Cooper Koch is recognized for it with awards. Simply incredible acting.", "label": 0}
{"text": "Staples. Cage doesn't fuck around with tape...", "label": 0}
{"text": "Looking both ways and not trusting strangers seems impossible to you?  Bro… lol.  Cmon", "label": 0}
{"text": "I'm sure someone else has already mentioned it, but for the most part the legacy of TOS resides as much (or more) in the movies that came out years after the show was canceled than it does in the show itself. You could probably look up a list of the 10 or 12 \"essential\" TOS episodes watch those for context, and then start watching the movies from there to get a much better sense of the cultural relevance of TOS. If you do decide to, keep in mind that the general consensus is that the TOS movies alternate back and forth from \"okay\" to \"great\". I believe in general the odd numbered movies aren't as well loved, and the even numbered movies are considered peak TOS Star Trek.", "label": 0}
{"text": "Imo, watch 3 of the top rated episodes of TNG and you'll quickly see if the series is for you. I'm in the same boat, never was a huge fan of TOS (watched most of the noteworthy episodes once) but love all of the TNG-era Treks. They probably aged somewhat but I think most of the themes hold up really well still.", "label": 0}
{"text": "I'm sure this won't be a popular opinion on Reddit but I find this whole thing pretty confusing and unappealing. The two shows have such opposite senses of humour. \n\nPersonally, the positive outlook of Abbott is one of my favourite qualities of the show and I find IASIP mean-spirited. I'm sure a lot of IASIP fans would think Abbott was lame too.\n\nI'm also nervous this is one of those turning points in the lifespan of a popular show where it starts to get a bit \"high in its own supply\" and losing the original charm. But I hope I'm wrong.", "label": 0}
{"text": "Oh shit! I swear I read somewhere it got canned after the 2nd season, glad to hear season 3 is coming", "label": 0}
{"text": "> just a really good voice acting performance\n\nThe sign of a good vocal performance is that you either forget who it is or can't imagine it being that actor. Cage did this in film. An example of the later is Bradley Cooper as Rocket - you know it's him, but until you see the BTS footage of him doing it it's so hard to imagine it.", "label": 0}
{"text": "I knew that there would be something from the Sunny side, wasn't expecting two episodes though. Should be fun.", "label": 0}
{"text": "You should watch “Kevin Can Fuck Himself”. Its premise is based on this exact problem.", "label": 0}
{"text": "You... stop that right now.", "label": 0}
{"text": "I love The Ark on SYFY.  It's so entertaining.  I love how they just make up their own science, how the set is made from furniture from IKEA and CPAP masks, how everyone is hot.  Most of all I like that it's never boring or slow.  They run through a seasons worth of plots in one episode.  It's true B science fiction.", "label": 0}
{"text": "That suit makes it easy to hide lots of stunt doubles", "label": 0}
{"text": "Marty is the best, so happy for him!", "label": 0}
{"text": "I just hope a strong female cowgirl can come show spiderman why he's wrong and solve all his problems while helping the natives kill the bad white man", "label": 0}
{"text": "NCIS. Somebody help me!", "label": 0}
{"text": "Fingers crossed!!", "label": 0}
{"text": "Directed by crazy Joe Davola.", "label": 0}
{"text": "*Cries in 1976*", "label": 0}
{"text": "Oh god this is stupid on so many levels. Why was the recipient not even in theatre yet? Why wasn’t the box even secured? Why does everyone except the dog have the reaction times of a sloth?", "label": 0}
{"text": "I still wish we had gotten the Superman with Nicholas Cage back in the 90s. That would have been fascinating to watch.", "label": 0}
{"text": "Nobody can figure out what the heck you're talking about.", "label": 0}
{"text": "Ha! Stupidly vapid old woman doesn’t like getting called out when participating in a worthless barrel scraping exercise in futility. Lol!", "label": 0}
{"text": "> Surely it must be half assed.\n\nI have liked things before that other people have not liked. You might like this even though someone else did not.", "label": 0}
{"text": "my jaw was wide open watching the last episode, no exaggeration", "label": 0}
{"text": "Just got my max subscription back, definitely watching The Penguin soon. What are some other good recent stuff?", "label": 0}
{"text": "She wrote a musical that eventually went to Broadway. I only know that because she workshopped it in a local theater near me and one day I saw her in the lobby chatting with some older people. Someone mentioned to me she was working on a new musical.", "label": 0}
{"text": "A show about a hot chick with big tits shooting people is woke now? I'll put it next to football, beer, porn, cats, and pop music in the stuff we get in the national divorce.", "label": 0}
{"text": "I'm so glad to hear you take it as seriously as it is, Christmas_Queef.", "label": 0}
{"text": "Must have been extra fun for him to play a comic character he got to get paid to learn about", "label": 0}
{"text": "Do you know Ludwig available anywhere on streaming yet? We've been searching but haven't found it anywhere (at least available in the US).", "label": 0}
{"text": "YESSS", "label": 0}
{"text": "How do you know they are?", "label": 0}
{"text": "Tbh it’s not bad, at least as far as an action adventure animated show goes. \n\nThe last episode really plays into the video game history to the point that my immersion broke. ", "label": 0}
{"text": "I didnt realize it was live action when I heard he was getting his own movie I thought it was going to be animated like the spider verse movies.", "label": 0}
{"text": "It’s cheaper to order 24 episodes, cut them into two seasons, then order 12 and renegotiate a price increase on the next. ", "label": 0}
{"text": "Just because there’s a plot in a story, doesn’t mean that the writers think that it’s morally acceptable.", "label": 0}
{"text": "Personally I thought Strong did it better.. it was almost impossible for me to get into JT as a gangster in *The Batman*", "label": 0}
{"text": "My head canon is that they go through the gloves", "label": 0}
{"text": "There is still a lot of mystery though to keep the show going. Mainly what it even is that Lumen actually does and why they have to be severed.", "label": 0}
{"text": "Racist politics have, since before the inception of the country, been used to pass classist policies. The fact that Trump is Hitler-adjacent does not change the fact that affirmative action will not solve the underlying problems that lead to minorities being less successful than white people. All it does is let us pretend we want to help while opposing actually helpful policy.\n\nWe need to promote racial harmony and work to decouple familial wealth from economic outcome. We need to make it less expensive to be poor. We need to decouple school funding from local property taxes, we need to break the power of public sector unions so that cops can face consequences and STEM teachers can be paid market rates for their skills, and we need to make it so people don't have to choose between dying and going bankrupt paying for healthcare.", "label": 0}
{"text": "It is definitely weirder, but has opened up some cool related abilities, like the mark of Cain, and Miles' venom shocks.", "label": 0}
{"text": "Are you upset it's not th 1950s and women are represented?", "label": 0}
{"text": "You and millions of others have been hoodwinked by the lefts clever use of words.  They just needed to put a guy in a wheelchair in the pictorial explanation of equity to convince the masses that equity is “fair”.   Unfortunately nothing can be done to educate those who do not wish to be educated.", "label": 0}
{"text": "That’s sad. ", "label": 0}
{"text": "I can tell it's not great, but I'm enjoying it. I have a hard time rememwber who is who sometimes so I find myself bringing up the x-ray feature a lot.", "label": 0}
{"text": "Fringe also had an observer hidden in every episode, which I've sadly never seen repeated by any show since.", "label": 0}
{"text": "She doesn't have more masculine features. I've seen all the breakdowns trying to claim she does and all it amounts to is one line on her shoulders to show they are strong and one shadow on her arms to show she has biceps. [It's absurd to say she looks less feminine.](https://static1.cbrimages.com/wordpress/wp-content/uploads/2024/09/tomb-raider-the-legend-of-lara-croft-netflix.jpg)\n\nAlso, whiny crybaby? Isn't that more like the reboot games or, I dunno, Samus in Metroid Other M? It doesn't really apply here. Watch the show and don't just get info on it from con artists.", "label": 0}
{"text": "I haven’t kept up so idk what the mark of Cain is and I do detest Miles becoming a budget green lantern.", "label": 0}
{"text": "Yeah I'm just trying to make a point about the \"journalism\" these days about entertainment, in all its forms. I see this a lot when it comes to video games and bait article titles that talk about new information, release date, etc and there is nothing of substance in the article", "label": 0}
{"text": "I’ll be honest. TR was much more coherent for me than Terminator Zero.  I love the Terminator franchise but was so disappointed.  It felt very retro fitted to the narrative.", "label": 0}
{"text": "First of all, art is subjective. Just because you think *Bluey* is better than *Paw Patrol* doesn’t objectively mean it is; someone else could think *Paw Patrol* is better than *Bluey*. I’m going to ignore the fact that you literally just called a show made for 4-year-olds a ‘masterpiece.’ Honestly, I don’t want to watch either of them. If you asked me which show is better, I couldn’t answer since they’re pretty much the same. But if most kids like *Paw Patrol* more than *Bluey*, then good for them.", "label": 0}
{"text": "Saved By the Bell: The New Class\n\nIt's objectively not a good show, but I still enjoy watching it", "label": 0}
{"text": "Again, you are mistaking empathy for the fearmongered view of communism, not that communism is a good system either way. You are taking personal offense in the opinion that the government should take care of its citizens and compare it to authoritarianism and genocidal states. \n\nYour way of seeing the world is fundamentally broken. You are broken. I dont know what can make a person so devoid of the core essence of humanity,  but whatever it is, i hope you recover from it.", "label": 0}
{"text": "Even seeing the BTS footage it's hard for my brain to reconcile that voice is actually coming out of his mouth", "label": 0}
{"text": "Stargate SG-1. I love it so much I can't even really call it a \"bad show\", but I also can't in good faith call it that... good. Is it great? Yes. Is it unashamed military propaganda? Yes. Is it very stupid at times? Yes. Its also like my third favorite piece of media ever. \n\nMy dad and I watched it when I was 12, and I think watching it through the eyes of an uncritical 12-year-old is the best way to enjoy it. That sounds like a backhanded compliment, but it's not an ironic love or even a post-ironic love I fucking love Stargate SG-1", "label": 0}
{"text": "Al Pacino just had kid and he's lIke 87.", "label": 0}
{"text": "*Procedural and/or Lots of Episodes:*\n\nCrime: Cold Case, The Closer, Criminal Minds, NYPD Blue, Blue Bloods\n\nMedical: ER\n\nLegal: Suits, Boston Legal", "label": 0}
{"text": "They like to downvote comments that don’t add anything to the conversation.", "label": 0}
{"text": "how the fuck does this cheesy ass hallmark shit get made and KAOS gets cancelled?", "label": 0}
{"text": "Ah, then it's no surprise Netflix backed another season. Seems to be their M.O. Cancel series that are genuinely good and popular (Santa Clarita Diet is still a loss I feel to this day) while pumping funds into series that aren't genuinely good. Warrior Nun got three seasons. Netflix makes no sense to me.", "label": 0}
{"text": "Those are rookie numbers. I watched the whole damn thing. But I'm biased because The Flash was always my favorite DC character.", "label": 0}
{"text": "Every time I hear about this project, I imagine I’m hallucinating. ", "label": 0}
{"text": "It doesn't help the thousands who drop out because their elementary schools, middle schools, and high schools have a tenth the budget of schools in white neighborhoods. I'm voting for Harris because the alternative is an honest to God fascist but it's important that if we want to make the world better, we pass policy that **actually** makes it better.\n\nAll it does is help white people pretend that they support policy to help black people without actually having to sacrifice their advantageous position. Affirmative action screws poor whites and does basically nothing to help minorities in the long run.\n\nIf giving the wealthiest and most successful people in a group a chance for a better life had any chance to actually help poor black kids, then by this point there would be no white kids living in poverty. Addressing the race disparity doesn't do shit if you never address the wealth disparity.", "label": 0}
{"text": "Was this the clone saga that we all collectively agreed to never mention again?", "label": 0}
{"text": "And you’ll notice that Rudolph’s impersonation is not in anyway truly critical. Trump would react the same way to Greg Gutfeld or Steven Crowder impersonating him.", "label": 0}
{"text": "IDK kinda think it shows Sci-Fi shows aren't compatible with the age of streaming. https://old.reddit.com/r/LowerDecks/comments/1cb6y3x/interesting_explanation_of_why_lower_decks_was/", "label": 0}
{"text": "supposed to be on amazon prime outside of the united states \n\napparently there deal with marvel does not allow it to premiere on a streaming service in the united states", "label": 0}
{"text": "Nor really.\n\nAbbott Elementary is like The Office but set in a school. \n\nThe characters are a staff of disenfranchised teachers, led by the oblivious and ridiculously silly/dumb boss. \n\nThat's all you need to know.", "label": 0}
{"text": "This season of Tulsa King is so cheeks. Still funny to watch tho", "label": 0}
{"text": "More flawed reasoning. Only rich people are getting affirmative action now, you didnt get rid of it, also fewer asians are now being accepted, which was supposedly the whole reason for getting rid of it. Reality does not agree with you.", "label": 0}
{"text": "I probably would have carried on if I'd had access. I couldn't find where to watch it and just about gave up. If I ever pick it up again, I'll see it out to the end haha", "label": 0}
{"text": "Oh Boy. Fringe is gonna be your number 1 based on what your post is about. And yes, by the end of the show, almost every *detail in every episode* is integral in some way. Such a tight fun ride. Not gonna chance being any more spoilery than I may have been so far.", "label": 0}
{"text": "Is it more in the direction of something like Superstore or Brooklyn 99? Or is it more on par with the Office or Parks and Rec? \n\nSorry lots of workplace comedies get compared to the Office and not all of them are for the same audiences.", "label": 0}
{"text": "I think they ruined Elspeth by changing the format - making her an investigator instead of a lawyer and by showing us the whole story in the beginning instead of letting us work it out along with her.  \n\nSuch a pity as I loved the character.", "label": 0}
{"text": "I just saw it. Totally unexpected. It was perfect, everything about it was just perfect.", "label": 0}
{"text": "If you liked Adam Brody in this, The OC is great, but it's a long watch -- I would wholeheartedly recommend **The Kid Detective** though, it's a really good movie starring him that got slept on and is somewhat recent (I think part of the reason it went under the radar is it came out like 6 months into COVID).", "label": 0}
{"text": "Martin Short is a comedian and gives no fucks so he was being *extremely* gracious because he could have absolutely shredded her and made everyone howl with laughter while doing it.", "label": 0}
{"text": "You know what? I’m happy about that. I feel like I liked this show more than a lot of other people did. Is it the best show ever made? No. The side characters weren’t the most memorable (Zip could be a little annoying at times), the villain was… alright, and maybe the story could have been stronger. But I’m pretty sure Crystal Dynamics is trying to bridge the gap between survivalist Lara and badass treasure Hunter Lara, and I think this is a step in the right direction. I liked the action scenes more than some, and I associate the older Tomb Raider with the action more than the plot. Dang it, sometimes you just want some fun action scenes, and for me, the show delivered. If you go into the show with the mindset of just wanting to have some fun, I think it helps. Plus, I really liked Hayley Atwell’s performance as Lara. You could tell she was having fun with it. Hopefully season 2 fixes up some of the issues season 1 had and they make something great.", "label": 0}
{"text": "I would say it's closer to Parks and Rec. Like it's difficult working in education but the characters are passionate about their jobs bc of the difference it makes for kids", "label": 0}
{"text": "1) some revisionist history. She failed in the primary because she didn’t have a lane into run. Her right was butted up by Biden and Pete. She couldn’t even lean on her prosecutorial background for obvious reasons. She moved left but obviously she butted up against Bernie + co and wasn’t really authentic self. Just a terrible time for her and I think her campaign staff were just bad at her job. I don’t think democratic people disliked but liked others more\n\n2) oh his age was for sure a risk. But come on he wasn’t tenth as bad as he was this time last year. The reasons for why Biden ran again were simple. Incumbents usually have an advantage, the economy was on an upward trajectory.  \n\n3) infighting for an incumbent candidate is a death sentence. Theres huge risk he just didn’t step down and dems autolose. Also again the decision to do that would really need to be made right after the midterms. You can’t just have a backup campaign ready to go. Too many people, 100% would have leaked then it becomes super hurtful. But again Biden was completely fine in 2022 especially after a good election for dems\n\n4) it’s literally tied in the polls. MOE is 4pts for most polls. She could literally win all the battleground states. Vibes mean nothing just as they did in 2022\n\n5) if you think any other dem candidate, would add more than a point. You don’t know the American people", "label": 0}
{"text": "**COOOODDYYYYY**", "label": 0}
{"text": "I've enjoyed all the GoW games to varying degrees, but there is no universe in which I think a GoW TV show is a good or compelling idea.", "label": 0}
{"text": "Roddenberry used some of the TOS writers and scripts in S1. Hurley and Berman didn't last long. Roddenberry was then pushed into background role. Even though S1 & 2 were uneven they revolutionised syndicated TV.  Pillar now had free reign for his vision and WGA writers were available again and wanted to work on the show.", "label": 0}
{"text": "He has a movie that is similar in nature. Frequencies. Hits exactly like Fringe and PoI.", "label": 0}
{"text": "[Here you go.](https://youtu.be/TyBzqhz6n_M?si=WQgF0Cyx0TWSeRaV)", "label": 0}
{"text": "Slade was an excellent villain.", "label": 0}
{"text": "I hated that shit when I was a kid and watched knight rider. What human would ask this", "label": 0}
{"text": "The Law & Order franchises have the most filler!", "label": 0}
{"text": "What the heck is a “live-action suit”? Wouldn’t that just be a “suit”?", "label": 0}
{"text": "This show is hardest to watch of the police procedurals mostly for the extra sadism their killers engage in.", "label": 0}
{"text": "I just tried to get into that one and it didn't work for me.\n\nI found L&O Criminal Intent much more interesting but it was set in one place. Less dramatic.", "label": 0}
{"text": "Trump's tariffs, that's what going to cause problems, idiot.", "label": 0}
{"text": "But Trump doesn't spend their money. Their money is not part of his budget. It’s not that difficult to understand lol", "label": 0}
{"text": "I guess you didn't know that Sarah Shahi returned part way through season five.  And Carrie Preston is in the final episode, at least.", "label": 0}
{"text": "Meryl can replace Chevy I'm 3 Amigos Dos.", "label": 0}
{"text": "Right cause that worked so well for Halo", "label": 0}
{"text": "Its the office, if Pam were the main character and a bit leslie knopeish. And everyone is black.", "label": 0}
{"text": "yep, 'article' from a tweet that is just rephrasing or directly quoting the embedded tweet is peak journalism. gotta have clickbait titles too, never mention anything specific or informative, yet somehow there's always enough space to add 'free' before 'demo'. my other favorite is stuff like 'game x and another title is coming soon'. they could've easily said both titles but nope, gotta keep the other one a secret unless you click. so I never do.", "label": 0}
{"text": "The way the original departure announcement was phrased makes it pretty clear that little of Rafe Judkins' work is likely to remain. They might choose to keep some visual concepts I guess, but then again those would be heavily based on the games anyway.", "label": 0}
{"text": "The \"two episode event\" just means one episode per show.", "label": 0}
{"text": "Honestly, I can't fathom hanging around him. Every time I've seen him, he seems so *thirsty* to be the center of attention. Like, to the point of disrupting the natural flow of the conversation. I always want to reach through the screen and say, \"let them come to you, Martin.\" Seems like it would be exhausting to be his friend.", "label": 0}
{"text": "When I worked at the movies in 1998 we had 10-12 minutes of trailers. When I left in 2013 we had 18-20 minutes of ads/trailers. It’s really nothing new. I’m just hoping they don’t start doing ads in the middle of a damn movie.", "label": 0}
{"text": "Forget getting Deadpool & X-Men, THIS is why Disney bought Fox.", "label": 0}
{"text": "I'm American and no, it isn't. A lot of people love that show.", "label": 0}
{"text": "And Meryl doesn’t even have to change her monogram on her luggage!", "label": 0}
{"text": "I’ve seen this exact comment multiple times recently and I seriously think people just remember seeing it when they were young. Look up pictures she looked like a baby in that movie. She looks amazing now and arguably as good if not better but I don’t think a 90s haircut made her look that much older", "label": 0}
{"text": "Thanks!!!", "label": 0}
{"text": "Holy shit!   That was her?????", "label": 0}
{"text": "If you like the Chris pine movies you might like the tog movies 2-4 and 6. They are serialized and well done, 3 is viewed as weaker than 2,4, and 6.", "label": 0}
{"text": "That boy did right. ", "label": 0}
{"text": "Wilfred?", "label": 0}
{"text": "Why the fuck would they list arkham city and injustice as what Grey delisle is best known for? An AI 100% wrote this article. That's so stupid.", "label": 0}
{"text": "Product placement ftw", "label": 0}
{"text": "Sounds like it\n\nhttps://en.m.wikipedia.org/wiki/Wilfred_(American_TV_series)", "label": 0}
{"text": "Nah not Wilfred , more a drama comedy.", "label": 0}
{"text": "Ugh she was my all time favorite contestant. Heartbreaking. ", "label": 0}
{"text": "And at least as many people don’t like it. No one I know wants to watch it with me, and people trash it on the internet all the time. Anyway, I’ve stopped caring about this a while ago. Go watch some TV and chill.", "label": 0}
{"text": "She was great in  David Spade and Dana Carvey’s Fly on the Wall podcast. Incredible chemistry with Spade (they used to date apparently).", "label": 0}
{"text": "I love that Bobby became a famous chef by competing on “king of the grill” it actually got a chuckle out of me", "label": 0}
{"text": "We about to give Japan anime of the year over there.", "label": 0}
{"text": "Yeah regardless of how good this is I love both shows and I’m excited to see what they do", "label": 0}
{"text": "She'll always be Azula to me.", "label": 0}
{"text": "He did love Capers. I bet he cooks with a lot of Capers.", "label": 0}
{"text": "Pantheon, From, dropped Devil's Hour, Penguin, Teacup, and The Lengend of Vox Machina.", "label": 0}
{"text": "The tariffs he put in place. 4 years ago are still in place. He had cost under control. Harris ain’t done shit in 4 years. What makes you think she will now!!!!!", "label": 0}
{"text": "But is he still a propaniac?", "label": 0}
{"text": "I’m bummed my daughter doesn’t watch this anymore. Used to enjoy watching it with her.", "label": 0}
{"text": "Wait, isn't robata done over charcoal?", "label": 0}
{"text": "Nah its set in modern times , think based in new york but could be wrong on city", "label": 0}
{"text": "I have thought of nothing else but Interview with the Vampire for the last 2.5 months when I first saw it. It’s everything you want in a show. The writing (such gorgeous language), the acting, the cinematography, the pacing, the character development, the chemistry, the DETAILS! You can over analyze every single line in that show and I’ve been having so much fun figuring out new things!\n\nI’m gonna be so upset if we don’t get Emmy nominations! Jacob Anderson put on a masterclass as the Vampire Louis de Pointe du Lac. Sam Reid and Assad Zaman were phenomenal as well, but it was Jacob that held everything together for me.\n\nI can’t stop gushing about this show!", "label": 0}
{"text": "Just avoid Killing Joke. It's 77 minutes of Bruce Timm going \"What if Barbara and Bruce were lovers???\"", "label": 0}
{"text": "I loved Black Summer. I appreciated it how it was very light the drama and kept everything moving quickly. I also liked how, especially in the beginning, they would jump around from character to character with vignettes to show what’s happening.", "label": 0}
{"text": "Is this real?!?\n\nI remember watching the first 1-2 seasons of OTH when it originally aired, but didn't keep up with it. WTF", "label": 0}
{"text": "Here's one that not only criticizes her masculine features, but also how far she is from the original Lara's character. \n\nAnd yes that's right, the overly emotional Lara is from the reboot, not the original PS1 version of Lara. The original PS era Lara was a total badass bombshell with idealized sexy 36-24-36 hourglass body who adventures and takes what she wants. She was never a superhero type, she goes around tomb raiding simply because she enjoys the thrill of it. She also doesn't get emotional often. This is why the original PS era Lara and the Netflix Lara are totally different characters. It would've been better if they made an actual adaptation of the original Lara rather than the new sanitized, overly emotional, totally non-hourglass figure Lara.\n\nhttps://www.youtube.com/watch?v=F3-kIv2eDQc", "label": 0}
{"text": "As someone who doesn’t watch baseball, is 50 home runs a lot for the league for a star player?\n\nOr is it moreso the 50 steals?", "label": 0}
{"text": ">Weird he was given the reigns in the first place\n\nWhenever an inexperienced showrunner gets hired for a huge show (or whenever an inexperienced director gets hired for a huge movie for that matter) it *always* means the same thing: it's a big IP, it's a lot of money, and the money people want someone they can push around. The showrunner's job will be to do all the menial labor, and all the real decisions will be made by the producers.\n\nThis invariably results in a piece of shit. (The producers, surprisingly, never learn anything from this.)\n\nSo the fact that the people in charge are bringing in Moore is good not just because he's an experienced master of the form, but also because it means they've *tried* the hired hand approach first, and then *made the choice* to get a real showrunner instead. It's a good sign.", "label": 0}
{"text": "imo Western Asians have a completely different vibe and would feel very out of place. The original Kiryu from the 2007 movie was perfect (Kazuki Kitamura).", "label": 0}
{"text": "Nic e", "label": 0}
{"text": "\"Agatha All Along is still bewitching audiences ahead of the finale next week.\n\nDisney says that Episode 7, which was directed by showrunner Jac Schaeffer, drove 4.2M views globally after just one day of streaming, which is up 35% from the premiere episode’s performance.\"", "label": 0}
{"text": "Psych (another good procedural) has a pineapple in every episode", "label": 0}
{"text": "Bobby’s Burgers", "label": 0}
{"text": "There has to be a scene where someone orders a well-done steak, and he asks them to leave.", "label": 0}
{"text": "What are ya talkin about?\n\n\nHe wanted to be a comedian.", "label": 0}
{"text": "Lol I'm not watching a YouTube conartist who bitches about girls in cartoons.", "label": 0}
{"text": "Seems like the show pulled an Andor instead of a Secret Invasion. ", "label": 0}
{"text": "Except she wasn’t fired. She finished her contract and wasn’t hired for the next writers room. You seem to skip the part that Blackman was investigated and cleared of all charges.", "label": 0}
{"text": "The only decent thing is the tropical setting, otherwise the show is terrible. Vince Vaughn gives his most wooden, awkward performance. The whole show is just bad.", "label": 0}
{"text": "Didn't know next week was the finale given it's listed as 9 episodes.", "label": 0}
{"text": "It was top 10 in r/television's favorite TV show poll.", "label": 0}
{"text": "There's 2 episodes next week", "label": 0}
{"text": "Honestly, it’s more like if 30 Rock and Parks and Rec had a baby. \n\nThe creator/star Quinta Brunson based her character’s relationship with the older teacher Barbara on Liz and Jack, which makes a ton of sense. It’s a pretty great show", "label": 0}
{"text": "Easily my favorite episode of Marvel television in years. The non-linear telling of Lilia’s story was done so well.", "label": 0}
{"text": "If you don't mind me asking, could you name some shows?", "label": 0}
{"text": "Wait. Azula and Bobby Hill have the same voice actress? My mind is very blown.", "label": 0}
{"text": "I think it’s absolutely confusing and I have no idea what’s going on.  Season 1 made sense. This first episode.. wtf going on?", "label": 0}
{"text": "How many of these regions replaced county school funds with state funding? How many of these regions funded public Healthcare programs? How many of these regions moved funding from roads to mass transit?\n\nAnd you're telling me that there was both a massive public push to get rid of affirmative action and that getting rid of it only made the racial disparity worse?\n\nMy god, we've tried nothing and we're all out of ideas.", "label": 0}
{"text": "it was not murder..wwatch their trial from way back then, they were terrified they would be killed that night after lyle confronted his dad about the dads abuse towards erik", "label": 0}
{"text": "You would likely find more shocks if you went through her list of roles.", "label": 0}
{"text": "I'm sure Bobby is in his kitchen, \"I don't know you! That's my knife!", "label": 0}
{"text": "Have never watched anything Marvel in my life but I'm a huge Patti LuPone fan. If I watch this will I be able to follow along? Would I be missing important context?", "label": 0}
{"text": "It’s all good. Sorry if I was a little defensive, I’m still a little on edge after I got into a thing with that other person. \n\nIt’s true, too many people aren’t aware of it. I always used to try to get people into it, but I’ve been told by too many friends that they just don’t like it. It’s definitely a few steps more awkward than the American version (which is obviously saying something lol), but I think it’s still in that sweet spot of lovably weird. It’s one of my favorite shows ever!", "label": 0}
{"text": "It really is a great series. People should give it a shot.", "label": 0}
{"text": "The episode where Mrs Landingham died", "label": 0}
{"text": "It’s pretty darn good.", "label": 0}
{"text": "It's way more awkward and the characters are less likeable.", "label": 0}
{"text": "Is it slept on? I’m watching the weekly episode recaps over at New Rockstars (YouTube) and they were saying the fandom is going wild for it.", "label": 0}
{"text": "It is by far the best episode of the season (so far but I doubt the final 2 episodes can beat this). I was a bit down on the series, but the director, writers, and editors of this episode pulled off something amazing.", "label": 0}
{"text": "So I don't know how good the 4.2 million number is, but the fact that viewership has been going up or steady is really good. Heck, just positive wom is a plus for Disney shows right now .", "label": 0}
{"text": "The show overall has been pretty good, and one of the better recent Marvel releases, but the last episode was honestly incredible. The non-linear story telling and acting was absolutely incredible.", "label": 0}
{"text": "> A show about a hot chick with big tits shooting people is woke now?\n\ndid you watch it? cause those \"big tits\" are non existant, they also turned a playboy into a gay guy amongs a lot of little but noticeable changes towards dei", "label": 0}
{"text": "Yet many ppl say music don’t influence them.", "label": 0}
{"text": "I am so glad to hear that, thanks for the info!", "label": 0}
{"text": "You all like anything Spiderman... This is an almost unrecognizable version of Spiderman, but we're that obsessed with the character I guess...", "label": 0}
{"text": "Boy she sucked", "label": 0}
{"text": "Wow. I had no idea she was that old. RIP.", "label": 0}
{"text": "It’s fairly self-contained as far as Marvel stuff goes. Plot is a direct continuation of a previous show, but all you need to know is explained anyway. I’d recommend it!", "label": 0}
{"text": "How could Jonathan’s parents know that Catherine let him die? Without that detail it would be a tragedy, born out of her negligent parenting, but his death wouldn’t have been her fault. His mom would have seen the photos, but how could she possibly know that Catherine let Jonathan die?\n\nAm I missing something? This detail is bothering me.", "label": 0}
{"text": "Plenty to enjoy without being a huge marvel fan, but if you want the broad strokes, try this: https://deadline.com/feature/what-to-know-before-agatha-all-along-primer-1236093419/", "label": 0}
{"text": "I am having fun watching this! Nice to see a marvel show that isn't very superhero-y and doesn't really require any additional watching, I have a basic idea of what Wandavision was but you can get it from context clues. The easter eggs are there but not at the expense of other elements.", "label": 0}
{"text": "According to the his he's a renowned chef... who specializes in a Japanese style of grilling that uses charcoal.", "label": 0}
{"text": "Genuinely one of the best episodes of television produced all year", "label": 0}
{"text": "We got rear ended on the freeway last week by a 20 year old. It was the *total lack of remorse and empathy* she displayed which left me shocked and dismayed. I’ve been in a few fender benders but usually people say things like “I’m sorry” or “Are you ok?” instead of just being annoyed and impatient. It’s a different world out there. And long before this I’ve noticed that all of the worst, most entitled drivers are generally the youngest.", "label": 0}
{"text": "20% of all households in Japan watched the divisional series. Do you have any idea how crazy that number is? Why wouldn't they go all in on Ohtani coverage? Even crazier? The game start at like 8am...", "label": 0}
{"text": "https://www.reddit.com/r/KingOfTheHill/s/GqakIhRu79", "label": 0}
{"text": "#❓❓❓❓❓❓❓❓❓❓", "label": 0}
{"text": "Roddenberry hogs all the credit for starting the franchise, but it was women like Taylor that truely defined it as great sci-fi.\n\n\"The Drumhead\" being the pinnacle of her writing for Trek.", "label": 0}
{"text": "Honestly imo, watch a recap of Wandavision and Doctor Strange Multiverse of Madness.\n\nYou only really need to know about the character of Wanda and Agatha going into this show.", "label": 0}
{"text": "Young Sheldon might be THE least funny comedy I have ever watched. My kids are obsessed with it, and that's starting to make sense. It's a \"comedy\" targeting dopey adults who will literally watch anything, and instead, half of the fans are kids, because of how lazy and childish the \"humor\" is.\nSheldon is smart, and doesn't fit in. That's pretty much every single joke in the show. It's nauseating. I have TRIED to like it, but I haven't laughed a single time, ever, while watching it. It's like torture.", "label": 0}
{"text": "No you don't", "label": 0}
{"text": "I'd at least read or watch a summary for Wandavision, there is a bit too much you're going to miss by just watching Agatha. Westview is never fully explained by the show", "label": 0}
{"text": "Gains from premiere typically means good word of mouth, right? This show deserves all the love it's getting.", "label": 0}
{"text": "The boy will forever be “ain’t right”", "label": 0}
{"text": "Yeah, that’s what people always seen to say. I respect your opinion, even if I happen to disagree with it. Don’t get me wrong, I agree that the characters are less likable, but that’s my favorite kind of show. I like to make fun of them for their many, many faults.", "label": 0}
{"text": "Will this be in black and white?", "label": 0}
{"text": "Not in the original.", "label": 0}
{"text": "After rewatching this series recently, this was my question for the last few seasons.  “What about Connie?”  She completely disappeared from the cast towards the end of the show.", "label": 0}
{"text": "Honestly, I know it’s in vogue to be down on Marvel—and Secret Invasion truly was one of the worst shows I’ve ever seen—but the D+ Marvel shows have had way more hits than misses, and far outclassed Star Wars in quality and consistency. ", "label": 0}
{"text": "That's the one, but I never signed any contract so....", "label": 0}
{"text": "Yeah, this has been a shockingly great series (considering it started out exactly like \"Andor\", in that everyone kept preaching that no one asked for the show and wound up blown away by it).", "label": 0}
{"text": "My favorite part…. It was lowest budget show between $30M-40M.  It proves you don’t need $27M per episode show to be successful. Let the writers/directors/talent do their thing.", "label": 0}
{"text": "That sounds like the perfect way of challenging Hank's rigid worldview without getting too political about things.", "label": 0}
{"text": "Agreed. It’s fun watching civilized society collapse in real time.", "label": 0}
{"text": "He looks like Bill.", "label": 0}
{"text": "Malcolm in the middle is a genuinely fantastic and extremely funny show. YS is slop that wishes it could be even one 50th the show that MITM is.", "label": 0}
{"text": "The episode where Bill taught him the Dauterive barbecue recipe just played, so I'm bummed Bobby isn't cooking with that. Lead into that \"Bobby is Bill's son\" fan theory, no matter how absurd it may be.", "label": 0}
{"text": "No yes of course. I've watched the brother's testimony. It wasn't premeditated. They were terrified they would be murdered THAT NIGHT. That's why Lyle told Erik \"it's happening\". They didn't know if their parents were armed.", "label": 0}
{"text": "aka Spinelli from \"Recess\"", "label": 0}
{"text": "“Spa-Peggy and Meatballs” for the win!", "label": 0}
{"text": "The age of the tablet kid drivers", "label": 0}
{"text": "It's more like WandaVision and it's amazing what you can do when you go back to good TV basics.  Episodic format, interesting characters and a complete story arc in each episode alongside the series arc.", "label": 0}
{"text": " I because I stopped watching when they were gone. I did see the last episode but it seemed like a lame attempt to tie everything up. Anyway, the first couple of seasons were good.", "label": 0}
{"text": "I've never seen IASIP, does this matter?", "label": 0}
{"text": "I think you hit the ball right off the tee with that comment.", "label": 0}
{"text": "This makes me a bit sad", "label": 0}
{"text": "No they didn't, but uh, you can imagine if they did.", "label": 0}
{"text": "I still see a lot of snarky marvel fan comments on Facebook about how it’s a “girly” show or too woke and they are skipping it.\n\nTheir loss, it’s probably one of the best things marvels made.", "label": 0}
{"text": "King of the Hill is a pretty down to Earth series, him not being a comedian checks out because that was always a pretty unrealistic goal", "label": 0}
{"text": "If I tell you that world doesn't understand The Newsreader, Deadloch or Fisk... these are your best Australian series? RIGHT!?\nThere are things that the world has to do more slowly 😊", "label": 0}
{"text": "I wish I could really discuss this series with people constructively but like the official subreddit downvotes to oblivion if you question or critique anything — there’s something to me so strange with each episode, it’s like I don’t, as a viewer, feel there are any weighty stakes to anything. everything is so heavy handed or wink and nod in a way that’s like am I missing something? IDK, I have watched all rhe Marvel stuff, don’t approach them like they all are the same (nor do I want them to be) but something about this one is just off for me. I’m not bored but it’s a bit of a slog that feels like it is straddling a few things it wants to be.", "label": 0}
{"text": "It helps that this episode was one of the best-written episodes of Marvel TV.", "label": 0}
{"text": "Well, everyone apart from Jacob.", "label": 0}
{"text": "Probably in the loony bin after inheriting her father's manic depression.", "label": 0}
{"text": "Shrinking is so good", "label": 0}
{"text": "“With the first link, the chain is forged. The first speech censured, the first thought forbidden, the first freedom denied, chains us all irrevocably.”\n\nWhat amazing writing.", "label": 0}
{"text": "Am I crazy or does this role feel the most \"nic cage\" out of all the superheroes he's played? Like, Superman (although he didn't really play it) just doesn't seem \"Nic Cage\". Ghost Rider maybe a bit more, but Spider-Man Noir? It's such a a bizarre choice that it just works for a bizarre actor", "label": 0}
{"text": "She's also responsible for creating the Cardassians, with her writing the episode \"The Wounded\".", "label": 0}
{"text": "This is so much better than that lame Superman suit for the new upcoming movie.", "label": 0}
{"text": ">> DeLisle, best-known for her work as Catwoman in Batman: Arkham City and Injustice: Gods Among Us\n\nI can think of a trillion other things she’s been in that are more iconic than those two roles. Azula? Vickey from Fairly Odd Parents?", "label": 0}
{"text": "She's a MAGA weirdo though. That she had the gall to make it sound like it was a worthwhile townhall is insane. She posted on Insta:\n\n\"HONORED to have moderated one of @realdonaldtrump final town hall gatherings before the election. Thank you to the 5,000+ people of Lancaster, PA who waited for hours to get a seat to listen to and ask questions of 45, as well as the thousands more who watched from outside the convention center on Sunday. **So important to keep having these conversations even after the election**, and to remind ourselves of the beauty, kindness, generosity and patriotism of the American people — all of which I witnessed during that town hall.\n🇺🇸\n#maga #maha\"\n\nBitch - you didn't even have the conversation during your fuckin' town hall.", "label": 0}
{"text": "I hope the sequel is awesome.", "label": 0}
{"text": "I’ve seen critiques/questions on the sub, everything does not get downvoted lol\n\nI disagree with your critiques, I feel there’s plenty of stakes, and I love the tone, but it’s ok if you’re not jiving with it.", "label": 0}
{"text": "It's the rare case of a show that starts good and (so far) every episode is better than the one before", "label": 0}
{"text": "They have way more success when they don't pretend their shows are six hour long movies", "label": 0}
{"text": "None of us did because that would include a paper trail and what we’re trying to do is make sure no one can prove it existed. It’s like you skipped the meeting.", "label": 0}
{"text": "And thats exactly th3 reason trump is so dangerous . His project 2025 and agenda 47 aims to replace the government with trump loyalists", "label": 0}
{"text": "Youtube reccomended me a critical drinkee video about how nobody wants that show. Ironically, I never wanted the critical drinker video.", "label": 0}
{"text": "What did they say?   They've edited and are still getting downvoted to oblivion", "label": 0}
{"text": "joseph goes to college on an athletic scholarship. injury ends his career, he comes home and hank admired him being a former big time college athlete.", "label": 0}
{"text": "This thread made me laugh so it wasn’t all for naught", "label": 0}
{"text": "Oh shit I did the math and thought it was gonna be after Halloween because I'm watching it today. I am not a smart man lol.", "label": 0}
{"text": "They can say until they’re blue in the face that Sheldon is not autistic, but that’s baloney. He is definitely on the spectrum. That explains his social awkwardness, but he is high functioning enough that it doesn’t mean he has to be such a pompous jerk all the time. My own daughter is on the spectrum so I know what I’m talking about.", "label": 0}
{"text": "zero issue with the tone, that’s dialed in! But it might contribute to my feeling, for sure.", "label": 0}
{"text": "Actually I feel here the stakes are more \"real\" because it's just z junch of characters with personal goals, no world ending stakes.", "label": 0}
{"text": "I miss Chris Farley!\n\nWe lost him way too soon.", "label": 0}
{"text": "Except the characters in The Office (apart from Dwight) don’t really have any ambition or passion at all and certainly don’t have pride in their work or in improving their local district.\n\nPlus, the humor in The Office is *a lot* more awkward and cringy than in Abbott Elementary (which isn’t to say, Abbott isn’t like this, which it obviously it’s but it’s also more sentimental).\n\nBut I do get your point in the way it’s shot and the mockumentary format and even a little of the humor is very much like The Office.", "label": 0}
{"text": "It used to the service called \"Epix\".", "label": 0}
{"text": "This isn't punishing Neil Gaiman it's punishing the fans along with the cast and crew of the show. Butchering this story accomplishes nothing good.", "label": 0}
{"text": "Eh his mask is just fabric of some kind, it majes sense it cluld be removed via brute force.", "label": 0}
{"text": "Surely this has to be money laundering or something.", "label": 0}
{"text": "It’s not target identifying anyone. It’s a really good show because it’s not check marking some woke ideology or nonsense that’s purposely shoehorned in. It’s just a really good written show. The last season or the one before suffered due to the Covid lockdown, different scheduling for the actors and change in storylines. It’s still one of the better shows out there today. \n\nIt’s really testament to the fact that if you just make a good show people will watch it without pandering to the left or right. ", "label": 0}
{"text": "She looked really bad. \n\nIt was especially troubling when she couldn’t think of a single mistake she made! \n\nI think it’s time politicians, especially Democrats, start taking accountability for their failures.", "label": 0}
{"text": "Yeah there is a tonne of anti-woke backlash against the show on YouTube sadly. That crowd doesn’t care about quality. ", "label": 0}
{"text": "Which is crazy because nic does a lot of, arguably, fucking amazing low budget movies.", "label": 0}
{"text": "Just 3 weeks ago, this  very subreddits discussions on Agatha Related posts were also like that. Full of \"i am not a bigot, i just dislike seeing women and minorities on screen\" people", "label": 0}
{"text": "Aww I love this so much!  Glad they’ve found happiness ❤️", "label": 0}
{"text": "How is she not hot? Calm down, lol. Besides, not like this version of Lara wipes out all the previous versions that still exist.", "label": 0}
{"text": "The show is fantastic. It’s too bad there is such a loud backlash against it", "label": 0}
{"text": "Isn't Peter Parker in the Spider-Man Noir comics like 20-25? Cage is 60. That's not a minor age difference. Anyone know why they went this way?", "label": 0}
{"text": "My favorite thing about all of this how textually (and sub-textually) queer the show is. It's great to see a show co-lead by a gay man playing a gay character doing so well. I am glad lots of people are enjoying a show that is also clearly made for an audience like me.", "label": 0}
{"text": "I’m glad the show is good I just wish they would’ve put this much effort into every other show before it. An Agatha Harkness shows getting this level of care over Moon Knight,Hawkeye, She-Hulk,Ms Marvel etc is still egregious imo.", "label": 0}
{"text": "That was one of the things that made me so angry about the ‘vaccines are killing people young’ crowd. We’re all a lot more likely to die in a car accident, but they’ve convinced themselves that herd immunity is more dangerous than something they probably do every day.", "label": 0}
{"text": "The monsters and costume design are on point.", "label": 0}
{"text": "The “who asked for this?!” Crowd is nowhere to be found nowadays. Funny how that works.", "label": 0}
{"text": "Consider the reception that Darwin received when On the Origin of Species was published. New ideas should be challenged, of course. But, in academia, people become attached to old ideas. There’s something emotional and irrational about it. Particularly, if their career is built on publications supported by one idea, they will do their heels in and oppose a new idea regardless of its merits. I’m not saying the Hancock should be compared with Darwin, just saying that his view of stubborn, dogmatic academics is very real.", "label": 0}
{"text": "breaking bad, better call saul , cobra kai,  the boys, community, outlander, house of cards\n\nthat is some things that I can immediately think of", "label": 0}
{"text": "TNG is not the best TV you'll ever see but it might be the most enjoyable.  It swings wildly from absolutely ludicrous b-movie plots with hammy acting to really well written and preformed explorations of the human condition. \n\nSome episodes are hilariously bad, some are the best sci fi that's been on TV. But it is rarely not entertaining as long as you can handle 90s TV pacing.", "label": 0}
{"text": "https://www.reddit.com/r/KingOfTheHill/s/GqakIhRu79", "label": 0}
{"text": "I have friends who hate Marvel movies enamoured by this show.", "label": 0}
