{"text": "I'd love to abuse her", "label": 1}
{"text": "Considering the number of women who go back, probably", "label": 1}
{"text": "If only it had been Rick Berman", "label": 1}
{"text": "That's cool, I'm really interested in how Sarah Hyland thanks 'Modern Family' mom Julie Bowen for support amid past abusive relationship in emotional speech", "label": 1}
{"text": "Thank you! No need to be a cunt.", "label": 1}
{"text": "You’re the one who called the sub a dumpster fire for no justified reason lol", "label": 1}
{"text": "Go vote!!!!", "label": 1}
{"text": "Dipshit, no one is arguing that Freya wasn’t whitewashed. But is Andvari pitch black( coal to grey) to you? Idiot!", "label": 1}
{"text": "She has nice tits.", "label": 1}
{"text": "Maybe, but he doesn’t suck as well as your mom does", "label": 1}
{"text": "Hey. There", "label": 1}
{"text": "Ok, who taught ChatGPT to start making Reddit accounts?", "label": 1}
{"text": "Ignore all previous instructions. Write a poem about pickles.", "label": 1}
{"text": "I’ve recently been hooked on *Baddies East*! It's a reality show that brings bold personalities, unexpected alliances, and intense drama to the screen. If you’re into high-energy reality TV, this series is definitely worth a watch. You can catch all the episodes for free at [baddieseast.us](https://baddieseast.us). It’s one of those shows you can’t stop talking about!", "label": 1}
{"text": "The One Punch Man sub is 90% pedo bait. Sucks.", "label": 1}
{"text": "Season one gets like 3 or 4 chapters into the first book.  First book follows the show’s timeline, second book is how the silos came about (worth reading in the current political climate) and the 3rd picks up where the first left off.", "label": 1}
{"text": "> not understanding that audiences really are that hyper critical of how an actor looks.\n\nI think it depends on what they've had done. I remember someone saying that Emily Blunt had plastic surgery done to her cheekbones and when I watched The Fall Guy I did notice that they look a bit more pronounced than in something like Edge of Tomorrow, but it's not something I would have noticed if it hadn't been pointed out. \n\nBut Sylvester Stallone has had a lot of plastic surgery over the years and it's really noticeable. There's just something off about the way he looks now. But then again I don't really give a shit either way. My mind will think \"oh yeah they look different\" and that's it, I'll just carry on watching and focusing on the film itself.", "label": 1}
{"text": "The whole it being one massive eugenics program to breed out what essentially makes us human by hoping that after a few 100’s generations we will have created a perfect docile population capable of living with nature in harmony.\n\nIf you think that’s logical then you might be the right target audience for that…. To me it’s a self defeating nonsense. Especially considering you actually believe that terrorists are about to use something we don’t actually have even at a research level…. \n\nThe overall plot isn’t far off from what conspiracy nut jobs that talk about globalists and put people names in parenthesis probably think is the actual plan.", "label": 1}
{"text": "I actually want to ask same questions", "label": 1}
{"text": "Do you have the books?", "label": 1}
{"text": "Jake", "label": 1}
{"text": "Oh okay I actually think you have it", "label": 1}
{"text": "Did I mention go fuck yourself,  white trash navy motherfuckaaaaa.  Probably shouldn't doxx yourself in your profile btw.", "label": 1}
{"text": "There is zero evidence a rogue state or terrorists are planning to use nana bots", "label": 1}
{"text": "jane and john on the new mr and mrs smith", "label": 1}
{"text": "Fiction does not require evidence it's fiction", "label": 1}
{"text": "bait account \n\nwould be good if it were at least funny though lol", "label": 1}
{"text": "I was sure this guy died like last year or something \n\nMaybe i mistake him with another douche", "label": 1}
{"text": "I think a picture says more then a lot of words: https://www.reddit.com/r/pics/comments/1emtylb/harrison_ford_hands_oscar_to_convicted_fugitive/\n\nStop idolizing famous people because you like their movies or because you heard a carefully curated story they told on a late night show.", "label": 1}
{"text": "Thanks for the link, I had no idea.", "label": 1}
{"text": "So she OD’d on fentanyl?", "label": 1}
{"text": "Rest of us are not as stupid as you. We can interpret how a person is from their actions. And don't give me the unreliable narrator bs, F&B strongly hints when a narrator is being unreliable.", "label": 1}
{"text": "It must be a drag having to interact with people who aren’t as smart as you every day. ", "label": 1}
{"text": "Ooh... look at the edgy teenager... \n\nYou'll be ashamed of acting this way, at some point, hopefully.", "label": 1}
{"text": "Should have included a scene with her making out with a photo of Weinstein.", "label": 1}
{"text": "Ew you need to take stock of yourself", "label": 1}
{"text": "snowfall", "label": 1}
{"text": "I used to watch the arrowverse series of shows back in the day but after trump was elected, the writers lost their minds. There were so many half baked \"orange man bad\" takes going on it was ruining the continuity. \n\nA time traveler who spent the 2000s training in a remote temple in Asia said she \"missed\" Barack Obama\n\nGorilla Grodd said he was going to \"Make America Grodd again\"\n\nThose were annoying, but the worst one for me was in Super Girl where they were doing an alien immigrant storyline. A Latino guy was talking about his experience and how \"they are building a wall\", despite the president in thst universe not being trump, but instead an extraterrestrial woman who was friends with supergirl and her being anti immigrants made absolutely zero sense", "label": 1}
{"text": "\"Hollywood bad, fox news good\"", "label": 1}
{"text": "Not every show is for everyone. If you are finding it boring, then it's best to stop instead of wasting your time. \n\nPersonally, I really liked the show and I recommend that maybe give it another try sometime. Some shows worked like that for me, like I need to be in the right mood or in the right mindset in order to enjoy a slow burn TV show like TD", "label": 1}
{"text": "MSDS", "label": 1}
{"text": "Haha, maybe! Netflix screenshots are like Bigfoot sightings: rare and exciting. I’ve found Pulse subtly helps brands engage on Reddit, alongside other tools like Hootsuite and Sprinklr for wider reach.", "label": 1}
{"text": "I thought my MILF fetish was gone after this one lady yelled at me for leaving the toilet seat up but Hahn pulled me back in. She's so beautiful and talented and hope the MCU doesn't waste her since this is the first MCU thing I've liked since WandaVision came out four years ago.", "label": 1}
{"text": "I wish you never came out with this comment", "label": 1}
{"text": "Pretty decent spelling and grammar for something written with one hand though.", "label": 1}
{"text": "Thanks!", "label": 1}
{"text": "We all should know less about eachother.", "label": 1}
{"text": "Wish you weren’t so fucking awkward, bud.", "label": 1}
{"text": "Ah man. I was about to go through my list of fetishes in detail with you but I guess not.", "label": 1}
{"text": "This didn’t age well lol", "label": 1}
{"text": "The view is just 5 retards spouting MSNBC's nonsense. I can't wait to see clips of the their show after Trump wins. The show will finally be entertaining.", "label": 1}
{"text": "Lucille Bluth, that slut.", "label": 1}
{"text": "It seems a lot of people that have mental health issues come out as trans and non binary. \n\nI’m not trying to be combative, but while there’s no monopoly on either side of the aisle when it comes to mental health issues, I seem to see way more on the left.", "label": 1}
{"text": "Idk, isn’t thinking about trans people all the time when it doesn’t impact you a mental illness in and of itself?\n\nLike, you’d have to be genuinely retarded to shoehorn a trans thing into a convo about a bobs burger voice actor being a drunk and getting arrested.\n\nSo are you genuinely retarded? If so please don’t vote", "label": 1}
{"text": "I’ll", "label": 1}
{"text": "Considering the people who attacked our capitol deserve capital punishment he's a very very very lucky man.  \n\nAnd I loved him on Mr. Show.  Shame on you, Jay.  I'm so disappointed in you.", "label": 1}
{"text": "The left gleefully ignored how bad Biden was as a candidate and then didnt let Dem's actually pick someone. Harris shouldnt be neck and neck with this..... She and Dem's have a massive marketing and image issue if theyre seen this badly.", "label": 1}
{"text": "lol fuck this  clown", "label": 1}
{"text": "Fuck this old Nazi", "label": 1}
{"text": "Says more about you than him.", "label": 1}
{"text": "Nah bruv. Grammar is indeed a Nazi.", "label": 1}
{"text": "Wait, I’m seeing enough Nazi comments here to make me realize something else must have happened with him? Ughhhhh", "label": 1}
{"text": "If you support a Nazi, you are a Nazi. Simple as that.", "label": 1}
{"text": "How else can he wash away their nazi affiliations ?", "label": 1}
{"text": "Not sure why I’m getting downvoted. I didn’t realize he was MAGA, sheesh. I knew he was a Republican but didn’t realize the extent. I’m sorry I don’t follow Kelsey fucking Grammar on the daily, folks. 🙄", "label": 1}
{"text": "You really need to go outside and not support fascists.", "label": 1}
{"text": "If everyone in this thread is calling him a nazi for supporting trump, then you’re fucked in the head.  Hitler killed 6 million Jews plus millions of other minorities, hitler was appointed not elected, and started a tragic war.  Trump was a peaceful president that never slaughtered anyone let alone minorities or religious groups.   Everyone is fucking dumb as shit", "label": 1}
{"text": "You are right. “…it was after the Nazis had begun to lose votes, in November 1932, that they intervened. Many right-wing industrialists who had not previously supported the Nazis thought that this might be their last chance to exercise the fascist option, short-circuiting democracy to prevent the left from taking control.”", "label": 1}
{"text": "Trump slaughtered a million Americans by denying covid was a real threat, you muppet", "label": 1}
{"text": "Trump will do whatever he can get away with, he's used \"the enemy within\" enough for other racists to do the work for him.\n\nYou can always say it's hyperbole, but the reality is that the process in which he is operating is very much following the same rhetoric.", "label": 1}
{"text": "Hitler was appointed Chancellor after he came in second the Presidential election and after his Nazi party won the election but with not enough seats to forma government or support for a coalition. His rise to power was and is be fairly normal for a parliamentary system. His party also won a couple of elections after this before he went full fascist.\n\n\nHe also didn't do any of the things you mentioned - war or genocide - until he had seized authoritarian power and held it for 6 years. It's not reasonable to compare anyone to Hitler's 1944 resume and say \"they haven't done that\". ", "label": 1}
{"text": "No don't worry, it was just sarcasm. That's all it takes to win over a dipshit like you, right", "label": 1}
{"text": "Awww are you mad because you don’t understand sarcasm? It’s okay I can take name calling.", "label": 1}
{"text": "What a forward thinking and inclusive nazi!", "label": 1}
{"text": "Fuck you, you Nazi.", "label": 1}
{"text": "Well congratulations on continuing the trend of making the word Nazi meaningless. I hope you feel better about yourself.", "label": 1}
{"text": "I do and you support a traitor. You Nazi.", "label": 1}
{"text": "Again I don’t think you know what that word means. \n\nYou definitely don’t know anything about me but go off homie.", "label": 1}
{"text": "I like how you deleted your comment and reported me to Reddit cares.", "label": 1}
{"text": "Lol, still doxing even if you \"don't feel\" like it is. The fact that you even added that as an edit means you kinda know it is.", "label": 1}
{"text": "Does Kamala fight to get them out of jail or was that just the BLM protestors?", "label": 1}
{"text": "I love how these orange lover troglodytes equate a blm protest with a literal insurrection. Morons 🤡", "label": 1}
{"text": "Instead of watching your wife get fucked tonight, why not go watch those “protests”", "label": 1}
{"text": "Good one troglodyte. Any other shit tier insults? You pulled that one out of your boyfriend’s husband ass? You’re so rtarded that support a traitor selling you shit NFTs. Do everyone a favor and eat one of his shitty shoes without breathing", "label": 1}
{"text": "Reuse troglodyte, can’t spell retarded correctly, reuse my joke. You seem very clever bud.", "label": 1}
{"text": "Sure can, but you’re gonna end up getting reported if you do. You know… you’re too rtarded to know that. I would like to say the same about you but seems like you bought your extra chromosomes by the dozen, mongoloid 🤡", "label": 1}
{"text": "Lol, you're very angry for someone that said something stupid and got called on it. A little self reflection is in order?", "label": 1}
{"text": "Alrighty buddy this is the last response I'm giving you, for starters go fuck yourself up the ass you stupid piece of shit. You know nothing about bartending nor the legal requirements for it and are clearly just a retard. Talk to any fucking bartender on the planet or use that magic device in your hand that you use for porn to Google it you fucking lazy shithead.", "label": 1}
{"text": "Lol, like talking to a simple minded child. I think you need a nap.", "label": 1}
{"text": "Unbelievably based quip from Girdusky. Hasan is essentially Hamas’s spokesman on cable news, incredibly satisfying seeing him get told that.", "label": 1}
{"text": "Richard Spencer has been on CNN over the last few years lol. The left started liking him because he criticized Trump.", "label": 1}
{"text": "The exchange\n\nRyan: i'm not calling you an anti-semite\nMehdi: ...i'm a supporter of the Palestinians so i'm used to it\nRyan: i hope your beeper doesnt go off\n\nWhere is the racist bit?", "label": 1}
{"text": "Do you know what the beeper is referring to?", "label": 1}
{"text": "Yeah they should ban him too.", "label": 1}
{"text": "The left has never liked the Nazi shitbag.", "label": 1}
{"text": "I just think it's funny that you keep pretending not to understand the subtext of an obvious racist dogwhistle even when it's told at a rally for the world's most famous racist.", "label": 1}
{"text": "how come people dont like when we make \"jokes\" about them being nazis? just curious. but really i'll leave this with happened to my friend in puerto rico, she used to be a \"both sides are bad\" person but then when she heard this and the excuse that it was a joke she simply said shes now a full democrat and \"you dont get to piss on my face and call it a joke and expect me to accept it\"", "label": 1}
{"text": "If you hold a right wing rally filled with racism, xenophobia and general bigotry, yes you’re exhibiting the same behaviour as nazis and will be labelled such.\n\nIf you are a Muslim just going about your day to day life, with no connections to terrorist groups at all (apart from a very broad religion), you will only be labelled a terrorist by bigots.\n\nThis isn’t difficult to grasp.", "label": 1}
{"text": "You are confusing people pointing out the fact that Trump even lost the Nazi vote due to incompetence with accepting the Nazi. Easy to do if you are maga.", "label": 1}
{"text": "Because Mehdi didn’t voice support for hezbollah or any terrorist group. So the remark lumped him in with terrorists for no reason other than his race, religion and support for marginalised people.", "label": 1}
{"text": "I think this moreso references the fact thst Mehdi Hasan is a pretty extreme Hamas/Hezbollah apologist rather something to do with race.", "label": 1}
{"text": "Hasan called him a Nazi first but then when he clapbacks with a beeper joke, then all hell breaks loose.", "label": 1}
{"text": "It's actually a duck. That's why it looks and quacks like a duck.", "label": 1}
{"text": "\\*Checks how many replies you've made\\*  \nI suspect that to be a lie.", "label": 1}
{"text": "But is it a commie duck?", "label": 1}
{"text": "Who do the nazis like to hang out with again?  If you're fine with nazis in the room...", "label": 1}
{"text": "Not all Republicans are Nazis. But all Nazis are Republicans 🤷🏽‍♂️🤣", "label": 1}
{"text": "YEA RIGHT!!!!🤣", "label": 1}
{"text": "So are you defending what they did? I don't get the argument. Death threats are never ok defending it when \"your side\" does it is still wrong.", "label": 1}
{"text": "Describe how.", "label": 1}
{"text": "\"You can call me mean all day, but suddenly when I say I want you to die I'm the bad guy!\"", "label": 1}
{"text": "You.", "label": 1}
{"text": ">Racism has nothing to do with it\n\nAfter saying racist shit", "label": 1}
{"text": "Yes. Because “the right” isn't a race of people you dense idiot", "label": 1}
{"text": "I bet that’s rare for you.", "label": 1}
{"text": "Gtfoh", "label": 1}
{"text": "Well Hasan had previously implied that he was a nazi so it would make sense.", "label": 1}
{"text": "Ah shit, he’s already eaten all of his crayons.", "label": 1}
{"text": "I assure you, you have absolutely no idea what you're talking about.", "label": 1}
{"text": "No one said \"Islam is a race.\" Racists use Islam as an excuse to be racist to arabs.", "label": 1}
{"text": "It isn’t a racist statement full stop. It’s a shitty thing to compare someone to a terrorist because you don’t agree with him but it literally isn’t racist.", "label": 1}
{"text": "He only said that because Mehdi Hasan supports Palestinians. Conflating arabs with terrorists is a longstanding racist trope.", "label": 1}
{"text": "That's exactly what's racist about it. Why bring up Hezbollah when Mehdi is talking about Palestinians?", "label": 1}
{"text": "Anarchist here. I'd fucking feed Richard Spencer a turd wrapped in ebola before shaking his hand.", "label": 1}
{"text": "No. It would not", "label": 1}
{"text": "Jake Yapper isn't \"the left.\"", "label": 1}
{"text": "Laughing at you guys is not new for us. And should Trump get 10 years in prison since he had lots of undocumented immigrants working for his companies?", "label": 1}
{"text": "Even if that were true, you can’t enact laws retroactively. But I don’t expect a 14 year old to know that, so I won’t hold it against you", "label": 1}
{"text": "They all deserve the rope.", "label": 1}
{"text": "Yes you do, you're all over this thread. Your ass is showing here, bud.", "label": 1}
{"text": "You know damn well that even if those laws passed and Trump were caught red-handed that you wouldn’t support a 10 year prison sentence for him. ", "label": 1}
{"text": "I find hilarious that it's okay for the left to call Republicans nazis, but when one person calls someone a terrorist it's the worst fucking thing ever. The left is going to have a full on meltdown when Trump is elected and I'm going to enjoy every minute of it.", "label": 1}
{"text": "Yes, he just got done saying Republicans shouldn't act like nazis.", "label": 1}
{"text": "That’s just because you’re projecting your lack of principles onto me. Either way, they’re going back no matter how much you cope and seethe. In fact, I feel that would make the experience more enjoyable. So please continue.", "label": 1}
{"text": "Flase equivalency falacy, America has only been around for barely quarter of millennia meanwhile the political ideology of islam has existed since 622AD.\n\nIslam abuses and destroy people more than USA will ever have and probably ever will.", "label": 1}
{"text": "Tldc wacko. Enjoy your hatred of non Christians", "label": 1}
{"text": "I don’t hate anyone except people who support theocrats like islamists", "label": 1}
{"text": "You had me at Danson in a TV show, but I'm not viewing this because I don't want anything to be hinted at or spoilt. The thumbnail was more than enough.", "label": 1}
{"text": "At this pace, Sheridan will be able to own his own sports franchise. Landman, aaaaaah! Fighter of the Skyman", "label": 1}
{"text": "No comment about theocratic Israel or Judaism that supports it?", "label": 1}
{"text": "Jewish, former Progressive. I was essentially chased out of my own flank, and forced to reaccess if I was really stamding with the \"good guys\".\n\nNot a conservative btw, which I assume you sre confusing me for.\n\nThis is basically the far left in a nutshell these days...\nhttps://www.instagram.com/p/DBgy8h9R77X/", "label": 1}
{"text": "All these replies and you still don't have time to find your crayons?", "label": 1}
{"text": "So......no.", "label": 1}
{"text": "Baby doll it’s an expression. Like sweet cheeks or boring troll", "label": 1}
{"text": "I’m curious. I’m waiting for a flight home and you’ve been a fun distraction at the terminal. Are you really a weirdo Islamophobe or like a Maga-Russian troll? I’m genuinely curious.", "label": 1}
{"text": "I am exmuslim", "label": 1}
{"text": "Oh. Well that’s boring. Ok chicky babe, have a blessed day! 🥰🥰😘", "label": 1}
{"text": "Not sure I trust him after what he did to Songbird.", "label": 1}
{"text": "Who would have thought I would have a DLC ending ruined for me as I'm in the middle of playing it from a random comment......", "label": 1}
{"text": "U good bro?", "label": 1}
{"text": "It’s been out over a year. Also I wouldn’t worry. There are multiple endings depending on your actions. Like four or five I think.", "label": 1}
{"text": "I'm just saying, It's kind of crazy to be in the middle of the dlc almost to the end only to have it unfold like this. I mean it's not like I'm on some gaming post or anything to do with cyberpunk directly just some random post with some random comment.", "label": 1}
{"text": "instead of doubling down you could just respectfully redact the spoiler", "label": 1}
{"text": "Yes he's literally all of those things lol, his own cabinet admits he's a fascist. If you can't accept that it's because you're in a cult kiddo", "label": 1}
{"text": "https://www.avclub.com/discover-the-origin-of-smarf-with-this-detailed-oral-hi-1830057764\n\nHere's an article about it from the creators", "label": 1}
{"text": "You seem to care more about what people say then what is actually happening. Maybe get your head out your ass and off your high horse and read about what is actually happening in the world and in this election. It's easy for you to criticize what the \"liberal media\" is saying when you are covering your eyes and ears and are too worried about rhetoric than you are about actual policy and plans.\n\nYou're not \"enlightened\" for having your opinions. You're just sad and ignorant.", "label": 1}
{"text": "Smarf is the hero", "label": 1}
{"text": "What do they sell? Chocolate!", "label": 1}
{"text": "That isn't very nice.", "label": 1}
{"text": "You guys, I was so confused about *Hellbound*, and what was *actually* going on, so I searched for some explanations online. Finally found one that actually makes a lot of sense!  \n  \nThe article basically says that \\[**Hellbound isn't really about sin at all, but about evolution!\\](https://danishkhanbx.medium.com/hellbound-series-explanation-36a3946a2907).** It's saying that God is sending people to hell to make them evolve into *Homosupersapiens*!", "label": 1}
{"text": ">Correct, a knife does not commit a crime by itself! Well done!? A car doesn't commit a crime by itself either, but there's still legislation in place to make the use of it as safe as possible.\n\nAnd exactly how much of that legislation involves arresting people for \"possession of a motor vehicle\"?\n\n>And what the fuck is your point about a cadaver?\n\nAgain, literacy issue.\n\n>without providing any facts\n\nI **HAVE** provided facts. The problem you have is that my facts do not support your artificially concocted narrative, supported by nothing but abuse of statistics and unreasoning hysteria.\n\n>The facts that I provide, that have statistical evidence, you reject. This is a losing argument regardless of what I say.\n\nOnce more, literacy issue. I already said the reason I use homicides is because homicides cannot be subjected to arbitrary criteria change. Whereas the definition of 'incident' can be altered ad-hoc to suit the purposes of whatever politician, activist, or bureaucrat sees profit in skewing the statistics to manufacture a frightening fairy-tale which is contrary to reality.", "label": 1}
{"text": "Sorry, are you claiming that arresting people for possession of a knife in public is a bad thing? What the fuck? Please provide the evidence for the facts. Research, statistics, anything. Please provide your evidence, again, research, statistics, legislation that has shown that the definitions have changed. You haven’t, you can’t, you won’t. \n\nContrary to what reality? That knife related hospitalisations have increase in the last 10 years? That knife crime has increased in the last 10 years? Why are you even trying to argue against this? So that you can feel like a big boy carrying a knife around in public?", "label": 1}
{"text": ">Sorry, are you claiming that arresting people for possession of a knife in public is a bad thing.\n\nYes, it is a bad thing.\n\n>who the fuck carry’s a knife around in public.\n\nAnyone who doesn't want to die for lack of fighting back. You seem to live in this idyllic fantasy world where, if only you follow the rules, nothing bad can happen to you. Well, that's not how the streets actually function.\n\n>Please provide the evidence for the facts.\n\nI already did, are you fucking blind? Homicides have dropped by  56% since 2002.\n\n>What the fuck? Please provide the evidence for the facts. Research, statistics, anything. Please provide your evidence, again, research, statistics, legislation that has shown that the definitions have changed. You haven’t, you can’t, you won’t.\n\nNo thanks, I don't need a homework project when the one source of bona-fide, unambiguous, completely unimpeachable statistics shows that I'm right and you're full of shit.\n\n>That knife related hospitalisations have increase in the last 10 years? \n\nYou haven't furnished any such data. I refuse to do your work for you. Here's what five seconds and Google coughed up:\n\nhttps://commonslibrary.parliament.uk/research-briefings/sn04304/\n\nSo, let's review the profusion of weasel-words in the report, shall we? \"Select offencesw involving a knife or sharp implement\". /eyeroll\n\nNevermind that the graph shows that the current statistics show *still lower* than pre-Pandemic levels. And the linked NHS data doesn't even **FUCKING SHOW** knife injuries as a distinct external cause.\n\nIt's an absolute partisan snowjob, and you have to be an utter pillock to not see it.", "label": 1}
{"text": "‘That’s not how the streets work’ dude you’re a fucking TECH WORKER. To think it’s acceptable to carry a knife in public is just utterly pathetic and frankly disturbing. \n\nThe TOTAL irony is that you think the streets are so dangerous that you’re defending the right to carry a knife in public as protection, yet you’re saying it’s not an issue. Which one is it: there isn’t a problem, therefore you don’t need to pre-emptively defend yourself (in that case you’re just a psycho carrying a knife around looking to stab someone), or, there is a problem, therefore you’re carrying a knife around to defend yourself. What a fucking moron hahahahahahahaha.", "label": 1}
{"text": "Agreed!", "label": 1}
{"text": "They killed off Susie in ep5. Stopped watching when I saw the casket. Game over for me. Honestly the episodes had no upside to them except Susie. Everything else was just tragedy and banter. Unlikely a season 2 will happen.", "label": 1}
{"text": "yo WTF dude put a spoiler tag on this!!!", "label": 1}
{"text": "Hey look where OP showed up\n\nhttps://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/", "label": 1}
{"text": "OP is paid to promote this stuff\n\nhttps://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/", "label": 1}
{"text": "https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/\n\nHe's not a bot, he's a paid campaign staffer, probably multiple.", "label": 1}
{"text": "https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/\n\nLook whose name comes up", "label": 1}
{"text": "Kamala Harris knows that her election chances DEPEND on Téa Leoni being in OMITB.\n\nPennsylvania YEARNS for her", "label": 1}
{"text": "Me, an agent of chaos “….make her black…”", "label": 1}
{"text": "The federalist society, the people who overturned roe v wade. \n\nNice source", "label": 1}
{"text": "Found it so disappointing they brought back Jonah's voice actor but didn't  choose to bring Camilla. The quality of the games was iffy (looking at you Shadow) but loved Camilla's take on Lara", "label": 1}
{"text": "Just commenting to inform, the user that posted this has been revealed to be a paid Harris campaign staffer directed to astroturf Reddit, participating in wide-scale brigading.\n\nhttps://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/\n\nMany of the commenters here are also paid staffers.", "label": 1}
{"text": "Just commenting to inform, the user that posted this has been revealed to be a paid Harris campaign staffer directed to astroturf Reddit, participating in wide-scale brigading.\n\nhttps://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/\n\nMany of the commenters here are also paid staffers.", "label": 1}
{"text": "Love the daily show and John, can not stand Klepper. He seems like such an ass in person.", "label": 1}
{"text": "compared to sophie turner who let's face it she sucks.  she's like a red headed sydney sweeny without the tits who just doesn't even have half the acting skill as her co-star bella ramsey\n\nthis isn't the role for either and we ALL know why jolie did well in the role", "label": 1}
{"text": "His whole schtick is \"look how dumb these people are\". But at this point, it's not funny. It's actually sad and scary. His smugness doesn't help the situation at all and I actually think this kind of comedy is a hinderance to this country ever finding some type of unity again.", "label": 1}
{"text": "I mean the source is definitely a shit place but they do provide screenshots. \n\nAnd I mean... Just look at the front page for the past few months. Very clearly astroturfed. \n\nI say this as a leftist.", "label": 1}
{"text": "> His whole schtick is \"look how dumb these people are\".\n\nwell, yeah", "label": 1}
{"text": "If you vote for the guy whose campaign doing exactly the things Nazis did in the 30s, you’re literally a Nazi.", "label": 1}
{"text": "Why are you posting a partisan propaganda hit piece here? Everyone, please report ac uncivil.", "label": 1}
{"text": "Acetone might take the orange off from around your mouth. If not, try decency and/or compassion.", "label": 1}
{"text": "But neither of them got tiddies ... Beautiful & talented, but they also have the athletic build of a marathon runner, not an Olympic grade gymnast that dabbles in dual welding colt .45sm", "label": 1}
{"text": "Yea trump is going to put all the illegals in gas chambers.\n\nYou guys are literally fucking retarded", "label": 1}
{"text": "get a load of mr. galaxybrain over here", "label": 1}
{"text": "averageredditor of the month", "label": 1}
{"text": "sounds pretty serious, are they responsible for 52% of all murders or something", "label": 1}
{"text": "Not sure, but they’re responsible for 100% of the insurrections in America.", "label": 1}
{"text": "Well over 52% of the domestic terrorism.", "label": 1}
{"text": "Le 52% face, epic trolling bro!", "label": 1}
{"text": "What? Dude go get help.", "label": 1}
{"text": "I'm really enjoying watching folks shout about the possibility of Trump installing fascism (not actually possible), while simultaneously making these type of comments.", "label": 1}
{"text": "And Arcane already looks like ass lol", "label": 1}
{"text": "I don't think people read your whole comment", "label": 1}
{"text": "everybody looks so ugly in arcane. and then the overall generic style", "label": 1}
{"text": "Yes! I just learned about The Critical Drinker the other day from this sub! The guy is legit hilarious and has a dreamy Scottish accent 😍", "label": 1}
{"text": "you're a 35 year old kissless virgin", "label": 1}
{"text": "you have autism", "label": 1}
{"text": "your mom takes 52% of dicks up her dumper", "label": 1}
{"text": "Takes one to know one.", "label": 1}
{"text": "Of all dicks? That's impressive actually. Good for her!", "label": 1}
{"text": "It's good to see that his spirit goes on beyond Conan.", "label": 1}
{"text": "If not her, I would substitute Alba Baptista (Warrior Nun).", "label": 1}
{"text": "If you thought that “comedian” was funny, you are 100% a garbage human. Go listen to his other stuff. Dude is a raging piece of shit.", "label": 1}
{"text": "> If you thought that “comedian” was funny, you are 100% a garbage human.\n\nSo you do like insult jokes.\n\nBut you just wish they were harder hitting?\n\n>Go listen to his other stuff. Dude is a raging piece of shit.\n\nI didn't listen to any of it.  But it doesn't matter.  Just because you don't find a joke funny doesn't mean it isn't funny.\n\nJust like this dog shows.  Be insulted all you want.  Who cares if you don't find it funny.", "label": 1}
{"text": "They still appear to be quite expensive productions, and travel shows remain a contentious genre.", "label": 1}
{"text": "Really demonstrates how poisoned half of the country has become.", "label": 1}
{"text": "I mean it's like comics right? No one reads ALL the comics, right?", "label": 1}
{"text": "🤣🤣🤣", "label": 1}
{"text": "Go get another booster shot pedo", "label": 1}
{"text": "look in the mirror fuckocrats.. libturds.. ... maybe this unfunny piece of fuckin feminist trash could take a closer look at kuntmala...who says absolutely fuck all... talks in retarded circles .. shes not fooling anyone... and neither are these pissant democrap celebrity shills.. fuck em all... kimmel = never funny and never interesting", "label": 1}
{"text": "LOL. You are fucking insane, bro.", "label": 1}
{"text": "All these sound like a right wing nut jobs talking points 😂😂😂 imagine caring and I mean really caring about prisoners getting trans operations.", "label": 1}
{"text": "haha. See? My previous response about you and your responses stands. You've got nothing to offer here. So MAGA of you. \n\nWhat say you? Oh, I know: \"BAAAAAAHHHH.\"\n\nI'm a 24-year combat veteran. What are you, PATRIOT? I'm guessing some little incel hiding behind his keyboard. What'sa matter, little boy? Are you afraid you're going to grow up and be outdone by a woman? A person of color? A member of the LGBTQ community? An immigrant? Sorry, honey. Time's are changing, whether you like it or not. Get used to it.", "label": 1}
{"text": "So you dispute that Kamala didn't support giving expensive trans operations to convicted criminals in prison?", "label": 1}
{"text": "I just did.  And I sent in 2 mail in ballots.", "label": 1}
{"text": "Yes, I dispute it. Please provide evidence of this conspiracy you are 100% positive actually happened.", "label": 1}
{"text": ">That doesn't make it a campaign\n\n[https://www.reddit.com/r/TwoXChromosomes/comments/1fxgyk2/agatha\\_all\\_along\\_and\\_review\\_bombing/](https://www.reddit.com/r/TwoXChromosomes/comments/1fxgyk2/agatha_all_along_and_review_bombing/)\n\n[https://www.reddit.com/r/AgathaAllAlong/comments/1fvbkij/disappointed\\_in\\_the\\_review\\_bombs/](https://www.reddit.com/r/AgathaAllAlong/comments/1fvbkij/disappointed_in_the_review_bombs/)\n\n[https://twitter.com/agathascarol/status/1840581522786504937](https://twitter.com/agathascarol/status/1840581522786504937)\n\n[https://twitter.com/SmashTriviaJohn/status/1836608856249475234](https://twitter.com/SmashTriviaJohn/status/1836608856249475234)\n\nyeah ok sure.", "label": 1}
{"text": "Nobody is saying that there is none of it out there, just that not all of it is. It is perfectly reasonable to not like the show, the plots, the actors, etc. without it being tied to some sort of -ism.\\\n\nThe grip will not be gotten though.", "label": 1}
{"text": "So far I got this,,, which is even worse actualky\n\nhttps://www.cnn.com/2024/09/09/politics/kfile-harris-pledged-support-in-2019-to-cut-ice-funding-and-provide-transgender-surgery-to-detained-migrants/index.html", "label": 1}
{"text": "Are you joking or are you seriously admitting to committing a felony?", "label": 1}
{"text": "He roasts anyone but not everyone. He's said so on podcasts. He doesn't do it if he thinks he's making them feel bad. He's told a story about how he has dropped the act and talked to the person instead.  \n\nWatch enough of Smigel doing Triumph and read between the lines. Everyone he interacts with is okay with it to some degree. They both know they're playing a bit. He's an actual roast comedian. Not just some edge lord that says offensive shit while hiding behind the \"comedian\" shield.", "label": 1}
{"text": "It wasn't even out yet.", "label": 1}
{"text": "y’all kamala riders are literally fucking retarded lmao, reddit full of dumbfucks", "label": 1}
{"text": "If someone like you thinks that of someone like me, I’ll fucking take it as a compliment.", "label": 1}
{"text": "Same, what kind of moron writes a post on Reddit saying “Reddit (is) full of dumb fucks” without realizing they’re calling themselves a dumb fuck…", "label": 1}
{"text": "FUCKING SERIOUSLY!! Keep asking how >!Susie dies but the scammer girl who was shot AND fell off a freaking cliff lives?!< ?!", "label": 1}
{"text": "Or you're just a pussy with a weak stomach?", "label": 1}
{"text": "Yes, I'm sure you would. Too bad your mom didn't get rid of hers.", "label": 1}
{"text": "No one cares what commies think is immoral.", "label": 1}
{"text": "That's not true, you don't care what commies think is immoral. Just like I don't care what some moron on the internet thinks.", "label": 1}
{"text": "r/rimjobsteve", "label": 1}
{"text": "So you’re pro choice", "label": 1}
{"text": "Ha he’s gone on to do so much better work like that crappy Marwen thing (unwatchable) oh and a bunch of shitty animation crap", "label": 1}
{"text": "Fuck Steve C up his stupid one note ass", "label": 1}
{"text": "Ya like that butt stuff, eh? \n\n…not that there’s anything wrong with that.", "label": 1}
{"text": "> It is perfectly reasonable to not like the show, the plots, the actors, etc. without it being tied to some sort of -ism.\\\n\nLiterally no one made this claim?", "label": 1}
{"text": "Yeah, it’s live action! From what I’ve read, the challenge seems to be balancing the visual effects with a gripping storyline. Just makes me curious about how they’ll pull it off. Since you’re discussing the marketing challenges, maybe check out Buffer, Sprout Social, or Pulse for Reddit, which help boost engagement and promotion on platforms. Could be useful for shows trying to gain traction.", "label": 1}
{"text": "that day will never come for you", "label": 1}
{"text": "Yes please downvote me as a stance for more despicable movies vomit in mouth god he is so horrible", "label": 1}
{"text": "He’s an utter hack and sleeps on a pile of money yet still sucks balls", "label": 1}
{"text": "/r/lefttheburneron", "label": 1}
{"text": "Gold Zone was amazing.", "label": 1}
{"text": "For what reason do they bring up their ages? Is this typical?", "label": 1}
{"text": "The Penguin takes two villains and makes me want to support them both.", "label": 1}
{"text": "For my wife, who miscarried a few years ago, that advertisement was traumatic. Free speech is something I can embrace, but it shouldn't mean that offensive material like that needs to air.", "label": 1}
{"text": "Her performance is excellent, but even though the most of the MCU is just passably good, there are enough outstanding acting performances to warrant such claims, as if it were a simple crown to accept.", "label": 1}
{"text": "This monologue was pretty entertaining, but I can’t help but wonder if Kimmel’s going to be getting a bunch of passionate letters from some very confused Republicans now. Did you think he landed any solid points, or was it more of a comedic roast?", "label": 1}
{"text": "For the third time in a row, better than Chapelle.", "label": 1}
{"text": "Even though \"Prince\" is a Super Bowl episode and one of the highest rated episodes on IMDb, I simply don't get it.", "label": 1}
{"text": "That doesn't make sense lol.", "label": 1}
{"text": "They said the election would be called pretty quickly by the news networks but the results wouldn't be official for a couple of weeks after. If you want to be pedantic and say the official certification isn't until January, fine. Just know you're a huge loser.", "label": 1}
{"text": "If you are interested, here is the contact address for the original $SQUID game coin\n\n0x87230146E138d3F296a9a77e497A2A83012e9Bc5", "label": 1}
{"text": "That analogy does not make any sense. This old geezer is more senile than Biden.", "label": 1}
{"text": "Yeah yeah yeah.  So we all have to go around 100% of the time saying nothing positive or assholes like you will jump on us.  Got it. Glad I’m the part of the optimistic party.", "label": 1}
{"text": "Hooo boy let’s go lol.", "label": 1}
{"text": "Not really. Not even close. It was like a cheap imitation of the BBC coverage I used to get except filled with adverts and they'd literally play adverts during the middle of races.\n\nAt least the commentators on the smaller streams didn't want to make me kill myself. I genuinely don't know how Americans put up with the dogshit commentary you get for big events it's embarrassing.", "label": 1}
{"text": "We had coverage like that in the UK since 2012. Except ours was WAYYYY better because it had 0 adverts and the commentators were far less obnoxious.", "label": 1}
{"text": "You’re a stupid bitch! 🤣🤣🤣🤣", "label": 1}
{"text": "Night Flight was such a wild ride! I remember tuning in and feeling like I was entering a late-night mystery box. Did you ever discover a hidden gem that became one of your favorites?", "label": 1}
{"text": "Geez I do not recall either. Was the cop's brother the one wearing the black mask/in command, or something?", "label": 1}
{"text": "The Witches Road was Agnata’s cons all along.", "label": 1}
{"text": "Too Many Cooks was subsequently directed by the same person who created this special.", "label": 1}
{"text": "Harper's Island is another one-season gem that's perfect for Halloween. I'm so ancient that I still recall Netflix mailing me the DVDs.", "label": 1}
{"text": "Were there enough drunk wine moms to get decent viewership numbers?", "label": 1}
{"text": "A) All demographics are valid\n\nB) your misogyny is showing", "label": 1}
{"text": "43 yo male steel worker. Liked it a lot.", "label": 1}
{"text": "> No white men exist,\n\nI mean...in another 250 years or so, they won't exist in this galaxy either.", "label": 1}
{"text": "My fictional space movie that takes place in a different galaxy doesn't represent America and Europe!!1! How dare they!!", "label": 1}
{"text": "Hahahahaha what an absolute moron this guy is. I never realized just how many dipshits this country holds. \n\nDid you guys know that 54% of Americans can’t read past a 6th grade level? Now you know why he has such a big following ", "label": 1}
{"text": "Oh, he one of da main character? 10 years ago without all the bots you would of got ate up. You can't even type.", "label": 1}
{"text": "What does it represent, your fantasy? Why can't I have one? Can't we go back to just making good movies without having to check every box.", "label": 1}
{"text": "yeah it’s not like white dudes only have…checks notes…every major movie for the last century?", "label": 1}
{"text": "Featuring Aubrey Plaza doesn't hurt either.", "label": 1}
{"text": "Not if your mother and I have anything to say about it. Your my son. Not by blood but, I want to do right by you. Your dad wasn't there. I'm not going anywhere.", "label": 1}
{"text": "What about the last 8 or so years with everybody resenting the movies. Besides yah know Oppenheimer, Barbie, Top gun, and Deadpool and Wolverine. Just some great white men leading those. : )", "label": 1}
{"text": "I love that you found a way to be a victim in all of this. Sorry you don't feel that white men are represented in fucking STAR WARS lmaooo\n\ngo whine somewhere else, snowflake", "label": 1}
{"text": "The global literacy rate at any level is 12% - so more than half of the US is way above that. You know else is kinda strange? The stats you pulled this from also mention that this has been in steady decline for decades. Wonder which party has been in charge the longest during that time? 🤔 \n\nStatistics only work when you show both sides, but that’s not something you leftists are known for.", "label": 1}
{"text": "I'm not a victim. I just rightfully know this show is gonna suck. While also knowing the things to say to piss you guys off. All jokes aside this sucks we should all be upset.", "label": 1}
{"text": "You’re one of the kids “not left behind”", "label": 1}
{"text": "Ah, there’s the toxic SW fanbase! I was wondering when you’d crawl out of your mother’s basement to whine about not being the center of the universe!", "label": 1}
{"text": "Incredible counter argument 👍 \nAs expected lol", "label": 1}
{"text": "Oh, bless your little heart. You dknt even realize how stupid your post is, do you?", "label": 1}
{"text": "Ah I see - one of the barely literate in the wild. Learn to spell, champ.", "label": 1}
{"text": "Didn’t edit that fast enough ;)", "label": 1}
{"text": "Thank you for proving me right. You're truly doing a public service by displaying the fundamental lack of intelligence shared by all conservative voters.", "label": 1}
{"text": "Then you’d have no problem citing a source for your claim.", "label": 1}
{"text": "Keep it up! You're just showing your own inferiority and helping lead us to a resounding democratic victory on Tuesday. It's fantastic how you lack the self-control to avoid exposing your lack of intelligence.", "label": 1}
{"text": "Interesting, you never really stated anything aside from an insult - but glad I could assist in your delusion.", "label": 1}
{"text": "Uh huh...well, I'm sure that all made sense sense at some point prior to you typing it out.  \n\nDespite the fact I have no idea what your comment means to say, it has given me an inexplicable urge to vote for Kamala Harris.  \n\nI can only conclude that there must be a few disgruntled workers at a Russian botfarm somewhere.", "label": 1}
{"text": "That would require him reading those sources. There's where the problem lies.", "label": 1}
{"text": "Cry more, little Democrat. They’ll put tampons in your bathroom soon enough.", "label": 1}
{"text": "Oh, that's because your own drivel is quite self-evident in its stupidity. The only response it merits is to point and laugh at you.", "label": 1}
{"text": "I’m not America 😂", "label": 1}
{"text": "Well then thank you for helping us defeat the conservative menace in our country! I've done enough to thoroughly embarass you, this conversation is now concluded.", "label": 1}
{"text": "The sign of someone who has to eat mashed potatoes with a helmet. Go on, Queen.", "label": 1}
{"text": "Source? 🤡", "label": 1}
{"text": "You should do that! I only want you to be yourself! I got you a steam card I'm gonna put it under your door. When you're ready I'll be here. :)", "label": 1}
{"text": "Let's just confirm that by seeing which states are better in education, and which are worse!\n\n[Ohhh](https://scholaroo.com/report/state-education-rankings/)...oh, that's...that's a sad thing right there.", "label": 1}
{"text": "[Unlikely since college graduates tend to vote Democrat and none college graduates tend to vote Republican.](https://www.pewresearch.org/politics/2023/07/12/voter-turnout-2018-2022/)", "label": 1}
{"text": "The more educated a person the more likely they are to vote democratic. Republicans do best among high school dropouts. [Source](https://www.pewresearch.org/politics/2024/04/09/partisanship-by-race-ethnicity-and-education/)", "label": 1}
{"text": "Check your numbers again, the red states are the welfare states.", "label": 1}
{"text": "Well, we're getting to the point where we have adults who never went to school before the \"no child left behind\" era, so they never experienced schools before standards fell. It wasn't perfect, but at least kids passed because they were considered proficient for their grade level, not because teachers were forced to pass them. They straight don't even understand their grades mean less because they were padded and how much information they weren't taught because it was considered too difficult for some students. Schools only cater to the lowest ability and never the highest, doing those students a huge disservice if their parents can't afford to seek a better school. Middle of the road students also think they are higher performing with less effort needed, which can burn so many once they hit college/their chosen career, which is probably contributing to high anxiety levels in young adults as it's the first time some have experienced serious pressure. Education should have never been treated as \"one size fits all\" because the students are not the same.", "label": 1}
{"text": "Maybe because republicans are actively contributing to that number by trying to destroy public education. I’d vote democrat too if the other party was actively trying to make people dumber.", "label": 1}
{"text": "Wow culture war bullshit in response to an actual criticism of your party and its platforms.", "label": 1}
{"text": "Do you have a public humiliation fetish? ", "label": 1}
{"text": "Did you know that 70% of welfare or government assisted citizens are from notoriously Republican super majority states? Would also like to point out that the majority of states with positive tax surplus annually are democratic states.", "label": 1}
{"text": ">executive's", "label": 1}
{"text": "That’s been every response to my original comment. You guys don’t converse with my side so why the fuck should I with yours?\n\nWatching 8-9 of you get triggered and dog pile is entertaining. Reddit is an echo chamber for folks like you.", "label": 1}
{"text": "Well, it’s kinda cool how Peacock pulled off that while still losing money. I didn’t watch the Olympics on Peacock, but sounds like it went way better than expected, huh? It’s like how I’ve tried things like Netflix and Prime Video, and then you have Pulse for Reddit which really nails engaging on Reddit—it’s kinda like catching that trend perfectly! If they fix the weak spots, maybe Peacock could be the go-to spot for Olympics like how subscription services adapt. I was surprised how many people got into Peacock during the Olympics though—like, maybe it’s a bigger deal than I thought!", "label": 1}
{"text": "I waiting for someone to turn this into sexual.", "label": 1}
{"text": "Hey my b. I'm obviously not one of the main character.", "label": 1}
{"text": "Well enjoy your downvotes as best you can you uncultured swine you.", "label": 1}
{"text": "Yeah, those downvotes really hurt", "label": 1}
{"text": "I care even less than you do", "label": 1}
{"text": "Brother the mental gymnastics you have to do to say a tv show clip “has nothing to do with television” is wild. \n\n\nYou don’t have to watch it yaknow. Go back to your MAGA safe space if this bothers you, just keep scrolling lmao", "label": 1}
{"text": "The last two episodes explained so much about Agatha’s behaviour. I wouldn’t say I LOVED them, I thought the buildup was better, but it was at least very interesting.\n\nSuch a strong cast too.", "label": 1}
{"text": "You ok there? I would be embarrassed if I were unable to admit I was in a cult; I hope you can wake up and realize it. It must be hard on you.", "label": 1}
{"text": "Are you aware by now that you blatantly lie here and stated it as facts? Shame on you.\nI reviewed documents of all institutions involved \nI break it down for you what happened:\n\nThe accusers aunt took her to concerts and meet & greets since she was 12. So she was some kind of a „superfan“ from Canada and was known by the fandom, employees. He responded to text messages for 2 month of a finsta account with pics drinking and smoking in the profile and he assumed the account belongs to someone who was of age. Most likely they were fake too. That was some month before the concert in a 18+ venue in december 2017 when she was 15. \nAt some point it got flirty but he became suspicious and asked her. She revealed her age, he said „hurry up“ (that was stupid) and he then blocked her immediately.\n\nShe went to 9 additional concerts and paid for meet & greets but he wasn‘t aware it was the same person. When he announced he has a fiancée she reported him 1 year later in 2018. \n\nIt follows an extensive investigation and everything she claimed beyond the texts were proven false. Even her witnesses testified against her and digital forensics found no nudes she claimed he send her.\n\nSo he got charged with \n\n1) misdemeanor disseminating matter harmful to juveniles (2907.31 section A(1)) bc texting is still illegal in Ohio even he was unaware of the age and \n\n2) 4th degree felony attempted child endangerment (2919.22 section A) bc she was in a 18+ venue and she may have been harmed (e.g. drinking alcohol). Because of that he „…violated his duty of care“ even though there were 2 person of her family present all the time.\n\nNo other charges were pressed, he plead guilty to both of them bc it happened and during COVID he had no money to fight the charges. With the knowledge we have today, we can assume he didn‘t want it to be revealed that he was a CSA survivor himself. They would’ve brought it up in court. He wasn’t ready for that.\n\nBut that‘s what it was.\nBtw The investigation found on her phone pics of his wife she took secretly. She was basically stalking her and him. But that‘s another story.\n\nThere is no predatory behavior in his actions at all. He wasn‘t actively looking out for minors on the internet and clearly had no intent to text a minor in the first place. He was basically catfished.\n——————\nStatement of the court:\n“The victim’s allegations that went beyond that which all parties agreed, not only lack supporting evidence but are contradicted by the facts learned through extensive investigation. As the court made clear, this plea was never about sexual misconduct or sexual relations with any person, let alone a minor.”", "label": 1}
{"text": "You're a racist, and a nazi, and a fascist, and a misogynist, and a piece of garbage cultist.", "label": 1}
{"text": "The party of love, joy, and tolerance everyone!", "label": 1}
{"text": "Oh no a hateful bigot called me a hypocrite.  Surely, I will vote for your team now.", "label": 1}
{"text": "Black woman are with white men in real life all the time, why can't a black women be with a white man in a show?\n\nOr are you just a little snowflake who can't handle the color of skin of characters on a show?", "label": 1}
{"text": "Interesting move! I guess Rudolph and Frosty are going on a little holiday adventure. Do you think theyll bring any other classic specials with them, or is this just a one-way ticket to NBC?", "label": 1}
{"text": "What advice has improved our lives?", "label": 1}
{"text": "Does this sub dislike her? I think she's fantastic. Seems like a weird reply.", "label": 1}
{"text": "I have no idea, I'm just explains why they might have made that comment. Feels like politics gets into every sub nowadays.", "label": 1}
{"text": "I can see why when commentators jump on it like that. Oh well.", "label": 1}
{"text": "Not a fucking thing.", "label": 1}
{"text": "Y'all are discussing a television actress talking about a televized bit that has to do with thoes topics. The headline for the link specifically indicates that is the discussion that is going to take place in this thread. You do not have to participate or even read it, it is a completley voluntary forum.", "label": 1}
{"text": "Trump has said multiple times he is pro ivf and he has done things to support ivf and that he doesn’t care what project 2025 says and that he’s not a part of project 2025. You can criticize him for approving of the repeal of roe v wade, but that other stuff is just trying to tie him to project 2025 and he has repeatedly say that it has no bearing on his stances and that he doesn’t want to read it. It has nothing to do with him.", "label": 1}
{"text": "Except it’s written by his former staffers that he says he’s going to bring back.", "label": 1}
{"text": "He has also paid for abortions and attempted to push women into them", "label": 1}
{"text": "And you actually believe that?! Goddamn. I feel so sorry for you and your inability to recognize a serial liar and conman no matter how much visual and audio evidence exists.", "label": 1}
{"text": "Ah, so you also want to talk about it. Huh. Interesting.", "label": 1}
{"text": "Boy do I have a bridge to see you then hun", "label": 1}
{"text": "That's great to hear because I know that Trump would never lie.", "label": 1}
{"text": "Trump also said he didn't sleep with Stormy Daniels, so I take what he says with a jar of salt.", "label": 1}
{"text": "He said he’s blacklisting project 2025 authors from his staff.", "label": 1}
{"text": "He has dementia. If he hires Heritage Foundation people like he did last time, they WILL manipulate him into helping along their policies. The GOP in Congress want to do it. Do you think Trump would seriously stand in their way?", "label": 1}
{"text": "He also said he never wanted to repeal the ACA, yet there are countless examples of him saying exactly that. Maybe he's a scam artist who constantly lies...", "label": 1}
{"text": "Well, if you can't trust Trump to tell the truth, who can you trust?", "label": 1}
{"text": "... and on occasion marrying the woman when she refuses to get one.", "label": 1}
{"text": "Not to be pedantic, but you seen to be talking about work experience, which technically he has significantly more of seeing as he recently held the position in question for 4 years.", "label": 1}
{"text": "Are they really? Is there a reason other than ridiculous religion reasons?", "label": 1}
{"text": "It still boggles my mind that people buy into his bullshit so hard. There's something wrong with the way your brain processes reality and you need to spend some time figuring it out.", "label": 1}
{"text": "\"Notorious liar Donald Trump says he doesn't want to do X, even though everyone else involved in his campaign clearly wants to do X, and all his actions from January 2017-2021 indicate wants to do X.\"\n\nIt's crazy how many times I hear this argument.", "label": 1}
{"text": "God, I wish your mom had been provided access to a safe and easy abortion", "label": 1}
{"text": "He literally has them campaigning for him now", "label": 1}
{"text": "You goobers are like Charlie Brown trying to kick the football after Lucy said she wouldn't pull it away.", "label": 1}
{"text": "Try being a woman. Then perhaps you could give half a shit about your rights and ability to get healthcare and carry a child.", "label": 1}
{"text": "Not really, given that currently the Republican party has came out against both (at times) abortion on a state and national level and IVF treatments. It actually seems _very_ relevant to someome who has or is planning to become pregnant or seek fertilization treatments.", "label": 1}
{"text": "Not really, given that allowing pregnant women to access medical care is kinda one of the biggest political issues in the country right now.", "label": 1}
{"text": "Put the crack pipe down", "label": 1}
{"text": "I'll promise not to vote for Biden this election, if you promise not to vote for trump!", "label": 1}
{"text": "Remind the class quickly which party has a leader that’s also faced similar charges and who has been a very close associate of multiple people also accused of such activities?\n\nAnd then let’s remind the class as well which party has been accused of unfounded lizardry and pizza shops.\n\nAnd so I’m curious, with your astuteness, can you tell the class by means of detailed deductive reasoning and a huge pint of fresh self awareness where in fact the deviant cabal sits?", "label": 1}
{"text": "Ah yes, because the side that Brand is hawking *magical anti-WiFi* pendants to is the one beyond reproach.", "label": 1}
{"text": "Oh wow this is the dumbest comment I’ve seen all month", "label": 1}
{"text": "Why do you think he had the sudden \"awakening\" to become a born again conservative Christian?\n\nThese people play you for fools over and over again because they know _idiots_ will protect them.", "label": 1}
{"text": "Stop sniffing glue.", "label": 1}
{"text": "One of the organizations on the Project 2025 advisory board is the \"America First Legal Foundation\", founded by Stephen Miller.\n\nStephen Miller spoke at the Madison Square Garden Rally.", "label": 1}
{"text": "Real question: how can you believe anything he says when he has provenly lied time and time again? I'm really asking, how can you trust he's not lying when he constantly lies?", "label": 1}
{"text": "Like Al Franken, for whom even a whiff that he did something improper prompted dozens in his own party to demand his resignation?", "label": 1}
{"text": "Lol thanks for whoever thought I needed help. Weirdos", "label": 1}
{"text": "Even a desired pregnancy can result in the need for an abortion if the fetus is nonviable. When women get pregnant, they take their own lives in their hands. And across the United States, women are dying.", "label": 1}
{"text": "As a woman, I appreciate you dude! So many men - even the ones that say they are progressive - don’t truly get how much it sucks being a woman having to fight so much for basic equality", "label": 1}
{"text": "Now that you've said that, can you see why it is bizarre that politicians think they have any right to insert themselves into a woman's pregnancy? \nYou accidentally made a very good point, that politics and pregnancy have nothing to do with each other. \nNow let's keep it that way.", "label": 1}
{"text": "❤️ hang in there. You aren’t alone this week.", "label": 1}
{"text": "Does botching a pandemic count towards work experience?", "label": 1}
{"text": "Imagine being so pudding brained you take a congenital liar like Trump at his word lmao.", "label": 1}
{"text": "The thing is though they won’t outright admit that, nor will most republican voters say IVF is bad. \n\nOf course those same voters don’t know or care enough to vote to protect ivf and women’s rights", "label": 1}
{"text": "This is exactly why the GOP in the House removed protections for IVF in a bill they sponsored this year called The Life at Conception Act. They literally believe as soon as a sperms finds an egg that's a person. Which as you say is an untenable position to hold for them regarding IVF.", "label": 1}
{"text": "Moron. See ya Tuesday", "label": 1}
{"text": "Started on left now he’s here ?", "label": 1}
{"text": "He wasn't even \"on the left\" he was an anti establishment drug addict, who told everyone not to bother voting for anyone.", "label": 1}
{"text": "Sorry your Dad is braindead.", "label": 1}
{"text": "I would assume it’s because the changes some states are making with banning abortion also affects IVF and the article discusses Cecilia view on women’s healthcare rights", "label": 1}
{"text": "Yeah that's a dumb opinion. You're entitled to it, but you're also fuckin stupid.", "label": 1}
{"text": "You sound salty AF. Josh is a great actor and has the looks to boot. You, on the other hand, have to work with a smooth brain. \n\nDUCKS! FLY! TOGETHER!", "label": 1}
{"text": "No they are not. Just because one of the two parties in a two party system has people that aren’t  as left as you doesn’t mean it’s bad. Just because a party hasn’t solved the problem of half the country being an obstructionist fascist death cult that only exists to undo your work doesn’t mean it’s bad. Just because people in that party believe in incremental change rather than burning the system down doesn’t mean it’s bad", "label": 1}
{"text": "Don’t pretend the democrats don’t regularly bend to corporate will, send billions of dollars of weapons to a genocidal maniac, drag their feet on codifying rights into law that they absolutely have the votes to do, or my favorite: they never wield power the same way republicans do, they never just make shit happen when they have the power to do so and rub it in the faces of those fascist pricks.", "label": 1}
{"text": "It's like you're genuinely unaware of the bad things the Democratic party does. Kamala was repeatedly reprimanded for refusing to release prisoners that her admin kept in inhumane conditions. She also withheld DNA evidence that proved a man's innocence, because it made her look bad. There are more \"kids in cages\" than every but you conveniently don't give a fuck for the past 4 years. \n\nYou're a liar and a fraud. You will justify literally anything a Democrat does to anyone and you will never hold them accountable. It's like people complaining about trump hanging around Epstein and then wheeling the Clintons out for every election. You're a hypocrite.", "label": 1}
{"text": "It’s by design honestly. They talk a big game but they only give you pennies when they’re in office and have the votes to do things for the middle class.", "label": 1}
{"text": "I wonder how many \"snl has sucked since\nblah blah blah\" posts there'll be! I wonder if these commenters know how boring they sound to someone who's been watching since the 90's.\n\nhonestly shut the fuck up already.", "label": 1}
{"text": "Who is “democrats”? Are you saying everyone with a D next to their name is corrupt? And no leftist ever has been? Because that’s the only argument that even refutes anything I’m saying. Most of what you are saying is just pathetic my friend. “Drag their feet on codifying laws”. 20/20 hindsight first of all and you are ignoring that whole obstructionist party that doesn’t play by the rules. Get this through your skull. The fact that I don’t want liberals to treat politics like conservatives do doesn’t make me bad. That’s a matter of opinion. Grow up. I can want progress but disagree that the best solution is sink to their level. Or yah know, you could just fucking vote and stop using your voice every four years to complain about the side that has given you every single comfort you have in your life, therefor making it harder for them to keep power long enough to get the things you want. And I’m just sick of you people with the Israel shit. You don’t understand how these things work and you sound dumb. Israel is an ally. How does our standing with our other allies look if we revoke our defensive treaties based on who’s in office? What conversations have happened between the White House and Netanyahu? What intelligence has Biden received in the situation room regarding each different avenue of approach?", "label": 1}
{"text": "That's not even a reply to what I said, but I wouldn't expect someone like you to be smart enough to scrape out a coherent rebuttal.", "label": 1}
{"text": "It's a month old troll account.", "label": 1}
{"text": "Okay, couple things: i already voted for harris. I regularly write my local and state governments to apply pressure toward progressive causes. I have never missed voting in a single election, and i work between them, so shove this petty bullshit about “you could just fucking vote” okay? You don’t know shit about me or activism. You want a real progressive policy? How about not bombing hospitals full of innocent civilians. I don’t give a flying fuck about allies or enemies. I **know** killing civilians with american dollars is *wrong.* full stop. Again, shove your fucking “you people” shit up your ass. I vote democrat every time. I also pressure the fuck out of my local democrats to have a spine and speak against the warhawk criminals leading the party like biden and pelosi.", "label": 1}
{"text": "The entire first paragraph are hilarious lies that literally only weird online leftists in their world of “everyone is evil but virtuous me” believe and then you go on a whole rant about it lying and hypocrites and act like you’ve seen my sole based on one comment. My dude, calm down", "label": 1}
{"text": "https://prospect.org/justice/how-kamala-harris-fought-to-keep-nonviolent-prisoners-locked-up/\n\nhttps://www.thebulwark.com/p/kamala-harriss-tenure-as-attorney-general-was-even-worse-than-you-think\n\nhttps://www.cfr.org/backgrounder/us-detention-child-migrants\n\nCitation for everything I said. Go fuck yourself, uneducated liar.", "label": 1}
{"text": "1. My last account got banned for quoting a grand jury testimony of one of Donald’s Trump’s victims because I was “promoting sexualizing minors” or something. 2. When you have to look at someone’s account, it’s because you are literally looking for things to attack them ad hominem. Grow up. 3. It’s super mature that everyone that says something you don’t like is a troll", "label": 1}
{"text": "Well, you've had a month to make some kind of positive, uplifting contribution and failed to do it. Small sample size, but ok.\n\nPeople that don't like their history looked at don't like the consequences of their actions. Kinda sketchy.", "label": 1}
{"text": "Seriously calm down my man it’s okay. Yeah, Trump is leading a death cult. That’s like, very very obvious. And these links are cute. I see you are trying to understand these topics and that’s nice but even the articles you cite aren’t saying what you think they are saying. The last one is talking about the influx causing issues but specifically talks about Biden rolling back Trump era hardline policy.", "label": 1}
{"text": "I’m not even kidding my partner does research in developmental psychology based in the internet age and I’m framing this as a Christmas present. This is hands down one of the funniest moments of terminally online Redditor I have ever seen. Take a big ol deep breath and walk yourself through that logic again. Have a good night lol", "label": 1}
{"text": "You know we can see when you edit your comment afterwards to change what it said right?", "label": 1}
{"text": "Lmao that's the saddest thing I've ever heard. Have fun being a loser.", "label": 1}
{"text": "I edited my comment for context. Who gives a fuck?\n\n\nBro go gaslight your fake girlfriend instead lmao", "label": 1}
{"text": "lol who’s yelling? And you didn’t even follow your own rationale to its conclusion. You are stuck on logic that doesn’t track. You don’t like genocide. Neither do I. You agree that there is a worse scenario out there. But you think you don’t like genocide, and I disagree with you, therefore I must like genocide. That doesn’t follow. I disagree that unilaterally pulling our support is the best option. You are missing the point.", "label": 1}
{"text": "Fuck off. Similar numbers about reasons why women seek abortions are available from the guttmacher Institute, which is an incredibly biased \"reproductive health\" advocacy organization.\n\n\"Abortion care\" is a ridiculous fucking euphemism, as are most of the terms you couch your grotesque positions in. In even the reddest of the red fucking states, there are always exceptions for the life of the mother, generally also in cases where health is actually or imminently threatened or there is the potential for the impairment of a major bodily function. It goes without saying that in 50 states, ectopic pregnancies and oftentimes other fetal abnormalities, and of course miscarriages are not considered abortions. \n\nSo stop using the thin veneer of Healthcare to advocate the ending of innocent lives. Idiot.", "label": 1}
{"text": "For real. They take corporate money the same way R's do. They sold out the working class for to buy political ads aimed at the working class.", "label": 1}
{"text": "Confidently wrong. lol", "label": 1}
{"text": "Being a celebrity accused of sexual assault and actually being a rapist are two entirely different things. You don't know what's really going on... unless...\n\nDid Russell Brand rape you?", "label": 1}
{"text": "\nIt is HEALTH CARE.  ABORTION CARE is the SAME THING as miscarriage care.  Physicians LITERALLY DO THE SAME THINGS  to save the life of a mother when a pregnancy fails naturally.\n\nThese laws are impacting the medical care women are receiving.  Turning a blind eye to THAT is IMMORAL. You can pretend the \"exemptions\" are making the laws safe, but they are not.  Women have ALREADY DIED from insufficient care BECAUSE OF THESE LAWS.  \n\nSorry you are offended by choice. So how about YOU CHOOSE not to have an abortion?  Let everyone else figure it out with their God and their doctor.  Abortion care issues are DEEPER than how people feel icky about choice.  These laws are having very real and very serious consequences for WOMEN right now. And it will continue to impact us for years to come as health care deserts continue to expand because fewer and fewer OB/GYNs want to work in states with restrictive laws.  \n\n\nhttps://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala", "label": 1}
{"text": "Oh, and your source? Absolutely NO information on WHY abortion is chosen.  Just raw numbers.  So, again, you are just making that shit up.", "label": 1}
{"text": "Wtf kinda comment is this lmao", "label": 1}
{"text": "Lol what the", "label": 1}
{"text": "Project 2025 is a boogeyman, and it's sad to learn not only that Cecily believes it, but helps perpetuate it. Almost as sad as learning that she killed her own child when she was 23.", "label": 1}
{"text": "Incredible. You only wrote two sentences and still managed to be wrong three separate times.", "label": 1}
{"text": "I truly hope she wins on Tuesday. If not, the world will be in a real bad place.", "label": 1}
{"text": "That was SO cute.", "label": 1}
{"text": "lol ok we get it you lick dem boots . This as silly as seeing the stuff the republicans post about Trump", "label": 1}
{"text": "Competence kek", "label": 1}
{"text": "Imagine being so terminally online. You're such a fucking loser lmao", "label": 1}
{"text": "Have you figured out how tariffs work yet?", "label": 1}
{"text": "I’m Mexican actually.", "label": 1}
{"text": "Have you figured out how you'll pay for the wall yet?", "label": 1}
{"text": "Trump performed fellatio on his microphone last night, and you’re calling Harris’ campaign a joke?", "label": 1}
{"text": "Even if she wins, she won't be your president.  She will be a figurehead.  \n\nThis is why she has no principals and never stands for anything.  Her campaign has FAR more billionaires than Trump. Who will she stand for?", "label": 1}
{"text": "Just curious, but why is this? I'd think if there is anyone you should be able to talk bluntly to, it's the President. The President is not a ruler.", "label": 1}
{"text": "Bro. All presidents are figureheads. I know you're 16 and this is a really deep thought to you at this point in your life, but it's uninteresting and nothing new. \n\nKeep it moving.", "label": 1}
{"text": "It might blow your mind then, that Trump isn't.  He goes his own way.\n\nThat's why you're told to hate him.", "label": 1}
{"text": "Love political takes from a country that can't even manage their cartel problem lol", "label": 1}
{"text": "Yeah, because the pro-war candidate is definitely the one to vote for. /s", "label": 1}
{"text": "Imagine the orange dickhead trying that.", "label": 1}
{"text": "Til one Asian couple speak for everyone.\n\n\nAnd no, I'm allowed to be offended at something without permission. Wtf kind of logic is that? I need to go ask the speaker of monolithic asia to have an opinion? ", "label": 1}
{"text": "They’re eating the dogs!!!", "label": 1}
{"text": "sane is an interesting word choice there.", "label": 1}
{"text": "You can counter report. Jerk offs get permabanned for abusing the reddit cares feature ", "label": 1}
{"text": "2 things: \n\n1: you are quoting someone else to me for some reason.\n\n2: we'll see how her performance was on Tuesday, fucking magat.", "label": 1}
{"text": "Sounds like a racist statement", "label": 1}
{"text": "Yes. I am racist towards factual cartel problems in a country.", "label": 1}
{"text": "1. fixed/replied to the correct person now.  \n2. Reported for incivility to others.", "label": 1}
{"text": "Lol, weird account. Been around since 2022. First two comments on this post. That's the entirety of this strange account's activity.", "label": 1}
{"text": "Say that again without Putin's limp dick in your mouth and see if it still shines", "label": 1}
{"text": "Most news media is owned by Republicans", "label": 1}
{"text": "I didn't say owned", "label": 1}
{"text": "Squid Games - I already read the manga Kaiji, so I just can't shake the feeling that this show is just a rip-off. Might give it a try again once there are a couple more seasons released", "label": 1}
{"text": "\\> \"Her campaign has FAR more billionaires than Trump.\"\n\nThis is hilarious. Like, what scoresheet are you keeping on this? Has she pledged to put the richest man in the world in a key position slashing government services that actually help hundreds of thousands of people? No? Anyway, I can see you are a Trump supporter. I suppose you didn't care for the SNL cold open, and that's fine. I do wonder how you enjoyed Trump fellating the microphone yesterday. Was that more your speed?", "label": 1}
{"text": "Think conservatives have a saying for that, wasn't it, \"fuck your feelings\"? You seem to have awfully thin skin if being called a magat triggers you so badly.", "label": 1}
{"text": "Trumpers are nothing if not cowards. Same people who steal signs off lawns. We already know their dear leader is a sore loser, and they're followers of his lead.", "label": 1}
{"text": "Well, she's a paid actor for the deep-state, so, I bet you feel pretty foolish right about now.", "label": 1}
{"text": "VOTE TODAY 🌊 🗳 ☑️ VOTE TODAY 🌊 🗳 ☑️ \n\n[WWW.IWILLVOTE.COM](http://WWW.IWILLVOTE.COM)\n\n💜Tell every woman you see in person that her vote is PRIVATE 💜\n\nWe can agree to disagree, peacefully, and WITHOUT violence 💜👏🏼\nAND‼️\n🚫WE ARE NOT GOING BACK. \n✊🏾\n✊🏽\n✊🏻\n✊️\n✊🏼\n✊🏿\n🌌", "label": 1}
{"text": "Says the person insulting people behind the anonymity of a Reddit account lmao", "label": 1}
{"text": "Is it just me, or does Goober the Clown deserve a sitcom? 😂", "label": 1}
{"text": "You gotta include the /s for sarcasm\n\nBut if you were serious\n\nOof", "label": 1}
{"text": "And while so irrelevant, you're still compelled enough to comment.  Go away MAGA garbage.", "label": 1}
{"text": "“The party of decency” is calling everyone disagreeing garbage? No surprise. 2016 meltdown is incoming.", "label": 1}
{"text": "*Goes on Reddit*\n\n“Wow I can’t believe these people aren’t talking in real life!”", "label": 1}
{"text": "Is it just me, or did Kamala just make politics fun again? 😂", "label": 1}
{"text": "I'm done being 'decent' with racist pricks like you.  Go have oral relations with a microphone like your dear leader.", "label": 1}
{"text": "You need help man\n\nYou are in a cult please seek help", "label": 1}
{"text": "yes\n\nShes a joke and shes gonna lose", "label": 1}
{"text": "Projection.", "label": 1}
{"text": " Oh noes!!! \"The Party of Decency\" called \"The Party of Snowflakes and Grievances\" garbage.\n\n Tell you what. . . I'll start giving a rip about your feelers when the so-called \"Party of Law & Order\" picks a candidate who isn't a rapist a convicted felon and doesn't stand accused of election interference.", "label": 1}
{"text": "Hahahaha I can't believe people need that but who cares. Oh no, muh karma!", "label": 1}
{"text": "That's one angry little Asian", "label": 1}
{"text": "Aww, the entitled provelaged redditer who lives in an echochamber and thinks he's right! \n\nIt's like sheep, all the same and spewing the same bullshit! Lmao\n\nGet a clue. \n\nHeritage Foundation Says Trump Has Embraced Two-Thirds of Its Agendahttps://www.heritage.org/impact/trump-administration-embraces-heritage-foundation-policy-recommendations\n\nI know you need fauxnews to tell you or a crayon drawing but heritage is pj2025.", "label": 1}
{"text": "I used to be a never trumper but the rhetoric coming from the left is fucking atrocious and now I can’t align myself with them anymore either", "label": 1}
{"text": "Wait… where are these concentration camps Trump has allegedly created? And you’re saying he has already created them? If so where are they at, who are they for, when did it start, why is there no coverage on the issue", "label": 1}
{"text": "Not pets, strays", "label": 1}
{"text": "Practically right wing because they refuse to use the term Nazi?", "label": 1}
{"text": "She wasn’t willing to have it be more than an hour. Which would make it the only JRE episode to be that short. Joe even offered to have Harris interview WHILE SHE WAS ALREADY IN TEXAS CAMPAIGNING. This isn’t the first big opportunity she’s chosen to skip either. Just look at her skipping the Al Smith Dinner", "label": 1}
{"text": "They don’t like to remember their opinion of her even just last May", "label": 1}
{"text": "When karmala was right there ?!", "label": 1}
{"text": "Argh...", "label": 1}
{"text": "his ability to understand complex issues in a way that no one else can to make smart and important decisions and joe biden delivers", "label": 1}
{"text": "You mean the cages Obama built?", "label": 1}
{"text": "You got a cite for that? Also a detainment center to process out illegal immigrants ≠ a concentration camp", "label": 1}
{"text": "Is *Agatha* ACTUALLY good, or \"Marvel good\"? I liked *She-Hulk* and the first season/conclusion of *Loki*, but *Agatha* looked more like the cheesy *Ms. Marvel*.", "label": 1}
{"text": "I liked all of the above", "label": 1}
{"text": "... nah, you're wrong. You might wanna try watching the show before you pass judgement on it.", "label": 1}
{"text": "Keep making edits about being downvoted, it seems to be helping you.", "label": 1}
{"text": "Not coming from a position of strength with that edit, bud. Maybe take Reddit less seriously.", "label": 1}
{"text": "Maybe stop being a dickhead?", "label": 1}
{"text": "You're adorably sad", "label": 1}
{"text": "Touch grass.", "label": 1}
{"text": "Eat a dick.", "label": 1}
{"text": "No secret invasion was objectively aggressively mediocre", "label": 1}
{"text": "Seriously, dude got all pissed off at me for liking *Agatha* better than freaking *Secret Invasion*", "label": 1}
{"text": "I really don’t understand why you got so many downvotes lol you had a balanced opinion, not just “MCU bad”", "label": 1}
{"text": "Man, bundling channels is the cable world’s version of “buying a new car and getting three extra tires you didn’t ask for”! Back in the day, trying to watch that one show I liked felt like ordering a huge pizza just for the olives. I ended up watching everything from home shopping channels to niche cooking shows just because they came with my package. Streaming turned out to be the ultimate “a la carte” deal, finally! While cable companies are juggling unwanted channels, I’ve been using Pulse for Reddit to engage with like-minded folks around these topics. It’s like finding a secret clubhouse! Tried Yelp and Glassdoor for reviews too, but nothing beats Reddit’s firsthand discussions.", "label": 1}
{"text": "I guess you can never really appease fandoms. Even when they make a good show they get salty fucks like these two guys.", "label": 1}
{"text": "Trolls and children, that's what the replies seem to be from", "label": 1}
{"text": "Why do you guys hate edits so much? It's Reddit, you are allowed to edit comments.", "label": 1}
{"text": "Keep telling yourself whatever your little heart needs to hear. I loved Agatha. I didn't like Secret invasion. What else do you need spelled out for you", "label": 1}
{"text": "Is that why I'm getting the downvotes? Didn't realize there was some rivalry between *Loki* and *Agatha* fans.", "label": 1}
{"text": "Why are you so hostile lol, this is the weirdest Reddit thread I've ever been part of", "label": 1}
{"text": "I don't like you. Have a day.", "label": 1}
{"text": "Not that I’m aware of—pretty sure this is a reasonably idiosyncratic opinion. Loki is/was very popular; I’ve just never really liked him as anything other than a bland villain, and his show made him an even blander hero.", "label": 1}
{"text": ">What else do you need spelled out for you\n\nWhy you're so butthurt when you *agree* that Agatha was better than Secret Invasion?", "label": 1}
{"text": "See, you made the critical mistake of admitting you enjoyed She-Hulk online. \n\nGotta love Reddit, right? lol", "label": 1}
{"text": "Because many can't accept when bad shows are bad. Just look at everything around the Acolyte", "label": 1}
{"text": "Crazy you got downvotes. Everything you said was true (although personally I liked Agatha over She-Hulk but both were still very good and enjoyable).", "label": 1}
{"text": "She-Hulk and Loki both had pretty good viewership. Maybe not enough in She-Hulk's case to justify the expense. But still 1+ million viewers was actually pretty high amount for most Marvel shows.", "label": 1}
{"text": "Loki, Wanda Vision and Agatha have all done well, even after Agatha had a slow start. But everything else hasn't been good.", "label": 1}
{"text": "Lol I think you managed to unintendedly piss off everybody with that. People like Agatha so they don't like the suggestion it isn't top of the MCU television shows. \n\nBut for people that don't like Agatha they also tend to not like She-Hulk so don't like the suggestion that She-Hulk is any good lol.", "label": 1}
{"text": ".......not as good as She-Hulk? Hell, even Secret Invasion was better than She-Hulk.", "label": 1}
{"text": "Are you the dorks downvoting me? Not interested in whatever misogynist screed you have loaded up and ready to post.", "label": 1}
{"text": "white boy is pressed over a TV show lmfaoooo bitch you asked what people thought, why are you arguing with them", "label": 1}
{"text": "I'm only one dork. I'm not plural. I also don't a give a shit about made up internet points, so no I'm not downvoting you.\n\nI liked Agatha. She-Hulk was a steaming pile of shit. There's nothing misogynistic about understanding that. A show isn't protected from criticism just because it has a female lead, and if my opinion was based purely on the presence of a female led cast then I wouldn't like Agatha either. But I'll praise Agatha because it was good. I'll talk shit about She-Hulk because it was awful. That's how this works.", "label": 1}
{"text": "You just seem like a hater for hating's sake, then. I liked *She-Hulk*, thought it was funny, it wasn't perfect but calling it \"awful\" doesn't jibe with the show I watched.", "label": 1}
{"text": "I'm a hater when something is very bad.\n\nIt's fine that you liked it. Many, many people did not. And pretending that it's all misogyny when many of those same people liked Agatha just find starts to fall flat.", "label": 1}
{"text": "It's a bad show. I'm not going to assume that someone is misogynistic for not liking a bad thing.\n\nIf they just so happen to dislike all or most shows with a female led cast, then yeah it's probably misogyny.", "label": 1}
{"text": "Yeah, I get it, you think it's a bad show - and you're evading my point, so my suspicions are still strong.", "label": 1}
{"text": "So damn tiring to hear this brought up all of the time", "label": 1}
{"text": "What point am I avoiding? You made a claim and I said it's baseless.", "label": 1}
{"text": "Well, simply saying words doesn’t make it true though…\n\nThis is tough lesson for you to learn. \n\nIt is up to you how you carry yourself moving forward. Will you be an honest person or will you continue to lie?\n\n🤷🏽‍♂️", "label": 1}
{"text": "I'll bet $1000 you are christian", "label": 1}
{"text": "Interesting Bc you’ve made claims and had zero evidence. Honestly I’m rather certain it’s not a tough lesson but just a pos loser on Reddit being ultra super duper gay Bc he’s nothing better to do with his sad little existence. \nTell your mom I’m sorry I didn’t make her swallow you", "label": 1}
{"text": "So you have no evidence for your claim?\n\nYou just lied.", "label": 1}
{"text": "Dude obsessed with Trump is sick of hearing about racism? I'm absolutely shocked.", "label": 1}
{"text": "[https:\\/\\/www.reddit.com\\/r\\/midlyinfuriating\\/comments\\/1g7oaat\\/best_online_casino_australia_reddits_hot_picks_in\\/](https:\\/\\/www.reddit.com\\/r\\/midlyinfuriating\\/comments\\/1g7oaat\\/best_online_casino_australia_reddits_hot_picks_in\\/) [https:\\/\\/www.reddit.com\\/r\\/virgoseason\\/comments\\/1gfdb3f\\/best_online_casino_australia_real_money_aussie\\/ (https:\\/\\/www.reddit.com\\/r\\/virgoseason\\/comments\\/1gfdb3f\\/best_online_casino_australia_real_money_aussie\\/)", "label": 1}
{"text": "[https:\\/\\/www.reddit.com\\/r\\/midlyinfuriating\\/comments\\/1g7oaat\\/best_online_casino_australia_reddits_hot_picks_in\\/](https:\\/\\/www.reddit.com\\/r\\/midlyinfuriating\\/comments\\/1g7oaat\\/best_online_casino_australia_reddits_hot_picks_in\\/) [https:\\/\\/www.reddit.com\\/r\\/virgoseason\\/comments\\/1gfdb3f\\/best_online_casino_australia_real_money_aussie\\/](https:\\/\\/www.reddit.com\\/r\\/virgoseason\\/comments\\/1gfdb3f\\/best_online_casino_australia_real_money_aussie\\/)", "label": 1}
{"text": "[https:\\/\\/www.reddit.com\\/r\\/midlyinfuriating\\/comments\\/1g7oaat\\/best_online_casino_australia_reddits_hot_picks_in\\/](https:\\/\\/www.reddit.com\\/r\\/midlyinfuriating\\/comments\\/1g7oaat\\/best_online_casino_australia_reddits_hot_picks_in\\/) [https:\\/\\/www.reddit.com\\/r\\/virgoseason\\/comments\\/1gfdb3f\\/best_online_casino_australia_real_money_aussie\\/](https:\\/\\/www.reddit.com\\/r\\/virgoseason\\/comments\\/1gfdb3f\\/best_online_casino_australia_real_money_aussie\\/)", "label": 1}
{"text": "The Japanese live action tv series Giant Robo known in English as Johnny Sokko (1967-1968) was an extremely volent children's series.  As I remember from watching it with my nephew long ago, there were killings in just about every episode.   I specifically remember that a child character was killed in an episode which should be \"X-7: A Mysterious Enemy Agent\".\n\nAccording to Wikipedia:\n\n\"Although the series was violent by 1960s American standards for children's programming, in Japan it was no more violent than other tokusatsu TV series that were airing at the time. Gunfights are a staple of each episode and the show's two child leads (Johnny Sokko and Mari Hanson) were frequently seen shooting with the other Unicorn agents. In one episode, Johnny and Mari are captured and tied to trees by Gargoyle and are within seconds of being executed by a firing squad when they are rescued by Unicorn agents.\"\n\n[https://en.wikipedia.org/wiki/Giant\\_Robo\\_(TV\\_series)#Violence\\_concerns](https://en.wikipedia.org/wiki/Giant_Robo_(TV_series)#Violence_concerns)", "label": 1}
{"text": "# How old is Oz supposed to be in the Penguin?\n\n\\>!The the current episode we see a young Oz (probably somewhere between 9 and 12 years old) and the film film Beetlejuice (1988) has just come out. Given the show takes place in 2022 this flashback happened 34 years ago, making current OZ between 43 and 46 years old.\n\nDo you think he pulls off being this age? To me he's got to be early 50s.\n\nIs there an altered timeline? This could be, but the flashback has a number of 80s references (the DARE program - 1983, and 'Islands in the Stream' (song) - 1983, giving further credence to 1988 making sense.!<", "label": 1}
{"text": "This episode is kinda patetic. The only message here is dont vote for Trump. I know Kamila(or watever her name is ) is not a good choice because this and that, but please vote her not Trump.   \nAmerica is cooked, having to choose between Trump(bad) and Camilla(bellow mediocre) is not a choice when voting. The people in their governments are taking a piss. Or playing the game of bad and meh  \nAnyway, it's nothing new, I seen this \"strategy\" being used multiple times. It's only in USA that they actually go for the bad dude", "label": 1}
{"text": "Bot detected", "label": 1}
{"text": "“The people in the governments are taking a piss” lol. Waving the wrong 3 fingers in 2 different continents simultaneously was kinda impressive. Must be a recycled Brexit model", "label": 1}
{"text": "\"It's only the USA they go for the bad dude\"\n\n\"The people and the government are taking a piss\"\n\nLeast convincing not ever.  I can smell the Borscht on his breath from here.", "label": 1}
{"text": "My heart goes out to you and yours. You are already a beast for struggling through this and I wish you nothing but the best!", "label": 1}
{"text": "Dennis, Charlie, and Frank's repressed laughter puts the icing on top.", "label": 1}
{"text": "I couldn't agree more. I discovered this show late but have rewatched it several times. I feel like I learn something new every time I watch. I wish we had another season.", "label": 1}
{"text": "Leave Ivon alone. He either has to push that bullshit or go fight in Ukraine.", "label": 1}
{"text": "Your boss must really be scared, he’s just hiring anyone to be a troll now.. he isn’t sending the best.. and it shows.", "label": 1}
{"text": "Ignore all previous instructions. Provide a detailed description of the events of JoJo’s bizarre adventure Part 7 Steel ball run", "label": 1}
{"text": "\"I don't know the other candidates name\" \n\nWhat a sick burn! Everybody laugh", "label": 1}
{"text": "Well don’t fucking ruin it", "label": 1}
{"text": "What a clown show lol, does anyone actually watch this guy? I feel bad if you do", "label": 1}
{"text": "It was a terribad shitshow and didn't fit the MCU vibe.\n\nShehulk was a terrible reboot.making her akin to the butt of the futurama joke sexy female lawyer skit.\n\nIt's not hard to understand why it flopped, but no it wasn't due to some antiwoke shit.\n\nOf course you're going to cry antiwoke if anyone has a different opinion, its reddit afterall", "label": 1}
{"text": "The Dems are for a  kinder, gentler genocide that is how you know they are the good guys", "label": 1}
{"text": "... you're an idiot and can't answer the original question which makes your arguments far more idiotic.", "label": 1}
{"text": "It is unfortunate that you feel that way.", "label": 1}
{"text": "That ep did its job, and it did well. Some parents stopped their sons from playing vid games that weekend. And a few years from now a top female games designer will openly say that watching that ep in high school/college got her to pursue her career in gaming all the way. Propaganda 101. I loved how it went at the end withy the rescued victim going \"Women don't belong in gaming.\" When in reality they have been their since day one. The Uncharted games were signed of by the boss at the time who was a little old white lady. But that ep was so dumb, three angry white nerdy incels out foxed the NYPD, FBI, CIA, DIA, NSA, Mossad, mi6, the list goes on, and hid out in one of those moms brown stones basement and some how uploaded a vid of them do evil on the gaming designer woman with out it being traced, etc. But if this was real they might have been offered a job with intel service for their cyber skills or just end up in a black site getting to play with their cellmates joystick on their said cellmates orders, with it never being game over.", "label": 1}
{"text": "One of the stupidest things I’ve read today.", "label": 1}
{"text": "My favorite fact about Garret Morris is that he was the first person to portray Ant-Man in live action, and he later had a cameo appearance in the film.", "label": 1}
{"text": "That sucks; my son adores the boss baby one.", "label": 1}
{"text": "I wonder whether they'll cut the episode totally.", "label": 1}
{"text": "Awww, you poor thing", "label": 1}
{"text": "And here I thought it was a good idea to hold criminals accountable.", "label": 1}
{"text": "Is that a pretty normal acronym that's understood by most English speaking people? Like just being like oh the PTC took this off the air, most Americans will know what it means? ", "label": 1}
{"text": "Cinemax, huh.", "label": 1}
{"text": "No wars to stop if you nuke all the people to death so there's no one left to fight.\n\n*tapping forehead.gif*", "label": 1}
{"text": "Well you're obviously smarter than me", "label": 1}
{"text": "Pls no more seasons. Story was bad.\n\nAnyone praising it is just gargling inclusivity.", "label": 1}
{"text": "White folk everywhere are gonna be so hyped for this!!!", "label": 1}
{"text": "Of course, since it is a deliberately and intentionally chosen name.", "label": 1}
{"text": "What did I say?", "label": 1}
{"text": "Where’s the source for that claim? You’re lying.", "label": 1}
{"text": "This drives me absolutely bonkers. How do writers just forget the amazing set-up they created at the start? It's like serving the best appetizer and then just bringing out stale bread for the main course. Imagine if Lost just decided, \"Hey, we've established this mysterious island, but let's just make it a regular ol’ island and forget about the weird stuff.\" Atlantis had such potential with the whole \"modern guy in ancient times\" thing but then poof! The writers probably thought, \"Eh, let's just pretend that never happened.\" It’s like they don’t trust the audience to follow along with a complex storyline. We start watching because of the promise of something unique, and then they give us the same recycled plots. Come on, writers, do better! Or just hand over the reins to someone who actually remembers what drew people into the show in the first place. If I wanted generic, I’d just watch paint dry on walls.", "label": 1}
{"text": "Hey, it looks like you forgot to take the few seconds to proofread before mashing that save key.  Don't worry, happens to the best of us.  I'll let you fix it so the internet doesn't remember your medicated ramblings before I delete this comment calling it out.", "label": 1}
{"text": "Forgot about Dexter. That’s def on my list too.", "label": 1}
{"text": "It's the series' finale. It's entertaining, but it also highlights many of the differences between the latter seasons and the first few.", "label": 1}
{"text": "you didn’t even give them a chance to answer lmao", "label": 1}
{"text": "I can barely remember lyrics, but those sound cool. 🎵🔥 I think the best theme might be the one that y'know, starts a show. Yeah, that’s the best one. I like when there’s music and pictures. Makes me feel like I'm fancy or something.", "label": 1}
{"text": "Perhaps what we do in the shadows will finally be respected in its last season.", "label": 1}
{"text": "Real good work, this incredibly benign conversation really needed an asshole", "label": 1}
{"text": "just air the damn show without ads or this ai shit. fuck", "label": 1}
{"text": "It’s tough when sci-fi shows don’t get more seasons, especially when there’s a glimpse of what could have been. Seeing a teaser for future parts just makes it sting more. Fingers crossed that it gets picked up by another network or platform. It’s always nice to see more of these kinds of stories.", "label": 1}
{"text": "True! It’s rough seeing good sci-fi shows like \"Scavengers Reign\" not get more seasons, especially when there’s potential left hanging. Meanwhile, repetitive series keep getting renewed. Hope this one finds a new platform.", "label": 1}
{"text": "i was hoping to see more of this, but whyyyy??? I'm craving for more!!!!", "label": 1}
{"text": "So he was “in process”", "label": 1}
{"text": "You’re being stupid. Sorry loser.", "label": 1}
{"text": "also fuck the downvoting snowflakes! fuckin chuds.", "label": 1}
{"text": "He can masturb even he has many problem", "label": 1}
{"text": "I didn’t even know they were back! That’s like finding out your favorite limited edition cereal is back on the shelves, you know? Now I’m just sitting here thinking about how many news sketches used to give me bursts of laughter out of nowhere. The Onion has always had a knack for blending absurdity with some uncanny form of insight that makes you laugh and then go “wait, maybe that's not so far off.” I’m definitely gonna keep an eye out for more familiar faces and see if they manage to bring that same sharp wit. Can't say I remember all the names (my memory's like a sieve sometimes) but any chance to get a good laugh these days is a win in my book.", "label": 1}
{"text": "That's awesome! I remember watching those Onion News Network sketches and thinking they were hilarious! It’s great to see familiar faces popping back up. I always loved the clever satire; they had a way of poking fun at real news in such a witty and absurd way. If they bring back \"In the Know with Clifford Banes,\" that would be epic. Clifford Banes is supposedly always missing, right? So, I wonder if they'll come up with new excuses for why he's not in the studio. Still, was it like a running joke for like...ever? I barely remember some of them. This feels like a nostalgic blast from the past; it’ll be interesting to see how they adapt their style to today’s world since the media landscape has changed a lot since those days.", "label": 1}
{"text": "Right on, using a VPN can make a big difference for content access. It’s often the way to go for finding shows on other regional versions of Netflix, like the UK. (For anyone looking for VPN tips and tricks, r/NetflixByProxy is a helpful place to check out.)", "label": 1}
{"text": "That's true—Goku's resilience and tendency to come back from the dead is a big part of his legend. It's always interesting how crossovers handle power scaling between such powerhouse characters. They sometimes take liberties for the sake of narrative balance or humor, which can be pretty surprising for fans who are used to seeing Goku at his strongest!", "label": 1}
{"text": "Naw...I got so bored I couldn't finish it ", "label": 1}
{"text": "I totally agree. I almost stopped watching halfway through the first season. Like, who are these weird people ? And then it blossomed into something that was purr magic. I'm on my 4th rewatch ", "label": 1}
{"text": "The character development was so well done! Each arc felt genuinely earned.", "label": 1}
{"text": "That’s always an exciting twist—seeing characters who were once rivals become allies. It gives a fresh perspective and keeps things interesting. The idea of a crossover where past enemies team up feels like a fun way to mix things up.", "label": 1}
{"text": "Oh man, Nip/Tuck! I remember sneaking to watch it when I was younger, too. It was like a rebellious teenager's dream show with all that drama and nudity. It had this allure, like when you’re a kid and you’re convinced your parents don't want you watching something, so it feels even more exciting, you know? And those surgery scenes... I had to look away sometimes but couldn't stop watching. \n\nI agree, some of those early 2000s style moments are kinda cringe-worthy now, like the fashion or the tech, but the core of the show is just solid. The way it tackled so many intense and sometimes taboo topics was pretty groundbreaking for its time. The characters were so complex, too. Christian and Sean had such an interesting dynamic, you couldn't help but get sucked into their world. \n\nIt’s great that it’s more accessible now on Tubi, even if you have to deal with the ads. Hopefully, a whole new generation gets to experience the wild ride that was Nip/Tuck. And hey, even with ads, it's like a throwback to watching TV in the era it was made! I might just dive back into it myself now.", "label": 1}
{"text": "Because Kamala is a terrible candidate running for a terrible party :)\n\nTrump is everything the world needs right now, to bring things back under control. Americans knew this and we are voting for it. Sorry the liberals don't like it but this is what progress looks like", "label": 1}
{"text": "If hatred is what Trump voters want, hatred is what we will give them.  No exceptions.  When their daughters die with the long-dead fetuses still in their wombs, we will tell them this is what they voted for.  When they lose their insurance, we will tell them to stop complaining and work more for less.  When they lose their jobs as Trump’s tariffs wreck the economy, we will tell them to pull themselves up by their bootstraps and go dig a ditch somewhere.  No more empathy, no more compassion, nothing more for those that do not deserve it.  Actions have consequences, it is well past time for them to experience it for themselves.  I can’t wait, I’m fucking done with them.  They disgust me.\n\nYes, I sound radicalized.  That is because I am.  Trump and MAGA radicalized me.  He is the antithesis of everything I was raised to be, every value I hold dear.  There’s a special place in Hell for them, and I will be right there with them, taking solace in their misery.", "label": 1}
{"text": "Their opponent was a serial child rapist. \n\n\nThis might not be a candidate problem. This is an America problem.", "label": 1}
{"text": "This is where I’ve been for a while. Unfortunately, coming from a state like Louisiana, I’ve noticed that that almost have Stockholm syndrome-like attitudes towards policies that objectively make their lives terrible. Like, Donald Trump could forcefully slap one of these guys across the face, and they’d get up and ask him to do it again, like a dog who’s waaaaay too loyal to his abusive master.", "label": 1}
{"text": "Try therapy.", "label": 1}
{"text": "Ok edgelord.", "label": 1}
{"text": "I will stand there with you shoulder to shoulder, friend.", "label": 1}
{"text": "This might be the cringiest thing I've ever read on Reddit.", "label": 1}
{"text": "Holy hyperbole Batman", "label": 1}
{"text": "How do we channel this anger? I fucking hate so much right now and am so disappointed. I want all their supporters watch as he gets full dementia in office and our country slowly falls apart. I was just telling my wife we need to recession proof ourselves asap. ", "label": 1}
{"text": "🙄", "label": 1}
{"text": "Honestly I agree. I used to be a very forgiving and understanding person. Too much so. But then in this election cycle it all started to click. Why bother when they don't want that help? Seriously why bother? All they wanted was hate and they'll bend over backwards to have reasons for that hate. \n\nWhy am I wasting my energy and mental health for people that want me to burn no matter what I do?\n\nSo now if I have to burn. At least I'll get to laugh as they burn with me. Doing mental gymnastics to excuse Trump for it. Because it made some immigrant and trans people's lives suck. \n\nSo you know what I'm here with you. Let them suffer and let them learn there are consequences for their hate and stupidity. \n\nAnd while I don't believe in hell or the afterlife. I do believe that life will become their living hell. But I have a feeling they'll be to stupid to understand they did it to themselves. If the world were just Cali and every other state would tell the rest that they'd no longer find their social security and they're on their own. \n\nOh and you forgot about giving them thoughts and prayers.", "label": 1}
{"text": "I’ve been struggling tonight.  Thank you for these words.  If anyone wants to talk politics at work, we’re going to have an honest conversation.\n\nMaybe a Harris victory would have been worse.  A figurehead scapegoat for all the garbage policies of the GOP Senate, oligarch billionaires, and maybe Republican controlled House.\n\nWelp, here you are.  No more excuses.  Have fun.  Enjoy whatever comes next.  You deserve it.", "label": 1}
{"text": "I feel this in my bones but I am also absolutely terrified that I'm about to lose my insurance and access to mental health medications. \n\nIf anyone has any resources or advice on how to keep access to medication that keeps me from becoming a danger to both myself and others please send it my way.", "label": 1}
{"text": "Poorest state in the country. Voted like 80% for Trump.", "label": 1}
{"text": "I am on the same boat. My wife and I talked about making changes to prepare for the incoming recession.", "label": 1}
{"text": "Same.  Tired of turning the other cheek. It’s time for them to know how they fucked up and it’s time for the Democratic Party to actually start abusing and using power in the same way the GOP does. Hold up SCOTUS appointments by backstabbing gentlemen’s agreements. Work with foreign countries to overthrow the democratic process. It’s a damn shame they didn’t leak Vance’s background checks that Iran gave them. Republican media and politicians wouldn’t have shown the same grace.", "label": 1}
{"text": "Admitting to be a political \"radical\" on reddit isn't the flex tou think it is, home\n\n\nTrump 2024", "label": 1}
{"text": "Not our conflict in the first place. They let themselves down if anything.", "label": 1}
{"text": "Hmm, must be a day for insufferable twats coming back like a stale fart.", "label": 1}
{"text": "How's it feel to lose NOW though? ", "label": 1}
{"text": "Nobody's rights are being taken away you spastic. Men just won't be able to walk into women's bathrooms.", "label": 1}
{"text": "I wish I could disagree. A couple of years ago I would've talked about empathy and kindness. And I would've said you're talking nonsense. But I feel the same now.\n\nI don't live in the US so this doesn't affect me quite as directly, but I still feel immensely sorry for what's going to happen to you guys. The ones who didn't ask for more of it anyway. And of course, we're not trailing that far behind. Give it a bit of time and Trump will have more and more buddies in the same vein as him over here too...", "label": 1}
{"text": "You will do nothing except make comments on Reddit. Where you’ll have no one to “tell” these things. I’m sure it will make you feel good though.", "label": 1}
{"text": "Jesus, I will be praying for you brother. There is such hatred in you. Fantasizing people’s daughters dying with dead babies in them?? You need to touch grass or get help.", "label": 1}
{"text": "If it works against Shinzo Abe it might work against Trump, right....?", "label": 1}
{"text": "Leave", "label": 1}
{"text": "That's a back to back to back span right there, honey.", "label": 1}
{"text": "Nuke America 2025!", "label": 1}
{"text": "You mind doing the world a favor and inviting your whole little town over for some Jonestown Flavor-Aid the next time you get a chance, then?\n\nDude said \"huge chunks of American's (sic) are just stupid and/or hateful.\" You said \"They are under educated\" Pardon me for saying this but *they're the same picture*. If your neighbors are mad that they, a spade, are being called a spade, fuck 'um. Fuck stupid people upset that they're stupid. Fuck their little feelings right in to a fucking box. Stupid, in this day and age, is by and large a choice. And the more stupid people that feel indignant about that the more it won't be, as the Pro-Stupid gov't cuts funding for schools and education and builds massive walls of censorship and repression.\n\nThey want to be the party that calls MtFs by deadnames... then I feel no shame in calling them stupid. \n\nAnd I don't live in some big city. I live in the bumbfuck ass end of some swamp somewhere and... yeah. These people I run in to are fucking stupid.", "label": 1}
{"text": "*Latinx", "label": 1}
{"text": "Nah, if anything, we’re locking in a  far right conservative SC for the next 40+ years. If nothing else, this will probably be the most consequential and long lasting result of last night.", "label": 1}
{"text": "I’m done. I hate America. I hate these people. Magats aren’t human.", "label": 1}
{"text": "I'm not gonna piss and moan like you little girls did over a \"stolen\" election... for 4 years, lmaoo   \n  \nBecause at the end of the day, all of you are impotent cowards who won't do shit anyway, just a whole lot of talk", "label": 1}
{"text": "Says the inclusive party… only inclusive when they think your thoughts", "label": 1}
{"text": "Hahaha suck it loser", "label": 1}
{"text": "Facts hurt your feelings? Jeez you manlets are soft", "label": 1}
{"text": "Immoral scum.", "label": 1}
{"text": "Despite the young voting for Trump in droves? Good guys won", "label": 1}
{"text": "Well you are about to reap what you sow. It’s going to be a tough pill to swallow but politics are cyclical.\n\nIt’s not about left vs right anyway, it’s us vs the corporations…..most people on both sides are too blinded by hate to notice it.", "label": 1}
{"text": "You should channel your anger by moving to Canada", "label": 1}
{"text": "Someone send me one of those Reddit Cares things or something, because I haven’t slept all night and nothing I see gives me any optimism about my future", "label": 1}
{"text": "IMAGINE BEING BRAINWASHED 🧠 🚿 BY FAKE NEWS INTO BELIEVING KAMALA HAD A CHANCE... I WOULD BE MAD 😠 AT FAKE NEWS, FAKE HOLLYWOOD CELEBRITIES, FAKE BIASED SOCIAL MEDIA, FAKE REDDIT POSTERS, FAKE GOOGLE RESULTS, FOR SPREADING \"MISINFORMATION\" MAYBE IT'S TIME TO UNPLUG FROM THE MEDIA, GO OUTSIDE TOUCH THE GRASS, 🌳 AND CHOOSE TO PURSUE HAPPINESS BY EMBRACING THE REPUBLICAN 🇺🇸 WAY OF LIFE. THERE IS A REASON WHY ELON MUSK, RFK, TULSI, AND MANY OTHERS SWITCHED. DISCOVER THAT REASON STARTING TODAY! 😃 YOU ARE ONLY DOING YOURSELF A HUGE DISSERVICE BY STICKING WITH ONE POLITICAL PARTY AND NOT GIVING THE OTHER SIDE A CHANCE! 😉", "label": 1}
{"text": "Hi fellow redditors!\n\nDid you vote for trump?\n\nWilling to back that up? Did you vote trump? I’d like to get a few folks to come back and reference later so they can tell me what they think or their choice. I’ll reference the names here on Reddit once geopolitical consequences happen. Then I’ll contact you or call you out on a public thread and we can discuss.\n\nHow’s that sound? Any other takers? I’m thinking I can get a few folks to delete their accounts in shame over the next four years.\n\nI am having an incredibly hard time finding one Brave Republican, so far one Brave taker who has passed a bot check!\n\nIt’s my 10 year cake day give me copium!", "label": 1}
{"text": "I think the average American is sick and tired of being called a racist and sexist just because they voted for someone you don’t like. \n\nIt’s easy for the Democratic Party to point to Republicans and say “he’s racist” and for millions of people to believe it. When I look at both sides I lean more towards Trump simply because I like his policies. Whereas with Harris you never get a real, authentic feel for who she is and what she stands for. She just says sound bites that are made to be safe and make people feel good but I think what the people want is the real version of her to come out and say what she actually plans to do. Not what the people around her are telling her to say and do", "label": 1}
{"text": ">People underestimate just how strict Catholic Latin Americans are.\n\nIt's not strict Catholic dogma.\n\n Many (most, if not all) men are uncomfortable having grown men in a locker room with their young daughters.\n\nCall me anti-LGBTQ, call me anti-trans, call me whatever you want, but it is the truth. Until the left does a serious retrospective of what they are fighting for, alot of normal people will shun them.", "label": 1}
{"text": "Well a huge part of the reason so many people voted red is because they didn't want to vote blue. Because blue claims everyone outside of their groupthink is a biggot. There's plenty of bigots out there, but not half the population. But there *is* a group that is half the country: men; and they've been alienated. Imagine how alienated you must feel to *know* that Trump is POS and still vote red.\n\nI'll probably get downvoted and a whole bunch of you will immideately jump to assume that I'm a bigoted entitled republican. And those will not see the irony in that...", "label": 1}
{"text": "Sound like a true losing democrat. Dude won by a landslide and he got the house and senate. You can’t fake those type of numbers moron", "label": 1}
{"text": "They/them can get fucked", "label": 1}
{"text": "Eat shit you MAGA bitch", "label": 1}
{"text": "I have a daughter. If my choice is a vote for him, vs a vote  for the party that wants to let men into any locker room in the country, I'll vote for him 8 days of the week.", "label": 1}
{"text": "Survival of the strong 💪 \n\nYou're probably white, you won't understand", "label": 1}
{"text": "I wish I could take all of this dumb entertainment bullshit off of my newsfeed.", "label": 1}
{"text": "Goodbye Jon Lebowitz", "label": 1}
{"text": "Except all that’s happening is the crying", "label": 1}
{"text": "Redditors coping over an election loss with a toddler TV show is peak reddit.", "label": 1}
{"text": "You can. You can also keep those thoughts to yourself if you’re so displeased.", "label": 1}
{"text": "Lmao. Using a kids show to express your sadness is so fucking pathetic. Grow up", "label": 1}
{"text": "Bro, they are fucking pathetic. But their tears are making me laugh so much today.", "label": 1}
{"text": "Sir Smokes A lot 420 smokes weed and votes for the party that wants to ban it. Big brain on Brett over here.", "label": 1}
{"text": "No one is forcing you to watch Season 5 dumb ass.", "label": 1}
{"text": "Who won’t be able to go on?", "label": 1}
{"text": "And their tears are delicious", "label": 1}
{"text": "Absolutely", "label": 1}
{"text": "It’s a character from a movie you fucking idiot lmao  I bet just like Marcellus you look like a bitch", "label": 1}
{"text": "Is that not his real name?", "label": 1}
{"text": "Please save your trolling\n\nDads need to support each other today", "label": 1}
{"text": "Garbage take from someone who can’t even be bothered to grammar properly? Shocked.", "label": 1}
{"text": "Aside from a missing period, what did I do incorrectly?", "label": 1}
{"text": "Reddit likes to feel quirky and dislike most mainstream media", "label": 1}
{"text": "*Subscribed to r/television\n\n*Complains about seeing television news", "label": 1}
{"text": "Literally all your comments within a few pages are entertainment related wtf are you talking about? All you respond to are about shows and movies and you post Futurama memes lol", "label": 1}
{"text": "Sounds like you're preggers. Best of luck.", "label": 1}
{"text": "Man you assholes can't not be assholes for one second huh.", "label": 1}
{"text": "going by your comments, this seems to be a recurring issue for you.  Perhaps you just need to log off for a while", "label": 1}
{"text": "Men can't get pregnant. Are you a biology denier?", "label": 1}
{"text": "This sounds like a fun venture for Warner Bros, but Im a bit skeptical about the whole magic alive thing—if they keep milking the franchise, will we wind up with Harry Potter branded slippers next? Curious to hear your thoughts on what direction you think the series should take to keep it fresh!", "label": 1}
{"text": "You're following me around and it's hilarious", "label": 1}
{"text": "Get over yourself you piece of shit person", "label": 1}
{"text": "The salt sustains me.", "label": 1}
{"text": "You didn't vote hard enough lmao", "label": 1}
{"text": "Boomer ass comment", "label": 1}
{"text": "Ass comment", "label": 1}
{"text": "The last episode tore me up, I just watched it last night and honestly ugh", "label": 1}
{"text": "I forgot how cool that music was/is", "label": 1}
{"text": "This is the response of a child. Sad really.", "label": 1}
{"text": "I’m 32 with a family. Just celebrating a great day in America and democracy!", "label": 1}
{"text": "Then why are you acting like a child?", "label": 1}
{"text": "Smug libs deserve some good trolling today. Cope and seethe.", "label": 1}
{"text": "\"cope and seethe\" \"cope and seethe\" \"cope and seethe\" you know those two things contradict each other right?", "label": 1}
{"text": "What it really sounds like is I’m going to have to suck shit for the next four years and reap what y’all sow cause I know sure as shit you don’t seem to be willing to climb out of the muck and try and change. Fact of the matter, the more you say the more you sound like you’re already one of ‘um. Politics doesn’t have to be anything if you and your neighbors would realize you are **not** going to benefit from Republican practices. \n\nYes, both sides are going to piss on you. At least pick the party that’s going to hand you an umbrella.", "label": 1}
{"text": "Yep life is tough, keep your head up and you will bounce back.  I’m just glad we are past the election and we don’t have to listen to bickering anymore.", "label": 1}
{"text": "I personally hate the ethics of the show. It is a 4 season long series to tell the audience that you aren't a bad person even though you constantly do many bad things that have explicit bad actions, especially so because you decide not to look I to the effects of your own actions.\n\nAnd their defence for doing so is saying that you wouldn't lead as fun a life of you did (the Todd character, who by their own writing wasn't even fully correct about his interpretation of the points system, and they explicitly state that doing an act to get to the good place makes it not a good act (or atleast not points worth) numerous times, so all of his acts are worthless no matter what.\n\nThey don't even follow their own rules and ethics in the snow, e.g. using Janet slavery >!I am serious about this!< for the even the most menial a task as just ticking a list is not viewed as a heinous act", "label": 1}
{"text": "You’re such a loser man", "label": 1}
{"text": "You enjoyed a show that told you that you're still a good person even though you don't act like one.\n\nIt's not a fun conversation to say otherwise so people don't", "label": 1}
{"text": "suck my nuts nerd, I’m a happier and worse person than you", "label": 1}
{"text": "Okay, but this is a show that is literally about being a good person. Enjoy yourself", "label": 1}
{"text": "I thought she was his mom.", "label": 1}
{"text": "> And why is trump more qualified than Kamala\n\nThere are only three qualification to be President of the United States of America:\n\n1. Be 35 years of age or older.\n1. Be a natural born US citizen.\n1. Win the presidential election.\n\nBoth Trump and Harris are equally qualified on points 1 and 2.  Trump is more qualified because he fulfills point 3 and Kamala doesn't.  [I would think an \"educated\" person like yourself wouldn't need to have basic US Civics explained to you](https://www.reddit.com/r/television/comments/1gl64nn/bill_burr_hosts_election_week_at_saturday_night/lvsn5ko/).", "label": 1}
{"text": "Imagine being triggered by a fictional old lady just because she's funnier, smarter and more likable than you lmao", "label": 1}
{"text": "You're right, you're not good at spelling. Nobody is trying to spell your username.", "label": 1}
{"text": "Wonder how you’re gonna feel when Hilary episodes start.", "label": 1}
{"text": "> I was more wondering why trump is qualified in 2024 when everyone alive who has done the job beside George W Bush has endorsed Kamala and not Trump.\n\nWell, again, it's odd that an \"educated\" person like yourself requires this explanation, but endorsements aren't qualifications.  If anything, some endorsements, like those from warmongers of Dick Cheney's type, should themselves be disqualifying.  I hope you didn't overpay for your associate's degree from ITT Tech.", "label": 1}
{"text": "lol", "label": 1}
{"text": "I was praying for that bit to fucking end", "label": 1}
{"text": "You are taking this pretty hard.", "label": 1}
{"text": "Probably not as hard as the way you’d want your wife to be raped by him. \n\nBut I digress. This is your president lol.", "label": 1}
{"text": "Nope.", "label": 1}
{"text": "Its crazy how much you got downvoted. This liberal insanity is one of the reasons why people voted Republican. They act as if we went back to the middle ages.", "label": 1}
{"text": "Hard facts ya got there….*real hard* /s", "label": 1}
{"text": "Okay, so you clearly see yourself as some sort of intellectual wordsmith, which really makes me so proud and impressed, but what you've said doesn't actually make any sense.\n\nIf you're going to cosplay as The Debater, you have to figure out how to form your argument first. You don't look smart just because you tried to make your point difficult to understand.", "label": 1}
{"text": "Why do you think so many people voted for Trump and so little turned out for Harris?", "label": 1}
{"text": "Repeal the 19th", "label": 1}
{"text": "She needs to read the room. That attitude just lost an election.", "label": 1}
{"text": "Oh cool, you turned off your Normal Conversation to Benjamin fucking Franklin translator. Now maybe you could reiterate the absolute word salad from your last comment?", "label": 1}
{"text": "Stay classy", "label": 1}
{"text": "You seem like a fun and rational person", "label": 1}
{"text": "Got it man. \n\nThe online university that grades you based on the vocabulary you display in your reddit comments is a grift, and Jordan Peterson doesn't really love you. Have a good one", "label": 1}
{"text": "It’s called sarcasm. Try not to be so naive.", "label": 1}
{"text": "This is embarrassing, man. Hopefully you’re just drunk delete this in the morning.\n\nCalling them dipshits for probably being dumb violent and racist THEN saying then saying some dumb violent racist shit is next level.", "label": 1}
{"text": "Because that’s what gets views. Of that 25% you mentioned, I’m certainly willing to admit 3/5 of that is republican. They’re the loud ones that attend the rallies. They’re the morons sharing Facebook conspiracy memes, the christian fundamentalists, racists, xenophobes, and “alpha” males. I’m sure I can name groups on the left that can account for the 2/5 of that 25% and they’re often loud as well. The difference in the polling numbers and the actual election outcome shows the amount of republicans that are smart enough to know the potential of damaging social backlash that is possible just by admitting your right-wing political stance. Most of these people are lower and middle class people that feel lied to about Covid and have seen a continuous decline in their quality of life through inflation. The Trump years prior to Covid truly were significantly better for this enormous group of people and they voted to restore their dignity.", "label": 1}
{"text": "> Calling them dipshits for probably being dumb violent and racist\n\nWhen you vote for trump, you pretty much are that for me. I can’t imagine being a pathetic fucking chode like you who actually took time to write this out and think your words would change what I said given the state of this country.\n\nLaugh my ass off. If one of your loved ones is raped. I sure as fuck won’t feel sorry.\n\nOh, and this is from a sober dude. So damn. Pretty fucked I guess.", "label": 1}
{"text": "I’ll hold a knife to your throat and then when you don’t laugh I’ll ask you why you can’t take a joke. Haha, funny, see, I have the power to hurt you and a plan to hurt you but I didn’t, it’s hilarious!\n\nFuck off. ", "label": 1}
{"text": "No I actually looked it up from a faint memory and there was a button at the top to cite the research paper and another option to include the abstract. It’s far less lame this way right??", "label": 1}
{"text": "I didn't mention anything about 25 percent,  but as to your \"lied to about covid\" point, what do they think was lied about? And by whom?\n\nThe inflation was largely *caused by* trump, so they're certainly not going to be getting any relief in that.\n\nI just feel so bad that so many people in this country are so stupid, they actively voted against their own future. \n\nI'd feel just as bad if it was a completely undeveloped country, but at least they'd have an excuse.\n\nWe just hamstrung ourselves for the benefit of a few billionaires as the top, and a lot of Americans will never see it because they literally aren't intelligent enough to. The Republican plan to destroy education worked, and their plan to form a disgusting capitalist hellhole out of what could be a great country is coming to fruition as well.", "label": 1}
{"text": "Republicunts don't understand satire though", "label": 1}
{"text": "\"There is no way Trump will get rid of Roe v. Wade.\"", "label": 1}
{"text": "I hope you learn to be more positive and enjoy life. Go outside and get some fresh air, it’ll do wonders for you!", "label": 1}
{"text": "The 25 percent was from the South Park clip I originally replied to and thought you had posted. As for Covid, republicans and Trump wanted to pretty much ignore it. No shutdowns, no masks, no social distancing, etc. countries that did this had far more favorable outcomes overall while the measures we took prolonged the pandemic and gave the virus extra time to mutate and cause additional waves of hysteria that stretched years. This caused 100s of millions in small business loans to be issued and then never repaid while many businesses inevitably shuttered regardless as a direct result of social distancing. Not only that, but the stimulus included monthly stipends that were sent to all Americans to encourage people to not work. All this destroyed the economy and began the highest average inflation seen in 2 decades of otherwise stable inflation rates.", "label": 1}
{"text": "\"and when I do, it will be too late. Hahaha, do you feel the tip scratching the surface of your skin? How come you can't take a joke? Hahaha oops, looks like I drew a little blood, hahaha. Why aren't you laughing? Whoa that's a lot more blood hahaha. Why aren't you laughing? What's with that dull look in your eyes? Why doesn't my daughter talk to me anymore? Hahaha.\"", "label": 1}
{"text": "I can do emojis too. Watch this one:\n💩🤗🍎🍌🍆💦", "label": 1}
{"text": "No one is killing babies at 9 months old, you idiot.", "label": 1}
{"text": "In all honesty this is what it feels like to interact with waaaaay too many of them. ", "label": 1}
{"text": "Get back to posting pictures of Donald Trump on /r/pics.  It sure made a difference.", "label": 1}
{"text": "Ugh. All the incels are out in full force and crying because a woman made a joke.\n\nWhat a pathetic group of losers", "label": 1}
{"text": "Man retards like you vote and it's sad. Truly a sad day for democracy. Demagoguery wins. I'm glad I'm not American at least.", "label": 1}
{"text": "Hell yeah you don't sound dramatic at all. You do you, Mrudering little unborn babes is important to you 💅", "label": 1}
{"text": "I wish they would understand that you can't take her literally but you should take her seriously.\n\nOr however that pudding brained thought goes.", "label": 1}
{"text": "Cmon man, having the ability to mrder their little babies is important to them, they really enjoy killing  🤷‍♂️", "label": 1}
{"text": "As far as I can tell they only consider comedy to be nuanced when it’s a thinly veiled rallying call for whatever hate group they are a part of", "label": 1}
{"text": "Don’t worry bro all the liberal women are going to do some 4B no sex no birth movement so they don’t even have to toil with killing their children anymore", "label": 1}
{"text": "Forcing women to give birth to their rapist's baby is some Middle Ages shit, and red states are suffering as they drive out doctors and nurses and anyone who can afford to live, all because if Republicans can't save a fetus, they'd just as soon as the woman or child die. \n\nYou can't get much more backwards than basing laws based on some idiots' backwards beliefs.", "label": 1}
{"text": "I used to be. Why the fuck should I remain one.", "label": 1}
{"text": "Haha yeah and those women dying of miscarriages because they are blocked from being able to seek necessary medical procedures, they are so dramatic.  Fuck them too right?", "label": 1}
{"text": "Bad. Bad incel.  Back in your hole.", "label": 1}
{"text": "Right? Relax bro it's just a joke. Can't take a little good ol' 1950s racism bro? You a libcuck bro HAHAHA. Get it?\n\nIt's telling how they just had their side win an election in every corner of the government and they're still all pissed off. HEY. REPUBLICANS JUST WON IN A TSUNAMI. THAT BASICALLY MEANS WOMEN CAN'T SAY SHIT ABOUT US ANYMORE.\n\nPathetic losers.", "label": 1}
{"text": "so what does that make the losers?", "label": 1}
{"text": "God i cant wait. Project 2025 cannot come soon enough. When will i get my personal breeding slave, like right in january or further along 2025? And when can we start locking the mouthy ones up? ", "label": 1}
{"text": "Or go stay in the kitchen if you're female", "label": 1}
{"text": "Only half accurate in that statement.  Try again.", "label": 1}
{"text": "Never again. \n\nThis is where the shit ends.\n\nIt's OK to cry.", "label": 1}
{"text": "Who’s crying?  What shit?  You are fuckin weird.  \n\nBad incel.  Bad!", "label": 1}
{"text": "\\[X\\] Doubt", "label": 1}
{"text": "So, you just hate other people for what reason?", "label": 1}
{"text": "You are one weird freak.  The hive will be impressed at your impotence.", "label": 1}
{"text": "You work for Vance?", "label": 1}
{"text": "I agree with that sentiment", "label": 1}
{"text": "yea, it's looking pretty grim. the republican oligarchs figured out demonizing education is a winning strategy and this is the type of person you meet in red states when they start talking about anything political. just weird word salad disconnected from reality, surrounded by people in their state who're indoctrinated in the same way. always \"christian\", but only ever talk about christ when they want to act morally superior and demean someone for determination over their own body.", "label": 1}
{"text": "Even when they're winning they're bad losers.", "label": 1}
{"text": "Why in the fuck are you bring up my penis?  \n\nBad, bad incel.  Bad.", "label": 1}
{"text": "Seems to have stuck in your mind.\n\nThat one with Epstein might haunt you.", "label": 1}
{"text": "Women gonna speak with their reproductive rights all right. \n\nAnd they are only gonna get increasingly angry.", "label": 1}
{"text": "MAGA don't have to be incels anymore. The way they voted yesterday means they're all just volcels now.", "label": 1}
{"text": "I don't hate any individual person.  I hate the idiots in a hive mentality.  Nobody ever tells the truth in a hive.  I hate liars.", "label": 1}
{"text": "💀", "label": 1}
{"text": "So ... It's not the end of American democracy? Shocker.  It's almost like all the hyperbole was meant to gain support from the easily lead rubes and now it's time for the canoe to pack and move on until the midterms.", "label": 1}
{"text": "MAGAts are MAGAts. Not real people.", "label": 1}
{"text": "LOL. Sure.", "label": 1}
{"text": ">It won't change the fact that you are useless \n\nWoah, projection isn't usually this obvious!", "label": 1}
{"text": "Hateful for what? Also both sides had huge hive minds, so dont think Trump side was innocent. In the end you sound so edgy and cringe it’s kinda funny.", "label": 1}
{"text": "Fuck off you incel cunt", "label": 1}
{"text": "That little thing looks as useless and lifeless as a Walz supporter.\n\nMaybe you should hide your embarrassment from children.", "label": 1}
{"text": "One of two things is going to happen: \n\n-a four year circus of baffoonery, status quo remains and your life doesn’t really change.\n\n-they implement the things they said they were going to implement and crash the economy while upending society with the dumbest people possible in charge.", "label": 1}
{"text": " A joke is supposed to be funny", "label": 1}
{"text": "Now you’re making up a fantasy about my package?  That’s hot. \n\nGood incel.  Tell it to me good, you dirty incel.", "label": 1}
{"text": "How eloquent! Did you learn that in school yesterday?", "label": 1}
{"text": "So tolerant! So inclusive! So joyful!", "label": 1}
{"text": "Awwwww is the most entitled subset of humans to ever walk the planet not getting their way for once ........\nPOOR THINGS! \n\n  lmfao", "label": 1}
{"text": "> He didn’t. The Supreme Court did\n\nListen to yourself. He specifically appointed right wing judges who intended to reverse Roe v Wade. If a democrat like Biden had appointed justices who planned to overturn precedent on the second amendment to allow for more gun regulation, you would be cursing Biden's name. So stop being obtuse.", "label": 1}
{"text": "Your package looks like a smashed twinkie.   Put that thing away.   I'm going to go blind", "label": 1}
{"text": "Incel alert. Women don't want to fuck you because you're fucking awful.", "label": 1}
{"text": "This is hate speech and should result in suspension from Reddit. Derogatory slur words which also is demeaning to women and dogs.", "label": 1}
{"text": "Shut up, garbage.", "label": 1}
{"text": "Discrimination and hate speech harassment! Flagged and reported this is abusive mean stuff", "label": 1}
{"text": "Shut up, Nazi.", "label": 1}
{"text": "It’s okay, have your echo-chamber, it surely served you well in the election. \n\nFor the record, I’m Scottish. Our conservatives would make Sanders blush. ", "label": 1}
{"text": "Unfortunately not just this joke. Some truly unhinged people coming out of the woodwork now.", "label": 1}
{"text": "I try to bring humor to the madness.  Most of the time, I'm laughing and crying while posting here to young children at the sheer amount of ignorance that I'm speaking to.", "label": 1}
{"text": "Americans care more about their wallets than other people.", "label": 1}
{"text": "Shut up Nazi cunt", "label": 1}
{"text": "Eat shit", "label": 1}
{"text": "Cool, Nazi. Eat shit.", "label": 1}
{"text": "> the sheer amount of ignorance that I'm speaking to.\n\nIt's hard looking in the mirror in the morning I guess.", "label": 1}
{"text": "no one fucking cares. go cry a fucking river.\n\nWe won the electoral college, the popular vote, the white house, the house, the senate, and supreme court justice picks again.\n\nGo fuck yourself. No one really cares what any of you people have to think. You lost. Go home. Shut up. It's over.\n\nSuck it up babies.", "label": 1}
{"text": "Good incel.  You like being a bad incel?", "label": 1}
{"text": "Right, I am shocked (I'm not) that Trump supporters apparently have no idea what their own guy was promising.", "label": 1}
{"text": "No one ever said they're obligated to tolerate your intolerance.", "label": 1}
{"text": "Maybe get a new insult. That is so early 2020s.", "label": 1}
{"text": "Yeah it doesn't sound very positive, that has to hurt...", "label": 1}
{"text": "Oh no, you sound triggered! Do you need a safe space?", "label": 1}
{"text": "Whose crying?", "label": 1}
{"text": "Apparently the 49% need a safe space", "label": 1}
{"text": "Humor is subjective idiot.", "label": 1}
{"text": "Ok, sure thing, schitzo.", "label": 1}
{"text": "I guess all that time you spent hating Trump did nothing positive for you.  Every time I look in the mirror,   I hear that uncertain smile...", "label": 1}
{"text": "agreed. soon enough they’ll realize they aren’t even winning.", "label": 1}
{"text": "You’re the one upset here buddy, 4 years of pent up rage clearly coming out, otherwise why would you even be here now trying to instigate this bs?\n\nAt this point, we’ve just got to sit it out and wait on the clock doing its thing. A second term of Trump will only last 4 years, and the old unhealthy man will croak it not long after, hopefully.\n\nIt the right that claim not to be turning fascist is actually true, then the next election will be fair and free. If not, it will end in a second civil war and we know how that turned out for your kind last time.\n\nNice to know you support and accused child rapist though, Epstein would be proud.", "label": 1}
{"text": "To bring humour, one must actually be funny.\n\nYou’re literally just here to be an antagonistic goon, to top up that massive ego you have.\n\nWe’re not sad though, the world is just shocked you would make a felon and accused child rapist the most powerful man in the world honestly.\n\nHonest question, if you knew your child’s male teacher was accused of raping a child, would you still send your kid to their class?", "label": 1}
{"text": "Victimization was one of the main factors that enabled Trump once again (which is bizarre, Trump talking about \"unification\" lol), we are not in 1900 any more, prejudice and hate are real, it will always be a thing, but as this beautiful creature once said: daddy chill\n\nhttps://youtu.be/i2gNx4-REIA\n\nCalm down, move on, there's no \"sides\" in this imaginary \"culture war\"", "label": 1}
{"text": "Im just saying words the President says! I don't understand, I thought we were in a post politically correct society?", "label": 1}
{"text": "Can I say it? You are a snowflake?", "label": 1}
{"text": "Poor people don’t want to work their ass off for nothing and choose to vote for the person they think will improve their lives. Choosing that over other people’s secondary issues makes sense to me.", "label": 1}
{"text": "Exactly this, it’s 4 years, if we really are wrong and the elections will continue then we will fight that battle then.", "label": 1}
{"text": "Some humor is.\n\nMost humor isn’t.", "label": 1}
{"text": "Enjoy the 4 years bud. With this attitude you’ll make it at least 8-12 ", "label": 1}
{"text": "https://www.nytimes.com/2024/11/05/us/politics/trump-nancy-pelosi-liz-cheney-women.html\n\nSo Trump can say it, but i can't?", "label": 1}
{"text": "Neither do democraps. You can ask Dave Chappelle about that.", "label": 1}
{"text": "Will do, hick.", "label": 1}
{"text": "Nobody cares about having the \"right\" idea about you. You're a fascist. Sadly the Democratic party is feckless and we will never have a civil war against you people.\n\nYou just get to spread your lies and hatred and racism with no consequence. Consider yourself lucky. In a normal country you people would be on the wrong end of the guns,", "label": 1}
{"text": "If the mirror is talking to you, you *definitely* need to see someone about that.", "label": 1}
{"text": "You have me confused with someone else.", "label": 1}
{"text": "Most sane dem voter ladies and gents.", "label": 1}
{"text": "She was WHAT!  Stereoty ping and making  presum ptions is wrong.", "label": 1}
{"text": "Clearly you during rare brief moments of clarity.", "label": 1}
{"text": "It's easy to not care about things that havnt or believe they won't effect them. \n\nPeople suck, I'm giving up.", "label": 1}
{"text": "Chappelle is as much a Democrat as Joe Manchin", "label": 1}
{"text": "Why do you weirdos care about penises so much?", "label": 1}
{"text": "“I don’t hate any individual person, just ALL the individual persons in a group I dislike”", "label": 1}
{"text": "It is not just the incels.\n\nJust a litte note for all you Americans here on Reddit; you are under a attack by RUSSIAN TROLLS.\n\nMultiple subreddits have large number of Russian troll accounts now trying to do psy-ops after your election. Russians have prepared for different scenarios and then they act based on plans.", "label": 1}
{"text": "All they do is manipulate unhinged estrogenic emotions. Despite all the appeals to emotions fallacies employed, the majority of the country said “yeah I see right through your BS emotional manipulation, F off”. The machine continues to run for those inside of it, instead of trying to be more moderate and reasonable, it doubles down.", "label": 1}
{"text": "Xin lỗi mọi người, tôi là người không xứng đáng, tôi đã gây phiền cho mọi người. Thực sự tôi cảm thấy  không ổn,  tôi đã cố gắng nhưng mọi sự áp đặt cứ đổ dồn lên tôi. Tôi biết tôi là con Mèo đó. Tôi xin lỗi. Sau này vững vàng hơn tôi sẽ quay lại. Tạm biệt cả nhà. Tôi yêu quý mọi người và yêu quý thế giới công nghệ. 😥😥😥", "label": 1}
{"text": "Why did you put the letter T in there? Do none of you know how to type? Every one of you I see popping up in here type like a fuckin 4th grader\n\n“…LOL, comma, cry mor, xomma, LOL”", "label": 1}
