{"text": "Apex purified Lugia (for Lugia) is the one that is relevant which is still paywalled and only obtainable once only.\n\nWithout Aeroblast++ it is rank well lower than Salamence and even Staraptor/Braviary/Honchkrow (non shadow) at Lv40. You can just catch 6 Murkrow now and evolve them to get a “serviceable” team or ideally spare some leftover candies/extra Charged TMs on your high CP Bagon/Salamence, thankfully you don’t need Outrage now.", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "I’m experiencing the same problem. The berries disappear and the bar doesn’t go up.", "label": 0}
{"text": "Roar of time can't be given from an elite tm", "label": 0}
{"text": "I ended up getting one. Took forever though", "label": 0}
{"text": "Yes.\n\n\nBecause they were hard lmaooooo", "label": 0}
{"text": "I've been thinking/hoping for zorua, personally, which would explain the delay/surprise announcement since it would be a very odd/interesting spotlight hour for everyone.", "label": 0}
{"text": "Good to farm candies", "label": 0}
{"text": "No fashion week 😭😭😭", "label": 0}
{"text": "Yes you did\nRegular shiny rate from the very first time", "label": 0}
{"text": "You laugh but when Niantic “fixed” Rocket battles so they no longer stop attacking you briefly when you charge attack or swap Pokemon a looooot of people complained they couldn’t come close to beating Giovanni anymore", "label": 0}
{"text": "Likely released on halloween itself.", "label": 0}
{"text": "but the overworld decor tho", "label": 0}
{"text": "also halloween has zorua as a boosted shiny??", "label": 0}
{"text": "I don't understand dynamax raids. I can't beat any of the current pokemon with the starters I have. I never am allowed to collect max particles. When I raid I can't do any of the new charged attacks.\n\nIf anyone can please simply explain to me, maybe I'd hate it less.", "label": 0}
{"text": "WE’RE OFF TO NEVER NEVERLAND!! 🎸🎸🎸", "label": 0}
{"text": "Fortunately I found one of those tasks on the first day, but each only gives 1/6 of the minimum amount that a raid would have given.", "label": 0}
{"text": "I think it was item storage, pokemon storage, a regular incubator, and a super incubator for maybe 400 coins? You could get it three times. So as long as you planned to get the storage anyway, the two incubators were basically free.", "label": 0}
{"text": "Because that cardboard is a tangible asset that you can sell in the future. You can't sell pixels...", "label": 0}
{"text": "Thanks, I've had a 0.20m Kartana this whole time that I thought was too big to get the glitch done", "label": 0}
{"text": "It's nice but I miss seeing people's names and ranks", "label": 0}
{"text": "These are standard mobile games prices", "label": 0}
{"text": "If you didn't get desired IVs in the wild, where you could easily check hundreds if not thousands of bulbasaurs why do you think you would have better luck from dynamax battles (in hypothetical scenario where there's no IV floor) ? And how do you farm dynamax battles? Considering that you want to save an elite TM i guess you want to save money, thus you are not buying thousands of MP packs. And doing 4 free ones a day hardly counts as farming. And even if you bought boatloads of MPs - where are you finding enough battles?", "label": 0}
{"text": "can't remember exactly (i think TheSnowNinja got it right) but it was just insanely good for the cost. you know, very unlike niantic. which is probably why they removed it so quickly.", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Excuse me, 100 dollar? Lmfao", "label": 0}
{"text": "In my opinion, the infographics are fine for a general overview of what's coming up, but the calendar format is really valuable for seeing when everything is actually happening relative to everything else. So thank you for doing these.", "label": 0}
{"text": "5 raid passes per! It was glorious", "label": 0}
{"text": "Height is correct, maybe just unlucky with the weight?", "label": 0}
{"text": "maybe six, 3 zorua and 3 zoruark", "label": 0}
{"text": "Before more people just guess, here it how the box looked like:\n\n[https://www.reddit.com/r/TheSilphRoad/comments/1f85iqi/one\\_of\\_the\\_best\\_boxes\\_ever\\_dealwise/](https://www.reddit.com/r/TheSilphRoad/comments/1f85iqi/one_of_the_best_boxes_ever_dealwise/)\n\nIt was 5 Super Incubators, 5 Premium Passes, 1 Pokemon Storage, 1 Item Storage", "label": 0}
{"text": "What would people want so many incubators for?? Once you get a Larvesta is there really even anything else cool?", "label": 0}
{"text": "In Euro it's even more expensive", "label": 0}
{"text": "My only regret with that box is the fact I didn’t buy all three", "label": 0}
{"text": "it brings MSG players into pogo... even if not for long. aside from meltan it is the only true exclusive that can be sent to the MSGs (if you trim it first)", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Same fam same", "label": 0}
{"text": "Do you know if you can have multiple of the challenges at once or is it limited to one at a time?", "label": 0}
{"text": "I see your story as a glimmer of hope that my battle is not for nothing. I have been trying for 3 weeks now to get my account back, and I will not give up. \n\nGlad you were able to get your account back!", "label": 0}
{"text": "definitely hacked. i don't think niantic purges accounts for being inactive.", "label": 0}
{"text": "Here a box of the same name is at 9400 coins for 100 premium battle passes and 20 TM of each type. Not buying.", "label": 0}
{"text": "I tested.  It let me capture new gastlys from two spots that I captured yesterday but would not let me place a second time.", "label": 0}
{"text": "As usual, a total and laughable ripoff", "label": 0}
{"text": "This has also happened to me with the Lucario mask and Morpeko onesie. I can’t currently play and Niantics AI chat bot is GARBAGE.", "label": 0}
{"text": "Did you mean to say x2 Transfer Candy for the Surskit spotlight hour?", "label": 0}
{"text": "Significantly cheaper than buying these items regularly for and players who invest money into the game and can afford to stock up.", "label": 0}
{"text": "Stocking up for future events whilst cheaper probably", "label": 0}
{"text": "Anyone know what the shiny rates are for Umbreon?", "label": 0}
{"text": "Very possible. It would have to still have 100%-dead in one shot which isn’t too unlikely I don’t think. But I dunno.", "label": 0}
{"text": "Why I buy physical", "label": 0}
{"text": "Or they’d change the price points so instead of one sale at 100 bucks they sell 20 at 5 bucks. Digital goods without any possible secondary market. They can monetize however they wish, but if no one were buying the outrageous priced packs, they’d change approach for sure.", "label": 0}
{"text": "I’m sorry, but *$100* for that first box?  In this economy?", "label": 0}
{"text": "Dude, I would much sooner spend $40-100 to start a meth addiction than forking it out for any of these", "label": 0}
{"text": "Yep, those sure are boxes.", "label": 0}
{"text": "I’m fairly sure that the people complaining about $4 would complain at any goods/price ratio unless it was free.", "label": 0}
{"text": "That’s a big hope", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "You can also check on [PokéRanks for the current list of GBL encounter rewards](https://www.pokeranks.com/GBL)", "label": 0}
{"text": "(Answering seriously in case people are confused) No, Froakie and Rowlet are the spotlight hour. The first box is for 5-star raids, the second for Mega Raids, and the 3rd for Raid Hour.", "label": 0}
{"text": "I've also seen the pokemon change in the middle of the day. I did two Gastly battles at a nearby park in the morning on Wednesday and left pokemon at the spots. Later in the day, both spots had Grookey battles. I was able to do the battles but couldn't leave pokemon because mine were still there.", "label": 0}
{"text": "I don't know how people don't leave easy to remember names on their favorite 'mons. I could easily name at least 10 of my Pokémon because I give them nicknames that are either too fitting for them or too silly that they end up being iconic.", "label": 0}
{"text": "Lugia will make its PVP comeback eventually, I’m sure. It has the stats for it.", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "What a claustrophuck of calendar. I can't read or understand anything.", "label": 0}
{"text": "Who's this pokemon please?\n\nhttps://preview.redd.it/7r0hgciahywd1.jpeg?width=1080&format=pjpg&auto=webp&s=c4129d770008b8f49b3857859750eddf5456a9db", "label": 0}
{"text": "I’ve caught 800 candy worth and still not a shiny found", "label": 0}
{"text": "Nothing happened. It just shows power spots to go to 🤷🏻‍♀️", "label": 0}
{"text": "Thank you", "label": 0}
{"text": "Got 2. Was planning to buy the wife some from her phone but it had already expired by the time I was done work.", "label": 0}
{"text": "He is just lazy", "label": 0}
{"text": "IT'S ZORUA WITH A STEEL CHAIR!!!", "label": 0}
{"text": "The only thing “boo” about that first box is the price", "label": 0}
{"text": "Still no Dark void for Darkrai?", "label": 0}
{"text": "Damn, that's crazy.\n\nI was super proud of myself for managing to do metal claw / moonblast zamazenta solo (with weatherboost), but this is whole another level.", "label": 0}
{"text": "While asking questions about the game is always okay on the Road, please consider asking very simple questions in our weekly [Questions&Answers Megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky).\n\nIf your question has been answered, please comment \"ANSWERED\" (in all caps) and the post flair will indicate that your question has been answered. This will make it either easier for other people with the same question to find the answer they are looking for or for mods to remove the thread if it isn't needed anymore.  \nThank you! :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Yes. That was the second thing I said. You don't get a remote from weekly breakthrough if you have 3 already.\n\nBut it's not because of a limit on number of remotes you can have.", "label": 0}
{"text": "Yes if you have 3 or more remotes it becomes premium.", "label": 0}
{"text": "I mean\n\nIt's the players who are out of their minds putting up with niantic for years", "label": 0}
{"text": "I asked this before and I was told that yes, he will always be normal mode", "label": 0}
{"text": "I see. And my wife isn't home yet most nights by then (teacher).", "label": 0}
{"text": "Yes, some Pokémon in the main series change form while in battle and/or meeting certain conditions but revert back after the battle ends, like Castform, Cherim, Darmanitan, Morpeko, Meloetta, etc. Oreviously Niantic has just been making these all permanent forms, but they finally decided to implement one more like how they are in the main series.", "label": 0}
{"text": "Sounds like raid passes will still be an option just won't be premium passes", "label": 0}
{"text": "exactly! \n\nit's basically just a cosmetic transformation, with the gimmick of changing the type of it's signature move is all.", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Usually that shouldn't matter. I've never had them refuse to reimburse through this method before.", "label": 0}
{"text": "I will be following this thread with great interest, so I know if it’s worth bothering to go into town tomorrow 😂", "label": 0}
{"text": "Godspeed beta testers", "label": 0}
{"text": "Yes, we’ve been tracking it with full campfire screenshots for weeks now. We have days where we tracked every hour", "label": 0}
{"text": "We have a small group of players in the UK and it’ll be super helpful if our heroes in New Zealand could give us some info on:\nHow many players does it take to beat those GMax bosses?\nIt’ll be appreciated if you could also share the details on the levels of counters and Max moves etc. \n\nThank you so much!!!", "label": 0}
{"text": "https://reddit.com/r/TheSilphRoad/comments/1fhz906/how_the_allnormal_showcases_work/?sort=top\n\nBased on u/FatalisticFeline-47 's guide, it looks like the top choices will be\n\nFire: Hisui Growlithe & Arcanine\n\nGrass: Alola Exeggutor & XXL Pumpkaboo\n\nWater: Origin Palkia", "label": 0}
{"text": "Community event badge lets goo", "label": 0}
{"text": "Yeah it was in my first few months playing and I just wanted Riolu candy and shiny Yamask so I just went for it without thinking when I saw the promo for the 7km. Now I know lol", "label": 0}
{"text": "ANSWERED", "label": 0}
{"text": "SilphBot has changed the flair on your post to ✓ Answered. Thank you! :)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "So they basically just don’t want me saving up and stacking the 2 premium passes from Raid Hours every week to use on something more useful….?", "label": 0}
{"text": "Yeah, apparently if you catch a Zorua with the ++, and your buddy is super heavy, it can't read the actual weight and just adds hundreds or thousands of kilograms of weight to the Zorua", "label": 0}
{"text": "I was waiting THIS post.", "label": 0}
{"text": "If by \"suffer\" you mean \"continue enjoying F2P content\"", "label": 0}
{"text": "..what is the suffering? no want no buy", "label": 0}
{"text": "Ugh the big issues that will affect players this weekend (softlocks and being kicked out of battles) are only being \"investigated\" and they are not working towards a fix yet\n\nThis is going to be a nightmare with 40 player lobbies. So many people are going to get left out with these bugs", "label": 0}
{"text": "Thanks nz, they should be paying you.", "label": 0}
{"text": "Can someone explain why these boxes are so bad? Obviously the price tag is high, but I don’t see the value being bad for someone who hatches a lot of eggs", "label": 0}
{"text": "\"We believe in the incredible power that our communities can harness to do good\"\n\nBuilding gyms and donating berries and potions to those less fortunate?", "label": 0}
{"text": "Did they increase difficulty of falink 3 star or weaken level 1 attack  ? Seems more tanky and I soloed about 10 so far", "label": 0}
{"text": "Leaving this here so I can check it later. I'm planning on going out with 4 friends tomorrow hoping it'll be enough to grab a couple gigantimax", "label": 0}
{"text": "Assuming the alternate baselines for new contestants follow expected patterns, here's the scores we're expecting to see:\n\nhttps://preview.redd.it/3ppqizmroywd1.jpeg?width=1000&format=pjpg&auto=webp&s=fcd0487a9da45577ee2961574746a2bf3de5565c\n\nGrass and Water are runaway contests with Exeggutor-Alola (maxing @ 5108 ) and Palkia-Origin (1723). Fire types will be \\*mostly\\* normal, unless someone has themselves an XXL Hisuian Growlithe (1321) ready to go.\n\nNo need for evolution quandries this time around, but you can always use my [Calculator](https://docs.google.com/spreadsheets/d/1ZZwlZ2DOYeO0ouUgu-jXn3qmIf8jE4WTa3BhmtVupHc/) if you want to know scores without access to a showcase.", "label": 0}
{"text": "Wym 2 passes from raid hr?", "label": 0}
{"text": "Only going to have a 1-2 hour window to play. Hope it happens.", "label": 0}
{"text": "Genuinely, thank you for the guidance and advice", "label": 0}
{"text": "Beta tested here. Will report back in an hour or so on how our group of 4 does.", "label": 0}
{"text": "Checking in to a Community Ambassador raid hour meetup on Campfire has been giving out 2 green passes every week.", "label": 0}
{"text": "No, because they keep making the boxes more expensive", "label": 0}
{"text": "You get two passes when you check in on the Campfire app", "label": 0}
{"text": "we did create an event for the weekend, so people have signed up, but we still dont know if we are able to do these raids. \n\nThis is very anti-climax, John.", "label": 0}
{"text": "Given how many issues have existed since Dynamax launched and have never been fixed, I'm not surprised.  \n  \nThat page is missing all the issues I have most frequently too.", "label": 0}
{"text": "Nah this looks like the Uranium pack💀💀", "label": 0}
{"text": "Bet, imma pull out this 1500kg Groudon I got", "label": 0}
{"text": "I wish I had a ++, never gonna get a 11,900kg Zorua like some other person on Reddit did ;-;", "label": 0}
{"text": "Germany here. I got together a group of around 10 dedicated players. Let‘s see how it‘ll turn out. I‘m looking forward to the first reports from NZ and I‘m hoping for good news (as in, easy battles and no bugs).", "label": 0}
{"text": "If they put something decent in the eggs it  would be ok. But not interested in the pawnyard shop", "label": 0}
{"text": "Blah, I would have preferred it to be a form that stays put if you exit battle while it’s still in that form.", "label": 0}
{"text": "Thanks for everything!", "label": 0}
{"text": "As always, I want to say thank you to the New Zealand beta tester, your sacrifice is always appreciated!", "label": 0}
{"text": "[Tweet with expanded information on what is actually changing going forward](https://x.com/FlareblazeA/status/1849903945164128389)", "label": 0}
{"text": "The raid passes will be the orange daily passes instead", "label": 0}
{"text": "Yesterday I did one Falinks solo for the first time (didn't notice if it had allies in the power spot) and today I tried two and didn't win with the same team, 10 or 20 seconds. Yesterday I won with half HP of the team combined intact, today I couldnt win. I think that may be the case", "label": 0}
{"text": "The same principal applies to the coin boxes. Which keep getting worse and worse. So no, we don’t get to enjoy the F2P content. \n\nStop apologizing for Niantic’s behavior", "label": 0}
{"text": "i mean, I see people selling trades all the time sooooo.", "label": 0}
{"text": "I wouldn't even pay this for an infinite incubator lol\n\nYou can basically get two complete Pokémon editions (or other AAA) for that price.\n\nJust looked in [Kleinanzeigen (German Craigslist)](https://www.kleinanzeigen.de/s-anzeige/3ds-pokemon-sammlung/2903061339-227-5425). I could buy Sun, Moon and Alpha Saphire for 100€...", "label": 0}
{"text": "Narrator: it was", "label": 0}
{"text": "I wonder if the power stops will change", "label": 0}
{"text": "What about xxs cosmog?", "label": 0}
{"text": "Congratulations to the communities that have CAs, I guess.  The application process is beyond broken at this point -- Niantic takes *months* to approve new applicants who have submitted the requisite amount of in-person events, and even then there's no guarantee that you'll actually get approved in the event that some random user in your Discord server said something against the TOS five years ago.", "label": 0}
{"text": "***Other Ambassador News***  \nIt seems like Niantic are wanting to work with Community Ambassadors to hold charity events such as donation drives and park clean-ups during Mankey Community Day. I don't have any other info about that as this is also news to me as of writing this.\n\n  \n[https://x.com/FlareblazeA/status/1849903945164128389](https://x.com/FlareblazeA/status/1849903945164128389)", "label": 0}
{"text": "The trick to Persian is to have your fighter in slot 2 or 3 with a fast charging (preferably power up punch) charged move. Then you swap immediately into that Pokémon (Lucario is a good option but a scrafty can work too for feint attack) and then just go to town on it, making sure to take advantage of the rocket not attacking for 2-3 fast moves when you do anything. \n\nAs I said in another comment I did a Giovanni with a 1500cp scrafty and 2 10cp magikarp once. I’ve also soloed him with a 2500cp Lucario a few times. It’s a matter of typing and timing and making sure to abuse the pauses.", "label": 0}
{"text": "If it's around 0.1m tall you should be good, but I've not seen someone use a cosmog so can't be certain", "label": 0}
{"text": "I dont know if you got it but i captured 300 zorua whitout a shiny", "label": 0}
{"text": "This should be interesting…", "label": 0}
{"text": "Once per day. Only for events listed as an \"Associated Event\" in Campfire. So only ones Niantic add.", "label": 0}
{"text": "Meh, unless it became a top 10 which I'm not even sure it was prior to the nerf, there's better options. \n\nIf you want Lugia cause you like, that's great, but it's not something I'd recommend anyone drop resources on.", "label": 0}
{"text": "I used the Gmail that was assigned to my account, and proved them it's my account.", "label": 0}
{"text": "So what will they be then? Remote passes? Orange passes?", "label": 0}
{"text": "Yep, PTC was the reason I lost my account from the first place, would recommend to unlink it immediately.", "label": 0}
{"text": "How high have you all powered up your counters? This will be interesting to know and later hear how you did, since the \"recommended group sizes\" based on Niantic are pretty high, but are they even for regular raids. Wondering will this be similar...", "label": 0}
{"text": "This is surely a trick, right? No way people are dumb enough to buy these, except MAYBE the last one for the gigantimax weekend. Either way whoever made these boxes at niantic are 'tarded.", "label": 0}
{"text": "costs 800mp to enter, so you can only do like 1 per day?", "label": 0}
{"text": "Wait, why put your phone on one of your pokemon?", "label": 0}
{"text": "Orange passes.", "label": 0}
{"text": "Narrator: it wasn't", "label": 0}
{"text": "How did you get that flair??? I want it", "label": 0}
{"text": "yea, and honestly i won't ever get to 100$ in one purchase. So I'm not target audience either way", "label": 0}
{"text": "2 tomorrow. As long as you’re maxed out by tomorrow", "label": 0}
{"text": "I had both PTC and Gmail linked to my account.\n\nDon't let them fool you by saying the data isn't saved. He is, throw at them information only you could know about this and hope for the best.\n\nGood luck!", "label": 0}
{"text": "you can get more, if you have the funds or coins", "label": 0}
{"text": "Holy trash", "label": 0}
{"text": "I don't know about the other three. But I have a decently leveled and max attack boosted hundo Charizard and scorbunny. Decent leveled blastoise and intelleon. I'm only lacking in my grass types. But I can cover that with my gengar and metagross", "label": 0}
{"text": "Honestly I would prefer to unlock my Pogo with 2FA everytime and my account won't get hacked again.", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "You're welcome! \n\nEnjoy the game and don't forget to unlink your PTC!", "label": 0}
{"text": "I am happy for you!", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "Yes!!!! Thanks!", "label": 0}
{"text": "Worth mentioning Niantic recommends 20 people for a typical legendary but we also know most can be duoed so let's see how this actually comes out for people who have counters powered up.", "label": 0}
{"text": "Have you used any ETM's on them? Personally feeling like that's maybe not necessary and also sort of hate Niantic on how this has been implemented to kinda lure people to use resources. I haven't yet powered up too far, so very interesting to find out how you did 🙏", "label": 0}
{"text": "I don't name much of my Pokémons (never did, even on Nintendo ds), just not my thing, the Phone mon was an idea meant for another purpose xd", "label": 0}
{"text": "Yeah, I agree. Both have their place, Calendar to see what event is current/next, then the usual infographics to see what the event is about.", "label": 0}
{"text": "This exactly what I meant too 👍", "label": 0}
{"text": "Probably? A.exegg can get up into the 4000s, super pumpkaboo caps below 2500, idk shaymin sky though  \nIdk how large the XXL is but base size and weight are roughly double so I'd assume around 2k", "label": 0}
{"text": "I don’t see any in Auckland", "label": 0}
{"text": "Thank you!", "label": 0}
{"text": "In fact I have did that with another purpose, my purpose was to peoples (that I don't personally know) but live in the same country as me, to send me a msg before we level up our friendship. Although no one sent me a message, it helped me with recovering my account :)", "label": 0}
{"text": "When posting bugs on the road, please take into account our rules for bug reporting, [found here](https://www.reddit.com/r/TheSilphRoad/wiki/rules#wiki_3.7_bug_reports).\n\nPlease also make sure, that your bug isn't already listed on [Niantic's Known Issues](https://niantic.helpshift.com/hc/en/6-pokemon-go/section/180-release-notes-known-issues/) or [GO Battle League Known Issues](https://niantic.helpshift.com/hc/en/6-pokemon-go/faq/2699-go-battle-league-known-issues-1598471929/) page.  \nThank you! :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah and makes a great mega too, so makes sense in that case.", "label": 0}
{"text": "Submitted my application two months ago and haven’t heard anything …..", "label": 0}
{"text": "I'll make a post after we do so keep an eye out and I'll let you guys know", "label": 0}
{"text": "Nothing Christchurch either", "label": 0}
{"text": "10:07 am and no Gmax battles can be seen", "label": 0}
{"text": "I think they meant which Niantic email address did you contact rather than which email account of yours you contacted then with", "label": 0}
{"text": "Yeah, I just found out about the passes last month and now they are patching it of course. At least was able to save some", "label": 0}
{"text": "To be expected 🤣", "label": 0}
{"text": "People who hatch eggs should go buy a pokemon game and farm that way. You're just gambling and wasting money playing egg hatch in pogo. From personal experience they forget to turn shinies on for a lot of events or just standard egg hatches after events. Precovid and maybe slightly after I was a really big egg hatcher because there was a bit of benefit, but now no. Waste of money and the changes niantic brought to this game just suck overall, I honestly feel a bit bad for what new players missed out on in the first 3-4 years of this game. I waited a month and saved coins to restock some green passes, but apparently not this time.", "label": 0}
{"text": "I swear every raid event always has spawning problems in australia/new zealand 😭😭", "label": 0}
{"text": "Classic", "label": 0}
{"text": "New here? This sub just wants to complain and be toxic. It’s best to just read the news and infographics.", "label": 0}
{"text": "It’s so annoying 🙏", "label": 0}
{"text": "Is it bad that my local community hasn't planned to meet up until 2pm, give Niantic a chance to get thier A into G...", "label": 0}
{"text": "Club Campfire is part of the Community Leader program, a program similar to community ambassador program, but limited to certain countries and the leader program operate differently", "label": 0}
{"text": "Yes get in lugia!!!", "label": 0}
{"text": "No. Because this is not the kind of content that is meant to be shared and posted in this  sub Reddit", "label": 0}
{"text": "Sorry guys, hopefully Niantic gets their stuff together and to turn it on soon. Thank you for the updates though! Was wondering what GMax dens would look like.", "label": 0}
{"text": "Whoops okay. My bad", "label": 0}
{"text": "I still don't get it, Giovanni is easy since there is a pause. If the pause isnt intentional, then it would have been removed a long time ago.. I know people here are far from elitist, but if you just played the Lucario day for a few raids, then Giovanni is easy - end of.", "label": 0}
{"text": "Yikes sad that this is the norm", "label": 0}
{"text": "So beta tests just started, right? 😆", "label": 0}
{"text": "Also have been curious and watching these threads seeing what can be figured out. I’ve been using an XS Flabébé at .02kg/.05m and my Zoruas have all been XXL ranging 321.99kg to 1685.19kg and all 1.23m.\n\nI have an XXS Flabébé that’s actually ‘bigger’ at .03kg/.05m that I could try, but now I’m tempted to try a .17/.17 XXL Flab. I don’t have Gimmi to try, but maybe Cutiefly…\n\nThere was a post with a bugged weight Zorua and XXS tag(!!) but they haven’t said what their buddy was.", "label": 0}
{"text": "Noted, I'm working on a better version after taking some helpful feedback", "label": 0}
{"text": "https://preview.redd.it/roq3479oxywd1.jpeg?width=750&format=pjpg&auto=webp&s=3b36cb451f273d2ae6922264f83d2f92cc1f1659", "label": 0}
{"text": "Ditto (no pun intended). I have to be at work at 1PM Saturday.", "label": 0}
{"text": "In one now - 38 other players haha!", "label": 0}
{"text": "10:12am Gmax have appeared, but not at every dynamax spot, yet", "label": 0}
{"text": ">I'm only lacking in my grass types.\n\n\nIt makes the most sense to do Gigantimax Venusaur first because we have the best counters for it. Charizard double resists Grass and Metagross resist Poison, while both do super effective damage.\n\n\nThen you'll have Gigantimax Venusaur to combat Gigantimax Blastoise.", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Do you actually need to be at the ambassador event to claim the rewards? For example, there is an ambassador lead group about 2-3 miles from me.. sometimes I go in person, sometimes I don’t… can I still ‘check in’ and claim the rewards if I’m a mile away?", "label": 0}
{"text": "It appears disguised as your buddy, so if your buddy is a shiny Zorua, it will appear as a shiny Zorua. If you've not got a buddy or you've recently changed your buddy, it can cause Zorua to spawn without a disguise.", "label": 0}
{"text": "Omg finallyyy! We got a community meetup in the morning we will be around 70 people banging on those Gmax monsters :D", "label": 0}
{"text": "Update if anyone’s interested. 101 total Pokémon against it and wiped at about 1/3 ho remaining", "label": 0}
{"text": "One issue I had was an error message stating \"cannot start the battle\" or word to that effect.\n\nI noticed that one of my \"battlers\" had been placed in another Power Spot previously. When I replaced that battler I could start the battle without problems.", "label": 0}
{"text": "Thank you for your effort bro 😎", "label": 0}
{"text": "Thwy changed the countries name from New Zealand to Beta Zealand :D", "label": 0}
{"text": "As in you lost?", "label": 0}
{"text": "offtopic but ive noticed some dmax spots not showing on other accounts but others are so im not sure if its taking longer loading issue idk", "label": 0}
{"text": "Wait….what?…..", "label": 0}
{"text": "You didn't \"know\"? Or wanted to humble flex by acting like you don't know what's going on?", "label": 0}
{"text": "Ah pls don’t be salty, NZ is a beta tests area. I don’t see nothing wrong with it. He already was patient lol 😆", "label": 0}
{"text": "This is kind of a non answer, but just play however you like. If you want to just kick back and do some no stress battles, then drop to a range you find more comfortable. If you want to gradually improve and keep steadily climbing in the long term, then stick at 2k and keep on learning/progressing.\n\nI know some people don’t like the idea of tanking elo, as they deem it unfair on the people that are legitimately playing at the lower levels, which I completely understand. No system is perfect though, this is nothing new to competitive play, and lots of people do it anyway. \n\nI’d add that hitting ace in your second season with over a month left until the next season tells me that you have the potential to be a decent battler in time. Maybe consider taking the time to learn some extra skills and make it to the next ranks.\n\nAs I say though, totally up to you. Happy battling!", "label": 0}
{"text": "Just watched a group of 40 fail to even get charizard into the red. Really great balancing", "label": 0}
{"text": "We have 2 meet-ups in Berlin tomorrow and the day after, the one I am going to will have at keast 50 players 😍", "label": 0}
{"text": "Oh I completely understand, no beef with the ambassadors. Just sayin there's a gap here. For my own part I created a meetup at a location that frequently has 20+ raiders for raid hour/day, but have only got 2 people outside my family indicating they'd come.", "label": 0}
{"text": "Chonker", "label": 0}
{"text": "Yes as in we lost. Back in lobby. Going again. Says team 1 of 11. 39 in my lobby.", "label": 0}
{"text": "Surely this means you won, right", "label": 0}
{"text": "Dynamax Pokémon. Gigantamax is basically the same thing as Dynamax, except the Pokémon who can Gigantamax have unique Gigantamax designs and a special G-Max move instead of the regular Max Moves.", "label": 0}
{"text": "We’re they all using Squirtle?  I assume so. ", "label": 0}
{"text": "OP is living under a rock", "label": 0}
{"text": "When you don’t have access to your account you can’t talk to the normal bot. When you fill out the appropriate form on helpshift, responses would come to your email account. \n\nI would imagine the address is similar to “privacy@nianticlabs.com” that I spent a month arguing with in the summer. ", "label": 0}
{"text": "I knew that Zorua appeared disguised as your buddy but I didn't know that it could spawn without disguise in the wild. It was my first time Zorua spawn this way.", "label": 0}
{"text": "For anyone still on the hunt, I've been trying with a 0.08m Joltik and have had no luck, a 0.09 Flabebe gets way heavier Zoruas. Don't know if it's just my luck, or if there's something about Joltik that prevents it from giving a bugged weight", "label": 0}
{"text": "Just failed with 27 people. First attempt 22 people and had lots of accounts glitch out. Heavily overtuned fight.", "label": 0}
{"text": "A group of 40 Players!!!  in New Zealand - completely failed to beat giga charizard . it's laughable that this is the experience . Horrible", "label": 0}
{"text": "27? That's stupid. Thanks for the early reports. A easy skip for me...", "label": 0}
{"text": "Might get it this time. Stacking my blastoise with shields boss nearly dead 17 Pokémon remaining on fight", "label": 0}
{"text": "Yea he confirmed they lost", "label": 0}
{"text": "It was mi first time spawn this way :(", "label": 0}
{"text": "Good luck coordinating that in person lol", "label": 0}
{"text": "What kind of teams were the 40 running?", "label": 0}
{"text": "Correct, that was the question I was asking, It's really hard to pin down a support email for them", "label": 0}
{"text": "Also having this issue... so confusing", "label": 0}
{"text": "Great tip! Thanks for the post. I already have a maxed out Melmetal, but this is a great way to get several boxes worth of candy in one shot.", "label": 0}
{"text": "It is. But still most things for me would be better than costume pokemon that are just going into the bin", "label": 0}
{"text": "I put a lucky pokemon that way it cant be traded.", "label": 0}
{"text": "We won. second attempt with 14 remaining Pokémon total.", "label": 0}
{"text": "Oh so it’s unbeatable very nice!", "label": 0}
{"text": "If you tap slowly it charges others in your group. If you tap too fast, it's found to stop working (>4 taps/s).", "label": 0}
{"text": "Which is why Niantic is not going to do anymore Dark-type Showcases or do any Zorua Showcases.", "label": 0}
{"text": "The fact that they let you recover it based on that is interesting. Your post made it sound like it was never your buddy, but this makes it sound like it was. \n\nIf it was your buddy that means that anyone of your friends list would know and, considering that having a lot of non-local friends makes it likely you don’t actually personally know them all, if they are on Reddit and saw your account was hacked they could possibly have “recovered” it as well. \n\nThat said, from another comment it sounds like you also had to answer the 10 questions, which makes it less likely that would happen. Still interesting they did it though. ", "label": 0}
{"text": " thanks so much for the answer! I definetly want to climb in rank, and i keep every pokemon with pvp IVs that i come across, watch YouTube videos and so in. So it means a lot to me. Also my main objective is the stardust and i already get that at 1 win. So maybe i should just work on my skills and get ready for ultra league once more💪 just got my feraligatr best budied 😁", "label": 0}
{"text": "im in my second try to beat chair lets see how it goes", "label": 0}
{"text": "Thanks! I’m trying to organise a group but sounds like you need a full lobby of 40 people and only a handful is interested :(", "label": 0}
{"text": "Doesnt matter because the attacks cant be dodged. You see the number of mons decrease by 40 after the first charged attack. So even a level 50 perfect counter mon died", "label": 0}
{"text": "If the alternative is wasting everyone's time then it seems worth trying at least. However it's tricky because it's too late to invest into the moves since you need particles to battle.\n\nSo before starting I would ask everyone to slot in a Pokemon with shield and heal unlocked if they have one. \nThose people can use it every dmax and let those without heal/shield to do max attacks.", "label": 0}
{"text": "Hello there, u/Few-Establishment704! Thank you for your contribution to r/TheSilphRoad. Unfortunately, your post has been removed for the following reason(s):\n\nThe Silph Road is a heavily-moderated community focused on studying and illuminating game mechanics. For this reason, we only allow certain, specific types of content. Your post falls outside of our allowed post types.\n\nHere is what you can do:\n\n- Is your post a question? Try posting in our weekly Q&A megathread! It is almost always pinned to the subreddit when sorted for “Hot!”\n- Try posting in r/PokemonGO, another community page which allows a broader range of content.\n\nThanks for your understanding!\n\n\n\n___\n\n###### For our rules and allowed post types, please see our [comment and submission rules](https://www.reddit.com/r/TheSilphRoad/wiki/rules).", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Doesnt matter because the attacks cant be dodged. You see the number of mons decrease by 40 after the first charged attack. So even a level 50 perfect counter mon died", "label": 0}
{"text": "Or just one of the kanto starters :)", "label": 0}
{"text": "Beat Charizard with 30 people. Two people got shiny so can confirm it's enabled.", "label": 0}
{"text": "Ouch that's tragic 🤯", "label": 0}
{"text": "thats....not a lot", "label": 0}
{"text": "How many people. How hard", "label": 0}
{"text": "So you actually beat one? Need to know more", "label": 0}
{"text": "Also did all 40 people need to be at that spot?", "label": 0}
{"text": "Are you saying you didn’t beat them? How many players were there?", "label": 0}
{"text": "How many people did you need to win? And what level of dmax Pokémon did you or others bring?", "label": 0}
{"text": "We just did a 20 man charizard. Failed a few seconds after we got it to yellow.", "label": 0}
{"text": "The singular rare candy lol.", "label": 0}
{"text": "There's streamers failing with 35 other players right  now", "label": 0}
{"text": "You can buy more MP just like raid passes. Also if you start with over 800 MP then you can earn more to take on another battle, although that might take some time to go round all the power spots. ", "label": 0}
{"text": "Pathetic rewards.", "label": 0}
{"text": "Do height/weight values get rerolled when trading? Might be worth keeping more in that case.", "label": 0}
{"text": "I hope they fix it where 10 people with evolved pokemon and maxed moves can beat it.", "label": 0}
{"text": "OMG we did it. you get 10 balls . I caught on first try. and even though you get an Pokedex Registration animation - you Can transfer it as a registered Pokemon .", "label": 0}
{"text": "It’s just like raids. You can do 1 for free each day, or 2 if you save yesterday’s.", "label": 0}
{"text": "Hello there, u/Peoaple! Thank you for your contribution to r/TheSilphRoad. Unfortunately, your post has been removed for the following reason(s):\n\nYour question has been removed because it would be a better fit for our Question&Answers megathread in which Travelers can ask questions about the game - no matter how simple the question may be!\n\nAlso, check out our website resources underneath the banner on the top of the page (desktop) or in the \"Menu\" tab on the reddit app. Maybe your question might be answered with one of those links!\n\n[Link to our Question&Answers megathread.](https://www.reddit.com/r/TheSilphRoad/?f=flair_name%3A%22Megathread%20-%20Q%26A%22)  (Link only works on desktop!)\n\nIf you are on mobile and are looking to find the Q&A megathread, please sort the sub by \"Hot\". You will find it stickied to the top of the page almost always! :)\n\n\n\n___\n\n###### For our rules and allowed post types, please see our [comment and submission rules](https://www.reddit.com/r/TheSilphRoad/wiki/rules).", "label": 0}
{"text": "How do the lobby work? All 30 together or small group of 4 trainer?", "label": 0}
{"text": "So much for all the people saying \"Oh well they said it would be 10-40 people so it's not gonna be that hard actually\"", "label": 0}
{"text": "They succeed their 3rd try btw it was a blastoise. Now that everyone have one charrizard should be a little easier.", "label": 0}
{"text": "Where’d you see the streamers, please? Keen to check it out?", "label": 0}
{"text": "Has anyone tried Venusaur? It might be the easiest if you use Charizard due to the double resistance to grass.", "label": 0}
{"text": "Charizard annihilated our group and we barely did any damage. From what we experienced, definitely need a large group.", "label": 0}
{"text": "This is the real question. ", "label": 0}
{"text": "Rewards are buns, but that’s a boatload of XP", "label": 0}
{"text": "Sheeeesh", "label": 0}
{"text": "With each passing day, this feature appears less and less thought out. :(", "label": 0}
{"text": "Taking Charizards into a Blastoise….?", "label": 0}
{"text": "Hello there, u/jcab2001! Thank you for your contribution to r/TheSilphRoad. Unfortunately, your post has been removed for the following reason(s):\n\nThis topic has either been:\n\n- previously reported/posted, or\n- recently discussed\n\nhere on The Silph Road. Try using reddit search to see past discussions on this topic.\n\nThanks for helping us keep The Silph Road uncluttered. Cheers! :)\n\n\n\n___\n\n###### For our rules and allowed post types, please see our [comment and submission rules](https://www.reddit.com/r/TheSilphRoad/wiki/rules).", "label": 0}
{"text": "Update : we managed to beat and catch it . and I completely get you. it's really hard. unless they change something fast", "label": 0}
{"text": "So if you manually catch it won't be crazy size?", "label": 0}
{"text": "Twitch, I'm at work but my community are watching and full lobbies of 40 are just about doing it.\n\nSmall local communities without powered up stuff have got a very tough (impossible?) road ahead!", "label": 0}
{"text": "I’m gonna wait till they fix everything before I do a raid, if they fix anything", "label": 0}
{"text": "Gonna stick to doing 3-4 t1s a day. Tripling my chances of rare and rareXL if seems", "label": 0}
{"text": "So is Venusaur viable against Gigantamax Blastoise or should I just run 3 Rillaboom?", "label": 0}
{"text": "But you can upgrade the rewards for only 200 coins! Niantic obviously knows what they’re doing as a game development company and should never be questioned", "label": 0}
{"text": "I’ve been saying this, you get a gmax zard, but can’t use it for anything so it’s a trophy essentially", "label": 0}
{"text": "Buddy...They now have a Giga Blastoise to use against Giga Charizard.", "label": 0}
{"text": "Can u only use dynamax/gmax Pokemon?", "label": 0}
{"text": "Can you share a link please? Lots of twitch streamers not in NZ", "label": 0}
{"text": "Woooooooooow, Niantic *really* pushing the boat out here with those rewards... /s", "label": 0}
{"text": "Oh gotcha. Lol. My bad for reading while working. 👍🏼", "label": 0}
{"text": "Seen reports that people are trying and failing in groups of 20-40. Not even gonna bother lol", "label": 0}
{"text": "What's the catch?", "label": 0}
{"text": "Any rough guess how powered up the mons were?", "label": 0}
{"text": "Lmao hell nah.  They still haven’t given rural players remote raids for shadow legendaries.", "label": 0}
{"text": "Called it the moment that was announced and I'm not even happy about it", "label": 0}
{"text": "Isn’t this that one meme posted on X making it’s round awhile ago \n\nYou know, looking at the box ", "label": 0}
{"text": "The elite mega Rayquaza was really bad, they started spawning multiple hours late, luckily we got a make up event for that", "label": 0}
{"text": "Yes", "label": 0}
{"text": "can you trade them?", "label": 0}
{"text": "Yup, just watched a streamer with a group of 30 not even get G-Max Blastoise a quarter way down.", "label": 0}
{"text": "Yes only Dynamax & Gigantamax can be used in Max Battles", "label": 0}
{"text": "So still lame? Even more reasons not to do the raids", "label": 0}
{"text": "I just want 1 for the dex entry. Not worth the investment when I've got mega hundos I've heavily invested in already.", "label": 0}
{"text": "Are the pokemon G-Max on the catch screen?\nWhat level was it once you caught it?", "label": 0}
{"text": "Yes, no remote possible with mega raids", "label": 0}
{"text": "How do max spirit and shield work at different levels? I thought I read this info somewhere but I can't find the thread. It will be useful info for gmax battles.", "label": 0}
{"text": "How tough? Does it need up to 40 players?", "label": 0}
{"text": "Managing better with 20-25 people now that we have the appropriate type counter gigantamax. First one is rough but much smoother if you power up a G Max counter.", "label": 0}
{"text": "You cannot use a G or D max charizard with it's unique characteristics outside a max raid battle. So at that point a Mega Charizard is much more valuable. Even more taking into account that you can make ANY charizard a mega Charizard if you have the energy, making valuable the old CD with perfect stats.\n\nInstead with this new gimmick. You are forced to try and get a new good charizard that will be a normal one, with no added benefits, other than being capable of battling max raids.", "label": 0}
{"text": "That's something at least lmao", "label": 0}
{"text": "I got a Rare XL Candy and a GRB from a Gastly I took down in less than 30 seconds by myself...\n\n  \nThis is absolutely disgraceful. The Pokémon by itself is NOT worth the absolute extra effort and cooperation that Niantic expects people to have.", "label": 0}
{"text": "That’s actually stupid lmao. What a pathetic system", "label": 0}
{"text": "I saw this coming a mile away and I’m still disappointed", "label": 0}
{"text": "I don't know, I don't have access to one to attempt so. This information comes from Niantic's Twitter", "label": 0}
{"text": "Didn’t say anyone was, and I didn’t say I am", "label": 0}
{"text": "Well, they fixed megas, so that's a start I guess. Will still not hold my breath for it.", "label": 0}
{"text": "you know that when eternatus comes around it's gonna be the only way to get one", "label": 0}
{"text": "Welp that's what I thought. T1 max raids rewards seemed way too good already for us to get any better.  \n\nI can't expect to find a lot of players around my place anyway, I will stick with t1/t3 np. Finger crossed for remote max raids in the long term", "label": 0}
{"text": "We really need to know how strong their pokemon were and if they were making smart decisions with their dynamax moves but tbh with 40 people you’d think it wouldn’t matter at all", "label": 0}
{"text": "I mean...when a lot of people are using their level 20 base form pokemon, it doesn't matter how many people are playing, they're going to get wiped out in one move.", "label": 0}
{"text": "Damn, this is even worse than when Articuno first came to raids...", "label": 0}
{"text": "Some of the ones near me reset at like 5pm 2 days ago, and it’s been out of sync since then", "label": 0}
{"text": "My community just recently got a Community Ambassador this month, so I had been just using 2 orange passes (Tuesday+Wednesday) for raid hour, and then just banked the 2 green passes (got my shiny Zacian/Zamazenta early on through orange passes). Idea being that I was going to use those green passes on Dialga-O coming up.", "label": 0}
{"text": "Is the max still just 5 normal?", "label": 0}
{"text": "So quick things that I can see so far is that Venusaur is probably easiest if everyone already has 3 Charizards from doing Falinks.\n\nBlastoise is the hardest.\n\nCharizard is probably going to be the most popular though.", "label": 0}
{"text": "thats true, im still not getting my hopes up though", "label": 0}
{"text": "Wow. So another one and done type thing. Lol. Niantic honestly expect people to just grind these battles for charizards alone or what's the plan here? Those rewards are such a joke for all the work required to even participate.", "label": 0}
{"text": "25j xp nice", "label": 0}
{"text": "Max Heal restores 8/12/16% of max HP per use  \nMax Guard grants a shield absorbing 20/40/60 Damage per use", "label": 0}
{"text": "Which is exactly why I don’t participate. If more people rebelled against this awful implementation then they’d be forced to change it and they might actually include the older mons to be able to Max.", "label": 0}
{"text": "\"cheer\" is supposed to help fill up the max meter. So you can help the team a bit even if you can't battle any more.", "label": 0}
{"text": "The \"and more\" should absolutely be illegal", "label": 0}
{"text": "Yes, they need 40 players", "label": 0}
{"text": "If they allowed the older mons to max then even less people would participate as they would already have all the max mons", "label": 0}
{"text": "The clock app on your phone should have a world clock function.", "label": 0}
{"text": "Why would it be squirtle.. that's not how gmax works in S/S", "label": 0}
{"text": "Legend. Is this for everyone in the battle? Does it heal mons which are on the bench?", "label": 0}
{"text": "By the time Eternatus come around, we'll have much better options at least", "label": 0}
{"text": "I think one of the main problems will be people not leveling up their dynamax pokemon.\n\nLook how many people here say they haven't leveled them at all, and this place represents the more hardcore players. Now imagine what 35 random people have.\n\nPeople are probably using completely unleveled starter pokemon that get one shot, and since you only get 3 pokemon max to use in a battle, unlike a raid, most people are useless. In a raid you'd just heal up or send in new ones over and over and beat the timer, but that's not possible with dyna/gigamax.\n\nThis will be a problem until people actually level up their dyna pokemon or niantic changes the mechanics/difficulty in some way.", "label": 0}
{"text": "One hopes", "label": 0}
{"text": "Never played a msg and fully expected niantic to pull something like it", "label": 0}
{"text": "That has Steranka written all over it. \"One rare candy is good, team. We don't want to run out of stock of rare candies\".", "label": 0}
{"text": "Fckn *lame*", "label": 0}
{"text": "Thanks for confirming I can skip this weekend.  I don't have a community of anywhere near enough players for this kind of BS.", "label": 0}
{"text": "You wouldn't need to level up the abilities. You already have the max money so you don't need to do the raid", "label": 0}
{"text": "so you are seriously saying that it doesn't matter going with 20 level 20 squirtles than 20 level 40 blastoises? thats ridiculous", "label": 0}
{"text": "Has anyone attempted as a 4 person, I am curious watching a stream of 40 people fail I noticed the dot didn't seem to reduce much even when there were 15 - 3 pokemon in the lobby when you would expect it to grind to a halt if damage is combined is this being scaled to number of players", "label": 0}
{"text": "We just failed a 25 man venusaur, not even into the red. We had done a gmax charizard beforehand.", "label": 0}
{"text": "6x would have been sweet 🥲", "label": 0}
{"text": "Time and location for tomorrow? Can't see anything on campfire", "label": 0}
{"text": "Interesting to hear, I will keep an eye out to see if that's a rare bug, or if they are actually globally easier than the first few hours", "label": 0}
{"text": "You should be able to beat a charizard with 40 squirtles. it’s absolutely ridiculous that the gigas are so OP.", "label": 0}
{"text": "No idea why the CD moves weren’t available this weekend. Such a stupid move", "label": 0}
{"text": "What level are we talking about on those Charizards?", "label": 0}
{"text": "Do you feel like your Venusaur fail was genuine? Or do you think there are bugs in the system where damage is not consistant in the raid and either made your charizard raid easier, or Venusaur raid harder?", "label": 0}
{"text": "4 tier 1 dynamax is like 20k xp for 1,000 points\nThis is 25k xp for 800 points?\n\n\nSo really not much more, especially when you factor difficulty. \n\nBased on reports of groups failing with 40 people it probably should be like 50k xp.", "label": 0}
{"text": "Weichselplatz (Neukölln) 11am-1pm and Schloss Charlottenburg same time. You should find it cia the button abough your daily incense", "label": 0}
{"text": "Whenenver you think Niantic can’t go any lower…", "label": 0}
{"text": "What an absolute failure of a new game mode if that’s with actual counters like blastoise. How is Niantic expect to encourage people to do these if they all required an insane number of 40? Otherwise this feature is gonna be dead and ignored", "label": 0}
{"text": "Probably check out this thread for now:\n\n[https://www.reddit.com/r/TheSilphRoad/comments/1gc3ay3/feedback\\_post\\_gigantamax\\_pok%C3%A9mon\\_max\\_battles/](https://www.reddit.com/r/TheSilphRoad/comments/1gc3ay3/feedback_post_gigantamax_pok%C3%A9mon_max_battles/)\n\nWill probably get the most details there.\n\nIf you need a lot of people to beat it, it likely won't be a big deal which of those you use.", "label": 0}
{"text": "We just failed it again with 29 players, had maybe 1/6 health left. \n\nIt left like night and day with that charizard that we managed to beat. Like the difference between enraged and subdued.", "label": 0}
{"text": " Update #2  - after an EXHAUSTING fight. one Charizard flew . Im Gutted", "label": 0}
{"text": "Did the existing Dmax spots turn into Gmax at 10 am?   Looking at the oz map at almost 9:30 am and there are no Gmax.", "label": 0}
{"text": "I have my doubts simply because they added this to the Pokémon Home help article, when they didn't even add Zygarde or Adventure Effect Pokémon to the article after their release.\n\nThough that said, I just took a look at the help article and the language they use is confusing. They lump them together with Mega Pokémon, so I wonder if there's a chance they're talking about Giagtamaxed Pokémon in their GMax forms, rather than GMax Factor Pokémon?\n\nhttps://preview.redd.it/rwnrtua4azwd1.png?width=1080&format=pjpg&auto=webp&s=a33c727ac8ca2d2a2a3930a1ad6c231538a7a8bd", "label": 0}
{"text": "how much damage seems to have the g-max moves?", "label": 0}
{"text": "Someone said they caught it pretty easily once they managed to defeat it", "label": 0}
{"text": "I think I read somewhere that the heal only works on the team of four.  That means a lot of coordination to arrange each team optimally.  Possible, but likely to come unstuck in practice.", "label": 0}
{"text": "Why would you at the moment regardless?", "label": 0}
{"text": "Still", "label": 0}
{"text": "Well looks like I'm doomed in a small town where it's hard to get people for a shadow raid...  Really hope Niantic nerfs this mess, or I'm sure a lot will get burned out rather fast.", "label": 0}
{"text": "It's not secret, you can click on it to see what you're buying.\n\nIt's should just be the other rewards that don't fit in the box, so 2 more berries and 10 more balls.", "label": 0}
{"text": "damn that sucks! sorry to hear that", "label": 0}
{"text": "Hahaha 11 of us, all high level, didn’t even get the charizard to yellow and the venusaur was like 2/3 down", "label": 0}
{"text": "Im Legit tired . I had 6 fights already. all with 40 Players - full lobby.  \nI caught 2 charizard, one flew ,  and still can't win 1 blastoise after 4 attempts! its Ludacris", "label": 0}
{"text": "You’re missing the point. You would still need to do the raids to obtain max particles, which you would then need to level the abilities so that you could do higher tier max battles", "label": 0}
{"text": "They definitely do, madness", "label": 0}
{"text": "Mainly gonna do it for the GMAX Pokemon and then never do them again", "label": 0}
{"text": "You don't need to do higher tier max battles in the scenario.  you have everything already.", "label": 0}
{"text": "I've done about 15 solo Falinks raids with 3 lvl 40 Charizards with max lvl 3 attack. Win rate about 70%. Dodging is dodgy. First Charizard never seems to dodge successfully, but the next 2 do.", "label": 0}
{"text": "Does Heal apply to all your 3 mons? Does it also apply to the other 3 players in your group?", "label": 0}
{"text": "I can explain it to you but I can’t understand it for you.", "label": 0}
{"text": "Reading through the comments I see that a group of 27 players couldn't beat it...That's crazy.", "label": 0}
{"text": "Reading through the comments I see that a group of 27 players couldn't beat it...That's crazy.", "label": 0}
{"text": "I don't think you can do either but ok", "label": 0}
{"text": "I presume the difference is that higher level mons can damage the boss enough before dying to get to a win.  But, the higher level can't save an individual mon from OHKO if it can't dodge.\n\nIf so that's total pants.  Dodging attacks is supposed to be a big deal with GMax type battles.  If the \"no dodge\" attacks just wipe the mon anyway so much for all this strategy stuff.  Just mindlessly tap until the meter fills.  Then hit the attack button.", "label": 0}
{"text": "Probably the last few pokemon were the ones people bothers to power up and were doing the bulk of the work. Maybe there's hope for L40 counters in smaller groups but we just need more data", "label": 0}
{"text": "This sounds brutal", "label": 0}
{"text": "I've read through all the comments. Seeing that people failed to beat it using 40 people is insane.", "label": 0}
{"text": "Thats crazy. At Pokemon gos peak we struggled to do Lugia raids here.", "label": 0}
{"text": "That’s what I was thinking", "label": 0}
{"text": "Some of us play go merely to supplement our home dex.", "label": 0}
{"text": "They are G-Max on the catch screen and they seem to be level 20", "label": 0}
{"text": "I’ve heard the opposite that the catch rate is low", "label": 0}
{"text": "Maybe, I see a couple of post saying they did it with 20 and people failing with 40 that doesn't really seem to add up for me. Sure there is going to be allot more feedback on how hard it is by the time it's morning for me", "label": 0}
{"text": "That how you get a 100", "label": 0}
{"text": "Sounds like a bug. Very typical in the beta tester environment", "label": 0}
{"text": "Starting to think I may just have to wait for Max Soup. If even the most popular communities can’t best it, there is no hope for small rural areas", "label": 0}
{"text": "Yeah that’s becoming discouraging information to hear. I was planning to attempt some with my sister when it goes live hoping to find maybe 10-20 players like from the usual raids to be enough. Hearing all of the details completely destroy all interest for us as there’s no way we’ll find a full 40 players to do these max battles even if going over an hour to a big city. I hope Niantic reaps the consequences for this ridiculous requirement especially for all the vagueness they’ve dripped about \nG-max battles, this is beyond unacceptable.", "label": 0}
{"text": "I’ve had this too", "label": 0}
{"text": "If you buddy a xxl pumpkaboo the zorua will also be xxl, but the only way i’ve heard to get this extreme weight is by autocatching", "label": 0}
{"text": "How'd your group go eith Charizard? Able to take it down?", "label": 0}
{"text": "Oh dear god", "label": 0}
{"text": "What do you mean by team of four? Does the group of 40 get split into teams of 4?", "label": 0}
{"text": "that Boo- bundle is NOT worth the equivalent of... 15,500 coins (web store 99.99 coin bundle price,)", "label": 0}
{"text": "If you defeat 10 in a few days and place pokemon, u get 50 back assuming theyve been in battles. Thats not even that bad, ppl just like complaining", "label": 0}
{"text": "I have a living dex from the main series in Home, and also a living dex from GO for the achievement associated with that dex. Part of my living dex includes the available GMax factor mons too and I'd like to reflect that in my Go Dex too.\n\nIt also doesn't bode well in that if it is indeed the case that they can't be transferred, that it means any potential Shiny GMax Melmetal will not be able to move into the main series, which a lot of people had been hoping for.", "label": 0}
{"text": "We got the charizard down, I think it was 35 players, it went down a lot faster that time.", "label": 0}
{"text": "What is the “and more” box?", "label": 0}
{"text": "Does trading Dmax count as special?", "label": 0}
{"text": "lol just like megas \n\nI bet some upper level schlups at Niantic had a lot to say about the final spaghetti code", "label": 0}
{"text": "I believe it only apples to the mons active in the field. So not your benched mons but other trainers. I don't know if it applies to every other player or just some.", "label": 0}
{"text": "We just did a gmax with 22 people. It was super tough. Having someone who has heals on their mons makes a huge difference! (we had lost just before with 26 people - I changed my strategy the second time to focus more on healing AND attacking and I don't think I was the only one) \n((At least 2 of the 22 people only had one low cp non evolved and non maxed mon))", "label": 0}
{"text": "How many Gmax battles are ppl able to do for free?", "label": 0}
{"text": "10 am local time", "label": 0}
{"text": "Good description. Sadly.", "label": 0}
{"text": "I must remind all those people who claimed GMax raids wouldn't be that hard how wrong they were.\n\nTo be fair I was thinking 8-12 players, so my guess was too optimistic as well.", "label": 0}
{"text": "Those of you doing these battles in person, is there really 20-40 people/accounts there in person? There's no matchmaking to fill out teams right?", "label": 0}
{"text": "Good to know, thanks!", "label": 0}
{"text": "The fact that an additional 25k xp is bonus is kinda crazyyy", "label": 0}
{"text": "And most Dmax can be soloed!!!\n\n\n(Falinks may vary)", "label": 0}
{"text": "Niantic are some bloodsuckers.", "label": 0}
{"text": "40 people (120 pokemon) and beat it with 10 pokemon remaining.", "label": 0}
{"text": "(Charizard)... And my husband got a shiny, so yeah, shinies are switched on...", "label": 0}
{"text": "I think at the minute everyone is trying to brute force them down.\n\nMaybe in time and with more data, better tactics will come to light. Things like dedicated healers and so on. There's no timer on the battle, so as longer as Pokémon are kept alive, progress can be made.\n\nThat's when we'll really see how many trainers we need.\n\n(Plus many trainers won't have lvl 50 maxed out dynamax Pokémon with all moves powered up and so on.)", "label": 0}
{"text": "One, maybe two. They’re 800 per raid.", "label": 0}
{"text": "They're encouraging people to join the Community Ambassador organised meetup. You can find it in Campfire. The ones that I see have \\~30 people who have flagged that they'll attend.", "label": 0}
{"text": "If it’s gonna be as long or longer than how they fixed megas this feature be long dead by then I fear ", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "the power of raticate, persian, and vaporeon was not enough to beat the mighty Articuno", "label": 0}
{"text": "awesome i’ll have to get a shiny gengar somehow else i guess lmfao", "label": 0}
{"text": "ooh i see, you mean you want gigantamax forms to be in there?", "label": 0}
{"text": "Ooosh! That's tough. Thanks for the update. Seems the damage scale is out of wack a bit.", "label": 0}
{"text": "You can do 3 if you save 800 from the day before, check into an Ambassador hosted meetup (+800) and claim your daily MPs (+1000).", "label": 0}
{"text": "I don't browse the sub much. Have many complained about the absolute horrendous introduction of the 200 pokecoin purchase they've added to that screen?", "label": 0}
{"text": "Geez, who crapped in your cornflakes this morning? We actually did all of that *because we’re not dumb* but thanks for the hot take based on your personal experience of how many Gmax raids?", "label": 0}
{"text": "Yes.\n\nI'm not in NZ and will never see a lobby of 4 where I am.  But, Niantic said the lobby would be split into teams of 4.  NZ posters have confirmed.\n\nPresumably the split is just done by the code in some arbitrary manner.  Which wrecks any carefully constructed team.", "label": 0}
{"text": "Congratulations! Happy to hear success! Good luck with the others!", "label": 0}
{"text": "I should be happy about it as I was never going to do them, so now I know I'm not missing out on anything of value, but man I really feel for those that actually get their communities together for these rewards.", "label": 0}
{"text": "Great, 25k xp.\nGreat rewards post lvl 50!", "label": 0}
{"text": "I wasnt referencing u specifically, but the vast majority of the people posting. U look at the posts for the next day and by the end of it i’ll guarantee you’ll see what i mean", "label": 0}
{"text": "Was just in a g-max charizard raid with 40 people and we didn't get it to half health.", "label": 0}
{"text": "Even so your input and participation has really  been all helpful and informative for all players keeping tabs. I hope everyone appreciates the effort you and the other players had to put up with for a system that really screams a revamp. Do take it easy and rest well ", "label": 0}
{"text": "Should I evolve a CP 728 14/15/15 Lampent or a CP 1401 15/14/2 Lampent? I'm not super into PvP but I want to have a good pokemon for raids, just not sure if I'll be able to catch a lot more litwicks this season and I don't want to invest a lot of time to farming candies unless it would be way way way better to evolve the lower CP one", "label": 0}
{"text": "yeah but the problem with this is that being less than 24h from the event, i can’t just power up pokémon.  \n\ni have exactly three max pokémon leveled up to level 40, but they don’t have max moves unlocked or powered up and that’s not something i can fix for tomorrow", "label": 0}
{"text": "I don't mind waiting a few months, haha.", "label": 0}
{"text": "does the healing apply to all participants or only your group of 4?", "label": 0}
{"text": "How do you check in to an ambassador meetup?  I see one on the other side of town but what do I do when I get there?", "label": 0}
{"text": "Apparently the spawns that show up after (like dreepy) are contingent on leaving a pokemon at the power spot", "label": 0}
{"text": "Maybe, maybe not.  The \"no dodge\" boss attack is fairly powerful in T3 raids.  If it scales up sharply it might well be enough to take out many mons.\n\nBut, I have no idea what's really happening in NZ.  Maybe players are not prepared enough, though it would be unwise to assume anyone else will be in a better place.", "label": 0}
{"text": "This whole thing just seems like the game is getting to a point where it’s starting leave out rural players/players that don’t have a community to participate in and I hate that for everyone. Hopefully this sets the stage for them to introduce Max Soup into GO at some point cause I want to Dynamax/Gigantamax the Pokémon I already have.", "label": 0}
{"text": "Pretty sure Gmax Duraludon can’t be transferred out of Home and into SV because there’s no Gmax Archaludon. It might be that they’re trying to avoid that problem with some of the potential Gmax mons in the future", "label": 0}
{"text": "some fights you see at the get go that you're screwed - it goes from 100 pokemons to 46 in a minute - so there's no point to keep going.  \nBut if the fight goes well - it takes around 4-5 minutes", "label": 0}
{"text": "I like to keep things Go Stamped if possible, which is why I'm still salty Unbound Hoopa still cannot be transferred, but whilst your solution does make it possible to obtain, it does mean entirely bypassing the new raid mechanic which makes the game less playable lol", "label": 0}
{"text": "Blastoise", "label": 0}
{"text": "And it'll be 6 bucks for a CHANCE to get a mushroom", "label": 0}
{"text": "If you are at the event location during the event time, there will be a button to check in if you RSVP before", "label": 0}
{"text": "I see they haven’t ran out of stock of their anti-player decisions 🥴", "label": 0}
{"text": "Not true. There is certainly casual players in my community. But we have multiple hardcore players with multiple accounts, at least a dozen accounts had levelled, type appropriate counters.\n\nMy experience is from a city of <200k people. We have a diverse range of players and skill levels, that is true.\n\nThese battles are quite aggresively tuned for small communities for the first gigantamax encounter. I posted a further update explaining that the experience is much better for communities of my size once you have one gigantamax and use it where it has a type advantage.\n\nIf you're in a major area of play (US, Japan), your experience will be different.", "label": 0}
{"text": "Rebel? lol! When N change remote pass policy so many of ppl here say quit! And now? All those summer event sold out!", "label": 0}
{"text": "5 with an CA Meetup and 4 without. \nStart with 1200, and then get 1000 on each Saturday and Sunday. This will give you 3200=4*800 MP plus potentially 800 more from Meetup rewards", "label": 0}
{"text": "I guess it depends on the moves the boss has as well.  If they are like DMax where the moves randomly switch around on each battle.", "label": 0}
{"text": "A game that’s about communities get all the people live no where near community’s complaining, they really can’t help some of you choose to live on the plains", "label": 0}
{"text": "For 99$ you can buy a new game and get 100h of play time on it. Or you can get 20 raid passes and open 300 ~~lootboxes~~eggs.", "label": 0}
{"text": "We had locals apply and got denied. Its so stupid because they gate keep that program and then try to push it super hard. Most players don’t have ambassadors locally", "label": 0}
{"text": "Once we had g max Pokemon the subsequent battles we did were MUCH easier. So I'd guess g max moves are considerably more powerful. But it also would've helped that it was an extra, evolved Pokemon on the roster of our casual players.", "label": 0}
{"text": "This is insane, we are taking about the equivalent of  42 uses of the move psychic from Metagross agaisnt Venusaur, even the mega guess down with those numbers and your barely did damage? What they have 100.0 cpm? One million HP?", "label": 0}
{"text": "For 99 dollars I bought the new Cod, so there's that. I ain't spending 100 dollars (in one go) on Pogo", "label": 0}
{"text": "Serious? That's a hundo bug?", "label": 0}
{"text": "No group photo is required. Just go to the meetup location and check in. Preferably talk to some other players irl while you're there.", "label": 0}
{"text": "Yeah I think for a ‘program’ that involves outsourcing Niantic’s labour, the requirements are very strict. I get if the vetting is mainly for safety reasons, but most of the requirements just relate to wanting the ambassadors to be super active in terms of meetups.", "label": 0}
{"text": "Thanks for the input", "label": 0}
{"text": "You can buy MP in the shop with coins from gyms, so it really depends on how many coins you have saved up.", "label": 0}
{"text": "Yeah, I have had it happen with one star max battles but much more rare", "label": 0}
{"text": "The “And More” should be a crime", "label": 0}
{"text": "Thank you for the info. I’m looking to attend one later perhaps.", "label": 0}
{"text": "It is much smoother once you get that first g max. But small communities that include some casual players will have a rough time with the first one.", "label": 0}
{"text": "Thanks for the input. I'll try recalling everything but I don't think that's it for me🤔", "label": 0}
{"text": "I think it is just the group", "label": 0}
{"text": "The only reason I'd bother would be for the Pokedex entry. It was also the only reason I did any mega raids in the original iteration", "label": 0}
{"text": "What's the stardust cost for unregistered gigantamax trade?", "label": 0}
{"text": "The game only consumes 800 MP if you beat the boss, right?", "label": 0}
{"text": "Does anyone know who to attach photos to a request in niantic support ? We are trying to restore a gym that someone delete just for been annoying", "label": 0}
{"text": "I don't even have any meetups for gmax on my campfire.", "label": 0}
{"text": "Does the power spot reset into the same GMax boss after 1 hour timer runs out?", "label": 0}
{"text": "No. What they are talking about is the fact, that if you catch a disguised Zorua the IVs are random and also different between people. Only if you catch the undisguised one is it the same for everyone lvl 31+", "label": 0}
{"text": "Yes MP is only consumed if you actually defeat the D/GMAX pokemon", "label": 0}
{"text": "In my world 20k for 4 battles I can win is a lot more than 25k for a battle I can't.", "label": 0}
{"text": "They've missed the mark on Gmax battles in just about every conceivable way. They've come soon after dynamax, they should have played it out longer and given us more reason to invest in dynamax mons. Not being able to gmax previously caught dynamax mons killed motivation to do those. \nThey are local only and require far too many people, a complete reverse of dynamax battles actually being focussed on smaller groups which was quite refreshing for a lot of players. And now we can add that the rewards are terrible, the catch rate is super low and you barely get any balls.\n\nI can't understand what they are thinking when planning this stuff out. It needs a total rework and it's only just happened.", "label": 0}
{"text": "We know Niantic has always had a choice of what to put as the baseline, but I guess we will have to be on the lookout for future showcases to see what choice Niantic makes for scaling with each individual showcase: \"Relative biggest\" or \"Absolute biggest\"", "label": 0}
{"text": "Yes, we're from the real world where companies gotta make money. It's completely reasonable to complain about bugs and other problems with the game, but complaining that something is too expensive? Give me a break", "label": 0}
{"text": "So the rewards are balls. Sounds right.", "label": 0}
{"text": "Same. I'll either just wait for the revamped system or just trade with someone.", "label": 0}
{"text": "Small communities *will* struggle. No might. They will", "label": 0}
{"text": "Agreed. The scale in rewards does not seem commensurate with the increase in difficulty.", "label": 0}
{"text": "Echoing this. The first g max is most certainly brutal. We found it much easier once we had a g max to use as a counter. But still pushing 20+ people to get it done, and I wouldn't even say it was \"comfortable\" with that many. Definitely some casual players in there running not so great 'mons but we have a good number of quite devout players and hardcore multiaccounters, too.", "label": 0}
{"text": "I was especially worried about this. Only 10 balls is such a kick in the teeth given the hardship it is to beat one.", "label": 0}
{"text": "Well, I haven't tried just yet, too early for me, but watched venusaur on stream. \n\nStreamer with 3 lvl20 charizards. Not all 30+ players were seen, but half of like 7-8 pokemon on screen were stuff like wartortle and dubwool. \n\nStreamers pokemon survived till roughly 25-30%.\n\nAnd those 25-30% the other players who survived managed to beat. \n\nYes, it seems much harder(I doubt 10 people can beat this with perfect counters) than it should, but the person you're replying to is most likely right: a huge chunk of participants seems to not have anything remotely reasonable. Not even lvl20 charizards against venusaur.\n\nThis looks like if half of 30+ players have proper pokemon this is at least doable. Or that 20 players with powered up counters should be able to beat it and survive.", "label": 0}
{"text": "bellenderousscrotalwarts@niantic.com seems like a good starting point 😅", "label": 0}
{"text": "same here", "label": 0}
{"text": "doubles the rewards. nothing new, just what you were shown before", "label": 0}
{"text": "There was also a GMax factor Milcery (base form of Alcremie) event in SwSh. Though this was to give one of the other.... 63 forms of Alcremie to be GMax factor than Strawberry sweet Vanilla", "label": 0}
{"text": "Well prepared large communities will be fine? Are you speaking about pogo or life in general?\n\n*cries in rural*", "label": 0}
{"text": "New entry or registered special trade?  ", "label": 0}
{"text": "Yes", "label": 0}
{"text": "Just the group of 4.", "label": 0}
{"text": "I have posted my experience in my comment history. My overall take is:  \n  \nThe first one is really brutal, especially if you're only bringing 20-25 accounts and a chunk of those are casual players, unlevelled pokemon, bad type counters, etc.\n\nOnce you get the first g max, it is much smoother to go around with \\~20 accounts including some casual players and beat the one where you have a type advantage.\n\nI think 40 casual players/unlevelled/bad counters would lose. I think a community of 20-25 with 10 or so medium/hardcore accounts could get the first one done barely and the rest smoothly. I think 15 or maybe even as low as 10 super super juiced co-ordinated accounts who figure out how best to use support moves could pull it off.\n\nAfter a couple more powerful 'mons come out, this post will look stupid and we'll see 4 mans. But with what we have right now it's tuned pretty roughly for small communities.", "label": 0}
{"text": "Pretty much all of the standard raid battles are a guaranteed win if you have the max amount of players, regardless of if they all have ideal counters or not", "label": 0}
{"text": "Oh sweet, hopefully they are indeed using the absolute system again. I like that one a lot better.", "label": 0}
{"text": "As long as you're in range while the meetup is active, you can join and check in at any time, even if you didn't RSVP previously.", "label": 0}
{"text": "i got 2 rare XL candies today (1 plus 1 for 200 coins) against Gastly 🎉", "label": 0}
{"text": "Well our group certainly couldn’t. Not that we really expected to but demoralising none-the-less", "label": 0}
{"text": "When you enter raids in the main series games without friends you always get npcs to help you win the raid. I think they need to add that element somehow", "label": 0}
{"text": "Sure that may apply to u, but i guarantee 70% of the ppl u are battling with are putting gastlys and starters in. I just find it frustrating to see so many ppl complaining about something they havent even put the effort to try properly, and then blaming it on the system. Dont get me wrong the system sucks, but i can see these battles going so much better if ppl just evolve their charmanders and grookeys", "label": 0}
{"text": "You’re not wrong.", "label": 0}
{"text": "Yeah i don't get how dodging works, it doesn't work 95% of the time lol", "label": 0}
{"text": "F in the chat for my community.  Out of 237 only showing up.  That includes the wife and I.  We are doomed...", "label": 0}
{"text": "Ah right fair, yeah my mate is like that and I keep dragging him to dmax things and carrying then telling him to level his damn mons up.\n\nAnd he's the one who got the hundo Falinks while I got booted out just because haha", "label": 0}
{"text": "If u go into a 5 star raid battle with starters, even if u had 20 ppl, ur not going to win, simply because ur not doing enough damage. It shouldnt be this hard for ppl to understand that 6 star raids will be significantly harder, and so will require more than 30 ppl dealing no damage with their dynamons", "label": 0}
{"text": "Yeah I hear you. I’m the same way. I could transfer another Hoopa in but specifically want to transfer Hoopa Unbound so that remains one of my few gaps. The thing driving me to keep playing now is the shiny Galar birds tho, want to get them with my OT.", "label": 0}
{"text": "The reward system seems quite unbalanced.  \n\nT1 battles (3/4 free per day) gives multiple chances at rare candy, golden berries and the like as well as 15/20k XP.  With typical luck say 3 RC and 3 GRB. That is in the same ball park as a legendary raid.\n\nT6 battles give 4 items, more like a T3 regular raid, I think.\n\nI live in a small town with a handful of players.  Not tough to decide where to spend my battling time.\n\nT1 battles and legendary duo raids it is.", "label": 0}
{"text": "I was talking about the other G-Max factor Pokemon. Should have clarified.", "label": 0}
{"text": "Would like to know this as well", "label": 0}
{"text": "I will, thanks for the feedback", "label": 0}
{"text": "Until you get hit by sludge bomb that is. Metagross is better for venusaur.", "label": 0}
{"text": "What cp pokemon do you get after raid?", "label": 0}
{"text": "For me it's the time investment on traveling to a location where I am not guaranteed to be able to even defeat the raid boss\n\nGiving it a huge miss out of respect for my time, and distaste at the implementation", "label": 0}
{"text": "Pokemon are level 20, same as regular raid", "label": 0}
{"text": "That list is insane when most of the world hasn’t even started these yet. I get they will try and fix them before more timezones start, but if they’re investigating while the event is actually live, it’s basically a make up day guaranteed.\n\nWould it have hurt to require 10 trainers and then bump the difficulty upwards if the first wave were winning too easy? From all reports it looks pretty hard without 40 players. Add in the issues and I’m not sure if it’s worth making time to try and gather people.", "label": 0}
{"text": "The full grown Kanto trio had low catch rate lower than their base forms which was already about 10% default last I recall", "label": 0}
{"text": "Spinda the solution would so simple, either assign it a random PID on transfer in or allow the Go-exclusive patterns to transfer in. Zygarde… well I don’t know why we are holding out on that one. Probably to drive people to grind routes, but I just want to transfer mine to home.", "label": 0}
{"text": "This might come as a shock, but not everyone has 600+ candies laying around per pokemon just to pop them to have a chance at another pokemon that'll also need tons of candy.\n\nEveryone knows evolved pokemon are better big brains, but most people play casual and don't like dynamax to begin with.\n\nI'm just happy I can skip tomorrow,  since I only have a charizard and Metagross,  with max move level 1 stuff .", "label": 0}
{"text": "Pumpkaboo works if you catch it yourself, but the small Pokémon one needs the auto-catcher to work", "label": 0}
{"text": "I'm usually all about new mechanics and content but I was over this pretty quickly", "label": 0}
{"text": "Failing with 20+ people is wild. Wtf are they thinking.", "label": 0}
{"text": "Where’s the rest of it sir?", "label": 0}
{"text": "Was kind of cool at first. I’m just gonna collect the ones i can do on my own.", "label": 0}
{"text": "Best we can do is a pikachu wearing a pikachu hat - niantic (probably(", "label": 0}
{"text": "What exactly do gigantamax pokemon do? Is there any benefit they have outside of dynamax battles?", "label": 0}
{"text": "Same. Resource capping for a niche addition to the game is questionable. I really think Niantic need to go back to the drawing board with how they present the dynamax/gigamax mons as I feel no one will be interested once the initial “excitement” wears off", "label": 0}
{"text": "Which is the only nice part about D/Gmax Raids.", "label": 0}
{"text": "If you have a mid/large sized community (25-30+ players) with a solid number of hardcore players with dedicated counters (10 accounts should have type appropriate counters of level 35-40 'mons with the right moves), then I think you will enjoy this. Overall, I enjoyed it.\n\nIt will be frustrating and disappointing for small groups (5-15) or even groups around 20-25 if they don't have a good number of evolved and levelled 'mons.", "label": 0}
{"text": "Theory: no one is doing these in a few months, causing them to rework the mechanic like they did to Mega evolution. When they do, there will be modest response and two years down the line people will still think that Dmax/Gmax raids are useless, despite the rework.", "label": 0}
{"text": "Love your graphics. Wondering if you'll do one for November?", "label": 0}
{"text": "No it affects only the currently active pokémon, but max guard persists through switching out, as does energy gained.  \nSo if you get a max guard shield on Pokémon A and then switch out to Pokémon B --> Pokémon B has no shield. If you then switch back to Pokémon A it will still have its shield", "label": 0}
{"text": "hows the gigantimax pokemon id assume it functions like a mega being stronger than a normal dynamax version", "label": 0}
{"text": "Watching streams for these atm\n\nWhy are people using bad counters here as often as they are\n\nRillerboom against charizard??? Why???? ", "label": 0}
{"text": "Fled is the word they meant to use", "label": 0}
{"text": "I think the stupidest thing was releasing the first batch of dynamax (the starters) mons as ones that will be immediately \"outclassed\" by their gmax forms, meaning it is almost pointless to invest in them.\n\nIf they had done more things like beldum first, such as a larvitar or different starters I would be more willing to invest at such an early stage", "label": 0}
{"text": "It's Groundhog Day... again.", "label": 0}
{"text": "So say you get a hundo and wanted to transfer it out if you stop playing Go. You just can't, it's like with costume Pokemon?", "label": 0}
{"text": "It’s about…. bringing people together. As long as you’re in a major city, have all day to burn, have maxed out all the super useful dynamax mons like falinks, know what a Niantic ambassador even is and have deep pockets.\n\nYou may even catch a Gmax mon *If you’re lucky.", "label": 0}
{"text": "I dont think you understand, its not about level 50 ing the pokemon, its simply about evolving them and getting them to like level 30. I’ll give u an example, i just watched a streamer with 27 others, and he lasted with a singular level 40 blastoise to the last 20% hp, but because everyone else used gastly and squirtle, they used all their mons up and it was only the streamer and 4 others left who couldnt finish it off alone.", "label": 0}
{"text": "\"Live in society\"...what? You do realize there is a midway between living in a place like NYC & living in the middle of the forest, correct? Lmao. And have you just been completely ignoring the countless of people that have said that even in their large city (one said Seattle, for example) they're unable to gather the numbers? If Niantic wants to make this a \"big cities\" only game, then that's completely fine, that's their prerogative, but to market themselves as a \"game for everyone\" is laughable at best. This coming from a big city player.", "label": 0}
{"text": "Are we even surprised at this point?", "label": 0}
{"text": "Because your run-of-the-mill pogo player isn’t going to understand the RPS mechanics of the game. They’re asking too much of the people who download the game to get out and walk more.", "label": 0}
{"text": "The quotes around excitement are doing a lot of heavy lifting.  I play in a bit city with a devoted group of max level players and no one cares about this new system.", "label": 0}
{"text": "How do the Gmax pokemon appear on the map? Does an existing dynamax power spot convert to gmax or did these gmax power spots just pop up randomly at 10 am?", "label": 0}
{"text": "This makes me really wonder how many ppl it would take with proper level 40 counters with maxed moves.", "label": 0}
{"text": "Do you lose 800 MPs if the attempt failed?", "label": 0}
{"text": "I agree with everything here vehemently!! except - I’m sure we’re able to use the D-max-G-max Pokémon in normal raids and other battles. The issue is just that they can’t be actively G/D-max in them. \n\nIronically this upsets me a bit more becuase the D/G max mons basically then make your already obtained starters obsolete for all forms of content as your “best investment” as they are able to do all of the same things, but do the d/g-max on top of that too. Making the former obsolete at the same level of investment (if one wanted to do such a thing). \n\n\nBut I also am pretty angry at the whole thing.", "label": 0}
{"text": "There is no other benefit right now since you can't DMax them outside of power spot raid.", "label": 0}
{"text": "why are people not investing in counters, watching streams with people using rubbish counters", "label": 0}
{"text": "No, which is how we were able to try 2 battles in succession - and I still have my initial mp balance. So at least there’s that 😁", "label": 0}
{"text": "Yeah it feels like it adds unnecessary clutter to the game too, on the map and in research quests", "label": 0}
{"text": "Wtf, even 20+ ppl can't beat it??? And here i thought 8 people would've beat it😭", "label": 0}
{"text": "Without spoiling anything I'm preeeetttty confident we'll eventually be able to send Zygarde to Home", "label": 0}
{"text": "Just too many barriers to entry for this.\n\nYou need 800 particles on hand to just to participate in this raid. In addition to spending candies and  XL. candies in evolving your existing Dynamax Pokémon, their moves, and their CPs. And hope your fellow raiders did the same\n\nI haven't evolved any of my Dynamax  Pokémons because I want good IVs and an event to give elite moves to. \n\n\nAt least with the implementation of Mega Evolutions, the way Mega energy was given meant - my pre-existing Pokémon that I spent time and resources upgrading weren't rendered obsolete.\n\nWith Dynamax/Gigantamax , it meant more resources funneling to a limited scope of specialised Pokémon that were not being used for general PVE or PVP.", "label": 0}
{"text": "They have a special max move. Now i don't know if this is true as I'm not a Guinea Pig, and I don't know if it's more powerful than the dmax version of the move", "label": 0}
{"text": "Same. As a rural player it’s completely out of the question.", "label": 0}
{"text": "I would think the majority of people (including myself) wouldnt want to risk clicking it to expand to see what \"more\" is in case it just automatically purchases the items", "label": 0}
{"text": "They're spoiled by normal raids, where you can get 20 people with trash counters taking down a legendary mon.", "label": 0}
{"text": "Yeah, I kinda liked the feature at first because I could just solo them.  Got some starters, Beldum, Falinks was challenging, but still doable.  GMax raid that needs 30+ players?  Haha, pass.", "label": 0}
{"text": "Michael’s not like that. Y’all’re toxic and annoying", "label": 0}
{"text": "long documented", "label": 0}
{"text": "I don’t mind the easy solo 30 second 1 star DMAX battles where I get some candy and XP, but I don’t bother with anything beyond that and don’t have plans to hahaha", "label": 0}
{"text": "and my storage", "label": 0}
{"text": "I hope it's only 7 star, megas started at 5 star and then moved to 4 star with legendaries getting 6 star.  I'm confused why gmax is 6 star for regular gmax and then we have them so close the features release", "label": 0}
{"text": "Just like how Origin Dialga and Origin Palkia cannot be transferred to Pokemon HOME.....", "label": 0}
{"text": "Hello there, u/Mhblea! Thank you for your contribution to r/TheSilphRoad. Unfortunately, your post has been removed for the following reason(s):\n\nRant/Vent Threads are highly discouraged on The Silph Road. Take a deep breath, then take a step back. Please make sure your post is constructively worded. Cynicisms don’t help anyone and just encourage a toxic atmosphere that we wish to avoid on The Road and are therefore not welcome. Neither are baseless assumptions and name-calling.\n\nThanks for your understanding!\n\n\n\n___\n\n###### For our rules and allowed post types, please see our [comment and submission rules](https://www.reddit.com/r/TheSilphRoad/wiki/rules).", "label": 0}
{"text": "Sorry, but 4 isn't going to be enough. Getting the first one is rough, you're looking at 30 players of mixed skill or 20 players of medium-hardcore (full teams of correct counters levelled to 35-40).\n\nOnce you have people with g. max 'mons. You can roll around as a team of 20 or so mixed skill level, maybe as low as 15 medium-hardcore.\n\nThis is not small team content, just wanted to warn you.", "label": 0}
{"text": "At least we can transfer Dynamax mons to HOME", "label": 0}
{"text": "This is exactly the thing that angers me the most. Outclass our existing counters to then immediately outclass them again. The resource investment too is INSANEEEELY overtuned.  It’s ridiculous.", "label": 0}
{"text": "After reading all the comments I see that", "label": 0}
{"text": "They're not it's just the official Korean PoGo account posting this", "label": 0}
{"text": "I'm watching FleeceKing. It just seems way too much effort just to win a battle. The amount of time and effort required will only be doable by the most hardcore players.", "label": 0}
{"text": "I play in a semi-rural area and there is literally no excitement about it. We have chats set up for PoGo and no one has mentioned gigamax. A few weeks back with the mawile raid day, I tried to drum up interest but nothing. I ended up duoing it with my partner.", "label": 0}
{"text": "You can't buy MP if you have collected 800?  That is foolish.  It would be like blocking players from buying raid passes if they already used their free pass.\n\n\n\n\nRequiring 20 to 40 trainers with ideal counters, that have been at least partially powered up is stupid.  Even more stupid is that Niantic is using this accurate counter while still displaying a stupidly high number of trainers suggested for regular raids.   They should have made the predicted counter accurate across the board. \n\n\nAnd it is absolutely idiotic to think players will chase shinies or perfect IV.  Raids always turn out a lot of players because they love thrill of the battle and the challenge of catching.  (Am I the only one exhausted of the whales singing non-stop praise of DAI for the challenge of catching the g nirds?)  It's weird that players always seem to remember how much they love that experience when Niantic happens to release a new shiny or meta legendary.  ", "label": 0}
{"text": "Which makes this even more baffling. It would be fine if it just removed the G factor.", "label": 0}
{"text": "Because it feels not worthwhile to dumb a ton of candy and stardust on things that only feed/counter themselves.", "label": 0}
{"text": "Yep, this is not small team content unfortunately.\n\nWe'll all be laughing about this once we have access to better g. max and other dynamax 'mons that are more powerful and better counters. But with what we have now, it's big groups required.", "label": 0}
{"text": "it is bad.\n\nyou want to sit there tapping RECALL to get 50 squirtle candy ? go ahead, i have no idea what to do with 3k squirtle candy as it is", "label": 0}
{"text": "So, how GOOD are Gigantamax Pokemon? Are they direct upgrades? Does Max Wildfire do more than Max Flare (assuming same upgrade level and stat)?", "label": 0}
{"text": "We'll laugh about it in the future once we have better 'mons and other g. maxes and everything is levelled up properly etc. etc.\n\nBut for now, yep, this is big group content only.", "label": 0}
{"text": "https://preview.redd.it/rdfhugsvqzwd1.jpeg?width=1125&format=pjpg&auto=webp&s=6223431de953c089cad06bf6cbd3fae32fffa46d\n\nRiighttt", "label": 0}
{"text": "i'll just wait for Dreepy communications day, thanks though", "label": 0}
{"text": "yeah, lack of resources is a huge issues for most players who played since 2016\n\nnot", "label": 0}
{"text": ">try and gather people\n\n\nOur FB group has almost 500 members and 2 of us have shown interest in this, we're definitely no managing 😅", "label": 0}
{"text": "It's hard enough to get 40 players for a WoW raid all online across the entire world. How does Niantic think you will get 40 people IRL to go to a specific area to complete this? Lmao", "label": 0}
{"text": "It's very early on still, so I can only say that subsequent battles were MUCH easier once people had caught a g max to use as a counter.", "label": 0}
{"text": "i have never seen 40 people in the same area playing pokemon go since 2016. sucks that i’m gonna miss these guys :(", "label": 0}
{"text": "Because as soon as you catch a g. max then your d. max is useless. People also felt like it was going to be easier than Niantic had advised because things had been like that in the past.\n\nIt's also a huge resource investment and most people play the game casually.", "label": 0}
{"text": "Who's buying this valuable data?   After this many years they surely have at least something worth selling. ", "label": 0}
{"text": "I can't believe I actually thought this could be a fun event for me and my kids to do. Sounds horrendous. My son will be sad not to get one, but I can't imagine we'd get one anyway even if we tried (and we live in a large city, but never seen more than a few trainers)", "label": 0}
{"text": "They're too hard, I failed with 20 people, not even 1 quarter way through his health", "label": 0}
{"text": "It's okay you're not alone.", "label": 0}
{"text": "Was the group of 4 predetermined (like can you set it yourself) or was it randomized once it started?", "label": 0}
{"text": "If decently sized group means 30 people, then I would recommend at least 10 people have level 35-40 counters with correct moves etc. etc. Absolutely cannot get away with multiple dead weight 'mons in every team. Multiple dynamax cycles every fight for sure. \n\nI do recommend having the \"worst\" Pokemon lead and swapping to the best one at the first dynamax. But this is not cake walk content.", "label": 0}
{"text": "I meant use the Kanto GMax against each other once you catch them", "label": 0}
{"text": "It seemed to be in the order of arrival but don't quote me on that... Also didn't see any functionality to change subgroups.", "label": 0}
{"text": "First off, there's no name calling, cynicisms, or baseless assumptions in my post, only criticisms. Secondly, my post is constructively worded. It explicitly explains what Niantic is doing incorrectly in implementing D-max/G-max raids. What they would want to do from there is up to them, it is their company after all. \n\nIf you don't like the tone of my post, you could have taken that up with me privately and I would have made edits. To remove the post entirely goes overboard with a topic you'll undoubtedly become inundated with in the coming hours/days.", "label": 0}
{"text": "There is nowhere in my city where we get 20 in a lobby, unless it is when the raid starts.. Trying to get more will be impossible and the raids will be spread over the day, so many will turn up at different times. I suppose I just saved a 40 minute train journey and 1000 yen.", "label": 0}
{"text": "Yeah, also I've been waiting to get their community day moves too. Not sure if that's wise, but I don't want to waste etm on them. ", "label": 0}
{"text": "https://preview.redd.it/yh3ha7m5uzwd1.png?width=1440&format=pjpg&auto=webp&s=f0cd06808a7b335e120713ce18485683b5f202a8\n\nIs this maybe it?", "label": 0}
{"text": "Have you seen how much people spend in a pub for work drinks?", "label": 0}
{"text": "I don't doubt that juiced teams of dedicated players can do it. But large communities of less devout players (which to be clear, is MOST players, just not most players on this subreddit) will have a hard time or be disappointed.", "label": 0}
{"text": "https://preview.redd.it/l2cui7smuzwd1.jpeg?width=1206&format=pjpg&auto=webp&s=ac6112370c00739f1f1fd4ad465bbe09dd364b97", "label": 0}
{"text": "3 years from now", "label": 0}
{"text": "I literally created a support ticket when I made my post earlier to ensure that I was giving you the correct information, as they've moved stuff around slightly and I wanted to make sure to direct you to the correct location.", "label": 0}
{"text": "Damn how did you end up beating it?", "label": 0}
{"text": "I think the point he is trying to make would be to change Max into something similar to Mega energy. Defeating a G o D Max mon gives you the energy to use on another. \n\nOnce you have the energy you can start using it on your preferred mon, with the caveat that you can't walk with that mon to obtain more energy.", "label": 0}
{"text": "https://preview.redd.it/6e5ixcrnvzwd1.jpeg?width=792&format=pjpg&auto=webp&s=2e267f372b0010c3d05956d3bfeb0822b54ae71d", "label": 0}
{"text": "No worries. I have explained so in other comments but should clarify my experience is from a city of <200k people where we have a community with a devout core and a number of more casual/less aware players. \n\nIf you're rocking 20 players @ level 50 with max teams, you're probably going to be fine. But if you're like me in a smaller place, then getting 20-30 people together means some people aren't running the latest and greatest.", "label": 0}
{"text": "You might as well wait until the end of the Halloween event to see what your best is... unless you desperately need an attacker to beat Giratina right now.\n\nAttack is the most important IV for raids and if candy/dust are an issue, level trumps IVs as wel. So 15/14/2 would be fine. If candy and dust are an issue you can hope to catch a wild level 35 instead and evolve that.\n\nIf you aren't going to use it for raids now you may as well wait before evolving and levelling at all.", "label": 0}
{"text": "Thanks for the insight. Thinking I'll have two lv40 counters per battle party, and take one lv40 non-counter from another battle party for tanking. Hoping the other RSVPs at the meetup I'm going to will also play their part.", "label": 0}
{"text": "Serious question: what happened with megas? ", "label": 0}
{"text": "I had planned on spending coins on MPs, but it sure looks like I won’t be!!", "label": 0}
{"text": "Wow those are really great —\n\nFor selling boxes and items in the in-game shop\n\nAin’t nobody gonna get resource rich with rewards like those", "label": 0}
{"text": "Yes, that was a big topic on most subs in September when max raids were first introduced. I think people are more desensitized now to it", "label": 0}
{"text": "You were high level. What level are your counters and their max moves?", "label": 0}
{"text": "Lmao why do you assume people are talking about farms in the middle of nowhere? I live in a densely populated suburb of one of the biggest cities in the country and there definitely won’t be enough players gathering for this.", "label": 0}
{"text": "sorry, but this is completely 🤣😂😅. On what base do they think people will even try this? Only masochists enjoy this…", "label": 0}
{"text": "I don’t think you understand what a pyramid scheme is.", "label": 0}
{"text": "When posting bugs on the road, please take into account our rules for bug reporting, [found here](https://www.reddit.com/r/TheSilphRoad/wiki/rules#wiki_3.7_bug_reports).\n\nPlease also make sure, that your bug isn't already listed on [Niantic's Known Issues](https://niantic.helpshift.com/hc/en/6-pokemon-go/section/180-release-notes-known-issues/) or [GO Battle League Known Issues](https://niantic.helpshift.com/hc/en/6-pokemon-go/faq/2699-go-battle-league-known-issues-1598471929/) page.  \nThank you! :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Just PoGo but it’s the only thing I use twitch drops for. Well even twitch in general lol", "label": 0}
{"text": "dang I honestly thought the tier 1 rewards were pretty decent but I guess they don't scale up at all", "label": 0}
{"text": "Ooh! I'll hop on this. Initially the amount of mega candy was relative to the time spent raiding and was commonly in the 30-50 range per raid. You had to do around 4 mega raids (which were super tough!) for a mega Charizard to be able to mega. It was rough", "label": 0}
{"text": "You can buy MP if you’re already at your\nlimit. It just sits in your items until you use it.", "label": 0}
{"text": "How did you make it out of Oz, Scarecrow?", "label": 0}
{"text": "Had two Venusaur’s run, back to back.. After the struggle of taking them down and paying particles to get one of each g max, I won’t be doing any more.", "label": 0}
{"text": "Well there was no \"something else\" option so either you've misremembered or not been very ear as I've just attempted to follow your guidance on two separate accounts and found it on neither.", "label": 0}
{"text": "Brutal rip dude", "label": 0}
{"text": "Damn just some real bad RNG for some folks I guess.... good to know it's not like dark red circle even with golden razz", "label": 0}
{"text": "What do you expect if no one Levels them up.  Attacking a T6 with level 20 mons even 40+ doesn't seem feasible.", "label": 0}
{"text": "I know it doesn't mean much but in the MSG Gigantamax was always unique, not necessarily better. The real difference other than appearance was the effect of the Max moves, and Max moves don't really have a secondary effect here", "label": 0}
{"text": "You misunderstand, if a pokemon is only available via gmax raids and gmax pokemon are non-transferrable then how are you supposed to register them in the pogo dex in Home? \n\nExample: If Duraludon, who does not have a pre-evolution that could be released in eggs, is *ONLY* ever available in pogo via gmax raids, it will never be transferrable as long as gmax pokemon are blocked from being transferred to home.", "label": 0}
{"text": "Yea\n\nhttps://preview.redd.it/ivvegd5ixzwd1.jpeg?width=1170&format=pjpg&auto=webp&s=94d6179d96ea1ce4680a16156e8cdc710fda15bc", "label": 0}
{"text": "So basically nothing?", "label": 0}
{"text": "Technically, you can have the G-max replace one and still have 2 dynamax to use in a party. \n\nBesides, you can also keep something like Dynamax Charizard for other fighting types that come out (for the flying type Max move) until a dedicated flying type pokemon is released.", "label": 0}
{"text": "The only thing different about G Max is the appearance and max move, there are still roles for strong dmax Pokemon", "label": 0}
{"text": "It sounds like once everybody has a gmax mon it might be close to what you want", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Fully ignoring this crap. Giga, dyna, whatever. I’ll collect mp for research tasks or whatever, but this part of the game is not doing it for me. If it becomes too necessary to play then I’ll probably play less and eventually quit. Nothing they do feels fun anymore—but maybe that’s a me problem.", "label": 0}
{"text": "Thanks for clarifying. It looked like some unknown mystery box.", "label": 0}
{"text": "Pumpkin packs for me", "label": 0}
{"text": "You used to have to use mega energy every single time you wanted to mega evolve. If seemed like a totally useless feature. \n\nChanging it so you only had to use mega energy once and then have a cooldown was a massive improvement.", "label": 0}
{"text": "Shake your fist at the sky while you’re at it", "label": 0}
{"text": "Keyword being COULD. No guarantee.", "label": 0}
{"text": "After years of never missing an event... always being a familiar face in the crowd... I won't be attempting to engage in GMax battles this weekend.\n\nThe feedback so far indicates that the event simply isn't worth it - and would likely lead to disappointment and frustration.", "label": 0}
{"text": "Making a raid that can’t be taken down by 30 odd people isn’t the answer", "label": 0}
{"text": "Getting 40 people together that have all spent time to upgrade their Dynamax Pokemon is just not gonna happen, it isn't realistic", "label": 0}
{"text": "How detached from reality are you? My lord....", "label": 0}
{"text": "Should get your max particles back for that", "label": 0}
{"text": "Hell yea nice, me too hehe, and it's shiny 😁", "label": 0}
{"text": "God, that sounds atrocious. What were they thinking?", "label": 0}
{"text": "Thanks for the explanation!", "label": 0}
{"text": "Why are Male and Female Frillish separated? Only females are spawning Halloween, and Aquatic Paradise. Male was in research or incense. Male frillish only spawned around spring, and 1 star raids.", "label": 0}
{"text": "A normal T6 raid with a mere 20 people would be a braindead cakewalk with only level 20 mons.  These Gigantamax battles sound like an order of magnitude more difficult.", "label": 0}
{"text": "Yeah, that was maddening, even if the energy cost was reduced on mons that already mega evolved once, having to gather more energy to get them again on that state was a bad design.\n\nI like it much better with the time gate and Mega level rewards.", "label": 0}
{"text": "Maybe 30-40? Some not that high. I’ve trained up a couple but I don’t have XL candy for several and I’m not wasting the rare ones on something like a Rillaboom. I’ve put in effort but not huge effort. If Dmax raids require more than that then guess I’m out, along with mostly everyone I know - which leaves the players who have done the really hard work a bit short of numbers.", "label": 0}
{"text": "And is the max move not stronger?", "label": 0}
{"text": "Uh.. to be honest I’m not sure either. We had 28 people for starters, and I kept dodging with a metagross with max mind storm and healed people. Thankfully charizard didn’t one hit KO the metagross", "label": 0}
{"text": "https://preview.redd.it/zjwt205dzzwd1.jpeg?width=782&format=pjpg&auto=webp&s=980757949e6cda54f0fb03fc2cfee61149446934", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Hey, I'm also in Auckland and will heading down to the city to do the raids tommorow, are there many people doing it or nah?", "label": 0}
{"text": "Not Nintendo but definitely the point haha", "label": 0}
{"text": "wonderful!", "label": 0}
{"text": "With the current reception this feature is getting, im sure they are going to rework the feature and re-release these Gmax's in the future\n\nTeaching your kids that patience is sometimes a great stratergy in this game is probably a valuable lesson for them", "label": 0}
{"text": "This is horrible tbh.", "label": 0}
{"text": "Just caught a hundo gastly from a max raid. Sure would be nice to be able to make it gmax as well", "label": 0}
{"text": "Iirc the stats were being talked about here earlier this week, I can't seem to find the post at the moment.", "label": 0}
{"text": "Does new power spot appear, or does dynamic power spots get replaced with gigantamax?", "label": 0}
{"text": "Starting to? lol\n\nRural players have been left out from the beginning.  Only when Covid hit and made everyone into practically a rural player did Niantic do anything to slightly help.", "label": 0}
{"text": "For people spending money, or with enough time - you can eventually do enough raids to replace your entire Dmax lineup", "label": 0}
{"text": "This kinda looks like the reward from those low level team rocket raids I find around here... Except the xp maybe...", "label": 0}
{"text": "Curious what state you’re in? Wyoming? Rural Texas/Oklahoma?", "label": 0}
{"text": "the base case rate of 3rd evolution starters is 5%. for reference, that’s the same as salamence, tyranitar, snorlax, audino. legendaries are 2%", "label": 0}
{"text": "https://preview.redd.it/gz159k7s00xd1.jpeg?width=1080&format=pjpg&auto=webp&s=7032b87587d1c1fba34923af070667d40adde215\n\nHere's the main portion of the transcript. The bit cut off at the top is the very first message from Remy. You can see exactly what I pressed to get to the \"something else\" option (including that I selected something else).", "label": 0}
{"text": "Ahhh really wish they'd implement something to allow kids to check in at least on campfire. I thought maybe club campfire was a kids version", "label": 0}
{"text": ">  Is there any benefit they have outside of dynamax battles?\n\nNo", "label": 0}
{"text": "Exactly. \n\nThis is basically an ode saying that if you want to play with gigantamax, you should’ve been taking Dynamax seriously.\n\nIs that fair? That’s the better question. But it’s still a fact that it is beatable, just significantly harder than expected.", "label": 0}
{"text": "How on earth?! Sorry didn't realise you could share a screenshot, I'll check if the last one has timed out and show you what I got", "label": 0}
{"text": "In principle I would not hate the idea of lucky trades being with 12/12/12 or the current Pokémon iv's or better.\nBut because it would make anything over 90% almost guaranteed hundo, it will not be happening because it would make getting shundos way too easy.\nEspecially for people with alternative accounts.", "label": 0}
{"text": "They've got quite a striking gender difference, and likely because of that, Niantic decided that when they were first introduced, the male was going to be exclusive to GBL encounters, presumably to incentivise people to play GBL to get it. Since then both have been in the wild and featured for different events. I believe the male may even have separate shiny odds from the female.", "label": 0}
{"text": "Hey... firend... listen... I have to tell you somthing... it's goign to hurt, but if you can take it to heart it will help you be a whole person.\n\nNiantic will never love you back.", "label": 0}
{"text": "The only guaranteed catch.", "label": 0}
{"text": "Not necessarily?", "label": 0}
{"text": "I’d like to know this also", "label": 0}
{"text": "I think the leveling them up to 40 is the more important part. I watched a stream with a few battles on earlier.\n\nThe very first non-dodgable attack that hits everyone would kill 10+ pokemon because there's that many people using unleveled dudes, then next non-dodger would knock out the same again for their second pokemon etc.\n\nJust a 1300-1600 CP blastoise/charizard etc would take 3 of the non-dodge hits to kill, so they actually get damage in and dynamax etc.\n\nObviously the +40% damage on the max move is nice from leveling that up, but having the HP to actually survive the unavoidable damage seems like the most important part so that you can actually do damage yourself.", "label": 0}
{"text": "¯\\_(ツ)_/¯", "label": 0}
{"text": "Aura wheel is an electric-type move. Why wouldn’t it do neutral damage to\nfighters?", "label": 0}
{"text": "Not to mention no-one here has that many Pokémon fully maxed out.  So stupidly expensive to set up that many Pokémon.", "label": 0}
{"text": "I thought it change types when Morpeko changed forms? Electric in Fully Belly and Dark when Hangry.", "label": 0}
{"text": "I'm talking about how it's a waste of time and effort. 5 candy!? seriously?!", "label": 0}
{"text": "And this thread has convinced me to give this event a pass.\n\n\nI had considered trying drum up interest in my neighborhood group. But even if everyone showed up, odds are we'd fail. I'm pretty sure most players in our group have already decided max battles are too complicated and pointless. So it's unlikely people would have the kind of teams needed. And really, I can't blame them.", "label": 0}
{"text": "The 800 mp for ambassador's meet ups counts towards the daily limit of free mp?", "label": 0}
{"text": "I think there are quite a few bugs with aura wheel/morpeko atm. Morpeko used aura wheel in hungry mode on my golurk and did not very effective damage", "label": 0}
{"text": "There’s one in my original post", "label": 0}
{"text": "Space permitting, save Pokémon to evolve after using a lucky egg - I've not bothered for a good while but you can easily evolve 70-80+ in the remaining time, bonus if you've got an auto catcher to keep catching and spinning in the background", "label": 0}
{"text": "All these people? Do any of them have powered up Dynamax mons or are they trying to battle a Blastoise with as-is caught bulbasaurs and grookey??? Are they at least evolved?", "label": 0}
{"text": "is there a G-Max dex???", "label": 0}
{"text": "I agree, especially for players that recently started or got back into the game that might not be as flush with candies. For me, the extra charmander candies is pretty nice.", "label": 0}
{"text": "5 candy x4 a day. And you're calling doing t1 raids time and effort? It takes 60 seconds with zero effort. 20 candy a day for Charizard isn't bad. Especially so once we get things like Eternatus. Imagine if you could get 20 candies a day everyday for other legendaries just by playing the game as normal.", "label": 0}
{"text": "Honestly this is so stupid that this is not something that they do automatically.\n\nI'm not saying that if support ticket come from xxxx@gmail and same email was assigned to the account previously, before it was claimed as stolen.\n\nSince there is still the possibility that both Pokémon go and Gmail accounts were compromised at the same time.\nHowever if a user can provide proof like information about the account and it's Pokémon, has contacted from the same email assigned to the account previously and can provide bank statements going through Google play/Apple app store or through Niantic's own webstore.\nAnd all the info matches, then it's not likely that all these levels are compromised and thus the actual account holder is on the line.", "label": 0}
{"text": "Agreed. I have to drive to the opposite side of Seattle (lots of traffic, no direct buses or trains, not bikeable) to try and do a measly two of these raids because that seems to be the only place with 40 plus people gathering. Pretty wild niantic thought this was a good idea.", "label": 0}
{"text": "4-6 trainers with level 40 mon are clearing these. Level 15 gastlys are not.", "label": 0}
{"text": "Even Falinks I was able to successfully solo through trial and error. From what I can gather, it seems like beating and catching a Gmax in an adequate group is about 10x harder than soloing a Falinks.", "label": 0}
{"text": "I am watching streams, and I have 1 thing to say\n\ngastly is the new aggron", "label": 0}
{"text": "If a feasible number of people with decent mons could do this, it might be fun, but I'm seeing people lose with 32. If you have 32 people it shouldn't matter if half of them didn't upgrade their Pokémon.\n\nI spent the last week building level 40+ max move counters, and I probably won't even go out this weekend unless they revise it before morning.", "label": 0}
{"text": "Can you explain this plz", "label": 0}
{"text": "One poster in the Pokemon Go subreddit said that their 40 person team wiped twice against Blastoise and they barely took half of its HP.\n\nI live in the suburbs of St. Louis City and I can't even find four others for Mega Rayquaza let alone 40 for this. SMH", "label": 0}
{"text": "Yessir", "label": 0}
{"text": "but why would that ever happen... half of them are kanto and dynamax can still be transferred. galar starters and toxel and hattena are also already confirmed not to fit this scenario.", "label": 0}
{"text": "That's super sick but are you telling me that after getting 30+ people to battle this thing you get a 1600s CP Zard?", "label": 0}
{"text": "Same I can't get a free raid pass from gyms. I've been spinning for 2 days and my last raid was october 24. :'(", "label": 0}
{"text": "I will see how it goes for me tomorrow \n\nI have a few stacked zard and metagross for venusaur and a very painful to power up inteleon and that for charizard \n\nI’m used to just outright being able to solo a lot of 5 star raids so this will be fun to see", "label": 0}
{"text": "Horrible rewards honestly.", "label": 0}
{"text": "No chance to heal/rejoin though, and while everyone contributes to damage, for guard and heal you're isolated to your group of 4. So if you get paired with 3 folks who haven't invested, you'll have no support.", "label": 0}
{"text": "If they back out, it’s free.", "label": 0}
{"text": "Man, I can't be the only person disappointed that they couldn't (or more likely were too lazy) balance this around only having a team of 4. \n\nLike, make it difficult, but it should have been doable at all levels with only 4 people, who plan accordingly and invest the time and resources into having a good team for that battle.\n\nCould have been a way to reward strategy and planning, but nah let's just have 40 people throw their unevolved gastlys and ivysaurs at it until they qin.", "label": 0}
{"text": "That's not whats being said anwere else...\n\nWhat you're source on this INCREDIBLE 4-6 number??", "label": 0}
{"text": "With all the drama in the last few hours I forgot about the showcase.", "label": 0}
{"text": "If all 3 pokemon die can I rejoin?", "label": 0}
{"text": "Lugia after Darkrai? Time for me to hunt for the XXL Lugia now...", "label": 0}
{"text": "I think my team was Gyarados, Aerodactyl, Raichu, Charizard, and Dragonair.", "label": 0}
{"text": "That’s crap.", "label": 0}
{"text": "Yeah I always find it funny when Niantic do money milking on whales and totally ignore people who would like to invest in a game that returns said investment but whatever, they get their money and we all get a sloppy game that doesn’t feel the quality compared to the money it makes.", "label": 0}
{"text": "Didn’t see the actual Pokemon pages but they seemed to be around 3,000 CP on the lobby screenshots", "label": 0}
{"text": "How many people were in your raid group?", "label": 0}
{"text": "How is it complicated? The power curve is obviously way off for giga, and will most likely (hopefully) be tweaked, but dyna is nothing but a shadow raid variant with a useful resource sink for late game. Particle packs and raid passes are similarly priced, and you get them free every day by interacting with gyms/spots", "label": 0}
{"text": "It almost looks fake lol", "label": 0}
{"text": "No, you can only cheer for the remaining players", "label": 0}
{"text": "Yeah doesn’t sound like a bad idea in addition to the gmax battles especially because I’m going out with a group of 200 tomorrow for two hours I plan to do at least 8 or 9 so I’m gonna use dialgas roar of time ability to keep the egg going", "label": 0}
{"text": "I am glad that so many people are speaking out on how hard this is. I really hope Niantic does something more than just a make up event. LIke we should get a GigaMax for each battle we failed.", "label": 0}
{"text": "At least you don't lose your particles when you lose a battle, so you shouldn't leave a lobby unless you know it's a waste of time.", "label": 0}
{"text": "Quick update, I’m referring to g-max moves used by the player, not when used by the AI", "label": 0}
{"text": "Funnily enough, that seems to be exactly what’s happening. Groups of 40 with fresh gastlys are wiping and complaining it is too hard; groups of 6-8 are clearing with l40 counters.", "label": 0}
{"text": "I just set my phone text replacement so dmax becomes Dynamax", "label": 0}
{"text": "> hardcore … time and resources\n\nI have a full time job and have been tutoring my kid who is struggling in school at the moment.\n\nI PoGo between bus stops and have full counters ready to go.\n\nMaybe we have different ideas of hardcore …", "label": 0}
{"text": "I just visited the city (Sydney) and failed to beat several charizards with 40 trainers. I think the problem is that people are joining with very weak teams and are not contributing enough damage. There is a live count of remaining Pokémon while battling and it immediately dropped from 120 to 90, then very quickly to 60. This will be a problem until a bigger portion of players have stronger teams", "label": 0}
{"text": "Cause shiny. Most likely, why its caught on first ball", "label": 0}
{"text": "If anyone is making infographics for these for casuals to pass around, I hope they heavily stress the need to use final evolutions of the right Kanto/Galar starters. CD move not needed.", "label": 0}
{"text": "\"casual\" started meaning no effort back when MMOs were popular", "label": 0}
{"text": "Thought that was just a legendary thing, no?", "label": 0}
{"text": "No! I still need Raiku anytime I can get people together to raid it, it runs on me 😭. I need one more month to try. It’s all i need for my Johto dex.", "label": 0}
{"text": "Just curious, how many players did it take for this one?", "label": 0}
{"text": "i'd love to know how many of those people evolved + powered up their mons or if they just threw random crap like level 20 falinks and level 20 gastly in", "label": 0}
{"text": "Only for shinies lol, its still hard for normal", "label": 0}
{"text": "Any information about how much each max spirit healed for?", "label": 0}
{"text": "wE ToOk 30 pEoPlE aNd DiDn'T eVeN LeAvE a DeNt! argh! well, i'm off to go revive my level 20 bulbasaur and level 20 falinks...", "label": 0}
{"text": "I would definitely be open to powering up a few Dmax past where I have them now because I can see the utility in it now but I’m currently not going to because currently I don’t have enough people I can battle with locally. Definitely think if some in our group powered up more and trained the moves higher we could have taken down the Venusaur but no way was the Charizard an option at all. I wish they’d started off like they did the Dmax raids, basically gave you a couple and eased us in with 1* battles. Make a Gmax Venusaur easy so most groups can get one and people can work their way up from there.", "label": 0}
{"text": "They should have done research to introduce them, and award one like dynamax started by rewarding a wooloo and a skwovet encounter.", "label": 0}
{"text": "While asking questions about the game is always okay on the Road, please consider asking very simple questions in our weekly [Questions&Answers Megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky).\n\nIf your question has been answered, please comment \"ANSWERED\" (in all caps) and the post flair will indicate that your question has been answered. This will make it either easier for other people with the same question to find the answer they are looking for or for mods to remove the thread if it isn't needed anymore.  \nThank you! :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "Yea I'm guessing that's part of the problem, but i would assume they are more challenging than any other raid we have ever had since it's considered a 6*.", "label": 0}
{"text": "You definitely won’t be alone with that", "label": 0}
{"text": "Does it even matter? Do you really think you can control what 39 other players are bringing into the battle? I know I can't. ", "label": 0}
{"text": "Honestly just making all these raids (other than 1*) comfortably solo/duo-able like Mega Raids, it would fix most of the problems. \n\nI still think there probably needs to be more parts of the game that tie-in to D-Max/G-Max, but honestly the biggest issue is that it’s unrealistically hard even to do Falinks (I’m pretty dedicated and one of those was more than enough pain for me…), not to mention these G-Max raids.", "label": 0}
{"text": "I'm curious to how many trainers are needed if every trainer has lv30-40 evolved Pokemon. There are loads of reports of 25 trainers failing it but you wonder how many are entering Lv20 Charmanders x3.", "label": 0}
{"text": "ooooooooooooooooof", "label": 0}
{"text": "That's enrage", "label": 0}
{"text": "100% agree i havent even caught a dynamax falinks because i cant easily solo it (granted ive attempted 3 times and havent beat one) and ive been playing fairly consistently since 3 days after launch level 47", "label": 0}
{"text": "Around 250 times. One of our raider member has build a calculator on this matchup and they found there is 4% chance you would roll a RNG seed where you have a chance to win assuming rejoins take 6 sec.", "label": 0}
{"text": "I heard it didn't count towards your daily limit. But that's just what I heard.", "label": 0}
{"text": "I just did that and did not work\nHelp HRL LP   H-E-L-P", "label": 0}
{"text": "literally", "label": 0}
{"text": "No. It used to be that way but they changed it ages ago.\n\nCurrently, if you get a shiny and the encounter uses Premier Balls, it's a guaranteed catch if you hit it successfully. And obviously the same applies to raids where Beast Balls are in use instead of Premier Balls.", "label": 0}
{"text": "Oh fxxk", "label": 0}
{"text": "It's a deck building game. You start with a weak deck and you use that to get better pieces until you can finally build up to the end game.", "label": 0}
{"text": "Awesome!  Good to know.  Must have missed that announcement a while back.  I’ve never gotten lucky enough with these things to test it myself lol", "label": 0}
{"text": "Dumb question, but I'm a bit confused: I keep seeing stuff about groups of 30-40 failing but also apparently you can only go in with 4 total? What am I missing?\n\nDisclaimer: I have not done a single max battle against anything, I've been too underwhelmed and annoyed by the implementation. So if this is related to some basic way that max battles work, I wouldn't know.", "label": 0}
{"text": "Everything I've seen says Inteleon is better than Blastoise, which is fun because most people don't have enough candy to fully evolve, level up, and power up the moves.\n\nAt least I have a giant pile of candy for the Kanto mons like Gengar, which can hit any of them if it doesn't die first (it will).\n\nNot that it matters, because I don't have 5+ friends that play enough to max out 3 counters (or more, for the other targets).", "label": 0}
{"text": "At least with raids you can (for the most part) do remote invites", "label": 0}
{"text": "So many reasons:  \n\\- Some people didn't know how difficult the battles would be, and assumed that with 40 players it should be easy regardless.  \n\\- Some people don't want to use up resources for mons that a better version (G-max, or community day) will be available.  \n\\- If I am going to invest resources into powering up a mon, how much will that affect a battle with 39 other players?", "label": 0}
{"text": "Persian only knows scratch or feint attack, while a L40 probably cant wipe the whole team it comes damn close. You are running force palm and powerup punch as you should, i assume?", "label": 0}
{"text": "aside from appearance, is there gameplay advantage for Gigantamax?  \nmy apologies if this was answered before.  \nmy search yielded nothing", "label": 0}
{"text": "Anyone else having buyers remorse for buying the tickets for the November event?\n\n\nI know there will be more that just the max battles going on, but they are big part of that event. And I'm now expecting a total flop.", "label": 0}
{"text": "Some people are using gastly and non-evolved Dynamax Pokemon, so they are doing 0 dmg. And depending on the move set, G-max Pokemon hurt. Ice beam on Venusaur is rough and it always hits + often", "label": 0}
{"text": "Thank you! Wow I didn't even know it is possible to solo Moonblast Zamazenta, that's insane!", "label": 0}
{"text": "I wanna know what team of 10 Niantic was running in testing. Assuming there was testing.", "label": 0}
{"text": "> if anyone does I’ll eat my words.\n\nHe did : https://www.reddit.com/r/TheSilphRoad/s/hfPCAY9wMz", "label": 0}
{"text": "Lmao stay off the internet pls", "label": 0}
{"text": "Hard. And then I couldn't even get the catch with great to excellent golden razz balls", "label": 0}
{"text": "That’s awesome. Glad they’re making people work for it.", "label": 0}
{"text": "Probably not. But if they are in person you can at least give suggestions to make it smoother", "label": 0}
{"text": "It applies to all raid shinies thankfully so remember to use a Pinap Berry if you find one!", "label": 0}
{"text": "I believe one of the releases suggests they get an “alpha strike” - one time first hit - that’s much bigger, and then otherwise are functionally dmax mon.\n\nI *think* it’s 30% bigger, but with all the teaser material out there with the event, I would rather just be mocked for being wrong than dig through it all.", "label": 0}
{"text": "It looks like a normal blastoise by default??? So just like the other dynamax ones you can't have it look all cool while in a gym or as your buddy? Just while doing dynamax raids I don't care about? That's so lame.", "label": 0}
{"text": "Tell us you know nothing about the game without telling us you know nothing about the game.\n\nSpoiler alert: if you can beat Mega Latios with 6 players with counters at lvl 40, then you can also beat it with around 10 players with counters at lvl 20, as long as they are using correct movesets.", "label": 0}
{"text": "No, just easier to do future dyna / gigant battles", "label": 0}
{"text": "It's supposed to, yeah.", "label": 0}
{"text": "you ran out of time and the boss enraged", "label": 0}
{"text": "Thought this too and since gigantamax distort space it would have made sense as well.", "label": 0}
{"text": "Because the mods are human beings, not omniscient and omnipresent.\n\nI mean, feel free to report it if it bothers you that much.", "label": 0}
{"text": "You might want actual info but some are just being jerks about it, saying people are dumb and aren’t using their brains. Perhaps they’re just badly socialised and are trying in some fashion to get the same info but it’s off-putting to say the least", "label": 0}
{"text": "I’ve seen videos of people using golden raspberries and catching on their first or second ball regardless of even a great or excellent throw it’s like trying to catch a tier 3 or 4 boss from raids", "label": 0}
{"text": "D-max Inteleon is probably better than D-max Blastoise against G-max Charizard…I was using D-max Blastoise as an example only because I am not use to the Galarian starters yet.", "label": 0}
{"text": "Neat. I have one Charizard and one Blastoise with max spirit. I thought it only apply to me.", "label": 0}
{"text": "In a group of 6 or 8 you can make suggestions. But with 40? \n\n\nIf I was confident that 8 with good teams could do it I'd be trying to round up a group and talking people through picking their best options. \n\n\nBut the few times our neighborhood group was over 20 (for example, the first elite raids day), just getting an even split into two lobbies was beyond my abilities.", "label": 0}
{"text": "Just did it at a crowded population center in Japan. \n\nTook 6 different groups to finally take down a charizard. \n3 of the groups had 40 people and failed. \nFinal group of 40 people had 10 Pokemon alive when it was beat. \nDidn’t pay for more rewards did Golden razz, five greats, five excellents still ran. \n\nMost people aren’t bringing level 40 max evolved Pokemon so they are being shredded fast. \n\nIt’s not worth the trouble to spend resources to create dynamax counters because you truly need most of the 40 to do the same and seeing how a lot of people are with raids to begin with here in an urban setting (max twenty people most  of the time meaning people get carried), I don’t see people wasting resources to try and prep for this. \n\nAlso if you’ve not really tried to build up dmax Pokemon until now you’re limited this weekend because you need the particles to even raid so you can’t go and upgrade your Pokemon unless you walk and walk and walk\n\n\nOverall this left an extremely bad taste in my mouth, and I don’t see this going well for the go wild events unless they nerf the difficulty somehow. \n\nFor the time being this is something I’m going to ignore because it’s borderline inaccessible in major population areas. I am going to pour one out for my rural brothers because they are for sure locked out.", "label": 0}
{"text": "Which one of its 4 signature moves are you referring to?", "label": 0}
{"text": "Wow, this event really looks blergh after all. Will observe further feedbacks from areas completed them to decide whether to participate.", "label": 0}
{"text": "Just checking:  there is no way for a player with a Niantic Kids or a PTC child account to ever get rewards from an ambassador event because those kid accounts cannot sign into Campfire, correct?", "label": 0}
{"text": "If that 6-8 is true, that's still too many people. That would put a pathetic Gmax starter at a dificulty level above a Primal Kyogre 6\\* raid.\n\nAnd with normal raids, you have access to any pokemon you own, plus access to Megas, a possible weather boost, plus you have a team of 6 and can rejoin after fainting.\n\nIf the starters are already this hard, we can imagine how much harder will other Gmax/Dmax with much better stats be. Just imagine Eternamax Eternatus being released...", "label": 0}
{"text": "The exact stats and power of the G Max moves haven’t been datamined yet. I’m waiting for a Dataminer to reveal the actual numbers. I’m pretty sure it’s different than D Max moves.", "label": 0}
{"text": "You still get a chance to catch the Pokémon though if it is defeated", "label": 0}
{"text": "Yes, that’s how it should and probably will be, but you never know with Niantic. \n\nReally? I did not know that. I thought any Gmax factor would just get removed when moving any gmax mon in SV.  Until you moved it back to home.", "label": 0}
{"text": "If the Japanese fails I see absolutely no way the rest of the world can do more than roughly 500 raids", "label": 0}
{"text": "Pretty much agreed.  They’re using Dyna and Giga and Shadow raids to try and move us back to old local-only raids, just a little more subtly than when they doubled remote pass prices.  \n\nI’ll catch something at a power stop when I’ve got nothing else to do.  It can be mildly interesting strategy.  But with the complete disconnect from the rest of the game, I have no interest in throwing a ton of resources into an uncertain payoff that depends on getting a really strong showing in a suburb of a small city.  ", "label": 0}
{"text": "That's surprising. Do you have any sort of clue as to how stacked your lobby of 40 players are? Or is the difficulty that everyone else seem to be facing simply due to unevolved mons?", "label": 0}
{"text": "33people failed charizard. Not event in yellow.", "label": 0}
{"text": "You and me both. I would get a gmax just for future planning if I could. The reality is it's not even a possibility so I'll stick with a few Dmax and accepting that I'll probably not get good stuff later as I don't have any powerful pokemon for them", "label": 0}
{"text": "I'm actually shocked how difficult this proved to be even in a major Asian city, where it took several attempts to be successful and somehow, the lobby never filled up to the max of 40 players. Not fun.", "label": 0}
{"text": "Were people powering up the max moves of the gmax before using it?  I'm not sure I have enough candy left", "label": 0}
{"text": "Level 20, what do you expect? Every style raid in-game gives you level 20 mons, 25 of wb. Shadow raids included, and they cost more dust to level", "label": 0}
{"text": "Niantic really trying hard to do local meetups a thing again\n\n\nthis is elite raids all over again 😭", "label": 0}
{"text": "Charizard and Blastoise will get their CD moves if you wait to evolve them at December community day.  Really nasty of Niantic to make everyone evolve their Dmax kanto starters and miss out on the comm day moves.\n\nI'll be evolving my Galar starters, but once again I used up most of my candy evolving them before they were in dmax, so candy is very limited.\n\nThey really screwed up on how they released this.", "label": 0}
{"text": "Yup. That's me", "label": 0}
{"text": "A friend in Japan said they failed a Charizard with 33 people lol. There goes my hope.", "label": 0}
{"text": "This feature is going to get ignored so quick lol", "label": 0}
{"text": "The rewards are insulting... You get exp easily and imo 25k exp is nothing compared for beating this GMAX pokemon.", "label": 0}
{"text": "Kiribati, Australia, New Zealand, Korea, Japan and in 10 minutes Vietnam is entering the fray\n\n\nIndia will hit 10AM in 90 minutes", "label": 0}
{"text": " A friend in Japan told me they failed a Charizard with 33 people. They couldn't even get it to 2/3 health lol. I'm not even gonna try seeing I'd be lucky if I can get 3 people to join me here lol.", "label": 0}
{"text": "Well if *Aussies* can’t do it… 😉 But seriously, that’s just nuts. Just wait for the pile on telling you that you were clearly doing it wrong and bulbasaurs must have been involved - clearly missing the point that with that many players it should be guaranteed because *it’s 40 players* and I presume most were actually prepared at some level.", "label": 0}
{"text": "Can you confirm how much the moves cost to upgrade / unlock for Gmax Pokemon?", "label": 0}
{"text": "Classic CD moves only apply for the current year", "label": 0}
{"text": "What teams if u don’t mind me asking? I haven’t seen one falinks in my area taken", "label": 0}
{"text": "I'm here for that question too lol", "label": 0}
{"text": "Make people quit*", "label": 0}
{"text": "That still requires finding Falinks, and I don't know how aggressively G-max spawns are taking over.\n\nFor obvious reasons, can't exactly test against anything else in the rotation.", "label": 0}
{"text": "Good! Makes the game easier for me", "label": 0}
{"text": "Yeah. I’m not hopeful for tomorrow in Hawaii.", "label": 0}
{"text": "Pissing myself 😭😂😭😂", "label": 0}
{"text": "These things are auto catch in the main series. They really should have gone with that.", "label": 0}
{"text": "2 free raid passes is nothing to sneeze out", "label": 0}
{"text": "At least I don't need 40 people for Elite Raid", "label": 0}
{"text": "My friend just had a Venusaur flee with 6 excellents and golden rasberries. He turned his phone off and went home.", "label": 0}
{"text": "You shouldn't start the lobby unless there is 36-40.", "label": 0}
{"text": "Nope! I will tomorrow. I live in a big city", "label": 0}
{"text": "So by that, you mean you need people for manpower? \n\n\nGood luck anyways. I live in a big city too and unless you have a community you rely on air support.", "label": 0}
{"text": "These would be so much better if there was online matchmaking. \n\nBasically, require that players go to the irl gmax spot, but once they enter a lobby, they can be paired up with other players who are also at an irl gmax spot for that pokemon. \n\nYou incentivize players to go outside, but don't demoralize them to the point of not bothering.", "label": 0}
{"text": "I don't think you really need experience level data here... lol. We have a cool thing called a type chart", "label": 0}
{"text": "The other reason elites work is because there’s so few gyms and you know exactly where the raids will happen before hand. \n\nMy city has enough people to do Gmax, but only a handful play in each area around town and they don’t use social, so it’s improbable there will be enough in any given location tomorrow.", "label": 0}
{"text": "Even if I can find 35 trainer who frequent TheSilphRoad subreddit, who I'm sure have read various info graphic, I still have doubt EVERYONE would put in the absolute optimal counter for this Gmax raid.", "label": 0}
{"text": "Team Glaze", "label": 0}
{"text": "Doesn't even have to be remotable, just implement matchmaking. If you're at a gmax power spot, lobby you with other trainers at the same type of power spot elsewhere.", "label": 0}
{"text": "You got two free raid passes? I just got a pin.", "label": 0}
{"text": "Different players have different investment priorities. You probably invested everything you had into those Dmax pokemon, while other players might have invested most resources into PVP, others into raid counters.\n\nFor some people, they simply might not have enough resources for those specific Dmax pokemon. If you already maxed out a non-Dmax Charizard and ran out of XL candies, you won't be able to level up max moves to lvl 3. If you only have 200 Charmander candy, 125 go for the evos alone, the rest of the candies either go into powering up, or to max moves, as you can't really do both.\n\nTo add to this, most Dmax pokemon released so far have had Comm Days, so, many players don't find it worth evolving them without getting their exclusive moves. And this is ignoring IVs, because that's another criteria people have to justify such investment.\n\nAt the end of the day, if you want to build a proper team of 3 for each current Gmax, you'll need to essentially invest in 9 different pokemon, all of them requiring 125 candies to evolve (1125 candies), while each requires 248 candies (2232 candies) and 225k stardust (2,025M stardust) to reach level 40. Then you have the Max moves to level up, which cost 120 XLs (150 for Metagross) and 400 candies (500 for Metagross) to max all 3 moves, which you have to multiply by 9 again.\n\nLets not pretend that it's as simple as some of you are implying.", "label": 0}
{"text": "That's an uninstall moment if I've ever heard one. I hope Niantic sees the player count plummet significantly after this horrendous debut full of decisions worse than anyone could possibly have imagined.", "label": 0}
{"text": "This is what I hope to know in the next day. Hopefully we’ll see some power groups that clear them with 20 or less ppl fully prepared.", "label": 0}
{"text": "What a gigantasurprise that this feature is garbage. Everything about dynamax battles feels weird. The battle itself, using max moves, the catch screen, etc.", "label": 0}
{"text": "Sort of like GBL on a larger scale, definitely like it and it would get around Niantic’s antipathy to remotes", "label": 0}
{"text": "I see some friends of mine change the buddy Name to smth like luckytradecampfire (with less letter obviios). But 1 Was creative too. He changed his buddy to @gmail.com so ppl can send him a Mail for trading.", "label": 0}
{"text": "Raids seem to have much more leeway in comparison to Gigantamax Battles. With this difficulty in mind, shouldn't they add a gating mechanic so at least SOME players can actually enjoy the battles? Right now, unless you have a commandment of an army of hardcores, you are not walking to the city on your own and getting these done on a whim. So why not just put a gate like for instance, only lv40 mons allowed as a bare minimum. Why? Because comments have already suggested that this is not something you can clear with just 4 ppl with lv50 mons while the rest and their Wooloo army.\n\nThe current situation is just a lose-lose for everyone. Casuals join but are just not contributing. Veterans invest and join but are not the majority and can't win due to the minimum threshold still requiring a sizable amount of prepared trainers.\n\nWith that in mind, just put a dam requirement in already. In Monster Hunter Now, there is a \"trainer level\" requirement to enter their version of raids. While not strictly accurate, there is still a mechanism in place to at least help raise the minimum threshold.", "label": 0}
{"text": "Surprising they are even trying. How many towns have the space for 40 people? Heck, many can't even reliably get 4 people at once.\n\nIf mega cities in Tokyo are having trouble, then smaller cities which are only 100,000 people are so are not going to get far. Let alone a place with only 20k people.", "label": 0}
{"text": "I can see a Zygarde event when legends z-a release or at Kalos Tour.", "label": 0}
{"text": "One sad thing with GMaxes is, in the main games at least, most GMax moves are inferior to the normal max moves - which can set up weather or terrain, or provide valuable attack or speed buffs.", "label": 0}
{"text": "My city has a meet up happening with a good number of well aware trainers with powered up Dynamax Pokémon but reading this I’m not even going to bother. Maybe Sunday if it changes, but this is trash and I’m not going to dignify it the time of energy.", "label": 0}
{"text": "can anyone confirm whether Hawlucha can be caught near Terlingua and/or Big Bend National Park in TX?", "label": 0}
{"text": "I have full time corporate job, family responsibilities and 9 level 35 Dmax counters for all 3 GMax pokemon ready for the raids. I would consider myself a causal player as well.\n\nIt just seems people would rather complain than plan ahead for these events.\n\nOh and also, we started building a local community since shadow Mewtwo released from 10 people to 100+ active members. That’s what we did instead of complain on internet for 1+ year", "label": 0}
{"text": "I know that feeling - I learned after Rayquaza raid day that turned into an elite raid day that I don’t say anything to my kids about events coming up. They made up for it, but it still blew.", "label": 0}
{"text": "Agree as well, not quite the same as remote raids but better than just hoping enough people are around in your area, feel like Niantic overestimates available players", "label": 0}
{"text": "Just to be sure, do the starters have their CD moves? Or is this more Elite TM bait? (I assume if they did someone would have said so by now, but I haven't seen anyone say they *don't*.)", "label": 0}
{"text": "Oh ok, so the net time saved from when you do get to skip it (which won't be always) may be worth it.\n\nI'd say if you are looking to save time that way, just have a unique buddy and when you get a Zorua spawn just quick catch it.", "label": 0}
{"text": "Mass evolution is still a thing. 2x Evolve XP Spotlight Hour with two Lucky Eggs can realistically yield a maximum of 712,000 XP.\n\n- 1000 XP per 20 seconds of evolution > 3 evolutions per minute > 180 evolutions per hour > 178 evolutions only during 2x Evolve XP Spotlight Hour to ensure the XP gets multiplied properly\n- 1000 XP x 2 x 2 x 178 = 712,000 XP\n\nI'm Level 50 now.\n\nA chance at 25,000 XP for defeating Gigantamax Battle Bosses is a huge waste of time.", "label": 0}
{"text": "A bunch of people gathered at the power spot closest to the station and then on the hour it changed from gmax Blastoise to dmax Scorbunny..", "label": 0}
{"text": "Although it is not great, why did you think it would be like normal raids when it \"claimed\" you need 30-40 to beat it?", "label": 0}
{"text": "I guess this is just Niantic’s latest hairbrained scheme to try to make it 2016 again, and it will be the biggest failure yet. If these took a few people to beat I’m sure I would at least go out and try to do them. As it stands, I won’t even try and will completely ignore the feature.", "label": 0}
{"text": "It's probably the novelty of being the first time, I'm sure Niantic knows they can't keep this up for future gmax events. But time will tell if they do anything about it", "label": 0}
{"text": "Exactly. Does Niantic even understand that unlike other games, people HAVE to spend time, energy and money to get to the location in order to participate on the Gmax battles??? It’s very unrewarding with this type of game mechanics. \n\nI’ve been playing from Day1 and this is by far the worst feature.", "label": 0}
{"text": "Well, the problem is that if you only have 300 candies for charmander, why spend it in a pokemon that will become obselete the second you finish the Gigantamax raid? I understand why people are hesitant to spend here.", "label": 0}
{"text": "Does this game have any AI?", "label": 0}
{"text": "At least you can win elite raid with 10 people", "label": 0}
{"text": "Right?? Hahaha", "label": 0}
{"text": "Yes, that’s what controls the PVE Pokemon", "label": 0}
{"text": "Well, if they want to push Meetups (preferably with Ambassadors), it should be doable. The bigger cities have insane turn up.", "label": 0}
{"text": "So can you sort of evolve these dynamax pokemon to gigamax? Like mega evolutions that need mega  candy ?", "label": 0}
{"text": "Do you know how Dmax battles work?\n\nCharged moves are insignificant damage contributions. Why would I burn ETMs to gain 10% effectiveness on a move that’s irrelevant to the bulk of the damage done?\n\n> 3 each of the Galar starter\n\nDo you know how Dmax battles work?\n\nI evolved one Galar and one Kanto starter - the Kantos recently had comday classics that I played for about 30 minutes to an hour. Subsitute a psychic metagross in place of a fire. \n\nI had all the galar candy saved up because I did their release week and never powered them up, because they had no meta relevance nor utility until Dmax came along.\n\n> stardust\n\nLucky trades. Either hold up a lucky friend for one, or throw a few dmax back and forth until you hit lucky. 2k stardust to save 150k. I’m too casual to grind a million stardust, but you do you.", "label": 0}
{"text": "I don't even have time to do PVP nor 100 trades per day, both with way bigger rewards. Charmander candy? Level 40 energy.", "label": 0}
{"text": "I wish someday we'll be able to give mushrooms to gigantamax our pokemon like in swsh so i can have a shiny gmax charizard because with my luck right now im never getting one through raids.", "label": 0}
{"text": "lol me too friend, can’t wait for the “which should invest in” posts with like 7 Eternatus", "label": 0}
{"text": "In fairness, your standard 5 star lobbies can be duo'd but suggest needing 15-20 trainers", "label": 0}
{"text": "Confirmed unlikable\n\nI’m in a place that’s fairly active, yet barely anyone’s even batting a eye at these.", "label": 0}
{"text": "Well they can still use the charizard in other raids/battles etc it’ll just be in its normal form", "label": 0}
{"text": "How many trainers did you need?", "label": 0}
{"text": "I couldn't even do the beldum ones. The game has been dead a long time in my area.", "label": 0}
{"text": "The form yes, the Pokémon itself can be used anywhere and can still mega evolve", "label": 0}
{"text": ">my multiple failed charizards were full of players with Gastly, wooloo\n\nOh, that's a problem.", "label": 0}
{"text": "Can I use any mons? Or just dynamax?", "label": 0}
{"text": "You can trade for them, they count as special trades. Hopefully they do the soup thing from sword and shield but that will be later on if they do it!", "label": 0}
{"text": "Sure, it's not much. There are just a lot of people saying these are only for Max Battles, which is wrong. They can be used in normal raids, GBL, whatever - although mostly useful if you don't already have non-D/GMax built.", "label": 0}
{"text": "Shiny Venusaur here\n\nhttps://preview.redd.it/gmqc12rlu0xd1.jpeg?width=1284&format=pjpg&auto=webp&s=6c41be5c636b2addd3e33ff9ae1d9ecc1920bfdd", "label": 0}
{"text": "big fan of the fire effect but...ugh, good lord that tint and saturation just make it look kinda sickly blue", "label": 0}
{"text": "Are we allowed to say the r-word here? Because damn, Niantic's decision making is so abysmal, that they deserve to get that word thrown at them.\n\nThey sucked any hype there was left about this feature, by making it so difficult, and by requiring a lot of players and a lot of investment to actually enjoy it. And all that, to get a bunch of alternetive forms of existing pokemon, that have no bearing in any other game mode other than Max battles.\n\nI bet by now people wished Dmax/Gmax pokemon were released through normal Tier 4 raids, just like Megas, and that they worked fairly similarly to Megas.", "label": 0}
{"text": "Exactly this, People are using unevolved dynamax mons hoping to get carried through and since everyone does it they aren’t able to beat it", "label": 0}
{"text": "That’s my issue. I’m unwilling to invest in my low 3 star DMax mons. I’m not evolving and maxing out until I get some 90+ IV mons.", "label": 0}
{"text": "I barely play the game anymore tbh. I'm just here to get info. Obviouly not even gonna bother with GMax", "label": 0}
{"text": "For what purpose? None of them will be able stats and there's better pokemon for everything else. \"Can\" has nothing to do with \"should\" or \"will\" you're just into semantics here. They mean they can't be used for anything else because they won't be.", "label": 0}
{"text": "It doesn’t have to be an ambassador meetup. People just tend to only trust ambassadors because they consistently host events and show up. Other people only show up for the free stuff.", "label": 0}
{"text": "They actually said 10-40, but I'm seeing very few successes towards that lower end and plenty of failures even with the max amount of people.\n\nNiantic typically overestimate the difficulty, hence why 5* raids say you need so many people when in actuality, several of them can be soloed. It seems like they've gone the opposite direction with this, saying it should be doable with a group of 10, whilst in reality groups of 40 are struggling.", "label": 0}
{"text": "Because they expected us to actually use the pokemon we got since the start of the season.", "label": 0}
{"text": "I was hoping this would let us have shiny Gmax Melmetal in SwSh, that was basically the only thing I wanted from this feature.", "label": 0}
{"text": "Orange passes. If you pick the raid option, it will let you get 2 more raid passes for the day (similar to how raid days work, you get extra raid passes if you use them)", "label": 0}
{"text": "Speaking personally, because I thought that the 10-40 trainer requirement would be similar in scale scale to the \"20 Trainers Recommended\" for 5\\* raids that can really be done with 2-6 depending on the Pokemon. Also, I didn't want to spend MP on anything but G-Max entry fees the day of, so I evolved and powered up multiple counters to help try to carry some of the newer players in my community. Sounds like we'll all just end up as equal little piles of goo when we have our go based on the early returns. In any event, they'll make soloing 1\\* and 3\\* DMax raids easier and I can put my actually good IV specimens on ice to wait for their Community Days to get the exclusive moves.", "label": 0}
{"text": "So any rando can create a meetup and anyone that checks in gets the rewards?", "label": 0}
{"text": "What a crap event. I am i Tokyo so at least the Pokemon can be beat (even then it's not a guarantee with 40 people), but the abysmal catch rate made me have a high Charizard and a Blastoise run away after 10 consecutive excellent throws each, after spending a lot of time fighting them again and again until getting in groups that could win.\n\nSince you don't see the CP before the catch screen (unlike raids), you can't know if you would want the extra balls for 200 coins. \n\nI can't imagine how terrible it must be for people not living in huge cities. It's probably unwinnable and a complete non even for the vast majority of players.\n\nNiantic really dropped the ball on the difficulty and on these stupid catch rates. Also, they're at fault for not giving opportunities to get the exclusive moves on starters/metagross before the event, because a lot of people are obviously waiting for that and haven't evolved their pokemon to the final stage (and won't power crappier ones), which adds to the lack of firepower during GMax Battles. And at greater fault for denying us the use of our pre-dynamax pokemon. \n\nI just hope that G.Max battles crash and burn, and maybe  we'll get a rework in one and half year, like mega evolution did.", "label": 0}
{"text": "30+ people are already too many. The problem is that the difficulty spikes are too high while most players still don't have enough strong mons to use", "label": 0}
{"text": "Wrong title.\n\n\n It isnt about communication, it is about preparedness. People having double takes about leveling their dmax kanto starters as why would they(us)? When we can get better gmax than that. Some would hope that bringing their mons a week they gathered hoping to get pulled/carried by the group of massively 40. This is somewhat okay in shqdow 5 star raid of 7 ppl, but hell no for gmax raid.\n\n\nCandies and stardust, its not like everyone has the resources to actually prepare for gmax raid, and thats not including the daily limited particles to level up max moves that needs so much candies.\n\n\nNeedless to say, it in person only, some hardcore players ready to take on the challenge might have better things to do than travel in a populated city for a \"chance\" to get gmax mons.", "label": 0}
{"text": "For Dynamax raids, you can have maximum four in the raid.  \nFor Gigantamax raids you can have maximum 40 in the raid.", "label": 0}
{"text": "If only there are 40 people here", "label": 0}
{"text": "Exactly, remember 40 people is just like 20 in a raid. If 20 people tried to take down palkia with ghastly they would fail miserably.", "label": 0}
{"text": "La Crosse has a CA. Doubt it’s near you but your state very much as at least 1 CA.", "label": 0}
{"text": "And just for bootstrapping that part of the game. All these starters will be outclassed by g-max and other species before long.", "label": 0}
{"text": "Hahaha right?  Rewards = difficulty, like most video games.", "label": 0}
{"text": "Props on the positive mindset and comments. I agree it comes down to communication but….\n\nTo be honest there is a large amount of naivety on both Niantic’s side AND the player population that you’re going to get 40 people to align. \n\nI’ve seen it with other games from MMOs to FPSs and if you think how hard it is to get 4-8 people aligned in games like that which have chat/voice, how do you expect it to work for pogo and 40 people?  We can barely hope to get 5 people for a raid to be at top level, so I think 40 is damn near impossible. \n\nIt might be better at things like Fukuoka which caters to the more hardcore, but randoms in the wild….\n\nI beat a charizard after 6 tries to only have it run. I have ZERO desire to build up another 800 mp, look at my d-max Pokémon’s, blow even MORE stardust and candy and mp on them only to get put on another team with freshly caught stage 1 d-maxs after that. \n\nI’d much rather casually raid legendaries as that’s much more accessible and actually useable in all other content.", "label": 0}
{"text": "You know what's even worse. Eternatus has its own max form too. This means a legendary may end up locked behind a nearly impossible to beat raid. This whole thing needs a complete revamp.", "label": 0}
{"text": "What does that have to do with getting people out for GMax events?", "label": 0}
{"text": "That’s the real funny part is we’re powering up the hell out of these mons just for a chance at something “better” that we’re also going to incur a heavy resource cost for. It’s absolute madness to me.\n\nI saw a popular YouTuber say he has spent 3-4 million dust preparing for tomorrow. I literally don’t even have 3 million total. Let alone 4 million just to piss away on a new feature or 4-500 Candy per pokemon I’m bringing in", "label": 0}
{"text": "they did suggest this is a 6 stars raid\n\nand quite frankly it should never have been.\n\nit's like putting you to fight the final boss right after you exit the tutorial stage without plot armor to survive him", "label": 0}
{"text": "I don't think that's fair at all. People from day 1 of the gmax announcement have been exclaiming how they knew their community couldn't put enough people together to attempt them. \n\nNobody had a plan of \"I know I can find 39 other people so I'll be good to go\". \n\nI think there was some hope that when Niantic says 20-40 players we could maybe do it with 10, like how we can 2 man most raids they recommend 10+ players for. \n\nBut ultimately it was a huge mistake on their part to assume that anyone would willingly max dynamax mons we knew were going to be immediately outclassed by their gmax variants. \n\nExpecting people to put resources into those? Only to end up with no resources to put into their replacement? It's just a horrendous gameplay loop. I have no idea why they thought this would be accessible or drive community engagement.", "label": 0}
{"text": "Mass trade.    I do my 100 trades a day and I have no issue with the iv spread,   I hit a new hundo off trades every 7-10 days,  sometimes 2-3.   My stats regularly balance out at around 1:700 trades.      Hit best friends with a few people and have them farm specific event poekmon for you, and you do the same for them.. meet up and do your hundred trades and repeat.      Odds of hitting your hundo is incredibly good if you can get reliable people,  and if the pokemon your hunting is boosted spawns.", "label": 0}
{"text": "Too many people were taking up raid space and only bringing a single wooloo. There needs to be some kind of cap (e.g not letting people into the lobby unless they have a certain amount of dynamax pokemon/pokemon of a certain level)", "label": 0}
{"text": "But the issue here is that even higher level players like us don't even see the point in, what is essentially, wasting resources like large amounts of candy and stardust and even XLS on pokemon that will be promptly disposed of in like 6 months. \n\nThose resources are much better used in pokemon that are already good, with special moves, high CP thanks to weather boosts, being able to mega/primal, etc. None of which are attributes in any of the crappo dynamax pokes we've gotten so far.", "label": 0}
{"text": "Barely any I think", "label": 0}
{"text": "This. I feel so awkward leveling up my Zard and Cinderace when I know they will get a GMax form later/now.", "label": 0}
{"text": "Yeah, the problem is the shield & revives don't work on everyone in the gigantamax raid. You get divided up into sub-groups within the raid, so if you use your shield or revive, it only works on pokemon within your sub-group.", "label": 0}
{"text": "> Because I don't want to evolve a Pokemon when it won't get its legacy moves. And feeling like Niantic is deliberately forcing players to make that choice is turning me off the whole max concept.\n\nThis is my exact issue. I don't mind messing with the feature when I can but I really do not want to waste a potential Elite evolution opportunity.", "label": 0}
{"text": "It is incredibly common to refer to the code that controls NPCs as AI.", "label": 0}
{"text": "I love Dynamax too. Just a bit hard to level them without grinding. And you have to rely on randos a bit for tomorrow.\n\nDynamax is a FRESH reset. No more people relying on their old gods.", "label": 0}
{"text": "What are the shiny odds ", "label": 0}
{"text": "Lmao no one's using any of the kanto starts in ML bud.  No one who actually knows what they're doing anyway.", "label": 0}
{"text": "If you attend an Ambassador GMax event, checking in gets you additional MP so you can in theory get all three in one meetup without having to spend coins on packs. But I was also more generally speaking to the rewards mentioned in the linked article.", "label": 0}
{"text": "and I've got a morpeko without aura wheel\n\nno I didn't TM it and is this even normal", "label": 0}
{"text": "Ofc they change the system again when I delete my A-exeggutor", "label": 0}
{"text": "I don't think players should be able to be successful with unprepared teams, but there are 10 players in my community with strong teams, we are well prepared and didn't even come close to winning one of these. There is no reason at all for Niantic to decide that 40 players should be able to battle together in these raids, let along being balanced to require even half that many to be able to win. Dynamax and gigantamax are both 4 player raid battles, they have set them up to be 4 player battles, they should be bearable with 4 strong players. Just max 4 players, end of story, those weak/unprepared trainers still won't be able to succeed, but those that care to try can do it without needing a small army.", "label": 0}
{"text": "Max guard. The research indicated it is more valuable than heal in terms of damage negated.  Proper strategy would seem to be to always use guard at least once per dmax. I'm not clear on if/how they stack though.\n\nSo you heal, but also prevent future damage with guard so you can outlast the damage. But then the enrage timer becomes the question.", "label": 0}
{"text": "You don't just need 39 more people. You need most of them to also have counters, and you're right to say that it's the first time we have such a hurdle\n\n\nEven the hardest 6* raid bosses require at most 8 good trainers with good counters.\n\n\n Not optimal level 50 counters. Just decent enough ones. Meaning that over half of the lobby can still coast with Aggrons and Lugias and winning is guaranteed.\n\n\n\n\n\n\nGmax? Impossible to leech off a group. And even if we were given a free GMax starter, most people would just not invest anything and it would get one spotted just like a Wooloo would", "label": 0}
{"text": "Your thread has been automatically removed for not meeting our karma threshold for standalone question posts.\n\nHere is what you can do about this:\n\n- Use the [subreddit search](https://www.reddit.com/r/TheSilphRoad/search/) to see if your question has already been asked (and answered) recently.\n\n- Post your question in our [stickied Q&A megathread](https://www.reddit.com/r/TheSilphRoad/about/sticky) that doesn't have any karma restrictions on posting.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 0}
{"text": "https://youtu.be/M6I2ntwIo8Y?si=2tL25seBs-tC7F3W\n\nThis group didn't with 15. Sounds like most of them had somewhat powered up mons, some up to lvl 40. But you can still see that 2 pokemon died very quickly. So at most 13 people had solid teams. And they did it fairly comfortably.", "label": 0}
{"text": "We shouldn't be forced to burn 600k + stardust to field a team of 3 burner pokemon that are literally training their replacements. There is absolutely no reason we shouldn't be able to field non max pokemon in a max battle.", "label": 0}
{"text": "At that time it was only 9am in Japan/Korea. I'm also in Asia. Forgot how far ahead Aus and NZ were.", "label": 0}
{"text": "Would Niantic take this information though", "label": 0}
{"text": "I’m seriously disappointed in this as well. I was hopeful to at least have the satisfaction of seeing a different looking Blastoise on my screen at all times, like while scrolling through my storage, but nope", "label": 0}
{"text": "Crazy to go from T3 to T6 with having almost nothing built up.", "label": 0}
{"text": "But your whole comment was about GMax and not having an ambassador meetup and people not coming…\n\nSo really, you are complaining you aren’t getting the free 800 MP?", "label": 0}
{"text": "I'm also in Asia. Didn't realize that even NZ was 6 hours ahead of me. Thought there were like 3 hours.", "label": 0}
{"text": "> A hundo /shundo will definitely be used in master leagues. Your not going to refuse to use it else where if ends up being usefull there.\n\nYou can only use them in their normal form I thought? You can't dmax/gmax them unless you're in a dmax/gmax battle. They don't even appear as d/gmax when you set them as your buddy.", "label": 0}
{"text": "I’m gonna say that battling with 30+ trainers today was the most 2016-like the game has been for me in a long time but I understand people’s complaints.", "label": 0}
{"text": "Because even in normal raids, if you look at the top of the screen where it recommends how many players it takes, it says 20 for 5-star raids. They have always hyper exaggerated on the number of players we need to take down raid bosses.", "label": 0}
{"text": "I'm hearing reports that 16 players or less are needed with the strong counters. There are videos of raids won with \"10 survivors\" so I'm assuming 10 people carried and stayed alive through the battle.", "label": 0}
{"text": "Thanks! What about the candy cost? Is it the same as the Dynamax?", "label": 0}
{"text": "I can't imagine ever doing these. For last Go fest Global I found a raid group that was a little bigger than 20 people. So finding 40 outside of a big event like that just does not seem feasable", "label": 0}
{"text": "But we can cheer!! 🎉🎉🎉🤣", "label": 0}
{"text": "This person just doesn't play GBL and thinks anything fully powered is a viable win in ML would be my guess.", "label": 0}
{"text": "But we’ll still give it a try, yeah?  Though I won’t spend a lot of time, just whatever raids are in my neighborhood.", "label": 0}
{"text": "Meh, I’m going down to Ala Moana in the morning to give it a shot. If I fail it more than a couple of times I’ll just write off the gigantamax raids.", "label": 0}
{"text": "If we could do them with existing Pokemon, the entire max raid content becomes obsolete.", "label": 0}
{"text": "I assumed that there would be issues, from 800mp per raid and the cap for the day affects free to play players, the 6* level difficulty spike, and locking out the majority of pokemon to counter with, but I'm surprised with the backlash.", "label": 0}
{"text": "And yet, we are. And Niantic is not gonna reverse course on this. \n\n\nYou are free not to take part in this. I know I won't - my community isn't large enough.", "label": 0}
{"text": "This took a ton of dust and candy. I powered up my three Kanto Dynamax to level 40, plus Max Spirited & Max Guard (because I’m the only woman in my group and all the guys were max powering the attacks - lol). This was a hugely expensive endeavor.", "label": 0}
{"text": "We don't have a lot of options currently, but leading with something tanky and high level that maybe doesn't even have powered up max moves,  then switch to your SE attackers \n\nAs for the coordination, it's asking a lot, but if everyone has all the moves unlocked then that eliminates worrying about join order. Then everyone tries to identify where their team of 4 is IRL and verbally communicates about roles. I expect that may be how Niantic imagined it at least. Could be problematic in a short time with large groups spread over an area, or adults paired with unknown minors.", "label": 0}
{"text": "Yeah but you would want to save the good IV ones of the Galar at least for their community days.  There are probably more chance to get Galar starters, but I'm not going to waste anything above say IV 96% on a suboptimal moveset that will be guaranteed to be overtaken a few years later.", "label": 0}
{"text": "I didn't really see them saying it could be done with 10. Given the announcement this didn't seem like a case where they were going to overestimate the difficulty. And that sure seemed to be what everyone was at least pretending to believe when complaining they didn't have 30-40 people to play with.", "label": 0}
{"text": "I don’t grasp why they didn’t test the waters with a stage 3 Dynamax Pokémon first. \n\nFalinks to GMax Kanto starters is a ridiculous jump on difficulty.", "label": 0}
{"text": "It has been hard to get the candy and then why would I max 3 dmax charizard when I will be hunting for it's replacement", "label": 0}
{"text": "I do this too, around 10 seconds usually for me. I feel like the group target move takes the place of the single target one, no?", "label": 0}
{"text": "Yeah, but Niantic aren't pushing that, like they pushed that we'd need lots of people for this. Either way it would have been silly to assume these could be beaten by just a few trainers.", "label": 0}
{"text": "and the T3 is dog water and does NOT help in beating the T6 at all", "label": 0}
{"text": "Source? I don’t follow Pokeminers. I follow the other ones. \n\nThey haven’t updated or posted the gmax damage numbers.", "label": 0}
{"text": "Would it be wrong to say nothing would’ve been less insulting in this particular instance?", "label": 0}
{"text": "Did you guys make sure you had people with Max Shield/Heal? What did the communication look like?", "label": 0}
{"text": "I’ve been grinding hard because I thought it might be very hard but even with a group of 5 I’m not sure how it will go", "label": 0}
{"text": "So if 15 players have one lvl 40 blast with maxxed attack and like one more which is kinda boosted it’s possible I guess? But Damm that’s 500 candy for one Pokémon …. How the hell im lvl 47 player and kinda active since I started playing (1year) and I just don’t have the candy to lvl 40/max a single blast and barely enough for a single gen8….", "label": 0}
{"text": "Especially with Niantic’s baffling decisions, such as making the max raids local only, when one could do them online in SwSh. And that’s just one of many such questionable choices.", "label": 0}
{"text": "I was new once as well. That didn’t stop me from engaging in the local PoGO community. All those lv 40 players with full teams of lv 40 meta attackers (40 was the max level at the time) we’re glad that their community was growing. Eventually I became a lv 40 player with full teams of lv 40 meta attackers and I love helping out newer players do raids. \n\nSo far the DMax/GMax system has been driving away most high level players because they don’t want to invest in another Kanto DMax starter or whatever Dmax mon, when they could instead invest in a top tier meta relevant mon.", "label": 0}
{"text": "They could make a resource to dynamax your existing Pokémon, and make that resource an exclusive dynamax battle reward", "label": 0}
{"text": "Did you guys make sure you had people with Max Shield/Heal? What did the communication look like? Did you keep your Max Particles when you lost or were they lost?", "label": 0}
{"text": "Won’t be doing gigantamax because it feels too difficult to complete", "label": 0}
{"text": "Bear in mind, if the 'zard were higher level, it would also be harder to catch.", "label": 0}
{"text": "Yep, noticed that too, so I use my main on the play store, and switch if needed", "label": 0}
{"text": "They might not have wanted people to just run the same counters as raids. \n\n\nWe just go and speedrun raids to max our teams of shadow Mewtwos so that they can dynamax as well\n\n\nInstead of having two metas we just get the same one. People sitting on level 50 Shadow Mewtwos win on both fronts.\n\n\n\n\n\n\nThe 6* gigantamax raids are horrible but I don't think letting every pokemon take part in it is the play", "label": 0}
{"text": "Even if they gave us a G-Max Kanto Starter...\n\nDo you have the Candy and Stardust to take it from level 15 to level 40?  \nDo you have the Candy and Max Particles to upgrade their Max Attack, at minimum?  \nDo you have the XL Candy and even more Max Particles to upgrade their Max Attack again, and/or the XL Candy and even more Stardust take it to level 50?\n\nOkay, now repeat that three more times.\n\nNow repeat that for 30\\~40 people.", "label": 0}
{"text": "But if you don't beat even one you keep your particles full even after the fight.", "label": 0}
{"text": "Originally we had no prompt for the group attack but did have one for targeted attacks.\n\n\nWhen Beldum came they added the \"large attack\" prompt for the sweep and when Falinks arrived they removed the targeting prompt.\n\n\nSo they were both always there. Niantic has just reversed which one we get notified about. It really doesn't make sense because only the target notice is useful as sweeps can't be dodged.", "label": 0}
