{"text": "Nyc Pogo Map\n\nSame for Sydney, Singapore, London, Vancouver \n\nTreating this stuff like its the dark arts and these are unforgivable curses is beyond childish.\n\nGain every advantage over Niantic that you can, If it means you can enjoy the game more.", "label": 1}
{"text": "Important event for me, see how it works", "label": 1}
{"text": "Wish people would just use these for feedback for the event and not just posting pointless rubbish.", "label": 1}
{"text": "Every time. I wish this sub had some decent moderation.", "label": 1}
{"text": "What kind of clothes was she wearing?", "label": 1}
{"text": "Hmmm", "label": 1}
{"text": "Damn for real? Dammit.", "label": 1}
{"text": "That \"and more!\" is gross af imo", "label": 1}
{"text": "I’ll just add it to my list of things I just cannot and will not ever be able to do in the game and move on with my life:\n\nElite raids\n5 star shadow raids\n*Gigantamax raids*", "label": 1}
{"text": "> I enjoy Dynamax and don't understand why everyone complains so much.\n\nI like dynamax personally (it's not perfect ofc, but it's a decent start), but I can see why people dislike it.\n\nIt's a bit different for you since you've returned from a long break. For long term players though they've already got good mega charizards and stuff leveled up if they want it, but now they have to level up new ones just to get dyna/gigamax pokemon that they already have normal versions of leveled up etc.\n\nThe only thing that is new/improved with the max mons is they can be used in max battles, but if you're just getting pokemon you already have leveled up from max battles then what's the point really? So for those people until there's actually an exclusive pokemon from max battles or something they just don't see the point in leveling stuff up for it.", "label": 1}
{"text": "My area has a total of MAYBE 12 players.. 4 of which are me 😂 I’m not even going to bother", "label": 1}
{"text": "What is that", "label": 1}
{"text": "It’s a shiny Charizard.", "label": 1}
{"text": "Have you.. opened the game recently?", "label": 1}
{"text": "gigantamax raid -- a new Max Battle variant that launches within like 12-20hr? for most\n\nthey're wholly unrelated to regular raids and honestly not worth it atm", "label": 1}
{"text": "Mate what? I made this post when I was 15 and stupid. Obviously it was a shit idea. I barely remember my mindset behind thinking this, but it definitely did not involve the financial aspect. \n\nAlso... I think at that time HOME didn't even exist...", "label": 1}
{"text": "It all feels incredibly rushed and ill thought out. From the first rollout with the issues and bugs with Dynamax battles that are still not fixed, to the particle points limits and costs, to the high costs of investing in the Pokémon and upgrading moves. Then as you point out, the insane leap in difficulty from 3* Dynamax to GMax. \n\nThe rushed implementation just feels like it's going to backfire horribly on them and put the majority of players off bothering with this.", "label": 1}
{"text": "Just another quality feature brought to you by niantic", "label": 1}
{"text": "Wow so surprised you needed to grind the game to day one the new activity. ", "label": 1}
{"text": "Thanks for considering, but I have atleast 5 accounts ( I am the only player in my area and that's how I do my raids) , so I think im not loosing Pokemons but I'll be missing out on items , candies , exp , and lord forbid if I get a shiny that takes way too much stardust, and I lost my streak. I'm sad", "label": 1}
{"text": "Your post has been automatically removed because Automoderator suspected it was sharing a referral code. This type of post would be more appropriate for /r/PokemonGoFriends :) We work to keep the Silph Road focused on studying and illuminating game mechanics and building the Silph Road network.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSilphRoad) if you have any questions or concerns.*", "label": 1}
{"text": "Yeah I'm not gonna feel bad for cheating in badly implemented game my guy. I am not sorry for doing it. I learned way more about the game and how it works and how much it doesn't work. At a time when  I was pretty much just bedridden with long covid for 5 months and couldn't walk the length of my bedroom without needing my inhaler. I could actually play and had pokemon spawn close enough to catch and I could spin a stop, i didn't cheat. They don't make this game at all friendly if you have any mobility issues. Niantic has cheated all of us way more than I cheated it. So fool me once something something. Fool me - you can't get fooled again.", "label": 1}
{"text": "Live in a mid sized American city. We had 16 people come out for one raid. Most had never powered up any of their moms and max moves, so they used energy on doing that. Then they realized the cost of the battle was 800 energy and had to put a dollar into the game to complete the raid. We failed the first time, succeeded the second. No one had any interest in putting money towards more energy so for 1600+ energy each (one battle and powering up) we all got a charizard. There was no interest in doing a venusaur s block away, so we all went and did other things.", "label": 1}
{"text": "Your spelling is unbelievably bad", "label": 1}
{"text": "English is not their first language", "label": 1}
{"text": "I think the worst I've witnessed in person was Go Fest Dortmund in 2019. Very fun event still, tho first hour we couldn't connect.\n\nOn top of that, if you weren't in the part there was a Slakoth invasion DURING the GO Fest stuff. Meaning if you wanted a shot at that new Shiny Nidoran, too bad, heres 19 shiny Slakoth instead", "label": 1}
{"text": "Idk if you tried this already but I created an account a few weeks ago that got immediately banned but I just logged out and logged back in and it was fine. Tried again with another account to see if it happens again and it did but I was able to log back into that one as well", "label": 1}
{"text": "You don't know that, and if you look at their profile you can tell that they're just not making any effort. Most likely English isn't their first language and they're using a non-English keyboard and just guessing on everything with no autocorrect, but it's really bad.", "label": 1}
{"text": "I mean that's exactly how I'd be doing Swedish and it would be less intelligible", "label": 1}
{"text": "Thanks Niantic, saved me money by avoiding these ridiculous raids.", "label": 1}
{"text": "Doubt it, this is the last straw ... Niantic sucks ... deleted the game today", "label": 1}
{"text": "How will I prepare? Simple prepping a raid team for Darkrai and ignoring Max raids.", "label": 1}
{"text": "this does not help anyone beat gengar, infact the opposite\n\nthis is to help people get read for it", "label": 1}
{"text": "Hey buddy, i think that’s the joke", "label": 1}
{"text": "Real encouraging ", "label": 1}
{"text": "Not really encouraging to those want to do these anyway ", "label": 1}
{"text": "That’s the thing.\n\nFrom what I noticed, it really boils down to the last few teams who carry everyone.\n\nIt went from like 120-45 in 5 seconds, but then slowly went down till it was 3 pokemans left and it held there till death. I’d like to know the real minimum amount, because these teams of 40 are really not teams of 40.\n\nAlso, one thing I noticed, it seems to be easier when you’re the last one standing. With consistent cheers, you could beat the pokemans move 9/10 and just spam dynamaxing.", "label": 1}
{"text": "Cause not everyone cares to beat it. I think this post is helpful, but you have to accept that some people just don't care about it, especially after today.", "label": 1}
{"text": "It helps if everybody does it.\nNiantic will have to nerf them\nJust doing my part 💪", "label": 1}
{"text": "Why nerf it when you have an easy to follow guide on how to beat it above? \n\nImo while they are difficult and should be adjusted, rewarding people for going in with 3 wooloo is not good game design ", "label": 1}
{"text": "what is this forbidden knowledge", "label": 1}
{"text": "I can tell after all the wooloo and gastly users are downvoting everything ", "label": 1}
{"text": "Point of the game\n\nBut fine, hope they make it so easy I can tackle everything down with wooloo in 2 seconds\n\nFun 👍", "label": 1}
{"text": "Yeah, a middle finger on all small communities\n\nFun 🎉", "label": 1}
{"text": "Jokes are supposed to be funny though", "label": 1}
{"text": "It’s also bad game design not to add things meant to challenge the player\n\nSeems like a lose/lose situation to me even following your method of “make it easy” ", "label": 1}
{"text": "I’m finding most people on here just want to remove all the challenge in these \n\nOr it’s “unfair to rural players” ", "label": 1}
{"text": "Removing the hidden \"kill all\" timer would even be an acceptable nerf", "label": 1}
{"text": "Bro, drop the wooloo crap. There are plenty of us who made a real effort to prepare for this and it all went to waste because we couldn't get enough of a group together. Lucky you for having a fairly easy time, but read the room. This is the worst part about this implementation, that it made me not only hate Niantic this time but it made me hate privileged players like you who encourage them to screw the rest of us over. You said that you only had 10 people sign up but ended up with 20, well you know what? If those extra 10 people hadn't appeared out of thin air you would've gotten your butt kicked just like the rest of us and been annoyed at people accusing you of trying it with a bunch of wooloo", "label": 1}
{"text": "\"Lol lmao sorry guise, please buy our apology box for only 5,000 coins that'll reward you 1 Rare Candy, 3 Poffins, and a \"We're Totes Sorry\" headband for your trainer avatar\"", "label": 1}
{"text": "The raids themselves arent encouraging", "label": 1}
{"text": "“If you’re upset, you can rent an apology” (c Stupendium, “Fine Print”)", "label": 1}
{"text": "I have four accounts on my phone (mine, 2 kids, wife). I have logged into 3 today.\n\nGalaxy S24 Ultra running Android 14 and Galaxy Tab S7 running Android 14.\n\nPoke Genie installed and I think I used the overlay a little today\n\nDeveloper mode is off.\n\nAuto catcher is a Gotcha Evolve.\n\nI use an auto clicker to do trades several times a week between my account and my wife's account.\n\nAll accounts are still working (no bans).", "label": 1}
{"text": "People want to keep believing it’s Niantic’s fault they can’t complete any gmax raids and not because they didn’t invest anything into their teams.", "label": 1}
{"text": "Reminds me of the early days of the game when teams of 20 couldn’t take down Lugia cause they were using Blissey.", "label": 1}
{"text": "It’s what i saw today", "label": 1}
{"text": "Agreed, just get 40 people together, evolve 3 top counters for 15,000 candy total, spend an aggregate 27,000,000 dust and 29,760 candy to get the 120 mons to level 40, and spend 336,000 particles, 6,000 candy, and 4,000 XL candy to max out all of their moves.\n\nOh, and hopefully no one with inferior counters takes a spot, once they’re gone they can’t revive and you’re at their mercy.\n\nOh, and you’ll need to do this three times if you want to win against all three. One team won’t do it.\n\nOh, and you’re spending 225,000 dust per mon on an inferior Mon, because your next hope is to put the same resource investment in the better one you get today. Be prepared to do it three more times after this.\n\nOh, and the in game mechanic was released 6 weeks ago.\n\nBut other than that, it’s honestly not that bad.\n\n(Before “um achtually” posts on my math happen, it’s close enough to prove the point, feel free to correct it but I don’t care)", "label": 1}
{"text": "is it bad if i feel sad that i didn't get falsely banned, if said exclusive avatar items were actually true. 😂", "label": 1}
{"text": "\"I got banned by Niantic and all I got was this digital cosmetic item that clips through my avatar's neck\" ", "label": 1}
{"text": "Niantic developers after adding a feature no one asked for\n\nhttps://preview.redd.it/k6r58l4av6xd1.png?width=755&format=pjpg&auto=webp&s=5b56c70423c3131985600aac24710cd6dd0f3a0d", "label": 1}
{"text": "The investment needed to complete these raids is unrealistic for 25-30 people after only a month. This was a case of bad rollout.", "label": 1}
{"text": "I mean is the challenge of trying to find 39 random players a fun proposition to you? Like the mechanics of the actual battle should be the part that's fun because it's challenging, not finding people.", "label": 1}
{"text": "No one is holding a gun to your head to get a gigantamax mon 🤷 like so many people have said, there is no real use for Gigantamax in the current game other than collecting. And they’ll roll gigantamax back out again just like they do with every other feature of the game.", "label": 1}
{"text": "you don't need 39 people", "label": 1}
{"text": "Good call - we all got together for weeks, did 3,000 Dynamax raids, traded all of them, hit a perfect 4% normalized distribution of luckies, and cut the dust cost down to 13,500,000 plus the 300,000 dust for all those trades.", "label": 1}
{"text": "Ah yes, the “no one is making you engage with the garbage game mechanic” troupe. Like so many more people have said, “this mechanic sucks”", "label": 1}
{"text": "Nobody knew what to invest in.  Who actually knew how these battles worked until today? And you have to gradually invest in this stuff over at least a week to get the moves powered up because of the MP cap.", "label": 1}
{"text": "I spent 0 dust and no max particles, just extra candy to evolve and then some normal TMs. Older players should have thousands of extra candy for the Kanto starters anyway, and I evolved 1 of each galar starter cuz might as well get the dex entry early.\n\n40 person raids went fine, maybe some people invested particles/candy in max moves but I also saw 30-40+ mons drop dead (\\*) in the first minute every time so I'm pretty sure there's a lot more dead weight than actually leveled mons.\n\n(\\*) based on remaining pokemon subtracted from 120, I suppose I'm counting empty slots as dropping dead too.", "label": 1}
{"text": "How to prepare: forget it even exists and enjoy your day", "label": 1}
{"text": "That must be the long-awaited [sequel to this](https://i.imgur.com/W6eCtIO.jpeg).", "label": 1}
{"text": "No one's making you play this game.", "label": 1}
{"text": "So... Like playing the game in an intuitive way since there were hints dropped awhile ago that you'd actually have to invest in your Pokemon. E.g. even with Beldum.", "label": 1}
{"text": "We did 2 with under 20 people and everyone was evolved, but little-to-no levelling past 30 (guessing, since I was dying slowest in both my groups with level 30s). A bunch of us had metagross, so we started with venasaur. Then used it on blastoise (I gave mine 5 levels) and it was super easy. We have a small group trying for charizard tmr, but we all have G-blastoise and expect to be fine. \n\nSo it’s hard, but what you’re saying is waaay more than what I saw people putting in, personally. I saved a up a bunch of coins from gyms and won’t need a single coin to get 2, probably 3.", "label": 1}
{"text": "Only the first one is hard and most have charizard leveled from beldum/falinx. So take down venusaur and use that to take down the others. Blast was easy after we all got venusaur", "label": 1}
{"text": "You'd be surprised how many people do all raids with the recommended team the majority of the time.", "label": 1}
{"text": "What's garbage about it? It's better than raids today IMO. Not amazing, but better.\n\nDo I know 20 people who will show up regularly? No. I think that could be solved with group-based match-making however.", "label": 1}
{"text": "Forcing investment in obsolete mons to catch the better on is garbage.", "label": 1}
{"text": "Unrevivable Level 20 base mons getting nuked on the first turn and leaving you without a support team is garbage.", "label": 1}
{"text": "A failure to ramp the difficulty properly to allow people to develop strategy to win is garbage", "label": 1}
{"text": "10 balls for catching is garbage, and the idea you can pay 200 coins for an adequate raid ball count is outright offensive.", "label": 1}
{"text": "Other than that though, it’s pretty great", "label": 1}
{"text": "I guess I agree 10 balls is low. But the pokemon don't even dodge 👀", "label": 1}
{"text": "I for one would.", "label": 1}
{"text": "I think it’s also because you need to strategise with a community if you want to win. I would much rather have the option to play without having to find people, it’s like how I wouldn’t expect to short man T6 raids with randoms but it’s still very doable with 20 people, I think T6 max battles should be very doable with 40 people instead of a 50/50 whether people have invested", "label": 1}
{"text": "Yeah having to spend 600k+ dust on kanto starters which are no longer meta relevant is wild", "label": 1}
{"text": "You realise most communities don't have 40 active players that'll be there for 2 days", "label": 1}
{"text": "Most people play a game like Pokemon Go to relax and maybe have fun doing raids with their small communities. Organizing, orchestrating, and strategizing for groups of 30-40 is just not fun, but rather work. \n\nI still hope they scale it down, so that a reasonably sized group of maybe 8-12 can do it with average counter (e.g. lvl 30 pokemon with stab moveset). Then tryhard player could enjoy the challenge of doing it with 4 players. 40 people should beat it with anything. If they want to keep it this way I will just ignore it.", "label": 1}
{"text": "Just go to your local mall", "label": 1}
{"text": "I only tried this because I thought that maybe it’d actually work; was having the same issue on the official game and idk what’s wrong w it", "label": 1}
{"text": "Are the 1990’s in the room with you now?", "label": 1}
{"text": "I was at my local mall today. There’s no power spots there", "label": 1}
{"text": "Must be where you’re at, have you tried going outside and touching grass?", "label": 1}
{"text": "This game is in an embarrassing state more than ever.\n\nCheaters run rampant (I know cause there’s a cheater who lives 3 cities over that will check 5 different cities I have to drive through to work 3 times a day or instantly attack if someone on his do not like list takes a gym from him while he’s at home).\n\nFalse bans.\n\nGym under construction.\n\nGame freezing up.\n\nGame crashes often.\n\nAnd so much more. ", "label": 1}
{"text": "Imagine the roaring crowds when GMax Pikachu or Meowrh comes out. It will be hard to find 30 people for a Pikachu.", "label": 1}
{"text": "My nearby previous malls are: a locked empty husk, physically gone, and an Amazon fulfillment center respectively — all pretty distant from grass.", "label": 1}
{"text": "Sounds like a personal problem ¯\\_(ツ)_/¯ . There’s a couple malls within 10 miles of me that have thousands of people there every single day. It’s my go to spot for any raid day events", "label": 1}
{"text": "I genuinely don't understand why people think the mods suddenly allowed bragging posts. They all get deleted...", "label": 1}
{"text": "Bro its a kid...don't you remember growing up on Pokemon and struggling with the final four or some other challenge in the mainline games? At least at the end you could beat them. This issue wasn't even his fault and itkept him from being able to get something without any indication of when it will come back.", "label": 1}
{"text": "At the very least it will be a good life lesson for the kid.", "label": 1}
{"text": "Pokémon is for kids. Beat it!", "label": 1}
{"text": "Sucks to hear but I hope someone was there to talk the child through it.. As it's moments like this that can build resilience in someone.", "label": 1}
{"text": "you sound nightmarish", "label": 1}
{"text": "It is cool and good to be nice and empathetic. This little boy was feeling frustration and showed it in a healthy, normal way by letting some tears out. \n\nYou should find some joy and kindness in your heart man.", "label": 1}
{"text": "If they don't experience it when they're young they will have a harder time dealing with it when they're older. When they're young they have parents to soothe their emotions. When they're older they would literally just have to freak out on their own.", "label": 1}
{"text": "While I agree, I still think it’s messed up. Says a lot about our society if you think about it…", "label": 1}
{"text": "What part is messed up?", "label": 1}
{"text": "When you try your best, but you don't succeeeedddd....\n\nhttps://preview.redd.it/tscf3qzs7gxd1.jpeg?width=1024&format=pjpg&auto=webp&s=cc79f9a10c5a066248c9a047c3016686f3546ecf", "label": 1}
{"text": "\"This is not for children. This is for everybody\" 🤔", "label": 1}
{"text": "I think the reality is with RayQ raids, cool worst case you can get a few extra raid passes without much effort. Three attempts for 250coins worst case\n\nBut these Gmax battles are basically locked behind paywalls because you can really only do 1x/per day (2x if you already had Max energy beforehand) without buying more Max energy. \n\nDisappointment should happen, but I guess what would be crazy frustrating for many is you realistically get locked out by the game after your 1st attempt, at most you could do 3 over the entire weekend if you had 1000 energy to start with. \n\nAnd given the crap catch rate that means they intentionally didn't want people catching them. What's the point of adding a new mon if they intentionally want people to be unable to catch it? \n\nKids need to be disappointed and learn stuff doesn't always go their way, but this is basically guaranteeing disappointment with how hard the battles were, and how infuriatingly unlike any real reward was. \n\nIf the battles were easier or more could be performed then so be it, very low catch rate. But combine super low rate with a really difficult and limited battle? That's just mean.", "label": 1}
{"text": "You are the messed up part. Assuming you are technically an adult, you should know better. I’m sorry for whatever led to you thinking children should be held to the same standards as actual adults, but nobody, including possibly you, should be or have been held to that standard.I hope you find the help you need.", "label": 1}
{"text": "you?", "label": 1}
{"text": "Well said.", "label": 1}
{"text": "\"grinding for years\" at a feature that's only been out a couple of months. Sure, whatever.", "label": 1}
{"text": "They will have to work harder", "label": 1}
{"text": ">And given the crap catch rate that means they intentionally didn't want people catching them. What's the point of adding a new mon if they intentionally want people to be unable to catch it? \n\nThe grind. It's a game that feeds on gambling addiction. I thought we were all clear on that. If it doesn't keep us grinding it's not a fun game.\n\n>Kids need to be disappointed and learn stuff doesn't always go their way, but this is basically guaranteeing disappointment with how hard the battles were, and how infuriatingly unlike any real reward was. \n\nIt's guaranteed for everyone. Not just kids. I'm actively avoiding disappointment by waiting until they update it in a week or so like always. \n\n>If the battles were easier or more could be performed then so be it, very low catch rate. But combine super low rate with a really difficult and limited battle? That's just mean.\n\nThat's end game content. I had the same complaints about the galarian birds. You only get 15 minutes a day to possibly get one, if you get one you likely only have one chance to catch it. And now we have shinies with guaranteed catches. Just be patient. We know for a fact that these three will be back.", "label": 1}
{"text": "> I’m sorry for whatever led to you thinking children should be held to the same standards as actual adults, but nobody, including possibly you, should be or have been held to that standard.I hope you find the help you need.\n\nIt's a game. When you're a kid you lose until you win. Get good. What is wrong with you. When games were too hard as a kid I would literally just give up and come back to it later. I don't get what the issue is. Also telling somebody to get help over a video game is very dramatic. Like insanely dramatic.", "label": 1}
{"text": "It feels like they're just desperately trying to bring back that 2018-2019 craze of big groups coming together to do raids.\n\nPeople don't want to do that anymore. It's lost its charm. They need to evolve and find DIFFERENT ways to make PoGo fun and engaging, and get people to want to go out. This shit ain't it.", "label": 1}
{"text": "Personally insulting people over Pokemon is insane.", "label": 1}
{"text": "Grinding for years that you have Stardust and XL candies to power up the max moves yes. Why are you being so dense about this?", "label": 1}
{"text": "I feel for you too, bro. I’d hate to be as miserable as you.", "label": 1}
{"text": "It's literally a game. Why do you think I'm miserable because I'm playing a game at the difficulty that it is given to me? I lose in raids in the mainstream games all the time. Get over it. It's a game.", "label": 1}
{"text": "You’ve said it yourself, it’s just a game. You are you sensitive one here, nobody else. Big mad over any opinion but your own. I’m sure you do. You still deserve finding help one day.", "label": 1}
{"text": "What are you even talking about? I'm not upset. I'm not even bothered. I'm not even perturbed. I'm not even annoyed. Whatever delusion you have about whatever I'm feeling is out of this world wrong. It's a game relax. How many times do I have to say that it is a game. Why would I be mad about a game", "label": 1}
{"text": "BIG MAD", "label": 1}
{"text": "K.", "label": 1}
{"text": "If you have to explain yourself 4 ways in a single comment…", "label": 1}
{"text": "K.", "label": 1}
{"text": "\"Personally insulting people over Pokemon is insane.\"", "label": 1}
{"text": ">Sure, whatever", "label": 1}
{"text": "Yeah, just calm the eff down and swipe your credit card! Thanks for the wisdom, Niantic rep ", "label": 1}
{"text": "Absolutely nothing to do with Pokemon. Please seek help", "label": 1}
{"text": "I can already see the comment section of this one is going to be a complete and total mess ", "label": 1}
{"text": "Glad to have caught some day one Gmax mons before all the normies get in.", "label": 1}
{"text": "Not everything has to be skewed in a negative narrative. \n\nJust take it as a rare moment they listened to player base and making some positive changes.", "label": 1}
{"text": "Playing Pokémon go is for the hardcore gamers now?", "label": 1}
{"text": "Most of the player base didn’t try, they just nay-sayed from the get go and referenced some twitch streamer who apparently couldn’t get it done with 30. This one unknown source datapoint became the hivemind before the event began for most.\n\nThe majority of people who are in this thread contributing to the circle jerk simply didn’t go out and play this weekend the way that the raids were intended. I’m glad you did attempt it and I’m glad you were successful.", "label": 1}
{"text": "You’re not a hardcore gamer in go? Is someone else using your account to give competitive advice on GBL team builds and strategies over in r/thesilpharena?", "label": 1}
{"text": "https://preview.redd.it/qrk6anexekxd1.jpeg?width=226&format=pjpg&auto=webp&s=6d5b7685997bc70a4e09529e0fe5bbd35acaab97", "label": 1}
{"text": "Have you been in rural areas? The game shouldn't just be for crazy try hards and people who live in cities", "label": 1}
{"text": "Catching 167 Pokémon on a Star Piece generates stardust faster than completing a Gigantamax Battle. Terminate and completely disassociate Michael Steranka from Niantic! It is the devil.", "label": 1}
{"text": "Niantic, I have a solution.\nInclude a button to donate. After players donate a certain amount, Gigantamax Pokemon will stop spamming attacks and start receiving damage.", "label": 1}
{"text": "So you’ve been speaking from a position that has zero real world experience with the subject being discussed? \n\nGlad we cleared that up.", "label": 1}
{"text": "Yup agreed, DM Metagross is absolutely worth an investment, especially if you can get a good one. Greedent is just laughably bad.", "label": 1}
{"text": "I did. He's surprised it's as heavy as it is. Do you struggle with reading comprehension?", "label": 1}
{"text": "https://preview.redd.it/5bvkwu47iyxd1.jpeg?width=720&format=pjpg&auto=webp&s=1e6697006dc89c3e723faca7a1ebf214a6dee217\n\nHi, anyone knows why when I open PoGo app on the bottom of screen game play fine but on the superior part it's locked with last screen that I see on the app?", "label": 1}
{"text": "The litany of restored accounts after the one a few days ago says Niantic got something seriously seriously wrong...", "label": 1}
{"text": "You're doing something wrong if you need that many. Starters were regularly done with half that many or fewer.", "label": 1}
{"text": "I think this is a perfect example of investment discrepancies. I read a post that someone won a battle with 15 trainers; I read a post earlier someone won gengar with 31 people, only lost 1 Pokemon themselves but had 30 total remaining; and then this, with 38 people and all but 2 dead. \n\nI totally get why some people don’t have invested teams, but I think the “we might need up to 40?!” is just scare tactic stuff to make upset people more upset.", "label": 1}
{"text": "Read my post again and then delete your comment 👍🏻", "label": 1}
{"text": "I read it. I see nothing relevant in it. You should just delete the idiotic post.", "label": 1}
{"text": "Any nearby community meetups  so that I can get extra mp for gmax gengar?", "label": 1}
{"text": "You know none of us know where you are right?", "label": 1}
{"text": "real trainers not like the others which complain they couldnt defeat pokemon with 20-40 people.", "label": 1}
{"text": "I can fly", "label": 1}
{"text": "Reading comprehension my friend you got this", "label": 1}
{"text": "This is a no-spoofing subreddit, so fly out of here and don't cheat.", "label": 1}
{"text": "That's why I did not specify that in the post. So do you have any meet ups near you?", "label": 1}
{"text": "Hey leave me out of this.", "label": 1}
{"text": "it's a trash feature that's completely unusable for most of the community. bootlicking isn't productive.", "label": 1}
{"text": "you live in Austin? thats probably one of 8-10 cities the feature has enough active players for", "label": 1}
{"text": "I don't live in Austin anymore. But yes, Austin had enough.\n\nI live in OKC, which is still not rural but certainly not a big city. And not even OKC but a suburb of OKC. I am lucky to have a big community, I acknowledge that. And I am sorry to those who can't find a community, but honestly it feels like more people generally haven't tried and just want to complain.", "label": 1}
{"text": "people aren't even leaving pokemon in power spots near me, i'm SOL for gmax", "label": 1}
{"text": "Ok, you enjoy showcasing your mons. \n\nSome people (me) could care less about showcasing my mon. \n\nWe like different aspects of the game.", "label": 1}
{"text": "My group in a city of 100k had a meetup this morning and completed 3 gigantamax battles. These raids are not as hard as a lot of people make them out to be, especially with all the information available in this sub!", "label": 1}
{"text": "Niantic is the Boeing of game companies", "label": 1}
{"text": "Yeah, I've already gotten a 7 day and 30 day ban. I'm nervous as hell.", "label": 1}
{"text": "DM me your friend code, I'll send you a remote invite.", "label": 1}
{"text": "https://preview.redd.it/97pi0uxjqayd1.jpeg?width=965&format=pjpg&auto=webp&s=67c622e6d48b5413e27a46a7a97ddc3696cafe59", "label": 1}
{"text": "If anyone invites me to saree pikachu I’ll cash app you 5 dollars", "label": 1}
{"text": "Does it come with the smell?", "label": 1}
{"text": "If you send me a remote I’ll cash app you 5 buckaroonies", "label": 1}
{"text": "I love when they send the survey asking for feedback and I put that I’m not satisfied with the game at all, like they care", "label": 1}
{"text": "As another poster has said, you only need three gifts from each location to get your \"base set\" of one scatterbug from each place. Then it's just candy grind. Use a pineapple every time. Label them as you catch them so you aren't squinting at the tiny patterns trying to work out who they are. I mirror traded with a side account as that gives you candy for the trade as well as the transfer, and transfering during a two times candy spotlight hour gives you more as well. You can also trade for distance Pokémon, like from 7km eggs, then you get four candy for each trade. The pokecoin bounty ticket thing that allows you to open more gifts makes it go quicker. I only started playing on a new account in May, didn't even know what scatterbugs were for at least a month. I completed my vivillon collection of all 18 fully evolved a few weeks ago.", "label": 1}
{"text": "Uhhh I need that elite TM for raid attackers. This is not a solution", "label": 1}
{"text": "Yeah people had that shit figured out at launch.  Just needed a couple Charmeleons.", "label": 1}
{"text": "Dmax Excadrill would probably be the go-to with a similar setup to how Metagross was ran for Gengar, as Excadrill resists a significant portion of Toxtricity's kit by being Ground/Steel while having a significant damage advantage against it due to it's Electric/Poison typing.\n\n\nDmax Drilbur has a Max Monday on the 18th, so it's a good time to grind for some then ahead of time. Mono Ground so any of the Grass or Water starters would work to beat it.\n\n\nWithout it you'll probably have to reuse the Metagross squad or if lacking those as well, pray that Greedent can clap back (since it has a Ground fast move).\n\n\n\nAs far as build goes, should be the same Lv3 max attack with potentially also Lv3 max heal, give or take a Lv2 max shield depending on (self) assigned role.", "label": 1}
{"text": "One *of the six* of them is literally down the block. My point being, there’s not one big community soaking up everyone from around.", "label": 1}
{"text": "👍", "label": 1}
{"text": "Well strictly referring to swap logic, for me I like to swap in ways that give the illusion of panic, because some players are so eager to maintain advantage they can get played. \n\nLike if I swap to a counter after I’m countered, they have swap advantage and I’m still cooked. \n\nBut if I swap to something - say I had a Mud Slapper and Azu against your Weezing, I would go Azu because if I lost the lead matchup hard enough, you might swap Weezing out simply to preserve the counter for my lead, but my real option to kill it is still in the back. So I now know my Mud Slapper has a great matchup in the back, and I can play shields accordingly to try and trap it later. \n\n(Morpeko-Azu-Altaria also isn’t really an ABA team, they don’t share a type at all?)", "label": 1}
{"text": "Not new.  This has been happening since the launch of Max raids.", "label": 1}
{"text": "Over a week to spin ~11 stops max, if not including 300 from walking only 2km. Couldn’t do any of those?", "label": 1}
{"text": "This is a friendly PSA, there is absolutely no reason to be rude. Not everyone plays this game daily and it doesn’t hurt anyone to let others know for the future.\n\nThere’s another comment mentioning another user made the same mistake, which could have been entirely prevented had I posted about it sooner.", "label": 1}
{"text": "PSA, why you pissy over someone. Saying IKR. Get a grip.", "label": 1}
{"text": "Only one pissy here is you lol, you're insulting a person who was just politely explaining why they made the post.", "label": 1}
{"text": "IKR", "label": 1}
{"text": "You are correct and I believe your post is in spirit with the values this subreddit used to represent. \n\nAll the people trashing you in the comments is indicative of how far this sub has fallen.", "label": 1}
{"text": "I don't understand all the hate, sorry you missed out and thanks for the info. ", "label": 1}
{"text": "You are an idiot yes you can stack super rocker radar in your inventory, how do I know, I am level 50\nAnd I have been doing this since forever, what you can’t stack is team leader radars aka rocket radars.", "label": 1}
{"text": "At rank 20, do you just not downrank when losing sets?", "label": 1}
{"text": "How can I know what is my highest rank on file in Go Battle League has been? where can I see it?", "label": 1}
{"text": "I became lucky friends with my secondary account but I don't appear as a lucky friend in it??\n\nI did a raid with my personal and secondary account, and immediatly after that I got the \"you became lucky friends with...\" message on my personal account, but I didn't get it on my secondary. I tried closing and opening the game a few times, walking a bit, even tried to trade with it but I get the glimmering lucky background effect on my personal account but on the secondary it's a regular trade. This was like 30 mins ago. Do I have to wait more? We've been lucky friends before and this has never happened.", "label": 1}
{"text": "Seeing the top ten percent commenter flair on passive aggressive comments makes too much sense for this place", "label": 1}
{"text": "I appreciate the information regarding the purchased packs.\nAnd I'm not wanting to sound too mean or anything, but with adventure sync and opening the game few times per day and claiming those 300 mp's per game session.\nOne should have been able to rather easily be able to get the task done within allowed time.\n\nIt was 4km per day in two days and you would have been done with the needed 1080mp task. And if in your area were enough spots, you could have gotten your energy with interacting with them spots too.\n\nI'm not wanting to mock you or anything like that, just wanted to point out that it isn't like one needed to play the game that much and most of that 1080mp would be able to be collected passively.", "label": 1}
{"text": "Those flairs don't mean much other than i comment often", "label": 1}
{"text": "Brother you posting this is not gonna make niantic magically fix it as they could give a flying f what the community thinks or wants especially with bugs I swear. What this post will do is get dozens of sore losers hip to this “strategy”.", "label": 1}
{"text": "Brother I don’t care what you think. You might as well scrolled along rather than commenting. \n\nSub-reddits exist for a reason. Don’t like it? Block me.", "label": 1}
{"text": "Alternatively, buy an autowalker and you can hatch unlimited eggs at quadruple the speed for the rest of your life for 1/3rd the cost", "label": 1}
{"text": "what is an autowalker?", "label": 1}
{"text": "It's a way to cheat and so probably shouldn't be discussed on this sub.", "label": 1}
{"text": "Abusing adventure sync usually by rocking your phone to simulate waking so the pedometer counts steps.", "label": 1}
{"text": "An [autowalker](https://www.amazon.ca/phone-swing/s?k=phone+swing&tag=namespaceca125-20) is a device you insert your phone into, and it swings in a way that tricks your health app into counting steps. Pokemon go takes this data and converts it into steps in-game; hatching eggs, getting buddy distance, etc. Will never be detected as cheating and has infinitely better value than incubators", "label": 1}
{"text": "Thanks, Thats what I figured but I have never heard of them before. I certainly dont need something like this", "label": 1}
{"text": "Campfire is showing different things than pogo in game. Could be part of the issue", "label": 1}
{"text": "Source: trust me bro", "label": 1}
{"text": "I guess your reading comprehension is lacking as well as I said nothing about what I think just straight facts. Niantic doesn’t care how many hundreds of sob bug posts there are a day, get over it. I was simply trying to let you know all you’re doing is shooting your self in the foot as now more people will be doing this but I guess that’s too hard to understand.", "label": 1}
{"text": "Plenty of places on the thread specify all if the details. Yours was incorrect/misleading. Correcting that to make sure someone doesn't take away the incorrect understanding and they go to a response that is correct is perfectly reasonable.....", "label": 1}
{"text": "wait so if my local PS has bulbasaur I can change it to a beldum? im checking yours and the previous guys post and trying to understand the instructions.   Im still not clear on how to trigger it.\nSo i go next to PowerSpot with bulbasaur, i go into GBL and select my pokemon and pick one of my D-max beldums as one of my battle pokes and then i back out and go into the PS and it will be beldum instead of bulbasaur? im about to walk across the st to try this out but its cold and rainy so I want to know what to do lol", "label": 1}
{"text": "Clearly you have never been over to the r/wayfair  Those people are unhinged. Nothing would make them happier than nuking some popular stops.", "label": 1}
{"text": "There's a reason why people keep down voting you. But go ahead, keep talking 🤣", "label": 1}
{"text": "Oh booohoo I wasn’t aware Reddit votes changed facts, you do seem like the one to care about social media likes tho", "label": 1}
{"text": "Been posted 100 times already but thanks", "label": 1}
{"text": "They didn't even put the date in it, so...", "label": 1}
{"text": "This event looks mad good. Too bad the casuals can't handle a new strategy of battles & actual work put into the game now.\n\nLooking forward to grind this.", "label": 1}
