{"text": "!redditgold", "label": 0}
{"text": "You still could have made it work. Instead of introducing her to him, you introduce your friend to her only saying his name. Then she’d likely say her name in response.", "label": 0}
{"text": "Can’t post here without starting with tifu and as fucked up as it sounds I did fuck up. I broke the unfair rules I’m living in and now my life went from hard difficulty to hardcore. Maybe at the end of this hustle period it drops down to normal or easy, once I’ve recovered and moved on, but right now it’s just my reality that shit hit the fan because I bumped a hair trigger. All our progress is undone and she gave up. Always said what we wouldn’t stand for and none of that has happened. I can keep going until then. She can’t. Not with either:\n\nA, who she’s become truthfully, as a person who no longer needs me, which she swore would never happen “if you think I could do that, then you don’t know me and how much I love you” is what she would say if I asked whether she would ever throw me away or outgrow me\n\nB, as she has been sent into an episode by some choice she made\n\nIt’s key to know I’m not a non factor, but I am within what’s reasonable.", "label": 0}
{"text": "Tell them and don't just try to replace it. \n\n\nYou will not find one that looks exactly like the old one. \n\n\nAlso, you know ALL animals have personalities right? They will notice in a heartbeat that something is different if they ever pet and played with the old one. \n\n\n... And you trying to hide it and the finding out later is going to even make them more upset then. ", "label": 0}
{"text": "This is a really bad idea!", "label": 0}
{"text": "Download a different browser for porn", "label": 0}
{"text": "“Hey, let me get your contact info I wanted to share something with you.” Hand over empty contact card. 75% chance they fill it out for ya", "label": 0}
{"text": "Lmao, it's not when neither has FUCKING anything. \n\nDivorcing is only expensive if they both have assets which if you read the post you would see that's not the case. Shows how little you comprehend.", "label": 0}
{"text": "I know that's what I was saying to my friend but with the hamster is she didn't like being picked up but she did run up to the cage for treats and I was telling her I don't think I can just replace her. But I'm just scared with how my parents are going to react. They don't react well to these types of things. Like I know it's my fault but at the same time it's not cause the cage had no holes or gaps for her to be able to squeeze out of. My heart is saying tell them and my head is just being stupid and telling me to just buy a new one but then going through all the things that could go wrong and all the things that would go wrong if I do tell them. If that made any sense I'm still panicking", "label": 0}
{"text": "Just marry her and then pay attention when the priest says 'Do you Adamant\\_TO take \\[Insert Girls Name Here\\] to be your Wife?'.  And then you will also have the marriage certificate to help you remember in future.", "label": 0}
{"text": "🤣", "label": 0}
{"text": "But also, don't fucking joke about that with people. If Darrin were an abuser, he would take that as implicit endorsement of his abuse. It sounds like he isn't and didn't, which is good, but you never know.", "label": 0}
{"text": "Oh man, that’s hilarious! It’s like the ultimate trust fall gone wrong. I can totally relate to that panic of forgetting someone’s name after meeting them a few times; it’s so awkward! Your plan was solid, but I guess friends can sometimes have a way of keeping us on our toes.", "label": 0}
{"text": "Ah….the 3 am “Hey!  Remember that time you did this?”", "label": 0}
{"text": "Is she super controlling over chores or are you actually that incompetent? I’d be insulted if my wife didn’t trust me with something as simple as laundry. \n\nBased on your joke it may be both.", "label": 0}
{"text": "I worked in the same field and had a boss who sounds like yours. I ended up having a nervous breakdown. Take care of yourself. No job is worth your mental health and this field of work is notorious for this shit.", "label": 0}
{"text": ">You think a little Tylenol will touch that pain?\n\nDifferent people have different pain tolerances, Regardless, this is a red herring. The point of my comment wasn't to recommend Tylenol for everyone on earth in every situation. I was pointing out that there absolutely can be wrong answers for treating pain.\n\n\n\n>This isn’t a case of addiction, this is a show of how fast you can build a tolerance.\n\n\"I'm not addicted to alcohol, I consume a 32 pack per day because my tolerance is built up\". Seriously this is funny.\n\n\n\n>Look, it’s okay if you don’t want to try weed. You don’t have to. \n\nLiterally didn't suggest this anywhere in my comment. I have had plenty and I have actively advocated for its legalization.\n\n\n\n>But don’t try to tell someone with chronic pain that it’s better to destroy their organs, become addicted, or deal with side effects of other medications than to take too much weed and have social side effects instead.\n\nWhat a ridiculous strawman. I think people should treat their chronic pain with doctor guidance and methods backed by medical research. No doctor is telling you to consume 3,000mg of THC to treat your chronic pain.\n\n  \nYou seemed to have totally missed the point of my comment. The person I responded to was suggesting there is no wrong answer to treating this. I am pointing out that this is clearly untrue. This is a very simple and small claim. Doctors all the time decide some treatments are worse than others. \n\nYou decided to be dishonest and accuse me of all sorts of things I didn't say. Be better.", "label": 0}
{"text": "My dad will sometimes joke about hitting/beating my mom or us kids, but he never does it in front of strangers or people we don't know well (and I always respond with something like \"Dad, the only person getting beaten in this household is YOU when we play Uno\" (he can be quite unlucky at that game))", "label": 0}
{"text": "Yup gotta keep up with breaks regularly, they only work for a bit until you cut again", "label": 0}
{"text": "This isn't a TIFU this is an \"I'm a piece of shit\"", "label": 0}
{"text": "stuff could have gone down soooooooooo much worse. you got incredibly lucky you scumbag", "label": 0}
{"text": "You say that, but he's autistic and you're not considering that things are different for him. She didn't bother to do anything but consider her own feelings, it seems.", "label": 0}
{"text": "I presume this wasn't a situation where she didn't have many other options? Because that's about the only situation where that seems \"normal\".", "label": 0}
{"text": "Sure buddy.", "label": 0}
{"text": "Too bad she didn't press charges", "label": 0}
{"text": "You should be answerable for this somehow.", "label": 0}
{"text": "The teacher probably could have been prosecuted for sending you those images - sending porn to minors is against the law.", "label": 0}
{"text": "Plot twist, she knew it was you the whole time.", "label": 0}
{"text": "![gif](giphy|Syr2hphzdlrzcs2D3r)\n\nYea sure buddy", "label": 0}
{"text": "Post nudes or it didn’t happen.", "label": 0}
{"text": "This is not a mess up, but if anything, its a teachable moment from both sides…", "label": 0}
{"text": "https://preview.redd.it/3rjfdfjbaywd1.jpeg?width=1125&format=pjpg&auto=webp&s=a53815542cbcd223095fa3584d6147e741fa4a8d\n\nPoor women I hope your parents hate you", "label": 0}
{"text": "RIM is rolling in their graves", "label": 0}
{"text": "Narrator: It didn’t.", "label": 0}
{"text": "I... didn't say it wasn't?\n\nI just said it's not what i was talking about, because it was in fact, not what i was talking about\n\nWhy is it relevant tho?", "label": 0}
{"text": "It sounds like she wasn't understanding and didn't believe it was an accident on your part. She could have said to wait or you could have asked if you needed to follow, but mistakes were made on both sides. She acts like you accidentally saw her butthole lol.", "label": 0}
{"text": "r/coolingdowncoins", "label": 0}
{"text": "Dear penthouse, I never thought it would happen to me...", "label": 0}
{"text": "r/iamatotalpieceofshit", "label": 0}
{"text": "Mate, you sound like you're STILL in high school and fantasizing. What a clown.", "label": 0}
{"text": "Now this is a real TIFU story. I hope it gets better soon", "label": 0}
{"text": "I hope you find relief however it comes. I've had issues with opiates in the past, which started after a surgery where I really needed them. I don't recommend dealing with that. \n\nJust be aware, cannabis in high doses is still going to leave you dependant, but if it's better than whatever pain you have without them, it may be the safest way. \n\nFor me anyway, a lot of my pain issues improved as my overall health improved, so keep pushing yourself in ways that aren't medicating it away as well. I still have good days and bad days, but for me, weed helps to calm me down a lot at night and sleep normally, which really helps me and has fewer side effects than traditional sleep meds. I also switched to using a dry herb vape, which I definitely recommend. After 2 weeks or so of wanting to go back to smoking, I started getting just as high and never went back.", "label": 0}
{"text": "It sounds like you really care about your step-mom and your relationship with her, which makes this situation feel even tougher. It's completely understandable to forget a day like Mother’s Day, especially with everything going on. What might help is finding a small but thoughtful way to show her you appreciate her. Maybe you could write her a heartfelt note expressing your gratitude for everything she does and let her know she’s important to you. You could also consider doing something nice for her, like treating her to lunch or spending some quality time together. It doesn’t have to be a big gesture—just something to show you value her. I’m sure she’ll appreciate the effort.", "label": 0}
{"text": "This should be posted on ATTA", "label": 0}
{"text": "Unfortunately a plot that would have worked as a quirky 80s high school comedy.  The Simpsons already did a version when Bart gets Mrs. Krabappel to fall in love with someone he made up by answering a personal ad.", "label": 0}
{"text": "I hate flying. So, one time, I brought three 400mg candies on a transatlantic trip to help me sleep on the plane. I took one on the way over there and it was great. I fell asleep within ninety minutes and woke up in France. On the flight back, I ate one but I couldn’t fall asleep. Then, I got the munchies. I didn’t have time to grab any snacks before boarding, so in my intoxicated state I decided the other candy would work. I thought I’d just pass out harder. \n\nEventually, I started feeling nauseous from the 800mg of THC I consumed and got up to try and puke in the bathroom. Next thing I knew I was on the floor of the aisle coming to and hearing them call for a doctor on the intercom. I actually went down right next to where a doctor was sitting, and she said I was out for about 60 seconds. I came out with a skinned knee and a bruised jaw. Could have been way worse if I fell on an armrest or a person. \n\nI had to fill out an incident form with the airline and sit with the flight attendants until I wasn’t dizzy anymore. I was traveling with my family and they’ll never let me live it down. Learned my lesson. Never again.", "label": 0}
{"text": "Person puts in their phone number and nothing else.", "label": 0}
{"text": "Yep, that’s the other 25%. You miss 100% of the shots your don’t take.", "label": 0}
{"text": "The lesson of this story: Just be yourself, lying is too complicated.", "label": 0}
{"text": "These comments are wild.  From OP's coworkers (and boss's) POV they changed settings on a shared account (a bad idea but every work environment comes with bad ideas from day 1) without any explanation.  \n\nOP needs to explain their actions like they did in this post.  Which of course was a mistake, but honestly the biggest mistake is that OP has access to change settings on a group account.\n\nBut actually not like in this post, because there's a lot of pointless verbiage nobody needs to know.\n\nI think OP will find that people are more forgiving when you actually explain your actions that were indubitably a fuckup.", "label": 0}
{"text": "One box/bag of clothes? That's....not many for a whole person?", "label": 0}
{"text": "Um if you were eating this much for some challenge - stop.\n\nIf you were doing this for orgasmic tasting - also stop.\n\nGeez guys just drink a couple (if not singular glass) of juice about 1-2 hrs before.\n\nSilly boys pineapple was made for grown-ups teehee.", "label": 0}
{"text": "At least you tried! Sometimes DIY is more like \"Do It, Yikes.\" Glad it wasn’t worse though!", "label": 0}
{"text": "Not bad, I asked my parents for the hot cold spray for my upper thigh and used it, the after spray went against my ball sack through my underwear in front of my parents. \n\nI never screamed so loud, and roll in my underpants down to the bathroom to only realise that the shower does not help the situation. \n\nThey laughed hysterically", "label": 0}
{"text": "I have chronic insomnia and take edibles/smoke before I go to bed so I'm able to sleep. Well this particular night my girlfriend was dropping me at the airport hotel for a family trip the next day. I took an edible before we left our house (about 2.5 hours from the airport) and an hour into the car trip I wasn't feeling anything so I took another and by the time I got to the hotel I could barely conceptualize gravity. The short walk thru the hotel lobby to the elevator was the scariest moments of my life. I walked by two cops on their break and I was convinced that they were gonna see me, know, and arrest me on the spot for public intoxication.", "label": 0}
{"text": "He said he was 18", "label": 0}
{"text": "It's that colorful stuff in little cans, it's soft and pliable and kids like to play with it", "label": 0}
{"text": "Didn’t happen", "label": 0}
{"text": "Yeah but he’s a 22 year old guy. I’ve met several 22 year old guys that could fit their entire wardrobe in a single box tbh.", "label": 0}
{"text": "That was my thought because something fairly innocent and joking snowballs quickly.", "label": 0}
{"text": "OP said he was 18. That said, OP is also a piece of shit", "label": 0}
{"text": "It's not actually that difficult. I've done it more than once by accident just by accidentally tapping out of a popup on Google photos. It's weirdly aggressive in its tactics to get access to your photos and start backing them up. Plus... Have you never ever transferred photos to a new phone from an old one? Wdym how do you have old photos on a new phone?? lmao", "label": 0}
{"text": "We lived by that in the military, both KISS and Assume - makes an Ass out of U and ME. \n\nYou’re alright, you didn’t mean any harm and your intention was in the right place. TBH- I have been in the same boat, and made the same mistake in the past. \n\nIt essentially comes down to what mental state do you want to promote within the people you talk with. \n\nIf I offended while I’m speaking to someone, I just apologize. But if I’ve left that situation and it’s been a week, I wouldn’t mention it again unless she said, you stared at my boobs last week and I didn’t appreciate it. Then I’d just say, “I know what it looked like, I understand your perspective and I’m sorry as that wasn’t my intention.”", "label": 0}
{"text": "That sounds super stressful, and honestly, it feels like your work environment is really toxic. You did nothing wrong by trying to fix the backup issue. Maybe it's time to start looking for a better place that respects your time and privacy.", "label": 0}
{"text": "Hi everyone my ex wife just came back to me last week after using a love spell by https://www.instagram.com/spellcasterunity?igsh=MXhoMzYwcWthY21kbA==. never thought this would work but it did and am so grateful.", "label": 0}
{"text": "You may still be able to recover all your photos, Google drive doesn't actually delete them immediately but moves them into the trash folder for something like 30 days before actually deleting them. You could download all of them and then just upload to your personal account. You can also speed up the delete process at this point if you want.", "label": 0}
{"text": "That still sounds fun", "label": 0}
{"text": "If it helps, my idiot orange ate at least 4 feet of ribbon before he was a year old. He’s currently 9. We _hope_ we got all 4 feet out, but can’t be sure since it was kinda just… pulled out the front when he was coughing. Then after that piece broke and he started eating again… pulled out the back.", "label": 0}
{"text": "That... wasn't my point, though??? My point is that it's creepy that even paid so much attention to her appearance in the first place. If it's relevant or not is well. Irrelevant to me.", "label": 0}
{"text": "You might have an over-sensitivity to thc. People forget that each individual organism reacts differently to the substances it consumes. Much of the time, the difference is small, but sometimes...\n\nI have a family member that gets knocked out ambien-style whenever she takes more than 250 mg of tylenol. Biochemistry is tricky sometimes.", "label": 0}
{"text": "Lolol. Ive had people pull hard and not stop on my door till I opened it. A person jiggling the know then going away would be weird but not concerning. I'd assume you were drunk or high.", "label": 0}
{"text": "So this movie is basically a kids bop version of Weekend at Bernie's?", "label": 0}
{"text": "If you ever find yourself in this situation, all you have to do is to break your arm and get a cast and hope they have a legible signature. Apparently they don't use casts anymore for arm breaks but if you explain your situation to the doctor I'm sure he'd make an exception.", "label": 0}
{"text": "It's wild that you think you can berate me for being disconnected from reality while you apply toddler logic to all of life's problems 🙄", "label": 0}
{"text": "So, it feels like people throw around the term addictive very casually, without realizing that it covers two different things: physical dependence and psychological dependence. They are interrelated, but 2 distinctly different things.\n\nIs weed addictive like heroin or alcohol (physical dependence that results in serious and potentially life threatening withdrawal symptoms)? Absolutely not. Not even close. There is no evidence of physical dependence or withdrawal with cannabis use. \n\nCan someone develop a psychological dependence on weed? Absolutely! But one can develop the same dependence in sugar, porn, external validation, even exercise. VERY different meaning to the term \"addictive\" in this context.", "label": 0}
{"text": "I can smoke a few grams  going slowely and build up tolerance, the first Joint after a few days clean is where it gets tricky.", "label": 0}
{"text": "A room just for sex? In this housing market?", "label": 0}
{"text": "I thought the tifu was going to be sharing the Pic to colleagues with the mouse jiggler fully obvious.", "label": 0}
{"text": "Our cat once ate Christmas tree tinsel. We didn't even know until she ran around the house with a gleaming silver glitter strand hanging from her butt. She looked very surprised when I pulled it the rest of the way out. (She's fine.)", "label": 0}
{"text": "So what you’re saying is that it’s better to work with dead people rather than with toxic coworkers", "label": 0}
{"text": "I work at a metal foundry. There's a lot of potential for crushing or dismemberment.", "label": 0}
{"text": "From one funeral director to another… get out while you can and it will only get worse. DM me if you want some advice. I’m happy to help. I may even have connections where you are.", "label": 0}
{"text": "Oh well!\n\nRespectfully, you might have a lot to gain by losing weight. 5'10\" @209lbs is obese, @290lbs you're well beyond just \"kind of fat\". Best of luck.", "label": 0}
{"text": "I referred to a girl as \"the hot blonde girl\" for a few weeks because I couldn't remember her name and it felt weird to ask.\n\nWe've been married 16 years now.", "label": 0}
{"text": "people are going to talk if you keep behavior like this up. sorry. \n\nbut you still have some wiggle room. try to not make stuff like this happen too much more often. \n\nright now, it's an isolated incident. don't let it become a pattern", "label": 0}
{"text": "> upgrading or updating this is so cost and time prohibitive that we cannot do it right now\n\nthay say this for 5 years and they say \"why is it gonna cost 6 figures to replaced the wifi!\"\n\nwell its because its 5 years out of support, the controllers are fucked and now instead of a staggered upgrade over months/years you need to do all at once or you have no wifi across all sites.", "label": 0}
{"text": "\"For context, my work account is shared between everyone in the office so everyone has access to it. \"\n\n\nI understand that it's a small company, but this is a highly irresponsible and piss-poor practice. Maybe something like this made sense 20 years ago, but there are better and easier for ways to collaborate these days.\n\n\nIn fact, account sharing like this is such a bad idea, that they have to be hopping through a lot of hoops and inconveniences just to keep that working at all.\n\n\n\nBased on that alone, I would argue that you should feel zero remorse for anything you do under that account so long as it's not with malicious intent.\n\n\nThis was gonna happen eventually. You just happen to be the first one to step in it.\n\n\nI know I'm making a lot of assumptions here, but I feel pretty confident on this one  based on even just the few pieces you've provided.", "label": 0}
{"text": "That's not the problem, though. Heck, initially she didn't even mind! She engaged in conversation excitedly. Even if you didn't mean to, it's very likely you just dozed off and stared at her breasts, which would obviously make her uncomfortable, and she had every right to feel so. Obviously, i haven't lived with constant chronic pain and i can't even begin to understand what it's like, but you've still brought upon yourself, as unfair as it is. You need to take accountability, dude.", "label": 0}
{"text": "It's not just the necklace you mentioned in the post, though. You analyzed her throughrouly. Even if unintentional, that's still creepy as hell.", "label": 0}
{"text": "I swear I've heard this story before, but I have no doubt that this has happened more than a few times with other cats.", "label": 0}
{"text": "I honestly took a while to realize too but i'm pretty sure it's a bot", "label": 0}
{"text": "Yup... did the same with a soldering iron once and once only.", "label": 0}
{"text": "You and the 60\" sandwich guy should hang out", "label": 0}
{"text": "Did she take your name and is now known as \"Mrs. Hot brown hair guy.\" ? \n\nHow did you finally find out her name?", "label": 0}
{"text": "This STILL happens to me with clients. Lol", "label": 0}
{"text": "You said it better than me.  I had something very rude typed out about the 'kind of' language used.  \n\nThat being said - I'm a good 100lbs lighter than OP, and I could easily have polished off 20 wings.  If it were there, and nobody was saying anything, I'd have done the same thing.", "label": 0}
{"text": "what would you do if they had put out a 6ft hero?", "label": 0}
{"text": "I will take the downvotes with pride. The world needs to know. This madness needs to stop.", "label": 0}
{"text": "20”", "label": 0}
{"text": "GEE, I just checked what 290lbs is in normal people units. That's well into Class 3 obesity (that's the highest there is!), having worked with people in that range quite frequently - they have all been bed ridden and on oxygen before they've even been 60. \n\nNot-so Fun fact for OP only 1.8% of adults are in Adipositas Level 3/BMI 40+.", "label": 0}
{"text": "> For context, my work account is shared between everyone in the office so everyone has access to it.\n\nTIFU by agreeing to put this dumpster fire on my phone. I bet it's not even a proper work account either and just a gmail account.\n\n>  I have no more photos on my phone since It wiped them from the DCIM file too. I am really sad about the loss of all my photos but I guess that's the price I have to pay. \n\nWere they not in your own google photos from before you got a new phone?", "label": 0}
{"text": ">  My point is that it's creepy that he even paid so much attention to her appearance in the first place\n\nI quite literally just addressed that exact point.\n\nWhy is it \"creepy\" that he paid attention? Exactly how is that creepy? If you can't explain this very, very well, I would suggest you refrain from using the word creepy. \n\nIf you somehow define someone noting interesting things about a person's appearance as creepy, you're the problem. Like what the fuck lmao. That's insane to call creepy. It's an everyday occurrence for fuck's sake.", "label": 0}
{"text": "Entitlement of the owners, certainly", "label": 0}
{"text": "https://www.reddit.com/r/AmItheAsshole/comments/ca7bdz/aita_because_i_ate_more_than_my_share_of_a_6_foot/", "label": 0}
{"text": "lmao.  Refused the knife?", "label": 0}
{"text": "Aren't those just chicken nuggets?", "label": 0}
{"text": "I will never forget that one", "label": 0}
{"text": "Yup. You put your mouse on top, then the circle with the color pattern spins at different directions and speeds to make it look like the mouse is being moved.", "label": 0}
{"text": "[https://www.youtube.com/watch?v=3kIQqo1ZwEE](https://www.youtube.com/watch?v=3kIQqo1ZwEE)", "label": 0}
{"text": "For sure. If I hadnt seen that sign, at 6’0” 175lbs of muscle- I’m fucking devouring 20 wings doused in bleu cheese. What the fuck else am I at the company event for? Need my protein for the day homies.", "label": 0}
{"text": "yes she was a runaway from an abusive home life, my mom was one to take in strays. but I think her living with us should’ve given me a few passes to hang out with my friends", "label": 0}
{"text": "General LPT, don’t relax at any work function, you are always being judged. Sorry but that’s the truth, even at places where “it’s like family”, maybe even more so. Don’t over drink, don’t overeat, don’t overshare. You may actually get 1 or 2 people who become true friends (if you are lucky!) but only relax in the friendship away from the workplace.", "label": 0}
{"text": "I’m 6’4 and 200 lbs, I’m fat , all those fuckin cheese curds lol, gained 20lbs in Wisconsin in 3 weeks", "label": 0}
{"text": "I have a weird ick about food. Watching someone grab 20 wings at an office meal thing would gross me out kinda.", "label": 0}
{"text": "Link, for those of us that haven't encountered this one yet?", "label": 0}
{"text": "Lol same here, though with my college drinking days behind me it doesn't happen as often", "label": 0}
{"text": "\"kind of\" nah you are fat at that point", "label": 0}
{"text": "No...? Actually, it isn't a everyday of occurence? I think this says some things about you", "label": 0}
{"text": "Definitely, it is very common for our beloved previous generations to make this ridiculous mistake in judgement.", "label": 0}
{"text": "They make us look at them and envisage them 🤢", "label": 0}
{"text": "My partner had maybe a small laundry basket worth of clothes when we met. For our first several dates they had to buy new clothes.", "label": 0}
{"text": "[Guy eats 4ft of 6ft party sub](https://www.reddit.com/r/AmItheAsshole/s/ytQYOEsqzJ)", "label": 0}
{"text": "RIM made so much money they don’t have to turn a profit for the next 200 years.", "label": 0}
{"text": "I got my wisdom teeth out the day before Thanksgiving when I was in college. The idea was to have it done while on break and before I lost my parents’ insurance when I graduated. That was a rough meal. You’ll have the story years from now, so there’s that.", "label": 0}
{"text": "Actually currently you're at 3 upvotes", "label": 0}
{"text": "Stuffing your face makes you horrible. The sign is irrelevant. Obesity is horrible too", "label": 0}
{"text": "There are non obese people in the comments who said that they would easily polish off 20 wings.", "label": 0}
{"text": "Ouch, that's bad timing. \n\nI only had three days: cutting out 90% of my diet, cutting out 90% of what was left, and then the day of rinsing out my colon. \n\n\nAbsolutely vile, that cleansing stuff.  So hard to keep down. \n\n\n10/10 would recommend to anyone of the appropriate age. Let the docs snip out the stuff your body is better off without.", "label": 0}
{"text": "Obese people doing obese people things 🤷🏻‍♂️ that’s why he’s massively morbidly obese", "label": 0}
{"text": "My 5'7\" 125 lb boyfrind could polish off 20 wings pretty easily.", "label": 0}
{"text": "Couldn't torture me for this confession of gluttony.", "label": 0}
{"text": "You’re wholly missing the point here. And why is your boyfriend so tiny?", "label": 0}
{"text": "That’s fucking rude", "label": 0}
{"text": "Dude I’m 5’10” and 200 lbs and I’m “kind of fat”. Not trying to be a dick but you really need to start being honest with yourself. 290 is very unhealthy", "label": 0}
{"text": "Yeah I’m 5’9” 235# and consider myself very fat lol", "label": 0}
{"text": "Only crappy nuggets are pressed. Other nuggets, like Chick-fil-A are just bite-sized pieces of meat.", "label": 0}
{"text": "I am dudes same height and literally 50% of his weight", "label": 0}
{"text": "My enemy, my friend 🤣", "label": 0}
{"text": "Don't have any arguments to make or just not any better than a toddlers?", "label": 0}
{"text": "Odd. I haven't seen a 5 day prep before. Most of the ones I have seen have you on clear liquid diet the day before then you take golytely the night before. Might ask the doctor performing it if there is a different prep strategy for you.", "label": 0}
{"text": "Interesting! I don't eat much fast food so I wasn't aware.", "label": 0}
{"text": "A 5-day diet for a coloniscopy? When I had mine it was, at most, a 2-3 day prep regimen with the appropriate pills, etc. to help get the job done.", "label": 0}
{"text": "My target! Down from 230 to 180", "label": 0}
{"text": "Can confirm. I’m only a bit bigger but in the mood I will fuck up a 20 order.", "label": 0}
{"text": "Yes, but those could more accurately be described  as “breast meat chunks” or something similar. A nugget almost exclusively refers to ground chicken.", "label": 0}
{"text": "Anything super sugary like chocolate was tastable for me.", "label": 0}
{"text": "5'10\" 290lb 'kind of fat' \nhttps://youtu.be/rjifMGvqres", "label": 0}
{"text": "Nice! Congrats! I was 210 about 7 years back, lingered around 180 for a long time before getting down here the last 3 years", "label": 0}
{"text": "Even smaller airports have TSA", "label": 0}
{"text": "Yeah their back teeth are slicing teeth, meant to chew tough meat from a carcass. Only takes one or two bites to slice something like that ribbon. My cat chewed in half some yarn I was knitting with when I stepped away for a moment. The next day a bright yellow addition to her poop told me she had actually eaten some of it and I had been extremely lucky! Now I do not entertain the playing with any sort of easily sliced string or ribbon haha\n\nGood luck!", "label": 0}
{"text": "The only thing I would have had to do 5 days in advance was cut out any medications that they listed. Don't remember what those were since I didn't take any of them. Think it was blood thinners. 2 days out was no red food coloring, such as drinks or Jello. Prep the last day.\n\nI think OP did not read their instructions.", "label": 0}
{"text": "I saw a post a few years ago about someone losing their sense of smell to covid and they got it back eventually after using aromatherapy. Maybe you could try that.", "label": 0}
{"text": "I ate like a raccoon with a tapeworm is an expression I never knew I needed.", "label": 0}
{"text": "Thanks!", "label": 0}
{"text": "I lost it at double plus unfood", "label": 0}
{"text": "I've heard that cheese pizza is one of the few things people are able to taste after losing their sense of smell to covid. \n\nI also remember reading there is a sense retraining routine of smelling peppermint oil and other things that are supposed to help regain your sense of smell faster", "label": 0}
{"text": "Wow you must be incredibly unlucky because loss of smell has been an incredibly rare symptom for years now. I think it was down to less than 6% of cases back in 2023.", "label": 0}
{"text": "I just pulled out the instructions.  Quoting....\n\n--------------\n\n**5 Days before your colonoscopy**\n\n*DO NOT EAT ANY FOODS THAT ARE DIFFICULT TO CLEAN FROM YOUR COLON SUCH AS:*\n\n[List of all sorts of yummy foods.]\n\n**1 day before your colonoscopy**\n\n*You will be on a liquid and clear diet. DO NOT EAT ANY SOLID FOODS.*\n\n[Details that includes a list of stuff that doesn't really qualify as food.]", "label": 0}
{"text": "God, my partner got covid and I hid in my room for 2 weeks and didn't go near her without a mask. \n\nWorth it apparently.", "label": 0}
{"text": "If you have an android, please set up your separate work profile so that Google services separate all information.", "label": 0}
{"text": "I'm vaccinated, so I imagine it must have been a gnarly strain.", "label": 0}
{"text": "Have you tried any traditional Indian (dot, not feather) dishes?", "label": 0}
{"text": "I don’t think you need to be told you dodged a bullet or those are red flags. I think you need to know that the last 5-7 years was not a waste of your life and that there was meaning to the relationship! Loving someone is almost always worthwhile. Love is always important unless there is abuse in the relationship and I don’t get the idea that the relationship was abusive.\n\nYou said your girlfriend came from a tough past so maybe her past was more than your relationship could overcome!  That isn’t on you and that isn’t on her. It doesn’t mean you were right for each other but also doesn’t mean you were wrong for each other. It probably means she was too damaged to have a healthy relationship! \n\nLove is almost always worthwhile because it helps us grow and changes us into the person we are. I’m sorry you are grieving the end of your relationship! Take time to grieve and recharge before jumping into another relationship! It is important to take time for yourself and focus on what you need to heal!", "label": 0}
{"text": "I cook more Indian and SE Asian food than most anything at home. But it's only been a day.", "label": 0}
{"text": "When I lost my sense of taste, I could still feel spicy foods and cool foods. Everything I ate contained hot sauce, peppers, or mint. I figured some sensation was better than none.", "label": 0}
{"text": "I was worried it wouldn't fly 😅", "label": 0}
{"text": "I and my cat owning family members never put loose tinsel on our Christmas trees because cats would eat it and one Christmas my third oldest brother's cat ate and ended up with a big ball of tinsel in his stomach and had to go to the vet. Big b vet bill for Christmas.!!.", "label": 0}
{"text": "Had to do the same once with packing tape. After I caught her running around in a panic leaving a trail of shit everywhere.", "label": 0}
{"text": "You paid the porcelain price*\n\nFixed your tldr", "label": 0}
{"text": "Hi! I also completely lost any tasting ability during covid, but purely by chance I was regularly taking turmeric for inflammation. Come to find out the curcuminoids found in turmeric can help you regain your sense of smell and taste! Now I'm back to enjoying food, and I hope you will soon too.", "label": 0}
{"text": "So having an attention to detail is creepy? I feel that could be interpreted as judgmental.", "label": 0}
{"text": "I’m a veteran of 18 colonoscopies and counting. Next one is on the docket in mid December to slide in 2024’s insurance before the deductible resets. \n\nWhat would you want to eat that you think you shouldn’t? Turkey, stuffing, mashers all seem to be okay. I would maybe lay off the cruciferous veggies but that might be it.", "label": 0}
{"text": "Go to an ice cream factory and smell their dumpster, it fixed my nose and taste buds after one wiff", "label": 0}
{"text": "I cook with turmeric pretty regularly, so here's hoping.", "label": 0}
{"text": "Which seems not so bad, but I felt miserable.  Besides, I love stuffing and basically only had it on Thanksgiving growing up. Even that was too much.", "label": 0}
{"text": "Hey Costanza, \nThe farm called... They're running out of boneless chicken wings.", "label": 0}
{"text": "I think you should apologise to ...someone? A few people? That's pretty bad of you.", "label": 0}
{"text": "That’s average in America. Source: am American.", "label": 0}
{"text": "Same height and weight here. Down from 255. Still fat, but not as fat as I used to be.", "label": 0}
{"text": "Gross don't eat rubbish", "label": 0}
{"text": "stage 3c colorectal cancer survivor here.  do what needs to be done.  you don’t want to go through what i have been through.", "label": 0}
{"text": "This was normal in grad school. I’d go to as many graduate seminars as I could for the food. “Pizza? Sure I’ll sit thru a presentation of oxalate decarboxylase! “", "label": 0}
{"text": "Have you tried adding sugar to the marzipan?", "label": 0}
{"text": "Great advice, and very well-said\n\nI'm glad this is the top comment", "label": 0}
{"text": "Agree!  My son has UC and has had many colonoscopys.  The instructions have always been the day before eating solids, before that he can eat whatever.  I think the no solids day before is because you are about to explode the toilet anyway.", "label": 0}
{"text": "I lost my sense of smell only for it to be replaced by the constant nauseating aroma of paraffin. A course of steroids brought it back rapidly though.", "label": 0}
{"text": "Different prep my guy, my last several had no such instructions.... a few days and clear liquid and the special prep to clear out......", "label": 0}
{"text": "This post is pure artistry. Thank you.", "label": 0}
{"text": "OP go buy some essential oils for scents you specifically know in your brain what they smell like. Then multiple times a day just open them and smell them while trying to remember that specific smell. \n\nYour nervous system kinda got wrecked by COVID since it's neurotoxic along with a bunch of other shit like hepatoxic. You just need to get your synapses re-firing and research during and after COVID, along with multiple personal anecdotes of the effectiveness of this show it works. Basically like kick-starting an engine just trying to reconnect and refire everything it should help slowly heal your sense of smell.\n\nIf you want me to try to find some research I can but I know this because my wife does medical journal summaries for her job in academic writing on new research and she's seen a couple studies on this. So she's recommended this to a couple friends it worked really well for.", "label": 0}
{"text": "I don't think you should say that with such certainty, since you don't know for sure\n\nI guarantee you there are *plenty* of cases of someone going through a divorce and finding someone else a few months later", "label": 0}
{"text": "Or it came back normally and aromatherapy has zero evidence it does anything except smell nice.", "label": 0}
{"text": "I hope you don't have a leech in your nose.", "label": 0}
{"text": "Weird, just had mine in July and just now double checks the orders.  The only thing I had before prep day was to stop certain meds 5 days before and no seeds the day before prep.", "label": 0}
{"text": "This.  Eat a light dinner on Monday, liquids Tuesday AM, drink satan’s shake that evening, and colonoscopy Wednesday morning. Go to a local Chinese buffet afterward. Thats it.", "label": 0}
{"text": "Champ. Just call everyone champ and you’ll be fine.", "label": 0}
{"text": "Sounds like you really wernt kidding about giving you the 36\".. My guess is they want to check your descending and transverse colon.", "label": 0}
{"text": "It's not a real eplacement for a colonoscopy. It can only detect certain things, and is not reliable at seeing all the polyps in there. Not only that, but they'll lance them polyps right off while they're already in there with the scope. \n\n\nIt sucks, but it's only a couple annoying days like every 10 years. ", "label": 0}
{"text": "lol six is an appetizer. NTA", "label": 0}
{"text": "18 colonoscopies!  Do you take out the scope when you poop?", "label": 0}
{"text": "Same here. They advised easily digested food 2 days prior, because it'll be easier to pass when ya start the \"mega flush\" phase 1 day prior.\n\n\nOP, you should be able to eat your Thanksgiving dinner just fine. Call your doc back and ask wtf.", "label": 0}
{"text": "It's basically no high fiber, nuts, etc for 5 days and stop any anti-coagulants, e.g. blood thinners, aspirin, etc.  Turkey and dressing are not high fiber.", "label": 0}
{"text": "I feel like people are being too harsh on you here (and you on yourself), so if it makes you feel any better: [at least you didn’t eat the whole plate of foie gras at a fancy Oscar party like this dude.](https://imgur.com/a/B8WYoW6) 😛 Try not to sweat it.", "label": 0}
{"text": "My #1 tip is when you drink the prep, chug like it's a beer and you are still in college.  Minimize the amount of time that stuff touches your taste buds.", "label": 0}
{"text": "I’m 6’2” and 195 and still have a muffin top and a belly. I’d need to lose 15lbs to be considered a healthy weight.", "label": 0}
{"text": "When I had the VID the only thing I could taste was the \"cherry\" chloraseptic spray I gargled to help with the pain and coughing.\n\nI'd really try to get it as far back as I could without aspirating it or throwing up. And it'd help for about an hour or so.  \nBut it tasted so damn horrible\n\nLuckily my taste and smell came back fairly quick and to the intensity I remembered. Though I never got to try out if I could eat foods I normally would find nauseating.  \nI *really* wanted to bite into an onion but I just couldn't get my hands on one for the two weeks I quarantined.", "label": 0}
{"text": "Because that's just how he is?", "label": 0}
{"text": "I scrolled to the TL;DR and read it as: \"I ate a raccoon with a tapeworm...\"", "label": 0}
{"text": "Relax. He had to have been totally weeded when he was stoning on those 150 ghz of devil lettuce.", "label": 0}
{"text": "Comeback story baby", "label": 0}
{"text": "Pecan pie.  The single greatest food known to man... but \"no nuts\".", "label": 0}
{"text": "I get it. I’m a pumpkin girl so that didn’t hit my radar.", "label": 0}
{"text": "Made the mistake of ordering McDonald’s while I had covid. It all tasted like sewage.", "label": 0}
{"text": "In thought this was going to be a 'I burned my mouth with spicy foods trying to taste'-story...", "label": 0}
{"text": "![gif](giphy|qCYhluUkMJX8c|downsized)\n\nRACCOON MEAT", "label": 0}
{"text": "Just have your pecan pie the day before, so you can get your fix. 😉", "label": 0}
{"text": "Interestingly, ham is still about the only thing that has any flavor for me. I can tell sweet from bitter etc, but not flavors... Except ham", "label": 0}
{"text": "I remember when me and my husband had covid.  The evening after symptom onset, we spent a good time shotting various alcohols to see if we could taste anything.\n\nWe couldn't.  It was weird feeling the sensation without the taste.", "label": 0}
{"text": "Wow that's really rude. You just told them that you didn't give a fuck about them and didn't care about them. I just think that's such a mean, hurtful thing to say.\n\nWhy would you do that? Of course they won't ever want to see you again if you say that.", "label": 0}
{"text": "Some of these comments ... like you're really going to go to the entero and say \"I know you said 5 days, doc, but all these people on Reddit said 24 hours was plenty, we're still good to go right?\"", "label": 0}
{"text": "Avoid it any way you can. I caught it visiting my parents for my Dad’s birthday in the middle of September after dodging it for all these years.\n\nIt is so much worse than a regular cold. I can honestly say it was the worst sickness I have ever had. A really nasty flu is more intense, but gone in 2-3 days. This was a solid 20+ days of my nose being absolutely locked shut. My lips started to split from mouth breathing at night. The cold, shivery aches lasted the first week and then after that it was just like having a faucet attached to my sinuses.\n\nSame as OP, no sinuses means no tasting anything.\n\nI honestly thought it would never end. I actually punched a dent in an aluminum folding table I have set up for work overflow because I was just so overwhelmed with frustration and rage from being plugged up all the time. I had a huge garbage can FULL of wadded up tissues from pointlessly blowing my nose all day and I just freaked out a bit.\n\n0/10 would not recommend to anyone", "label": 0}
{"text": "I'm a 5'8\" 135lb woman. I could easily put away 20 boneless wings and feel satisfied. Not even full. 6 is a joke. You guys need to ease off the poor guy. You're fine OP. I guarantee they still threw some away.", "label": 0}
{"text": "Nah, he's fine. He doesn't have to compensate for anything.", "label": 0}
{"text": ">This also means I can't taste a thing\n\nThis notion isn't true. You absolutely **can** taste with no sense of smell.\n\nI experienced this myself when I had Covid - smell was completely gone, but taste was (miraculously) unaffected.", "label": 0}
{"text": "But what if he needs to defend you? You’re fucked 😂😂", "label": 0}
{"text": "I have a friend who swears that they got their taste back after covid by taking one too many weed gummies, just a thought.", "label": 0}
{"text": "My prep was pills and water. I think it was two cycles of 12 pills (taken over 30 minutes) about 3 hours apart. No gross prep drink. No enema. The only discomfort was being full of so. Much. Water. I don’t remember what they’re called but I HIGHLY recommend this method.", "label": 0}
{"text": "That got me tickled, but what really made it was paying the iron price, like aeron greyjoy would clap them on the shoulder in commiseration", "label": 0}
{"text": "Yup, I'm stealing this one. ", "label": 0}
{"text": "I had a similar TIFU after covid (fortunately my senses all came back eventually). I took to dosing everything with industrial quantities of hot sauce just to feel alive. I didn’t expect it to result in a significant tolerance to capsaicin. As my senses came back I had to taper myself down to human levels to get the rest of my taste buds to work. I can still tolerate a lot more heat than I could. We’re talking a couple of tablespoons of Louisiana Crystal sauce in 8oz of tomato soup is my new baseline for enjoying it.", "label": 0}
{"text": "My wife, who works in the medical field, scheduled a colonoscopy.  When she inquired who the anesthesiologist was, she learned it was her boss.  Let’s just say she rescheduled immediately.", "label": 0}
{"text": "Have your pie on Wednesday.  Or buy another one the following week and you don’t have to share.", "label": 0}
{"text": "That usually l just means things like corn and peas and beans and other vegetables with hard to digest skin.  What was on the list, exactly?", "label": 0}
{"text": "My wife got it year and half ago and never got her taste back.", "label": 0}
{"text": "Aside from the rude and nasty comments about your weight, (which is *none* of their god-damned business) it was an honest mistake. Mistakes happen. Hell, I would've done the same thing too tbh. Wings are delicious! ", "label": 0}
{"text": "Yeah. Those are rookie numbers", "label": 0}
{"text": "I just had covid for the first time and lost my sense of smell on and off for about 4 days. \n\nI hope yours comes back soon! I was shoving my nose in the peanut butter jar and a lavender sack trying to get some sense memory to work itself out.", "label": 0}
{"text": "Yeah 180 seems to be the line my body wants to hold at! Trying to increase muscle mass now to push through. And run. Running is hard haha", "label": 0}
{"text": "This is a tip I am keeping for my son. Thanks!", "label": 0}
{"text": "I lost most of my smell and taste as well, cherry Dr. pepper and sweet tea from cans and chick fila I can taste. I know something is bad when you can smell just fat oily substance but people with say it stinks or pungent. Rarely do I enjoy food anymore", "label": 0}
{"text": "Every guy is looking at porn. People should just stop being so shy about it.", "label": 0}
{"text": "Hey OP, I dealt with the same thing back in 2022. Got Covid in November and my smell disappeared for months. It took a visit to an ENT and a prescription for a new drug called Xhance for it to return. Sorry if this sounds like a drug ad, but it really helped me and it might be worth looking into if your smell issue persists.", "label": 0}
{"text": ">avoid it any way you can\n\nI agree with this. Thankfully, this was not as bad as when I got pneumonia some years back. But it is no fun.\n\nIf you are vaccinated, your symptoms are typically going to be lessened. But I'm also 5 days into it and wishing I had just quit my job so I wouldn't have to work for a while longer. And my nose feels like I've been sniffing glue all day.", "label": 0}
{"text": "On Android you can side load it to keep work stuff work, private stuff private. Most people don't. But I know on iPhone it's an absolute nightmare for MDM.", "label": 0}
{"text": "HOLY SHIT I thought the tldr said you ate a raccoon with a tapeworm and I was so concerned 😭", "label": 0}
{"text": "Even if they’re boneless, I can’t help but count how many birds were slaughtered whenever I eat more than 2 wings.\n\nBut how did you miss the sign if it was posted at the beginning of the line?", "label": 0}
{"text": "6 wings for a meal? Please thats an app.", "label": 0}
{"text": "There’s something you can do called Smell Retraining Therapy. Hopefully it won’t come to that, though!", "label": 0}
{"text": "I have all sorts of issues, and mine is only 2. No seeds, nuts, etc.. But I could have a great Thanksgiving without nuts and popcorn.", "label": 0}
{"text": "While I was succumbing to mild hypochondria, I came across a case study this morning of it returning spontaneously in a person 2 years later. There may be hope.\n\nA lot of people are suggesting aromatherapy, both in this post and elsewhere in the medical profession.", "label": 0}
{"text": "No corn, no broccoli , eat pecan pie, but scrape off the top layer of nuts", "label": 0}
{"text": "Clearly AI post.", "label": 0}
{"text": "So business as usual? 🤣", "label": 0}
{"text": "I was all up to date on the vaccine and boosters. It didn’t really get into my lungs at all, so I was never scared of it. I had some phlegmy coughs but it never really took hold. \n\nSo for that I’m very grateful. I’ve never had a bad case of pneumonia yet although it almost killed my Dad when I was a kid (Rheumatoid Arthritis). \n\nIt was just psychologically brutal. I feel like a baby just saying that but this all happened less than a full month ago for me and looking back on it, it really was bad. I think the thing that got to me the most was feeling like a deep, good rest did nothing for me. In the past any time that I’ve been sick, if I really go into rest mode and get a solid 18 or 20 hour sleep in, I always would feel a little bit better. I could always feel the benefit.\n\nWith Covid I would get massive sleeps in back to back and wake up feeling as bad or worse. It just beat me down over those weeks.", "label": 0}
{"text": "Cat's out of the bag.  Teachers talk shit behind closed doors.", "label": 0}
{"text": "The article I read from Harvard Medical this morning suggested it is actually cellular damage with no neurological link, but it was written in 2020 and I haven't followed up with anything more current.", "label": 0}
{"text": "Vodka, I took a swig of vodka when I couldn't taste anything to see if it made vodka drinkable and suddenly my taste came back.", "label": 0}
{"text": "I'll hit the cart when my lungs are a bit less raw.", "label": 0}
{"text": "Eat on Thanksgiving and let that be ur last meal.  My hubby was spoke to b 5 days but he didn't start till 3 days.  You will be fine.", "label": 0}
{"text": "I appreciate the use of Newspeak", "label": 0}
{"text": "Took me three months to get scent back.\n\nThen everything smelled wrong and bad, like a single awful scent, for about a year. Mine was carpet cleaner. I know because we’d had the carpet cleaned the day before scents returned, and I was the only person who could stand to be in the house that day. Even fresh clean steam smelled like it.\n\nI started using dollar store cough drops of various flavors about three months into the wrong scents, to anesthetize my nasal nerves, and it helped. I could differentiate the different flavors within a month. It still took the better part of the year to get everything back to normal.\n\nGood luck.", "label": 0}
{"text": "I'm not? You've lost your taste as well as your smell. However, you haven't lost your taste *because* of your smell. Anosmia and ageusia are distinct conditions.\n\nAnd if you're going to take that tone, as a (supposed) chef, you should know this rather basic fact.", "label": 0}
{"text": "I'm 6'1\", 250, I'm not embarrassed to eat food that is served.  Screw them.", "label": 0}
{"text": "I'm so sorry, I can't stop laughing.\nmy bad🤣", "label": 0}
{"text": "It’s a screen.  If it doesn’t indicate polyps, you’re ok.  Anything suspicious and you get a call from your doctor to schedule the procedure.", "label": 0}
{"text": "I lost 30lbs when I first got Covid and everything tasted/smelled like shit. \n\nNothing taste right yet. But it is much better.", "label": 0}
{"text": "Fuck being the only black person in any environment: that's the biggest red flag for me - and  probably a good indicator as to why they feel shitty to work with (they probably low key hate you).", "label": 0}
{"text": "I got the good ol vid back in 2020, lost my smell and it didn’t come back for two years. Sometimes things still don’t smell quite right. Like it’s gone off when it smells fine to everyone else. \nI lost a BUNCH of weight cause I forgot I was hungry, since my sense of smell would usually remind me. God speed dude.", "label": 0}
{"text": "I’ve been using colorguard for the last several years. My doctor said you can do the colorguard as long as nothing abnormal shows up on it - if so I would need the colonoscopy. I’ve never heard of needing five days for prep. It’s usually 24 hours.", "label": 0}
{"text": "It's not your fault, she never told you to wait.", "label": 0}
{"text": "Mine was only 24 hours, never heard of five days, that doesn't sound right, I've had 3 already", "label": 0}
{"text": "Wow.  Very vivid imagery!", "label": 0}
{"text": "Sorry to nitpick but 5'10\" 209 lbs is only \"obese\" on an outdated chart, and even then it's barely in that category. 5'10\" 290 is Chonky though", "label": 0}
{"text": "I got fat and am working on getting healthier. I don't eat a lot at one time, partly because I can't, but I'm also not active enough. So I'm changing what I eat and what I do. I need to lose 80 lbs. Edema adds some weight too, but I'm not blaming that. It's unhealthy lifestyle, 100%.\n\nAt work functions, it's best not to do too much of anything. Eating, drinking, talking.", "label": 0}
{"text": "Dude,  respectfully? What a shitty thing to say.", "label": 0}
{"text": "Big buns lol 💀", "label": 0}
{"text": "You took 20 wings and “weren’t trying to be a glutton?”\n\nThis should be an eye opener.", "label": 0}
{"text": "Took me like 9 months for my sense of taste and smell to go back to normal", "label": 0}
{"text": "Y'all fat shaming mfers need Jesus or Vishnu or something.", "label": 0}
{"text": "Seems like a good wake-up call.", "label": 0}
{"text": "You shouldn’t need a sign to tell you that other people need to eat, too.", "label": 0}
{"text": "Kinda fat?", "label": 0}
{"text": "It really is not.", "label": 0}
{"text": "You could try miracle berries/fruit (Synsepalum dulcificum). It's a type of berry native to Africa that temporarily makes sour things taste sweet. I'd be interested to know what effect that would have on your messed up taste buds! It should be pretty easy to find online (Amazon sells them).", "label": 0}
{"text": "I had guests over once and had made a literal pot of corn (3 cans) for 4 of us.  First guest took the entire pot on is plate as the first item. The entire fucken pot…. he just looked at me and said “I love corn”", "label": 0}
{"text": "Right there with ya bro.  Lovehandles are a bitch", "label": 0}
{"text": "Dressing is NOT on my personal \"yummy food\" list.  :(", "label": 0}
{"text": ">  scrape off the top layer of nuts\n\nThat's the best part!", "label": 0}
{"text": "Aside from being fat. You're 54 years old and didn't think that was a bad idea?", "label": 0}
{"text": "Fuck the management. They should have put overtly obvious signs throughout. Only children and weirdly peckish people eat 6 nuggets. As for people commenting on your weight fuck them too.", "label": 0}
{"text": "I've had 2 colonoscopies and forgot about prep both times until like a day in advance. Was totally cleaned out both times. Don't go crazy on seeds/nuts, and you'll be fine.", "label": 0}
{"text": "Oh I may have miscommunicated or just left it out but when she’s in certain states I can’t get a word in sideways. \n\nI spent years of the relationship trying to talk and being interrupted what feels like 3 words into each sentence. I come from a background where it’s not okay to interrupt, and there is a cultural difference in that apparent just from the states we grew up in. When someone is talking to me, my brain shuts down and I can’t think about what I’m saying and I automatically just listen. Part of that might be me being neurodivergent, part of that might be just how my family was growing up. \n\nWhen I moved to her area, it made more sense in a big city people are more okay with talking over each other. “Quiet mouths don’t get fed,” someone said to me at one point. Kind of like that I guess. When I met her family, they interrupted me too. When I watched how she communicated with them, I observed how they interrupted each other, and it was just how they showed they had something they needed to say. They all would do this and get a little louder and louder and then quiet down. They would constantly tell me I’m too quiet and her mother sometimes said I made her uncomfortable because I was “too polite” and quiet. One thing gf said she like about me in contrast to her mom is that, in her words, “my mom doesn’t know when to shut up and can talk forever.” Simultaneously, gf said, her mom doesn’t like it when people talk her ear off, so even if she complained, it’s better that I’m quiet than a constant talker. \n\nAnyway, I had to work on this. Therapy told me to. If I’m not being heard and I’m not speaking up, then I’m not doing my part. If it’s her communication style, and she can’t change it at my request, (I asked her nicely many many many times to try to not interrupt as much, I get that it happens sometimes and I accidentally interrupt but the difference is I avoided it and cared when I did it), and it was evident it was something she both didn’t feel necessary to change and felt she couldn’t help it. She actually did put a lot of effort into correcting it, and it used to be worse but it didn’t change a huge amount. I appreciated the effort and no matter the difficulties that came from it it wasn’t nearly enough to make me fall out of love with her. 1/2\n\nIt just got to the point that in order to be heard I had to speak up at times. And in some situations where we were both angry, we both yelled. I left this part out in the post above, she recorded me, beginning one hour before the cops were called. I left this part out because I’m pretty sure it’s technically illegal to do this in Chicago. She revealed this and played back the recording to me to prove how scary I was being, I believe she thought I was being scary, that isn’t debatable, but when she played it back, all that was heard was me speaking clearly, deliberately, slowly, her quickly interrupting me and trying to say a lot while I was talking when it was my turn. Her sort of half listening to me and distorting what I was meaning and raising her voice, me raising my voice as well, and whenever I had the opportunity, I lowered my voice back to a gentle volume. \n\nIt’s more that she had a habit of pushing me out of my turn in the conversation. I tried to get her to stop for a very long time but after miscommunications took root as just straight up beliefs for her, I neeeded to make sure I was being clear so she didn’t think I was doing or thinking something that she assumed was harmful. This is something people with ptsd can do. And as for the use of the word trigger, it’s not being used pejoratively. That’s correct terminology my therapist used. They advised me how to conduct myself with her and they told me what would be hard about it. They told me where the line was and told me what could happen if I crossed it. \n1/2", "label": 0}
{"text": "Some of us don't want Google to target ads based on our photos.", "label": 0}
{"text": "I’ve dealt with inflammatory bowel stuff for about 15 years, so I’ve had my share of colonoscopies, and I’ve never been told anything about a five-day prep, either. Just nothing but clear liquids the day before and start the prep sometime around mid–late afternoon. My doctor has me kickstart with some Dulcolax and then chug a ridiculous amount of sugar-free Gatorade with Miralax mixed in. Taste isn’t a problem, but my stomach can only hold so much!", "label": 0}
{"text": "If you didn't see that sign, then you didn't see the sign. You can't change that. Don't waste any energy worrying about it.", "label": 0}
{"text": "\nWhen she played back this recording, she skipped over every point I was talking normally, making sense, or when it was clear she misheard or misunderstood something that was said quite clearly. There were points indeed where I was getting loud, but I ended up quieting down. When she raised her voice, she would sustain it, talk faster and faster, and it felt more like she just wanted to talk and not hear me talk. The key difference is my tone was clearly under control. And this is how i conducted myself after being advised by a therapist, this is my strategy for the past 2 and a half years, and it healed us quite a bit. Only now has she felt it was too much to handle, and you know what? I think that’s okay. Her saying me yelling scared her? That’s valid. I told her that. I apologized for that. But that doesn’t mean I did something she didn’t do. It doesn’t mean I did something wrong or unfair. It means I’m willing to change my strategy, to see her and adapt to her. And honestly it’s easier for me to let her interrupt me. I had to try hard to get to a point where I would not be muscled out of the conversation. \n\nI know full well what triggered her in the past, what triggers her now. And sometimes that changes. And I’m receptive to that change. I said TIFU because the delicate life I had fell apart when I triggered her. I think your misunderstanding is that every time someone gets triggered, it’s the person who triggered them’s fault. It can be, but intentions, actions, and effects all matter. You seem to be inclined to think I was shutting her out of the conversation. Contrarily, it feels I have to sprint when speaking to her just to keep up with what is normal to her. Anger isn’t a vice, it isn’t a problem. It is like a sense. All emotions are. They tell us something about what’s happening, and sometimes they are wrong, but usually they have a good point. I think usually we can’t act on our emotions because they don’t tell us everything. But they usually tell us something. The problem happens when you try to cure anger like a disease. When you think “I’m angry and that’s bad.” So you start to do things that make it go away. There are healthy ways to do that, but most of the behaviors we attribute to anger are destructive. And many conflate those behaviors with anger itself. \n\nI stay a body length at least away from her. I don’t get in her face. I often turn away from her, at least so I’m facing perpendicular to her. I’ll squat down so I’m not standing over her, or even so she’s standing over me. (Not groveling or on my knees.) I often put my hands in my pockets, but sometimes show them so she knows I don’t have anything. I’m aware how I can appear threatening to her. I don’t want to be, and how she sees me from moment to moment isn’t necessarily evidence of what I actually am. Crucially actually, it’s important to know when triggered she often (not always) doesn’t see me correctly. She’s told me she’s seen my face morphing or like she sees the image of someone else instead of my face at her worst moments. On a rare couple occasions she argued with me like I’m someone else, saying I do things that I never have and never will. This is part of ptsd. It seems kind of far fetched and maybe her words are exaggerated, but I think the effect of what she’s experiencing and her meaning are not exaggerated. \n\nAnyway, this is way deeper, delicate, and more nuanced than “I don’t know to argue. I shouldn’t talk over someone.”\n\nYou’re right, I shouldn’t and don’t want to. I’m raising my voice, actually I think I said in the post, in response to being talked over to begin with, not to talk over her. I listen to her, i say back to her what I understand she said. I use active listening techniques. I only raise my voice To match hers when she does this, to show that it’s not going to push me out of the conversation. (Recall me speaking about boundaries. Being pushed out  of a conversation is a boundary. You must advocate and set your boundaries clearly and that can involve elevated vocal volume.) I spent the argument essentially trying to reiterate how I wanted to be understood when I was going to disengage from the discussion. She broods on what I say or what she thinks I said if I walk away, and then she comes back and argues with me about 100 assumptions she made while I was trying to cool off and let her do the same. \n\nThe key about the recording is, she began recording when neither of us were yelling, it was an hour long, it ended when I was at my loudest, at the point she said I scared her. She did not show it to the police I believe for two reasons: it showed I wasn’t actually a threat, and because she wasn’t technically legally supposed to do that. I didn’t feel betrayed by it, I don’t think it’s that wrong of a thing to do, and I was eager to hear the conversation. I told her she could keep it, but she decided to delete it. \n\nI’m not sorry because I think yelling was a monstrous thing to do. I’m sorry because it scared her. Just like I’m sorry when I walk into a room and she didn’t hear me coming and it makes her jump. I don’t want her to feel bad. Apologies are free you know. They don’t equate admitting to being a bad person. I validate she was scared. I validate she wants me to try a different strategy. I can say that and also say I didn’t conduct myself incorrectly. It’s a queue to shift communication strategies. And I said this to her as well. She knows this. She knows I’ll adapt to her needs. Sometimes she just doesn’t see me as I am. When I recognize she doesn’t, I try to reset and try again later, but sometimes there’s little pieces we can’t leave broken or else the damage gets worse as we cool off. It was to the effect of “I’m not asking what the medication is or why you need it or forcing you to take it. I just want to pick it up for you and it’s okay if you don’t even need that. I am not a threat to you.” The argument was basically me trying to say that for one hour, and her blaming me for ruining the day and getting in her business, and then me saying that I didn’t ruin the day and this didn’t even have to be an argument. Well, if it was neatly back and forth, that’s what it would have been. Of course she has a side too. \n2/2", "label": 0}
{"text": "Man, people are really eager to fat shame on a post about not noticing a sign. Sorry this went that direction, OP, and I hope it’s not getting to you. I also would have been embarrassed in the moment,   especially since being a big guy made it look “worse”, which is why you included that detail in the first place. But I’m gonna give you a pass on the full-blown Fuck Up. Your company regularly caters a meal to an entire shift crew, they know how to plan accordingly.", "label": 0}
{"text": "While many doctors do not require the 5 days of diet prior to clean out (mine didn’t) it really DOES make for an easier prep day. That said, prior to my recent colonoscopy (last month) I’ve had 3 others. The one prior to my recent one, I didn’t change ANYTHING about my diet. Not till prep day (day before procedure). Still had a perfectly clear colon and all was good. \nOP, enjoy whatever you want for thanksgiving and just do 4 days of modified diet. It really isn’t THAT big of a deal.", "label": 0}
{"text": "You’re not 😂he’s smaller than a child. No amount of martial arts will save him", "label": 0}
{"text": "To be fair, muscle is more dense than fat. My brother is like 5' 7 and around 170, but thats just cause he's wide and lifts a ton. \n\nDifferent body types will lead to different weights, the men in my family either veer towards tall and wirey, or short and stocky. I dont think one is more inherently healthy.\n\nRyan Reynolds is a weird pick imo, because he's not as big as a body builder, and hes paid millions to diet and dehydrate himself to look so shredded. With good genetics and a lot of training, its not hard to get bigger than him, its the cutting thats unhealthy.", "label": 0}
{"text": "Some of the comments in this sub are also brutal, especially for a place where people are coming to admit they made mistakes. Lots of people confusing \"tough love\" and \"harsh truths\" with just being mean.", "label": 0}
{"text": "As a ex-fat who still remembers what it's like, I'm sorry people are dog piling. It was a mistake, not a moral failing.", "label": 0}
{"text": "I'm convinced this was from a post yesterday about a 5'9 woman waitress who said she was fired for gaining some weight (130 to 240). She said some weight like this guy said a little overweight, which people rightfully attacked for being blatant misrepresentation", "label": 0}
{"text": "Never pull the string out. Cut it shorter. If you pull, you can pull and tear through their intestines. Source-am the person who helps surgicate the intestines back together", "label": 0}
{"text": "Some people just have them and won't ditch them till they get unfairly lean. Some people are the same bodyfat but look better because they have even fat distribution", "label": 0}
{"text": "Hey now. I got some fat! Im not 20 something anymore. It exists. Have muscle too though ya know. Good to have both. My brain- it’s pure fog if I get my body fat too low. Nobody should live like that.", "label": 0}
{"text": "I just did a 5 day prep and it was basically a low fiber diet. I'd have been able to do Thanksgiving no problem.", "label": 0}
{"text": "Sorry for your bad experience.\n\nI've seen more people get sick in the gym than I'd ever want to recall, though most manage to run away from their stations and find a sink or toilet. The error here was never in your judgement of your own ability or anything like that, it was in not eating first, and definitely in taking PWO on an empty stomach. That's a recipe for disaster. I've been going to gyms practically daily for the last 20 years, and the biggest and most common mistake that pops up is people not eating before training. I've seen experienced gym rats with PWO on minimal food just pretty much hit the floor after deadlifts and such... A machine running on empty is never going to perform well!", "label": 0}
{"text": "Mine did that once too, but there was a small turd hanging off the end of it", "label": 0}
{"text": "I missed the “like” in the TL;DR", "label": 0}
{"text": "Skip the golytely and ask your Dr. for the regimen of the pills you take with water. It’s much easier than that foul liquid you’re forced to take.", "label": 0}
{"text": "6 wings, smh. Was there anything else served?", "label": 0}
{"text": "Mine has you do a 5 day low fiber, low residue diet. It makes the prep SO much more pleasant! No shitting yourself to death. No getting stuck on the toilet for hours. No painful ass. Then sweet, sweet propofol nap. I would never not follow the diet in the future, even if another doc had different instructions.", "label": 0}
{"text": "Thanks for proving my point.", "label": 0}
{"text": "Nobody deserves to be fired for their appearance.", "label": 0}
{"text": "Pooetic.", "label": 0}
{"text": "I don't think it's fair to call him dishonest when he specifically mentions his weight in that same sentence. Maybe if he said kind of overweight in the post and only mentioned 290 in an edit or comment.\n\nI get where people are coming from that being overweight/obese is unhealthy and that impact on your health shouldn't be minimized. But is this post really the place for that? Op obviously knows he's fat, and a bunch of people telling him he is over and over again isn't gonna change anything. Maybe some people will change because they're bullied, but is that really what we want to do to people? Bully them and hope it changes their mind instead of making it worse? Just doesn't sit right with me.", "label": 0}
{"text": "How do you know that's the way she heard it?", "label": 0}
{"text": "When I got my first one, wife took me, we pulled in parking lot and some song was playing. You love to see me suffer, the repeating lyric.", "label": 0}
{"text": "I was seriously considering going into the funeral industry, and it has a special place in my heart. One thing that has plagued the industry in America is abhorrent racism and segregation. For most of our history, white funeral directors would not work for or on black clients, and black funeral homes have been in the past a way for black people to gain real money and status both within and outside their communities. \n\nI don't know your funeral directors in particular, but based on how you have been treated, I wouldn't be surprised if these historical problems are affecting your current employment. I am sincerely sorry this is happening to you. You don't deserve to be treated poorly because of your skin color or your cultural background. As long as you are being professional, you deserve to be treated with respect and have your time respected.", "label": 0}
{"text": "I don't, but with all the crazy coming my way I didn't really care whst she thiught she heard at that point. Just wanted to be done with it because, while I might not be the best talker, I knew I didn't say anything that warranted that reaction.", "label": 0}
{"text": "Don't know. I've never not followed it. Part of the reason I get to do the awesome prep, that isn't a giant jug of death, is because I follow that diet to a t. I bet OP gets to use a similar, less nasty prep solution. I also follow the diet strictly because I do know someone whose prep wasn't good enough and they had to do it all over again. I'd rather follow all instructions than have to do the prep multiple times.\n\nBut, also, there wasn't much of anything in my family's Thanksgiving dinner that I absolutely wouldn't have been able to eat.", "label": 0}
{"text": "Mostly for me it was things like A-1 sauce and teriyaki sauce are ruined. I am fairly restricted in what I can eat but those still don't taste right.", "label": 0}
{"text": "“I can easily eat 5 footlong subs”\n\nJesus, and I thought I was a fatass. Maybe if I’m high", "label": 0}
{"text": "I found a picture of myself when I was 9 or ten and I was a string bean with love handles.  I blame it on genetics.  Now I am 6’2” 193lb and they are still there around an otherwise muscular body.", "label": 0}
{"text": "This is very millennial-coded. Your week was indeed double plus ungood. I sincerely hope you’ve learned your lesson.", "label": 0}
{"text": "Oof, don't do that.  When the elevator's in motion, the brakes come off and the steel cable can stretch and bounce.", "label": 0}
{"text": "Howdy Im 58 and 5'10\" and 225lbs and you past KIND OF FAT a plenty long time ago. I am fat and not in denial.", "label": 0}
{"text": "You should be on a low fiber diet for five or so days before.", "label": 0}
{"text": "you walked right past it and didn't see it?", "label": 0}
{"text": "Yes - I picked it up quickly after their reaction. It was a learning moment for me, for sure. I haven't done anything like that since.", "label": 0}
{"text": "I think you mean chicken nuggets OP.", "label": 0}
{"text": "It's always the orange cats", "label": 0}
{"text": "Upvote for \"doubleplus unfood\".", "label": 0}
{"text": "Yeah, the last time I had one, the diet changes started 5 days before.", "label": 0}
{"text": "Of yes, they're secure, it's just with the brakes off the bouncing can cause motion sickness 🤢", "label": 0}
{"text": "For real the guys like \" I asked everyone and no one responded\" he probably went outside and whispered it to a bush to justify saying \"I guess no one heard me\" to go back and eat MORE of something that was supposed to be for everyone. The guys a menace and I def would not invite him to my parties.", "label": 0}
{"text": "Oof that sucks. People are jerks. I'm sorry they are giving you a rough time.", "label": 0}
{"text": "Going to guess this isn't the first time you have done that.  You are likely the reason they have the sign.  I get it.  I'm the heaviest out of my co-workers.  I always start with a reasonable amount and than after everyone has eaten than I may have seconds.  But I don't have firsts, seconds and thirds the first time through.", "label": 0}
{"text": "Even more accurately they are nuggets. Breaded/battered, deboned small pieces of chicken are nuggets.", "label": 0}
{"text": "Yep, now it’s cleanse the evening before and colonoscopy first thing in the morning.\n\nThat 5-day cleanse is from the olden days when you had to have an RX and the pharmacy mixed up that big jug of whatever it was for you to drink.", "label": 0}
{"text": "After my first I learned to schedule the procedure early in the AM. Scheduled my first one for the afternoon which meant I couldn’t eat anything all day. Rather get up at 2 am to finish the prep. \n\nLuckily the prep with my doc is only the day before", "label": 0}
{"text": "(says completely unrelated statement about how this person should change and potentially harm their body just because you think they should while not actually commenting on the topic presented)\n\nbut you said “respectfully” so it makes it alright 🙄 go find a pro ana sub and go nuts over there.", "label": 0}
{"text": "Six isn't really a meal-sized serving of boneless wings from BWW. If I didn't see a sign, I'd probably get myself 10-12, and I probably wouldn't go looking for a sign before doing that because that's a totally reasonable serving.\n\n20 is probably pushing it, but 6 is hella stingy.", "label": 0}
{"text": "omg just reading this made me ![gif](emote|free_emotes_pack|dizzy_face) blugh lol", "label": 0}
{"text": "I have played star fleet command as free to play off and on thru 2+ years. You leave your mining ship in a belt of asteroids and some pay to play just comes by and he is 3x levels higher than I am and they proceed to seal club my ship. You come back to check on your several hours later to input new commands and see he battle report you have zero chance to win.", "label": 0}
{"text": "Also why play games with in game purchases?? Play stardew valley on your phone or something. It's $15 and that's all... I've played over 400 hours of this game. $30 (bought once on PC and once on mobile)", "label": 0}
{"text": "what do you even spend that much on i'm struggling to understand", "label": 0}
{"text": "I’m just not sure I can admit to my wife what I have done.  If I ask her to take over the finances (which she has no desire to do) she will want to know why.", "label": 0}
{"text": "> I’m a terrible financial steward for my family\n\nI think the most important thing here is that now that you've recognized this, you take actual steps to protect your family from yourself. You need to give your wife control over *all* your family's finances and fully lock down your own control. \n\nYou also should seek addiction counselling.", "label": 0}
{"text": "Even normally for me, any strong fragrances make me cough(flowers, smoke, laundry powder.), even if I can't smell it but know it is there.", "label": 0}
{"text": "You're an addict. Treat it like any addiction and seek help.\n\nMost medical aids will pay for rehab.", "label": 0}
{"text": "You need to see a professional therapist for a gambling addiction. Seriously. Don't try to pin this on ADHD or whatever. You have an addiction and you need help immediately before you further destroy the lives of your family.", "label": 0}
{"text": "If you value your family over your ego, this is an easy choice.\n\n\nYeah, I get it is embarrassing. I've got two grown kids and been married almost a quarter century, so I get it. But if your story is real and you really care about your family, then this is what you need to do.", "label": 0}
{"text": "White out survival we had several people admit they spent 60k in 3 months on just one profile for that game. And I know they were telling the truth based off of packages and what not. Even post bank statements that backed it up. So theres people out there.", "label": 0}
{"text": "cool story, bro", "label": 0}
{"text": "I have a 6 figure job with 2 kids and a wife. $300 is a big deal. Idk how they had 45k sitting around.", "label": 0}
{"text": "The games are designed to reinforce that winning happy feeling. It’s feeding the need to be the whale, better than everyone else.", "label": 0}
{"text": "It finally got me for the first (and hopefully final) time last October. I definitely had the \"sensation\" of taste. I remember getting something strawberry flavored and I could definitely sense that it *should* taste like strawberries even thought it tasted like nothingness.\n\n\nI only lost my sense of taste for 3ish weeks maybe. And it also didn't come back over time, just straight up all at once. I was walking to Walgreens for something and about halfway into the walk I could just suddenly taste my vape out of no where. Took me nearly 2 months for my ears to clear though, couldn't hear anything and just constant pressure.\n\n\nI hated the whole experience. ", "label": 0}
{"text": "Yeah, you're going to want to keep working stuff as far away from your phone as possible. Especially if it's not your work account it's a shared work account", "label": 0}
{"text": "When I get prying questions from my kind but sometimes judgmental family, I now say with a smile, “Are you *sure* you want me to answer that?” Generally they agree, the answer is no and we let it drop. I’m sorry that you feel like you can’t let your guard down with family. Hugs.", "label": 0}
{"text": "Man mine was mango flavored. And it is the same flavoring they use in everything. So much ruined.", "label": 0}
{"text": "So I really want to ask, what do you gain by spending the money to \"get there\" faster and what benefit is there for you? \n\nLike why not play a game that isn't pay to win? And you can just buy cosmetics? Like you're going to be spending tons of time actually playing the game anyway why not play a game with some story or underlying systems other than gambling that you can enjoy? \n\nHave you tried lol TFT it's like gambling I guess but it's free. Or path of exile?", "label": 0}
{"text": "I regained my sense of smell after Covid by using Breathe by Doterra. Held it up to each nostril for about a minute, noticed a gradual change and my smell/taste came back just before I stopped testing positive. I’m by no means an essential oil fanatic but my mother in law is and had given it to me when I had a flu the year prior. It was a miracle worker for me.", "label": 0}
{"text": "Which video are you talking about?", "label": 0}
{"text": "You're self destructive. It's literally time to ask your wife for help. It sounds terrible, and ego crushing, but you're obviously sabotaging your life's work for candy crush. I promise that after the shameful ego hit, and a couple months of not indulging your addiction, you'll be happier. On a second note, don't ask for help with the intention of manipulating the situation. Give all financial control to your wife, make sure she knows the true issues you're dealing with, and good luck.", "label": 0}
{"text": "It’s real and you are right.  I am a dirtbag.  Thank you", "label": 0}
{"text": "For what it's worth, you can turn this around if you really want to, and I hope you do.", "label": 0}
{"text": "You can. You just don't seem to want to. Tell your wife - own the shame (it'll pass), and work out a way out of the woods or else you're going to hit bottom and have a lien put on your house for debt. If you won't do it for yourself do it for your kids and if you won't (it's not 'can't' at least own that) then you'll lose everything. You have a gambler's type addiction to spending/risk and you need to treat it like that.", "label": 0}
{"text": "You are right, I don’t want to.  I want to solve this in my own head so I don’t have to admit it to anyone (other than random Reddit users).  I’d like to just stop and move on, but I worry that if I tell my wife what has happened that I’ll lose my family.  It’s not too far gone yet, we still have a great life….but I’m leveraging it everyday", "label": 0}
{"text": "Lmao my mind immediately went to this post.", "label": 0}
{"text": "Some lactose intolerant people pay the gold price for lactase.\n\nBut a *real* warrior pays the porcelain price.", "label": 0}
{"text": "You need to check out r/colonoscopy there's a lot of excellent info there", "label": 0}
{"text": "You can't solve it in your own head - or you would have already. Get some help man and stop making excuses.", "label": 0}
{"text": "Hey, you didn't see the sign. At the end of the day, did you impact anyone else's ability to eat? No? I'm guessing you would have mentioned it if you had. \nBesides, 6 wings/nuggets? That's kinda shameful. If they wanted to do it like that, it might have benefited them to have someone serve/portion.", "label": 0}
{"text": "I thought that was true everywhere but There have been a couple of elevator accidents in the city i live. I assume Mexico (where i am) has less safety features than other countries", "label": 0}
{"text": "Believe me the amount of motorcycles I would have sitting on an acre of land with my rv on it would be amazing at least a bike for every day of the week.", "label": 0}
{"text": "I am definitely not well off either so I would also have a fridge full of groceries a second freezer full and that land would have been bought with the motorcycles all being fairly cheap and used.", "label": 0}
{"text": "my venmo is maxward17 my pfp is ghostface holding money if you actually wanna help, i'm a broke college student trying to get a steak dinner😂", "label": 0}
{"text": "Can confirm. I once saw a double rainbow around a ringlight, after swimming in a pool without goggles.\nI'm pansexual now.", "label": 0}
{"text": "Sounds like a great honeymoon!", "label": 0}
{"text": "Yeah, it’s like the rainbows acted as my activation word because I was a sleeper GAYGENT", "label": 0}
{"text": "It's because I have a lot of muscle and legitimately large bones. I am more \"built\" than the average person. Even now, where I am out of shape, deadlifting 300lbs is something I can do without much prep over cracking my knuckles.\n\nWhile I don't disagree with the idea that a lot of people can be far leaner than they expect, I also don't believe that I am so far out of the norm that there's few like me.", "label": 0}
{"text": "It was amazing and even this experience is a memorable and a favorite of our whole relationship 😂", "label": 0}
{"text": "My general rule of thumb for any group meal is to know roughly how many people are being fed and not to take more than a proportional share going through the line the first time even if that ends up being less than I'd normally eat.  ex if there're 20 people, don't take more than 5% overall and not much more than that of any one entrée.  Taking extra care if there's things on the menu that some people won't eat (eg pork, meat in general, dairy free, gluten free, etc) not to wipe it out.   If you're unsure how many people will be attending err on the side of a smaller plate.\n\nIf whoever planned the event ordered enough food, there will be seconds available for you and everyone else who eats larger quantities because some people eat very lightly.  If not, you don't want to be seen as the jerk who stuffed his face leaving late comers to do without entirely.", "label": 0}
{"text": "Have you tried eating ginger?", "label": 0}
{"text": "The true TIFU seems to be your unbreakable habit of locking all doors behind you. I can't believe you locked the front door after entering!", "label": 0}
{"text": "20mg is sucky tolerance? I would be incoherent and barely able to walk from a 10mg edible. Especially with all the stimuli at an airport. I’m impressed with OPs ability to be as sentient as he -was-!", "label": 0}
{"text": "Can you postpone it a week, or are they all booked up?", "label": 0}
{"text": "Communication wins again, sweet story", "label": 0}
{"text": "Lol the sign sounds like a suggestion.", "label": 0}
{"text": "Lame", "label": 0}
{"text": "Oh wow, what a wild ride! It is so crazy how one little thing can spiral us out of control … especially when trust comes into the equation!", "label": 0}
{"text": "Glad it all worked out in the end!", "label": 0}
{"text": "Peanut butter worked for me, also cinnamon kinda", "label": 0}
{"text": "\"in an afternoon\"\n\nThat's the part that really sticks out to me, because to my reasoning there's not really a meal \"in the afternoon\". He didn't say lunch, or dinner. To me that makes it sound like a snack. \n\nMaybe this is just a semantics thing, but to me that feels like, oh I was hanging out with friends Saturday afternoon and Steve got out chips and stuff, so I ate 5 fucking footlongs. Easily.", "label": 0}
{"text": "*where are the groceries*", "label": 0}
{"text": "No", "label": 0}
{"text": "Honestly, who can resist boneless wings?? HR needs to chill; it's not that deep 😂", "label": 0}
{"text": "Bare feet", "label": 0}
{"text": "Double win!", "label": 0}
{"text": "I'm hearing that a lot. If I could keep this same energy with everything, I would, but I draw blanks pretty quickly when it comes to creative writing. Can't tell you how many first chapters I've written that went nowhere.", "label": 0}
{"text": "Sorry, your tl;dr was too long, so I didn't read. Can you make it shorter?", "label": 0}
{"text": "I had Covid in 2022 and lost smell and taste for about two days. It slowly came back on day three and took a bit. But after a week or two I was back to normal. Only tomatoes were weird a bit longer.", "label": 0}
{"text": "It depends on the environment. If I go to the hospital I notice every little sign there is. Same when I’m driving. \n\nIn the cinema? Nope. At the office eating area? Nope. Although I would say that if I was planning to eat 20 chicken wings in front of my coworkers I would feel self conscious and would be more aware of my environment.", "label": 0}
{"text": "I’ve had to do a few of these in the last few years and yeah it’s the day before you have a light breakfast and then start your prep. You absolutely do not need to be on a special diet for a week beforehand. This doctor is either exceptionally outdated or OP is misunderstanding. The prep is basically industrial strength military grade laxative and cleans you out completely no matter what you’ve eaten in the last 5 days. If it’s in there, it’s coming out. \n\nOP call your doctor and ask for clarification.", "label": 0}
{"text": "I sometime watch vintage porn from the early 20th century. Those girls are obviously dead now, but so what?", "label": 0}
{"text": "Bit of a dick move, could've brought it up sooner.", "label": 0}
{"text": "![gif](giphy|3oeSAOKnRwhKWpAJWg)\n\nIm sorry about your loss of smell/taste. 20 days of sickness would definitely take a toll on my mental health too, I just got over having fever for 4 days straight and that was awful enough. When it comes to COVID, I don’t even know what’s worse, getting COVID or getting the blood clot Vaccine.", "label": 0}
{"text": "She kiled herself because of backlash after a homophobic tweet. But sure others must have been responsible for that...", "label": 0}
{"text": "26 and 20 when you got together seriously 😳 this guy was your age when you were 14. Would you have sex with a 14yr old? Run for your life!", "label": 0}
{"text": "Halloween is this week......", "label": 0}
{"text": "Hey that’s 2 things that could’ve gone completely wrong but turned out for the best in the end. Maybe a little reminder from the universe to feel blessed!", "label": 0}
{"text": "Yeah, that's the only reason these super hot gram models don't want to date you ", "label": 0}
{"text": "Long story short, the backdoor was locked so you used the frontdoor.. not sure how this story is related to TIFU", "label": 0}
{"text": "wat", "label": 0}
{"text": "not the point of the post at all but you should write a book. you have a very great way of storytelling", "label": 0}
{"text": "Now I'm sexually frustrated. Nothing new there though", "label": 0}
{"text": "Same height and I hit 195 recently and was embarrassed. I had trouble reaching down to tie my shoes. I'm already down to 180 two months later. I cannot imagine what it must be like to have another 100 on top of that.", "label": 0}
{"text": "Nobody tells real-life stories this way. 4th grade reading level material.", "label": 0}
{"text": "Maybe you can bring a selfmade food for the next lunch when selfmade food is served. I knew also a guy at work how stuffed his plate everytime somebody brought in food, but he never prepared something for others. He was a real glutton. Also in work related situation just observe other people. If everyone takes 20 nuggets, the sign has no purpose and you can feel well. If everyone takes only 5, you should take same amount. That is so easy even animals can do this ", "label": 0}
{"text": "What were you playing on your Switch?", "label": 0}
{"text": "24 hours not 5 days. You need a new doctor.", "label": 0}
{"text": "TIFU by having to use a different door.", "label": 0}
{"text": "Every time i think i eat too much i read something like this and wonder how tf someone can eat that much and not vomit their guts up. 5 foot long subs in an afternoon??? A single footlong sub fills me up for like most of a day.", "label": 0}
{"text": "Tifu when my husband’s risky outdoor backdoor attempt when wrong", "label": 0}
{"text": "You were super lucky with that.\nIf you ever see something potentially long hanging out of your cats butt don’t pull! The colon has a tangled shape and if a long string is going through it, pulling would severely injure the colon. \n\nHad a cat eat a string, and the vet explained that to me. They injected lube and pulled super gently and slowly. Had it not come out easily they wouldve had to operate.", "label": 0}
{"text": "Honestly, this sounds like an HR fail, not a you fail. If they’re putting out food without clear signs, it’s on them. You’re just trying to enjoy a meal like everyone else!", "label": 0}
{"text": "Bit of a light-hearted story but my partner and I picked up a bag of edibles from Donki in Japan and decided we'd eat them in the airport before our flight home. We'd never had edibles before and had no idea how much to have so we just decided to go halfsies on the entire bag. It's worth noting that my partner weighs about half as much as I do and as we went to sit on the plane I was feeling it. We chuck on a show on our ipad and pre flight goes ahead without a hiccup and soon enough we are in the air. About half an hour into the flight she turns to me looking confused and says \"what's going on? Have we taken off yet?\" I couldn't control myself and I burst into laughter just completely astounded that she somehow managed to miss the aggressive throw back into our seats as we take off and the loud droning of the jet engines around us. Looking forward to our next japan trip.", "label": 0}
{"text": "I feel her pain, post covid I went two years where everything tasted and smelled terrible. I avoided a ton of foods due to this, even coffee, no coffee for two years. Then suddenly one day I got a cold, and after I recovered a week or so later, stuff was 95% back to normal. Some things still taste a little odd, like Coca Cola and some breads, but I now mostly avoid those. Hope she recovers soon, I know exactly how it feels, the emotional toll it takes as well is something that I can comprehend.", "label": 0}
{"text": "It's been a while since I've had Buffalo Wild Wings, (which I assume is what Buffy Wild Wingers is? Either that or they're another wing place that I've never heard of, but it doesn't make much of a difference) but I remember that I would order 10 or 12 boneless wings when I went there. That would be a pretty big meal, and I might have some left over or split the wings with someone. So if I was at an event where BWWs was served, I could see myself getting into a similar situation if I didn't see those signs that said only take 6.\n\nBut again, I'd only be taking around 10 of them, and 10 is already a little bit too much for me. 20 would definitely be something I'd split with at *least* one other person. I don't think you were rude or anything, but this might be a wake-up call to cut back a little bit. Knowing I'm eating a little over 3 times as much as my co workers in a single meal would make me want to change some things in my life.", "label": 0}
{"text": "I just had one. I only had to start 3 days before, no nuts, seeds, popcorn, etc.  No red meat. Then 1 day with no food.", "label": 0}
{"text": "https://preview.redd.it/q2xdnrzfz2xd1.jpeg?width=1080&format=pjpg&auto=webp&s=c218ad137e51133d203a004b082e4a4480b9c036", "label": 0}
{"text": "First fuck up is not fully reading everything the AirBNB had available to read.", "label": 0}
{"text": "All the latecomers just see (deleted)", "label": 0}
{"text": "Honestly, this sounds like such a non-issue! Like, if the sign was hidden, how were you even supposed to know? People need to chill; you just wanted a good meal.", "label": 0}
{"text": "damn, I must have rubbed some people wrong with my stupid joke.", "label": 0}
{"text": "Here, try putting [this](https://youtu.be/3PDgSJ393lo) in the corner while you read", "label": 0}
{"text": "Sorry, your comment didn't have a tldr. Can you add one?", "label": 0}
{"text": "I have accidentally locked myself out of my house a couple of times, but I live a few blocks away from my grandmother and I gave her a spare set just in case. I usually have my keys when I leave the house even if it is to work out back.", "label": 0}
{"text": "Thanksgiving leftovers are better anyway. My dad turned 56? this year and honestly getting the scope done is better than having dessert. He has to keep going back to make sure things don’t become cancerous.", "label": 0}
{"text": "I do just the opposite. I'd rather be hungry than have to get up that early. I schedule for late in the day so I can get up at the reasonable hour of 8:30, finish my prep, drink some tea, and have a couple of hours without liquids before heading to the hospital.", "label": 0}
{"text": "To be fair, your original post was so short that the TLDR was basically the same lmao", "label": 0}
{"text": "> your", "label": 0}
{"text": "Honestly, who even puts a limit on wings? If they’re providing food, they should expect people to actually eat. Also, you're not a glutton just for being hungry. People need to chill.", "label": 0}
{"text": "Was expecting a story that involved a toilet", "label": 0}
{"text": "Not seeing the sign is no excuse. Before you take an unreasonable amount of free food, you should assess whether there is enough for everyone.", "label": 0}
{"text": "Haha, oh man, I can totally picture the moment you realized there was a limit on the wings 🤦‍♀️. Honestly, though, I get it if there’s a huge spread and you’re starving, who’s counting? Plus, they’re basically just fancy nuggets, so 20 is totally fair game 😂.", "label": 0}
{"text": "I have to do 7 days every few months and I'm 33", "label": 0}
{"text": "OMG, this made my day! 😂 Who knew sleeping in contacts could lead to such colorful revelations? Your friend's response is hilarious! At least you'll have a fabulous vision while you figure it all out! 🌈✨ Hope those rainbows fade soon, but keep the laughter coming!", "label": 0}
{"text": "Don't sell yourself short. 5'10\" and 200lbs is definitely fat lol.", "label": 0}
{"text": "> \"I guess they noticed me eating the sandwich\"\n\nThat sentence should hang in the self-awareness hall of fame.", "label": 0}
{"text": "You got the answer here. \n\n\nIt explains why she doesn't want you picking up the meds. Explains the bizarre behavior. \n\n\nShe's getting the wrong, probably controlled, meds.", "label": 0}
{"text": "I don't get why people think that we care, or come up with the time to put such efforts into these post.. EGO", "label": 0}
{"text": "Just had one done and the guy in the next bay over admitted to eating a clif bar a few hours before the procedure.\n\nHe got reamed out.", "label": 0}
{"text": "I have performed 200+ colonoscopies. Eat whatever you want for Thanksgiving.  5 days is the dumbest thing ever. I only ever made patients do 5 days prep. You'll still be 4.5 days on whatever diet they recommend.", "label": 0}
{"text": "I lost my sense of smell 20 years ago, and my taste went with long covid 4 years ago. \nLiterally zero sensation now. \nFoods are now about presentation, colours, and textures. \nOther than that, it’s just fuel. \nI know if a dish is heavily spiced if the roof of my mouth swells! \nI hope you find a combo that works for you.", "label": 0}
{"text": "I may be flubbing about 10 pounds but not much more than that. He's fine. It's all muscle~", "label": 0}
{"text": "The never ending need for likes...", "label": 0}
{"text": "No way you one upped Verbalase by spending 50k on a mobile game", "label": 0}
{"text": "One word, straterra. \n\nThere’s someone in my life who lived just like this. And he went on straterra and that internal pull to get those dopamine hits through spending money ceased literally overnight. ImIt’s not an easy or pleasant condition you’re dealing with. And it’s impacting many other lives along the way. I wish you luck.", "label": 0}
{"text": "Shit happens esse. Don't worry about it. Im 5'9 220 and would tell them to suck my chode if that was the entire meal offered. \"6 Nuggies\".", "label": 0}
{"text": "I dated a woman who could barely smell, which was ...unfortunate. She ended up with another man who can't smell at all. A match made in heaven.", "label": 0}
{"text": "Haha I did something similar at a rental house. Managed to somehow flip the screen door latch over from the outside. Wasn't naked though.", "label": 0}
{"text": "You have a gambling problem wearing a video game costume. If you want any chance at keeping your family you need to come clean with your wife, give her control of the finances and seek serious therapy from someone who specialises in addiction recovery.", "label": 0}
{"text": "My wife and I made this mistake at one with a swimming pool one time. Just as we were about to get down to business I looked up and saw a Ring camera.", "label": 0}
{"text": "As a fellow fatass, that reads to me like he could eat 5 footlongs during the course of an entire afternoon and not anything else. Which, I maen, it's still excessive, but it's.. achievable.", "label": 0}
{"text": "I want the time it took to read this back...", "label": 0}
{"text": "You aren’t impulsive. You are addicted. You have a spending addiction.  It’s okay, really it is. You can overcome this and your life won’t feel empty.  I’m sure you’re afraid to quit because you live off the high but you can chase highs in healthier ways as well as reduce your shame and increase your family’s wealth.   I’d highly suggest the book Spent as well as speaking to a therapist.  You will lose your family over this if you don’t get help.   \n\nI have a shopping problem, if I want it I get it.  It adds up really quickly even though it’s not typically in the thousands like this.  That book has helped me tremendously.  My biggest personal advice is delete the apps and remove your credit cards off them (obviously).   You are far beyond setting a budget for online gaming. Thats like telling an alcoholic to only have 1-2 beers instead of 20.   \n\nBest of luck.  You are in control, remember that.", "label": 0}
{"text": "Haha, oh wow! That sounds like a hilarious adventure turned panic! 😅 Glad you managed to find an unlocked door before heading to a neighbor’s house in a towel! Definitely a honeymoon story to remember! 🏡✨", "label": 0}
{"text": "Honestly, that’s on them for not making the sign more obvious! Also, like… who actually stops at six boneless wings? You were just living your best life, no shame in that 😂", "label": 0}
{"text": "Honestly, it happens to the best of us! 😅 Those wing temptations are real, especially when you’re hungry and they look so good. Plus, who actually reads the rules when there’s food involved, right? Just own it! At least now you know for next time, and hey, it’s just a funny story to share. Everyone loves wings, and I’m sure you weren’t the only one who went a little overboard. Just laugh it off and move on! 🍗✨", "label": 0}
{"text": "Don’t fall for it when she asks you back", "label": 0}
{"text": "What's funny is he eats far more than I do, even though I'm overweight (not obese but still).", "label": 0}
{"text": "Try nicotine patches", "label": 0}
{"text": "Yeah.... But I've been getting them since my late twenties due to history of cancer in my family. You don't need to diet for 5 days", "label": 0}
{"text": "My favorite food used to be potato chips.  I would sit down with a family-sized bag and empty it in one sitting.\n\nI cannot stand the taste of potato anything now- chips, fries, mashed- they all taste rotten/old.  That taste never came back properly.", "label": 0}
{"text": "Lol something similar happened to me and if you are out of the game 🤗", "label": 0}
{"text": "Look. Im fat because i drink, but i dont eat much.\nThe idea of eating 6 nugs and nothing alse sounds silly. Thats a snack.", "label": 0}
{"text": "Lesson learned?", "label": 0}
{"text": "Treat this like any other addiction and start going to meetings, support groups, therapy", "label": 0}
{"text": "I was low fiber from a week prior, then clear liquids only for 2 days, then drank 2 gallons of nasty salt water, plus meds…. So yeah, they vary.", "label": 0}
{"text": "That’s kind of the idea in a colonoscopy…", "label": 0}
{"text": "TIFU by using AI to write a TIFU post", "label": 0}
{"text": "If you can't taste anything anyway it's healthy salad time.", "label": 0}
{"text": "OMG, that’s so relatable! 😂 We’ve all been there—totally hungry and just loading up our plates like it’s a buffet! Honestly, don’t sweat it; you didn’t see the sign, and it sounds like the food was just too good to resist! Plus, who even counts wings when they’re that tasty? Just chalk it up to a funny story and maybe next time, sneak a peek at the rules before diving in. At least you got to enjoy a delicious meal! 🍗✨", "label": 0}
{"text": "From what I've read most people just have the sigmoid and decending scoped. The transverse and ascending are scoped less often.", "label": 0}
{"text": "OP, get some flowers and a nice card and apologize for not remembering but let her know you do care and you regret forgetting.", "label": 0}
{"text": "I lived in a place where if you twisted the doorknob while closing, sometimes it would lock the door. Oh man we got locked out so many times (we didn't carry keys, all friends lived in the top and bottom floors of the house and it was the friend group meetup house so someone was always home). I once walked in the upstairs front door bc I didn't have my keys for downstairs, look down the shotgun hallway to the back of the house, and see a crowd of people at the end with my friend in a rope tied around his waist, about to repel out the fucking window to the backyard where the back door was unlocked. Will never forget that sight haha. They all stared at me like dogs being caught in the act hahaha. After that we started carrying keys, but we'd still lock ourselves out accidentally all the time when leaving our downstairs apartment to go upstairs or to the laundry. We definitely lowered a second person out a window. Ah, good times with slumlord apartments in San Francisco", "label": 0}
{"text": "Awwww hahahaha", "label": 0}
{"text": "All I can say is I hope your navigation skills are exceptional. LMAO.", "label": 0}
{"text": "I'd like to suggest the game Torn.com. its designed to prevent addictive behavior.  If you try it message me and I will set you up. It has a realistic casino that you can only use with limited daily tokens.  Its a great game made by people who are not trying to rip you off. Come play with us and stop spending silly money. Hugs xx", "label": 0}
{"text": "Don’t worry about this!  Bless you!", "label": 0}
{"text": "It’s a general low fiber diet. No whole grains, nuts, seeds, fruits with skin, etc. doing that for five days as well as the “double cleanse” the night before and morning of is becoming more standard.", "label": 0}
{"text": "I felt so rested after propofol my first thought was “ok I see how people get addicted to this”", "label": 0}
{"text": "Now waiting for all the \"TIFU by copying a TIFU involving scissors and two batteries\" to stream in.", "label": 0}
{"text": "SUTAB!", "label": 0}
{"text": "The max current a AA can output is about 2A.", "label": 0}
{"text": "I slipped and tripped down the stairs and did the same thing. I used to stand up and have urine just fall out without warning. It's embarrassing but not uncommon. Sadly. \n\nDo you have Ehlers Danlos? It's helpful to do careful squats and core exercises to keep those muscles tight. It will only get worse otherwise. Protect your tendons.  My shoulders relax right out of the socket if I'm not careful.", "label": 0}
{"text": ">Some napkin-maths calculations shows that Ohm's law would have indicated 300 amps of current was flowing through those scissors\n\nYour napkin math is horrible.", "label": 0}
{"text": "Op is more upset people are ripping into his weight than that he took 3x as much food as he was supposed to and presumably fucked over 2 of his coworkers out of their free meal. These things are not unrelated. Your eating habits and your physical health do effect other people, even if you don’t want to accept it. Your feelings don’t change how you negatively effect others.", "label": 0}
{"text": "300 Amps?!?! I think your napkin needs new AAs", "label": 0}
{"text": "That sounds exactly like something I would do!", "label": 0}
{"text": "F in the chat, my condolences that is hilarious", "label": 0}
{"text": "It was at a party for a UFC fight and I still remember someone commenting “of course they noticed- you eating a yard of sandwich was probably more disturbing and violent than any of the undercard fights”", "label": 0}
{"text": "As far as I tell with a quick search NiMH are commonly rated for use at a 4-5C discharge rate with some high current models being rated for 15C. So, for a bog standard 2500mAh AA cell that’s 10-12.5A without damaging the battery. The high discharge rate cells almost certainly have a lower capacity but even if they only have 2000mAh of capacity that’s 30A. Even those rates are a little conservative as they assume the battery will survive mostly undamaged and yield most of its nominal capacity. If you’re dumping power into a dead short I wouldn’t be surprised if it briefly yielded even higher currents.", "label": 0}
{"text": "The husband wasn't naked, though. This was really zero stakes.", "label": 0}
{"text": "Oh man, I hate it when you make a joke online and people don’t read it in the right way. I'll give you an upvote as consolation", "label": 0}
{"text": "I think he doesn't know about internal series resistance, which is what likely limited the power in this case, or maybe contact surface between the scissors or the positive end of the batteries.", "label": 0}
{"text": "My thoughts exactly", "label": 0}
{"text": "I live with someone like this and it seriously a difficult part of our relationship. \n\nIf I show up home with my hands full, to my house in a neighborhood that sees virtually no crime, with the sun up and 4+ people currently inside the house, to find that the door is locked; I se red immediately, now.", "label": 0}
{"text": "Used to do it with a paperclip as a kid.  Could definitely melt plastic and it did burn when you touched it lol", "label": 0}
{"text": "Due to covid I lost my sense of smell and taste for two years. Luckily (I guess)  I’ve always had sinus issues so not being able to smell things was not an exactly new experience, but this was profound. I couldn’t smell or taste anything. It did come back, but then I got a covid vaccine and it went away again, but only for a couple of weeks. \n\nIt wasn’t a soul-killing experience, but not a good experience at all. Luckily, my livelihood does not require either of those senses.\n\nSomeone else here commented that they could taste very sweet things.That was my experience also. As my senses slowly improved, I was first able to taste sugar/sweet things, which lead to what I call covid 19 (which was the 19 lbs I gained because I only wanted to eat sugar). Then, things smelled like they had gone bad, so I had to enlist family members as food smellers because I couldn’t trust my own senses.\n\nLong story short, don’t lose hope, your sense of smell/taste may well come back. But, as a warning, it may take a while. Or it may happen tomorrow.", "label": 0}
{"text": "Dashi Stock is still delicious with anosmia.", "label": 0}
{"text": "She may still recover it. It took a solid two years for me to regain my sense of smell/taste.", "label": 0}
{"text": "As I’ve noted in some other comments, it took 2 years for my sense of smell/taste to return. So no one should lose hope.", "label": 0}
{"text": "I lost my sense of smell for two years. Didn’t do the smell kit but it did return, so not agreeing that it will necessarily help. It won’t hurt, though.", "label": 0}
{"text": "Cool story but I would like to hear more about this balloon that goes up when you get embarrassed", "label": 0}
{"text": "An apology is all it will take.  It won't feel good, but it will go a long way.\n\n\n\"I'm really sorry for blowing up like that.  I was incredibly stressed about my dog and I lost control.  I was anxious to know if I needed to worry about rabies and was frustrated that I couldn't talk to you to find out if I needed to rush her to the vet.  I'd like to smooth this over if possible, I'm just glad that both dogs are OK.\"", "label": 0}
{"text": "I’m just picturing you on the chair full gremlin mode on a muffin and then just transitioning to peter griffin on the floor holding his knee. That sucks but I know the pain, I also suffer with hypermobility. There’s a certain way I can sleep that both dislocates a shoulder, activates my sleep apnea, and causes sleep paralysis and all it takes is sleeping with arms above head, when my muscles relax is when it all happens", "label": 0}
{"text": "It’s not even a conscious thought of mine anymore. I have consciously NOT lock my front door if I need to leave it unlocked. I’ve locked my partner out while jogging on more than one occasion because I had to go grab something from the car or take out the trash.", "label": 0}
{"text": "I’m a Crohns kid- but now 48 yo.  I’ve had more than a dozen ‘scopes with a myriad of prep instructions.  \n\nEat your T-Day meal without guilt or worry.   Maybe with a couple of light poop-making pills like Dulalax.  Unless you’re a very very very slow moving gut- you’ll be fine by the 3rd.   The Prep drinks that you’ll take 24-hours out will completely scrub your colon sparkling shiny clean.   No way around it.", "label": 0}
{"text": "Tell your dad, he's going to find out anyway and he'll be more upset if you try to hide it and/or lie.", "label": 0}
{"text": "i think i saw you hit a pothole", "label": 0}
{"text": "I got Covid last November. After 3 days of a 103° fever, I completely lost my sense of taste & smell. I ate out of pure necessity, and the texture of food became SUPER important. I once ate a few bites of cereal with spoiled milk, and immediately puked it up. I only ate things I had eaten before, so I could try to trick my brain into thinking I could taste it. My taste & smell finally came back in July, but now things are just...off. I used to love feta cheese, now it tastes metallic. Scrambled eggs smell like hot dogs. I've always liked pickles a normal amount, but now, I can't get enough of them. And certain scents (like candles, or plug-ins) are so overwhelming they make me gag. Whoever said it's a mind-fuck is spot on. Eight months of feeling like I was eating cardboard was miserable. I often wonder how bad it would've been if I hadn't been fully vaxxed.", "label": 0}
{"text": "Maybe give it a day or two to let everyone calm down a bit.  There is no guarantee that they will respond well, so be prepared for that, and ready to walk away if they respond negatively.  But as long as you've offered the olive branch, you're Gucci.  👍 \n\n\n(And none of this is mentioning that they did not have control of their dog which led to a very dangerous situation...  You did have a right to be angry, it just came out in an unmanaged manner... ha)", "label": 0}
{"text": "Your batteries have an internal resistance. So even if you shorted them with a Superconductor the current would not be impressive", "label": 0}
{"text": "Tell them the truth, express your regret, demonstrate you learned and are changing through action over time.", "label": 0}
{"text": "Revised phrasing. I know the batteries can't output 300 amps.", "label": 0}
{"text": "Username checks out.", "label": 0}
{"text": "Totaled a car as kid. My oldest just clipped someone’s parked car. Things happen. My parents handled my mistake well. I handled my kids mistake well. YMMV. Honesty is usually the best choice even if it causes problems. It demonstrates the responsibility your parents credit you with. If you can’t get the words out, bring him outside and show him. May or may not be a while in the tire. Offer to help with replacement either in cash or chores. No insurance claim is a huge plus. I say all this with the assumption your dad isn’t abusive. The calculus changes if that is the case. Good luck!", "label": 0}
{"text": "If he’s headed to work it’ll make it worse. If you don’t want to own up to it, just tell him the tire seemed low. If it’s a front tire be aware it could tweaked the alignment.", "label": 0}
{"text": "You're 18.  Be an adult and take responsibility for your actions.", "label": 0}
{"text": "Hey this is all of us! I am a dad now, and my kid just backed my truck into someone the other day. It was at school, so they just grabbed the student resource officer, got the other student, changed insurance and got it sorted. It was a teachable moment in handling things responsibly, and I'm proud of how my kiddo handled it. Being reponsible and owning your fuck-ups is the way to go, and it makes fixing it a lot easier. Besides, feeling guilty will keep you awake all night, and anticipation of punishment is a torture all on its' own.\n\nI also smashed my fathers' car when I was seventeen. It was no bump-up, either, I ran into a truck head-on and blew his car straight to hell. I ended up having to get a job at McDonalds, which he would take my dumb ass too after school, to pay off the damages I caused. You didn't goof up all that bad, bud, it's just a tire and you're gonna be fine.", "label": 0}
{"text": "Those are called real people skills.", "label": 0}
{"text": "You need to be more mature or turn in your driver's license.", "label": 0}
{"text": "Reading this comment, I was reminded of the tiny airports I've been to, and then recalled the one in Moab, Utah. I just needed to share this memory that has nothing to do with OP's story: They don't even have a baggage carousel at the Moab airport. They dump your luggage through a hole in a fence into a trough! \n\nFlying from the Denver airport to the Moab airport was airport whiplash.", "label": 0}
{"text": "That's a lot to Google", "label": 0}
{"text": "A big part of proving the responsibility that your dad has graces you with is owning up to your mistakes. Go tell him. Any repercussions will be much worse if you don't. \n\nJust tell him you hit the curb. It happens. You can tell if a tire has been driven on a flat tire so the pothole thought is not a smart one.\n\nAnd don't take this the wrong way. You're not a good driver. You're a new driver. This isn't to say you're a bad driver, you just just don't have the experience to be a good driver.", "label": 0}
{"text": "Agreed. ", "label": 0}
{"text": "Ahh sorry that's what they meant\n\nActually... 'Everytime' at my college is quiet.(Students can only access their school's 'Everytime'), so it's okay. A few weeks ago I accidentally turned on the instagram reels saying \"Oni-chan\" in the library, nothing posted.\n\nSo I just simply need to wear a mask when I'm at college so nobody can recognize me.", "label": 0}
{"text": "It could have been much worse! You're lucky it was just a tyre, but regardless, everyone makes mistakes.\n\nOwn up. You may be surprised to find out it's not such a big deal.", "label": 0}
{"text": "Yeah sorry lmao, kinda niche shit", "label": 0}
{"text": "Just rip off the bandaid and tell him. It'll be much easier if he finds out from you directly than it would be if he figures it out himself (which he 100% will) and realizes that you concealed it or lied about it.\n\nYeah it's gonna suck, yeah you may get in trouble. But you'd get in worse trouble if you dont own up", "label": 0}
{"text": "You need to tell him *before* he needs the car. Tell him the car was pulling to the side and when got out you saw the tire is really flat. It might because you came against the curb as you pulled in.", "label": 0}
{"text": "I guess I could get a new phone but I only have enough money for this one. They told me just to login with my phone onto the account since they all did it and I could see when they change the schedule faster. Next time I'll see if I can find another way to see my schedule and leave my personal phone out of it.", "label": 0}
{"text": "If you’re in the US,  no screaming. Good quality sedation. Don’t scare people.", "label": 0}
{"text": "Is that something that is required/ I can demand from an employer or can they just deny that privilege?", "label": 0}
{"text": "Tell him, apologize, and take your punishment without complaint. Anything else will make it worse.", "label": 0}
{"text": "What a rookie mistake. I can't even really feel sorry at this point.", "label": 0}
{"text": "Date101 lol.", "label": 0}
{"text": "Probably best to stop looking until ur brain moves on. Why the rush", "label": 0}
{"text": "Not to be alarming or anything, but after I regained my taste, which was only a couple weeks, I couldn't eat any animal protein, egg, meat, chicken, all  of it tasted like rotten egg. This went on for at least a year.", "label": 0}
{"text": "You did the right thing. And people are usually a lot more understanding than we expect them to be.", "label": 0}
{"text": "Especially a first date. Once you two are officially a couple, if she asks, THEN you can talk about an ex.", "label": 0}
{"text": "It is wild to me that anyone is mad about this post. 😂", "label": 0}
{"text": "Hey man, it’s a TIFU. BUT..with that said don’t be too hard on yourself. There will be other dates, maybe not with her, but this gives you some experience for the next one. While you shouldn’t be spending a lot of time discussing exes, it doesn’t hurt to be open and honest with people. Let it breath for a while then reach out and apologize. If she likes you then she’ll give it another go. If not, you’re just ripping off the Bandai’s early w/ this one.", "label": 0}
{"text": "They're called accidents for a reason. It's just stuff, stuff can be replaced so tell your dad and count this as a lesson learned :) You're safe and that's all that really matters, the rest is just stuff.", "label": 0}
{"text": "Take a whiff of the comments lol. I’m very close to the delete button. I thought it was funny and gave it a try. C’est la vie.", "label": 0}
{"text": "Thanks for the feedback!", "label": 0}
{"text": "Yeah man, we don’t like that shit one bit. I’m shocked she let you vent for that long.", "label": 0}
{"text": "It means you're not ready! Give it some more time. ", "label": 0}
{"text": "Were your two sentences written by two different people?", "label": 0}
{"text": "Did she block you?", "label": 0}
{"text": "Lol whoops. I'm sure he will understand", "label": 0}
{"text": "I've followed up a bit. It looks like the two cause different issues. I've also lost a bit of hearing since posting.\n\nI'm having SO much fun 😊", "label": 0}
{"text": "I guess you’re right. To my digression I wasn’t necessarily driving bad I just made a mistake not that it makes the situation better tho", "label": 0}
{"text": "Assuming we know what PR is.......", "label": 0}
{"text": "To be fair it’s not always disastrous…I once talked far too much about exes on a first date….25 years later we’re married with 2 kids. \n\nShe later said she felt sorry for me for how I’d got my heart broken.\n\nBut in general still probably not a great idea", "label": 0}
{"text": "Even less than that!", "label": 0}
{"text": "That’s the attitude, you know you fucked up and can do better. Move on and good luck.", "label": 0}
{"text": "While a personal apology is off course better, you can always start with a note if your anxious about facing them, that way the chances of them responsding positively when you eventually go see them.", "label": 0}
{"text": "Laughing about this for weeks? They will be laughing about this until the day they die, you’re a legend.", "label": 0}
{"text": "Also, unless he is very close, with his brother (or shares makeup) and doesn't maintain personal hygiene he could catch it. I'd just go with my general gut instinct on matters like this, if the thought of me licking it makes me vomit, wash my hands. Then, wash them again. And for the love of all that is holy, always use the back of the hand when touching your face. \n\nAlso, on a semi-related matter. Maybe explain how conjunctivitis is transmitted, and query how often he washes his hands... you know. asking for a friend....", "label": 0}
{"text": "Noooo! Don’t tell me that", "label": 0}
{"text": "The woods are an unforgiving place…. At least take a bud out next time.", "label": 0}
{"text": "Public urination is how people end up on a list.\n\n\nWho cares if some people you'll never see again and definitely won't recognize you laugh about seeing someone pee in a bush?", "label": 0}
{"text": "good on you for tipping her!! she’s a real one for washing them anyway. now you know to check beforehand next time !", "label": 0}
{"text": "Maybe they will grow apart. If not it will just be once in a while - a bunch of 50 year olds “hey remember when that woman pissed in front of us? 😂”\n\nNo big deal though, it’s just a funny story. Hopefully you can laugh at yourself eventually.", "label": 0}
{"text": "I think I just scrolled past a TikTok video of this /s", "label": 0}
{"text": "Why you gotta call me out like that?", "label": 0}
{"text": "What’s wrong with peeing on this side of a highway? You gotta go you gotta go", "label": 0}
{"text": "Were they boys? I would NEVER forget that day and I would bring up that story anytime peeing outside is brought up 😂", "label": 0}
{"text": "You're lucky it wasn't a gaggle of girl scouts. You'd be telling your cell mate your sad story. Please be more aware of your surroundings.", "label": 0}
{"text": "They did. And it’s in the spank bank", "label": 0}
{"text": "That is like rule 1 in Dating 101", "label": 0}
{"text": "Damn. I hope you never run into them in public again. That’ll be really awkward.", "label": 0}
{"text": "That was my thought exactly. They’ll bring that up after they’re all grown with kids, sitting around a campfire drinking beers", "label": 0}
{"text": "Teenagers are more unforgiving lol... hope she doesn't run into any of them again", "label": 0}
{"text": "I'm an adult and while I would not stare and would quickly and discreetly turn away, I would silently be laughing my ass off.", "label": 0}
{"text": "Imagine the teens are on reddit and go \"hey this sounds familiar\"", "label": 0}
{"text": "divorce your husband NOW", "label": 0}
{"text": "amen!", "label": 0}
{"text": "That's kinda on the company. I'm like a 3rd your weight and ate a 12 count chic fil a nugget the other day. I was still hungry. 6 nuggets is a child sized portion. 20 nuggets is a reasonable meal. This is why you don't buy chicken nuggets for a group of adults. You buy chicken strips. 6 chicken strips is a generous meal.\n\nA snack is one thing, but if they're providing lunch then they should provide enough. This is like a school pizza party where you only get a sliver.", "label": 0}
{"text": "Badly, I agree. But I've brought up exes before in a positive way(she was great but we wanted different things, etc) and it usually goes well ", "label": 0}
{"text": "were the tears fat, or the man? also being watched by god 😂 😭 I have felt that", "label": 0}
{"text": "If they are male teenagers you may even have a few a lifetime fetish with them thinking about you until they die. ", "label": 0}
{"text": "The teeny weeny Afro phase will grow out if you love & take care of her x", "label": 0}
{"text": "Step student...what are you doing??? \n\nJk, the whole \"getting stuck somewhere\" is such a trope, I couldn't resist. Not that I'm into it, but everyone memes about it 😂 Glad you were able to get out and enjoy your view as well 😉", "label": 0}
{"text": "Pretty uneventful story tbh", "label": 0}
{"text": "AI-ass bot. ", "label": 0}
{"text": "same", "label": 0}
{"text": "I have thought I had it since I learned about it in the mid 90's. I haven't ever been diagnosed either, but I have cousins that recently were. \nIt is common in some families.  I don't know if having a diagnosis is helpful or not. \nI strangely have never mentioned it to my doctors. But it might help to bring it up in a visit. \nI did have a chiropractor tell me my joints were sloppy and way too loose. Lol.", "label": 0}
{"text": "Thank you, ChatGPT.", "label": 0}
{"text": "He's such a good boy when he wants to be. For some reason he gives me no trouble putting the donut on. \n\nAs a reward he gets a treat every time....but mostly because I feel bad putting it on even though it's in his best interest.", "label": 0}
{"text": "That would be embarrassing, good that you were able to extricate yourself. But please remember that your safety is the most important thing. \n\nIt's not wrong to ask for help. Everyone screws up.", "label": 0}
{"text": "This was a very strong mistake friend. I had not smoked for years and drank one little one from the dispensary. My son & his friends (18 & up) thought it was hilarious. It was not hilarious.", "label": 0}
{"text": "Lol. No!", "label": 0}
{"text": "You've never ever spoken about an ex? I've been with my missus for 17 years, if neither of us had even mentioned it that would just be weird.", "label": 0}
{"text": "Idk I wish my date the other day talked more about his ex on the first date cuz it was only after like 4 dates when I found out even though the broke up like 6 months ago they were literally still living together like wtf. Tell me so we don’t waste both of our times lmao.", "label": 0}
{"text": "Oh absolutely agree there.", "label": 0}
{"text": "This is Reddit. You have to expect some pedantic people who also have a background in whatever you post, no matter how mundane or obscure.", "label": 0}
{"text": "Probably has Autism, EDS, POTS, Fibromyalgia...", "label": 0}
{"text": "Thank you kind redditor for remembering the pupper tax! Bandit is adorable.", "label": 0}
{"text": "She never lost her smell though. Just her taste. Kinda different from everyone else.", "label": 0}
{"text": "It feels like all the good partners will be taken if I postpone.", "label": 0}
{"text": "I see what you did here", "label": 0}
{"text": ">  Protect your tendons.\n\nMy brother sister and I are all over 40 and our tendons are falling apart LMAO. All of our hips pop out randomly. Our parents were old before we were born so we are all trying to keep strong, but my abdominal muscles are TOOO strong. Its caused me a knock-on effect of causing \"restricted airway disease\" on top of my \"obstructive airway disease\". \n\nIt was only caught because I straight up MADE my own reishi tincture from stuff I IDd in my yard because I am struggling despite having all the doctors. The first time I put 5 drops under my tongue, I could feel my shoulders and diaphragm relax and it was like I didn't have to \"manually breathe\". \n\nSo now I am going to see an orthopedist for my hips because apparently I am so tight in my pelvis from bracing my floppy hips which in turn is causing my entire torso to be wrung tight. Im working on releasing my psoas muscles and any time I manage to momentary unclench my ab muscles it hurts which causes me to re-clench my abs. Its the weirdest feeling.  BTW if any of you have skinny poops- that might be why.", "label": 0}
{"text": "God, fr, been on both sides of that nonsense. Thank fuck it went away after some time", "label": 0}
{"text": "I guarantee this guy has already written her multiple super long texts. The fact that they didn't text when they got home or the next day is the sign. \n\nBut if he can write a small text \"Sorry about all the ex talk, can we have a do-over?\"", "label": 0}
{"text": "That kind of thing probably happens at least once to every relative who's a caregiver, so you really shouldn't feel bad. Now you know: 1. that there is a problem and 2. how to deal with it. And why punish the laundromat lady with taking away business from her? She didn't sound like she never wants to see you again, though obviously she'd like the system to be handled differently now.", "label": 0}
{"text": "Before my sister realized how heavily heritable it was, her daughter taught herself how to put her hands together in front and flip them around to the back without taking them apart. I only just realized how badly my knees go backwards when I had my feet up on the coffee table on top of a pillow and scooted back and WOMP.", "label": 0}
{"text": "Please don't not go back. She probably went back and forth with herself on whether to even say anything, and when she did, it was done in a very kind way. She didn't mention not doing it anymore or charging you extra. I have elderly parents. Your dad was probably mortified and hoping the laundry people didn't notice. I wouldn't say anything to my dad and when I dropped off his laundry, I'd make sure she knew it's dad's clothes. This way she can use whatever PPE she wants and she knows there's a large tip coming when it's picked up. \n\nSide note, my mom has dementia and my sister does her laundry. Trust me when I say that you do not want these clothes in your washer and dryer.", "label": 0}
{"text": "https://preview.redd.it/1xxwuwxxe6xd1.jpeg?width=3060&format=pjpg&auto=webp&s=609bd2513d32e0b7bb52a4687c09059a1cf9ec17\n\nHe's the best boy", "label": 0}
{"text": "I squeed myself 💜", "label": 0}
{"text": "Honestly, the mental toll of feeling that shitty with no end in sight is what really got to me. \n\nFor 8 weeks straight, both times, I'd keep telling myself, \"It's almost over. By next week, you'll feel so much better\" just to feel terrible in a slightly different way the following week.", "label": 0}
{"text": "[https://www.reddit.com/r/Jung/comments/1gayt4k/comment/ltifafa/](https://www.reddit.com/r/Jung/comments/1gayt4k/comment/ltifafa/)", "label": 0}
{"text": "It's great that you have the introspection to grow from this moment.", "label": 0}
{"text": ">I used to pee literally anytime I laughed.\n\nWhat changed/happened? \n\nHmmm interesting I just looked and they DO make washable incontinence pants. Period pants caution that they aren't for \"full bladder leakage\" but they can handle some.  Fabric technology has come a long way from crinkly vinyl with a wet cotton burrito like back in my grandma's day. \n\nI was visiting my brother at the Papa Johns he worked at once and the shy chubby kid ripped his pants. He really needed the money and he had no one at home to bring him pants and he didn't have a car anyway. So  I took him to the office and covered the window and stapled his pants back together for him with him in them because of how they ripped. In retrospect (over a decade and a half  later lol) I should have just driven him home so he could change, but we just covered it by having him wear an apron backwards just in case and he looked so relieved to just have something solved before he could really work himself into a stressed out Friday.", "label": 0}
{"text": "Thanks to this thread, I just found out they make WASHABLE incontinence underwear these days! \n\nI am a woman but I had a pilonidal cyst surgery when I was 19 and there was a boy the same age who had it worse than mine. We never met because of HIPPA but I did pass on some pad tips to him via the nurses lol. A few years later I found this story. Its a good read. \nhttps://pandce.proboards.com/thread/452153/lol-maxi-lessons-burrito-pants\n\nI have a friend who is a rat researcher for Parkinsons. I hope there's good news for you soon!", "label": 0}
{"text": "I'm a big time pot head but people getting fucked up on edibles are making flights unbearable. Every single flight you have some idiot greening out or acting like it's the first time they've ever gotten high and a flight isn't the place for that.", "label": 0}
{"text": "Ahhh I wish there was an archive of this one", "label": 0}
{"text": "Apologize and ask (if you must) just once each. OP sounds like he might need this specificity. TBH doesn’t sound like he’s ready to date.", "label": 0}
{"text": "Yeah I mean I think it's pretty obviously like the #1 most common red flag for people if they aren't ready to move on from an ex.", "label": 0}
{"text": "Also the ruler didn’t seem relevant to the story at all.", "label": 0}
{"text": "At best you can say you saw it and played with it. I would honestly delete this reddit post though also. If the cat was not in a good condition, leave it with the new owners. It deserves better than the street life it had. ", "label": 0}
{"text": "You didn't fuck up. You might fuck up if you confess to this or if you make a deal out of it. So what, you played with a random cat? Not your fault the cat went missing shortly afterwards. You didn't think much of it, you pet cats all the time.", "label": 0}
{"text": "Do what's best for the cat. Now you know how to proceed.", "label": 0}
{"text": "The ruler is connecting the two batteries on the other side from the scissors.", "label": 0}
{"text": "Cat probably didn't like living with them if it didn't stay inside their house. Conditions were probably not good or they weren't treating it correctly.", "label": 0}
{"text": "I used to work at dry cleaner that also did wash/fold. EVERY time either w/f or comforters would come in, I'd just ask them if there was any type of human or animal mistakes that we needed to know about. If there was, I'd mark the bag with a big red sticker indicating a biohazard. That was solely for the cleaner in the back to take precaution when taking the items out of the bag.  \n\nNo need for you to be embarrassed. We saw it all and were used to it.", "label": 0}
{"text": "I had a roommate that would constantly lock the handle front door lock rather than use the deadbolt. I had to use tape to remind her not to use the handle lock to prevent accidents. One time I Locked myself out without my phone in my pajamas in the middle of winter - thankfully a kind neighbor helped me out and let me use her phone but there were a good 20 minutes of cold panic", "label": 0}
{"text": "omg are you okay??", "label": 0}
{"text": "lesson learned haha", "label": 0}
{"text": "Give it 3-4 months, and kitty will plump up, become shiny in the coat, and look like a different cat. Problem solved.", "label": 0}
{"text": "You rescued a neglected female cat.  This person had a male cat that stayed in their yard.  Different cat.  Not your problem.", "label": 0}
{"text": "https://preview.redd.it/3oltpem8o6xd1.jpeg?width=1080&format=pjpg&auto=webp&s=d34e607f881f6420ecbaccef175b4209f513265f\n\nNuh-uh", "label": 0}
{"text": "Listen. They have 0 proof this is the same cat if you keep your mouth shut. They don’t even have the right gender. If you’re questioned, you just pet said cat. That’s it. Ride this out.", "label": 0}
{"text": "Or they’re lying about it being their’s and just want the cat around and not living with them", "label": 0}
{"text": "Literally I wouldn't give a shit. If someone else wants to let their cat waste away outside, then fuck them. If they wanted her so badly, they would have taken measures to make it obvious she was a beloved pet. You did the right thing. Even if they have footage of you playing with the cat, they would have to jump through hoops in court to prove they \"owned\" it. If they pester you on the street, just ignore them. Wasting time trying to defend yourself will cause more harm than good.", "label": 0}
{"text": "That's your cat now", "label": 0}
{"text": "This. \n\n“I didn’t even see that cat. It’s black? No way, I’m 80% blind in one eye and completely blind in the other. I can’t even see you right now. Actually, who are you? Where am I?”", "label": 0}
{"text": "Learn to lie.", "label": 0}
{"text": "There’s a lot of identifying info on this post, which is in a popular subreddit. You might want to take it down before someone in the group sees it, regardless of whether they may or may not be sympathetic toward you from all the info here (they should be, but you can’t help some people).", "label": 0}
{"text": "Sure. But I don’t think 5% bf at 200lbs 6’1” is typical", "label": 0}
{"text": "I think you’re definitely outside the norm. Healthy weight for a 6’1” person with a typical body composition is in the 180s.", "label": 0}
{"text": "Shit OP, hope you recover. From the BM and lack of taste...", "label": 0}
{"text": "Don't worry so much. I'm sure seeing the terror on your face and the generous tip she realized the mess up wasn't on your end.", "label": 0}
{"text": "This is not factual. I did the colonoscopy prep drink the night before - mix it with Gatorade and it’s super easy. It’s not 5 days. You “should” practice a healthy diet 3-5 days in advance to help with the prep.\n\nI went it in noon, took a 45 minute nap, and attended a dinner party that evening.", "label": 0}
{"text": "So tell me, how would YOU interpret these instructions....\n\nhttps://i.imgur.com/KSvBz2I.jpg", "label": 0}
{"text": "That's the only way I knew I even had it \"back in the day\". Took a sip of my morning energy drink and just kind of went, huh my drink is weird this morning. It has no flavor. My boss promptly sent me home", "label": 0}
{"text": "First, listen to your doctor!!!! \n\nI would interpret it exactly as I told you…a healthy diet 3-5 days prior. This sheet is just giving you advice…I don’t get a sheet like this and no further instruction other that to drink the prep.  Trust me, your prep drink will do the trick, eating a healthy diet will just make the cleaning out that much easier ON YOU.", "label": 0}
{"text": "Seriously. I dare OP to find me a 450 watt battery. At 2 batteries, you could almost power a 1000 watt microwave with 2 AA's", "label": 0}
{"text": "Rubbing alcohol and acetone will remove most glues. I don't know that I'd use acetone but rubbing alcohol won't hurt like 99.99% of common surfaces. Could try soaking some 99% on there just to see what happens.", "label": 0}
{"text": "I appreciate this so much. Super suggestion thank you", "label": 0}
{"text": "We have an appt on monday with his doctor and will be bringing this up. Thanks so much! You all are making me feel a lot better thank you", "label": 0}
{"text": "This is hilarious 😂 I’m glad you’re okay though. I would’ve been pretty scared if my head was stuck.", "label": 0}
{"text": "Thank you for sharing and i so appreciate your thoughtful suggestions. Im so sorry about your grandma but it sounds like she raised an amazing grandchild", "label": 0}
{"text": "Came from a youtube video but I have to say this made me laugh harder than anything else has in so so long my stomach was cramping and I am literally still wiping tears from my eyes as I type this. Everything hurts 😭", "label": 0}
{"text": "Set a reminder and alarm on your phone. Also make a to-do list on your notes, it will help a lot, speaking as a person with ADHD.", "label": 0}
{"text": "What a dick move.", "label": 0}
{"text": "Time to grow up from 8th grade", "label": 0}
{"text": "Maybe don’t go kicking things in general?  Even if it were a mannequin it’s not yours and you probably shouldn’t kick it.", "label": 0}
{"text": "Dick move to kick real mannequins, then you kick an actor. WTF is wrong with you? Are you 12?!", "label": 0}
{"text": "Are you 5? Should've charged you for assault.", "label": 0}
{"text": "This story is nuts.", "label": 0}
{"text": "Oh man, that’s a tough one! You were just trying to help out, and suddenly you’re in a sitcom-level laundry disaster. Honestly, props to you for handling it so well; a lot of us would’ve just considered moving to a new zip code at that point. \n\n\n\nOn the bright side, you now know the laundromat MVP in town—and she got a great story (and tip!) out of it. Maybe next time just throw some “disclaimer cash” in the bag ahead of time and give a knowing nod on the way out. You’re doing a good thing for your dad, embarrassing laundromat encounters and all!", "label": 0}
{"text": "Yes. It's a cute story, made me smile and I don't know this could make someone mad. Are they looking for cousin-fucking or something?", "label": 0}
{"text": "r/iamatotalpieceofshit", "label": 0}
{"text": "I worked at one in high-school and got punched in the chin. Didnt really hurt and I thought it was funny tbh. They made it clear that it's a possibility and happens fairly often.", "label": 0}
{"text": "Acetone will take Krazy Glue off, but it might also mar the finish of the laminate. I think you’re going to have to live with the scratches.", "label": 0}
{"text": "Did anyone else clock the lovebombing she did between the first and second breakup?", "label": 0}
{"text": "You told him what the fuck dude, right? Right?!", "label": 0}
{"text": "My friend did this, kicked an actor in the head. Shit got real as the actors yelling in my friends face. This was a over a decade ago but it does happen when you and your friends are a bunch of gremlins. This is the shitty immature stuff you gotta be better than even if it was a mannequin. We all grew up a little that day hopefully you did too.", "label": 0}
{"text": "OP, it seems like you’re going through a lot. It’s not fair for you, for your mom and your sister to make you so involved in their (poor) relationship. Maybe your sister is breaking rules, but you aren’t her keeper, and you aren’t your mom’s security force that must report all happenings in your house to her. Your mom is placing a lot of responsibility on you. Please don’t feel guilty and don’t beat yourself up. Whatever happens to your sister, or your mom’s relationship with your sister, etc, isn’t because of something you did or didn’t do. You’re just a kid.", "label": 0}
{"text": "I hope my sons cover for each other always. I want my sons to be a team. Maybe your mom is different but I feel like this is kind of controlling relationships and creating division between siblings to have the expectation that one will snitch on the other. In our home- I have rules like your mom, but among those rules there is an unspoken rule that if  one brother snitches on another - I will be just as disappointed in the one snitching. The exception to this rule is if his brother is doing something that puts him or others in danger.", "label": 0}
{"text": "It seems like he has one long grazing period that is both lunch and dinner and lasts all afternoon, during which he regularly consumes 5 footlongs worth of food.", "label": 0}
{"text": "My mom also doesn’t have a problem with me helping my sister, everyone has secrets. But in cases like these is where she draws the line", "label": 0}
{"text": "Your fuck up was in being a snitch, and you are getting your deserved comeuppance for it.\n\nYour sister is being completely normal, your mom is being controlling, and by snitching you are participating in the controlling behavior and are being just as weird and messed up as your mom is. Maybe try being a good sibling instead of a childish tattletale?", "label": 0}
{"text": "When I lost my sense of taste from miss rona, sprite was the most indescribably violent sensory experience with zero flavor. I think I had like 3 of them anyway. I’m glad I didn’t experiment too much with food trying to find flavor or I may have made the same mistake as you did lol.", "label": 0}
{"text": "First year i worked for my current employer, I went to their holiday lunch. They advertised it as being turkey, ham, and all the standard holiday sides. They also said it was supposed to be served in two shifts, to accommodate for different lunch shifts, with plenty of food for everyone. Our group were on the phone and so had to stagger our lunch so that there was coverage - my group was in the second shift. By the time we got there, the only things left were green salad (no salad dressing left) and rolls (no butter left). They sent out a survey after, asking for feedback, and we complained. The following year, they said they would do better. The same thing happened. That was the last time I attended their holiday lunch.", "label": 0}
{"text": "Omg this is horrid!! I was expecting bugs 🤮", "label": 0}
{"text": "Knock, knock.", "label": 0}
{"text": "See that's why I'm thinking there's a chance I could get away with it, at the beginning of the year they made us fill out a sheet with every single item and utility in the dorm and a scale on how damaged it was. I talked to my RA and said everything was fine but there were small scuffs and scratches (none as noticeable as the ones I made) all over and she said it was fine and to be expected so there's already documentation of there being scratches in the dorm and hopefully they take that as something that wasn't my fault", "label": 0}
{"text": "How deep is a scratch that leaves a white mark that disappears when an area is wet? There's other scratches I've seen on the countertop while trying to fix it but those are invisible to the eye when not actively paying attention to it. I'm just trying to scale how deep or shallow the scratches I made were and if there's a chance at all of salvaging this", "label": 0}
{"text": "Responding to your edited comment, I can't understand why anyone would not find this funny and leave it at that. I guess some folks locked their sense of humor outside when they came in. Good story - thanks for sharing it!", "label": 0}
{"text": "This is not your FU.  This is a epic TIFU in the making by your mother which would be titled something along the lines of \"TIFU by forever ruining the relationship that I have with my children\" (would be a bit hyperbolic as these relationships sometimes mend over time due to higher levels of maturity in the kids but this also depends on the parent being mature about it all).  She has already ruined the closeness of her daughter for god knows how long and now she is working on doing the same with you.  Is she not aware that your older sister would make your life hell if you told on her?  That the person who should have been responsible for keeping your sister in line when the mother was away was your grandmother rather than you?", "label": 0}
{"text": "Omg so much this.  I almost cried for you reading this post.  It isn't healthy to be expected to be your sister's keeper.  It isn't right to be made to feel so much guilt.  Your mom and your sister need to work out their own relationship, you have no place there.  \n\n\nAnd, frankly, it seems as though your mother might be deserving of low-contact when you are an adult, although only you can truly be the judge of that.  But, I myself might focus more on making sure my relationship with my sister remains undamaged, as she might be the one you are closer to in the future. ", "label": 0}
{"text": "If someone asks me a specific question I don’t lie. If they ask me a vague question then I do. \n\nIf she asked, “Has anyone been over recently?” I would have been vague but she asked “have your sister invited a boy over while I was gone?” So I assumed she had enough info so that I couldn’t lie safely. For me lying is like a video game, Everytime you get caught in a lie you lose credibility points so i try not to lie if I know I’ll be caught often but at the same time I take what people say literally so I end up being gullible. \n\nI don’t normally snitch but if I do it’s over something that %100 know is the right call I don’t know if it was my place to say anything or not so I didn’t. I have defended my sister in the past but this was one of the things I was unsure about.", "label": 0}
{"text": "Fyi: \n\nAcetone = nail polish remover", "label": 0}
{"text": ">he intended to snitch her into therapy\n\nI didn’t mean it like that, I didn’t want to be the cause that my mom and sister ended up not talking because their relationship was on thin ice and they were getting closer again. It was never a good time for me to bring it up", "label": 0}
{"text": "I had three AA's that short circuited and melted their own wrapping inside a device once. Took them out immediately once it got warm and got blue shit from the wrapping all over my fingers. Not the best day of my life.", "label": 0}
{"text": "I told them that I feel like a double agent sometimes", "label": 0}
{"text": "Sue the water company for making their water so clean and hydrating.", "label": 0}
{"text": "She's an adult, an adult having sex is not \"out of control\" IMO. Idk if maybe shit has changed, I'm 32, but thinking back to being 16 OP's sister sounds completely normal, teens have sex and experiment with drugs and alcohol. Is it ideal? Nope. But it was a normal part of growing up for a lot of kids. \n\nMy sister is the most responsible person I know, stable job, stable relationship, stable life, always keeps her word, never shows up late to anything, never misses a payment, lives within her means, etc. She wasn't an irresponsible kid either, my preschool was in the high school and she used to come visit me during lunch and/or her free period to check on me, just because; she used to babysit me a lot as a kid, straight A student, had a job since she was 15 and never skipped out or anything. She's genuinely always been a great role model... And when our parents went on vacation for a week she threw a party where one of her guests managed to stain the goddamn ceiling of all things. Just normal teen shit, she got grounded for a week and had to paint over the stain (we had some touchup paint stored away, my sister just didn't see the stain, she didn't think to look up and check the ceiling 😂), and everyone moved on. \n\nBut I do agree that if sis was doing something genuinely dangerous, like if he thought she was being groomed, falling into addiction, or was otherwise concerned that she was ruining her life or going to get herself seriously hurt/killed and was telling his mom out of genuine concern for her then I fully agree that that wouldn't be snitching. The person whose being 'snitched' on may feel differently,", "label": 0}
{"text": "That’s a good start.", "label": 0}
{"text": "If I thought the dude was a genuine danger to my sister, if I had reason to suspect she was being abused by the dude, if she was young enough to be groomed (and there was enough of an age gap to consider him a groomer) or anything like that where I was worried for her safety I'd be 100% telling someone. She'd be pissed at me, but if it kept her safe it'd be worth it. \n\nIt doesn't sound as if that's what you were worried about here though.\n\nLike man, you turned the camera back on in an effort to get her caught. Also in your story nobody asked you initially... you just randomly came out and told your grandmother.", "label": 0}
{"text": "He did though. Nobody asked at first, he just randomly told his grandmother about his sister having a guy over.", "label": 0}
{"text": "Because of a lack of the payoff. You don't get all that dopamine from winning when nothing's on the line. To take it back to slot machines, why not just play a free online one instead?? Because you don't get the payout when you win", "label": 0}
{"text": "Make sure you research the problem thoroughly first for solutions. You'll instinctively want to fix it as fast as possible. Take your time. Try solutions on a very small area first. If it doesn't work. Don't lose hope. Just don't rush the process. Don't be afraid to leave it for a few days. See if you even notice it after the initial oh shit has worn off.", "label": 0}
{"text": "Yeah I'm just gonna ask for help if I go into trouble again lol", "label": 0}
{"text": "How do you manage to fuck up like that? Are you not aware of what you’re doing?", "label": 0}
{"text": "My sister said she didn’t care who I told since she was out of the house, the guy was roughly her age from what she said.", "label": 0}
{"text": "But do they turn from the outside regardless? On my doorknob it doesn't turn on the outside at all. So while I'm doing it unconsciously, it acts as a final alarm that something isn't right.", "label": 0}
{"text": "Don’t feel forced to. I write a lot when I’m feeling bad :) it’s a skill to distill your message, one I can work on", "label": 0}
{"text": "Your mom obviously doesn't believe in the \"snitches get stitches\" rule. You weren't actively lying about your sister if you answered honestly when you were asked directly. Not telling on her is just siblings looking out for one another. Your mom sounds like the type that's eventually going to alienate all of you and wind up in a home in her old age bitching that none of her kids come to visit her when she's already cut you all off from not living up to her standards. \n\nJust live your life, get out of that toxic household ASAP when you finish school. If she helps you with college then fine, but don't expect it as she'll be on the lookout for anything that doesn't fit her moral standards to punish you by cutting you off. I'd stay in touch with your sis instead of going LC with her if it were me, but I'm an only child who always wishes I had siblings so maybe that's my idealism of sibs being close to each other. \n\nAlso, on the whole college thing? Tech schools, community college, and trade schools are all options instead of traditional 4 year college programs that many many people end up with a great career from. Don't let her push you into a 4 year degree just because that's what she demands. Do what you want you feel is best for you, she doesn't get to make that decision.", "label": 0}
{"text": "go to a docter before yoy give us covid-2u", "label": 0}
{"text": "The bottle didn't get screwed, but you got screwed bigtime.", "label": 0}
{"text": "Shit happens.  Literally.  Explain, apologize, compensate them properly and move on.", "label": 0}
{"text": "If you do this on any date, but especially a first date, it means you’re not over the relationship and you shouldn’t be dating right then. It’d be better to wait for you to get over it first. \n\nI’m 64 and when I was in my 20s, I read somewhere that you should wait at least one month for every year you were in the relationship before you should go on a date. \n\nBut I broke up with a girl I was into very much but was with for only 6 months and I didn’t get involved with anyone for over a year afterward. I don’t remember exactly how long at this point but this was like the first really serious relationship I’d had. But I did go out with a few different girls after that and things weren’t good.", "label": 0}
{"text": "we were talking shit as siblings do and she randomly said that, i confirmed a day later and she said she was serious. \n\nfor me, at first i didnt know what it was so i plugged it back in because i thought it was wifi related, until my sister made a comment on it then it clicked. the second time was on purpose so i didnt have to explain to my mom later why. And for my sisters sex life, everybody in the close family knows because she has several moments related to it. My grandmother brought up my sisters drinking and sex life because my sister drunk called her the night before", "label": 0}
{"text": "i now got a clearer head. My sister drunk called me and my grandmother back to back and my grandmother ranted to me, thats how it got brought up. \n\nIve been assuming my grandmother told her or my sister blurted it out in while talking with our mom but i left that put being i wasnt think clearly", "label": 0}
{"text": "That does happen. \n\nAnd yeah me too man. Here’s to the hidden future", "label": 0}
{"text": "I can confirm that 99% isopropyl alcohol does dissolve CA (super glue) although it takes a while", "label": 0}
{"text": "Your date is not your therapist.", "label": 0}
{"text": "Dude....\n\n\nI would seriously take a very long, hard look at your social interactions in general.\n\n\nIn totally her being nervous and rambling, it happens to all of us. But to not notice someone is uncomfortable for 15 minutes is a lot. Make sure you aren't engaging in this with others too.", "label": 0}
{"text": "Don’t EVER talk about past relationships. That also goes for if you’re already in a strong one. Nobody wants to hear about past love lives even though it’s no longer a thing. Only mention it when someone else brings it up and even then keep it to a minimum when talking about it. Bringing up exes does no good and only causes issues. But use this as a learning experience. Next date you’ll be even better because now you know what NOT to do so you won’t screw it up in the same way.", "label": 0}
{"text": "Oh my GAWWWD. Update me on whether you get sick or not in the next two days. I'm invested now lol.", "label": 0}
{"text": "Yes that bloody mastiff put me in some odd predicaments at times.", "label": 0}
{"text": "i’m going to call and ask for a refund tomorrow, i think she was extremely deceptive but there’s nothing on the packaging itself or anything that claims the art is made by a human", "label": 0}
{"text": "i’m extremely dissapointed because i think that people who do tarot for fun and introspection like myself aren’t looking to make a quick and easy buck like this evil witchy bitch charging $20 for a tarot reading with her shitty AI-made tarot cards that she can’t even bother to memorize the meanings of", "label": 0}
{"text": "That he was... that he was indeed", "label": 0}
{"text": "The sellers know that whoever believes in Tarot will be gullible enough to be ripped off otherwise, too. Learn some critical thinking and ditch that superstitious BS.", "label": 0}
{"text": "To be fair, shouldn't you have seen this coming?", "label": 0}
{"text": "Quelle surprise", "label": 0}
{"text": "Not without a real tarot deck 😄", "label": 0}
{"text": "Normally would... But you see my crystal ball is currently in the shop.", "label": 0}
{"text": "Send her an apology", "label": 0}
{"text": "Practice makes perfect! Don't beat yourself up! Also, take care of yourself! Remember that you had NO OBLIGATION to take care of his arousal!!! \nGuys do this shit all the time! I did it when I was younger and look back on the behavior as it really is. These things are messy. If he's interested in continuing the relationship he's gonna have to meet you at your level. \nMaybe seek some professional help with your triggers that have to do with intimacy. None of these things are easy and I wish you the best of luck on your journey!", "label": 0}
{"text": " There's two ways to utilize Tarot. There's believing in a spirit of the deck guiding the readers worldview and there's no such thing as random chance, or there's using the spread/draws to take a moment for a focused introspection similar to how rorschach tests are used. Often it's the first method causing the second. No need to be unnecessarily aggressive just because you've got some scientific derived pseudo nihilism mindset. It's ironic OP is disappointed in negative karma tainting her tarot deck and you're blasting her for \"karma\" on reddit. Live and let live grumpy pants.", "label": 0}
{"text": "at the end of the day it doesn’t matter whether you think i’m gullible or not. there are good and bad people in every single community that exists, not every tarot enjoyer is trying to exploit other people. i wanted to buy a deck because i enjoy a hobby that encourages introspection. i don’t care whether you agree with that, what i care about is that i bought a fucking product and i was made to believe that it was made by a human.", "label": 0}
{"text": "While i myself an not into Tarot itself, i see it as a way of someone starting out as a zero (The Fool) whose journey through life transforms them into a total bad ass (The World) capable of slaying Gods and Eldritch brings \n\n&nbsp;\n\nAnd no amount bad actors can like said lady can change that perception from me", "label": 0}
{"text": "Happens to the best of us! Lol I never really got good at it", "label": 0}
{"text": ">I really liked him and I didn’t want to leave him unsatisfied or make it seem like I didn’t want him so I got down on my knees to give him head.\n\nYou don't have to do that you know.\n\nI mean, if you wanted to do that it's totally ok but you don't have to care if he's satisfied or not.\n\nAnd that works with all gender.", "label": 0}
{"text": "I mean if the book was good, I won't complain.\nIf I buy a book I buy it for the content, not for the author.", "label": 0}
{"text": "I wouldn't really care if the book was written by a computer so long as it was good.", "label": 0}
{"text": "no you shouldn't", "label": 0}
{"text": "I'm a city-dweller myself (though not in the US) so I get it, but having just been traumatised by nearly locking yourself out you then went and tried to do it again immediately!", "label": 0}
{"text": "Not advice related, but this was totally NOT your fault. You told him that it was your first time, yet he still decided to stick his penis down your throat and then cum. That kind of play takes practice and skill and is not advisable for a first-timer. Chump brought it upon himself. I swear, some dudes watch waaaaaay too much porn. \n\nOn another note, if you plan on doing this in the future, I would suggest buying a toy to practice on. Or, find a guy that is not so rough and will be patient enough to let you practice on them. That way, when the time comes around again, you won't be anxious about giving a blowjob. Like all things, oral sex takes practice.", "label": 0}
{"text": "I mean... Bro got his nut, accidents happen, especially if you're face fucking a virgin. Like... Poor OP, yeah, poor guy, no. He played, he got an outcome that could happen, if he's an adult, he'll be chill about it.", "label": 0}
{"text": "This dude is a dumbass if he thinks he can grab and throat fuck someone who just said they've never given head, it's like asking them to puke on you.  I have emetophobia and would be absolutely livid if a dude tried to pull that on me, if anything HE should apologize. \n\nAlso pro tips sticking out your tongue is more likely to make you gag.  If you keep it kinda pressed against the back of your throat you avoid some dude's junk smacking your tonsils and triggering your gag reflex.  If you do legit deep throat do it slowly and give yourself a break after so you're less likely to gag. Also wrap your lips around your teeth, that way you can apply some pressure without causing pain.", "label": 0}
{"text": "that’s fine, but first of all, she deceived me by claiming  the deck was made by her. second, it would be a little bit more forgivable if the cards themselves didn’t look like absolute fucking garbage. i was even willing to accept that i wasn’t into the artwork until i realized it was made by AI", "label": 0}
{"text": "We just glossing over the fact he just started face fucking you, a person he did not know and just admitted to never giving head?\n\nAlso getting frustrated etc. doesn’t come across as the best response, either", "label": 0}
{"text": "that’s a terrifying concept to me, i am disgusted by the idea of creative human work being replaced by computers, even if the output is good, which AI isn’t even capable of at this point in time", "label": 0}
{"text": "OMG, that sounds like such a crazy situation! 😂 I can totally relate to being so tired that you do the dumbest things. I mean, who hasn’t had a moment like that? At least you got your head out without needing to call for help! Next time, just find a better spot to enjoy the view. Stay strong and keep those study vibes up! 📚✨", "label": 0}
{"text": "I never personally thought tarot cards held much merit. \n\nUntil my sister in law had a tarot card reading about my brother, it alleged he was lying about something oddly specific. He was in fact lying about that oddly specific thing.\n\nI still want to think they don't hold much merit, but to think tarot cards ratted out my brother from the other side of the planet is especially hilarious to me. At the time my brother was in the US and my sister in law was in Europe.\n\nI'm more open minded to the idea that they may or may not be legit, tho. Although I don't really have any knowledge about tarot cards at all. The world is a mysterious place after all", "label": 0}
{"text": "There is nothing for her to apologize about. If anything, he (at the very least) should apologize. It doesn't sound like there was any explicit consent to the throat fuck. That's a super aggressive (and rapey) maneuver for a first time with someone.", "label": 0}
{"text": "i think it looks like shit.", "label": 0}
{"text": "there's a sucker born every minute, eh?", "label": 0}
{"text": "I think she’s upset because you didn’t suggest using the safety strap OP", "label": 0}
{"text": "It takes a lot of training to do that without throwing up.\nIf you want there are throat numbing sprays to make it easier.", "label": 0}
{"text": "That karma that is striking back on him. He started face ducking you when it was your first time. Just insane 🤣🐧", "label": 0}
{"text": "Women ☕", "label": 0}
{"text": "*preying", "label": 0}
{"text": "did you have to wipe the cheeto dust off your fingers to write that one?", "label": 0}
{"text": "Throat fucking and puke are like anal and some shit flecks. If you’re doing one hard enough, you’ll get the other one. \n\nIf you like the guy and want to try again, text him and tell him you’d like to practice on his cock. He won’t turn that down.", "label": 0}
{"text": "AI is a method of using a shortcut to create work that should not be shortcutted. there is no reason for AI to make creative work that is used for profit. it’s wrong because it is in no way original. even if we reach singularity, that AI is still not human because it can output art in seconds. that is not human and it never ever will be. AI should be used for non-creative work because it will not “work alongside” humans, it will overtake us once it reaches singularity because it won’t need us anymore", "label": 0}
{"text": "That’s a red flag.", "label": 0}
{"text": "Yeah my experience with your girlfriend is that she's very good at that.", "label": 0}
{"text": "There are successful scammers in every industry and sector of the world. Stop being an ass. This is no different than someone selling a scam product on Amazon or eBay.", "label": 0}
{"text": "I can 99.99% guarantee the doctor suggested you stay behind that screen to make you feel better, not to spare the chaperone seeing anything.\n\nAfter working in medicine for more than a couple weeks almost anything under peoples clothes will surprise anyone.", "label": 0}
{"text": "It's dogshit bud.", "label": 0}
{"text": "Thats how you see it and it's pretty dark but I wouldn't take this future for certain.\n\nAlso what AI should or shouldn't be used is not enforced by law. If you don't want to use it, then don't, it's fine, but judging someone who does just doesn't feel right.\n\nI don't my work the be human, I just want it to be good for the purpose I want to use it. I am fine by ai made and human made aswell.", "label": 0}
{"text": "8? Jeez, everyone knows you gotta start slow with 2, 3, or 4, then get into the crazy stuff later.", "label": 0}
{"text": "On both sides.", "label": 0}
{"text": "just because it’s legal doesn’t mean it’s moral. it’s not just about me not using AI, its about the fact that AI is using work that it doesn’t have consent to use. that’s not okay no matter what way you slice it, it’s plagarism", "label": 0}
{"text": "I never understood soccer.", "label": 0}
{"text": "This is a bit more complicated than that.\nYes there are certain LLM-s and media generators who do that, but not AI in the whole.\nIt is much more regulated now.", "label": 0}
{"text": "Thank you for that!", "label": 0}
{"text": "Read this as \"Didn't suggest using the strap on\"", "label": 0}
{"text": "Well it can't be that bad, as when you thought it was hand drawn you liked it enough to pay for it.", "label": 0}
{"text": "Why did you buy it if the deck looks like absolute garbage?", "label": 0}
{"text": "Why?", "label": 0}
{"text": "u didnt have to leave probably, although he shouldve said something. Things happen I also gag a bunch when its too deep", "label": 0}
{"text": "It might be awkward, but she'll see more.", "label": 0}
{"text": "I've had Covid twice, lost smell and taste both times. One thing I can almost taste is peanut butter.", "label": 0}
{"text": "Nothing to be embarrassed of , it’s ok this is a clinic and you are in pain , i hope you get rid of that irritation:)", "label": 0}
{"text": "Mirrors generally cost money.\n\n\nI'd suggest good old meditation.", "label": 0}
{"text": "Just ass, actually", "label": 0}
{"text": "I would say literally the same as getting any other tarot dark except for potentially more personal art. It's all completely made up...", "label": 0}
{"text": "Lol", "label": 0}
{"text": "In my book, he sexually abused you.", "label": 0}
{"text": "I think because you paid 40 bucks even though you also saw ai.\n\nPeople. Think your a fool. For that alone\n\nPlus torot is a complete gift what did you really expect.\n\n\"I read something was a.i generated and was then disappointed to find out it was a.i generated.\n\nI feel an element of empathy for you. However I would not post it online", "label": 0}
{"text": "You can cook a pizza many ways. Some people might kneading their own dough, slaughter their own pig, cure their own bacon, milk their own cows and make their own cheese. Others might pull a frozen pizza box out of their freezer and whack it into the oven. They *both* cooked a pizza.\n\nAI generated images can be (and usually are) extremely low effort, but they're not spontaneously created. Meaning to say that her saying she and her husband \"made\" the art isn't inaccurate, even if misleading.", "label": 0}
{"text": "Thanks for the support. To be fair to him, the first time I gagged hard he pulled out and paused to check if I was okay. I nodded and we kept going.", "label": 0}
{"text": "Someone watches the Simpsons", "label": 0}
{"text": "Fucking thank you. I keep saying McD tastes awful and is the unhealthiest shit you can eat but my friends still order it....", "label": 0}
{"text": "Omg, that’s so rough! 😅 Honestly, props to you for handling it with grace and giving her a tip—most people wouldn’t even think of that! Next time, maybe a little “pre-check” for surprises, but hey, you were just being a good daughter. That lady probably appreciated how nice you were about it!", "label": 0}
{"text": "Yea. I'm not gonna drink out of a bottle that hasn't been washed in a day regardless, that just sounds unsanitary", "label": 0}
{"text": "No, it was cool ranch Doritos... I have a crystal ball I made from some crystals I mined would you be interested in buying it? hehehe kidding I was just joking about the sucker part relax, we all get got sometimes, it was you this time next it will be me for making jokes.", "label": 0}
{"text": "AI is already absolutely capable. It's just not in the $10 version most people are using.\n\nAlso, why disgusted? You don't know the people who make shows you watch now. How would that change if you asked Siri to play you a movie about \"Insert whatever you like here\" What is the value gain by making a human type  up the same script?", "label": 0}
{"text": "People literally study other artists work in art school", "label": 0}
{"text": "It is usually *bad*, too!", "label": 0}
{"text": "Are they created by ai?", "label": 0}
{"text": "Do you think all innovation is a net positive or something? We were doing completely fine before AI art or writing. It’s purely exists to replace jobs, that’s it. And with the amount of power needed to even support all these AI tools, it’s only going to hurt the planet and the people on it.", "label": 0}
{"text": "Probably the last update for anyone still here:\n\nI made it home tonight at 10pm. It’s been almost three days total on the road. It was a trip that could be made in a single day if you start early enough but. I’m not doing good. Hard to eat - not hungry - had been throwing up. \n\nAs I went along the trip, my left headlight AND taillight went out. When the sun set, I pulled into a town and went to autowhatever and got what I needed. \n\nI worked on that for a good time because all my tools were under everything I had packed and it was packed in a way that was very difficult to have gotten it in in the first place. I got it done and put in some oil.  Then I drove for a long time. Then passed into a really cool city that happened to be a college town. It was late, decided to look for a hotel. College kids everywhere bar hopping. Some planning would have made reservation possible and it would have avoided the next ordeal. But I don’t think reservations were realistic because I didn’t know where I was gonna be when I needed to rest. And my car was packed to the brim. No recline.  Even Passenger seat stacked. I walk into the hotel they ask my name after I wait a bit, then they realize I didn’t have a reservation and inform “there’s a home game tonight, there’s no vacancy for everywhere within 2 hours.”\n\nBack in my car I consider options. It’s already 2 am and I’m tired. Consider going down to the bars to see if I can make some friends. Consider going to Walmart to get camping gear. Time is passing. Decide I should think while driving. Start driving. End up in the next city which was 2h away. Check the hotels there. No vacancy or can’t check in at 4 am. I try sleeping in my front seat sitting straight up. Fall asleep for probably 1 minute a time, mouth drops open, jolts me awake feeling annoyed and mad at everything. No go. Hit the road. \n\nHop another state. It’s 7am now. Find a days inn in a tiny town that looked similar to how I felt. They let me check in. “Checkout is at 11 but we’re so nice we let you leave at 12.” Figure 5 hours is better than 0 hours. As I’m paying, see sign that says “if you have complaints about your room you must file them within 20 minutes or NO REFUNDS.” I wonder why…\n\nThen the price ends up being 80 fucking dollars. Ten dollars less than the hotel the night before, which was perfect. Not super fancy but clean and modern and with sensible facilities. And not with a smell of death. \n\nHe tells me there’s a free breakfast that just started. He’s a nice guy for now. I haven’t eaten since I left the last hotel. I contemplate the breakfast but remember the sign. I walk into my room, smells like rotting meat. It’s dark. Feel like I’m gonna find a body. Turn on lights and they are eerily dim. You know when you use the public bus or train and there’s the seat dirt? Everything in this room is covered in what looks like that. The bed which was once white is a grayish brown from this stuff. The one chair beside it has it accumulated all on the seat. Carpet is faded and dark from the stuff. I think for a bit. \n\nOnce I’m back in the lobby I ring the guy again (he’s probably a live-in manager, the front desk is not occupied but there’s an old phone you pickup and some loud ringing plays. He answers it and says he’s coming. So he shows up and sees it’s me again and he isn’t glad. Tell him “sorry I can’t actually afford it, it turns out, and I need to request a refund.” He gets pretty mad. \n\n“That’s too bad nothing can be done it’s too late.” Not sure his angle here. What’s a refund then?\n\nI point at the sign and say “well what about your policy? I’m sorry but it’s too dirty.”\n\nHe sighs and he’s pissed. He takes out his smartphone and calls someone, and starts doing something on the computer. No one answers the phone and he continues doing something on the comp \n\n“Ok. It’s reversed… but there is a 20 dollar charge for this.” \n\nJust stare for a second. “OK THANKS.”\n\nWalk back to car, looking at bank statement for a charge to dispute. \n\nHead to Walmart. Buy fire stuff, some sausage links and skewers, a tarp and some stakes, a mallet, etc. like 50 buck. Why tarp and not tent? Figured I should get the cheapest stuff. Tent was the right choice here though in retrospect…\n\nHead to the woods. (My dad gave me a military surplus extreme cold sleeping bag a long time ago and it’s always been in my car so this was always the last resort. But maybe I’m dumb for this one.) this point I’m dizzy upon standing up, and standing for more than 30 seconds at a time. My legs feel weak. I keep forgetting what I’m thinking. But remember the concept of fire bans. Search for the area I’m in. Full ban. It’s 30 degrees f", "label": 0}
{"text": "Spread tarp on ground instead of as shelter. But sleeping bag on top. Get in. Actually good warm. Expected to be just a bit too cold to sleep. But it’s constraining. Can spread out you know. And it’s day time, which was lucky in retrospect as temps started rising. Just sort of tuck my head into the top and try to shield from the sun. Sleep about 2 hours like this. Wake up. Feel actually fully rested. I know I’m still exhausted, but the feeling that I’m gonna pass out at the wheel is gone. However, i feel completely paralyzed by my emotions. Feel horrendously sad and stressed. Feel like I took too much time to travel. Keep catching myself waiting to go back to our house. Thinking about my bed. My dog. (Her bed, her dog) cry. Chat with some of you guys. Gets me moving. As I’m packing up, notice a weird little spider on my water bottle. Fuck. Snap a pic, iPhone says it’s a tick. Of course. Thought it looked like one. I know there’s ticks out here. What was I thinking. Where I’m from there are no ticks. We don’t think about bugs when it’s cold. I tend to forget ticks don’t care about the cold for a good while. I’m wearing my last set of clean clothes. Change into my suit from sister’s wedding a year ago because it’s clean. Paranoid any little itch or bump I feel on my body is a tick. Don’t find any, but can’t really check without a mirror. Will probably stop at a doctor at some point soon to see if I caught something and for a general health screen cause why not. Pack the couple things back in, drive back out. It’s like 4pm now. Says I’ll be there in 5 hours. Get to work on it. I swear, in the first hour, it said it got down to 4 hours and then started counting back up even though I didn’t make a wrong turn or anything. Sun goes down. Keep going. Stop last time for gas. Feels like my legs are noodles and my knees hurt. Finally make it in. Get to pop’s place. I had texted him to just leave a key out for me, didn’t want to stop him sleeping, but he left it open for me and was waiting for me and hugged me and he’s been just trying to accommodate whatever I’m needing but I’m not asking. Consider seeing friend that yelled in voice chat that scared gf the other day. (He lives here) \n\nGo for a shower. Dad didn’t have much to eat in the fridge which is totally okay he’s a busy retired guy(retired but freelances as a carpenter), and he likes to sleep early so I didn’t want to cook. I can’t keep my mind on track, figure protein issue. I grab a slice of bread and butter it and put some random and weird things on it. Spinach and hemp seed. Actually it’s fine. Not a thrill to eat but feel like a significant improvement. Get ready for bed. Write this so I feel a little better still. \n\nGonna focus on getting insurance. I’ll start with some basic income from something. Surveys, maybe some gigwork thing, maybe I’ll do plasma again. (Did this during covid) then I’m thinking about getting a cdl license or maybe I can be like mad guy from days inn and be a live in employee at a hotel in a city I like more than my hometown which is pretty depressing to me. But a nicer hotel of course. Idk. Options. But I need sleep. Goodnight. Thank you all for everything. This has been surprisingly good at helping me cope just rattling off this nonsense and I know it’s a winding stream of consciousness but you know \n\nWon’t be updating regularly after this. If something significant happens I’ll make another post. Take no news as good news. Feel free to reach out with any thoughts at all.", "label": 0}
{"text": "I was playing Mario party with some of my partners friends (all guys), when this game came up.  I won. One of their gfs asked \"How did 3 guys lose to a girl at THIS minigame?!\" Her boyfriend's response \"Lucky (partner's name)\"", "label": 0}
{"text": "It's not dishonest. You said an innovation is solely made to replace jobs, yes that's their point. That not dishonest its on the nose.\n\nI will, I will gleefully laugh as you too enjoy shows  made by robots. B/c you won't know the difference. And that's the point of all this. Your screaming into the void. And I'm si.ply moving with the current. Good luck being oblivious in your mind prison.", "label": 0}
{"text": "OMG, that sounds so awkward! 😳 It’s tough when family stuff gets messy (literally). I totally get why you’d feel embarrassed, but you handled it like a champ by tipping her! 💸✨ Just remember, everyone has those moments, and hopefully, it’ll just be a funny story to laugh about later. Plus, now you know to check before dropping stuff off next time! Good luck with the laundromat! 🧺❤️", "label": 0}
{"text": "The math isn't any more complicated than making change, you just have to learn the measurements, then the math becomes easy. It's like learning fractions, but easier.", "label": 0}
{"text": "You sound very inocent. Cheap way to earn lesson in life.", "label": 0}
{"text": "The majority of us all have ex-girlfriends, ex-wives etc. Why would you ever think it's okay to talk about an ex on a date? All that does is sound like you are not over your ex. I never understood why people think talking about a previous relationship on a date is a good topic. Let It Go people let it go.", "label": 0}
{"text": "\"Fudged\" teeheeheehee!", "label": 0}
{"text": "Newsflash, there’s no love in any tarot deck you can buy from a stall. \n\nThey’re all mass printed, usually in China!", "label": 0}
{"text": "Did you expect to actually be able to tell the future with some cards?  Hahahahaha.", "label": 0}
{"text": "TIFU by assuming the fortune telling business is an honest racket.", "label": 0}
{"text": "Damn that’s crazy. I have some crystals with redeeming powers infused into the minerals, $20 a pop, I bet they’ll give you some luck/good energy!", "label": 0}
{"text": "no, you're wrong, it's not rainbows. my mom said it's because i was allowed to watch stuff like superhero shows, Sonic the Hedgehog and Transformers! she told me i would've been straight if I'd just stuck to the Winx Club, Sailor Moon, and all those other shows with beautiful, scantily clad women who go through transformations that thinly veil their nudity. Sonic the Hedgehog made me (half) gay!\n\n.......in all seriousness, i think i need to put that last sentence on a t-shirt. maybe change it from Sonic the Hedgehog to Rouge the Bat or Vanilla the Rabbit tho.", "label": 0}
{"text": "[meat computer](https://open.spotify.com/track/2iDIFn3hIbiwfsLtCggubr?si=d82JwRrkSoumwxKBeSQBuA) mentioned", "label": 0}
{"text": "An AI tarot deck seems kind of metal.🤘 \n\nA demon could have took over their machine learning algorithms, reached through the ether and created 78 images to go on this tarot deck", "label": 0}
{"text": "I think it was her dad who did the solid actually", "label": 0}
{"text": "Oh get over yourself. Boohoo it's made by AI , how terrible.\n\nHonestly the only annoying part with AI made art is that it's still too unreliable at times unless people spend a lot of time patching it up.\n\nI remember a year or so ago I wanted to shop on Dysplate and found a few images I liked and nearly bought, but then I noticed a few things off here and there. Basically the \"six fingers\" sort of deal. At that point I wish they had an AI disclaimer solely for the fact I don't wanna spend scouring every single image for these artifacts to ensure they aren't there.", "label": 0}
{"text": "But don't you see that you could draw that same combo every day? You're assigning meaning. It's actually a human trait to assign meaning to random events.\n\nJust say you like to believe, because otherwise it wouldn't matter what made the cards.", "label": 0}
{"text": "I disagree.  It's really not much different than flipping a coin to make a decision, and being guided not by which side the coin lands on, but by how you feel when you see which side the coin lands on.", "label": 0}
{"text": "The person selling you things based on your inability to make good judgement sold you a scam item, color me shocked.", "label": 0}
{"text": "Oh no, that's so gross! 🤢 A dead mouse in your water bottle? Yikes! I can’t even imagine how you felt when you discovered that. 😱 Definitely a lesson learned about keeping those tops on! 🥴💧", "label": 0}
{"text": "OP has their own religious beliefs, and has the right to request that the religious items they purchases be made in accordance with the specified faith.", "label": 0}
{"text": "Laundromat literally is for dirty clothes, whats the embarrassment? ...", "label": 0}
{"text": ">If you make a list or look at a premade list of topics, you’re only considering what’s on your mind.\n\nNo you're not? \nIf you look at a premade list, it will contain items that you wouldn't have thought of. \nThe drawing of cards doesn't add anything to the act of introspection except randomness, with the added disadvantage of being able to draw the same topic multiple times as well as there being a chance that you don't even encounter a certain topic.", "label": 0}
{"text": "Why would you need to flip a coin to see how you feel about the possible outcomes of a decision?\nCan't you just.. you know.. think about how you'd feel if you were to choose A or B?\n\n\nSimilarly, can't you just think about the topics that tarot cards potentially touch on? Why is the drawing of cards necessary? It only adds randomness, which would mean potentially drawing the same cards multiple times as well as potential never drawing certain cards.", "label": 0}
{"text": "🎱♟️🪡\n\nThink about that, and I hope it guides you well", "label": 0}
{"text": "\"costed\" drives me crazy when I see it!", "label": 0}
{"text": "Look on the bright side.  [https://www.reddit.com/r/LegalAdviceUK/comments/1etko9h/family\\_poisoned\\_after\\_using\\_aigenerated\\_mushroom/](https://www.reddit.com/r/LegalAdviceUK/comments/1etko9h/family_poisoned_after_using_aigenerated_mushroom/)", "label": 0}
{"text": "That's 100% not true, especially at witchier markets. There are plenty of independent artists who actually have illustrated their own tarot decks which they then sell at market stalls.", "label": 0}
{"text": "It's nice that you personally don't value art at all, but a lot of people do.", "label": 0}
{"text": "Okay, this is actually how symbolic mediation works. In all things. \n\nI could totally give you a reading of the emoji you sent me. \n\nI would tell you to think carefully about whether you’re being used, that you already had a sense that this person was using you, but you haven’t been trusting yourself about it. The solution to get out will require some careful social navigation to get out of. \n\nNow, you might not have a situation like that in your life, or you might not, it’s just some little pictures. But if you do, the reading brings that situation to mind and has you think about possible solutions. If you don’t, you just say, oh, hm. Doesn’t really “resonate.”  It’s just odds and looking at pictures.", "label": 0}
{"text": "The princess you seek is in another castle.", "label": 0}
{"text": "I totally get it. I'm not into tarot but I get it. Just posted this in response to someone else, but hope you see it too\n\n\"Yeah but I have quite a few decks of playing cards. Some of them are dollar store, some are vintage, and some are niche, fun stuff. I love them for the art and uniqueness. If I bought a set that I thought was made by a local artist, I would be very excited and willing to pay more. The fact they got home and found out it was ai generated absolutely sucks and takes the fun out of it. It's a ripoff\"\n\nThat was bs on their part and it hurts, whether or not you believe in tarot cards. I wonder if people would be saying the same thing about playing cards, which are more widely accepted", "label": 0}
{"text": "Cute:)", "label": 0}
{"text": "Wear the gown backward next time. Be proud.", "label": 0}
{"text": "The original product was actually a game at one point. \n\nThough personally I see it more as a children's toy. No different than a magic 8 ball or a fortune cookie.", "label": 0}
{"text": "Wow, that’s some next-level horror story! I thought I had bad luck with finding a fly in my drink once, but you just took it up about ten notches. Imagine being on Poison Control’s call of the week with ‘I drank mouse tea.’ 😳 The mouse was probably just looking for a little hydration and got way more than it bargained for. Hope you’re alright and that every future water bottle stays rodent-free!", "label": 0}
{"text": "Perfectly wholesome.", "label": 0}
{"text": "If it's any consolation, they work just as well as a beautifully handcrafted deck", "label": 0}
{"text": "Oh this was the laugh I needed today 😂😂😂", "label": 0}
{"text": "lol I do my best to be at least civil with my neighbors, I'm just mortified that it was caught on film...or whatever we say now that film has gone away. 😅", "label": 0}
{"text": "Thaaaaanks ;w;", "label": 0}
{"text": "I have been affectionately referred to as \"the best kind of dumb,\" so thank you lol", "label": 0}
{"text": "Oh snap 😆", "label": 0}
{"text": "This sounds like Dr. House wrote it, I'm a big fan", "label": 0}
{"text": "You literally bought the tarot deck cause you thought it looks good 😂", "label": 0}
{"text": ">my shoulders relax right out of the socket if I'm not careful.\n\nWildest thing I've heard about the human body in quite a while.  Gives a whole new meaning to \"move it or lose it\".", "label": 0}
{"text": "Awww, now it won’t work 🙄", "label": 0}
{"text": "glad to be of assistance ( *'-')7", "label": 0}
{"text": "Humans behave and think differently when faced with inevitability.\n\nThe purpose of the coin test is to create such a situation. Once the coin is in the air, you can't take it back. And usually you know more clearly which side you're hoping it will land on.", "label": 0}
{"text": "But if you pay for a mirror what you see isn't made by AI lol", "label": 0}
{"text": "No. They said: \n\n>If you make a list or _look at a premade list_ of topics,", "label": 0}
{"text": "I’ve been a seller on Etsy for years and this type of thing has been pissing off the ‘real’ artists and crafters on that site since the beginning. For a long time they were called “charm-on-a-chain” shops, because that’s what many of them did. Take one mass produced charm and hang it from one mass produced chain, then loudly proclaim it as handmade.", "label": 0}
{"text": "there’s no love in any tarot deck period they are cardboard", "label": 0}
{"text": "If you need a coin flip to really understand the emotional impact of the outcomes of a decision then you are bad at introspection.\nSo I can only conclude that people who think they need tarot cards are similarly bad at introspection.", "label": 0}
{"text": "What makes you think you're an overthinker?🤔", "label": 0}
{"text": "The feline is out of the bag. Print out this, and give it to her. If you have never, ever shown signs of being potentially homicidal before? This will burn out when her adrenaline lands.", "label": 0}
{"text": "Great game and still pretty popular in France. Grew up with it !", "label": 0}
{"text": "I guess I don't have the imagination to really feel like my decisions would be dictated by a coin flip.", "label": 0}
{"text": "hello! i like your username!", "label": 0}
{"text": "I feel like it's still too soon. She asked for space and I'm not trying to violate it at this time. But yeah this needs to be a conversation.", "label": 0}
{"text": "I picked the box back up 3 times, did some ballroom dancing with it, and spent about five minutes in all trying to figure out where to set it down, and that's one of the tamer things that's happened this week.", "label": 0}
{"text": "Yup I'm weird... don't know when that habit started precisely but that's the reaction I expect😮‍💨", "label": 0}
{"text": "The same premade list every time? Feels like I’d know what to expect there pretty soon tbh.", "label": 0}
{"text": "I'm not suicidal. It's abstract thought that I'm eliminating from my brain. It's metaphorical death.", "label": 0}
{"text": "Please go ok? I’m quite serious.", "label": 0}
{"text": "Indeed. \n\nThat’s pretty much my point. \n\nYou could argue that there was love and good intentions in any deck that is hand painted, but equally you could argue there wasn’t, and it was all for mercenary gain. \n\nEither way though, a $40 deck wouldn’t be hand-painted!", "label": 0}
{"text": "I once got covid and tried pizza from a new pizza place. Covid changed the way I tasted the crust. To an almost sweet taste. I have been disappointed every time I’ve had that pizza after I recovered.  I’ve been chasing that pizza high for 3 years now", "label": 0}
{"text": "It's no different from drawing tarot cards. There is a finite combination of cards, combinations and interpretations, just like how there would be a finite number of items on a list. \nThe difference being that you can add more items to the list.", "label": 0}
{"text": "Yeah, I meant when she is open to talk. At least for my sake it would been easier to process it by reading something than to fumble through a conversation. \n\nUnpleasant situation for both of you either way. Had a mate of mine, that I knew could lift me like a bag of cotton (I was in the ballpark of 240 lb back then) going very, very weird around me once. I **knew** it was not directed at me, yet the instinctive reaction of being in the same room as someone that can easily kill you is difficult.", "label": 0}
{"text": "Just...the unalive thing is annoying...let's be clear-\n\n\nEverytime your brain does that thing where it brings up embarassing memories, you say outloud, to your own brain, \"I'm gonna kill you\"?", "label": 0}
{"text": "Omg this could have been me 🤣🤣🤣🤣 awkwards unite!", "label": 0}
{"text": "all good we're all weird in our own little ways", "label": 0}
{"text": "Well, in your next post, only two hours later than this one, you are living with your boyfriend in an apartment for one year, so I guess you bounced back quick from this date! Congrats!", "label": 0}
{"text": "Today I fucked up by being far more considerate than most neighors... *on camera*\n\nNah you're good man.", "label": 0}
{"text": "As opposed to what? Genuine fortune tellers?\n\nIsn't all health gem/tarot/birth stone/aura/fortune is scam anyway? People who are selling things for it anyway.", "label": 0}
{"text": "A deck of cards with pretty pictures on them that you can use for magic tricks? How is that a scam?", "label": 0}
{"text": "The red flag is in part being able to talk for 15 min without sort of, reading your audience. I can usually detect the reaction to like, my last 2-3 sentences and adjust my course if necessary! Unless OP was exagerating on the time frame there (?)", "label": 0}
{"text": ">I refuse to use it\n\nGood call, for multiple reasons.", "label": 0}
{"text": "They should be thankful that you brought them their package.", "label": 0}
{"text": "You leave your partner. You know your going yo do it again and it would devastate them to know. You just admitted to loving someone else and cheating. Let your partner find happiness.", "label": 0}
{"text": "AI generated \"art\" isn't like cooking a frozen pizza. It's like calling a pizza shop and giving them an order that they cook, then picking up the delivery. You didn't make the pizza, you told someone else what kind of toppings you wanted.", "label": 0}
{"text": "But factory workers, fuck those guys though?\n\nIt’s amazing how utterly ignorant of *recent* human history you have to be to spout this incompetent argument.", "label": 0}
{"text": "The good thing about shitty people is that they reveal themselves.", "label": 0}
{"text": "That reaction is about what we all expected from garbage like you.", "label": 0}
{"text": "Breakup and don‘t mention the cheating, just puts more hurt on them. But don‘t lie to them, it will get worse for everyone", "label": 0}
{"text": "Candid camera! Lol", "label": 0}
{"text": "Candid camera irc", "label": 0}
{"text": "Nah. Sue the water bottle company for not cleaning itself automatically or the failure to warn OP that something is *in* the water.", "label": 0}
{"text": "People interpreting coincidence as magic is the very core of scams, pseudoscience, and mysticism. \n\nDon’t be a sucker.", "label": 0}
{"text": "😁🤣🤪🙃☠️😁🤣🤪🙃☠️", "label": 0}
{"text": "If the want weren't so clean and hydrating it would not have lured the mouse to begin with 😂", "label": 0}
{"text": "If you buy a product that’s sole intended purpose is scamming idiots, and the product turns out to be a scam when you buy it, what do you reckon that makes you?", "label": 0}
{"text": "R/whoosh", "label": 0}
{"text": "“Say hi to Mickey!” would be printed on phs and t-shirts for the rest of our marriage if my husband did this. I hope it was a great trip. Double meaning fully intended.", "label": 0}
{"text": "That's how you confirm you're a simp.\n\nDon't do that. Nothing to apologize for. Stand up for yourself and learn from your mistakes so you don't repeat them.", "label": 0}
{"text": "😂 This is such a classic TIFU! You were just trying to be thoughtful, and it turned into a mini comedy show. At least your neighbors got a good laugh out of it—and hey, maybe you'll go viral as the \"dancing package delivery neighbor!\"", "label": 0}
{"text": "You're both pieces of shit. End your relationships and move on together. You'll still be pieces of shit but at least you will be honest and limiting the damage you'll do to your respective partners.", "label": 0}
{"text": "Just in case this info helps anyone, I started doing a Kegel’s App because I got to the point where every time I sneezed, I would pee on myself. I’m a 49 year old female and just after two weeks it has helped tremendously! YMMV, but I would certainly give it a try!", "label": 0}
{"text": "You aren't that French gal from r/wellthatsucks are you?", "label": 0}
{"text": "Wow, that’s frustrating! It’s disappointing when something you’re excited about turns out to be so different from what you expected. 😠🔮 I get why you’d feel that way about the lack of genuine effort.", "label": 0}
{"text": "Italy too! Scopa!", "label": 0}
{"text": "A lot of other people are saying this too.\n\nDon't punish her by taking your business elsewhere. You might be embarrassed, sure. But they went ahead with the cleaning and did you a huge favor instead of refusing to clean it at all and still charging you handling fees. I think you made up with it a bit by the large tip, but you should really consider staying a regular at her shop. \n\nIt'll be a reminder for you to check your dad's clothes every time, but you'll also be showing her how much you appreciated her by coming back and becoming a regular for her. She'll appreciate the repeat business a whole lot more than a large tip.", "label": 0}
{"text": "It’s fun for some. Like a fortune cookie fortune.", "label": 0}
{"text": "we all just stand around looking at the floor like \"why did we do this?\"", "label": 0}
{"text": "lol thanks, I'm just worried she's gonna make a TikTok and it's gonna get sent to me like \"lol u\"", "label": 0}
{"text": "it definitely brightened her day 😂🤦🏻‍♀️😭", "label": 0}
{"text": "the consideration isn't what I'm worried about, it's the whole 3 minutes of ballroom dancing 😂", "label": 0}
{"text": "oh she was! she just also wanted to let me know that she thought it was funny that i took a few minutes to find optimal box placement.", "label": 0}
{"text": "Recently an entire movie was released in India based on this concept (It is called Meiyazhagan)", "label": 0}
{"text": "I was already humming Yakety Sax to myself while reading your post. I hope it does end up somewhere as long as you'll be laughing with us.", "label": 0}
{"text": "I'm just nervously waiting for a TikTok to get sent to me and my friends to be like \"omg this is so you\" while not realizing that it literally is, in fact, me.", "label": 0}
{"text": "I own a few tarot decks. Even if we take for granted there is absolutely zero mystic/esoteric power involved you typically get at least get 78 pieces of unique, symbol-rich artwork, which can often make a Tarot Deck “worth it” in my eyes. So yes, even more of a scam.", "label": 0}
{"text": "probably distantly. I'm related to a lot of people in a lot of places, but you also don't have to be blood to be family so 🤷🏻‍♀️🤷🏻‍♀️", "label": 0}
{"text": "It's ok. Everyone makes mistakes. You should tell your partner.", "label": 0}
{"text": "Interesting!", "label": 0}
{"text": ">I didn’t even consider it until I looked back at the cards and realized how disgustingly obvious it is.\n\nIt mustn't have been that obvious if you didn't notice until you read about it.", "label": 0}
{"text": "no, I'm a different breed of oops.", "label": 0}
{"text": "You didn't FU!  You're a great neighbor!  A funny one too!", "label": 0}
{"text": "they used to be much worse! now they usually leave us alone. sometimes they're nice. :•)", "label": 0}
{"text": "thank you ;w;", "label": 0}
{"text": "I'll be crying, but I'll also be laughing, so it's gonna be ok", "label": 0}
{"text": "i don't have the footage. unfortunately, 1337 h4xx3r isn't in my repertoire of Random Skills That Have No Use Until They Somehow Do", "label": 0}
{"text": "This is priceless! 😂 You unintentionally gave them some top-notch entertainment.", "label": 0}
{"text": "you're in a tough spot, but it's great you're trying to support her. Just being there is showing you care can make difference. it's understandable for her to feel scared given her past. Focus on comforting her and reminding her she's  safe with you.  Communication and patience will help you both through this. Hang in there", "label": 0}
{"text": "i swear, my autobiography is gonna be called \"oops! ...anyway, moving on.\"", "label": 0}
{"text": "Lol put more thought into it then almost every type of professional carrier", "label": 0}
{"text": "It feels like half the things with that gal are symptoms of untreated neurodivergence", "label": 0}
{"text": "Post it on YouTube with the music from Benny Hill.", "label": 0}
{"text": "This is a bald headed lie stinker butt", "label": 0}
{"text": "??", "label": 0}
{"text": "No FU here bro.  This is more r/ihadsex material", "label": 0}
{"text": "Nah.  I'm part of a team trying to breathe new life into neglected subreddits.  r/ihadsex hasn't had a post in 5 years!  That's almost as long as it's been since **I** last had sex!  Let's help it out.", "label": 0}
{"text": "I’m 5’10 220 with a muscular build and I’m fat as hell.", "label": 0}
{"text": "You're a good dude. My wife's bestie often has us mind something at their house when they go on vacation. One time, for some reason or other I went with my wife and really had nothing to do. So I did what any guy would do, I started miming two parts of a very over the top bank heist for about 10 minutes to their porch camera. About a week later my wife gets a call as her bestie and hubby are dying laugh at my ridiculous miming that hubby found as he was doing a quick review of the week's footage.\n\nSo you accidentally did what took me planning and thinking. :-D Good stuff OP, you need to lean into this and make sure to wave extra every time you see them.", "label": 0}
{"text": "I know it doesn't really matter but COVID-19 was named for the year it was identified (2019). So it would not be COVID-20, but COVID-24.", "label": 0}
{"text": "Think about contacting the farmers market. Some have rules against AI generated shit.", "label": 0}
{"text": "Look at it this way, the deck worked.", "label": 0}
{"text": "You did like it enough to pay for it before explitly being told it was AI, so if it looks like shit to you, that is simply your taste in art", "label": 0}
{"text": "This happened to me with a fly once. I sucked it up the straw and into my mouth and it was horrible. This is sooo much worse 💀", "label": 0}
{"text": "And then everyone clapped 🙄", "label": 0}
{"text": "Don’t feel lonely!! I’m like this too!", "label": 0}
{"text": "How did the smell not hit you when you brought the bottle up to your lips?", "label": 0}
{"text": "But the crystal ball says I get free Doritos at the office today.", "label": 0}
{"text": "Doing sexual things in public with an audience that can't consent isn't the flex you think it is.", "label": 0}
{"text": "Good you deserved it and way worse.", "label": 0}
{"text": "Thank you for this! Laughing at the hilarity.", "label": 0}
{"text": "the cards were in a package and the art on the front did not look AI-made, how was i supposed to know", "label": 0}
{"text": "because the cards were in a god damn package!", "label": 0}
{"text": "Yup it happens and your Dad is lucky to have you around. Although I can joke about it now, being a parent to my parents and having to clean up messes and change diapers at home and in restaurant bathrooms made me humble and grateful to be there. \n\nHopefully things will work out medically for your Dad and things will settle down. Just as a precaution, we always carried a go-bag (literally) w supplies like spare pants, diapers, shirt, socks, plastic bags, medical scissors (to cut off soiled stuff), nitrile gloves, wipes, etc. just like a baby bag. Good luck!", "label": 0}
{"text": "it was at the local farmers market, she’s a local witch… she was selling other witchy stuff that appeared handmade", "label": 0}
{"text": "She almost definitely has ADHD. It was almost like watching my younger self. Second hand embarrassment is real.", "label": 0}
{"text": "Grab a book and be comfortable disconnecting from screens.", "label": 0}
{"text": "thanks bro this is the only response that isn’t dogging on me for just liking something. i agree with you and i’ll be more aware moving forward", "label": 0}
{"text": "and i don’t believe that tarot cards have mystical powers, they are no different to me than a regular deck of playing cards, which can also be used for tarot. i never claimed tarot was magic, i understand it’s just for fun.", "label": 0}
{"text": "literally any coincidence can be used for introspection, and looking at a list is much less fun", "label": 0}
{"text": ">I was messing around with the cards and guide pamphlet when I saw that there was a disclaimer listed in it: Artwork made by AI. I didn’t even consider it until I looked back at the cards\n\nI mean, it sounds to me like you were perfectly happy until you saw the AI disclaimer.", "label": 0}
{"text": "Smile, you're on candid camera!", "label": 0}
{"text": "I can’t imagine being so chronically online and addicted to games that I can’t even vacation without bringing a GameStop stock room with me.", "label": 0}
{"text": "It was intentional, a not quite so subtle hint that you spend way too much bloody time being mindlessly entertained by a screen. Take the opportunity to disconnect and actually get to know and better yourself. \n\nSeriously, 4 different electronic entertainment devices on a vacation? You could have stayed home and done the same thing.", "label": 0}
{"text": "if you actually read the post you’d know i opened up the deck after buying it to find out that it was made by AI", "label": 0}
{"text": "There is no list that has the same number of finite items as there are combinations of a deck of tarot cards.", "label": 0}
{"text": "This isn't a fuck up. This is what vacation should look like lol. ", "label": 0}
{"text": "and it takes them ages to learn the craft. AI can learn and output something in moments, to me that is a disappointment to artistry", "label": 0}
{"text": "And? Your entirely point basically boiled down to \"well I don't need it\". Are you similarly confused by people that use canes or wear glasses?", "label": 0}
{"text": "thanks for the advice i didn’t even think about that. this comment section is being pretty harsh but i think they have a point about me needing to be more aware of scam behavior", "label": 0}
{"text": "I’m just saying if I can’t have friends in my life that I can be goofy with I don’t need friends cause I’ll be honest. I’m not a super old, but I’m not as young as I once was I’m 31 but I definitely have friends that I can goof off with and be immature at times with Those are the best kinds of people. I’m glad you and your wife have fantastic people in your life to raise your spirits when you’re feeling down and I know you guys returning kind so that’s super cool thanks for giving me a little bit of faith in humanity today.", "label": 0}
{"text": "Of course there is. If you can describe tarot cards and their meaning then you can make a list of it.", "label": 0}
{"text": "I did this with the word ceiling before when we had a leak and I was trying to talk about it. I kept trying to explain that it's a floor but above you, to which my buddies were asking if I meant a 2nd story. I then tried to explain that no, I meant the floor under the roof, the inside roof that is flat above our heads. They gave me shit for the entire 5 minutes I was trying to explain it until I figured it out.", "label": 0}
{"text": "You lived a day in the life of a sim where someone keeps canceling your action midway through.", "label": 0}
{"text": "“Waltzing with the box” gave me a good chuckle. 🤭 thanks for sharing!", "label": 0}
{"text": "please quote me at any point in the post or comment section where i said that. what i actually said is that i mainly bought it because i’ve been wanting a guided tarot deck.", "label": 0}
{"text": "No, I’m pretty sure that if every single human dedicated themselves to spend their entire life making this list, of all the possible combinations of tarot cards, every human, past, present, and future we would never complete it.\n\nMaybe a trillionth of a trillionth of a trillionth of this list could be completed, probably not.", "label": 0}
{"text": "thank you for sharing this, I'm always worried no one's going to want to put up with my ADHD but she is just like me and her partner loves her so much", "label": 0}
{"text": "thank you for this comment, i wasn’t expecting such a strong response from people who can’t stand that i enjoy this hobby. my sister actually gave me her tarot deck that she’d never used after she saw that i had bought this one, so i’ll be using that one instead!:)", "label": 0}
{"text": "any regular person can buy into the concept of energy. it’s not that the deck itself has bad energy per say, it’s more of the reaction i now have to it knowing it’s not authentically made", "label": 0}
{"text": "Oh who fucking cares. How is this a fuck up, how does it hurt anyone. People like to bitch about every god damned thing.", "label": 0}
{"text": "some people may think they are cool, if they were i might be able to extend some forgiveness to the seller, but in my opinion the images are nonsensical, jumbled and super fuck ugly", "label": 0}
{"text": "So you bought them without even knowing what they looked like and ar enow upset they don't look good? This sounds entirely avoidable", "label": 0}
{"text": "i’m still fairly young and had never even been to a farmers market. i also live in a small town so i guess i just wasn’t expecting this, but i understand now that i need to be more skeptical", "label": 0}
{"text": "Highly doubt anyone will care, and if they do, you probably don't want to work there anyway.", "label": 0}
{"text": "I want to see this video 😭", "label": 0}
{"text": "![gif](giphy|5dYnoKhjUnnY6Sv06E)", "label": 0}
{"text": "yes that’s what bothers me so much! more than anything i’m so dissapointed about the complete absence of human touch in the deck, it probably took her less than a week to make… a big reason i even bought it is because i wanted to support an artist that completed a big project", "label": 0}
{"text": "The meaning is there if you are introspective enough", "label": 0}
{"text": "You need to get that video and upload it.  Please!", "label": 0}
{"text": "but point me to where i said that the reason i bought the deck is because i need it to tell me what my future holds. you have no idea what my intentions are using these cards, i want heart put into the deck because i expected to be able to look at beautiful, human-made artwork when i opened up the deck", "label": 0}
{"text": "Buyer beware. And because you turned your own inability to check the product before buying into an unnecessary Anti-AI rant. They didn’t do anything wrong, they took the time to generate the images and print them on Tarot cards. Something you easily could’ve done yourself, but didn’t. You paid $40 for the convenience of not having to put in the effort, however minimal it was, yourself.", "label": 0}
{"text": "they made the decks using a tool, that's all. no one needs to tell you what tools they used. the fact that she did mention it is weird. like sticking \"made on photoshop\" on something", "label": 0}
{"text": "i never claimed that tarot was above astrology? where did you get that impression? i was angry that she pulled her card interpretation tables from astrology.com instead of making them herself. i respect your opinion about them both being based in superstition but i enjoy both as a hobby", "label": 0}
{"text": "I don't know but to me it sounds like there's something missing. No one calls the police because of some small argument", "label": 0}
{"text": "it definitely taught me a lesson about trusting people just because they are apart of my community", "label": 0}
{"text": "The main issue, is that regardless of whether you believe in the occult or not, part of what you were buying was the art. Selling AI generated images as art is a scam. ", "label": 0}
{"text": "so many people keep saying this but the art on the front of the deck does not look AI made, and even then it wasn’t fully “my thing.” but like i said i wanted to support a local artist, and i bought the deck because i was interested to see the artwork inside of it", "label": 0}
{"text": "exactly i feel people are way too focused on whether tarot is legit.", "label": 0}
