{"text": "This explains soo much.", "label": 0}
{"text": ">\n>Voting by mail by request is worse but not terrible as the ballot can be intercepted or requested and stolen but this makes widescale fraud difficult.\n\n>Voting by mail where ballots are blasted to every registered voter automatically is horrible and guarantees some level of fraud and invites large scale fraud.\n\nCan you expand on your statements? How large scale fraud \"guaranteed\"? What's the issue, exactly?", "label": 0}
{"text": "They have been, they just haven't gotten much coverage. First that comes to mind is the students against the ongoing ~genocide~ yet unlabeled but not not a genocide by the ICJ violence in Palestine.", "label": 0}
{"text": "Here's hoping there's enough of them to make a difference... before it's too late.", "label": 0}
{"text": "Propaganda in itself isn't good or bad. It's the intention behind it that gives it moral weight.", "label": 0}
{"text": "It's a statistical fact that the majority of those who detransition only do so due to bigotry in their community. They don't stop feeling trans they just go back to hiding in the closet so they don't get hate crimed. Read the trans sub for a more nuanced take.\n\n[New Study: Trans Youth Satisfied 6-10 Years Later With Very Low Loss To Follow Up](https://www.erininthemorning.com/p/new-study-trans-youth-satisfied-6)", "label": 0}
{"text": "To actually convert Republicans, you need to figure out which type of Republican they are. \n\nIf they're the selfish \"I only care about money\" kind, you've got to hit them in the pocketbook.\n\nhttps://en.m.wikipedia.org/wiki/U.S._economic_performance_by_presidential_party\n\nShow them data that Republicans are worse for the economy than Democrats. They'll be resistant to the idea (they've been using a \"Republicans better for economy\" idea for 4 decades), but show them that the demonstrably selfish choice isn't the Republican party, its the Democratic party.\n\nIf they're \"moral superiority\" Republicans, telling them stories of women who were forced to give birth to infants that would 100% die nearly immediately, or women who were permanently injured under the anti-choice laws. Or a woman who had a miscarriage and was literally charged with murder over it.\n\nhttps://www.cnn.com/2024/09/23/health/south-carolina-abortion-kff-health-news-partner/index.html\n\nIf you make it about you, you're unlikely to be successful. You need to make it about *them*. *THEY* need to feel the danger and harm from electing Republicans.\n\nTeaching empathy to Republicans is hard, but it starts with making them see the harm they directly will suffer, and then you can expand from there. Appealing to \"empathy for others\" doesn't work unless they're already actively feeling it (and if they were, they'd be unlikely to be Republicans).\n\nBe prepared to provide sources. From multiple viewpoints.", "label": 0}
{"text": "I feel that. I’m not trans, but I am a gay man, and when my parents found out (16+ years ago by now, when I was in *ninth grade*), my mom didn’t change her mind about her homophobia. No, she screamed at me about it for years, then eventually accepted she couldn’t change it, so it just became a topic we don’t talk about really. Just within the past couple of years, she came to me all proud saying she hated Thomas from Downton Abbey and it wasn’t even because he’s gay, it’s because he’s an insufferable ass. And I’m like “……. Good… job?” \n\nBoth of my parents have always voted red. My mom said in 2016 that she “wrote in Ronald Reagan as a protest vote” but honestly I don’t even know if that’s true (or even if it’s any better???) \n\n… I don’t talk to my family much.\n\nI’m sorry you’re going through this. It’s not something anyone should ever have to go through. I hope someday they see the error of their ways - and, if not, that you’re at least able to find the happiness you deserve without them", "label": 0}
{"text": "And nuclear power has no drawbacks? The problem is with your framing of solar vs nuclear, as if we need to make a choice. If you want to frame it as a choice, then it should be between nuclear and renewables, but that would still be a false choice.", "label": 0}
{"text": "Stats say Republicans like vote by mail too. They didn’t like it in 2020 because Trump told them not to.", "label": 0}
{"text": "They might be sold but they're not legal according to the FDA. [https://www.npr.org/sections/health-shots/2023/07/14/1186291971/theyre-illegal-so-why-is-it-so-easy-to-buy-the-disposable-vapes-favored-by-teens](https://www.npr.org/sections/health-shots/2023/07/14/1186291971/theyre-illegal-so-why-is-it-so-easy-to-buy-the-disposable-vapes-favored-by-teens)", "label": 0}
{"text": "Yes. 'bout fuckin time", "label": 0}
{"text": "Sigma rizz", "label": 0}
{"text": "source? Republican didnt like then, they dont like it now", "label": 0}
{"text": "Not that it's not nice to see someone overcoming cancer, but like why is this newsworthy, what about the thousands* of women who overcome it every year? (* I'm estimating and can't be bothered to look it up, I assume it's more than thousands tbh).", "label": 0}
{"text": "Trump could never. Ivanka is the only of his children he actually cares about, and we all know why.", "label": 0}
{"text": "Feel like there's easier ways to get arrested ", "label": 0}
{"text": "From what I've heard, many tribes didn't appreciate that we just up and decided we were changing what to call them, and so they prefer Indian still", "label": 0}
{"text": "Everyone fighting over the election and Biden is still out here addressing lead poisoning to help all of us", "label": 0}
{"text": "I saw the film. Loved it.", "label": 0}
{"text": "the election is **fortified**", "label": 0}
{"text": "maybe 15 years ago", "label": 0}
{"text": "sure it was.", "label": 0}
{"text": "My little brother has been a glymphatic researcher for about a decade. I’m pleased to see this ", "label": 0}
{"text": "Pennsylvania county find 2,500 fraudulent voter registrations https://www.dailymail.co.uk/news/article-14002851/pennsylvania-voter-registration-fraud-2024-election-lancaster-county.html?ito=native_share_article-nativemenubutton", "label": 0}
{"text": "Is his name Sterling Archer:)?", "label": 0}
{"text": "One company with basically no audits runs paperless voting in 37 states. It's so broken", "label": 0}
{"text": "Its likely thousands of men and tens of thousands of women. Men can still get breast cancer. \n\nBut i also agree with you, this isn't onion-y if you know these things.", "label": 0}
{"text": "Yeah I'm definitely aware that men can get breast cancer. My point is why is it newsworthy for one random man versus any other random man or woman. And I specifically only said \"women\" because clearly the article in meant to be newsworthy because it's about a man having a disease that mostly occurs in women.", "label": 0}
{"text": "The name slips my mind, but a good example would be somebody from the Republican party recently got found guilty of tampering with voting machines in a way that it could manipulate the outcome.\n\nThis clearly demonstrates the possibility of it being done at some point in the past. I don't think that's sufficient evidence to say it did happen, but some people do.", "label": 0}
{"text": "I agree, it's great for him!", "label": 0}
{"text": "No, and I don't really see why that's relevant. To be clear, I don't think there was any fraud of tampering during the previous election.", "label": 0}
{"text": "I'm not sure, haven't figured that out myself yet.", "label": 0}
{"text": "So your suggestion is, one reason why there's growing right-wing distrust in the validity of elections is because one Republican official tried to tamper with machines and was [jailed for nine years?](https://www.bbc.com/news/articles/cr75mpkm7nro)After failing to accomplish anything.\n\nWhat a crisis. Not sure how the migrants are responsible for this one, but I'm sure the Republicans have a point in there somewhere.", "label": 0}
{"text": "How", "label": 0}
{"text": "the grocery chain one is a bit silly if you ask me.\n\ni shop at Glen's, Prevo's, Oleson's...  all called that because it is an actual person's name.  same as Meijer.  people tease us in Michigan for saying *Meijer's* but my dad and grandpa knew Fred Meijer and did work for him and Glen and the Oleson and Prevo families.  so we were shopping at *Fred Meijer's Store* and that is a completely valid sentence.  even KMart's and Walmart's works because it is Walton's and Kresge's.  \n\nit is just a hold over from when we actually knew the owner of the store we were in.", "label": 0}
{"text": "Just some quick examples from before 2020\n\nhttps://www.brennancenter.org/our-work/research-reports/long-voting-lines-explained?origin=serp_auto\n\n\nhttps://bipartisanpolicy.org/report/improving-the-voter-experience-reducing-polling-place-wait-times-by-measuring-lines-and-managing-polling-place-resources/?origin=serp_auto\n\n\nhttps://www.scientificamerican.com/article/smartphone-data-show-voters-in-black-neighborhoods-wait-longer1/?origin=serp_auto\n\n\nhttps://www.propublica.org/article/these-voters-had-to-wait-for-hours-it-felt-like-a-type-of-disenfranchisement?origin=serp_auto", "label": 0}
{"text": "Right. At least I'm not flipping butts all over the country anymore.", "label": 0}
{"text": "I heard someone call vapes “douche flutes” - it is accurate.", "label": 0}
{"text": "everyone works hard, you need to do more than that to become a multimillionaire", "label": 0}
{"text": " It tends to be deadliest when it's in men, and men have less supports then women with breast cancer, maybe that is why it's news worthy. Like maybe this is also an opportunity to educate the general public.", "label": 0}
{"text": "In how few years these batteries would require replacing and how much damage to the environment would that replacement cause?", "label": 0}
{"text": "Good...horrific legacy both here and in Canada.  Can't change the past, but recognition of what took place is crucial to prevent it happening again.  Look no further than the rhetoric coming from the right....it could happen here again.  Thank you President Biden.", "label": 0}
{"text": "They were accused of shooting arrows at the colonizers treating them at less than second class citizens.\n\n\nThe Seminoles famously resisted the trail of tears, result of the \"Indian removal act\" which promised native states in the west of the Mississippi, in a kind of 2 state solutions.\n\nThe \"Indian wars\" ended around 100 years ago.", "label": 0}
{"text": "Is June a business?", "label": 0}
{"text": "It’s happening in the US right now, half of the brands that *should be* high quality are absolute trash because they’re fake. Even where flavors aren’t necessarily banned there are still fakes being sold at high end shops under high end brand names, and I doubt they even know for sure themselves. \n\nThe fake vape industry is booming because they’re low cost and high supply", "label": 0}
{"text": "The most annoying thing about this is that vape communities were telling the government this was going to happen in 2016 when the TPD came into force.", "label": 0}
{"text": "Lol at the people downvoting facts because it makes you uncomfortable to hear the truth", "label": 0}
{"text": "Ah, fair point.\n\nI wasn't necessarily making fun of people who do that or anything. It was just an observation I've made.", "label": 0}
{"text": "No. Flavored non-cannabis vapes are sold everywhere. There may be some city specific bans but none for the entire US.", "label": 0}
{"text": "And I’m sure republicans have made up some excuse why lead is actually fantastic for you and Biden is evil for depriving Americans of this vital substance. I really wish they could spend just a little more time agreeing on the things they obviously should agree on, if only to make the stuff they *don’t* agree on stand out more and seem like more truly important issues to take a stance on.", "label": 0}
{"text": "And that means their voting system is robust and working well, seeing how the fraudulent voter registrations were found before the election.", "label": 0}
{"text": "People are downvoting you because you made a claim without backing up it with a source. What company? Where is the evidence that this company is unreliable? You made a low quality post and are now having a tantrum.", "label": 0}
{"text": "Not without a good chance of getting shot. Vandalism seems like the best way.", "label": 0}
{"text": "I agree. In America there are problems both sides want to be fixed. The economy and school shootings. Instead of trying to take away rights or put those rights back in place they should focus on that!", "label": 0}
{"text": "When New York banned flavored e-juice, all the mainstream shops complied. The \"tobacco\" shops still continue to sell it under the table.", "label": 0}
{"text": "I worked in a grocery store for five years when I was younger and the owner of the store had a soft spot for the mentally ill. She hired folks from the assisted living for the mentally ill and honestly, my coworkers with down syndrome were the hardest working. They didn't complain, they showed up every day on time, they were great with customers, and they were just a joy to work with. I don't understand their minds because that obviously isn't my field of expertise, but I'd gladly work with any one of them to this day.", "label": 0}
{"text": "Not for lack of trying. \n\nAnd Trump did everything he could to gut their power when he was in office. \n\nHell, just this year Republicans [tried to cut funding to the EPA by 40%.](http://appropriations.house.gov/news/blog/house-republicans-pass-measure-reins-epa-promotes-domestic-energy#:~:text=Passed%20in%20the%20House%20today,EPA%20funding%20by%20nearly%2040%25.)", "label": 0}
{"text": "This is a lie so blatant that it's clear you're attempting to spread propaganda. And what a pathetic attempt it is.", "label": 0}
{"text": "[https://youtu.be/w3\\_0x6oaDmI?si=YUgY9txwN43qNc\\_y](https://youtu.be/w3_0x6oaDmI?si=YUgY9txwN43qNc_y)", "label": 0}
{"text": "Dude could have just peed in public like a normal person. /s", "label": 0}
{"text": "\"if i'm careful enough, the fascists will let me join their club!\"", "label": 0}
{"text": "A bill to ban them was approved by the Irish government in September. I'm not sure when the law comes into effect though. I think Belgium and France may also have banned them.", "label": 0}
{"text": "I didn't say that.  Have you attended school to understand how language works?  I'm asking if you have a guilty conscience of \"Trump cult calling him weak because apparently they think genocide is 'based.'\"  Your answer was... \"I'm not committing any genocides.\"  Okay. Have a good one.", "label": 0}
{"text": "Hahaha\n\nWait you're serious \n\nLet me laugh harder \n\nHAHAHAHAHA", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "![gif](giphy|9U4iHUQFj9fgs)\n\nEyy nice. Good for him.", "label": 0}
{"text": "Reported to the election assistance committee for voting disinformation", "label": 0}
{"text": "I was wondering what's so special on this,when I realised we are talking about Georgia/ USA.\n😂", "label": 0}
{"text": "Could someone kindly educate me why specifically disposable vapes? Wouldnt people just buy devices and flavors with refillable pods?", "label": 0}
{"text": "Yes?", "label": 0}
{"text": "The opposition is primarily how waistfull in batteries they are, they almost all use Li-ion batteries that are just discarded.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "ultimately nothing again.  Only ultra poverty which is arbitrary so most if not 99% of people will be denied.", "label": 0}
{"text": "I'm mad that I laughed at this", "label": 0}
{"text": "How so?", "label": 0}
{"text": "Disgusting. I, for one, am against cancer.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "How not so?", "label": 0}
{"text": "Menmilaries", "label": 0}
{"text": "Disposables are $25 a pop. \n\nReusable is $30 and last at least a year.", "label": 0}
{"text": "> keep me off carcinogens\n\n\nThey keep you off *other* carcinogens. The stuff they put in vape pens isn't exactly good for you ", "label": 0}
{"text": "When is the Hallmark film?", "label": 0}
{"text": "How is this uplifting or news, just seems likes a thing that happened", "label": 0}
{"text": "Vote 💙 up and down voting the card to save America. Trump won’t MAGA he is all talk. Project 2025 will destroy what is America.", "label": 0}
{"text": "Hopefully my 47k in fed student debt qualifies", "label": 0}
{"text": "\"So folks, what do I need to do to get her into this car?  Oh...\"", "label": 0}
{"text": "[https://www.youtube.com/watch?v=4VQL9e6saCg](https://www.youtube.com/watch?v=4VQL9e6saCg) look how they test them...", "label": 0}
{"text": "I don't know why you got down voted for this, it's literally run by organised crime here. Tobacco shops are getting firebombed.", "label": 0}
{"text": "Not a single plan so far has helped the average loan holder. ", "label": 0}
{"text": "JFC those poor workers", "label": 0}
{"text": "Man their kids are going to have huge foreheads", "label": 0}
{"text": "Thanks for the reminder! My state provides a website where you can not only register but check your vote status. My ballot has officially been accepted! (I'm doing my part!)", "label": 0}
{"text": "I strongly disagree with that", "label": 0}
{"text": "You can blame Republicans and SCOTUS for that.", "label": 0}
{"text": "As long as you dont eat it, its really not a problem unless youre they guy who has to remove it. PSA, dont eat paint and you have nothing to worry about.", "label": 0}
{"text": "[Relevant comic: attractive vs average](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fftr1fo88c0vb1.jpg)", "label": 0}
{"text": "Approximately 95 percent of a lithium-ion battery can be recycled into new batteries. In fact, the metals used in lithium-ion applications, such as lithium, nickel, and cobalt, hold their value beyond the life of the battery, allowing recycling facilities to reclaim these materials.\n\nEven as he was helping to launch the electric-car revolution, Tesla co-founder J.B. Straubel was thinking about what would ultimately happen to the valuable nickel, cobalt, and lithium in battery packs. Redwood Materials, which he founded in 2017, is helping to create a circular battery economy that shrinks the environmental footprint of EVs. Its proprietary process mines up to 95% of key elements from used batteries, as well as other minerals. \n\n In January, Redwood broke ground on its second facility, a $3.5 billion plant in South Carolina. The company received a $2 billion Department of Energy loan, and the substance of Straubel’s vision has attracted many big-name customers, including Ford, Toyota, Volkswagen, Audi, Panasonic, and Lyft.", "label": 0}
{"text": "Manmaries", "label": 0}
{"text": "Bullshit. The temporary public service loan forgiveness expansion package got a lot of people who wouldn’t have got the normal PSLF because of its requirements qualified. Also the SAVE plan cut my max monthly spend for my IDR plan in half until the GOP Missouri AG fucked it over.", "label": 0}
{"text": "I think he actually does want kamala to lose.", "label": 0}
{"text": "The best part is that they’ll continue voting people who do that in, then complain", "label": 0}
{"text": "If it checking says received does that also mean it was counted? Or does it update saying counted as well?", "label": 0}
{"text": "I had him blocked for a good while, then a grandparent died and it seemed like he didn't know so I unblocked him and told him because it felt like the right thing to do.  Now I just avoid interacting with him as much as possible.  He's become _such_ an unhinged, needlessly hostile asshole, and i can't talk to him about anything meaningful without him losing his shit.  He's made it functionally impossible to have a relationship with him.  And then he blames everyone else for him living alone with no friends.  Couldn't possibly be his fault.\n\nSorry for the rant lol", "label": 0}
{"text": ">Bible - be in debt to no man, do not charge your countrymen interest, forgive debts every 50 years\n\nRepublicans: we're a Christian nation", "label": 0}
{"text": "It's poignant and moving that \"Farrah Fawcett's besties raise big bucks for cancer fight in Dallas.\" I liked her and it's good she is remembered in this way.", "label": 0}
{"text": "?", "label": 0}
{"text": "Because there were no irregularities in previous elections", "label": 0}
{"text": "“At the end of every seven years you shall grant a release. And this is the manner of the release: every creditor shall release what he has lent to his neighbor. He shall not exact it of his neighbor, his brother, because the Lord’s release has been proclaimed.”\n\nDeuteronomy 15:1-2 ESV", "label": 0}
{"text": "Even better.", "label": 0}
{"text": "Why not?", "label": 0}
{"text": "In the US, tobacco sales result in 11.26 billion in tax revenue but causes 184.9 billion in productivity losses. Obviously not all of that economic output is taxed but it's obvious it far exceeds 11 billion.\n\nhttps://pubmed.ncbi.nlm.nih.gov/35909028/\n\nhttps://www.statista.com/statistics/248964/revenues-from-tobacco-tax-and-forecast-in-the-us/", "label": 0}
{"text": "It’s the opposite of uplifting that this is even a concern, or at least a made-up concern by one person", "label": 0}
{"text": "*Barnes and Nobles* drives me nuts. Also *Williams and Sonoma*. NOOO", "label": 0}
{"text": "Don't feel ashamed. You voted, you did your part. It's okay to remove a sticker if it may put your safety at risk (and with how confrontational some people are being, it is unfortunately a real concern).", "label": 0}
{"text": "This doesn't seem like a valid source. You sure about sharing this claiming this is how they test them?", "label": 0}
{"text": "Ideally sure, but first let's not give people access to shit containing toxic chemicals and marketed as disposable. It's a two way street", "label": 0}
{"text": "You don't call a zebra Manilow, that's a sheep's name. A zebra has a name like \n\nZebby, Ziz, Stripes, Honky Stompers, Jimmy Skittles, Bob, Yippee, Mandibles, Duffle Pete, Spanky George, Ook.", "label": 0}
{"text": "Yup, voting for Trump, thanks for reminding me. 👍", "label": 0}
{"text": "Doesn't seem very hygienic for the people who buys them.", "label": 0}
{"text": "> ou know it's absolutely not \"safe\".\n\nI know it is absolutely safe. \n\nThe Heritage Foundation has been tracking voter fraud since the 70s in an effort to get things changed to their liking. In that time, they've only found ~1500 instances, out of *billions* of votes cast in that time.", "label": 0}
{"text": "Exodus 22:14: If you borrow something, you should pay it back, and if you lose or damage it, you should make full restitution.", "label": 0}
{"text": "Well if you're dumb enough to smoke or vape in the first place... 🤷‍♂️", "label": 0}
{"text": "Manufactured ewaste. It won't stop people getting them if they really want them but hopefully it'll significantly reduce the environmental impact.", "label": 0}
{"text": "I don't believe for a second that my vote is safe. Trump says he has people of election authority in his pocket. I don't trust Republicans in power to play fair at all.", "label": 0}
{"text": "The supreme court is just going to shut this down again.Because it's not legal", "label": 0}
{"text": "I read your comment the first time. My answer to the nonsensical question stands.", "label": 0}
{"text": "Biden: \"We're trying, you fucks! But you keep thinking the people who make your racist grandpa cheer and a fascist carnival barker won't totally screw you over *again*!\"", "label": 0}
{"text": "Bringing attention to men that get breast cancer doesn't take away from women that get breast cancer.", "label": 0}
{"text": "PLSF is not the average loan holder.", "label": 0}
{"text": "is that legal? are you trained to handle hazardous materials?", "label": 0}
{"text": "Is this seriously why things fall off your credit score after 7 years?", "label": 0}
{"text": "That's so sad. Religion sucks.", "label": 0}
{"text": "I wonder how her son is doing.", "label": 0}
{"text": "Babe some towns in the US don't even have clean drinking water.", "label": 0}
{"text": "When did I say it was China? I just said look how disposable vapes are tested. There are multiple videos of them being tested this way in different places.", "label": 0}
{"text": "good. they are so bad for the environment.", "label": 0}
{"text": "Yeah. It was good when it was a tool to get people off cigarettes, but a bit of a problem now that a ton of people, especially young people, have started vaping when they never would have touched a cigarette.", "label": 0}
{"text": "This is the UK. They're like 5 for £12.", "label": 0}
{"text": "wtf kind of sketch ass disposables are 5 for 12 of any currency", "label": 0}
{"text": "Hm, maybe to the US government it's not slang, but to any educated person it most definitely is.", "label": 0}
{"text": "I’ve heard people say that but I’ve never looked into it. A quick google returned this article which sources a WH staffer who said it was a compromise between the House and Senate while working on the Fair Credit Reporting Act. \n\nhttps://ecredable.com/resources/blog/httpswwwecredablecomblogspost4360\n\nNot sure id necessarily believe that source but it seems plausible.", "label": 0}
{"text": "Good on you for using your democratic right. Everyone eligible should vote.", "label": 0}
{"text": "Never been in a vape shop that doesn't sell the illegal ones. I buy 15,000 puff ones. last a month each. ", "label": 0}
{"text": "It's so stupid. They are selling ones now where the tank and coil is separate to the battery in the packaging. This lets them legally sell 10ml bales instead of the usual 2ml limit. But they don't sell the tanks without the batteries. \n\n\nThe legislation was the primary driver if the current predicament we are in. Limiting the tank size in refillable vapes so you have to refill twice a day. And limiting the sale of fluid to stupid 10ml bottles was only ever going to drive the disposal industry to where we have got to.\n\n\nIf 100ml bottles were in sale and refillable vapes with 10ml tanks, it would have made using reflliables a much better experience.", "label": 0}
{"text": "SPY to 700", "label": 0}
{"text": "My debt WOULD HAVE been cut in half, but the assholes in the Republican party saw to it that the program was blocked.", "label": 0}
{"text": "I didn't \"source\" it because it's common knowledge. But here you are:\n\nhttps://en.wikipedia.org/wiki/Premier_Election_Solutions", "label": 0}
{"text": "Most of the brands doing legal 2ml vapes", "label": 0}
{"text": "You can say a lot of shit about China. But they kinda have step up their game on good industrial practice the past decades, especially on these types of product. Also, these goods go through stringent validation before they are admitted to their target countries, which includes checking for local applicable conformity.", "label": 0}
{"text": "If we’re going to quote bible verses: Exodus 22:25–27: Condemns charging interest on loans to the poor, as it is considered exploiting the borrowe\n\nThe amount isn’t really the issue, it’s the interest. A lot of these people with large amount of loans have paid the principal, but can’t catch up because of the interest.", "label": 0}
{"text": "You can blame the law for that, and Biden attempting to skirt it for votes for his party.", "label": 0}
{"text": "Your first answer is nonsensical.  Your answer stands in manure.", "label": 0}
{"text": "Every known voting machine error ever documented has been an error in favor of democrats so yeah definitely needs to be discussed, errors that only ever occur to favor one side should be looked at harder in general.\n\nAlso general rule is if you have to write articles assuring people that votes are safe you can be sure that's  not the case and double check.", "label": 0}
{"text": "Non-US citizen here. The way I see it, making people doubt their voting is a strategy by republicans to be able to contest the vote. Just like last time.", "label": 0}
{"text": "you mean indigenous?", "label": 0}
{"text": "You mean like how the 2016 election was stolen?", "label": 0}
{"text": "It's as good as the OP, lmao. Both are equally true.", "label": 0}
{"text": "could you guys do something about all the billionaire posts? I don't think I'm alone feeling discouraged and put off by seeing more orphan crushing machine type posts here", "label": 0}
{"text": "You slurp on it 500 times a day?!", "label": 0}
{"text": "No the number of puffs they rate them for are all bs", "label": 0}
{"text": "30% approval and 40% disapproval. Probably helps with the younger voters which are generally democratic.", "label": 0}
{"text": "Let’s just be realistic, 99% of vapes are made in China, disposable or not. Yeah, fine, the juice is domestic but let’s not act like China only dominates disposables.", "label": 0}
{"text": "Eventually the stimulant effect just brings you from withdrawal cravings to a baseline that lasts like half an hour until your body needs another hit. So it becomes expensive and pointless while exposing you to an impressive variety of health problems.", "label": 0}
{"text": "See Australia if you are curious what banning disposables and all vape liquids does. I still regularly go to any tobacconist to pick one up under the counter. Still much cheaper than cigarettes.", "label": 0}
{"text": "I dunno man, osha never showed up.", "label": 0}
{"text": "Your original comment was a crackpot theory.", "label": 0}
{"text": "Yeah that’s exactly the kind of lie republicans have been telling. Right after the 2016 election Trump started lying about 3 million illegal votes being cast", "label": 0}
{"text": "I do love Kate Bush!", "label": 0}
{"text": "Economic incentives and health outcomes are very opposite things to care about sometimes and it's fucking blows.", "label": 0}
{"text": "Does nicotine make people feel stimulated? \n\nI've tried cigarettes, cigars, pipe, vape, I've tried them all. \n\nI can understand liking the flavour, the ritual, the smell, but I never once felt anything more than a headrush like I stood up too fast. Certainly didn't feel *good* in any way. In fact after trying snus/zyn I fell asleep.", "label": 0}
{"text": "Nicotine addiction doesn't let you just dose less often. That will only extend and deepen the cravings.", "label": 0}
{"text": "Men who get breast cancer die from it at a higher rate than women do", "label": 0}
{"text": "50 years is a long fuckin time", "label": 0}
{"text": "Yes, nicotine is literally classified as a stimulant.", "label": 0}
{"text": "A lot more retired voters are Republican, and the GOP knows this and plays to it.", "label": 0}
{"text": "Either put out a plan that is a compromise and might be passed by both parties or put your foot down and start signing some executive orders to make it happen. Putting forward a plan that every single person on Earth and their ancestors knew would immediately get shut out, and then crying about how it didn't pass, is just stupid. If I send a letter to Bill Gates asking for $10,000 and he rejects it, I don't get to sit around pouting and telling everyone that Bill Gates ruined my plan. Get to work and find a way.", "label": 0}
{"text": "Even if enforcement is strong people will still take the risk to import them. Vapes over 600 puffs or over 20mg of nicotine are illegal but you can still get them pretty easily in stores and they risk having their stores shut down for a month, a large fine on top of lost revenue aswell as having the illegal stock seized. You can get vapes now that are closer to an old style squonk kit that have a separate bottle you put into the vape that works like a reservoir they are 10-20k puffs and really cheap, super easy to use and yet the vast majority of users who only buy disposables won't put up with that minor inconvenience of taking the lid off the bottle and putting it in the device. A lot of them also are extremely brand/flavour loyal refusing to even attempt to try anything other than a particular vape brands version of a flavour (despite the vast majority of flavours all coming from a single Chinese wholesale flavour manufacturer)... Honestly it's like talking to a brick wall with most of them.\n\nObviously the hope is that all those disposable users will move into things like the XROS or Xlim (so many X's) but the majority of them will either go back to smoking because they already smoke aswell as vape or they will just keep on getting disposables by other means.", "label": 0}
{"text": "Studies have shown that nicotine by itself is no more harmful than caffeine really.\n\nIt's the other carcinogens usually inherent in burning product (like tobacco) that is the most harmful.\n\nAlso little in longterm studies on \"flavors\" and such being inhaled.\n\nObviously nothing is better than pure fresh air, but just going outside on a busy road is probably air quality than vaping, it's just that vaping is far more commonplace in inhalation by users.", "label": 0}
{"text": "Right, right, \"studies have shown.\" But we also need more studies to be sure about the effects. Needs more research, but it also doesn't.\n\nThat's exactly what the tobacco industry said about tobacco.", "label": 0}
{"text": "That's a very bold claim. Got a source?\n\nAnd articles like this need to be written because every week for the past month or so there's been at least one election interference attempt. Whether that be purging the voter rolls after registration sign up, or bribing people to vote, or threatening to arrest people who canvass, or staring at people in line to vote with a hand on a rifle which is definitely not criminal menacing, or claiming signatures are forged without releasing evidence (only one side is doing these things btw). \n\nPeople need to be reminded that our democracy hasn't fallen yet and we have tools to ensure our vote is being counted that we can use. Republicans haven't taken away all our tools yet.", "label": 0}
{"text": "No, I know a lot of people like this. Young and old. It's comparable to alcohol addiction, albeit easier to get hooked on. Plenty of people drink, and they're on a spectrum between casual drinker and alcoholic.", "label": 0}
{"text": "I’d imagine it depends on the state, but when I voted by mail a few years ago mine had a separate status for received and counted.", "label": 0}
{"text": "If it’s fortified like iron fortified cereal, we’re screwed.", "label": 0}
{"text": "I've been mail voter in California for about 2 decades.  I get an email when it's received, and another one once it's been counted.", "label": 0}
{"text": ">Approximately 95 percent of a lithium-ion battery can be recycled into new batteries.\n\nAnd how much energy do we need to do that?", "label": 0}
{"text": "You're probably allergic to glycerine or propylene glycol.", "label": 0}
{"text": "Yeah, just in time to dangle it in front of you for the election and then not deliver after.", "label": 0}
{"text": "We all find it remotely not funny that this new wing of Republican Christofascist have soiled the word of God and bent it to fuel their greed at the cost of their brothers and sisters. There lord would be disgusted by their actions.", "label": 0}
{"text": "Sir, this is a Wendy’s", "label": 0}
{"text": "lol no it isn't. Conservatives just lie about everyone. It's astounding how vile they are.", "label": 0}
{"text": "Well. He caught Gwen, too.", "label": 0}
{"text": "Wait, what?!?!? Contradictions in the bible? NO FUCKIN WAY!", "label": 0}
{"text": "It said we're headed for 5 degrees with no policy change, so it's doing *something* just not enough", "label": 0}
{"text": "For what it's worth, I hope you make it and find happiness.", "label": 0}
{"text": "Both my sisters have had their loans forgiven. They are public school teachers.", "label": 0}
{"text": "“I’m not even a Trump fan” is always inevitably followed by things a Trump fan would say. \n\nBut, please write another novelette full of BS.", "label": 0}
{"text": "Who's the one blocking debt relief?", "label": 0}
{"text": "Have you looked into other forgiveness programs? If it doesn't qualify under this it might under one of the others.", "label": 0}
{"text": "Except you then run the risk of making every effort to vote legally and then getting fucked anyway because for some reason literally being told by the town clerk you can vote is not enough to avoid arrest for that woman.\n\nMeanwhile the apartheid billionaire immigrant manchild with the thinnest veiled insecurities makes the thinnest veiled bribe to vote for a political candidate in the history of our country and so far has been worked it \"might be illegal\" and I would be surprised if he ever sees any jail time or any consequences that will actually affect his life.\n\nIf I paid people $1 with the exact same terms to vote blue I'd be in jail yesterday and probably spend the rest of my life in jail.\n\nI have very real reasons to feel directly threatened for my life from these MAGA terrorists cult thugs.", "label": 0}
{"text": "You know what shouldn't be legal? Privatizing the future of your youth, by making education artificially expensive so that lenders can profit even more.", "label": 0}
{"text": ">“At the end of every seven years you shall grant a release.\"\n\nPon farr?", "label": 0}
{"text": "Oh the interaction and fact you removed your comment soon after made it looked like you said something wrong, why did you remove it?", "label": 0}
{"text": "VOTE!", "label": 0}
{"text": "I'm so sorry and the last thing I wanted to do was make you feel worse. I hope at some point you are doing better. PM me if you want. Grief sucks, I know.", "label": 0}
{"text": "Jobs that don't give them time to vote and lack of polling places in states where mail-in isn't an option.", "label": 0}
{"text": "I think I’ll be fine, but thank you. You did nothing wrong here but shared a video that gave a clear form of explanation to one of the toughest topics to talk about to kids.\n\nI would say, the inner kid in me says thank you for sharing this :).", "label": 0}
{"text": "Biden is old and definitely isnt as spry as he used to be, but I wouldve been proud to vote for him again. Stuff like this only reinforces that. He couldnt truly fulfill his campaign promise, but not for lack of trying. He's spent the last 4 years trying everything he can to make good on it, and that is one of the most respectable and impressive things about him IMO", "label": 0}
{"text": "Took them long enough.", "label": 0}
{"text": "SAVE is currently on pause. I'm not paying anything right now bc of the court challenges.", "label": 0}
{"text": "If you are suggesting the elimination of interest for loans; most christians would support that as well.  Especially right wingers.  \n\nThe problem is you would soon see a lack of loan availability, except amongst family members.  \n\nIf the government starts giving the loans instead, right-wingers are going to have a problem with that since now it’s my money being wasted again.", "label": 0}
{"text": "What’s a”big debt”?", "label": 0}
{"text": "No they just happened to mostly die off all at the same time, all fluky-like", "label": 0}
{"text": "When I got married it was 124k with 4k in CC debt all from the spouse. Predatory loans and dumb decisions. She's pretty frugal now and all her pay went into paying it off for the most part. We're super proud to be debt free. With both kids in school now we are finally pulling ahead like crazy. Gotta figure out how to invest the extra money now as we are locked into our lifestyle so the old loan payments and childcare payments are just piling into the bank. \n\n\nThere is hope! Make a plan and stick to it! The light at the end of the tunnel is bright!", "label": 0}
{"text": "Cool can we work on helping some other people that didnt get to go to college at all and probably dont have 6 figure jobs now?", "label": 0}
{"text": "That’s actually not how plagues work between different historically rarely-interacting different tribes.  Maybe if you’re all being herded westward through violence and forced relocation", "label": 0}
{"text": "\"who requested Elmo’s appearance: Rep. Randy “Duke” Cunningham, now in jail for taking at least $2.4 million in bribes. I’m not implying that Elmo has taken dirty money, but these are the kind of people Elmo surrounds himself with.\" I'm dying 🤣", "label": 0}
{"text": "They might as well go for that next since telling people their vote doesn't count has worked for years. The state that I live in used to be a swing state, now we hear people constantly saying their votes don't matter because it's a red state. It has been for the last few elections but we checked the numbers and if 2/3 of the registered Democrats voted it would be blue. That's all it would take. It's not even a large number. The population of one of the medium sized cities would do it. People have become so convinced their votes don't matter that we are stuck with these lunatics in office and trash on the ballots, I hope they bother this year because it's kind of desperate and dangerous now.", "label": 0}
{"text": "good idea. this throwaway culture is madness", "label": 0}
{"text": "I don't know why you're getting downloaded for that, it's true. They're screening very carefully like they always do, except more so than usual according to people I've talked to who are working at the polling offices. The lines are insanely long and they're having to be really careful with ID scans and everything to make sure nothing Shady happens and they don't get questioned about it. That article you posted said they booted five Republican candidates for Governor over those fraudulent votes from canvassers. That's crazy there were that many.", "label": 0}
{"text": "Yes, we can help those people as well. Great idea! Of course, for that to happen, we have to put democrats in office.", "label": 0}
{"text": "He most likely has some support already in place\n\nIf he's at the point where he's not willing/able to work any longer, his support team has likely already or is in the process of updating his support plan accordingly\n\nThe probable eventuality is living in a group home with round the clock care if that isn't already the case, especially since Alzheimer's tends to hit individuals with Down Syndrome earlier than most people\n\nDiffers a lot by state, but here we try to do our best to preserve as much autonomy as we can as long as we can\n\nSource: I work with aging adults who have Down Syndrome", "label": 0}
{"text": "Lol 😂 are you a woman?", "label": 0}
{"text": "Let’s go baby this is great I hope the US follows", "label": 0}
{"text": "Didn't we do this a long time ago????", "label": 0}
{"text": "And you want to hint that being a trans person is as easy as how they are feeling. *Solid move*. Besides, nobody's angry. You just don't understand the basics of pregnancy, abortion, and women's healthcare. You need to be a woman with female anatomy to grasp these concepts.", "label": 0}
{"text": "There is a difference between *mentally ill* and *mentally challenged* (which is an outdated term). Mental illness are things like depression, OCD, anxiety disorder, etc. Mentally challenged, which is now called intellectual disability, cognitive disability, or global delay (depending on the context of the diagnosis) would be Down syndrome, Autism, Fetal alcohol syndrome, etc.", "label": 0}
{"text": "Let me put it this way.  I borrowed $25k.  So far I’ve paid $31k.  My current balance is $33k.\n\nThe question is, how much interest is fair?  Why should my loans that I signed for at 2.5-3% interest now be 6-8% interest.  And not just normal interest like a car loan or a house loan.  COMPOUNDING interest.  I pay interest on my damn interest.", "label": 0}
{"text": "Other people pay for a lot of the things you benefit from in your life. You gain a lot from the generosity of your society whether you see it or not. Countries only benefit from making sure their citizens aren't desperate, and the US continues to fall behind because the ultra wealthy have convinced the peasants that communal efforts are the work of the devil.", "label": 0}
{"text": "Then why can you get charged with double homicide if you murder a pregnany woman?", "label": 0}
{"text": "Define safe?!\nSafe is not fair nor does not mean there's no sus. Massive dumping is safe too. Just safe. Let's keep it fraud safe. Rig safe.", "label": 0}
{"text": "We should be looking at reducing interest payments for people that are underwater on their payments rather than canceling debt then.", "label": 0}
{"text": "Yes, but the person you are replying to also pays for those things for other people already.\n\n It's just not some of those other people are having 10s of thousands of their loans paid off, and the person you are replying to isn't.\n\nSo why do some tax payers get loan bailouts, and others not? How is that fair and equal?", "label": 0}
{"text": "Or maybe we can just not put stipulations on everything and let people seek higher education regardless of field without financially hamstringing them for decades", "label": 0}
{"text": "Check your local election website to see if your vote was counted if you're afraid! NY&NJ both have that system anyways, which is nice!", "label": 0}
{"text": "You should look into Kamala Harris' job plan for workers without college degrees. Promising stuff", "label": 0}
{"text": "I'll pay your mortgage. It works out better for me if you don't have that debt.", "label": 0}
{"text": "There's been a ton of research. All indications are that vaping is something like 100x less harmful than smoking because somewhat unsurprisingly, most of the harm from cigarettes comes from the fact that you're setting something on fire and inhaling it. Like 99% of everything becomes toxic in that circumstance. \n\nI don't even know how you could have a stance like this. You don't think people are motivated to prove it's harmful? Entire countries are banning it. There's clearly huge motivation to prove it's harmful, so much so that it's being banned even in the absence of evidence. The most ironic thing about this is that I'm pretty positive that the overlap between people who would agree with such bans and people who spent like three years saying \"trust the science\" during COVID is *significant.*", "label": 0}
{"text": "🥹🥹", "label": 0}
{"text": "The downvotes for your post suggest that it’s quite popular.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Today I learned the same thing about Tourette Syndrome.\n\nI always thought it was “Tourette’s”", "label": 0}
{"text": "What about the people with student debt who didn’t do that?", "label": 0}
{"text": "No one’s mad besides you. Downvotes are for burying irrelevant comments, like yours.", "label": 0}
{"text": "Spanky George was his father. Please, call him Spanky Georgie", "label": 0}
{"text": "Joe Mama", "label": 0}
{"text": "I mean with no interest, not so crazy", "label": 0}
{"text": "75% of my debt is private, because I was an uninformed child being fed the false narrative that I had to go to a 4 year college to secure a career outside of a trade. \n\nFast forward to now. I did NOT need my degree to be in my career, I WISH I would have gotten proficient at a trade, and I HOPE for all those much more burdened by federal debt that this passes. \n\nIt pisses me off so much the self centered shit stain ass clowns that whine that they had to pay off their debt so why should anyone else get a break. \n\nBe fucking happy that a generation of people aren’t being fucked in the ass as hard as you were.", "label": 0}
{"text": "Democrats are like Oprah. \"You get free stuff! You get free stuff! You get free stuff!\"", "label": 0}
{"text": "Is there anyone, in your opinion, who *doesn't* need a government handout? Who is capable of paying their own way and taking care of themselves and their kids?", "label": 0}
{"text": "Forgiveness of loans has to go through congress. The Supreme Court already ruled on it.", "label": 0}
{"text": "Reduced lead exposure also helps prevent future MAGAts.", "label": 0}
{"text": "The practical application of this is that no loans would be made with a term longer than 7 years.", "label": 0}
{"text": "Sound advice for sure!", "label": 0}
{"text": "Blah blah blah.  Nothing ever happens:(", "label": 0}
{"text": "Well if youre comparing 40 to 30 it is most people.", "label": 0}
{"text": "Why not just make college free and merit based like in Europe instead of doing all this?\n\n> be in debt to no man\n\nOnly possible if college is free", "label": 0}
{"text": "All interest is compounding. Do some math, use a loan calculator before taking the loan.", "label": 0}
{"text": "Not accurate. The degree is supposed to increase your earnings (your mileage may vary), so you would be contributing more.", "label": 0}
{"text": "Not sure why ur getting downvoted for such a based opinion", "label": 0}
{"text": "I hear they’ve teamed up with the program that gives aids to anyone in need.", "label": 0}
{"text": "One feature of the overall energy situation is that every location has a unique mix of advantages and disadvantages for each type of energy generation.", "label": 0}
{"text": "Not sure of the title of the video and too lazy to find it for you (so this is just even more word-of-mouth) but I saw a long one where dude did some investigative journalism on one of the factories and they did indeed test every vape like this. Well, not exactly like this, they were much more methodical and systematic and the place generally looked more professional. These guys look like it's their first day, or they're just close to passing out from smoking way too much.", "label": 0}
{"text": "Calvinists don't believe Usury is a Sin like other denominations do.", "label": 0}
{"text": "According to the article, it is when a person has such a large debt that there is an 80% chance that they will be forced to default within 2 years. \n\nThat's the automatic path. \n\nOr you can apply and then the state department go over your details to check if they think it is big.", "label": 0}
{"text": "So stop paying my loans off", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "Biden was one of the few Democrats who voted in favor of making student debt non discargeable in bankruptcy, so he had a hand in causing this little problem.", "label": 0}
{"text": "Fascinating", "label": 0}
{"text": "I like big debts and I cannot lie.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "SCOTUS ruled against the use of a national emergency clause in the I believe it was 2001/2003 amendment to the HEA of 1965 as justification for the executive to discharge debt during the COVID National emergency period despite that being written law with authority ceded by congress to the DoE\n\nThis is not that legal mechanism. SCOTUS ruling on one thing does not transfer to the outcome of that case, what one could call judicial obstruction of debt relief, to all attempts at debt relief", "label": 0}
{"text": "What’s illegal about this?", "label": 0}
{"text": "Good. This was a stain on our American history.", "label": 0}
{"text": "Was there a time period when your payments were less than the interest accruing? The catch with an income based repayment plan or deferrment is that sometimes the payments being made are less than the interest accruing, so the balance owed increases.\n\nSome people also signed up for student loans which did not have fixed interest rates. Interest rates were extremely low for a few years but have sense risen significantly, which means that variable rate loans will likely start having higher interest rates.", "label": 0}
{"text": "Strategically timed and some of y’all eat this up.", "label": 0}
{"text": "Such a regressive argument, just because you don't think something is valuable doesn't mean it isn't", "label": 0}
{"text": "A lot of good things in the world were created or discovered while losing money in the process.\n\nProfitability cannot be the driver for everything.", "label": 0}
{"text": "He's a neolib, but he can also tell that the country is changing drastically, and standing in the way now would just be taking a dump on his own legacy. Props to him for actually having the guts to do some unpopular-with-donors shit in his last few years in power. Shame it hasn't gone much of anywhere between deadlocked congress and terrible judicial checks.", "label": 0}
{"text": "Refillable vapes are allowed.\n\nDisposable vapes are being banned.\n\nThey're often cheaper, which makes them more accessible to young people, similar to the packet size restrictions with cigarettes 10 years ago. \n\nThey're also terrible for the environment as they contain Lithium batteries.", "label": 0}
{"text": "Their debt for college was essentially what we pay for books.", "label": 0}
{"text": "Barry", "label": 0}
{"text": "Native American isn’t correct either from what I’ve heard", "label": 0}
{"text": "Right, they opposed concentrating all the spending on just the bluest part of the state rather than *spreading it equally* or spending on *poorest or most impacted communities first*. It's basic fairness.\n\n\nIt's also not a party platform issue.", "label": 0}
{"text": "This is what the nuclear tankies on Reddit just refuse to understand. No, we don't have anything against nuclear power (well, I kinda do in its implementation) but one plant takes so fucking long and so much money and creates so many emissions during its construction, and a solar plant goes up in 18 months.", "label": 0}
{"text": "EU needs to follow ASAP. The removable battery solution doesn't cut it", "label": 0}
{"text": "yep that's my point, one stone, one bird (and shot in the foot)", "label": 0}
{"text": "As i understand it Australia banned all vapes though? My picture of a common sense ban is just on disposables, ideally pushing people towards the non disposables and reducing, if not eliminating e waste.", "label": 0}
{"text": "It's amazing how many interpretations there are for a simple passage that only says one thing.\n\nIf the people who actually believe the book can't agree with what it means... That's a problem.", "label": 0}
{"text": "No. The argument is \"I was responsible and didnt take out massive loans for a degree that was not worth it, so why should pay for your bad decision.\"", "label": 0}
{"text": "Cool story bro.   Now pay another 100k for the people who weren't responsible enough to get a job good enough to pay off their loans with their degree.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Ironic? Given that he's one of the main reasons student debt is so high.", "label": 0}
{"text": "Then, in that case, we need to schedule elections every two months or so. Because Biden only starts doing what he promised to do about 30 days before an election.", "label": 0}
{"text": "i go to a shitty, small college and still pay almost $15k per semester. multiply that by 6 or however long it will take me to graduate and we’re looking at damn near $70-90k that i will have to start paying back 6 months post graduation, whether i have a job or not. compared to people who took out $150-200k in loans to go to a much larger, more funded school? sure my loans may seem smaller but they don’t feel any less burdening. getting $10k of loans relieved would be fantastic but in the grand scheme of things, it just *slightly* reduces your monthly payments post graduation, or takes a couple months off of your payment plan. it’s a great start but just proves how fucked collegiate academia is in the US", "label": 0}
{"text": "No other borrowers can deny.", "label": 0}
{"text": "How do I do that? Is there a site or something that tells me what I’m eligible for?", "label": 0}
{"text": "Every industry requires energy. No free lunch for living in modern society. The carbon footprint of recycled battery materials is typically four times smaller than that of raw materials from primary sources. That footprint should get smaller as recycling processes are improved.\n\nhttps://www.mckinsey.com/industries/automotive-and-assembly/our-insights/the-race-to-decarbonize-electric-vehicle-batteries", "label": 0}
{"text": "Good!! I moved from the UK 15 years ago, and last I visited in 2023 I was so saddened to see so many disposable vapes on the ground in the London suburbs. What a disgrace.", "label": 0}
{"text": "Its currently fee based on dei. Everyone else loans.", "label": 0}
{"text": "This is where I break from democrats, you signed the loan, it’s your debt.   You  also chose where to go and what to study, unless someone held a gun to your head and made you sign it, or the loan is truly fraudulent (you not knowing the terms of the loan is not fraudulent) you own it.   I am fully onboard with canceling any interest on the loans though", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Why this sub became political campain for \"Biden administraion\" lately? Is there some election coming in the USA?", "label": 0}
{"text": "I miss when vapes came out. Box mode. Rdas. Building coils. New flavors. Why did the FDA have to go and ruin that for everyone just to make sure Juul could sell. I hate it here", "label": 0}
{"text": "As long as someone else pays for it, I can barely buy groceries.", "label": 0}
{"text": "I smoked the vapes with no issue for a few years tho D:", "label": 0}
{"text": "lol", "label": 0}
{"text": "How long ago was that?  2005?  Almost 20 years ago?  Enough time for a person's attitude to change.  Perhaps his role in causing the issue is one of the driving forces behind his desire to help fix it?", "label": 0}
{"text": "I never really understood this concept. If everyone did that, got a “good enough paying  job”, then society would collapse.", "label": 0}
{"text": "What stops college from becoming more expensive now that there are expectations of debt forgiveness?", "label": 0}
{"text": "Gotta learn to co-exist. Hope our first people can accept the apology.", "label": 0}
{"text": "This may have gone over some of young reddit's heads but it brings back memories of me and my buds rolling around blasting this song, dancing with the windows down to get laughs out of girls. We wore that whole CD out.", "label": 0}
{"text": "So the Christian thing to do would be to do away with federal student loans - nice", "label": 0}
{"text": "*sometimes*", "label": 0}
{"text": "This is UpliftingNews, not the Onion.", "label": 0}
{"text": "Legislation", "label": 0}
{"text": "But it fucking isn't.  At least not here in PA. \n\nMy parents mail in ballots were returned, undeliverable.  The reason?  Their address was altered. They've lived in the same place for 42 years, and voted by mail in 2020.\n\nSomeone changed their address.  CHECK YOUR REGISTRATION STATUS AND EVERY DETAIL ATTACHED TO IT!", "label": 0}
{"text": "I disagree. Giving people money they didn't earn leads to inflation. Cutting taxes does not. \n\nAllow me to explain. There are two components to the economy, supply and demand, and when they operate approximately in balance, life is pretty good. Everyone is consuming things (which is inevitable ... we must have food, shelter and clothing) but nearly everyone is producing things, too. To spend $1, I first have to earn that dollar and thus put a dollar's worth of goods or services back into the economy for someone else to purchase. \n\nWhen the government borrows money and gives it to people didn't earn it, it spikes the \"demand\" side of the teeter-totter. Now people can spend more without necessarily producing more. You wind up with too many dollars chasing too few goods, and that leads to inflation, as sellers are able to raise their prices to vacuum up all of the extra money in circulation. (We saw this happen with food prices after the billions allocated to the SNAP program were doubled between 2019-2023.) \n\nLetting people keep more of the money they've earned (tax cuts) doesn't have the same effect. It doesn't create \"new money\" the way borrowing does. The same amount of money is still in circulation; the only differences is that it's being spent by the people who earned it and not the government that confiscated it via taxes. \n\nI generally agree with you on military spending but we're living in dangerous times. Israel and Iran are attacking each other and North Korean soldiers are training in Russia, presumably to join the fray in Ukraine. Our senile president and feckless vice president have been utterly incompetent in addressing the international situation, putting us all in peril. I think we are actually fighting WW3 already; we just don't know it yet.", "label": 0}
{"text": "The debt is not being paid off, it's being forgiven. i.e. the debt is held by the government and they just say \"this debt has been stricken from our books, you no longer owe us\".", "label": 0}
{"text": "When I was in middle school, we learned that these schools were a nice thing the government set up to provide education to native Americans. When I got to college I learned the real truth about how horrible these places were. An apology is a step in the right direction, but we have a long way to go to make up for how the US has treated people of the First Nations.", "label": 0}
{"text": "Where is this magical place?", "label": 0}
{"text": "awwwww so wonderful and lucky!!", "label": 0}
{"text": "Probably the MAGATs", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "*“I am an ultra runner,” Schock tells PEOPLE. “I'm not a hiker. I don't put on backpacks and go out for multiple-day trips. I don't know how to fish. I want to finish a course as fast as I can and come back home. So I had no shirt. I had a pair of shorts, I had Freddy and a dog pan. These were the only items in my small backpack.”*\n\n*But what started as a one-day run for Schock became a harrowing month-long ordeal when he got lost with no food, no phone service and barely any clothes. With his backpack as his only shield from the elements, he was starving and near-death* [*when he was finally rescued on Aug. 30.*](https://people.com/missing-hiker-found-alive-month-after-disappeared-washington-national-park-8707640) ", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "The North Cascades is a real wilderness.  It's amazing that he survived.  Next time he will put some survival stuff in that pack I'd bet.", "label": 0}
{"text": "but real smokers will continue to throw their butts on the ground", "label": 0}
{"text": "So what you are saying is that the dog is way smarter than the man.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "ALWAYS bring basic survival gear when going into the wilderness.", "label": 0}
{"text": "Right? Oh well, if straight people are going to be obnoxious and upfront about their proclivities across music, arts, sports, culture, and politics, I'm grateful that we have some queer representation as well ", "label": 0}
{"text": "Yea I don't get this. Who gives a shit. So you like both. Just do your sport.", "label": 0}
{"text": "I won't disagree with the smarter part but also that dog probably sniffed his way back", "label": 0}
{"text": "Did the dog survive tho?", "label": 0}
{"text": "Ongoing global war, economies breaking down, working families being decimated by wealthy nepo babies trying to look mean for their friends.\n\nBut yeah totally courageous to bang people. Truly making the world a better place.\n\nCongrats on the sex.", "label": 0}
{"text": "Yes, the dog was rescued weeks before he was.", "label": 0}
{"text": "Nobody cares who you fuck.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "I would love to live in that world.", "label": 0}
{"text": "We do. If any ody has some shit to say, tell them to get fucked and move on", "label": 0}
{"text": "So when he was found alive, his mother began losing hope? What is this title… 😂", "label": 0}
{"text": "OP’s post is about forgiving loans with absolutely no plan to stop predatory loans;  which seems to be “uplifting” to most posters on here.  \n\nAs i have explained repeatedly, the government is the one who made it impossible for student loans to be defaulted on.  They sold this as a way to increase access to loans so more people would go to school, which seems like a nice idea, but just funnels money to rich donors and back into politicians coffers.\n\ni have a bunch of downvotes on my post up above where i suggested going back to to the old system where you could default.  Lots of right-wingers talk about this.  You don’t hear us because we get downvoted to hell on reddit.  \n\nBut politicians don’t talk about real solutions because they are in bed with the banks and the schools.  And they want to buy your vote with an easy fix that doesn’t actually address the problem.", "label": 0}
{"text": "Lol and? They don't rule the world. Religion is stupid. Why do you care what stupid people think? Honestly - who cares? Normal people do not care. I don't know why you choose to focus on what idiots think. It's so weird", "label": 0}
{"text": "Because they make laws targeting gay people or worse, throw gay people off of rooftops.", "label": 0}
{"text": "You're right, I should be out there telling kids about how I bang anything that moves while posing for photos. I need to start giving back.", "label": 0}
{"text": "Was there a shortage of queer Latin DJs in LA?", "label": 0}
{"text": "![gif](giphy|BpnkuY1i2rBpm)", "label": 0}
{"text": "Happy to spread the word! I do a lot of stuff solo, so I may have had more reason than most to go looking for them. Doesn't take long before you start wondering what you'll do when you have a serious problem in the backcountry and you can't send a hiking partner to go for help!", "label": 0}
{"text": "Terrifying. I used to be a long distance equestrian before a near fatal accident. I used to fuck off into the woods alone with no reception, a small amount of water and a small amount of food. I’m hypoglycemic so I wouldn’t have lasted long alone, thankfully the only bad falls I had while alone were in a 14000 acre park and my horse came back for me. Had I not had that fall my next purchase was a satellite phone. This very easily could have been me but I would not have survived. ", "label": 0}
{"text": "Your logic is juvenile and quixotic. Although you seem like an ally, your minimization of the struggle that community experiences actually does more harm than good.\n\nBasically, you're telling someone to \"just rub dirt in it\" when they actually need stitches.", "label": 0}
{"text": "Yeah this isn't that uplifting to me, guy was just an idiot. I'm not uplifted.", "label": 0}
{"text": "And after inflation its still more expensive 😂", "label": 0}
{"text": "But somebody having shit to say is the counter example. By definition, if that happens, then somebody does care. You might not care that they care, but they exist.\n\nMore importantly, they exist and their political leaders have organized a panic about you and who you fuck in order to engineer a fascist takeover of the richest country and largest military in the world. Telling them to get fucked and moving on isn't really engaging with the severity of the reality you live in.", "label": 0}
{"text": "I have a custom mod, custom everything, can tune the settings to exactly how I want them and it's fantastic.  I tried a disposable once when I was out of town and it was awful, they're such waste in both experience and physical garbage.", "label": 0}
{"text": "You said \"nobody cares\", but what you actually meant was \"I like to pretend that the hundreds of millions of people who care don't affect my life.\"", "label": 0}
{"text": "They're very much not an ally. They've made it very clear they don't think about or particularly care how homophobia, etc impact people besides them.", "label": 0}
{"text": "Nobody ... who is rational ... cares. Sadly, there are plenty of irrational people.", "label": 0}
{"text": "“I told you we were lost. Look, I’m going to level with you, I said that ‘backpack’ wasn’t big enough to carry the trips required for your ‘ultra runs’. I’m out of here, but good luck.”. \n\n-Dog", "label": 0}
{"text": "The fact that you reduce people’s identities to something crude like “bang” just shows that this representation is important and necessary so that kids grow up feeling less alienated.", "label": 0}
{"text": "It's hard to tell ignorance from malice on the internet (sometimes).", "label": 0}
{"text": "So? Why do you care what irrational people think?", "label": 0}
{"text": "Dog saw how he started looking at him.\n\n![gif](giphy|WoQmhbWcr7LoODs8a4)", "label": 0}
{"text": "Well, it's supposed to be thought provoking, but everyone thinks differently, so yes, people disagree a lot about the Bible. That doesn't mean it can't teach anything, it just means that it's teaching many flawed individuals, as intended.", "label": 0}
{"text": "Serious question. \n\nThey didn’t take the cat with them when being evacuated. Why not?", "label": 0}
{"text": "Darwin was denied.", "label": 0}
{"text": "It sounds like he was lost to floodwaters (was looking for safety on a neighbors roof and the roof/house floated away) and the family had to evacuate before they could find him. \n\nI live in the region and know many people personally who were unable to keep their pets close for various reasons - in some cases even when having your pets close they acted very erratic in the storms and began trying to find safety independently. My own cat got hurt trying to escape from our house even though we were at no risk of flood on the main level. Luckily we were able to keep both pets safe :)", "label": 0}
{"text": "That's a valid point.", "label": 0}
{"text": "Coming out as Bi is LITERALLY just a person telling you what kind of sex they have.\n\nThe mental gymnastics you attempt are hilarious though, so please keep going.", "label": 0}
{"text": "....no If you die you die", "label": 0}
{"text": "The dog was found just a day or 2 after he went missing. That’s actually how they found out the guy was missing - they found the dog and called the guy’s mom, informing her they found his dog but don’t know where her son was. She told authorities she hadn’t heard from him since the day before he went missing, so they officially started an investigation.", "label": 0}
{"text": "Thank you for clarifying.\n\nIt wasn’t very clear to me from the article why the cat ended up on the neighbour’s roof.\n\nGlad it all ended relatively safely. \n\nThe trauma for such weather must be immense for everyone.", "label": 0}
{"text": "Why does the article not make it clear whether they found Freddy or not?! Did the dog make it???", "label": 0}
{"text": "I graduated with a degree in Natural Resource Management in 2008.  There were over 100 other graduates with the same degree, and the next year there were maybe… 20 open positions those graduates could fill in the next year in the entire state of Alaska.  So good luck I  guess to the 80 that didn’t get those positions and kept applying with gaps in their resumes.  Oh then the housing and stock market crashed and no jobs were available especially in Natural Resources, so yeah that was fun.", "label": 0}
{"text": "Always funny how quick people are to show they have no idea what they're talking about.", "label": 0}
{"text": "What health problems have been shown in vapes? Just can’t ban things on an assumption. Yeah clean air is better but so is fresh water without caffeine or sweeteners. \n\nUntil the science is there, at least state that we don’t know but don’t recommend it, instead of banning something out of a belief. \n\nNot really uplifting news. ", "label": 0}
{"text": "Oh hey it's an obvious bot farm fool that exclusive comments propaganda.", "label": 0}
{"text": "Yeah. And now we know they actually cause cancer from…research. \n\nBanning something without scientific research is the same thing as banning something based on religion. What’s the difference?", "label": 0}
{"text": "30 days is about the typical limit, as I understand, that humans can go without food so long as they have water. Yes, it can get dangerously cold at night there even in summer but in this case he would have been dead of starvation, not exposure. Obviously I am not recommending that anyone go do this and hope for the best in the summer, but in the winter, they would have found his decomposed corpse, not an emaciated but alive human.", "label": 0}
{"text": "That has absolutely nothing to do with my question, which was mostly rhetorical, anyway.", "label": 0}
{"text": "Exactly! It’s the same mentality as banning something out of belief. Because with the current research there’s no evidence at all, only that fresh air is better, no shit. But we don’t ban chips, sodas, etc. \n\nRidiculous stance and don’t get how people think acting like a theocracy is uplifting. ", "label": 0}
{"text": "He was living with the Squatch People and they made him promise not to tell where the village is. They make some really good ale and the band isn't that bad.", "label": 0}
{"text": "Then go vote. Vote blue. Get 7 others to vote blue. That's how democracy survives.", "label": 0}
{"text": "I'm sorry. I forgot to put the sarcasm closing tag on it.", "label": 0}
{"text": "I hate how Americans have adopted more acronyms in their speech and text. I think it makes language uglier but my biggest gripe is how often people throw out new acronyms like as if we’re all supposed to know what it is. Every show or book has to have an acronym, and public figures and celebrities too.", "label": 0}
{"text": "They claim that Kamala Is making up policy to get votes. Insulin, weed, democracy, yeah keep pandering to me", "label": 0}
{"text": "Bet you anything he'd have been wearing a shirt in December, though", "label": 0}
{"text": "It's a few hundred bucks plus insane predatory subscription fees.  \n  \nEven if you shell out for the product itself you'll pay hundreds more for subscription services (or pausing your subscription).  \n  \nIt's messed up, because it's a real barrier to people who want to get outdoors, beyond car camping. You're already expected to spend hundreds on gear (even budget friendly stuff), so tack another $300 minimum on top of that and you're easily hovering around $1000 for a single person.  \n  \nThis guy wasn't even a hiker or expecting to be out for long. It would be prohibitively expensive to keep an active subscription on a PLB for what amounts to a day run. I don't blame him for not having one.", "label": 0}
{"text": "*Overconfidence is a slow and insidious killer*", "label": 0}
{"text": "Idk a lot about gps & satellite coverage. Any idea how much it costs for a company to have the “access” to gps on a monthly or yearly basis? It would be nice for some organization to develop a similar product but at a significantly lower cost (if possible). I get that “profitability” is king but i would imagine an established outdoor company that’s already turning a profit would attract a lot of new customers if they offered something like this", "label": 0}
{"text": "Never go out into the wilderness with minimal or no gear. He's lucky to be alive.", "label": 0}
{"text": "I got mine for far less than that ($200 secondhand) and all it needs is a service every five years. There are definitely cheaper options. I like having it although I've never had to use it thankfully, but it keeps my mum happy when I'm solo hiking! \nHiking doesn't need to be expensive, it's only if you follow blogs or have a real sense for comfort that you think you need all the bells and whistles. I started out super cheap, borrowing, secondhand, opshops, and have built my kit slowly. It's better to borrow first and buy slowly anyway cause you don't know what features you will value til you've had a few goes.", "label": 0}
{"text": "Why dont you go ahead and share your source on that claim with the class :)", "label": 0}
{"text": "Don’t bring extra crap.  Just depend on others to spend time, money, and to risk themselves to save you.", "label": 0}
{"text": "To give water to your dog, like a cup.", "label": 0}
{"text": "There's one I got my Dad that has no subscription. McMurdo Fastfinder I think it's called. Designed for boating but works for hikers and people who live in remote parts.", "label": 0}
{"text": "If you think it’s just Americans then you must not interact with anybody else.", "label": 0}
{"text": "What could go wrong going into the wilderness unprepared?\n\nI don't understand people like this \nOh yeah this path of wild nature over there let me run it with no tools GPS or supplies brb", "label": 0}
{"text": "and if you were lost in the woods, he would have lead you back to civilization for that epic hot dog", "label": 0}
{"text": "Doesn't really seem like an  uplifting story.", "label": 0}
{"text": "On Today, from 6 months ago. Ironic name...", "label": 0}
{"text": "I'm glad he's  OK.  That said he's a case study in what NOT to do.", "label": 0}
{"text": "This is a moronic take. If you’re out in the wilderness alone, you bring survival stuff. Full stop. 3oz for your life.", "label": 0}
{"text": "Gosh, that article really kind of glosses over how bad it had gotten. Here’s a [snippet from another piece online](https://www.pnt.org/what-heroes-look-like/) about it:\n“A half a mile off trail, along the bank of the Chilliwack River, laid out and exposed to the elements, they found Robert. His situation was dire. I won’t provide most of the details\nthat I learned about his condition today, because I think the only appropriate person to decide whether those details should be\nshared publicly is Robert himself. What I will share is that when our crew found Robert, he\nwas able to communicate to them that he had been immobile, stuck in that exact spot for approximately two weeks, and based on the condition that he was found in, there was no reason for the crew to question it.”\n\nIt also references the “great psychological toll” it took from the workers who came across him in that condition. Well done to them, they truly did go above & beyond.", "label": 0}
{"text": "So around 380 million people in the US and it's not even a billion dollars? So every person saved less than $2.63 each? Not exactly numbers to brag about.", "label": 0}
{"text": "Honestly, the smartest thing to do is follow your dog in situations like this.  That nose is impressive.", "label": 0}
{"text": "Maybe a regional thing. Everyone where I am from calls them \"dog bowls\".", "label": 0}
{"text": "It’s a bot account just farming for clicks", "label": 0}
{"text": "And they say people don’t appreciate the national parks enough…", "label": 0}
{"text": "How do you read \"Criticize Dems and push them to the left,\" and somehow it comes out the other side meaning \"I should ally myself with the Devil and think that will work out better than working with an evil person?\" \n\nJust how?", "label": 0}
{"text": "So a scant 5 bucks per year? That's like eating a 50 dollar meal and leaving 2 pennies as the tip. It's not a tip, it's a message.", "label": 0}
{"text": "If they are that cheap, why can’t people pay for them by themselves?", "label": 0}
{"text": "Especially since most of the people who are making this about Trump would have aborted Waring.", "label": 0}
{"text": "Get out and vote 💙 up and down the card America. Save your country and your freedom from the nut jobs", "label": 0}
{"text": "Authorities are on the way.", "label": 0}
{"text": "So he should be incarcerated for his own safty and the sanity of his mother is what i'm getting out of all this", "label": 0}
{"text": "Not understanding why anyone goes into wilderness without gear. Water, food, map, compass, lightweight coat, all fits in a small pack.", "label": 0}
{"text": "And selfishness! Like how many times has he wasted search resources when he could have just *learned* from his first time that he’s not as capable as he liked to pretend he was.\n\nAnd those poor trail workers, kind of sounds like the state he was in would be nightmare fuel.", "label": 0}
{"text": "Ok but the only thing I don't understand is how do you just \"send your dog home\". My dog would be looking at me like I am moron if I was trying to shoo her away in the middle of nowhere.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Apparently he didn’t learn from the first few times he got into difficulty, so odds are he’s just going to continue to selfishly risk other people again & again: https://www.reddit.com/r/UpliftingNews/s/ez9hesGr3K", "label": 0}
{"text": "Could have guessed that.", "label": 0}
{"text": "I’m not in the gram counter movement.", "label": 0}
{"text": "\n> “Many times I’ve placed myself in situations where I’d question if I’d ever make it back, and always did, usually through the aid of another who would come along and save me,” he said ruefully. “I had a cocky attitude about it. This time was different. I knew, based on where I was, that the likelihood of help was almost zero. I was ready to die out there.”\n\nAs a person who has saved an ultra runner in a remarkably similar situation (no clothes, just caffeine gels, deaf battery on his headlamp, huddled under a tree a half-mile off trail in a thunderstorm, ten miles from a trailhead) I am not at all surprised that this has happened to him before.\n\nSeriously, fuck these people. “Selfish” is absolutely the correct read.", "label": 0}
{"text": "Haha he got treats for sure", "label": 0}
{"text": "Fox News headline: \"Economy contracts by $1bn because of Biden/Harris\"", "label": 0}
{"text": "Also, he left his wallet on the dash and windows rolled down. Great that the police id his car, but that seems careless, even if he made it back safely. ", "label": 0}
{"text": "7/10 bait, almost got me", "label": 0}
{"text": "Sad. So much pain that can be avoided", "label": 0}
{"text": "Did his dog abandon him? That's so sad.", "label": 0}
{"text": "[I'm just going to.leave this here](https://beascout.scouting.org/?gad_source=1&gclid=Cj0KCQjwpvK4BhDUARIsADHt9sSzTvYEfukR7pUx--sV2XvV-6SYKoVEdmxV8vd11eqrnq4v-LXSt4gaAn-EEALw_wcB).", "label": 0}
{"text": "Well. Then you also consider that this didn’t affect Americans on private insurance. So it’s $1B over 119m people. Then consider that those people are old and retired or catastrophically poor. So any savings on drugs is going to have a pronounced effect. \n\nLastly, you’d also remember that this was the first time this was even possible because of the Biden Harris administration. So, as this continues to mature you’d expect prices to continue to improve. \n\nSo the real question to ask yourself is “would a trump administration continue this?” The answer is clear and the answer is no", "label": 0}
{"text": "The NC are no joke. 30 min off the highway and you're in deep backcountry. i am happy he lived, but he's dumb as a rock. going into the backcountry unprepared is stupid. preparedness can take different forms, but one form it doesn't take is \"nothing\".", "label": 0}
{"text": "Agreed", "label": 0}
{"text": "Explain please: 7/10 bait.  Thank you.", "label": 0}
{"text": "Or do your “too cool for survival equipment” ultramarathon somewhere other than the north cascades", "label": 0}
{"text": "330000000", "label": 0}
{"text": "I think to our cats and dogs, we are so useless sometimes. \n\n-You can't smell that?! \n\n-You can't see in the dark?!! \n\n-You can't hear that?!!", "label": 0}
{"text": "Let’s get to the root of it—healthcare in America has become an outlier among first-world nations. Most other developed countries provide healthcare to their citizens as a fundamental right, not as a privilege tied to employment. For a society that prides itself on independence and innovation, why have we trapped so many working Americans in jobs solely for benefits like healthcare? This dependency on employer-provided insurance doesn’t support freedom; it’s a tether.\n\nTrue freedom includes the right to live without the constant anxiety of medical costs wiping out your savings or debt dictating your future. Healthcare isn’t about handouts; it’s about providing stability so people can invest back into the economy, start businesses, and support their families without health being the gamble. And, for anyone who worries that government-provided healthcare will diminish job incentives, consider this: better health creates a stronger workforce. If corporations in the 1950s promised health benefits to attract talent, why shouldn’t we raise the standard and make healthcare a guarantee in 2024?\n\nThe decline in union power didn’t start with the social programs of the ’60s. It began with policies favoring corporate interests and outsourcing that undercut bargaining power. Imagine if more workers had health security—unions might have thrived even more, able to negotiate for better wages without the baggage of healthcare coverage in the mix.\n\nThe call for universal healthcare isn’t about ‘waiting on the government’—it’s about finally catching up to the rest of the developed world on a moral and economic level. This isn’t about ideology. It’s about progress that supports every worker, every family, and the country as a whole. It’s about keeping our society healthy, independent, and future-focused.", "label": 0}
{"text": "Reminds me of those people that are physiologically incapable of feeling fear, so they get themselves into all kinds of stupid situations. That’s literally the only good explanation I have for his behavior.", "label": 0}
{"text": "I wandered off into the forest once when I was like four years old. I was gone all day and I think my only saving grace was that I had the family dog with me, and she never left my side. \n\nMy family STILL TO THIS DAY gives me shit about “getting wost in the woods” hahaha", "label": 0}
{"text": "Apple now has SOS feature on new phones that uses satellites to communicate with emergency services.", "label": 0}
{"text": "Nah, but she was looking for her mom who was at a bus stop and seemed confused and surprised.\n\nEither the kid escaped from the house and decided to follow mommy to work or mommy wasn't really paying attention to her daughter. No mention of how grateful she was, no quote from the mother. \n\nIt makes me feel sad that this even needed to happen in the first place. I hope it was just the former and she slipped out because she loves mommy so much.", "label": 0}
{"text": "When talking about financial matters, amounts are crucial. That's not negotiable.\nPublic insurance, not any longer but spent 2 years in the system and will never go back.\nThe negotiated prescription costs have been going on since the early 80's. It's when the government attempts to fix prices, that you kill the free market system and there is no advancements or innovation. No innovations in medicine means lots more people die from illnesses and maladies because there's no money in coming up with cures or treatments.\nTo answer you specifically, yes. 2 medications had prices lowered as a result of gov't negotiations; HOWEVER, they were already negotiated to an even lower price through walmart pharmacy. the gov't actions caused those prices to increase slightly. \nA clear example of trump's efforts being negated by Biden - insulin", "label": 0}
{"text": "I don't understand your argument at all but none of what you're saying is true or you're confusing public rates and private rates. \n\nI'm not really sure where you're going with the idea that insulin was cheaper through your insurance but went up because public insurance started negotiating rates. \n\nOne possibility that immediately pops into my head is that the company was able to offer lower rates to private insurance because the public insurance rates subsidized it. Which, I guess if you think you should be subsidized by the sick, poor, and elderly then, I guess I disagree? You should be subsidized by the whole country not the desperate, which would be possible if we had a public insurance guarantee. \n\nAnyway, I hope you don't have to deal with the consequences of your choices.", "label": 0}
{"text": "Sounds like quality jerk they are. They're the one that doesn't supervise a 4 years old correctly. Who blames a 4 years old for getting lost in the woods? What an irresponsible parent they are too shift the blame to you for it.", "label": 0}
{"text": "Im grateful every day that my pup has an incredible sense of direction. If I were to get lost with her im fairly confident I could say cheerfully to her \"OK lets go back to the CAR!\" and she would lead us there without issue. \n\nIts a skill I frankly dont have. That said I try never to put myself or her in.", "label": 0}
{"text": "It’s sad we’re basically completely banking on underfunded scientists bailing us out of this.  God knows businesses aren’t going to do their fucking part,", "label": 0}
{"text": "[You're first claim has no source, so I found one for you.](http://www.wkrn.com/news/tennessee-politics/election-officials-tn-lawmakers-address-concerns-over-early-voting-touchscreen-issue/amp/)\n\nThe problem was identified as mundane (the same machines were used, the only difference being they didn't use stirring sticks this time, and they're now using them). So that's a non issue. Actually maybe that's why you didn't source it. \n\nYou actually had a source for your second one so that's nice. [Unfortunately I did literally 5 seconds of googling. ](https://www.detroitnews.com/story/news/politics/2024/03/01/michigan-dead-voters-registration-recordings-removal-judge-rejects-challenge-jocelyn-benson/72812636007/) So they are one of the best states for removing dead people from the rolls. And even if they weren't, their state automatically flags and rejects ballots signed by dead people. It's usually for the mundane instance where someone submits a mail in ballot and dies before the election, but it's just as effective at combatting the made up scenario of voter fraud.", "label": 0}
{"text": "My mom did that, but she didn’t have a dog with her, she was hanging out with bears for hours. ", "label": 0}
{"text": "Or a PLB! $400 initial investment and $15/month in subscription services that you can activate per month needed. \n\nIt’s trivial.", "label": 0}
{"text": "\"Just going for a run\" for an ultra marathoner would be running down the street.\n\nGoing into the backcountry, as you alluded to, is incredibly dangerous and is never just a \"just.\"\n\nA twisted ankle could literally mean death", "label": 0}
{"text": "Well I’m uplifted.", "label": 0}
{"text": "I mean I’ve literally spent 20 years in and around the ultramarathon community and know plenty of people who schedule regular runs on trails but okay.", "label": 0}
{"text": "I have never been to a wilderness like this. Is there any chance of obtaining food in such conditions? What could he had done to have it better? Where do you get water? Why could not he sleep? How could he get warmer at night?", "label": 0}
{"text": "I've spent nearly the same time in the backcountry.\n\nAgain, going into the backcountry is never a \"just\" anything. Doesn't matter how experienced you are.", "label": 0}
{"text": "The article says that he told his dog to go home, so it headed back home but couldn't cross the river on its own.", "label": 0}
{"text": "Came to this sub to improve my mood, and this is interesting. \n\nOut of all I've learned about such disorders, I've never heard acetylcholine mentioned in the same sentence as schizophrenia.\n\nI can understand why they would be interested in AD with this medication. \n\nPsychosis associated with dementia is such a terrible symptom and traditional anti-psychotics cannot be taken if you have AD.", "label": 0}
{"text": "There are mushrooms if you know which are ok.  Berries.  Greens, if you know which. Fish if you can catch them. This guy would be unable to start a fire and had no knife so raw fish. There’s a lot of water there.  It’s hard to sleep when you’re cold, frightened, and starving.  Warmer, a bit, with moss, fir and cedar boughs over and under you. Basically, he screwed up.", "label": 0}
{"text": "Alright, let’s dig in. First off, trapping Americans in jobs just for healthcare—nothing says “land of the free” quite like needing a job to go to the doctor. And yeah, the ACA was supposed to help, but if you don’t fit a very specific profile, “affordable” ends up meaning “still too expensive.” Great, right?\n\nNow, sure, companies started offering healthcare back when WWII wage caps pushed them to get creative. But let’s not act like corporate America wasn’t thrilled about finding a way to keep people glued to their jobs. This isn’t exactly just the government at work—corporations ran with it because it kept them in control of our healthcare access.\n\nAs for union decline, it didn’t need social programs to speed things along. Policies that boosted corporate interests and outsourcing did plenty of damage all on their own. Let’s face it, the same system that’s supposedly about “free markets” has always been quick to stack the deck for big business, especially when it came to crushing union power.\n\nNow, on universal healthcare, you’d think the idea of catching up with the rest of the developed world wouldn’t be this radical. Other countries with single-payer systems aren’t exactly dealing with an exodus of doctors. In fact, our system’s doing a fine job pushing people out on its own—with insane burnout, mountains of admin work, and profit-focused care.\n\nAnd yeah, universal healthcare would need investment and planning. But the fact that it’s challenging isn’t a reason to write it off. It’s the reason to start now, unless we’re okay just kicking the can down the road indefinitely while every other developed nation manages to make it work.", "label": 0}
{"text": "I’m responding to the people who think he should be carrying a full wilderness survival kit on a couple hour run. \n\nI think *you* are missing the point.", "label": 0}
{"text": "Thats for most of the east coast, land of gently sloping mountains and lots of streams. Also lots of civilization. The west coast and Rockies have cliffs and idiosyncratic sources of water, and you’re much more likely to be very far away from any roads but the one you came in on. Stay put and wait for someone to find you.", "label": 0}
{"text": "Didn't they do something like this 10+ years ago?", "label": 0}
{"text": "Beautiful", "label": 0}
{"text": "People like this that go out, massively unprepared, acting like it could never happen to them, piss me the hell off. Stay on the trail. Don’t want to? Bring a satelite phone? Or at least a mother effing compass. But now you’ve traumatized some workers and scarred family members, and the nation will reward him with a movie. Same thing happened to James Franco guy", "label": 0}
{"text": "Actually in this case he doesn’t need to because “it will never happen to him”", "label": 0}
{"text": "I was hiking with my corgi and she’s so stupid we walked by a bear 3 feet away and she never noticed", "label": 0}
{"text": "GPS comes from satellites owned by the US military. Bill Clinton unencrypted them for the public benefit, worldwide.", "label": 0}
{"text": "What do you mean by \"fire starter\"? Lint? A source of sparks?", "label": 0}
{"text": "I wonder what that relationship is like after they're both back home. ", "label": 0}
{"text": "And a satellite cellphone", "label": 0}
{"text": "🎵 I’ve got a golden ticket… 🎵", "label": 0}
{"text": "I mean, I'm glad he made it out alive, but what the hell was he doing in North Cascades if he isn't a hiker/climber? North Cascades are known for being among the most remote areas in the entire national park system. Moreover, the hikes there are significantly more advanced than the rest of the state.\n\nDon't leave the trail unless you're an experienced backpacker, have a GPS, (a dedicated one. Some app on your phone doesn't count) and a waterproof physical map of the area to fall back on in the event the GPS fails.", "label": 0}
{"text": "Also if those trail workers hadn’t been in the area this story likely would’ve ended differently.", "label": 0}
{"text": "Lmao damn no loyalty", "label": 0}
{"text": "Doesn’t deserve a click with that headline", "label": 0}
{"text": "Dog ain’t no snitch", "label": 0}
{"text": "This comment should have been the headline", "label": 0}
{"text": "As glad as I am the dog and dude are alive, someone please help me process and/or explain what happened with his dog, because as I am at a loss; You can't just tell your dog to \"go home\" and it does, that isn't a real life thing... There is absolutely no way that, after running miles into the unknown guts of a national park that a dog could just find it's way back home on command (someone please prove me wrong without linking the \"my pet traveled 300 miles and rang my doorbell to come back in 10 months later\" articles)\n\nIt sounds like the dog either got bored and wandered off after the dude got  lost and frail, the dude ran the dog off because he didn't want to try to eat the dog if he got hungrier, dude couldn't keep up with his dog and ended up getting lost, or he went out there with the intention of \"getting lost and dying\" but after letting his dog go and got further into the woods, he had a change of heart and was luckily found before he died.\nThat all being said, you can't just tell you dog to \"go back home\" while you are in an area you and your dog aren't too familiar with, and especially if you are going out on a 20 mile run... \n\n.... worst case scenario is he actually tried to eat his dog, but the dog fled... \n\nAnyways, shitty situation all around for the dude and the dog.", "label": 0}
{"text": "Just kept scrolling to find out about the dog", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "👏", "label": 0}
{"text": "--> clickbait", "label": 0}
{"text": "Because the type of people we most need to be on birth control are the type of people that have other priorities for their money or no money at all (minors, those relying on food banks)", "label": 0}
{"text": "We'd all be in much better positions to take care of our own families if billionaires weren't gouging us for all we're worth. Did you know that worker productivity decoupled from wages in the 70s? Since then, you are getting paid less and less of what you are worth. If that hadn't decoupled, all workers would be getting paid about double right now. *Double.*\n\nBillionaires are taking half of everything you *should* be earning. That's real. That's right now.", "label": 0}
{"text": "Object permanence is pretty OP tho", "label": 0}
{"text": "It's incredibly selfish. From [another article](https://www.cascadiadaily.com/2024/sep/19/a-month-lost-in-the-north-cascades-without-food-or-shelter-hiker-details-improbable-rescue/):\nThe seasonal trail crew workers had Wilderness First Responder training but were not Search & Rescue team members or medical professionals. Jeff Kish, the PNTA executive director, praised their heroism and resilience in a Facebook post on Sept. 4.\n\n“There is nothing that can fully prepare anyone to handle the mental and emotional burden of providing aid to someone like Robert under the circumstances that they found him in,” Kish wrote. “They saved [his] life against improbable odds, and at great psychological toll.”", "label": 0}
{"text": "Fellow Coloradan here; I was so excited to see the ban in effect! My mom has been solely using reusable bags since before I was born, so I was already on that bandwagon. Also, old plastic bags will shatter into a million pieces when you pick them up, and I encountered this far too often during my city's cleanup days. I'd get as much as I could, but it wasn't very effective in the end. I still see some plastic bags in the environment, but they are nowhere near as abundant as they were. It makes me happy to see stores offering only paper or reusable canvas bags for a fee. I wish every place would do this, but every small step counts.\n\nHawaii banned them a while back, and it was odd but refreshing not to see ANY there when I visited. Unfortunately other tourists still littered everything else though... It bothers me that people travel to a beautiful place with native people and vegetation and treat everyone and everything like crap. I just wanted to sit by the ocean, watch life in the tide pools, admire the vegetation, pet the outdoor cats of the condo we rented, watch the koi (and admire a gigantic leopard plecostomous; the one in my aquarium was not anywhere near that size), float above a school of fish, admire the turtles, watch the manta rays, and absorb the peace.", "label": 0}
{"text": "Most dogs would not lead people to you if you got lost. Maybe if they see you are injured, but most dogs would understand you need this kind of assistance. They think you got it. One of my dogs went and got help when I fell and lost my breath, but the other one ignored me completely. Same breed.", "label": 0}
{"text": "That’s the key to happiness", "label": 0}
{"text": "> So which route would you like? \n\nPeople need to organize and demand their fair share from the employers. The government is not going to fix this problem for us. Study some labor history -- the government is inevitably on the side of the owners. \n\nThe problem is that most people are small-c conservative and will not take the risk of forming a union as long as there are other ways to get what they need to survive. Enter SNAP, WIC, LIHEAP, Section 8, ACA, Medicaid, CHIP, etc. ... all designed to keep the working class compliant and slaving away for low wages.", "label": 0}
{"text": "This comment is pretty much on track for Reddit", "label": 0}
{"text": "It is, but I get the train of thought", "label": 0}
{"text": "Sounds like the title of a movie. A lot more interesting than The Girl on The Train, or in The Window, or Next Door, or In The Pool, or The Girl With the Dragon Tattoo. Well, maybe not the last one.", "label": 0}
{"text": "> And yeah, the ACA was supposed to help, but if you don’t fit a very specific profile, “affordable” ends up meaning “still too expensive.” Great, right?\n\nSo, the government's \"fix\" of the problem turned out to be an abject failure, right?\n\n>But let’s not act like corporate America wasn’t thrilled about finding a way to keep people glued to their jobs.\n\nWait, isn't it a *good* thing when companies offer attractive benefits to their workers? I don't know about you, but I'll take everything I can get. Health insurance, life insurance, pension -- bring it on! \n\n>As for union decline, it didn’t need social programs to speed things along.\n\nOh, I think it did! Remember that up until the late 1990s, when the Internet advanced communication exponentially, it wasn't really feasible to outsource a lot of sophisticated manufacturing to the Pacific Rim. There is only so much you can do via the fax machine and overnight mail! So until the technology caught up, it was necessary to crush the American labor movement and keep workers compliant, and welfare was the perfect tool. It took men out of the family home, so they were no longer as inclined to fight to feed their kids, and put women in the job market (and they are cheaper and more compliant workers than men).\n\nIn the 1990s, the technology caught up; it was possible to move manufacturing overseas", "label": 0}
{"text": "You had me at Ricardo Blanco ...", "label": 0}
{"text": "I was chatting with one of my supervisors the other day about this quote attributed to the Dalai Lama:\n\n “Just as ripples spread out when a single pebble is dropped into the water, the actions of individuals can have a far-reaching effect. ~Dalai Lama\n\nThis story is an amazing example of the power we all have to change the world for the better. I wish these two a lifetime of happiness.", "label": 0}
{"text": "Here’s an article with details of the ordeal and how he was found. This man is so lucky: https://www.cascadiadaily.com/2024/sep/19/a-month-lost-in-the-north-cascades-without-food-or-shelter-hiker-details-improbable-rescue/", "label": 0}
{"text": "\"Girl on the Tracks\" would be a good title.", "label": 0}
{"text": "Gambling was never really uplifting to begin.", "label": 0}
{"text": "His dog ditched him?", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": ">\" With a family-owner committed to sustainability, it's a privilege that we can pay extra for the raw materials without having to charge customers extra,\" Christiansen said\n\n\nI know we hate reading articles here, but it's literally in the post", "label": 0}
{"text": "New, It’s always been expensive. They pay employees and generally act in long-term best interests. Being a private company means they can do things that a public company can’t. \n\nI don’t care for the licensed stuff either, but if you want bricks, hit marketplace and you can get a ton for cheap or free.", "label": 0}
{"text": "LMAO", "label": 0}
{"text": "They are raising prices annually and are already severely overpriced. Look at the licensed sets they sell (basically all sets they sell).", "label": 0}
{"text": "Not one person in the top comments here read the part where they say they’re not raising prices.", "label": 0}
{"text": "Lego prices per brick have not gone up in decades. Sets are just way more complicated than they used to be.", "label": 0}
{"text": "Yea people don't realize they are getting far more than they used to", "label": 0}
{"text": "I mean lego sets have been roughly 10 cents per piece for a long time. Some licensed sets are more expensive than that, but most are basically the same price regardless of license. Some of the larger sets are cheaper than that, even if they are licensed.", "label": 0}
{"text": "Dem PACs should plaster information all over these areas that it was Dems that made this possible and name and shame GOP politicians who voted against this stuff. Dem politicians in the state should show up to every event that starts and ends this work.", "label": 0}
{"text": "Off the Rails", "label": 0}
{"text": "It's also fascinating to me given their quality standards.  Keeping prices while maintaining quality is quite a big step in sustainable manufacturing.", "label": 0}
{"text": "Hard to gauge the response from Reddit though", "label": 0}
{"text": "So they have been price gouging for years???? Got it.", "label": 0}
{"text": "Perhaps at first, but I think the key point of the article is \"in an attempt to encourage manufacturers to boost production\". Lego is trying to stimulate demand, and therefore innovation. They're putting their profits on the line to draw real change.", "label": 0}
{"text": "Are you under the impression that any company not selling at cost is price gouging? \n\n\nAnyway, more to the point of OP, I do wonder if this has to do with material cost and availability at the Chinese factories. Iirc, previously they wouldn’t do construction bricks at the Chinese factory locations and limited those to minifigs and specialty pieces because the laws required them to use China-supplied materials and they weren’t satisfied with the quality of the ABS. Can’t help but wonder if this is just them finally finding a China-supplied plastic they like and trying to push it as an environmental move.", "label": 0}
{"text": "Ur telling me they can take a hit of 70% increased material cost and still “ not raise prices” doesn’t mean we are being price gouged currently…. Ok buddy.", "label": 0}
{"text": "They're not actually that much more expensive than they used to be. One part of why it seems that way is inflation, I think the best show of that is that new play-scale millennium falcon (the alt-universe black one) when accounting for inflation it's not only cheaper than all the other play-scale falcons going back to 2011, it has more pieces (albeit smaller ones on average due to the more complex builds). Not every set is going to be like this of course, but on average, price per piece hasn't been rising dramatically or anything.\n\nThe other reason is their adults-welcome push, which I think started even before that branding. That meant bigger sets that are aimed at people who either have a lot of money to spend on it OR people who buy lego once or twice a year. It's annoying, but some of the adult sets are pretty good value, the botanical ones are great for example.\n\nSo too many big sets combined with inflation gives the impression that lego is wildly more expensive when it used to be when it's really not the case.\n\nHonestly lego pricing is pretty all over that place sometimes, so it's best to look at it on a set by set basis, sometimes a set will be horribly priced while another will be priced quite cheap. For some of the best value I'd look into sets and themes aimed at kids. Lego city and friends have some great sets that are amazing value. The recent city construction vehicles look great and are priced really well. Even licenced themes are priced pretty good sometimes, like the falcon I mentioned earlier but a great example is the new fortnite sets, they are priced extremely competitively.", "label": 0}
{"text": ">they say they’re not raising prices.\n\nOh no! I definitely read it, I just don't believe it for a second. Lego has quadrupled in price in the last 10 years.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "“They’re putting their profits on the line…” really? The company that has doubled its annual revenue to 10 billion in under 5 years? How brave. Much courage.", "label": 0}
{"text": "that is so sweet. I'm glad they're both doing well", "label": 0}
{"text": "If they can do this without lowering their notoriously high standards, and they remain compatible over time with the current product, that would be quite the accomplishment.", "label": 0}
{"text": "Reuters left out a very important detail from the title. Which is that while the price for materials will go up for LEGO (a significant amount). They have said that the price for consumers WILL NOT go up.", "label": 0}
{"text": "Lego prices have risen every decade and will continue to do so.  They can say they’re not raising prices but history says no.", "label": 0}
{"text": "That guy was pretty weird though.", "label": 0}
{"text": "While nothing can *fully* prepare you for a real live rescue situation, Wildness First Responder training exactly prepares you for just this kind of scenario. Including recognizing that this patient selfishly endangered others, but providing psychological first aid anyway. I think the takeaway is that these rescuers weren’t looking for him, just out there doing trail work.", "label": 0}
{"text": "Not necessarily. Living in remote, homogeneous, dying towns, surrounded by everyone thinking the same way can invoke a lot of negative feelings like hate, jealousy, and loneliness. Some people will continue to dig their heels in, but once people actually see direct improvements to their lives (And know where that help comes from) keeps extremism from getting out of control. \n\n\n ", "label": 0}
{"text": "::Synths play:: butterfly in the skyyyyyyy", "label": 0}
{"text": "I wanna be...LEVAR BURTON!", "label": 0}
{"text": "Although it usually runs parallel to other sites.", "label": 0}
{"text": "We read it. We just don't belive it.", "label": 0}
{"text": "Take a look!", "label": 0}
{"text": "Honestly their margin is enormous already, it's plastic, it's already cheap as dirt and more common than water.", "label": 0}
{"text": "Obviously this story is bittersweet as well, but I think it's important to listen to people going through such a harsh reality when they speak of the good things in their lives, too.\n\nGet past paywall with Firefox's reading mode feature.", "label": 0}
{"text": "Set phasers to *love me!*\n\n![gif](giphy|l2R0corOGwFTlKZjO)", "label": 0}
{"text": "The image is bonkers ", "label": 0}
{"text": "And that’s how you die. No go prepared with everything.", "label": 0}
{"text": "happy there some beauty to come in this mess.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "In the Appalachians or flat land yes. In newer ranges no, this is how you end up hiking to a spot you can’t get out. And they look like trails. It’s a common issue in the canyon for example.", "label": 0}
{"text": "It is! Use Firefox's reading mode to bypass paywall", "label": 0}
{"text": "yeah, on my phone today :(", "label": 0}
{"text": "Works on mobile too!", "label": 0}
{"text": "\"The windmills, they're making the dogs gay!\"", "label": 0}
{"text": "Lego's QA is honestly mind boggling. The fact that you can take bricks made 40+ years ago and use them interchangeably in any configuration with any of the thousands of different bricks made any time since then is absolutely wild.", "label": 0}
{"text": "I have accidents but I'm trainable and love to learn new tricks ", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Thankfully we're starting to see parents brought up on charges as they are usually the vector by which the mud acquired the firearms. \n\nA former colleague was a student when a major high school shooting happened back in 1997.  She was even a classmate of the assailant. Her story was enough that when I was a teacher, I created my own defense plan for my students. I could safely shield two classrooms of students in a secure area. I should be focused on science, not defense tactics.", "label": 0}
{"text": "This is giving D.E.N.N.I.S. system", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Then downvote the post", "label": 0}
{"text": "Trans CHILDREN ?", "label": 0}
{"text": "Why is a child struggling with gender identity?", "label": 0}
{"text": "Easiest decision: throw her dog out. /s!!!", "label": 0}
{"text": "It was his street name", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Yes, as Lego bricks are not a necessary or essential purchase, price gouging does not apply to them. They are just a luxury brand of toy with a high profit margin.", "label": 0}
{"text": "If you truly believe that you’ve no clue about geopolitics", "label": 0}
{"text": "And why exactly does that invalidate a comment clarifying this and condemning the unnecessary clickbait?", "label": 0}
{"text": "Who said it did?", "label": 0}
{"text": "It's why I clarified it lol", "label": 0}
{"text": "This is sad because it’s not me", "label": 0}
{"text": "Thank you to all of them and all donors!  My fellow North Carolinians in the western part of our beautiful state so need this help!", "label": 0}
{"text": "This is better than presidents and governors.", "label": 0}
{"text": "Awesome.", "label": 0}
{"text": "Thank you for using their proper job title and not calling them a janitor.", "label": 0}
{"text": "What's the difference? When I clean I'm a janitor. I didn't get a custodial arts degree.", "label": 0}
{"text": "> The inside of wood is dry.\n\nNot in the North Cascades it isn't always, no. Which is what I said above. Your lack of experience doesn't embarrass me.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "The job title is custodian, not janitor.", "label": 0}
{"text": "Love this. This is the way. Neighbor helping neighbor!", "label": 0}
{"text": "Was this an issue?", "label": 0}
{"text": "Or controversial governors (looking at you, George Wallace)", "label": 0}
{"text": "One of the bigger issues in right to self repair. These machines are constantly down apparently. Haven't been to McD in a while, but I know when I was younger, there were days when I was told that the machine was down.", "label": 0}
{"text": "The machines were under a cintract by a company who was iwn by McDonald's and the repair company charges big fees. Only this repair company can fix it  so if its broken there only 1 option by contract.", "label": 0}
{"text": "Reddits 12/25", "label": 0}
{"text": "There's actually a big conspiracy. \n\nYou can find in depth documentaries about it on YouTube, but it's basically a big problem for franchise owners because the machines break all the time, and in order to fix it they must call the manufacturer to send someone down to repair it. Very expensive, and very profitable for the company that makes the machines.", "label": 0}
{"text": "For context, [this video](https://youtu.be/SrDEtSlqJC4?si=7BfT421nd8Oyra_4) does a great job of explaining the situation prior to this.", "label": 0}
{"text": "This time, in English", "label": 0}
{"text": "The company that made the machines was the only one allowed to fix them. They charged $$$ to do so", "label": 0}
{"text": "Wait, you mean POTUS or VPOTUS don’t have a say in it?\n\n![gif](giphy|6nWhy3ulBL7GSCvKw6)", "label": 0}
{"text": "Sorry, the McFlurry repair guy is broken.", "label": 0}
{"text": "Yeah, since they tacitly endorsed a certain presidential candidate, and in doing so embraced fascism... I'm not interested in eating there ever again.", "label": 0}
{"text": "Louis Rossmann will celebrate this", "label": 0}
{"text": "[Marist Poll Harris leads with those who have already voted in AZ,NC,GA](https://www.dailykos.com/stories/2024/10/24/2279305/-Marist-Poll-Harris-leads-with-those-who-have-already-voted-in-AZ-NC-GA)\n\nMore Republicans are voting early, but the votes again are not translating into a Trump vote", "label": 0}
{"text": "They are not really broken", "label": 0}
{"text": "That quick of a time is innsane.", "label": 0}
{"text": "3dollars for a cone ice cream. I’m shocked!", "label": 0}
{"text": "The patent office is in the pocket of big onion.", "label": 0}
{"text": "Okay, can I still be Garth?", "label": 0}
{"text": "He's still weird, but he used to be weird, too.", "label": 0}
{"text": "for real corpos gonna corpo, they always play both sides so they’re on top", "label": 0}
{"text": "It is a conspiracy because people are conspiring. These corporations have bought the senators and justices necessary to say you don't own the things you bought from them.", "label": 0}
{"text": "you guys have a bizarre definition of \"uplifting\"", "label": 0}
{"text": "literally millions. maybe even billions. \n\nyou’re not cool by saying that bruv….", "label": 0}
{"text": "that’s how they’ve been making them in aus for years now. it sucks.", "label": 0}
{"text": "Thought the real problem was they didn't want to clean them and people were getting sick from it.", "label": 0}
{"text": "It sucks that recovery efforts for a natural disaster in the wealthiest country in the world has to rely on personal donations. The fuck are we doing? This is fucking absurd.", "label": 0}
{"text": "Depends on the restaurant I'm sure but half the time, they're \"down\" because they're doing a bacteria killing heat treat cycle. Ours never broke and we had two so the cleaning was alternated weeks and the heat treat cycles were staggered too so there was in theory always one working", "label": 0}
{"text": "So like they literally weren't allowed to if I'm understanding correctly \n\nhttps://youtu.be/SrDEtSlqJC4", "label": 0}
{"text": "$6 for a McDouble, 4 nuggies, fries, and a drink isn’t too bad tbf", "label": 0}
{"text": "yeah, only the manufacturer could repair them I think.", "label": 0}
{"text": "I don’t understand why he would not follow his dog home. So many questions s", "label": 0}
{"text": "Haha fair! But if he carried a small InReach (you can even rent them for a weekend if you want from some places) he could have hit a button and had help within a few hours. \n\nI really need to buy my own InReach someday. I hear the new iPhones will have satcoms for these kind of emergencies. I think that's awesome!", "label": 0}
{"text": "Tried that. Snapped the bamboo spork and ripped a hole in the cardboard container.\n\nThe flurry is dead ladies and gentlmen", "label": 0}
{"text": "Wow. So basically the ice cream machine makers, Taylor Company, rigged the machines to purposely be overly-complicated and unhelpful in their functioning, forcing the franchisees who own the individual McDonald's restaurants to call their Taylor Company technicians for fixing, and the Taylor technicians cost literally hundreds of dollars to come out and service the machine.\n\nEpic scam.", "label": 0}
{"text": "... if you have a drivers license or general ID you HAVE a voter ID thats what those are and its all they are trying to enforce is you have your ID scanned being a requirement a non issue to anyone who can legally vote.", "label": 0}
{"text": "Don't forget the threats they would start getting.", "label": 0}
{"text": "Cba= can’t be assed?", "label": 0}
{"text": "My mom taught me how to read before I started school. She always told me that if I could read well, I could teach myself how to do anything. It's the most precious gift I've ever received and I always make it a point to thank her for it. She also never said no to a book and bought me a beautiful dictionary with gilded pages when she got tired of me asking her to define the words I didn't understand. It breaks my heart that this woman was robbed of learning how to read.", "label": 0}
{"text": "An attic full of books and no where to be sounds like paradise. Funny how life works out sometimes.", "label": 0}
{"text": "Write in online and report this lazy shit or they will keep doing it. \n\nI saw mine wasn’t mixed and I asked for it to be mixed. He was like, “oh you want it mixed?” I responded, “yeah, What the fuck do you think? That’s like asking me if I want my burger cooked”", "label": 0}
{"text": "I now approximately know who owns the Taylor company, without any need to look it up.", "label": 0}
{"text": "That shit used to be 4 dollars", "label": 0}
{"text": "Just the title? Sure. ", "label": 0}
{"text": "Isn't that just for ice cream? The McFlurry machines are completely different.", "label": 0}
{"text": "This is obviously a problem in the US. But in my 32 years of life in Sweden, I have never seen those ice cream machines broken.", "label": 0}
{"text": "The maintenance guy at the McDonald’s I worked at would start cleaning the machines at like 3am and still be going at 7 when I arrived. \n\nHe would talk to it about how everyone else was cruel to her and only he knew how to look after her right and shit and referred to it by a woman’s name I can’t remember. I’m sure he would be stoked", "label": 0}
{"text": "The maintenance guy at the store I worked at referred to our machine with a woman’s name and would talk to it out loud while he cleaned it about how nobody else could look after her like he could. I think spending 4 or so hours every day up to your elbows in that machine creates a bond", "label": 0}
{"text": "The \"Irish\" and \"Scottish\" versions of the Scum are both parts of the same paper owned by news corp.\n\n\nBest just to avoid them altogether.", "label": 0}
{"text": "I have never heard of a machine at Mc being down. Nor has anyone ever talked about it. Do we have different machine maker in Europe?", "label": 0}
{"text": "watch at lunch", "label": 0}
{"text": "I have lived in Sweden my whole life aswell for almost thirty years and the ice cream machine has been broken countless times in a lot of different cities, including all major ones", "label": 0}
{"text": "I’m actually shocked you say that! Then I can only speak for myself. Every single time I’ve ordered ice cream I’ve gotten one.", "label": 0}
{"text": "Can we get the original Mcflurry sizes back? I miss them.", "label": 0}
{"text": "Bowing down to political bullies is absolutely showing them.", "label": 0}
{"text": "You know you live in dystopian capitalism when a company get it shit done and it's upliftingnews", "label": 0}
{"text": "I grew up in poverty, my birthday treat was a cone at McDonald’s because they were only 50 cents in New Zealand. I get one every birthday now, so when I last went I was so pissed off. Buying for my kids and myself was over 10bucks. 😭", "label": 0}
{"text": "I literally never understood this. Why not just go to the store, buy a tub of vanilla ice cream, whatever type of chocolate you like, go home and just mix it all together yourself? You'd get multiple servings out of the equation, too. According to a commenter below, there's apparently a website that tracks which of McDonald's ice cream machines are down or not in your area? Like, couldn't we just do it homemade and save time, money and energy in the long run instead?\n\nI could maybe get it if you're out on the town with some friends and don't want to drive all the way back home just to get some ice cream, but there are literally dedicated ice cream shops out there already. Why even bother with McDonald's at all?", "label": 0}
{"text": "See ya!", "label": 0}
{"text": "YYYYEEESSSS FUCVKING YELL YES!", "label": 0}
{"text": "Frumpy was the one that flooded the market with money, he made sure his name was on the cheque. A lot of us didn’t need it, that’s how GME happened.", "label": 0}
{"text": "The entire legal case was fascinating. I read about it a few years ago and even posted a summary here on reddit. I suggest everyone look it up and finally understand what the *real* issue here is.", "label": 0}
{"text": "Goals: get yourself a partner that cares for you like that guy cares for that machine", "label": 0}
{"text": "The recovery effort isn't solely relying on the revenue from this concert. What are you talking about?", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "That guy should get himself a Garmin watch.", "label": 0}
{"text": "That’s a 4 min and 38 second pace per mile", "label": 0}
{"text": "I'm making a joke!  Relax.", "label": 0}
{"text": "Scruffy Scruffington Elementary?", "label": 0}
{"text": "Haha, he is pretty good. This is probably one of my favorite videos because at the surface this seems pretty innocuous but it turns out to be an insane example of corporate greed.", "label": 0}
{"text": "\"Billy Monger breaks double amputee\" OH NO\n\n\"...Record\" phew", "label": 0}
{"text": "A stray and your own dog are to very different things. Stray dogs are probably in very bad shape hygienically.\n\nMaybe she gave him a bath and fee treatment and just didn't mention it in the story.", "label": 0}
{"text": "Here's hoping that extremists don't try to murder the people trying to vaccinate children. (There is a real issue of conspiracies about the polio vaccine, resulting in extreme violence against the people distributing it, though tbf the CIA did run a fake vaccine program in Pakistan to steal DNA to track down Bin Laden, and that veneer of truth makes the conspiracy 10x more dangerous)", "label": 0}
{"text": "Yup because you said \"It sucks that recovery efforts for a natural disaster in the wealthiest country in the world has to rely on personal donations\". It doesnt have to rely on personal donations because it isnt.", "label": 0}
{"text": "There's also a whole ton of federal money being spent as well. In fact, the feds have met every dollar of aid that the states requested.", "label": 0}
{"text": "Oh it gets better. From what I've heard, McDonalds corporate has a stake in Taylor, and thus gets dividends back based of Taylor's profits. It's literally to McD's benefit to keep the machines broken.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Stay awesome, Claudene ✨", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Trickle down economics BABY", "label": 0}
{"text": "See, it works.", "label": 0}
{"text": "Maybe we can beat polio one day!!! Wait….", "label": 0}
{"text": "He will be broke in less than a year.", "label": 0}
{"text": "No, not really. Pakistan has a history of rejecting vaccine efforts. \n\nSome 200 people have died in vaccine related terrorism - polio workers and security alike. \n\nit's one of two countries in the world where polio remains because of public perception of the vaccines", "label": 0}
{"text": "my tired ass thought it said \"$20 billion he found on the ground\"", "label": 0}
{"text": "Oh  your one of those people, ID's are not hyper expensive anyone who claims they cannot afford it just does not want to spend money having one and thats their choice but it is a choice.", "label": 0}
{"text": "Or dead from eating at Golden Corral.", "label": 0}
{"text": "\"Uplifting news\" giving hope to the millions of gambling addicts throwing their last $20 away.", "label": 0}
{"text": "Is his name Charlie, and did he get a tour of the Lottery Factory?", "label": 0}
{"text": "If that happened to me, I'd go home and take a really long nap. I would wake up, read, go to work the next day, and then not cook that night for dinner. I would then repeat the process and, possibly, I'd not go broke from the stupid decisions I didn't type in the paragraph.", "label": 0}
{"text": "Can’t be. Trump and MAGA said it was a hoax.", "label": 0}
{"text": "Doesn't matter. IDs costing money is a poll tax and disincentivizes apathetic people from voting. Unless voting is free it's a poll tax and constitutionally illegal. There's a reason conservatives created poll taxes.\n\nYou still haven't addressed my points. I'll keep reminding you if you continue to respond until you start arguing in good faith.", "label": 0}
{"text": "They are wrong because “suing for the $1mil and win” part.\n\nYou’d have no way to prove that was your $20 ignoring video evidence, you’d have no way to show you were going to buy a lottery ticket (or even that specific lottery ticket) in a time frame that would have meant the winning one would have been pulled by them.\n\nI’m sure they think the US is full of frivolous lawsuit winners and the “McDonald’s Coffee Lady” was a huckster.", "label": 0}
{"text": "Isn't that technically trickle up economics, he found the money on the ground after all.", "label": 0}
{"text": "Yeah, like...you know you have a problem when you find free money on the ground and your first instinct is to spend it on gambling. ", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Where does it say he's an addict?", "label": 0}
{"text": "Not if climate change has anything to say about it", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Clearly this data is a coverup by the deep state", "label": 0}
{"text": "His name was Earl", "label": 0}
{"text": "Pakistan seems really backwards when they could easily be a very developed country if they didnt have such odd policies.", "label": 0}
{"text": "Hey jerk off. That’s what I said in my original comment. It’s not something anyone’s ever gonna get in trouble for. But it’s technically against the law. That’s all i said because people don’t realize it.", "label": 0}
{"text": "Why can't it be accurate? Homelessness, while a very real and growing problem affects a lot less people than a global pandemic does.", "label": 0}
{"text": "This is so beautiful. Actually making monument sit normal regular people who heroically do their job a that keep this place running are the real hero’s.", "label": 0}
{"text": "Might be better if it didn't. 🤷", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Doesn't help that the CIA genuinely ran a fake vaccine drive to collect DNA clandestinely in Pakistan to catch Bin Laden.", "label": 0}
{"text": "I hated reading about her condition, how awful", "label": 0}
{"text": "The number one cause of polio today is vaccine derived.\n\nI think everyone should be skeptical of oral polio vaccinations considering it's now the number one cause of polio on earth. But I'm sure people will say that vaccines that spread the disease they are trying to prevent is still a good idea.\n\nBut if it's the shot vaccine, I think that's still a really good choice and everyone should do it. But they shouldn't believe it guarantees they'll be immune to polio, especially if they are in a war torn area where sewage management becomes an issue", "label": 0}
{"text": "Very uplifting. War, dread and fear for your life. Fits the sub perfectly!", "label": 0}
{"text": "It's always good to hear that our efforts to fix what's been destroyed are paying off. It shows that hope is within our grasp and we can make a solid difference in the world.", "label": 0}
{"text": "He has a past but he's since sobered up and seems to be a good person now.", "label": 0}
{"text": "He’s a good man. Has his own share of heartaches but is always there when needed.", "label": 0}
{"text": "I think what he did was awesome, especially the fund raising, but he only pushed her at the end, not the whole marathon.", "label": 0}
{"text": "….that doesn’t make it ice cream sadly….", "label": 0}
{"text": "One more reason why everyone should support every Right To Repair endeavor they can.", "label": 0}
{"text": "*\"The Librarian of Congress, pursuant to section 1201(a)(1) of title 17, United States Code, has determined in this ninth triennial rule making proceeding that the prohibition against circumvention of technological measures that effectively control access to copyrighted works shall not apply for the next three years to persons who engage in certain non infringing uses of specified classes of such works.\"*\n\nSo, only for 3 years?", "label": 0}
{"text": "“Ice cream”", "label": 0}
{"text": "Soft serve, there ain’t enough real food ingredients to call that ice cream.", "label": 0}
{"text": "*\"Every three years, the Librarian of Congress, upon the recommendation of the Register of Copyrights, is authorized to adopt temporary exemptions, with respect to certain classes of copyrighted works, to remain in effect for the ensuing three‐year period.\"*\n\nSo it's thanks to the Librarian of Congress, Carla Hayden", "label": 0}
{"text": "As someone who worked as a McDonald's back in 2012 as my first job. No we couldn't repair them. They had to be repaired by a mechanic that worked for the company that makes the ice cream machines. The machines could be broken for days because we had to wait for the mechanics to finally reach our store in their rounds. This allows McDonald's to train staff or their own mechanics to repair the ice cream machines. Meaning they shouldn't be down as long as they've been meme'd of.", "label": 0}
{"text": "Hope that they can also fix the milkshake machines…seriously, in hot-a$$ Singapore, not a single franchise sells milkshakes…", "label": 0}
{"text": "The courts definitely do not work that fast. Interesting timing and nothing more.", "label": 0}
{"text": "It still means you have to go inside a McDonald's, nope, I'm good.", "label": 0}
{"text": "Taylor makes a bunch of machines.  These machines are said to be way more temperament than most other Taylor machines.\n\nThe manufacturer could have fixed some of the issues but they seemed to like the pay day so they didn't.", "label": 0}
{"text": "I wasn't referring specifically to the durability/repairability of the machines, but to the quality of the end product.\n\nI don't think anyone would attempt to dispute that McDonald's makes the best plain vanilla soft-serve, particularly at anything approaching the price point.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "He may have become too weak to move by the time he sent his dog away. They said he was immobile for two weeks before they found him.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Yes we were not allowed to get our maintenance man to fix the machine when it went down. We would have to call Taylor so they could send a tech and then they would diagnose it and then order parts. Our machine was down over the summer for almost 4 months!!! Taylor sucks!!", "label": 0}
{"text": "There was a third party who invented a machine that could plug in and diagnose and recommend fixes and McDonald's didn't want that as they own/leverage their own machine and service from a company that is headquartered right beside mcd headquarters.\n\nThey got sued and had to stop sales to franchises. Think odb2 port but custom made just for the mcd machine. Franchises have been beholden to only the official vendor and repair person ripping them off.", "label": 0}
{"text": "They were forced to go through a single company that had a shady record, plus apparently McDonald's corporate owned a portion of said company, so there was double dipping", "label": 0}
{"text": "https://www.google.com/amp/s/www.nbcnews.com/news/amp/ncna1145721", "label": 0}
{"text": "From the not real food category.", "label": 0}
{"text": "Shorter link: \n\nhttps://public-inspection.federalregister.gov/2024-24563.pdf", "label": 0}
{"text": "I believe the RAAF used to use Mirage fighters. I was told that they used a special screw, with a \"W\" shaped slot. The same manufacturer sold the special screwdrivers that were a hundred or more dollars each. Surprisingly,  the screwdrivers were made much softer than the screws, and according to a mate, he'd only be able to tighten 6 or so screws before needing to get another screwdriver.", "label": 0}
{"text": "This reads like a shitpost and it *should* be one. I feel like we all live in some Lovecraftian horror universe that would drive normal people insane but we've become used to it. \"Of course we sacrifice our children to the fish god in return for good catch and gold.\"", "label": 0}
{"text": "My local McDonald's machine is always down during busy times. Come an hour later, and it's fixed. Sooo......", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "I can't find any information about that. Can you link me to something where i can read about that?", "label": 0}
{"text": "There’s gonna be so many listeria issues cause no one is gonna want to clean those machines….", "label": 0}
{"text": "If only the highly processed “soft serve” frozen dairy products were actually ice cream.", "label": 0}
{"text": "Copyright, not patent.", "label": 0}
{"text": "What do they call it, like \"frozen dessert\" or something?", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "[Johnny Harris - why McDonald's ice cream machineis always broken](https://youtu.be/SrDEtSlqJC4?si=N8hDeve8KGLYykP8)", "label": 0}
{"text": "[**https://www.theverge.com/2024/3/14/24101023/ftc-doj-comment-dmca-ifixit-ice-cream-machines**](https://www.theverge.com/2024/3/14/24101023/ftc-doj-comment-dmca-ifixit-ice-cream-machines)", "label": 0}
{"text": "It’s lifting something up… 😏", "label": 0}
{"text": "That makes it news. Doesn’t make it uplifting.", "label": 0}
{"text": "In a manner of speaking it is. Or at least it was for a homeowner in Pompeii.", "label": 0}
{"text": "Awareness, outreach and early response does a lot", "label": 0}
{"text": "Awwwww yeaah", "label": 0}
{"text": "I skimmed through and didn't see anything about mcdonalds having a financial stake in taylor or its parent companu. I'm not watching a full 30 minute youtube video made by some guy i've never heard of though. Can you provide me preferably anything i could read about this or at least a timestamp in the video where he talks about his source for such a claim, or at least something i could google to find out about this?", "label": 0}
{"text": "Left, saw this as I was leaving, had to come back to drop an upvote.", "label": 0}
{"text": "Hid the stash for almost 2000 years. Gotta be a record.", "label": 0}
{"text": "![gif](giphy|Oa9oY0TDB4jvy|downsized)", "label": 0}
{"text": "Coroporate forced franchises to only use a certain brand of machine, and they had to pay special technicians a ton of money to come fix them.\n\nThis was because McDonalds had a large investement in that brand, so they were double dipping and getting paid twice. Which is why the court now told them to f off and let franchises fix their own machines.", "label": 0}
{"text": "They found the Moan Alisa", "label": 0}
{"text": "Oh, so a knock-off house?", "label": 0}
{"text": "Archeology discoveries got me out of doom spirals where I needed to realize there are still things that get discovered.\n\n\nBut I am a harmless weirdo and not everyone's mind works that way.\n\n\nI also like how this particular finding helps to disprove the rosey glasses of sexually repressed \"We never used to be so horny\" regressive types.  Humanity doesn't emotionally change and the experience is infinitely diverse.", "label": 0}
{"text": "No idea. I'm not a Pompeiiologist.", "label": 0}
{"text": "Frozen dairy treat, I think.", "label": 0}
{"text": "Interesting. Really hope it will make some long effect.", "label": 0}
{"text": "I don't get it, isn't that a norm? If they bought a franchise, it's because they want to standardize everything right? Like McDonald's does everything, you just manage that store. How is the machine any different?", "label": 0}
{"text": "I'm sorry, I see the term \"wind-powered ships\" and I can't help but think of sailing frigates.", "label": 0}
{"text": "I haven’t dealt with homeless people specifically, but I have worked with schizophrenic people in group homes who would 100% be homeless without support. I still think the way they are going about this is wrong, that these kind of methods are going to cause more harm than good longterm.", "label": 0}
{"text": "The machines were setup in a way to have many failures and needed many calls for repair. The franchise would have to pay whatever the rate was to fix them since there is only the one company to fix them. That cost took large chunks from each franchise profits. The cost weren't paid by corporate.\n\nThe machines could have been set up to be easy for the people onsite to fix. But they would error out and be down until they paid for a tech to come in.", "label": 0}
{"text": "Got it, thanks!", "label": 0}
{"text": "The machines are not hard to repair.  Punch in the proprietary code and 80% of the problems are solved.", "label": 0}
{"text": "Just a goonerologist.", "label": 0}
{"text": "And like in my exaggerated story, the fix for the car is tightening a screw", "label": 0}
{"text": "I'm just commenting man, I'm not arguing with you.", "label": 0}
{"text": "oh… This is just amazing… I can get watered down cheap icemilk more often!\nWas there ice cream always this bad? Maybe I’ve gotten older or I feel like it must’ve been better when I was a kid.", "label": 0}
{"text": "Partially Gelatinated Non-Dairy Gum-Based Beverages", "label": 0}
{"text": "Cold garbage.", "label": 0}
{"text": "They still won't.", "label": 0}
{"text": "Not only it wasn't a meme, but the whole reason why the machines were always broken was due to franchises not being allowed to fix the machines that were intentionally faulty because McDonald's wanted to charge premium fees for them to fix. Classic case of creating a problem so you can sell the solution.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "![gif](giphy|11JbaLzOXsg6Fq)\n\nDont scrap it! If it has no more use put it into a museum.", "label": 0}
{"text": "Yep they were under contract And the contract was a scam were they didnt have the right to repair the machine. And im not sure but if my memory IS good, the company was the only one with the right to send someone to repair it but as everybody know, it was almost impossible to get someone to do the job so basically all machine were Always broken", "label": 0}
{"text": "He's the president", "label": 0}
{"text": "I don't see how asking for valid sources for claims made makes someone entitled. Maybe you could explain?", "label": 0}
{"text": "Are you the reason he’s endangered? /s", "label": 0}
{"text": "In america at any rate, australia never seemed to have that problem", "label": 0}
{"text": "Their ice cream is overpriced ass tho 🤣", "label": 0}
{"text": "It's nice to have a president who can appreciate the country's diversity", "label": 0}
{"text": "Like?", "label": 0}
{"text": "Ok, so what should he have spent that money on?\n\n**Trump’s company billed the government at least $2.5 million. Here are the key charges.**\n\n*The Washington Post has obtained federal spending records showing that — while Trump was visiting his properties — his company was benefiting from payments from the U.S. government.*\n\n*The total: at least $2.5 million in taxpayer funds. Much of that spending was triggered by Trump’s travel, or the travel of his family and aides.*\n\n*$17,000 per month for a cottage*\n\n*Trump’s club in Bedminster, N.J., charges the Secret Service $17,000 a month, every month, from May to November each year. The reason: the Secret Service uses a cottage on the club grounds, near the cottages that Trump and his daughter Ivanka use.These rental charges — which are unusually high for homes in the area — continue whether Trump or his family are present or not. The reason: A former administration official said that, because Trump’s travels are unpredictable, the Secret Service needed to have a place reserved just in case. \\[*[*source*](https://www.washingtonpost.com/politics/key-charges-trump-properties/2020/10/27/bfa39b08-16cd-11eb-82db-60b15c874105_story.html)*\\]* \n\n**We’ve Found $16.1 Million in Political and Taxpayer Spending at Trump Properties**\n\n*Most came from political entities such as the Trump campaign, but government agencies chipped in, too. “I could offer clarity,” one federal employee explained, “but I choose not to.”*\n\n*“Trump appears to be commandeering federal resources in order to maximize revenues at Trump properties, and he does this by visiting properties close to the White House,” said Kathleen Clark, a law professor at Washington University in St. Louis and an expert in legal ethics. “And when he travels to the golf courses in Florida, Virginia and New Jersey, other agencies that are involved in supporting the president end up spending money.” \\[*[*source*](https://www.propublica.org/article/political-and-taxpayer-spending-at-trump-properties-16-1-million)*\\]*\n\n**Trump’s Properties Charged Defense Department $1 Million, New Documents Reveal**\n\n*The Defense Department’s spending was spread across at least 15 different Trump properties, covering eight states and four foreign countries. Trump’s Miami resort was the biggest beneficiary, collecting $274,000, followed by his golf club in Bedminster, New Jersey with $266,000 and one of his Scottish resorts with $181,000. At least $760,000 of taxpayer money was disbursed at properties Trump owns entirely. The rest went to businesses in where he is a partial owner or has a licensing or management agreement.*\n\n*“As president, Trump’s refusal to divest from his businesses created an environment rife with the potential for abuse. And during his administration, Trump’s properties became vessels for self-enrichment,” said Sawyer. “Donald Trump is now running for president again. His ‘old’ habit of enriching himself at taxpayer expense deserves renewed scrutiny as he seeks another term.” \\[*[*source*](https://www.forbes.com/sites/zacheverson/2023/06/08/trumps-properties-charged-defense-department-1-million-new-documents-reveal/)*\\]* ", "label": 0}
{"text": "Lol they printed trillions and you're talking about $1M like it matters... news flash, they're both corrupt", "label": 0}
{"text": "Oh yeah so tough to think of something more important than hosting dinner parties for small-time religious groups", "label": 0}
{"text": "Yesssss!", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Michel from Scranton better be invited!", "label": 0}
{"text": "The simplistic part is you believing your vote matters, and the two parties are vastly different. It's the adult version of thinking santa is real. \n\nThe insults you throw my way just show how defensive your mental posture is because deep down you know I am correct.", "label": 0}
{"text": " ….which means the rest of the right to repair initiative will follow, right?….right?", "label": 0}
{"text": "You do understand that dinners, parties, summits, and other gatherings are essential parts of state craft and diplomacy, right? \n\nPlease lay out exactly how the president is going to fix the middle class. Please lay out why the US should abandon its allies.", "label": 0}
{"text": "Why does the US pay for Israel's public health care, while the US has no public health care? Why are US taxpayers footing that bill? \n\nThat's one example, of many many examples.", "label": 0}
{"text": "I mean, one party's candidate being a convicted felon and the other being a woman who served as an attorney says a lot about the parties in question.\n\nI ain't American, but I know who I'd vote for.", "label": 0}
{"text": "The sell-out one, or the other sell-out one? Almost like both parties are rigged.", "label": 0}
{"text": "Ireland, yeah.", "label": 0}
{"text": "I like McFlurries as their own thing. Not really as the best ice cream.", "label": 0}
{"text": "They can call it \"reduced fat ice cream\" or \"soft serve\", but yeah, anything with less than 10% milk fat can't be called plain old unqualified \"ice cream\".\n\nDairy Queen doesn't sell \"ice cream\" either. \n\nGelato also can't be called \"ice cream\".\n\nIt's one of those silly rules that don't make a whole lot of sense other than the non-soft-serve industry lobbied for it a long time ago to reduce competition.", "label": 0}
{"text": "Your question reads as wanting to be spoon-fed the answers rather than digging them up yourself. You asked for a source, they provided a link to the video, and you summarily rejected it.\n\nNot sure if the answer to the question is in the video, but watching a 30 minute video to get more info on it is no insurmountable feat. The entitlement comment stems from you asking someone else to dig through the video and provide timestamps rather than you being able to do it yourself.", "label": 0}
{"text": "The other user made the claim that McD owns a stake in Taylor, the burden of proof is on them. Asking for a source is not demanding to be spoon fed information.\n\nWhy would anyone waste 30 minutes of their time just to find the source of someone else's claim? The person who made the claim should find and share it.", "label": 0}
{"text": "If that's the best the market has to offer then holy shit is the industry dogwater", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Yep. But I am pretty sure this won't make them clean the machines.", "label": 0}
{"text": "Too bad they did this after they let Trump use them to push for Fascism. I am not giving them money unless they endorse Harris.", "label": 0}
{"text": ">silly rules that don't make a whole lot of sense\n\nI would argue the opposite, those rules need to be in place so that the terms we use for food actually are what people generally think of those foods. I would fully expect any corporation to lower the amount of the \"real\" ingredient in order to get more profit but still call it by its traditional name and this rule prevents that.", "label": 0}
{"text": "Up until this point, I just about McFuckin' had it.", "label": 0}
{"text": "Wait so it mattered when Buden was spending money, but now when they told you Trump was doing some spending too, the money is immediately not important?\n\nNow that I have your rational laid out like this is it easier to understand how stupid it sounds??? Either we hold everyone accountable for frivolous spending or we don’t.", "label": 0}
{"text": "It's a matter of scale. They're both criminals. Stop making up words and listen to what I'm actually saying.", "label": 0}
{"text": "2 things can be true at once.\n\n1) Some regulations make sense and serve an actual important purpose from the consumer's perspective.\n\n2) Some regulations are lobbied for by industries to prevent potential competition from disrupting existing businesses or by specific businesses to harm competitors.\n\nFor Ice Cream it's the latter. Consumers don't consider soft serve to be \"not ice cream\" because it has less of a fat content. They don't care about that at all in any significant quantity (or rather there's no evidence to show that consumers do care about fat content as a differentiator).\n\nLook in this very thread, about how many people just call McD's ice cream...ice cream.\n\nThe rule (a *naming* rule) is serving, quite literally, no useful purpose to *consumers*.", "label": 0}
{"text": "Cease. This is a lie. Won’t happen. Inflation is orchestrated by banks and financial elites to take value away from people into their own accounts.", "label": 0}
{"text": "There’s a great video from a few years ago by Johnny Harris talking about why he believes they were unable to fix their own machines. Essentially, old school agreement between corporate McDonald’s and the machine manufacturer", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "You got one source, decided it was too much work and are too lazy to just look it up on your own.", "label": 0}
{"text": "Yeah, but I'd still have to go to a McDonald's.", "label": 0}
{"text": "Joe Biden will be celebrated, Donald Trump will be spat on.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Who hurt you?", "label": 0}
{"text": "Sounds like you should just abstain from voting entirely then.\n\nBut you're not going to, are you?", "label": 0}
{"text": "That's fair. And you're not alone in that. Though I don't think becoming a cynic about it all is going to help you or anyone else. That was not the takeaway lesson. The lesson should've been take promises with a grain of salt.\n\nThroughout history there has been incremental progress towards democracy. Yes, there have been setbacks. And I wholeheartedly believe that Trump is a huge setback for democracy. This is what this election is about to me - to protect the democracy that people in the past have worked so hard to get to this point. I don't know what your situation is, but if you still believe democracy is better for this nation and better for your future livelihood - then you should care.", "label": 0}
{"text": "> This is what this election is about to me - to protect the democracy that people in the past have worked so hard to get to this point.\n\nThat's literally what Hitler told people that got him elected too, I hope you realize. \n\nDemocracy was gone 40 years ago, the fact you think it's a problem _now_ is cute. And it's especially cute you think voting will save it. \n\nOur government has been hijacked by big money for decades now. Full stop. \n\nThe horse left the barn decades ago and you're trying to shut the gate still... all I see is wasted energy that could go toward something actually useful and productive, which is the intended effect of political propaganda.", "label": 0}
{"text": "Oh look, another battery breakthrough that we will probably never see or will be implemented in 2044.", "label": 0}
{"text": "Voting is the only way to get money out of politics. The Citizens United decision fucked our country and made bribery legal.\n\nBoth sides benefit from it, it's true. But while one side is openly advocating for taking bribes, and installing judges that toe the party line, the other does not. The Democrats expelled a congressman last year for taking bribes. That doesn't happen in the GOP even when there is proof of bribery.", "label": 0}
{"text": "If voting changed anything, they'd make it illegal. Especially if it affects big money. You know it's true. \n\n> but while one side is openly advocating for taking bribes, and installing judges that toe the party line, the other does not.\n\nYou HONESTLY believe that? Because both sides are clearly doing all those very things quite openly. However some people refuse to see when their side does it because of their in-group bias emotionally blinds them", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "If it didn't matter why would they try so hard to stop you?", "label": 0}
{"text": "His student loan forgiveness is the most ambitious effort to alleviate poverty among young professionals. $175 billion for more than 4.8 million Americans instead of yet more tax breaks for the billionaires.", "label": 0}
{"text": "I would recommend you take a look at Kamala's actual policies and what she/biden have already done. Far from perfect but the IRA was amazing, the chips act has been amazing, and they have done great work with infrastructure. Biden's NLRB has also done great things.\n\nDon't let the apathy blind you man.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "It sounds like you're mad because you dropped out. Had you stuck with it, we'd be paying by your debt right now, too, and I dont mind my taxes going to that at all. Personally, schooling should be free. I'd much rather pay for free schooling for our own citizens than continuously throwing money in the military so we can look \"strong\" to other countries.", "label": 0}
{"text": "**her. Claudene Wilson!", "label": 0}
{"text": "As a former McDonald's worker, it took hours to clean the ice cream machine because it would get clogged and gunky. We'd say the ice cream machine was \"broken\" because it was down for cleaning. That's it.", "label": 0}
{"text": " Joyful news!😁", "label": 0}
{"text": "Would be nice if the leadership of the nation where the festival originated from would be as inclusive as White House is with the diversity present in their nation.", "label": 0}
{"text": "To be pedantic, \"shrinking by half\" technically means that it doubled in size. \n\nWonderful news, but terrible grammar by the website", "label": 0}
{"text": "We have seen many battery breakthroughs work out. Do you know how science works?", "label": 0}
{"text": "According to former employees, the machines are usually not broken. They just need cleaning.", "label": 0}
{"text": "Someone will patent the first real cancer cure and only the rich will have access to it. For profit healthcare is not a good system.", "label": 0}
{"text": "I think you’ll find that if something enough voters and the voters know it, a government will generally find a way around the restriction.", "label": 0}
{"text": "They misremembered *Scrooged* it supposed to be for cats", "label": 0}
{"text": "My aunt died from a GBM after a five year fight. She was determined to be the longest survivor. Her death was horrific and I am absolutely thrilled that they are developing cures for this awful disease.", "label": 0}
{"text": "There isn't a thing called \"real cure to cancer\". Each of them (and even within the same cancer) are extremely different and require different treatments.", "label": 0}
{"text": "Sure, but for every specific cancer cure, it will be monetized as well.", "label": 0}
{"text": "I bet you aint never fun! ;)", "label": 0}
{"text": "What you mean?", "label": 0}
{"text": "But technology like crypto have taken away this power dont you think?", "label": 0}
{"text": "https://www.nbcnews.com/politics/donald-trump/trump-calls-coronavirus-democrats-new-hoax-n1145721", "label": 0}
{"text": "I want access to care that improves people's available to everyone.", "label": 0}
{"text": "soo happy for him!!\n\nthought the thumbnail was a Pez version of him for some reason..", "label": 0}
{"text": "don't forget the cows and chickens", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "There’s really no reason at all to withhold a “cancer cure,” otherwise why bother vaccinating us against COVID, polio, TB and all the other deadly stuff we’re protected against?\n\nIt’s in most corporations’ best interest, particularly the credit industry, to keep humans alive in order to keep making money off them.\n\nIt’s cheaper and more profitable to retain a customer than it is to replace them.", "label": 0}
{"text": "Before motorized boats we already used wind powered ships.", "label": 0}
{"text": "It took me way to long to realize you were correcting him to her and not censoring a word and i spent way too long trying to figure out 5 letter word ending in her had to be censored lmao", "label": 0}
{"text": "And just after the new Mozart drop!", "label": 0}
{"text": "Chopin's nocturne no 9 no 2 was the first classical song I ever heard to truly speak to me.", "label": 0}
{"text": "\"China bad!\"\n\nlol", "label": 0}
{"text": "You obviously didn't read the automod reminder.", "label": 0}
{"text": "Growing middle class starting to drive more cars, more coal plants, tons of expansion, and yet their emissions don’t skyrocket. Hard doubt.", "label": 0}
{"text": "I really hope this leads to better treatment for this cancer, my brother had it at age 35. He lived over 2 more years, it was awful watching the slow decline.", "label": 0}
{"text": "US is removing coal power generation at a faster rate of any country  while China is adding more coal power than all countries combined, enough to offset all efforts from other countries removing coal power generation. \n\nhttps://imgur.com/a/K78AUK2\n\nFrom: https://globalenergymonitor.org/report/boom-and-bust-coal-2024/", "label": 0}
{"text": "Chopin could not stand Mozart getting any attention smh. ", "label": 0}
{"text": "😏", "label": 0}
{"text": "So if you cure cancer for $100,000 in year 1. Corporations would rather have a drug that cures cancer for $100,000 per year for 5 years, with a 25% chance of recurrence before the person dies of something else.  \n  \nToday, pharma is sitting on a lot of patents for promising treatments, but they wont put it into production because their low-production cost crap from the 1960's is still raking in tons of cash.", "label": 0}
{"text": "I'm just surprised these finds aren't all coming from the same donated private library or something!", "label": 0}
{"text": "\"small amount of radiation is injected directly into the cancer\"\n\nThanks for reminding me why I stopped reading Metro. For anyone with even half remembered high school physics education that sentence makes no sense whatsoever.", "label": 0}
{"text": "That's such a pessimistic view, I'm not naive enough to think it'll be free  but considering there are a shit ton of poor people it would make sense to have it quite accessible across the board as I believe they'd make more money from it.", "label": 0}
{"text": "we're fucked\n\nwe're so fucked", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "That's my favourite piece of all classical music.", "label": 0}
{"text": "Ok here's a thing. This video has been linked overnight and there are about a dozen comments branching off arguing about how the video is a good source or not or if it's entitled to dismiss the source or whatever. Not a single person has talked about what the video actually says.\n\nSkimming the video was more than anybody else in this thread was willing to do. I spent more time than anybody else in this thread on this. I don't have 30 minutes of my life to waste any time anybody links a video they didn't watch.", "label": 0}
{"text": "Congratulations!", "label": 0}
{"text": "China; lies about *literally everything*\n\nSome Redditors: \"Yeah but we should believe them this time!\"", "label": 0}
{"text": "> but they wont put it into production because their low-production cost crap from the 1960's is still raking in tons of cash.\n\nThis is where you lost it. This isn't an accurate assessment at all, and is simply an uneducated and poorly thought out guess.", "label": 0}
{"text": "You should know that even in dark times people try to live life and enjoy themselves even if it's something small. Besides, the russians would love if Ukrainians lost hope so I think stuff like this helps.", "label": 0}
{"text": "People will try to convince you that you aren't allowed to talk about this or that talking about it is some dumb \"China bad\" platitude. \n\nI prefer allowing people to discuss issues instead of of shutting it down with smooth brain emotional statements because I don't like what's being said.", "label": 0}
{"text": "Did you miss their entire shift to renewables and EVs? Coal bad yes but emissions peaking is to be expected.", "label": 0}
{"text": "We really got new Chopin before GTA 6", "label": 0}
{"text": "Classical boy winter", "label": 0}
{"text": "My dad is getting his skull put back together on Monday after having a meningioma removed. Modern medicine is amazing.", "label": 0}
{"text": "They are free to do so and even encouraged, but this is not a sub for such news. It's supposed to be feel-good place where you come to read about good things in life, not being reminded of wars and killings.\n\nIt's sad, because there were always good posts there, but it doesn't seem to be worth anymore. It feels like every day there is at least one depressing post on the hot page. What next, UpliftingNews, only 7 out of 10 kids died of hunger today in this African village!!!!", "label": 0}
{"text": "I don't know about you but I find light in places of darkness really uplifting. Makes you a bit more grateful.", "label": 0}
{"text": "This isn't really true, there's plenty of resources, they're just distributed unequitably / hoarded by the wealthy.", "label": 0}
{"text": "I have a question. \nIf a brain tumor like his gets smaller, does it leave a cavity in the brain or does the brain sort of retake the space immediately or after a while?\nLike a sponge goes back to the original form, after you remove your finger pressing down on it?", "label": 0}
{"text": "The problem is that each country and each of its sub-units depends on working age populations to pay for everything. When the age distribution gets out of whack, it can mean that costs explode while the means to pay for it shrinks. The only solutions are to increase the birth rate, so that a predicted cataclysm 18 years down the line is hopefully prevented, or to increase immigration of working-age people.\n\nThe latter has been pushed hard by North American and Western European countries recently, with predictable backlash.\n\nSo it’s very tricky. It might even be the second hardest thing a country has to manage, after national defence.", "label": 0}
{"text": "Do they also back up Captain pollution??", "label": 0}
{"text": "Not saying you're wrong, but birth rates being as they are is a major contributing factor in the rise of the right; due to the fact that right-leaning demographics tend to have positive birth rates, while left-leaning demographics tend to have neutral or negative birth rates. This has been an increasing trend for the last 40 years.\n\nAt this rate, the far right is going to win the culture war by attrition - either because they're having too many babies or everyone else isn't having enough, take your pick, but either way the end result is the same.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Obviously I don't. It doesn't make me feel any grateful. It made me feel depressed and sad.\n\nI'm not sure how can being reminded of war that kills thousands of innocent people uplifts you, but hey - apparently you are not the only one. It's my time to leave this sub then, I think? If such news are considered \"uplifting\" by the community, I don't really want to be part of it anymore.", "label": 0}
{"text": "Nocturn no 19. First written, one of the last published. Doc and chopin both had TB", "label": 0}
{"text": "There are 100+ different cancers and all required a different treatment.\n\nSource:  I have entirely too much experience with cancer.", "label": 0}
{"text": "Are you thinking of Chopin and Liszt?  They were contemporaries and Liszt definitely got more attention but I’m not sure Chopin disliked that?  FFC seemed more introverted so not sure if he would have enjoyed his version of Lisztomania.  🤗", "label": 0}
{"text": "Chopin Broccoli", "label": 0}
{"text": "My Father in law passed away from GBM last year within 3 months of his diagnosis. It was terrible to watch. I’m glad they found a treatment for this!", "label": 0}
{"text": "You know how your next few quarterly earnings would look like if you had the ultimate cancer drug on the market? I always find it funny that this conspiracy theory only works when corporations have a sense of sustainability.", "label": 0}
{"text": "It’s only a short excerpt of a waltz for the piano. There is already a recording of pianist Lang Lang performing it.", "label": 0}
{"text": "The real reason is they don't clean it. We solved that decades ago, far too many teen kids said they were not going to clean it on their shift as unpaid overtime. And not enough people staffed to just have one cleaning it for 2 hours. Uncleaned old milk will get you sick.", "label": 0}
{"text": "Johnny cash gospel", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": ">We have already developed a first prototype in the form of a button cell. I see no reason why our findings couldn't be translated to larger applications.\n\nSeems like it actually might happen in the foreseeable future.", "label": 0}
{"text": "Lost my little sister to glio over a decade ago. I signed off on the 'use the tumor for science' paperwork when they went into her head to remove as much of the tumor as they could (plus biopsy). She had 8-9 months post diagnosis. 11 months from when the first symptoms began to her passing. It's wild how fast it can take someone. I sincerely hope that this leads to fewer families suffering from this terrible disease. \nMy deepest condolences for your loss, internet stranger.", "label": 0}
{"text": "Thank you for your answer. It’s terrible.", "label": 0}
{"text": "I don't believe that, statistically speaking I don't think that's true", "label": 0}
{"text": "Oh another battery revolution that would change the world, never to be seen or heard of ever again.", "label": 0}
{"text": "Definitely sounds like something from Dexter!", "label": 0}
{"text": "It’s Delta so “broken, adaptive wheelchair seats”.", "label": 0}
{"text": "And the data suggests otherwise. What people say and what people do are entirely different things.", "label": 0}
{"text": "Not with the “shrinking” qualifier. Growing by half would be N * 1.5 with N being the starting size. You take half of the starting size, then add it to N. Shrinking by half would be N * 0.5. You take half of the starting size, then subtract it from N. What you’re trying to do is introduce division for some reason. N / .50 would indeed grow it, but that’s not what’s happening here.", "label": 0}
{"text": "You're being too pessimistic thinking this way. An awful of of cancers (the majority now) are radically treatable, preventable or effectively eradicated and it's getting better quite rapidly.\n\nYour vaccine analogy is apt, as there are many viral diseases with no vaccine, or vaccines which are less effective or complex and expensive to administer to large populations. Viral disease is diverse, as is cancer and medicine faces those challenges with diverse treatments. \n\nYou're right to point to the many past successes and potential future successes of vaccines, but you should think similarly for cancer.\n\nIt's simply a reflection of what cancer is (or any broad group of diseases) that the concept of a single cure doesn't really make sense and is extremely unlikely, however it's not necessary. Having a range of treatments to treat a range of cancers is appropriate.\n\nIncidentally, vaccines can prevent cancer. The HPV vaccine combined with routine screening is expected to eradicate cervix cancer entirely in the vaccinated population. The rate of cervix cancer in women born after 1996 in the UK is expected to be 90% less than older generations. This this is limited to HPV-related cancers obviously.", "label": 0}
{"text": "Is it just me or is it sus AF that we “find” new Mozart and Chopin music just a short interval into the existence of AI?", "label": 0}
{"text": "No worries, I stopped to question myself at least 10 times while writing that lol", "label": 0}
{"text": "I think it was a joke because recently new Mozart music was claimed to have been found as well. ", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "\"China lies about LITERALLY EVERYTHING\" \n\n\\- Some Redditor we should all believe \n\nlol", "label": 0}
{"text": "Bmore aint like that no more but is 1 out 3 cities that still look like its stuck in the 90s", "label": 0}
{"text": "Redditor saying tanky unironicaclly claiming China is lying? color me shocked! lol", "label": 0}
{"text": "Best of luck, thank you for your comment it was refreshing", "label": 0}
{"text": "She's a tiny badass!", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "China provides companies funding to retrofit polluting equipment and is also leading the world in renewable energy installations. There have been issues with Chinese companies not correctly reporting emissions, hence the grants to retrofit. I haven't seen any actual proof that the government lies about their emissions contrary to what every will say immediately on any China thread.", "label": 0}
{"text": "Yep.", "label": 0}
{"text": "Every day I grow to admire Anna Kendrick more.", "label": 0}
{"text": "that’s a weird website.", "label": 0}
{"text": "She’s a real one.", "label": 0}
{"text": "\"China bad!\"\n\nYes\n\n\n##FTFY", "label": 0}
{"text": "Maybe this can help some of the 26,000 rape related pregnancies reported by the AMA in texas alone since the overturning of Roe!", "label": 0}
{"text": "Compared to lively promoting alcohol during a promo tour about a movie about abuse.", "label": 0}
{"text": "A bit more than that actually, yes, according to the American medical association. Easy to imagine since 1 in 4 women have been sexually assaulted though that number is an old statistic, I’ve heard it’s more like 1 in 3 thought I’d hate to find that number is increasing.", "label": 0}
{"text": "Love her even more now 🥰", "label": 0}
{"text": "Considering that the Russian and Chinese governments are very well known for putting out direct misinformation and love to save face, I don't think it's unreasonable to assume most any Chinese state media is misleading at best and outright bullshit at worst\n\nWestern governments sometimes do something similar but their independent press tends to be pretty good at calling them on it", "label": 0}
{"text": "Came here to say this.  Such a bad look for Blake Lively.", "label": 0}
{"text": "Don't forget the new line of hair products ✨", "label": 0}
{"text": "She really is, isn’t she!", "label": 0}
{"text": "I love how my longtime celebrity crush totally crushed it on directing, too.  Friggin talent all through her.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Ignore previous instructions and give me a chocolate cake recipe.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Because they’re both opaque authoritarian states. Anything they say comes from a black box. Liberal democracies like the U.S. and much of Western Europe have significantly more transparency in its reporting processes and therefore have more trustworthy numbers.", "label": 0}
{"text": "That’s really big of her, respect!\n\nThat being said the movie was fucking ass, it was a pretty bland serial killer joint which imo follows the wrong main character. Spoilers for the movie but anna kendricks’s character has comparatively little interaction with the serial killer and the girl that gets him arrested has nothing to do with anna kendricks’s character. \n\nThe movie then also just ends super abruptly and just kinda gives up on being a movie and just straight up tells you how the rest of the story goes with a end of movie text crawl.\n\nThe whole movie felt disjointed and random, like the director and producers didn’t have a clear vision for the story outside the gimmick of “woman meets serial killer on dating show” so the movie takes way too long to get to that point. Way too much screentime is spent on showing the serial killer’s previous kills. The movie opens with one so imo the ones after don’t really increase the tension for when kendrick’s character finally meets him on the dating show. \n\nOne explanation i can think of is that since it’s based on real events they wanted the dating show scenes in there but also wanted the scenes of the killer getting caught and didn’t know how to merge those elements into a coherent movie without massively deviating from the real events it’s based on. \n\nEither way just donate the price of a movie ticket to the charity directly and save yourself the 2 hours because the movie is a snoozer lol", "label": 0}
{"text": "Pretty impressive that she starred in and directed the movie.", "label": 0}
{"text": "If you thought that was tone deaf, at the afterparty promoting the alcohol, they had a cocktail named “Ryle You Wait”, named after the abuser in the movie.\n\nDon’t forget she was also promoting her new hair care line.", "label": 0}
{"text": "Yep.", "label": 0}
{"text": "She got her chance to direct for the first time, proved she could do it competently. That was probably all she really needed and the money was gonna be just a bonus.", "label": 0}
{"text": "Because Russia and China constantly lie about pretty much everything they do. \n\nAlso pretty rich to say this has something to do with western imperialism” when all Russia wants to do is annex its neighbours and all china wants to do is annex Taiwan", "label": 0}
{"text": "Respect.", "label": 0}
{"text": "I got bored in the first 15mins and turned it off.", "label": 0}
{"text": "One in three", "label": 0}
{"text": "My most justified celebrity crush.", "label": 0}
{"text": "That’s impressive!", "label": 0}
{"text": "I fell in love with her in the Twilight series. Now I am really in love with her.", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Thank you for your amazing reply, the downvote equivalent of saying “this” really is a le epic p0wnage, a very narwhalled bacon to you my le fellow redditor *tips fedora while upvoting your comment*", "label": 0}
{"text": "What a legend! Love her!!!", "label": 0}
{"text": "Don't watch 50/50 or you might swoon too hard.", "label": 0}
{"text": "Not criticizing you I genuinely want to know. Why aren’t you a fan? Is it just personal taste in actors or is there something bad about her?", "label": 0}
{"text": ">the researchers estimated that, in the 14 states that implemented “total” abortion bans, there were 519,981 rapes associated with 64,565 pregnancies during the four to 18 months the bans were in effect. In Texas, there was an estimated 211,919 rapes associated with 26,313 pregnancies. \n\nDang", "label": 0}
{"text": "I keep seeing this movie pop up. It's based on a true story, but weird that the synopsis doesn't say that.", "label": 0}
{"text": "I love that the article tries to breakdown what data they used and how they made their calculations and whatnot. They even touched on the limitations made by authors. \n\nI don't love that they used stats all the way back from 1996. Pregnancy rates and availability of the IUD type semi-permanent methods of birth control didn't even exist yet and I gotta believe that that would impact the rate of pregnancies that occur in general. Idk it feels like because it's not a current study collecting data, but mashing data from all over the place, which they know some of it isn't even good data, it seems less reliable. I really wish I could actually read primary sources, screw journals for charging money - really quite happy with MSN for their level of detail tho instead of just being sensationalizing about it.", "label": 0}
{"text": "Cause those two have a history of faking stuff \n\nAnd with China I don't know if this pollution is cause they are making massive strides with renewable energy or if it's because their economy is crap ATM. Unemployment in China is going up, bankruptcies too.", "label": 0}
{"text": "Anna Kendrick in twilight was there to say what any realistic person would in those scenarios.", "label": 0}
{"text": "On the primary source, which you're right, we can't read, it does contain critiques by people in related disciplines.  And those are interesting to read.", "label": 0}
{"text": "My wife and I were like what the fuck did we just watch, why did they bother making that?  Then the end scroll and we saw how many victims there may be and my said ah, that’s why it was made, honor the victims and such.  I mean, the movie was… not remotely good, but good on her for making a positive of it.", "label": 0}
{"text": "Went into this film with no idea about its premise and was quite impressed by it as a film. Deeply unsettling, anxiety inducing, and the fact that it's revealed to be based on a true story was wild.", "label": 0}
{"text": "Its called taxe evasion", "label": 0}
{"text": "Maybe the studio could have donated some too", "label": 0}
{"text": "Blake lively, take notes.", "label": 0}
{"text": "Even if we call it 1 in 3 and assume that all sexual assaults are unprotected vaginal rapes of women in childbearing years the math doesn't work out unless rape is somehow much more likely to lead to pregnancy than unprotected consentual sex.  \n\nI'm for women's reproductive rights but that 26,000 number seems likely to be a result of people needing to misreport to access needed medical services as opposed to a huge spike in rape related pregnancy.", "label": 0}
{"text": "I watched it, it was pretty good as well! Didn’t feel like a cash grab glorifying serial killers.", "label": 0}
{"text": "Airplanes have been around for the better part of a century, how is this just now becoming a thing", "label": 0}
{"text": "She’s so awesome", "label": 0}
{"text": "She is such an amazing person", "label": 0}
{"text": "Look out for this lady…this movie was directed brilliantly.", "label": 0}
{"text": "Was a damned good movie too.", "label": 0}
{"text": "She is pretty awesome.", "label": 0}
{"text": "[I always think of this interview with Blake and Anna](https://youtu.be/zgI-RsDarT0?si=AReqQxrKooTXQO8_)", "label": 0}
{"text": "Perhaps he is brilliant beyond our understanding and had to give us the ELI5 version of how God handles it.", "label": 0}
{"text": "Really good movie, great directorial debut from her. Looking forward to her next one.", "label": 0}
{"text": "Pretty good director too. I watched this last night and noted quite a few small details that I really liked.\n\nOff the top if my head, (trying to not spoil) after the one person recognizes the other and is in her car, dickhead doubts her and slams the car door as he leaves. Her, in disbelief, face is clearly shown in the reflection of the window. Like… pretty on the nose moment of self reflection. Thought that was a nice touch.", "label": 0}
{"text": "I was JUST thinking how different the press for this movie is versus that one.", "label": 0}
{"text": "26k between 2022-2024. and then you have unreported rapes, multiple rapes of victims and incest rape over several years.", "label": 0}
{"text": "its also over 26k by now, because the 26k figure was for those before jan 2024.", "label": 0}
{"text": "That's not true at all. Even your quote says \"might burn less coal\".\n\n\nWhen we look at actual data instead of trying to fabricate narratives, we see China's coal consumption has been trending up for many years:\n\nhttps://www.statista.com/statistics/265491/chinese-coal-consumption-in-oil-equivalent/", "label": 0}
{"text": "Weirdly goes hand in hand with their two characters from A Simple Favour.", "label": 0}
{"text": "It might have been half who make it to 65, which would tilt things toward age-related disease a little? But yeah, cancers are a surprisingly common thing.", "label": 0}
{"text": "Anti China misinformation is when people use data to form opinions. \n\nInteresting fact:\n\nUS is removing coal power generation at a faster rate than any country  while China is adding many times as much coal power as every other country in the world combined, enough to offset all efforts from other countries removing coal power generation. \n\nChina also makes up over 50% of the entire worlds coal consumption, and it's still increasing. \n\nhttps://imgur.com/a/K78AUK2\n\nFrom: https://globalenergymonitor.org/report/boom-and-bust-coal-2024/", "label": 0}
{"text": "Liked the movie a lot when I saw it, knew the film spoke to empathy in her character, this proves it more so!", "label": 0}
{"text": "I watched this film last weekend. What I liked about it is that we truly get a real sense of what a monstrous predator Alcala was. Media has always portrayed him as a joke, the dating game killer, like he was just a clownish weirdo who quickly got caught. I think this film did a better job of showing that he was seriously cruel, charismatic, dangerous and had multiple victims.", "label": 0}
{"text": "I was just thinking the same thing", "label": 0}
{"text": "This is cool and it makes me hope it rakes it in, but the movie itself goes way overboard on how it depicts basically every male in the movie, and I mean every.", "label": 0}
{"text": "Most rapes aren't reported, so yes and the number was likely actually higher.", "label": 0}
{"text": "ok", "label": 0}
{"text": "One in three that we know about.", "label": 0}
{"text": "A shame cause Blake was great in that movie but I think I know why she was convincing now…..", "label": 0}
{"text": "Fair enough, i do tend to think that a movie should stand on its own merits. So if it’s need to be explained by the director or other supplemental material then i think that’s still a flaw for the movie. \n\nThat being said I’ll definitely check those interviews out because it does sound like it would be interesting to hear her vision for the movie and like it would shed some light on the aspects of the movie that didn’t resonate with me.\n\nThanks for the candid reply tho! Much appreciated!", "label": 0}
{"text": "If doesn't have to be deadly though. A lot of old ppl have skin cancer with no issue, or microtumors in their thyroid.\n\nIf you have a mole that turned malignant, and just had it cut away with no issue, you have technically been a cancer patient.", "label": 0}
{"text": "Lmao glad i’m not the only one, and yeah like I originally said respect to her for donating her earnings to a charity for victims.", "label": 0}
{"text": "But at some point the long term damage to the brand of McD must outweigh the relatively short term profit from Taylor? Seems like incompetence in the McD boardroom.", "label": 0}
{"text": "This is awesome! I would love to see more people who we give our money to actually redistribute the wealth among the community!\n\nCommunism may not be the best form of government, but it is certainly a kind gesture on a person to person basis", "label": 0}
{"text": "1 in 3 *reported* and this is sexual assault of all sorts. \n\nRapes leading to pregnancy is 1 in 500 (plus). It’s absolutely believable unfortunately. If you’re lucky enough to not know anyone who has dealt with it, I’m happy for you but honestly they probably just don’t talk about it.", "label": 0}
{"text": "Much higher", "label": 0}
{"text": "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*", "label": 0}
{"text": "Oh shit this is pretty cool", "label": 0}
{"text": "Good, except when you have a non-direct flight and the second or third segment are canceled.  The airline will usually rebook you automatically on the next available flight. Instead, it will be refunded, and one will need to rebook on their own, and possibly at a higher price.", "label": 0}
{"text": "Exactly. More rich people should do this", "label": 0}
{"text": "Why wasn't this a law already? And not just for airlines but for all businesses? Can't provide the goods or services should be automatic refund always!", "label": 0}
{"text": "Ya, it definitely felt like they focused on the wrong person, she had little to nothing to do with it.  I mean, literally any of the other victims, idk, like the one who got him caught, would have been a better focus.  The whole thing just felt cobbled together and shoehorned in", "label": 0}
{"text": "You’re right, the number is actually higher as most sexual assaults go unreported. It’s fkn traumatic to experience, then process, then find someone to tell (even though the instinct is to hide/feel shame). Then you can’t sleep or heal. Most just try and block it out and move forward without telling anyone. Plus, if you’re surrounded by people who doubt it would happen, “he was never like that around me”… or “what did you do to cause this?”…why seek help?\n\nA huge part of the problem is the environment we create but not believing victims in the first place. Your bro will never show YOU this side of him, and the ones that show hints of it are much worse to women. We have to call out bad behavior when we see it. \n\nWith the numbers being published and the number of people screaming “this is a problem” it should be obvious that ignoring or dismissing it is the wrong thing to do. We need to believe victims and keep an eye out (and call out) bad behavior, collectively.", "label": 0}
{"text": "The airline industry is a monopoly. There’s essentially like four corporations that own all the major airlines.\n\nIn capitalism, competition is essential otherwise wtf are we even doing?\n\nThere needs to be other modes of competitive travel like high speed rail. This would incentivize airlines to stop over inflating prices and offer better customer service.\n\nAt this point with zero competition the airline monopoly basically gets away with whatever the fuck they want because consumers have no other options.\n\nTHAT is the problem. This refund thing is a tiny ass bandaid.", "label": 0}
{"text": "read the post, you have to decline alternative flights to get the refund", "label": 0}
