{"text": "Trump has come out in favor of mail in amd early ballots you dumb fuck", "label": 1}
{"text": "Is your vote safe if you’re voting Republican in a swing state? You bet-a-Rooney!\nHow about if you vote Democrat? Well, for the good of the country and to keep Trans people from taking over…", "label": 1}
{"text": "Man, you are unable to think. \n\nEverything the other guy said is valid. \n\nIf voting is 100% safe, then there would be no need for articles telling you it is safe.....\n\nIt is just like news articles telling you that the economy is doing well. If it is doing well, then you would know already and wouldn't need an article to tell you. \n\nBut idiots are going to be idiots and unable to actually critically think apparently.", "label": 1}
{"text": "Reddit is full of leftist lazy asses, not representative of the real world", "label": 1}
{"text": "That's the only metric worth considering yeah? The arts have never contributed to GDP? Pretty stupid honestly  you're clearly someone who has a limited understanding, I hope you can educate yourself", "label": 1}
{"text": "Yeah Islamic terrorists are pieces of shit - gasp who knew?! Be tough man. If everyone is out to get you, you'd think you'd learn to hit people in the mouth instead of being a punching bag.", "label": 1}
{"text": "This comment must be so dumb I don't get it.  What do you think you're saying, Donald?", "label": 1}
{"text": "You should probably actually learn about this before commenting something so stupid.", "label": 1}
{"text": "It gets even better\n\nA group guys (small 3rd party repair company), bought a broken Mcdolands ice cream machine to figure out how it worked and learn the codes for it. Even went to far as to build and design a tool to help franchise owners understand error codes and make the repair themselves. \n\nMcDonald’s sent them a cease and desist and banned all franchise stores from using the tool.", "label": 1}
{"text": "You’re so stupid, I don’t even know where to begin to correct you.", "label": 1}
{"text": "What a great use of taxpayer money and of his time. Glad there's not other way more important things going on.", "label": 1}
{"text": "I remember being 15 lol. Get a grip loser", "label": 1}
{"text": "That's not true. One is a huge criminal and one isn't.  Making shit up and posting it on the internet doesn't make it factual.  Lies are still lies. But you do you bro. Clearly you have zero moral computation for expressing lies publicly and loudly.", "label": 1}
{"text": "Pretty sad that you spend all day posting conspiracy theories online then.", "label": 1}
{"text": "They dropped out because they're an idiot. Just look at the things they're saying here.", "label": 1}
{"text": "Better late than never I guess", "label": 1}
{"text": "Oh don't be so sensitive.", "label": 1}
{"text": "Tell me more about the ways you're clueless about free speech.", "label": 1}
{"text": "Are you mental? What a lot of words to say what you denied you were saying in the first sentence. \n\nLet’s just pull one of these apart. Britain didn’t export homophobia. Homophobia exists and is prevalent in countries that have never been touched by Britain colonially, and currently Britain is way ahead of the curve regarding allyship of the LGBGT+ community.", "label": 1}
{"text": ">im just learning about gender neutral pronouns \n\nYou're just now learning about the word \"they\"? Don't most people learn that word, y'know, really early on in life?\n\nActually I'm not really surprised, MAGAs are braindead.", "label": 1}
{"text": "You literally don't know what communism is, read a book or something and stop talking out of your ass", "label": 1}
{"text": "Ugh.  Incels.  Such a tacky way to live.", "label": 1}
{"text": "I mean so prices are going up at a slower rate, that really is good. Doesn’t solve how expensive things still are from several years worth of much higher inflation.", "label": 1}
{"text": ">As a cancer survivor, maybe don't root for the cancer?\n\nOh shut the fuck up", "label": 1}
{"text": "> I mean that is what they do in the building. In a second trimester D and E they literally rip the fetus limb from limb while it’s alive. They also crush the skull if it’s too big.\n\nNo, that’s surgical abortion. These clinics aren’t equipped for that. Patients will be referred to the main hospitals for that. Try again. \n\n> Let’s kill them to make sure bad things don’t happen to them. By your logic why shouldn’t we engage in infanticide to avoid the same outcomes?\n\nWtf is wrong with you?! Conveniently ignored why god is willingly killing off and abusing babies that aren’t in these clinics there didn’t you?", "label": 1}
{"text": "It makes perfect sense. Your wing, but also feel the need to correct others? You need a life.", "label": 1}
{"text": "She hasn’t been convicted of 34 felonies and found criminally liable of rape.", "label": 1}
{"text": "You apparently know better than both the polls and early voting data because you went to college campuses. ", "label": 1}
{"text": "Baby sign language is so helpful! I am about to have my second and we'll definitely make it a priority to incorporate more this go round. \n\nHow amazing if your child picks up the whole language though and sticks with it!", "label": 1}
{"text": "No offense, sloppybuttmustard, but if I saw your username I'd change laws to make you stand 10x further away from me too. I'm sure you're lovely, but your buttmustard isn't.", "label": 1}
{"text": "You suffers the repercussions all the same.", "label": 1}
{"text": "They do but they’re a walking contradiction. Illegals want to mooch off the US and are all stupid or criminals….but also stealing our jobs…", "label": 1}
{"text": "Get brainwashed about immigrants for years", "label": 1}
{"text": "We had 18 days of 7a-7p, 7 days a week l, early in person voting and we also have no reason needed absentee ballot.\n\nSo fuck off, asshole.", "label": 1}
{"text": "They got plenty of answers. Remove your head from your ass.", "label": 1}
{"text": "It is.\n\n\nBut this is what started shit like gamergate and the cesspool that is 4chan now.\n\n\nYears ago we were all just shitposting snd being dumbasses, and people who legitmately believed our shitposting flocked to our corners of the internet, and took over our shitposting and made it real life.\n\n\nNow i leave the shitposting to real life where i know my friends wont take my shit posting seriously and use it as proof and validity for their insanity.", "label": 1}
{"text": "Good. That should be the standard in every state so that illegals don’t vote in our elections.", "label": 1}
{"text": "How stupid.", "label": 1}
{"text": "America has been a literal fascist country since the 70-80s, and reagan and every president since, has been a literal fascist.\n\nIf you think otherwise, you're a stupid, braindead, zombie.\n\nIf you voted for like, anyone besides jill stien, you're a fascist supporter...", "label": 1}
{"text": "libtard.  conservative patriots may not want to vote for kamala and a straight D ticket, but they can stay home. it's the most patriotic option when you've been convinced politics is team sports.", "label": 1}
{"text": "What a douche", "label": 1}
{"text": "In a threat about voting? Are you dense?", "label": 1}
{"text": "Ironic", "label": 1}
{"text": "Doubt", "label": 1}
{"text": "Type 2 Diabetes in India\n\nAccording to various studies, India has a significant burden of type 2 diabetes mellitus (T2DM). Here are some key findings:\nPrevalence: An estimated 100 million people (1 in 10 Indians) have formally diagnosed diabetes, making India the second most affected country in the world, after China. (Source: Lancet study, 2023)", "label": 1}
{"text": "Yet somehow they’re still the 3rd most polluting country… with agriculture being one of the a \ntop contributor. But please go on and tell me how cow farts are going to kill us all and millets are the only way we can be saved.", "label": 1}
{"text": "Yup, huge problem. Mucho carbs.", "label": 1}
{"text": "Dying is also climate friendly. Any volunteers?", "label": 1}
{"text": "x1.5 billion people and oops! It’s damaging again!", "label": 1}
{"text": "I'm gonna diabeat your ass", "label": 1}
{"text": "I mean, a celebrity's thoughts on a costume isn't really uplifting, nor is it news. Cool costume though", "label": 1}
{"text": "Clickbait. Downvoted. Fuck off.", "label": 1}
{"text": "Your whining about reddit rules that aren't even enforced.\n Go outside.", "label": 1}
{"text": "No I just find it funny lames like you always complain about clickbait but never actually pay for news which causes them to push more clickbait.", "label": 1}
{"text": "The fact you call your device your machine leads me to think you may be having generational technology impairment", "label": 1}
{"text": "Dude, you don't have the morals to understand this one.", "label": 1}
{"text": "Beating cops with flagpoles and spraying with mace is peaceful?\n\nTry harder, traitor.", "label": 1}
{"text": "You’re the dense one. You must live in misery seeing everything glass half empty all the time.", "label": 1}
{"text": "Yeah... One word used in a specific context \"fucks up the whole language\"\n\nAre you dumb or just lying?", "label": 1}
{"text": "Yes and we also refer to firefighters as firemen but that too is rooted in male centric supremacy. \n\n\nI honestly refuse to believe you, or anyone else here, is actually this stupid, so I can only assume it's an act to justify your bigotry.", "label": 1}
{"text": "Delude yourself further.", "label": 1}
{"text": "Just calling it like I see it guy. That's not irony either but you clowns never bothered learning what words mean.", "label": 1}
{"text": "Feed your own kid.", "label": 1}
{"text": "My \"free\" education back then was paid for with state tax.  Looking back it made no sense why we also had to pay fees for admission, books, lunches, buses, and when we got a car we had to pay parking fees.  Cull the administration board, useless people just siphoning money and bringing in more nepo-babies.", "label": 1}
{"text": "Yes", "label": 1}
