{"text": "I did a spit take at that tag line.\n\n> State Farm; It was self-defense, you saw it.", "label": 0}
{"text": "I really dig this song", "label": 0}
{"text": "Some great music! Also check out [https://www.youtube.com/watch?v=MSb\\_31SUEXE](https://www.youtube.com/watch?v=MSb_31SUEXE)", "label": 0}
{"text": "Yes, there are some outlier conditions there, but the reality is that it's a term used before the cause of death is known. If someone died of natural causes, that's the bucket it would go in, but the authorities can't say that until they have evidence to back up that claim, thus \"sudden death.\"", "label": 0}
{"text": "Hard agree", "label": 0}
{"text": "Ideally he'd have a small facial accessory or look change. Perhaps thick eyebrows or a wig.", "label": 0}
{"text": "Like I said, run along now. You aren't that clever.", "label": 0}
{"text": "I think it’s one of the best SNL videos. I had no idea it was banned/scrubbed. \n\nI have had the Vimeo tab open for more than a year. I pop back to it like every other month.", "label": 0}
{"text": "100% this show doesn't have an Oscar character", "label": 0}
{"text": "I'm liking it so far.  Thank you.", "label": 0}
{"text": "woosh", "label": 0}
{"text": "That's what the cheap beers are for. Get so fuckin drunk you don't remember shit.", "label": 0}
{"text": "Holy shit I love this song. Thanks for the new artist to check out!", "label": 0}
{"text": "> Public schooling became available to girls in Saudi Arabia in 1960.\n\nI mean, women didn't have a right to open their own bank account until [the 70s](https://www.forbes.com/advisor/banking/when-could-women-open-a-bank-account/) in the US, so I'd be careful doing the \"better than you\" thing. (If you want to argue that's some isolated thing that doesn't mean anything, there are also [countries that banned slavery](https://en.wikipedia.org/wiki/Swedish_slave_trade) 700 years ago). \n\nI'd be careful using random examples to prove one country is better than another as it will almost always backfire.", "label": 0}
{"text": "There is just something so haunting about this song, even without the eerie video. It just gets into your brain like few other songs do.", "label": 0}
{"text": "[https://youtu.be/nB-x4938Yto?si=7iMEQi3aR0-0j3Xd&t=1751](https://youtu.be/nB-x4938Yto?si=7iMEQi3aR0-0j3Xd&t=1751)", "label": 0}
{"text": "Guy in my country was driving unlicensed while high on fent, crossed the lanes and ploughed into a family. Killed the father, mother's in critical condition in hospital, killed the dog.\n\nAfter all the \"disadvantaged situation/minority\" bonuses were applied, he got less than a year, fully suspended. So no jail time at all.", "label": 0}
{"text": "There is a Kansas City Kansas and a Kansas City Missouri.  The state line goes through the city. ", "label": 0}
{"text": "I'm clueless about the schools my own kid went to? What does the 1000 schools have to do with it? LAUSD is a giant shitshow, if you have any experience with it. Shitshow as in, a single leaking toilet for an entire school.", "label": 0}
{"text": "1.2 million in 20s is over 132 pounds.  I'm sure it was a mix of currencies.", "label": 0}
{"text": "Why so sad? I wen't to public school in the 90's in Los Angeles. The buildings are old. They have some wear and tear. So what? It adds character to the building. I remember my High School and all its flaws fondly. Go cry about it and then get ahold of yourself.", "label": 0}
{"text": "Who is this guy and can he share some of the things he’s done to try and improve the situation, which in all honesty, isn’t that bad? \n\nDoes anyone have a clue how much it would cost to install an elevator or a proper ADA ramp? \n\nHow big is this school? What year was it built? \n\nDid this problem suddenly develop after a disabled student started attending? Is there even a disabled student in the school? \n\nWithout context, this guy seems like a whiner and doesn’t belong in this position.", "label": 0}
{"text": "Varies a lot.  Looks a heck of a lot worse than I remember my schools.", "label": 0}
{"text": "Hello /u/Dramatic-Dream1863,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Like when they post a single handgun with 2 mags and lay out all 30 of the rounds separately and call it an arsenal.", "label": 0}
{"text": "I'm sorry but despite being a valid point this is a ridiculous suggestion. Elon Musk is not so rich because he buys better boots, he is so rich because he is able to benefit from structural advantages that have been designed to enriching the rich in America: tax policies, FED pumping money into the system that inflates the stock market, aggressive (and often legal) action by corporations to curb any unionization effort, no limits on corporate buybacks etc. etc. These are the reasons the rich are so rich and getting richer, not because of fucking boots.", "label": 0}
{"text": "For us locals, if I say \"Kansas City\" I mean Kansas city Missouri. \"KCK\" would be Kansas City Kansas. Most people here would call Kansas City Kansas KCK.", "label": 0}
{"text": "I can't remember how old I was (Must've been between 5 and 8 years old) or where it was exactly - Somewhere in the UK, with windmills and a river people would swim in and some really nice small rolling hills - Basically a natural-ish skatepark but for bikes. \n\nI ran up one of the hills, A bike from the opposite direction collided with me. I probably cried.\n\nMy dad? He laughed, Told me, Look son - Always be aware there may be something beyond you can't see - So be aware, be ready. \n\nOne of the guys let me ride his kids bike for a bit to try the jumps for myself. \n\nIt was a blast.\n\nMy dad was a good dad in many ways, and an arsehole in many others - This wasn't the arsehole mode dad - I still follow this advice.", "label": 0}
{"text": "The fact that we have any billionaires while we have issues like these is a major major flag that we as a species have made a major wrong turn somewhere.", "label": 0}
{"text": "“Merge, everybody merge” has lived rent free in my head for many many years. Wouldn’t have it any other way.", "label": 0}
{"text": "Arapahoe County Sheriff Sergeant Brett Cohn! Does he have the power to make things always have been [other things](https://www.youtube.com/shorts/O8SQW-osBAQ)?", "label": 0}
{"text": "The great depression was from 1929-1934. Interwar covers 1919-1939.", "label": 0}
{"text": "But he could've used both arms on the one bag\n\nLike cradled it against his body", "label": 0}
{"text": "It never struck me before how much the US exists in a completely different universe until a middle school principal, after walking through more security than a Norwegian maximum security prison, complained that it was not secure enough.", "label": 0}
{"text": "Fantastic, what happens after they get out of college\n\nOpen a window and listen to the screaming\n\nIt's not going well even if you went to college. College isn't the answer anymore like it supposedly used to be. It never actually was, that's why.\n\nYou tell the whole country to go to college, then the entire country does, and then they make it so you need more than a bachelor's, because bachelor's are too common, because the point was never to hire people who knew how to do a job, it was to create a clear class division of people who have and could and people who haven't and couldn't, while also giving the illusion that the division was a portal and not a wall.\n\nIf you're looking at basically anything that's happening right now, how it's happening, why it's happening, and you think to yourself \"I'm pretty sure something's going right\"? You are not looking at anything that's happening right now.", "label": 0}
{"text": "He also fought a grocery store clerk for no reason.\n\nNeither of them are good people...but there are clearly levels.", "label": 0}
{"text": "[The quote from a Terry Pratchet book](https://terrypratchett.com/explore-discworld/sam-vimes-boots-theory-of-socio-economic-unfairness/) is not suggesting that the rich got rich by buying good boots.  It is saying that the poor are stuck being poor because they cannot afford to buy the good boots and are forced to only think about tomorrow.  Elon Musk could afford to start companies and buy stock which made him richer.  The poor will never be able to start an electric car company or ever have the opportunity to engage in the things that would ever make them rich.", "label": 0}
{"text": "Appears there was also change mixed in aswell", "label": 0}
{"text": "Dude, read a book. Specifically books by Terry Pratchett. This reference went as far over your head as the dragon from the book that quote is from.", "label": 0}
{"text": "You have to think about the aftermath, which many people don't think about.\n\n7 months in jail means you any job you had is gone. Bills stacked up, apartment is likely lost, without family help you have no safety net, any thing you owned has probably been repossessed. \n\nYou need to find a job to survive but you now have a record. Think of how hard it is to find a livable job as a normal educated person! 2 years later, you're impoverished, flipping burgers, no future available and you're only choices now are by pure luck to work your way to manager level that probably pays 50,000 over another 6 years that ignores your record.\n\nThat's how a majority of poor people or repeat offenders are people who had to spend a two weeks+ in jail, even for minor offenses", "label": 0}
{"text": "Did you watch the video? He says that he's the principal.", "label": 0}
{"text": "\"I don't understand my own visuals\"", "label": 0}
{"text": "Especially on businesses! If businesses didn't have to pay any taxes, I am sure they would come fix all these schools. Also if we got rid of environmental and worker regulations, all that red tape is preventing these schools from getting massive renovations and being modernized!!!", "label": 0}
{"text": "Oh wow! I worked there. The company is called Empyreal Logistics in case anyone was wondering.", "label": 0}
{"text": "Their eyes were bigger than their muscles.", "label": 0}
{"text": "Diddy is still a criminal and will probably be dead before his trial in May.", "label": 0}
{"text": "The problem here is we have schools like this, but then we have schools that are world class with great amenities and were built this century. \n\nFunding for individual schools should not be tied up in property taxes of the area. That is our problem. Overland Park Kansas is the same metro (Kansas City) in the same state, but I bet you would be shocked at how nice some of those schools are.", "label": 0}
{"text": "Elon Musk is something completely different from your regular wealthy person. Wealthy people can indeed be more efficient with their money. People with more capital for investment can use that to make themselves more wealthy. My dad came from a poor peasant family in Poland in the communist era. It was basically a farm with no infrastructure to speak of. He retired a millionaire starting with nothing. His first $100,000 was ten or twenty times harder to earn than the million. It is EXTREMELY difficult to get wealth initially but once you breach a threshold you get more wealthy as systems of wealth acquisition become available to you.\n\nIt is in the same line of thinking as better quality of services and equipment make it more efficient to maintain and generate wealth.", "label": 0}
{"text": "This post just seems way to fucking on the nose with the P.diddy scandal,.especially since Kat Williams specifically called out p.diddy at least a dozen times.\n\nInsane that the entire industry blacklisting him wasn't enough, now that he's been proven true they also have to defamed him further, it's honestly sad what they can (think they can?) get away with.", "label": 0}
{"text": "I see where you're coming from given that he had the prior burglary. That said, 7 years of probation is a very serious restriction. People who make really bad choices are capable of turning their lives around, but it's much harder to do after a long prison sentence, which thoroughly wrecks people's lives.", "label": 0}
{"text": "Hello /u/spider_best9\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah, he made it pretty far being on foot carrying that.", "label": 0}
{"text": "That's irrelevant to their response. The original statement was that they are underfunded. They are funded but the funds are misappropriated.", "label": 0}
{"text": "why are you pinkin at my dink when i'm trying to slump?", "label": 0}
{"text": "As a local (i'm in Lawrence Kansas), if I say Kansas City I mean Kansas City Missouri. If I want to refer to Kansas City Kansas I say \"KCK\" \n\nHowever, JOCO (Johnson County) is the larger part of the metro on the Kansas side, and where most of the \"nice\" things are. Overland Park, Olathe, Lenexa, etc... \n\nThere actually isn't much in KCK of note imo.", "label": 0}
{"text": "most places dont hire felons", "label": 0}
{"text": "My only hope is that Kamala solidly beats Trump in the coming weeks and we see strong blue turnout overall in both this election *and* the next midterm. With that we can take back the house and senate, and hopefully it will drive down-ballot engagement in a way dems usually struggle with.\n\nIf and only if the GOP is resoundingly and repeatedly beaten in fair and open elections will we have any hope of seeing them reform. At this point I'm thinking an implosion is more likely as Trump seems to have the party in a desperate stranglehold. The only way to get his supporters to move past him is to show them most people think he's a loser - nothing else will change their mind. \n\nReminder that you can look up example ballots right now to ensure you've researched your options. Many proposals will be worded vaguely to confuse unengaged voters, so don't be one. Ensuring your local officials like judges and sheriffs aren't abusing their positions is very important. All of these are local enough that singular votes absolutely can matter, and engaging your friends as well can actually turn elections. \n\nIf every single person in America who describes themselves as democrats, liberals, leftists, etc. simply all voted straight ticket dem in the next two elections we'd control 95% of the elected seats. When the GOP controls 6/9ths of the supreme court and half of the senate they're our problem, if they control 6/9th and nothing else then we are their problem. None of this is out of reach if enough people simple channel their anger, disgust, righteousness, whatever and go vote. \n\nhttps://www.vote.org/ballot-information/ for a full rundown of what to expect on your ballot and to learn what each candidate represents.", "label": 0}
{"text": "Sports bring profit.\n\nSchool do not…. Yet.\n\nWait until public schools funding fully fall apart and private schools full receive funding.  \n\nPeople will buy their grades.  Teachers will lie about grades to keep their jobs or earn their bonuses.  Teachers will fight over who gets the honors classes, meaning they get the best test scores. Special ed students, who their support 100% comes from tax funding, will be forced to all go to public school to receive support.  Meaning any public classrooms will become majority special ed based… meaning the amount of learning will decrease and behavior problems will increase.\n\nAll of this will happen and we will see record profits.  Record investments.  And more data saying public schools fail.\n\nSigh…. Fuck.", "label": 0}
{"text": "Don't forget the mold!", "label": 0}
{"text": "But hey there's obviously Billions to go to Israel and Ukraine", "label": 0}
{"text": "Hello /u/evergreentactics,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Yeah, no matter how carefully you plan, doing a big robbery is going to be the most stressful thing you've ever gone through. Much easier to fuck up.", "label": 0}
{"text": "Huh? I was replying to a comment saying the Chiefs should give money to schools.", "label": 0}
{"text": "Hard to know for sure where the funding gaps are. Surely the Experiment contributed but that school is also in a city and county that is famous in the area for them giving massive tax abatements to any company that mentions doing business there. The speedway, multiple sports teams, etc. It's their primary lever to get businesses to come.\n\nBy comparison, there are several other school districts in the area and in the same state that are in remarkably better condition, though primarily in more affluent and economically strong cities.", "label": 0}
{"text": "I live in Baltimore, a city ran by Democrats for over a century. The spending per student is more then $22k/year, one of the highest in the nation, the city taxes are the 4th highest in the nation.\n\nThe schools are some of the worst in the nation by far, the school system is trash, despite the massive amounts of money given to the district.", "label": 0}
{"text": "This is false. \n\n\nhttps://www.usnews.com/news/best-states/rankings/education", "label": 0}
{"text": "Funny they mention his athletic ability and yet the payday was too heavy", "label": 0}
{"text": "And these people are thoroughly convinced that the Democrats did this to them on purpose", "label": 0}
{"text": "...which aligns pretty well with what this school is experiencing. I hope their bond measure passes.", "label": 0}
{"text": "With how they were talking about that someone could climb over a fence, to me that resembled more a prison when a school. Our school yards were just open to the street, often with an ice cream parlour or a butcher on the other side.  \n\nThe only security concern I remember was teachers reminding us to not play football right next to the street.", "label": 0}
{"text": "this had the first ever Kiss show on tv right?", "label": 0}
{"text": "I’m sorry that my attempts to engineer an argument from your gibberish didn’t meet the incredibly high standards of someone too lazy to post anything intelligible.", "label": 0}
{"text": "He gets significantly hotter and more often in Kansas City than it doesn't Toronto.  The high school I went to just outside of Kansas City didn't have AC in it until around 2000 and I remember when I was in elementary school they would have some days when the high school kids would leave school a couple hours early to avoid the hottest parts of the day.  Mainly when it was like 95f+", "label": 0}
{"text": "They don't?", "label": 0}
{"text": "The rare time on the internet when somebody is talking about Kansas City and actually means the one in Kansas and not on accident", "label": 0}
{"text": "Try harder next time. I know you can do it little engineer :)", "label": 0}
{"text": "I'll just get Steve from Minecraft. I plan, he carries the loot, I'll even give him 75% split of what what he can carry", "label": 0}
{"text": "I swear I want to smack a doctor every time they say \"What seems to be the problem,\" like I am completely incapable of actually feeling pain until they agree there's something wrong.  Like no one has anything better to do than go to a doctor when they don't need to.", "label": 0}
{"text": "I lived in Topeka, Ks and went to the same school district as Brownback’s kid(s). I actually saw him jogging on a back road toward my school— he was waving me to slow down when I was already under the speed limit, (oddly enough that was when I recognized him). If I veered right just a bit more I could have been an unsung hero, jailed and likely executed, but still a hero.", "label": 0}
{"text": "We need to send more money to Ukraine!! /s", "label": 0}
{"text": "its not a universal experience. most of these shows are lazy adaptation and do not represent local people. I've watched the Russian version of Married With Children and it was shot for shot remake.  It didn't fit the Russian culture at all.   The main actor wasn't even bolding, which made the scenes where he puts on a wig to start dating again after separating from Peg very odd.", "label": 0}
{"text": "Absolute lie", "label": 0}
{"text": "This is done by design to give charter school interests like Betsy Devos a mega boner.", "label": 0}
{"text": "Gotta find that one. Don't recall ever hearing it. Thx", "label": 0}
{"text": "ILC was such a crazy show. I have such distinct memories of being in that “too young to watch” age range but having a friend whose older brother taped it for us to watch.", "label": 0}
{"text": "Only kinda.  The state of Kansas already passed and signed a bill that would basically give the Chiefs a blank check to build a multi-billion dollar stadium to move to Kansas.  Just to have bragging rights to say they have the team and move them 30 minutes away", "label": 0}
{"text": ">long higher level of eduction = more likely to vote Democrat.\n\nOh, the irony.", "label": 0}
{"text": "Aside from the flooding (which is a major problem)  These aren't shitty schools.  They just aren't fancy, rich, new schools.\n\nBasically nothing else they complained about is really a 'need' issue, they're just 'wants\".", "label": 0}
{"text": "Like 10% of school funding does come from the federal government.  I think he has a pretty good argument to say that that number could be much higher", "label": 0}
{"text": "...so the same city, right? \n\nLike Budapest, or DFW but with some settlers being so stubborn that they just predicted the future.", "label": 0}
{"text": "Dollies are cheap and portable.", "label": 0}
{"text": "No, completely different leadership gets elected. Different taxes, different police forces. One has nothing to do with the other.", "label": 0}
{"text": "Yeah I noticed that too. It’s like he winking constantly at us with both eyes.", "label": 0}
{"text": "They do and it makes things even worse.", "label": 0}
{"text": "Lol right. I just finished ozark and as soon as the cameraman asks \"is there a lot of money in there?\" the lady officer immediately lights up like \"OH YEAH!\" lol this money is shortly going to be checked into 'evidence' and will never been seen again.", "label": 0}
{"text": "What irony is that? Can’t wait for this explanation 😂", "label": 0}
{"text": "It's not \"other side of the city\" it's an *entirely different state*\n\nI live in KC three miles from the border. On one side, abortion is illegal but weed is legal. On the other side, abortion is a right in the state Constitution and weed is a felony charge.", "label": 0}
{"text": "Not much of note:\n\n-Sporting KC\n\n-Kansas speedway\n\n-Slaps BBQ\n\n-The original KC Joes (Oklahoma Joes)\n\n-[the KC taco trail](https://www.visitkansascityks.com/taco-trail/)\n\n-KC Monarchs \n\n-the American Royal", "label": 0}
{"text": "The \"*government should be run like a business*\" people.\n\nAny time I hear anyone say that it's a huge red flag that they have a LOT of unexamined beliefs.\n\nGovernment should absolutely NOT be run like a business.", "label": 0}
{"text": "The scumbag family are the ones who sent him there to be abused and killed...", "label": 0}
{"text": "The AC was fucked and sucked?! Lucky.", "label": 0}
{"text": "And in his behavior. Phil had his shit together.", "label": 0}
{"text": "Partially, you say.", "label": 0}
{"text": "It’s also why they are against racial integration in schools to this day.", "label": 0}
{"text": "This is only partially true, at least in my state. State funds are a very small fraction of the funding. The funding for our school district comes from local property taxes that go directly to the towns involved. A very small portion of those taxes go to the state. The state will assist with funding new school build projects, but only based on need / your turn in line. State funding, for our state, accounts for a very small portion of the school and almost none of the cost to actually run the school. Its almost exclusively for new projects / renovations. Every year our towns put together a school budget and we vote on it, that budget is pretty much entirely funded by property taxes. \n\nThat being said, bonds are also a thing. For example, my school district just voted to approve a bond to build a brand new school, entirely funded by local tax payers. The problem isn't necessarily bonds, the problem is, in poor districts, people almost unanimously vote against bonds because they can't afford it. While I agree, funding should be done at the state level and distributed based on need, there's not a chance that will happen. Money is power, wealthier areas will always vote against their money going to poorer regions, so it won't happen.", "label": 0}
{"text": "Hello /u/Lurker4711,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "They literally don't", "label": 0}
{"text": "He was going to come back for it later. He carried it for half a mile because he parked his getaway car too far away I guess. Maybe he was going to run all the way home? Also, did he wear gloves at home when he took the bags out of the box and put them in his pocket, or just leave fingerprints all over those also?", "label": 0}
{"text": "Crazy! I knew someone who, when under the influence and suffering from mental health issues, was an accessory to robbing a convenience store for some small amount of cash and some snacks. Even they got a heavier sentence.", "label": 0}
{"text": "I love how they show a picture of the judge to imply he helped a brother out. They couldn’t just say “the judge” or mention his name.", "label": 0}
{"text": "The title of the video is clickbait. I have no idea of its real contents, and other people probably feel the same way, which might be why it's not getting as much attention as you feel it deserves.", "label": 0}
{"text": "Agreed. \n\n\"I failed at raising my kid well. I know, I'll send them away from their family to hang out in a forest with other fucked up kids and get yelled at. I'm sure some for some unidentfiable reason that will help.\"", "label": 0}
{"text": "He probably would've gotten more sympathy if on his wiki the description of all the different assaults he got arrested for wasn't longer than his career section.", "label": 0}
{"text": "Pay range for HS Principles in the Kansas City public school system is 103k to 149lk.  The median income is 37,000.  The highest paid Superintendents make well over $300k per year. \n\nMaybe the administration should stop bleeding the school system dry.", "label": 0}
{"text": "It's crazy to me to see the private school which operates on a budget of $5k per student with new facilities, high tech, and nearly everything they want/need, and then see schools falling apart that have budgets over double that per student.  What level of mismanagement has to happen that you have more than double the money and still can't do basic budgeting.", "label": 0}
{"text": "Yeah im from Alabama and most of the schools there look like this or worse.", "label": 0}
{"text": "In Australia, this reminds me of prisons or correctional facilities", "label": 0}
{"text": "The problem is, people see a $50-$60 million price tag of a new school and focus entirely on that. They don't care about the few hundred grand they spend on maintenance of portable units over years. My school district just dealt with this. My child went to school in portable units just last year. They are awful. The heating / cooling is sub par, they have to go outside just to get to their lunchroom, and they are unsafe. Thankfully, the majority of the town voted to pass a $55 million bond to build a new school to get rid of these units. That said, in poorer districts, they are likely to vote down these bonds as they can't afford the tax increases.", "label": 0}
{"text": "Fantastic soundtrack [https://www.youtube.com/watch?v=a-dR8HD45qs&list=PLY0HG7j1maOiXEGfyDupDSwuDFaG4NQys&index=10](https://www.youtube.com/watch?v=a-dR8HD45qs&list=PLY0HG7j1maOiXEGfyDupDSwuDFaG4NQys&index=10)", "label": 0}
{"text": "Video isn't coming up anymore", "label": 0}
{"text": "This is what happens when Religion pulls all their money out of schools to NOT EDUCATE their children.", "label": 0}
{"text": "college ball player, probably knows someone", "label": 0}
{"text": "Billy Zane's", "label": 0}
{"text": "\"eduction\"", "label": 0}
{"text": "> -The original KC Joes (Oklahoma Joes)\n\nIt's telling that 3/4 locations are in Johnson County though right? I think that proves my point more than anything. JOCO has grown enormously in the last 30 years and anything new is going to be built here.\n\nAnything \"new\" is going to be in JOCO. \n\nThis isn't going to happen because Missouri is going to sweep in at the last minute and pay for everything, but if the Chiefs and Royals don't get their new stadiums built, they would be going to JOCO for example.", "label": 0}
{"text": "Similar idea where I live.  In NY, which gives good funding to schools, and on a lake so high property taxes.  However, I worked at the school for just under 6 years, and they had constant capital projects going on.\n\nThe amount of wasted spending/boneheaded decisions, made me start to vote against the the projects.  Not because I didn't want the students/my children to have better facilities, but because they weren't using the money well.\n\nComputer labs with no internet connection; Removed computer lab entirely in the Elementary for more \"breakout rooms\"; New weight room when the current one was pretty spiffy; Re-doing rooms but not re-doing the AC/Heat in those rooms which was the biggest issue Middle School is 3 levels and some days the 3rd level is so hot they have to have all the kids on that floor go elsewhere)\n\nIt's not like it's going into Admin pockets, it was just, leadership thinking they were always the smartest people in the room.  From an IT perspective, when doing the Middle School Tech lab, they didn't bother to include IT whatsoever in the design/planning phases.  Not until after it was nearly finished did we come in to set up and see - no internet.  The stools they had bought for the computer desks didn't fit at the lab tables, so kids knees were higher than the tables.  Re-did the transportation building, actually looked pretty good, built a meeting room that also had a kitchen in it.  Fancy projectors and TV's for display....put in areas that you couldn't see from the meeting tables, which were arranged in a horseshoe pattern as the only way, so half of the meeting couldn't see the screen behind them.  Installed a glass like whiteboard for writing on, against our suggestion, only to find out when projected upon, it made it a blurry double image, so the projector couldn't be used until another pull down screen was installed over it...instead of just using traditional whiteboard like everywhere else.  The list goes on and on.\n\nThe waste because they had to be the smartest people in the room and then blame it on the support staff for not \"making it work\" just pissed me off to no end, and they would show the good parts and it was such a \"huge success!\"", "label": 0}
{"text": "Kansas City hasn't had a Republican mayor in generations.  How is it you're imagining Republicans are to blame?", "label": 0}
{"text": "I used to live in Independence, but was in the KC school district.  The schools were fucking horrible in the 80's-90's, and they are even worse now.  It's my understanding that Kansas City schools recently got their accreditation back.  For years, they didn't have accreditation, which means that the diplomas kids earned were basically useless.  \n\nI fucking hated school there, one of the best things I ever did was get the fuck out.  It was one of the few times that I benefitted from divorced parents.", "label": 0}
{"text": "This is the only possible answer", "label": 0}
{"text": "This video is showing me literally one of the nicest schools I've ever seen the inside of.", "label": 0}
{"text": "LOL. Warmongering is awesome! Way more important than taking care of future generations.", "label": 0}
{"text": "yikes", "label": 0}
{"text": "It's always been weird to me because it's all really one big metro area that just happens to have a state line running through it, which means politically it's two different cities when geographically it's only one.", "label": 0}
{"text": "I wanna see what people think a good school building looks like. I've toured several schools and good universities, even government campuses. They all seem similar types of \"shitty\" as this video implies.\n\n\nTo be honest, I'm not even really impressed with brand new buildings. Just some sort of base building model with various add-on type attachments added as desired, done by seemingly the cheapest person they could find. Like \"you want this room to have internet? sure lets just cut a hole in the wall here add some internet cables\", or \"you want this room to be such and such room? Sure just add a sign, it's an now whatever room you want, wheelchair access doesn't matter\"\n\nThe problem seems deeper than they think..Probably needs better architectural design and review for changes standards than the common ones they use.", "label": 0}
{"text": "Sounds like government continuing to use all our money well, shame shame. ", "label": 0}
{"text": "I got to talk to him when I was working for the student newspaper at JCCC and I've had similar intrusive thoughts about that moment.", "label": 0}
{"text": "Average in red america\\*\n\n[https://www.usnews.com/news/best-states/rankings/education/prek-12](https://www.usnews.com/news/best-states/rankings/education/prek-12)\n\nOf the top 10 states for K-12, 8 are blue states. Of the top 30 most are blue or purple.", "label": 0}
{"text": "Are silent movies back?", "label": 0}
{"text": "Schools are run by the states, so there is going to be a lot of variation state-by-state, my explanation was just meant to be an overview of how it mostly works.  There are loopholes, extra money sources, etc. all over the place, but this represents mostly how it works.  The typical funding split is a 43%/43%/14% split between state, local and federal government respectively, but each state can do different things.\n\n> that budget is pretty much entirely funded by property taxes.\n\nIn most districts, local property taxes only represent 50% or less of funding.  That said, 85%+ of property tax money goes to schools.  Anyone who wants more money for schools should expect a direct percentage increase in property taxes.\n\n> While I agree, funding should be done at the state level and distributed based on need, there's not a chance that will happen.\n\nThere are a lot more underperforming schools that can't pass bond measures than there are schools in good shape.  I get there would be a lot of resistance to it, but the wealthy schools represent a pretty small slice of the voting base.", "label": 0}
{"text": "It really was like a small-scale trial run for what the whole US would look like if the neocons got their way (more than they already have). We started referring to the whole state as \"Brownbackistan\" at one point because he was gonna turn it into a developing country.", "label": 0}
{"text": "Ikr, having a normal lady driving a normal vans with over a million in cash is recklessly irresponsible. Completely ignorant of risks involved. The company should be taking as much responsibility for this.", "label": 0}
{"text": "most places don't even hire regular people", "label": 0}
{"text": "Like the joke about the 2 hookers?", "label": 0}
{"text": "Yes. This being considered as bad as it is is a testament to the fact that we are accustomed to a standard of luxury that is not available to a very high number of people. There are plenty of cities worth of people in central/south america, africa asia, and parts of europe where they would consider this an improvement of their current situation. \n\nIt’s bad by first world country *standards*, but it’s not “third world” level stuff.", "label": 0}
{"text": "I went to high school in Johnson County, which is just on the Western edge of the KC metro area and one of the wealthiest counties per capita in the country. But we would compete in sports/debate/etc with KCK and KCMO schools, so I've been inside a lot of them, and it really was horrifying the disparity between what we had and what they had. It's probably part of what helped radicalize me.", "label": 0}
{"text": "You don't want to park your vehicles where cameras can see it.", "label": 0}
{"text": "Hello /u/ThatMovieShow\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "heartbreaking, yet exactly what the voters ask for", "label": 0}
{"text": "The Bus That Could Not Slow Down ", "label": 0}
{"text": "\"Im watching fishing\" is a favorite of mine", "label": 0}
{"text": "What does that even mean? I’ve been to many Saudi houses. Most don’t have art or family photos on display. So I’m not sure where you are getting that percentage from and what houses you are referring to.", "label": 0}
{"text": "They mostly launch their own rockets filled with Starlink satellites, with massive amounts of subsidies from the government and assistance from NASA.  Of course, it's become clear this isn't a financially viable system, so they pulled in even more government funding and assistance from NASA to develop the Starship launch platform.\n\nIt's not a matter if a company can do something that's theoretically possible, it's how long it'll take and how much money it'll require.  It seems to me that SpaceX is being given all the time it needs and all the funding it could ever hope for to continue along.\n\nIt also seems to me that both SpaceX and the US government are lying about what they're attempting to achieve.  It's about as clear as day that Starship has nothing to do with Artemis, nor with Mars.  You can watch all of the previous statements from Elon Musk on his supposed Mars mission and how his statements keep wildly changing over time to realize he's lying through his teeth about it.\n\nSpaceX is essentially a privately held for-profit corporation largely built and propped up by US taxpayers, whether those tax payers agreed to do so or not.   The fact that we, the US tax payers, aren't entitled to annual financial reports from the company should scare the living shit out of every single one of us.", "label": 0}
{"text": "Yeah, this just looks like a generic older American building. Not saying it isn't an indicator of our underfunding of education, but it's also what happens as a large commercially-constructed building ages. \n\nMy elementary school was about 150 years old when I went there, and so it had exposed conduit and cables everywhere, hacked-on HVAC units, a couple cheap stair lifts for ADA compliance, and tons of ancient fixtures and fittings that were in disrepair or jury-rigged. Same with quite a lot of industry places I've worked. When building are build before modern requirements or expectations, then last for decades or centuries in purely utilitarian use, they end up a cobbled mess, and the only real fix is tearing them down and rebuilding, which is a huge task, and not just monetarily", "label": 0}
{"text": "This school isn’t that bad. It could obviously be improved but it looks and feels like a school where kids can learn.", "label": 0}
{"text": "Oh my mistake you're right. Surprised she was convicted of armed robbery if she wasn't there.", "label": 0}
{"text": "Don't worry, billions are sent to some random shitholes around the world!", "label": 0}
{"text": "I'm from Connecticut, which is supposed to be a good state for schools, but I was thinking the same thing, this school actually has it pretty good compared to what I grew up in.\n\nI'm doxxing myself a bit here, but last year my school ended up becoming a hot topic for [youtubers to cover](https://www.youtube.com/watch?v=BRwlzLWgf9E) as they sift through the now-abandoned version of it. I was graduated in 2017 the year before it closed down.\n\nSometimes I wonder how I would have turned out if I didn't grow up in a poor neighborhood with a severely underfunded school system.", "label": 0}
{"text": "90??? What the fuck? Was this in a large city?", "label": 0}
{"text": "There was another one I think it was just called Saturday Night.", "label": 0}
{"text": "Land of the free.. more like land of the poor", "label": 0}
{"text": ">  which means politically it's two different cities when geographically it's only one.\n\nThis is how every city with suburbs works.", "label": 0}
{"text": "I used to live there and can confirm they are both definitely shit holes. I get the feeling people downvoting have never lived there.. Even the residents agree Kansas City is a shit hole no matter what side of the river you are on.", "label": 0}
{"text": "But they continue to vote for politicians that openly hate education so they can give millionaires tax cuts…. Because freedom", "label": 0}
{"text": "Haven't had a chance to watch the video, but from outside the US I can't tell if this is after a disaster or if it's an ordinary day in an extremely deprived school.", "label": 0}
{"text": "this is my favorite standup set of all time. just pure, goofy, comedy. so many good quotes\n\nhow do i get this goodness in me?? \n\noh i see where theyre goin with this\n\nnow! i mean, now! i mean, then! \n\nb as in... baked beans?\n\ni just kept eating and eating! i mustve had two spoonfuls!\n\nbring me the head of a pig!\n\nwere makin money RIGHT NOW\n\nthis one keeps your food cold for 600, this one keeps your food cold for 800\n\nand no more hapiness! away with you!!", "label": 0}
{"text": "How to spot a fascist in 1 easy step. \n#1. Look in your mirror!", "label": 0}
{"text": "I know people who grew up attending this school. According to them weapon issues of various levels of severity are about a monthly issue. Often it's just that a student forgot to leave their switchblade home or got caught playing with it by their locker and it causes a minor drama. Sometimes it's a kid who is in a gang who managed to get a gun in or near the school. Sometimes it's a kid threatening violence against other kids who may or may not have a weapon that triggers some level of mini-lockdown. There is apparently a lot of small scale gang violence at this school.\n\nThis is all according to one family of kids who are currently in their early 20s who attended this school in the last 5-10 years.", "label": 0}
{"text": "The lack of restrooms in portables thing affected someone in my kid's school in Florida - the school was on lockdown, and one of the kids ran out of the classroom when they could no longer hold it.  They got tackled and interrogated by police.\n\nI remember in the 90's coming in to a classroom and seeing half the desks roped off because the roof had leaked.  There was no ETA to fix it; maintenance was so strained they were taking only emergency repairs.  When the teacher told them the roof was leaking an that constituted an emergency, they replied that the rain had just stopped, and so it was no longer an emergency.\n\nThe \"temporary trailers\" they installed in my childhood school were still there when my kids briefly had to attend it.\n\nWe're having major infrastructure problems in the US.  We keep spending more on schools, but it doesn't seem to be going to infrastructure or teacher's salaries.", "label": 0}
{"text": "Taking care of future generations is important. You care about only yours but as an intelligent person, I have a woke view of humanity I guess. Believe me, saving Ukraine is part of this process and you have chosen to stick your head up your ass.", "label": 0}
{"text": "Tourette’s", "label": 0}
{"text": "to be honest... fix the water damage, install a proper floor in the wrestling room, make the building wheelchair accessible, add permanent rooms to replace the trailers, but the bones of the school I liked immensely.", "label": 0}
{"text": "“Dressed head to toe in black.”\n\n“Every square inch of his body was covered in black.”\n\nMe looking at a bright blue mask with white (and orange) around the eyes… what?", "label": 0}
{"text": "Using the math from person above it seems like the bags could’ve weighed 100 pounds which is a lot to run with lol", "label": 0}
{"text": "It's called \"a bad faith argument\", specially easy to tell when the person already holds other questionable positions.\n\nOr \"sealioning\".", "label": 0}
{"text": "Appalling ventilation too! Just terrible! The kids and teachers must be sick so often.", "label": 0}
{"text": "To be fair, the gym is the real thief.", "label": 0}
{"text": "Did he not have a car ready to go? How far was he planning on walking? She's right, he is a dumbass.", "label": 0}
{"text": "Only going to get worse so long as the GOP has any say in things. Their GOAL is to turn out uneducated masses. Makes it easier to brainwash them into the cult.", "label": 0}
{"text": ">In the longer video Kat's actions are far more understandable if not condonable. Kat was playing a basketball game and him and this kid were getting into an argument. The kid wanted to fight already. Kat was not interested.\n\nUhh no, Kat was insulting the neighbourhood with his usual low skill, low class way and the kid took offence. Kats a fucking moron", "label": 0}
{"text": "No wonder he couldn’t get in the NFL, butter fingers fumbled a million dollar bag", "label": 0}
{"text": "There's certainly problems, but this story is essentially saying, \"We gave one dude a penny and one dude a dime, and the guy with the dime isn't any less hungry.\" No public school gets any where close to adequate public funding. Baltimore doesn't have levels of corruption, administrative costs, or bloat that are *that* high compared to other districts. \n\nWhat they do have is a massive deficit to make up with their students from the lack of public funding in the other areas of their lives, which directly effects the private funding each student gets as well. They keyword in the story is that **they** spend ~$25k per student, the school districts, but the world is not so simple. The real number that decides how well a student does is how much everyone, public and private, spends per student collectively (adjusted for local and relative purchasing power). Baltimore's high spending doesn't come close to making up that deficit relative to average students across the nation.", "label": 0}
{"text": "This isn’t bad.", "label": 0}
{"text": "I doubt it. Those bags tend to rip at that weight.", "label": 0}
{"text": "Damn.", "label": 0}
{"text": "It's long, and powerful. You're in for quite a ride. Wish I could say it was a fun ride. \n\nIt's terrifying.", "label": 0}
{"text": "Classic", "label": 0}
{"text": "Graduation rates of African Americans are the lowest by far and they vote Blue heavily...", "label": 0}
{"text": "The lack of ADA compliancy was more surprising to me than the wrestling room.\n\nIt's 2024 and we have public schools that aren't wheelchair accessible?", "label": 0}
{"text": "I kind of find it insane that there's this kind of money being transported so casually with zero security. Though maybe that's the point to keep a low profile rather than the standard armored vehicles?", "label": 0}
{"text": "Can help but remember Pinky and the Brain: The Brain: Tomorrow night, Pinky, we will come up with a new plan. One that isn’t foiled by the atomic weight of gold.", "label": 0}
{"text": "This, if you halfway expect to survive. Theoden's when you want to lead your men to a glorious death.", "label": 0}
{"text": "Dang, you sure are tough! 😂 Nice edit btw. The first comment didn’t have enough *zing* to it. I care more about where I live than funding foreign wars. I’m so sad some rando from Portland doesn’t agree with me. What am I supposed to do with my life!?!?", "label": 0}
{"text": "FYI... per the link I posted... the fiscal year starts on October 1st...  So Q1 of the FY would be Oct-December.  Q4 would be Jul - Sept.", "label": 0}
{"text": "It's definitely cheaper to tear down and rebuilding. Mainly because most of these buildings probably contain asbestos.", "label": 0}
{"text": "A company can hire a lot of lawyers with $2MM on the line…", "label": 0}
{"text": "I was like \"wasn't it soccer?\" and then saw your comment. Thank you for your service.", "label": 0}
{"text": "Bam Margarine also isn't funny.", "label": 0}
{"text": "…you want to help people? Rules out your possibility to become a billionaire.", "label": 0}
{"text": "it's not that hard really. It's just a big number", "label": 0}
{"text": "I guess he was the younger of the twins.", "label": 0}
{"text": "This is why we need to decouple property taxes from education. Get everyone the funding they need. The kids can't help where they are born.", "label": 0}
{"text": "Two saints actually, Crispin and Crispinain.", "label": 0}
{"text": "Local jurisdictions do the bonds and local funding for schools.  If people are voting against bonds for schools in their district they have noone to blame but themselves.  Wealthier areas prioritize education and poorer areas simply do not", "label": 0}
{"text": "It's my understanding that he doesn't do much at SpaceX.  He gets on stage and flaunts the company, given that he's its CEO/CTO and largest shareholder.  Otherwise, Shotwell seems to be running the place, and the engineers are reported as doing what they can to keep Musk out of making the major decisions.", "label": 0}
{"text": "He blinks like the room is filled with cut onions.", "label": 0}
{"text": "Who the hell commits an armed robbery on foot? Like shit man even one of those electric scooters would have been a better getaway vehicle than running off into the woods", "label": 0}
{"text": "Looks like something from Russia", "label": 0}
{"text": ">restauration  \n  \nIs this when they turn it into a restaurant?", "label": 0}
{"text": "Hello /u/wowuncut\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "To be fair Arrowhead is a dump…and that’s according to my the Chiefs players", "label": 0}
{"text": "Aye, the design was more for keeping water out than preventing air from getting in.\n\nPeople have killed themselves drinking too much water. User error is amazing.", "label": 0}
{"text": "This right here is the problem, paying a superintendent massive bucks and then everyone else gets the crumbs left over.", "label": 0}
{"text": "Original Utopia had a better soundtrack, better cinematography, and better written characters (I couldn't care less about any of the US characters, Jessica Hyde was just annoying and mean 24/7).  \n  \nBut US Utopia had a way better plot structure, the UK one was kind of muddy and convoluted, the US one was way easier to follow.   \n  \nAnd for anyone who hasn't seen the original, here's a good example of their [brilliant use of color and score](https://youtu.be/IhPTUog6DWc?si=uFnGEyvf8-TEO79I).", "label": 0}
{"text": "Art Laffer as well, as someone with an econ degree the Laffer Curve was always a point of contention", "label": 0}
{"text": "The alternative is 8-10 k property taxes or more for lower average homes. \n\nThe reason these schools look this way is because most of them rely on federal dollars only or for a big part of their funding. \n\nFederal funding for education under normal circumstances is not enough. \n\nThose nice schools you see or think about are because families pay 10k annually in property tax. Those really nice cutting edge schools... They're paying double that for a nice house. Not a mansion or anything but a large, nice suburban home. \n\nThe system is broken and will fail in the next few decades. \n\nSchools need more and more staff members to deal with special needs students, increases in building codes, failing buildings that were built when shit was good. Budgets keep getting cut to operations funds to pay teachers as the heat is on districts to increase pay. More training is needed which means more employees to facilitate the training, that or third party consultants come in at a premium... \n\nIncreased pay is of course deserved but the bucket isn't growing. Taxes aren't going up relative to the needs of the community. So many of these 30+ year old buildings are failing. 50 year old buildings haven't seen large scale renovations since the 90s. And high paying districts are the only ones with well paid teachers and are fully staffed. \n\nSchools are absolutely drowning.", "label": 0}
{"text": "I think he was being sarcastic.", "label": 0}
{"text": "It's not low profile any longer, lol!", "label": 0}
{"text": "It's a consequence of capitalism not partisanism. The first people to get fucked are those too poor to defend themselves", "label": 0}
{"text": "Maybe the real heists are the hoists we made along the way.", "label": 0}
{"text": "Lol first thing I noticed \"I need to ring in and show ID like every visitor\" Dude what?, hey there is a no guns sign, double doors? METAL DETECTORS WTF!?", "label": 0}
{"text": "I wish public shools in mexico were haf as good as this one.", "label": 0}
{"text": "He should just run for president then.", "label": 0}
{"text": "😂😂 the internet had a field day", "label": 0}
{"text": "As a Nordick person I'm just looking at this with horror :<", "label": 0}
{"text": "So my kids high school - in Missoula Montana - the design of the building literally was a prison.  They took the blueprints and tweaked them as a school.  Keeping the concept of no ground level windows, concrete interior walls, and etc.  It's grim.", "label": 0}
{"text": "Y’all need to start hitting the weights.", "label": 0}
{"text": "World's #1 country y'all", "label": 0}
{"text": "that sounds like a refugee camp", "label": 0}
{"text": "Thank you for your opinions.\n\n\nSince I only hold a stance on pro life, I'll just respond to that.\n\n\nYour first claim is that I want to force women to give birth. That's some loaded rhetoric, but in the same sort of way that I think we should \"force\" members of society not to murder each other, then we should \"force\" men and women to not violently kill their offspring.\n\n\nYour second claim is that I don't care about quality of life. I'm not sure why you claim this.\n\n\nYour third claim is that I will \"bitch about women having kids when they shouldn't\" if their children end up in jail. I'm not sure why you claim this.\n\n\nYour fourth claim is that \"they\", and I'm not sure if you mean the women or their children here, but \"they\" should be sent to jail for life or executed either in prison, by police, or good guy with a gun.\" I'm not sure why you claim this.\n\n\nTo help you clarify, my pro life stance is that all innocent human beings should be granted the same human right to life regardless of their ability to defend themselves.", "label": 0}
{"text": "Tell me you don't understand how government works without telling you don't understand government works. Or maybe you're just a russian bot. Who knows on reddit anymore.\n\nFor anyone that *cares* to know, nobody is redirecting budget for schools and other social programs to Ukraine. The military aid that is sent to Ukraine is either them signing contracts with Ukraine for supplies (as in Ukraine is literally buying weapons on an IOU from America), surplus material that the US isn't using being sent to Ukraine, and even redirecting assets seized from Russian entities for their use. \n\nThere is literally no scenario where a school is not getting budget from a *local state goverment* to do repairs because of the war in Ukraine. If you are saying that, you are either purposely being malicious, ignorant, or both.", "label": 0}
{"text": "Same, like damn. I knew I grew up in a nicer area but still, this is terrible to see.", "label": 0}
{"text": "Not Missouri\n\nhttps://apnews.com/article/missouri-voucher-charter-private-school-f168a32bef3b616a6b284a2cc0882784", "label": 0}
{"text": "Did he name all the names, or did he just say there were problems and kept it real fucking vague?", "label": 0}
{"text": "You think forcing them on wilderness camps against their will is a solution? If you take someone's freedom away, you better have a good reason and these kids are not criminals, they have not been convicted by any court. \n\nAnd it's their parents that often force these kids into these camps. So whether they are troubled is not really established, since there is no oversight. This sort of thing should not happen and the fact that there is no oversight and anecdotes of criminal activity, it should be perfectly clear, that these should be shut down. These people are not professional therapists, or even wilderness coaches. It is just exploitation of sloppy governance where the victims are kids.", "label": 0}
{"text": "Rachel Dolezal's black brother, I see.", "label": 0}
{"text": "I liked it, but I was thinking if you could turn down the music a touch that would be for the best", "label": 0}
{"text": "I retired and moved to a small town. Before I moved the city built a 45 million dollar high school which was most due to enrollment issues from outlying small towns. I believe MN has a high standard when it comes to schools. Glad I was in MN when I went to school.", "label": 0}
{"text": "I wouldn't call having a mold issue \"character\". That's extremely dangerous and can lead to life long problems.  \nThe building aren't even that old, they're just either very poorly build or poorly mainteined or both. Nothing to be proud of to send your kids and educators into. \n\nGet a hold of yourself and fight agaisnt shit like this instead of just covering behind that weird \"tough\" guy charade.", "label": 0}
{"text": "It's not like you keep the money you know...", "label": 0}
{"text": "Trying to make this a Republican issue shows how ignorant you are about the tooic of education and spending. \n\n150 upvotes from idiots who clapped cause you dunked on a “team.”", "label": 0}
{"text": "You should probably know a bit more about other countries before making such claims. Confidently very incorrect here.   \nIf you'll never admit your system is rotten you'll never fight to fix it. It's really not good and it's not because of what other countries do or don't do. It's your own damn fault so own up and take care of your kids.", "label": 0}
{"text": "I’ll never understand allowing someone all the way into a “secure” facility BEFORE you search them for weapons.", "label": 0}
{"text": "\"values and funds\". If you fund it without tracking where those funds really go, then you don't value it.", "label": 0}
{"text": "It’s his face! He’s got an intrusive thoughts face.", "label": 0}
{"text": "The real villain here is that judge", "label": 0}
{"text": "Those who aid and abet crimes get charged for the same crime, and any extra crimes that are foreseeably a result of the principal crime. For example, if you drive a car for someone who robs a bank, you are guilty of robbing the bank too as if you went in and did it yourself. If they kill someone while robbing the bank, you're also guilty of murder even if you had no intention of hurting anyone. The mere fact that killing someone is a reasonably foreseeable result of armed robberies makes you liable if it happens.", "label": 0}
{"text": "As a Jackson County Resident, we pay a sales tax to help cover Arrow Head and Kaufman stadium. The Royals want to relocate, and have help paying for it. The Chiefs want money for renovations. It is bs.", "label": 0}
{"text": "Arrowhead Stadium is in Kanas City, Missouri… they are a Missouri team. The state of Kanas does not have an NFL team.", "label": 0}
{"text": "We all somewhat suspected that in the beginning.", "label": 0}
{"text": "well, as long as the Kansas City Chiefs get the taxpayer money for a new stadium first.  Thats the only non negotiable /s", "label": 0}
{"text": " If I had been at this show, I would have shit myself laughing.", "label": 0}
{"text": "Ah, typos on an iPhone = bad schooling.\n\nI’m glad it was at at least keyboard pedantry and not some cringe Fox News point about how liberal schools are failing wealthy cities etc", "label": 0}
{"text": "[The 1944 version](https://www.youtube.com/watch?v=qk_rPHoSc8w)", "label": 0}
{"text": "That seems like a remarkably useless demonstration... did anybody actually gain any additional comprehension from that demonstration?  Cereal pieces??? Okay how about BB's?  Grains of sand? Marbles???", "label": 0}
{"text": "You now have a dozen upvotes, that’s serious popularity.  You can screenshot it and show your friends.", "label": 0}
{"text": "Republicans: \"Socialism has been a complete economic disaster everywhere it's been tried!\"\n\nAlso Republicans: \"We should do more Reganomics!\"", "label": 0}
{"text": "How about we just not spend so much money creating the arms for us to have a surplus in the first place, which is paid for by taxpayer money, and invest in our educational system? Gee what a concept! \n\nYou're right, I'm a Russian bot.", "label": 0}
{"text": "Yeah that would describe something like the Lufthansa heist, and even then most of them got caught/killed.  \n\nThis robbery is like \"Show up around 6pm to this empty warehouse with open doors and 1 guard and collect 1.2M.  Also maybe bring a getaway vehicle\".", "label": 0}
{"text": "...Or Missouri \n\nThere's a reason your article says \"voucher-like scholarship program\" and then goes on to have all these details about how only very limited groups qualify and it doesn't cover most of the state at all.  \n\nMissouri has a tax credit ESA that is very limited.  It's not a voucher system and it isn't statewide at all.", "label": 0}
{"text": "Which one?", "label": 0}
{"text": "LOL I came here to say something about the blinking.", "label": 0}
{"text": "It’s a good thing this is in Kansas then.", "label": 0}
{"text": "Of course it went over my head, since it is from a single book of an author I don't particularly care for. It is not like Terry Pratchett's works are some western canon that everyone should be familiar with. I am fine with the books I read thank you.", "label": 0}
{"text": "Republican state", "label": 0}
{"text": "His grammar is awful. The school is a shit show too.", "label": 0}
{"text": "Sure, but this is Kansas, so how is that relevant?", "label": 0}
{"text": "Who is behind both of these groups of geezers? Very similar beats/production style. 2 minute songs. Obviously written by the same guy. Just what exactly is going on?", "label": 0}
{"text": "This is why you do heists without weapons. If you fuck it up the sentence is way lighter and you can try again lol", "label": 0}
{"text": "You think the same thing about Backseat Freestyle by Kendrick?", "label": 0}
{"text": "that comic was too mean to him", "label": 0}
{"text": "Yeah this whole segment sucks. It starts with a bunch of armed police surrounding a van. We later see he was arrested without any issues in a completely separate location much later and that van from earlier was most likely empty. Picture of the judge after announcing his sentence without any further context. And the most egregious….leaving out the weight of the money! \n\nLike I get it…. 7 months seems bizarre, but this was a plea deal. I get that the prosecutors asked for 15-20 years, but there’s A LOT that goes into sentencing. Not saying it’s right… but it strikes me as there being more to this story.", "label": 0}
{"text": "Ours did this at first, when the initial ones failed, they started doing staggered replacements at least. And did projectors that worked on white boards instead.", "label": 0}
{"text": "wtf, he just drops it after all that? Instead of just taking 1 bag? WOW lol", "label": 0}
{"text": "I honestly never got why bigger is better with the school system. \n\nI wonder if we went back to high schools that had 500 kids instead of 4000 how it would fair. I get that you'd have to sacrifice some things, but I just wonder if the over all attention and education would be better. If I remember right the one thing that makes a difference more than anything else with education is student teacher ratio, I assume smaller school could help.", "label": 0}
{"text": "Yeah people acting like it’s forced labor is silly. I’d rather build temp classrooms and help the community than making a bird house or something stupid.", "label": 0}
{"text": "Did you go to a school in a suburb? Schools get revenue via taxes and if the school is in a shitty area that’s poor, the school sucks. Big shocker. It’s like this in almost every city in America. The inner city schools (like this one) suck. The rich suburb schools are amazing. Kansas City is actually an amazing example of this.", "label": 0}
{"text": "I'm gonna assume you're ignorant and not one of those monsters paid by these places to sow doubt on their investigation and abuse", "label": 0}
{"text": "seems like it has the default minecraft song sampled behind it.", "label": 0}
{"text": "Always pains me to see how some people have had their opportunities deminished simply by living in a third world country and not getting the same opportunities as others. In this case it is even worse because the country is choosing to make certain parts feel like a third world country.", "label": 0}
{"text": "Hello /u/Blindkreaper,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Didn't even realise it was my cake day! Thanks", "label": 0}
{"text": "It’s not like you know what you’re talking about.", "label": 0}
{"text": "yea that's true that part surprised me for sure.", "label": 0}
{"text": "Gotta fund those Bibles and football teams ya know", "label": 0}
{"text": "I went to school in the same area as this video in KC. Now KC is not as bad as Florida, we only have about 2 months total of hot weather during the school year. But there was no AC, only computer rooms had AC.  Heating was radiators, people always getting burned touching the pipes.", "label": 0}
{"text": "Hello /u/Blindkreaper,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Private school voucher program doing its thing in KC.", "label": 0}
{"text": "Really? Which part of the Minecraft song?", "label": 0}
{"text": "This dude was on an NFL practice squad and couldn’t carry that more than a few yards?", "label": 0}
{"text": "Ugh I don’t get this, I’m not a parent and not planning to be one, but if you choose to be one how do you constantly send your kid away?", "label": 0}
{"text": "There are four big points to it-\n\n\n1: This takes decades of concerted effort. You can't let the kind of dumb people who scream, \"OK WE TRIED IT FOR TWO YEARS AND I SAW NO ONE ON A BUS THIS ONE TIME WE CAN STOP NOW I DON'T WANT TO SPEND MONEY ON PUBLIC TRANSIT WHEN I ALREADY PAY FOR MAH TRUHK!\" dominate the conversation.\n\n\n2: People who don't actually live in the area should not get to vote on and set policy for it. Frequent problem that crops up when suburbs are allowed to run their parent cities.", "label": 0}
{"text": "The [boo sailboat](https://youtu.be/metSo5FcbfI?si=5EH0wW-ElszkmqCY) story is my fave", "label": 0}
{"text": "How voluntary is it, when if you don't do it they fail you. So to graduate where I went you are required to pass a physical education class. The class required 12  hours of \"volunteer\" work. If you didn't get the 12 hours you couldn't get a grade and couldn't get a diploma without a grade in that course. Still bitter.", "label": 0}
{"text": "Is that for KCMO or KCK?", "label": 0}
{"text": "these things are still legal?", "label": 0}
{"text": "Oh. My. God.\n\nI had never seen this.\n\nI am dying right now.\n\nThank you for linking the video.\n\nI love you.", "label": 0}
{"text": "You're not wrong. He just couldn't handle it and passed out.", "label": 0}
{"text": "Is that a \"No Guns\" sticker at 5:27 ?", "label": 0}
{"text": "Yeah, having the prosperity of the schools linked to property taxes is not helping at all. We have a new levy on the ballot this year and I'm not sure how it's going to go. There was already a new increase voted in last year to build a new high school.", "label": 0}
{"text": "Man, what the fuck are we doing? How'd we let it get this fuckin bad?", "label": 0}
{"text": "I say!", "label": 0}
{"text": "the gun ban sign is more of a legal thing so people can't say \"I didn't kinow I couldn't bring my gun here\", The metal detectors are jsut security theater.", "label": 0}
{"text": "exactly. \n\ni know you’re just trying to argue but you’re unwittingly agreeing. ty", "label": 0}
{"text": "Even if these were regulated and their programs developed and corroborated by actual psychological experts, it's tough to say that the isolation itself does more good than harm.  There needs to be a way to ensure we are not failing these kids, and a designated professional to work with the parents and the kid may be the way to go.  As for funding, as with all medical and psychological treatment, it's a matter of political will, not money.  If we can subsidize a coal industry, we can help a family or two find their way with the knowledge we collectively share as a society.\n\nWe can make sure we aren't leaving kids to rot in the system, and make sure parents have the education and support they need to raise kids with love and not anger and fear.", "label": 0}
{"text": "I live (in Finland) across the road to a school that's about to be torn down because it's old and the maintenance costs are piling up. And I can tell you it's in a lot better condition than this one.", "label": 0}
{"text": "I don't get it", "label": 0}
{"text": "I trained to work there on site. Some of the stuff was actually pretty engaging. We took two kids into the forest foe a few days, taught them how to make fires, assemble a tent and various other outdoor activities. At night we did like team building activities and emotional training. \n\nBut it all felt kind of off. NONE of these kids wanted to be there. Most were from very rich families and the last place they wanted to be was in the woods for a few weeks. One of the kids I worked with was the son of a pretty big celebrity and was smoldering with anger the whole time.\n\nThe guy who ran the place almost made light and poked fun of the fact that many times kids try to run away at night, attack the staff, etc. \n\nMost of the actual employees seemed very nice, but the training was very quick and I'm not even a licensed therapist, I'm just a teacher, and they were going to put me in the field. Also they work like 7 days on 7 days off, which I think tricks a lot of people because it sounds great, when it facts it's horrific to do that sort of work for a week straight.", "label": 0}
{"text": "I did that in my training for one of those places, always thought it was more a torture for the children them an actual lesson", "label": 0}
{"text": "I do electrical, we got a job for an old catholic school to do a lighting reno. We bid 300,000$ over because we didn’t want it because it was a nightmare of shitty old brick and mortar with asbestos everywhere and ancient 347 lighting that they wanted to switch for low voltage modern LED. That job was being fucked, everything everywhere constantly crumbled, and we still lost money on that job even with the over bid", "label": 0}
{"text": "He named TONS of names and he even describes what he saw several times which amounted to seeing men and women tied up in rooms, being used as furniture, and active abuse.", "label": 0}
{"text": "It's like the Jets and the Giants not playing in New York", "label": 0}
{"text": "**SET LIST**\n\n* “Training Season”\n* “These Walls”\n* “Happy for You”\n* “Houdini”\n\n**MUSICIANS**\n\n* Dua Lipa: vocals\n* Matthew Carroll: bass\n* Adam \"Smiley\" Wade: drums\n* Alex Lanyon: guitar\n* Georgie Ward: keys\n* Ciara O’Connor: vocals\n* Naomi Scarlett: vocals\n* Sophie Galpin: glockenspiel, vocals", "label": 0}
{"text": "This school is still nicer than my old school", "label": 0}
{"text": "meh if you're gonna kill someone in America, do it with a car. probably get probation", "label": 0}
{"text": "Hah, I mean...not quite.  They still at least represent New York when they play.  Kansas City Royals/Chiefs don't have anything to do with the state of Kansas at all.", "label": 0}
{"text": "As others have mentioned, I grew up in the south and yea this place looks fantastic compared to what I remember. Far from \"heartbreaking conditions\" but definitely in need of renovations. And not just a coat of paint and some new trim, either.", "label": 0}
{"text": "These are the kind of judges we need to be voting out", "label": 0}
{"text": "Completely an anecdote.. but is my observations which align pretty closely with your own.\n\nI went to school in WA / OR through the 80s / early 90s.  The buildings were both around 60ish years old.  Both OR/WA went liberal in this same time period (Late 80s).  Every single school (grade/middle/2x high) I attended has now been knocked down and a new one built to replace it.  (I had not looked into this previous to this posting and found it interesting how closely it all matched up)\n\nLocally where I live now there is a larger liberal population and a smaller conservative one.  Its something like 70/30 that live on \"opposite sides\"  With the exception of 1 (Where the wealthy conservatives live) the other conservative area schools are all massively outdated much like the video.  The liberal area they are almost all relatively modern/new.", "label": 0}
{"text": "Vote the Red out, that's your only solution.", "label": 0}
{"text": "This is so nostalgic.", "label": 0}
{"text": "Urban schools usually have the most funding per student compared to suburban or rural students, yet urban students perform the worst on average.", "label": 0}
{"text": "This is the first ABK vid where I don’t get the joke. Do I have to watch more American penned British tv to see the difference to the real thing?", "label": 0}
{"text": "Doesn’t matter.  He still voluntarily gave them confirmation evidence.", "label": 0}
{"text": "Many nations have private education systems and do very well /s", "label": 0}
{"text": "Heart breaking? Yall are quite privileged lmao", "label": 0}
{"text": "The fact that you have a computer and internet while a Ugandan child is starving is a major red flag that we have a species have made a wrong turn.", "label": 0}
{"text": "This is the absolute best way to get your levy noticed. I wish my town would put something together like this when they are asking for a bond or levi", "label": 0}
{"text": "Americans will complain about a lot apparently.", "label": 0}
{"text": "Reverse DEI", "label": 0}
{"text": "Crazy that you still have such ignorant takes then! Very glad you're not teaching children in the US anymore at least.", "label": 0}
{"text": "Students are identified through the camera on the wall and buzzed in by the office. Parents have to go to the office and show and ID to pick up/talk to a student. Just like any other school.", "label": 0}
{"text": "I thought about running against gaetz", "label": 0}
{"text": "“Freestyle” can mean a number of things. While it is frequently used to describe an improvised performance, it is also used to describe a rap song without a chorus or hook.", "label": 0}
{"text": "Downtown KCK is a shithole. But its surrounded by an incredibly rich suburban metro on the KS side. Conversely, KCMO downtown is much nicer in most areas, but the suburban part of of the metro on the MO side is mostly.", "label": 0}
{"text": "Hello /u/mnk140296,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Kansas City has been run by Democrats for decades but ignorant redditors will still try to blame Republicans for this.", "label": 0}
{"text": "True, guess this is for that didnt suspect it.", "label": 0}
{"text": "It’s unfortunately pretty common. I’ve been enrolled in a handful of different schools before college (private and public), I believe 4 different from districts? Elementary to high-school it was all the same. I’ve used plenty of desks that had holes poked through them, duct taped volley balls, soccer fields with rocks scattered everywhere. And these were in middle class areas. The schools got more funding than most, but it still wasn’t enough", "label": 0}
{"text": "Popular sports are dumb af.  I want to see competitors haul bags from a vehicle up a flight of stairs into an apartment. Or push an extremely heavy shopping cart up an incline when it's icy. \n\nNone of this goofy: \"Oh let's throw and kick a weird shaped ball around and pretend it means something.\"", "label": 0}
{"text": "You will do the same things as always.  Moron stuff.\n\nYour failure to understand global policies that shape your daily life is astounding but not surprising and really at this point, it's quite expected.  You don't have the education or desire to make the world a better place.  You think all wars are bad and so do I.  But you don't know why the smart and civilized people on this planet support ukraine still.  They were Invaded.  \n\nBelieve me.  I love making fun of stupid people.  I can do it all day.  Please, take some time to understand the world outside of your closed bubble.", "label": 0}
{"text": "The consummate professional comedian. Dude has been consistently great for 30+ years. Think of a person you know who has a completely different sense of humor than your own, take them to his show, and you will both likely have a great time. That is how good he is.", "label": 0}
{"text": "Inflation, making cash theft more impractical ever day, since... forever.", "label": 0}
{"text": "Recently I was browsing Google Maps and looking at Russia. I happened to see pictures of the schools in some of the galleries taken by students/parents/etc. Some of them looked better than this.", "label": 0}
{"text": "All buildings get old. They build new schools and hang on to the old ones as long as they can. It's the way she goes. \n\nAnd the reality is most of the time, it's luck that picks which kids get the new school. \n\n4 or 5 of the richest neighborhoods in the area, one of them among the nicest in the state, sent their kids to my old rundown high-school instead of the 2 brand new 4 story super educational megaplexes that got built just 10 min away.", "label": 0}
{"text": "I can't help but wonder if they're worried about feds spinning it as \"drug money and guns\" and throwing the book at them. Remember this industry still isn't 100% legal federally.", "label": 0}
{"text": "That entrence looks so crazy.\n\nMultiple locked doors, no gun sign, metal detectors.\n\nWtf? I've seen prisons with less security.", "label": 0}
{"text": "Yuup. Both out in the country and in the burbs for me.", "label": 0}
{"text": "I went to middle school in a bunch of different trailers, I was so happy when I went to high school in an actual building.", "label": 0}
{"text": "Ahh thats a great insight! Definitely a possibility…", "label": 0}
{"text": "lol, you gotta love Reddit. The only place people like yourself can feel some sort of validation and self-worth. Couldn’t imagine telling you that you aren’t educated. Wild times we live in. Have a blessed day ✌️", "label": 0}
{"text": "It's worth a try.  This school wasn't run like a business and the results are sub par.  It couldn't hurt to see if focus on lernin'-per-dollar wouldn't yield better results.", "label": 0}
{"text": "I don't watch Fox News. Thanks for the assumption.", "label": 0}
{"text": "Have they been running the system for the past several decades?", "label": 0}
{"text": "My father was a superintendent at my district and championed vocational programs. There is a lot that goes into them between insurance liabilities, legal review, funding and extra teacher commitments. It looks exploitative at first glance, but after seeing everything that goes into them, it would be a lot easier to just pay a normal contractor and call it a day.\n\n\n\n\n\nVocational programs are an excellent way to give students a leg up on skills needed for real world job opportunities. We had a similar program where we used students as an IT Service Desk that I was able to participate in. Again, seems exploitative at first glance, but guess who has an IT career now?", "label": 0}
{"text": "No no, you see right bad left good.", "label": 0}
{"text": "Here [another school ](https://youtu.be/Xm4dy25VmCw?si=3xdSXum4-nzPG10E)", "label": 0}
{"text": "Yeah I get you, but honestly Im not going to do that.", "label": 0}
{"text": "Sorry.  If you say something stupid on the internet, you should expect to be corrected.  Uneducated people are being manipulated and the smart people of this planet need to stop sitting by and letting your words go unchallenged.  The future depends on it.", "label": 0}
{"text": "I'd expect the floor to be concrete and not stones but other than that I don't see an issue", "label": 0}
{"text": "The American writer essentially writes American dialogue and then does a pass to \"Britishize\" it, but misses key phrases and expressions that are American, because he doesn't know they're American. Then on top of that he adds phrases he associates with British English that's really just needlessly stuffy (\"I bid you good day!\")\n\nAmericanisms include:\n\n\"Reach out to you.\" \n\n\"Touch base\".\n\n\"Time to process\".\n\n\"I'm good\"\n\n\"Can I get a Sherry\" (\"Can I get a\" instead of \"Might I have\" + Americans assume Brits drink Sherry a lot I assume)\n\n\"Cut to the Chase\"\n\n\"Old Man\"\n\n\"Could care less\"\n\n\"Ballpark figure\"\n\n\"Raincheck\"\n\n\"Can't deal with\"", "label": 0}
{"text": "Oh no he's from good family. Idiot. Threw away his chances in the USA.", "label": 0}
{"text": "This country has intentionally destroyed the public education system for decades. It’s pathetic and embarrassing. We used to pride ourselves as a nation of academics, scientists, doctors, etc….. We were the go-to country for advancing things until one day they realized a country of educated people was a threat to corporations bottom line. Budgets destroyed. Reading, science, math, English, ALL the programs destroyed, under the guise of “my rights” and religion. For no other reason to keep the rich rich. It makes my stomach turn to see what the public education system as become. It makes me weep for the future. It makes me embarrassed to be an American, which breaks my heart.", "label": 0}
{"text": "He turned on the others.  Pretty simple.", "label": 0}
{"text": "In the states they call it affluenza", "label": 0}
{"text": "No, there's no failing them. They just stay and hang out with the Sped teacher and do basic study hall stuff. A lot of them jump at the chance to go do it because they get to socialize and roam the school.  Honestly the main reason I'm sort of against it is I think we should have it be more Japanese style where all of the students are responsible for cleaning up around the school.", "label": 0}
{"text": "Jfc i don't wanna watch 20 mins of an ai narrated video just to watch an idiot get his comeuppance.", "label": 0}
{"text": "What's a Dua Lipa?", "label": 0}
{"text": "If Superman wasn't born in Kansas, Kansas would have nothing.", "label": 0}
{"text": "Thank you, I won’t even bother clicking on it.", "label": 0}
{"text": "Oh… you must have been his lawyer. Seeing as how you know so much about the case and the laws of my country.", "label": 0}
{"text": "This is the actual short film: [https://www.youtube.com/watch?v=9uCVzXH5cLc&t=3s](https://www.youtube.com/watch?v=9uCVzXH5cLc&t=3s)", "label": 0}
{"text": "Yeah, cops here are only familiar with one type of cast.", "label": 0}
{"text": "America's infrastructure in general is a monument to deferred maintenance. Bring someone from the 50s to modern day Flint, tell them we lost the fold war, and they'd believe you.", "label": 0}
{"text": "Castration", "label": 0}
{"text": "Because I COULD care less, not everything is maximum or minimum. I care but only just a little bit", "label": 0}
{"text": "I'm also a Floridian. For me, the portables were far nicer than the rest of the school because they weren't filled with mold and bugs. The walkways leading to them were made of solid wood rather than peeling, dirty, linoleum. The walls on portables were not defaced with gang tags, racial slurs, and human feces like the rest of the school. \n\nMy parents were angry about me being forced to take classes in the portables. \n\nI remember in algebra class in the old building a ceiling tile just fell out right square onto the desk next to me, splashing the girl occupying it with a substance that smelled like rotten pumpkin. I will never forget that smell.", "label": 0}
{"text": "I feel bad for the kids but this is a direct result of who you vote for. 30 years of voting in republicans for the house and senate, what did you expect?", "label": 0}
{"text": "Paul Walter Hauser spotting!", "label": 0}
{"text": "Don't thank that idiot lol he straight up lied. The video has no narration besides the first 10 seconds", "label": 0}
{"text": "Fair. I saw 20 mins and heard narration and clicked out.\n\nStill 20 fuckin mins tho. Just show the interaction and the consequence.", "label": 0}
{"text": "A real-life example of the [Vimes' Boot Theory](https://en.wikipedia.org/wiki/Boots_theory).", "label": 0}
{"text": "It doesn’t imply a little bit though, it’s open to mean anything from a tiny bit to the absolute most ", "label": 0}
{"text": "I hate these fucking programs and any participating party associated with these legal loophole torture camps.", "label": 0}
{"text": "Damb, tiktok has really ruined some brains.", "label": 0}
{"text": "Hello /u/Nickatschool,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "\"I'm not even fishing\"", "label": 0}
{"text": "But India is from good family and only did the needful.", "label": 0}
{"text": "Hello /u/BrilliantEngine6378,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "More like TOES", "label": 0}
{"text": "That's the joke...", "label": 0}
{"text": "Me too! I have never seen someone blink like that.", "label": 0}
{"text": "This brings back some memories... playing rail only lobbies all the  time", "label": 0}
{"text": "I’d be angry too if I lived in the fentanyl shit-hole that is Portland. 😂", "label": 0}
{"text": "He is the principal, his first year too.", "label": 0}
{"text": ">  Also keep in mind that 2025 is the peak of the student population. \n\nMy area has been hemorrhaging students since covid. We're already starting to close schools.", "label": 0}
{"text": "I'm not sure your point. America spends more on education than anyone else. That's not a flex. That's a fact. If our outcomes were better, maybe it would be a flex, but the context given by this video is pretty clear: our outcomes are shit.", "label": 0}
{"text": "Somebody who is dumb enough not to realize that they can get his DNA from the inside of his gloves is dumb enough to not consider how heavy the money is going to be. This guy is literally a walking PSA about CTE.", "label": 0}
{"text": "This and the \"sieze the gap\" quote from it's always sunny in Philadelphia are my go to's while driving", "label": 0}
{"text": "You misunderstand me. America's system is terrible. The outcomes are awful. And the programs are still expensive. I'm not defending the schools. I'm just explaining where the money goes.", "label": 0}
{"text": "Hello /u/t0Mvtji,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Zero trust network security model is similar.  Don't trust anything implicitly even if it's been validated before and is already within the network.", "label": 0}
{"text": "I know the one where the woman says \"I made 1000 bucks and one nickel last night giving blow jobs\" and her husband says \"who gave you the nickel\" and she says \"all of them\"", "label": 0}
{"text": "No it's for Kansas, Kansas City, Kansas Public Schools\n2024-2025 Budget General Information USD\nhttps://www.kckschools.org › view\n\nThe statistics for Missouri aren't as shocking", "label": 0}
{"text": "Lol third world.", "label": 0}
{"text": "Is this Kansas City, Kansas or Missouri? I have to assume Kansas and that it’s a residual effect from the Kansas Experiment. The “Republicans wet dream” as it was described, where they cut taxes as low as possible to prove that the money would trickle down and improve the state. \n\nWhat happened was roads went to shit and became undriveable, schools went to shit, everything went to shit. Because the government had no revenue and they had to slash budgets elsewhere. Because the money didn’t trickle down to generate anything off the little bit of taxes they had remaining after the law went into effect. \n\nThe governor of Kansas left office as one of the most hated governors in the nation…..so naturally Trump invited him to his administration because he was one of the “best people”", "label": 0}
{"text": "All can think about now whenever I see these two guys is how they're not as close friends anymore.", "label": 0}
{"text": "One of the greats.", "label": 0}
{"text": "Only thing that came to a surprise to me just from when I went to a relatively large high school in the north east, was how bad the gym condition is and the safety vestibule. I went to HS 15 years ago, and we had metal detectors, but that was it.", "label": 0}
{"text": "Sounds like a South Park episode", "label": 0}
{"text": "Remind me again why we need to suck more money from the public school system to hand to private schools? ", "label": 0}
{"text": "The single best investment we can ever make is in education.\n\nNo kids but please tax me to make our next generation healthier, smarter, and happier.", "label": 0}
{"text": "Hey, where are the eggs?", "label": 0}
{"text": "The body is bad! The body is not good!", "label": 0}
{"text": "English muufin", "label": 0}
{"text": "Trailers are pretty common in well funded districts with a booming student population where they cannot issue bonds and build fast enough, but they’re also common in poorly funded districts because they’re a cheap way to add capacity.", "label": 0}
{"text": "I haven’t seen oh Mikey videos in so long. These are so awesome. The tutor one is just hilarious.", "label": 0}
{"text": "... wow, those guys are *not* good at this...", "label": 0}
{"text": "For those not in the US, this entirely depends on state and town. Most schools in the US are paid for through primarily town taxes, and then some might get some state funding on top. So some places do prioritize schools and have great funding. Some have little funding, even if they are in the same state (or even same city if the city is big enough). This also is why a lot inner city schools are in rough shape, because the money is often collected in property taxes, and that doesn’t scale well with high density housing, and if the residents don’t have much income, they aren’t paying much in taxes through other means.", "label": 0}
{"text": "It could have been turned into bitcoin and hidden or put into other accounts that can't be touched.  Had a friend in college whose dad got busted for embezzling 10 million from a dealership he ran and when he got busted only 4 million was taken back.   The rest was hidden or in his mothers name some how.  The friend swears it was a lot higher on both numbers but those are the numbers reported by the news. So, it's possible to hide money from the police.", "label": 0}
{"text": "I think somebody pushed her, maybe not to kill her, but to bully her.", "label": 0}
{"text": "Hello /u/Ok_Internal_1732,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Well. They did recover most if not all of the cash. Lol.", "label": 0}
{"text": "Hello /u/ccnakenya,\n\nThank you for your submission. Unfortunately it was removed because it is a link to Facebook.\n\nTo protect users' privacy, links to Facebook are not allowed on /r/videos.\n\nTo have your post accepted, if you can, find or submit a copy of the video on another website like YouTube or Vimeo and resubmit it here. [See this page for more information](https://www.reddit.com/r/videos/wiki/automoderator/p/c7).\n\n#No exceptions whatsoever.\n\nFor more information and/or assistance, [click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c7).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "go look at public school systems. not colleges", "label": 0}
{"text": "Yes these are private highschools as well. You have to pay a lot of money to get good education in California.", "label": 0}
{"text": "Yes. This is deplorable. I’m 33 and have never seen or been to a school this old and eroded.", "label": 0}
{"text": "It’s like literature club for men. “the symbolic value of the ball is ourselves and the posts are the metaphor for how hard of a struggle we must go through to make it.” Or sum bs", "label": 0}
{"text": "At least in my state (CA) the use of a firearm in the commission of a crime is a serious felony in and of itself.\n\n  \nWere I to take a guess, he gave them something in return: turned state's evidence.", "label": 0}
{"text": "These include private highschools. Go look at actual public highschools and its insane the difference, not including universities.", "label": 0}
{"text": "360p? Unknown production house? This is the original cast/family though and it’s on his instagram. Something’s weird about this, kickstarter incoming?", "label": 0}
{"text": "I've also lived in North Hollywood and then in Austin Tx for highschool, the difference was insane.", "label": 0}
{"text": "I've also lived in North Hollywood, CA and then in Austin Tx for highschool, the difference was insane.", "label": 0}
{"text": "Hello /u/Jessicen,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "[cumtown](https://youtu.be/mj_aMNz0oVU?t=20)", "label": 0}
{"text": "It will NEVER stop being BASASS how people proudly proclaim their ignorance for giant pop stars in a comment thread about said artist.", "label": 0}
{"text": "Prayers and Bibles is all they need", "label": 0}
{"text": "WTF can a bunch of really rich people each adopt a school so the students can fucking learn?", "label": 0}
{"text": "I binged the whole thing today and I feel like I've been hit by a truck", "label": 0}
{"text": "I gave you a source, now you give me a source or shut up.", "label": 0}
{"text": "The fact everyone is downvoting this is insane to me. Kids these days man. I’m old enough to remember smoking brick weed or “beasters” They don’t understand this ish isn’t weed. There’s no telling what is in it.", "label": 0}
{"text": "Reminder in Kansas in 2012 they passed a bill that eliminated income taxes for businesses that lasted until 2017 and cost the state nearly a billion dollars in tax revenue. This is the aftermath of Republican ideology. And guess what? Apparently they learned fucking nothing because they just passed another major tax cut bill in June of this year.", "label": 0}
{"text": "You know this is a sketch right?", "label": 0}
{"text": "Hello /u/chriswilliams1\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Well now that the cockpit in large jets are locked tight, an event like this will get a lot more interesting.", "label": 0}
{"text": "I want you to search in this sub and find out how many posts are there where the nationality of the perp is specifically mentioned in the title.", "label": 0}
{"text": "Fun fact! Sam Brownback's mom was an elementary school teacher when I went to school. She was really nice. I grew up about 15 minutes from where he's from.", "label": 0}
{"text": "This is, I'm aware, going to sound like the stereotypical old person's take. *But*, I went to a school many years ago with no AC, and radiators that were problematic. We didn't go to school in the hot summer, opened windows in the early fall and late spring, and dressed appropriately in the winter. Much of this video seemed like it was focused on things that don't affect students in the way they're portraying. Of everything, the moldy, flooding basement seems like the biggest concern.\n\nThe idea that every school has to be a fortress to keep intruders out, or in, seems weird to me. It strikes me as the sort of \"safety hysteria\" that new parents seem especially prone to. \n\nSo how to rank concerns in a school is politicized, prone to bias, and beyond my ability to have a full, fleshed out picture of. But as an old man, the focus on aesthetics, and things like exposed cables seems secondary. Schools are utilitarian spaces, not fashion contests.", "label": 0}
{"text": "The only ones I have sympathy for are the children.", "label": 0}
{"text": "So I've renovated highschools before. There is a *lot* of work that would need to be done, but it would be possible.\n\nOf course by the time you did it would be cheaper to build one from scratch and up to modern code.\n\nDoesn't mean they need an elevator when a ridiculously long ramp would be cheaper.", "label": 0}
{"text": "I have an idea! Let’s abolish the department of education. /s. This is bullshit. Our kids deserve better", "label": 0}
{"text": "No doubt. I wonder what came of the bill renewal in September. We always wanted weed because it was a plant that grew out of the ground. None of that chemical shit. But here we are. So many people willing to but chemical laced garbage in their body. Fuck em.", "label": 0}
{"text": "Got in a fight and LOST", "label": 0}
{"text": "you seem like a useless bot", "label": 0}
{"text": "How is that? And why did you edit and not reply?", "label": 0}
{"text": "Yeah. Public schools need to eat less avocado toast.", "label": 0}
{"text": "Stevenson isn’t even a particularly wealthy school district compared to lots of the surrounding areas. New Trier is one of the nicest districts in the country.", "label": 0}
{"text": "It may be the lighting from the interview setup tbh. They could be using some lights that are irritating his eyes.", "label": 0}
{"text": "and he also clearly trains in wrestling or some form of martial arts or something. I wrestled with my wrestling friend in high school once and it was humbling", "label": 0}
{"text": "Rich people are always going to find ways to make their kids schools nicer. Most of the playgrounds around my area are bought with money from PTO fundraising along with bounce houses, popcorn machines, etc. \n\nIn the best case this is a case of a rising tide raising all ships; this year our PTO bought all the school supplies for teachers so parents didn’t need to buy anything, which helps the low income families way more than anyone else. ", "label": 0}
{"text": "...good?", "label": 0}
{"text": "This link isn't about private schools. ", "label": 0}
{"text": "It’s so fucking dumb too. Asking “what’s a” instead of “who is” just makes them sound like a dumb fuck who doesn’t like people enjoying life.", "label": 0}
{"text": "Sure it was. I totally believe you. ", "label": 0}
{"text": "Canadian chiming in. My old high school I went to in the 90's is now an empty building on account of the high levels of asbestos.", "label": 0}
{"text": "\"meticulously planned\" but didn't have a getaway car. \n\nalso, the sheriff saying \"every inch of his body was covered head to toe in black\" \n\n*immediately cuts to him wearing a purple balaclava that shows the entire top of his face*\n\nAlso, his accomplice is dumb af lol", "label": 0}
{"text": "Yes. My understanding is that this video was produced prior to a bond request that did fail to pass. KCMO has a bond request in the spring, and it hasn’t been able to pass one since the 1960’s. It’s the only district it the metro area without a capital improvements bond. It’s embarrassing", "label": 0}
{"text": "Year 1: we need 6 more classrooms. We can build 3 portables for 100k each or bulldoze and rebuild the school for 50 million. The added sq footage maintenance and utilities will be $500/month more expensive with the portables. Decision: portables. \n\nYear 2: we need 6 more classrooms. We can build 3 portables for 100k each or bulldoze and rebuild the school for 50 million. The added sq footage maintenance and utilities will be $500/month more expensive with the portables. Decision: obviously portables. \n\nYears 3-15: same decision. \n\nAfter 90 portables it probably would have been wiser to bulldoze the school. But the decision to build the portables was always way cheaper, didn’t require the school to be shut down for 2 years, and still might have been cheaper overall based on time value of money. \n\nYou’re massively over-estimating the cost of trailers, over-estimating their comparative maintenance and utility cost and under-estimating the cost and impact of rebuilding or majorly remodeling the school.", "label": 0}
{"text": "Oh no, better- staph infection.\n\nThat's what went around at my school, anyway. Every year there would be a handful of wrestlers out because of that.", "label": 0}
{"text": "So what is the purpose of a prison if you continue to pay for your original crime even after serving?", "label": 0}
{"text": "Well, Europe figured out Fascism = bad almost a century ago. We thought we give it another go I guess.", "label": 0}
{"text": "Wow.. this is horrendous. How can you not invest in the kids throughout the whole country!!!", "label": 0}
{"text": "That's wild that they didn't check one of the most dangerous places. Maybe lying though, who knows", "label": 0}
{"text": "A single Tomohawk missle costs 2 million. \nImagine how much 2 million could do for a school, or school system. \n\nThe USA has over 4000 of them. They fired 800 in 2003 alone. \n\nAnd the USA is building NEW versions, and what do they do with the old? Just dipose of them. They throw a 2 million dollar missle down the drain. A drain that costs several 10s of the thousands of dollar to dipose of each missle.", "label": 0}
{"text": "you're using act test scores to gauge public school system education?https://www.forbes.com/sites/chuckdevore/2018/10/31/california-vs-texas-education-comparing-the-two-states-1-in-5-americans-call-home/\nFor low income students, Texas was first in the nation, with an 85.6% graduation rate compared to California’s 15th place with a 78% graduate rate for low income students", "label": 0}
{"text": "That version of  Happy For You is something special. She’s got one of my favorite voices of the new generation.", "label": 0}
{"text": "Nail, meet hammer. I think there is also the problem of needing the funds to build a new school, but the annual budget can't afford it. It all just comes down to incompetence and short sighted idiocy. The ones who suffer are the teachers and students, not the administrators.", "label": 0}
{"text": "\"🎃👻 Just in time for spooky season! Check out Monster Smash, an original Halloween anthem where classic monsters like Dracula, Frankenstein, and even some notorious figures like Diddy and Danny Masterson come together for a night of debauchery. It's a twisted take on the classic monster mash-up with some edgy humor thrown in. Perfect for fans of horror, satire, and all things Halloween. Give it a listen if you're ready for a monstrous good time!\"", "label": 0}
{"text": "Look around you. Can you really not find an image in your room? On a book, a magazine, a deck of cards, on your computer screen, a photograph, a doodle a matchbox, a logo for a company of a product somewhere.. Not a single image anywhere?", "label": 0}
{"text": "Graduation rate doesn't mean anything, they can just graduate everyone if they want.", "label": 0}
{"text": "Costume?", "label": 0}
{"text": "It's American vernacular put in the mouth of someone British.\n\n\nThe implication that American writers, when writing for characters from other countries, don't take account of the fact people say different things in different countries even if they're all speaking English.", "label": 0}
{"text": "What does bombs have to do with 9/11?", "label": 0}
{"text": "KCKPS spends $16k per students.  I'm the midwest you can get an incredible private education up to high school for that.  It's also about two-thirds of a great private high school.\n\nSo as usual, it's not a funding issue.", "label": 0}
{"text": "This girl's damned talented. And those band mates and backup singers are spot on. Yeah!", "label": 0}
{"text": "the classic, keep kids dumb, dumb kids become dumb adults and vote dumb. Part of the plan in some states.", "label": 0}
{"text": "I don't recognize our schools anymore. I graduated high school in 1983, and I could waltz on and off the campus at my pleasure. Now they seem like prisons. The local high school looks a lot like the prison from Shawshank Redemption.\n\nAnd I really feel for the guy at the start of the video. I generally take a dim view of school administrators, but he is serious about his job, and seems like a good person. I wish he had the resources he needs.", "label": 0}
{"text": "i assumed that was more of a \"so what even is a dua lipa? like what's the name even mean\" than that. but it happens often enough like you say that it could have been that too.", "label": 0}
{"text": "Population in Kansas is like 3 million so taxes revenue isn't there compared to say Texas where population is like 30.5 mil", "label": 0}
{"text": "Your comment literally makes no sense because it’s not multiplayer. Multiplayer games also definitely weren’t “smoother” than they are now - if anything it was the opposite unless you had LAN access. 🤡", "label": 0}
{"text": "As a Canadian, the state of the school isn't great, and that certainly stands out. I grew up in the Canadian province which usually ranks last in education, and all the schools I went to (which were in a semi-rural area) were in much better shape than that, and remain so. But I can imagine the poorest schools in Canada would be similar.\n\nWhat stands out most is the very start of the video, where there's this multi-stage security airlock process for getting into the building, the metal detector and the talk about how easy it would be to hop the fences.\n\nMy middle school was completely unfenced in on every side, and had probably....10 different exterior doors which were always unlocked during school hours. I believe this remains true, decades later. What America's relationship with guns have done to their schools is probably invisible to a lot of Americans, but is sickening to me.", "label": 0}
{"text": "I thank you for looking it up, looking it up through KDSE shows a breakdown of where the money goes. About half of the 2023 budget was instruction. https://kansasopengov.org/databank/school-spending-per-pupil-database/", "label": 0}
{"text": "Should've used up the motorized zipline slot.", "label": 0}
{"text": "I’m glad you thought so!", "label": 0}
{"text": "Its the same reason why we can applaud Scandinavian prisons for their great care of inmates while demanding the death penalty on Harvey Weinstein and Diddy in the same screen scroll.\n\nWe care more on the moral fulfillment for justice and vengence rather than the real life implications of them.", "label": 0}
{"text": "No I only posted it. I couldn’t focus long enough to watch a 90 second video or build a 200 watt police siren to yell at people. I just found the go pro footage and felt like it belonged here", "label": 0}
{"text": "I think the guy may have genuinely believe he stopped, but that pushed the limits of the (already illegal) California Stop so far that I don't think anyone seeing it from the outside would ever recognize it as stopping at all. \n\nDude needs to learn what \"stopping\" actually is.", "label": 0}
{"text": "He wasn’t even a teenager.\n\nHe was 12 IIRC.", "label": 0}
{"text": "Where is this?", "label": 0}
{"text": "You talking about Kat’s interview from 9 months ago?", "label": 0}
{"text": "Don't send your kid to these things there is zero insight and they will torture them without overisght", "label": 0}
{"text": "Why do you think that?  Just because they dont work together as much anymore?", "label": 0}
{"text": "Hello /u/Lincolnmagalhaes,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "the most accessible intro to the rabbit hole ive found is the elan webcomic, if youre interested", "label": 0}
{"text": "Hello /u/Lincolnmagalhaes,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Not a thing to be proud of, imo", "label": 0}
{"text": "Thanks for agreeing with me but I don’t think anybody suffered necessarily because of portables. We had portables, they were nice. And you can move them!", "label": 0}
{"text": "It's like watching drunk people hit each-other with broomstick.", "label": 0}
{"text": "But I’m sure this will change when Trump become’s the president right?", "label": 0}
{"text": "Hello /u/I_FUCKIN_LOVE_BAGELS\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Couldn't even call that a rolling stop. Dude barely owed down then doubled down because he couldn't handle being called out publicly.", "label": 0}
{"text": "Me and my husband always called her “Ms. Two Lips” 😁", "label": 0}
{"text": "Also Canadian here ... the \"No guns\" stickers everywhere is WTF.", "label": 0}
{"text": "Also segregationists prefer that schools are funded via local property taxes.", "label": 0}
{"text": "I would love to hear Dua Lipa do a cover of Sade’s Smooth Operator.", "label": 0}
{"text": "I don't think OP ever insinuated that the truck driver stopped or wasn't in the wrong.... are you okay dude?", "label": 0}
{"text": "That guy was way out of line.  He could’ve killed somebody.  And talk about a poor attitude.  Back in my day, the entire neighborhood would’ve lent a fist to punch that fella’s lights out.", "label": 0}
{"text": "Hello /u/ecc315,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "I also attended schools with above average quality of portables. I think I had around eight or more classes between 5th and 12th grade, so not a ton, but not none. I can understand portables being used as stop gaps for an unusual increase of students over a few years due to redistricting or other causes. It just isn't financially prudent.", "label": 0}
{"text": "Woooosh", "label": 0}
{"text": "tldw: unnecessarily hand crafted despite faster alternatives being available.", "label": 0}
{"text": "Yes... it's a TV show. There are costume designers who decide what costumes the actors wear.", "label": 0}
{"text": "sarcasm\nnoun\nthe use of irony to mock or convey contempt.", "label": 0}
{"text": "East coast", "label": 0}
{"text": "SOME places? Literally not one city that has a stadium prioritizes their schools over said stadium.\n\nI, in fact, challenge you to prove me wrong.", "label": 0}
{"text": "I mean get em for a clickbaity title, but clearly their sarcasm went over your head", "label": 0}
{"text": "Mayors don't control schools in KS or MO", "label": 0}
{"text": "What is the driver saying? ", "label": 0}
{"text": "It's a provocative question, dudum. He knows the content of the video, he posted it. The title is meant to be ironic. You're projecting the same energy as Mr Didn't-Stop", "label": 0}
{"text": "As an Australian I canny imagine the outcry of any of our schools were like this one. Even working in remote indigenous schools i have never seen one as bad as this is, and the Americans are all saying it looks normal? ", "label": 0}
{"text": "Hello /u/Complete-Teach1031,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "I thought the California roll was bad but several other states are significantly worse. In Colorado, half the drivers only slow down to 10 mph and then continue. It’s ridiculous there", "label": 0}
{"text": "he is defending the driver when he says he didn't have the time to \"**build a 200 watt police siren to yell at people.** \"  \n\nThat's him saying \"look at these crazy people\" but... there are in the right, you stop at stop signs", "label": 0}
{"text": "The movies make this seem to easy", "label": 0}
{"text": "https://elan.school/\n\nhttps://en.wikipedia.org/wiki/%C3%89lan_School\n\nElan wasn't the first and it won't be the last, unfortunately, terrible parents.", "label": 0}
{"text": "I agree. This special, “I walked on the moon” is one of the best ever", "label": 0}
{"text": "Life is like a box of chocolates.  I'm not sure I would be the one to confront people that disregard stop signs, and it's off-putting that traffic enforcement is left to the community.  BUT I'm behind these people doing what they can to make their neighborhood safer.  I just hope it doesn't turn into something awful for them.  Some people don't know how to people these days.", "label": 0}
{"text": "Must be your school specifically. AC was never an issue in both middle and high schools in Toronto.", "label": 0}
{"text": "And to be honest, as an American school teacher, this school's security measures are absolutely unacceptable. Though, not their fault. But the security vestibule should have a security person right at the door. To allow an adult into the building and for them to travel freely before actually checking in with the office is unacceptable.", "label": 0}
{"text": "Barefoot is an odd foot ware choice.", "label": 0}
{"text": "Definitely gonna go home and hit someone now", "label": 0}
{"text": ">Every gun that is made, every warship launched, every rocket fired signifies, in the final sense, a theft from those who hunger and are not fed, those who are cold and are not clothed.\nThis world in arms is not spending money alone. It is spending the sweat of its laborers, the genius of its scientists, the hopes of its children. The cost of one modern heavy bomber is this: a modern brick school in more than 30 cities. It is two electric power plants, each serving a town of 60,000 population. It is two fine, fully equipped hospitals. It is some fifty miles of concrete pavement. We pay for a single fighter with a half-million bushels of wheat. We pay for a single destroyer with new homes that could have housed more than 8,000 people. . . . This is not a way of life at all, in any true sense. Under the cloud of threatening war, it is humanity hanging from a cross of iron.\n\n-Dwight Eisenhower, 1953", "label": 0}
{"text": "It's not just shut-ins, it's also people who can't do anything due to illness, etc. I had to use them for a month post surgery. Not the nest situation but it kept me going.", "label": 0}
{"text": "I mean you know this is just basic weather/climate and we can just look it up?\n\n* [The *average* temperature in the hottest month in Kansas City is 88.3F \\(31.3C\\)](https://en.wikipedia.org/wiki/Kansas_City,_Missouri#Climate).  \n\n* [The average high temp in Toronto in the hottest month is 80.6F \\(27.0C\\).](https://en.wikipedia.org/wiki/Geography_of_Toronto#Statistics)\n\nFor humidity you can look at average dewpoint which in the hottest month (July) for Kansas City is also a very humid average of 65.8F (18.8C) dewpoint - making the average July's day's heat index 91F (33C).  \n\nI can't find total historical data for dew point for Toronto but this year the highest humidity month was July where Toronto had an average dew point of 62F (16.7C). \n\nSo both lower temps and lower humidity on average in the summer.", "label": 0}
{"text": "Sad", "label": 0}
{"text": "They do have an emergency latch. Now was theirs broken, that is for the investigation.", "label": 0}
{"text": "You just posted a month where neither boards have school...\n\nAnd the difference between 27 with humidity and 30 with humidity is negligible.", "label": 0}
{"text": "Backup harmonies were amazing", "label": 0}
{"text": "Kansas City, Kansas* school tour. This is the same district as the Top High School in KS.", "label": 0}
{"text": "Based on your camp:  the average commenter's vision of these camps being centers of abuse ioverblown, about right, or underrated?\n\nWere any kids there fully voluntarily?", "label": 0}
{"text": "Parents got what they wanted I guess. Would rather ship their child off to \"boot camp\" than actually parent them.", "label": 0}
{"text": "I'll have to remember this next time some amoeba tells me that \"taxation is theft\"", "label": 0}
{"text": "The general quality of delivery drivers is fine, we’re just all on the internet constantly and are constantly exposed to the isolated incidents of this happening. It’s a confirmation bias that is pervasive on the internet. Same thing happens with violent crime. A lot of people in America think there is some rampant, wild violent crime wave when the fact of the matter is violent crime has been down in America for years.", "label": 0}
{"text": "LOL.  \"Hey, don't forget those pennies!  I ain't rich or nutting, I need it ALL!\"", "label": 0}
{"text": "If the momentum is still being carried forward, the object never stopped moving. \"California stop\", \"rolling stop\", etc are nothing more than phrases that attempt to move the goalposts on one of the fundamental laws of physics.\n\n\nAlso, agree that guy barely slowed down. The notion that this could even be called a rolling or California stop is insane.", "label": 0}
{"text": "2 ep into severanve,  i like the vibes, the camerawork, the mystery.  Its just so slow for my millennial mind ... i get bored!", "label": 0}
{"text": "I have a gang of ferals in my work parking lot and three of them do this. Well, two now, I took one home, but she still acts like this.", "label": 0}
{"text": "He got paid for delivering the food.  Some people are just terrible.", "label": 0}
{"text": "https://youtube.com/shorts/LgjqrU0zrcU?si=oqCjZYxfRfOp_AhU", "label": 0}
{"text": "Wtf was with the giddy accomplice outside? ", "label": 0}
{"text": "Hello /u/901bass\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Hello /u/keejus,\n  \nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 4** - No Indirect Links\n\nTo have your post accepted, take out `&list` and anything that follows it out of the URL and resubmit it.\n\nIf you think this isn't correct, and for more information and/or assistance, please [click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c3-1).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "M M M M MONSTER KILL ^KILL^^KILL", "label": 0}
{"text": "**😄**I mean it's not a super serious comment either. Also don't want people to conflate a California rolling stop with what the dunce in the truck did.", "label": 0}
{"text": ";)", "label": 0}
{"text": "I have taught at downtrodden CA schools for 15 years. These schools make the dumps I taught at look like palace. What the hell is wrong with the midwest?", "label": 0}
{"text": "I’d like to think it was another door dasher who stole from him. Then #2 ran to his car and sped off, only for a third door dasher to emerge from the backseat, grab the food, and jump out, right into a bear trap operated by a fourth door dasher. \n\nIt’s door dashers all the way down", "label": 0}
{"text": "Obviously they’re in a city! u/Mharbles has never been to the city, or any city. They live in a haystack just outside of their closest municipality census line. So, yeah. Inner-or around-any sorta-city.", "label": 0}
{"text": "Lol no", "label": 0}
{"text": "I’m already preparing myself for the yearly wave of Halloween candy ragebait videos coming up.", "label": 0}
{"text": "I just appreciate the weird look people give me when I tell them the only child to die to poisoned Halloween candy in recorded history was murdered by his father who was trying to use the “Halloween candy” as an alibi.", "label": 0}
{"text": "There's no way he believes that unless he has a brain injury. People are just wildly defensive these days because insecurity is at an all-time high.", "label": 0}
{"text": "At least they have Bibles.", "label": 0}
{"text": "Nah it was a Simpsons.\n\n\"Let the bears pay the bear tax, I pay the Homer tax.\"\n\n\"Dad, that's the *Homeowner* tax.\"", "label": 0}
{"text": "Dual IPA - it has twice as many hops as a regular IPA", "label": 0}
{"text": "LOL. Did you see the part about 300+ mph wind, hypoxia levels of oxygen, and the plane plummeting to Earth? Ain't nobody got the time to try and get a pulse, let alone trust your feel to make the biggest decision of your life.", "label": 0}
{"text": "i have. concrete work.", "label": 0}
{"text": "When they showed the entrance I was thinking I've been to military installations with less security then the rest of the place was like they where showing off the set for the Fallout TV show.", "label": 0}
{"text": "Reddit has taught me to never have food delivered.", "label": 0}
{"text": "DoorDash has given employment opportunities to people that are completely unemployable.", "label": 0}
{"text": "If your roof is leaking, would you rather have bigger buckets or fix the roof? America cán be healthy and well functioning, just the same way other countries are.", "label": 0}
{"text": "700 isn't what I'd call a few yards, and carrying over a hundred pounds of dead weight that distance, adrenaline pumping or not, isn't a small feat.", "label": 0}
{"text": "I'm not advocating for a ban of anything, just changes, but oof you picked a bad choice to make your point. \n\nI'm on that Jan Hus shit. I could go on all day about how much I dislike most church groups but this isn't the thread for that.", "label": 0}
{"text": "At my school it was an elective class you could pick. I left picking my classes late and I could pick between Drama, Dance or Grounds Maintenance. I just picked the easy credit cause I'm not about the theatre lifestyle.", "label": 0}
{"text": "I would get caught returning to the scene of the crime later that night trying to get the sunglasses I left there", "label": 0}
{"text": "That's fair just these are the stats as of 2024 lol. Early 2000s it was a lot worse.", "label": 0}
{"text": "Tbh as an America it’s odd.  I feel like we’ve gone way overboard with that stuff and it’s probably not good mentally to grow up in such a fear based environment.  Yes school shootouts have happened.  But this doesn’t seem like the answer. \n\n It reminds me of after 9/11 when everybody said “if we live in fear we let the terrorists win”, then spent 20 years living in terror and structuring the entire society around anti-terrorism.  Just seems disproportionate, and also like exactly what “letting the terrorists win” looks like.  \n\nPlus that trillion dollars we spent in the Middle East is just gone now.  Could have spent it on schools, health care, broadband, and many other public works or industry stimulus uses.", "label": 0}
{"text": "Okay so I have sooo many to reply to this, english isn't my first language so sorry in advance haha \n\nYou start with currency. From my understand the biggest benift of using crypto as a currency and why it got made to be used as a currency was for a few reasons. No government controlls it, they can't just print trillions out of thin devalauing that currency (it's why Bitcoin got made in 08 after the government printed trillions to bail out the banks). The other reason it got made a currency is so it could be sent without tarrifs and fees for sending it overseas. I have family all over the world and for some of them it takes Soo long and is a massive headache to send them money through my bank to their bank. Crypto as a currency fixes this problem does it not? \n\nCrypto does not make you anonymous and anyone who thinks that has no idea what there talking about. There's a record of every single crypto transaction. You can look up every btc transaction ever, who sent what, who recieved what, who's holding what etc. Once you put a name to a wallet(which isn't hard to figure out) then everything is transparent. It's why I think governments will put their currency's on a blockchain so they can track, trace and tax everything \n\nI like that blochains create a layer of trust and authorisation that doesn't need a central government, institution or cooperation(for most of the blochains, some are still centralized like Solana) \n\nNFTs are a super underated technology that will get utilized as medical records, real-estate deeds, birth cirtificates, passports, ID's etc \n\n99% of crypto wont be around from now but the actual technology won't go anywhere and is the reason the industry is worth over 2 trillion", "label": 0}
{"text": "Man I’d take that kitty home in a heartbeat.", "label": 0}
{"text": "This is KCK, you can tell by the Kansas City, Kansas Public schools logo in the upper left near the name of the video. District 500 (KCK) is also home to the top rated HS in KS (Sumner Academy)", "label": 0}
{"text": "Of COURSE the dude confronting him is wearing that shirt.", "label": 0}
{"text": "I think it’s more a matter of money not going to the kids that’s an issue.", "label": 0}
{"text": "I could not listen to this.. this man is obviously drunk.", "label": 0}
{"text": "The fewer people handling your food the better. You can't really trust anyone, then you add multiple more elements for the food to get to your mouth and pay for the privilege.", "label": 0}
{"text": "Reminds me of the video of the speeding truck shooting. Guy says slow down. Truck comes back to fight him. Ends up getting shot. Shooter aquited. ", "label": 0}
{"text": "My heart goes out to you and everyone with similar devastation stories. Thank You for sharing your story.  I hope good fortune comes your way.", "label": 0}
{"text": "Lmao you’re not kidding, guy seems like he’s absolutely tanked", "label": 0}
{"text": "Musk didn't start Tesla or SpaceX he bought them out after they were already established and just rides on their success.", "label": 0}
{"text": "The California roll is imitation crab, avocado, and cucumber", "label": 0}
{"text": "Nope. I’m old enough I’m starting to go gray and I remember a time were delivery was cheap, quick, you got your food hot and the drivers didn’t do any weird shit. I don’t use the apps much anymore because I’ve had so many idiot and criminal drivers. \n\nOne drove nearly 100 feet across my lawn instead of down my driveway when they started on my driveway, they did so in a downpour. \n\nAnother pulled into 18 inches of snow on my lawn instead of the perfectly clear driveway. They got stuck then their car died. \n\nI had another repeatedly insist I them in the house because they were convinced I was a woman, I’m not. When they got aggressive this large, angry man marched them back to their car with my right hand on the 1911 on their hip. \n\nOh, and there’s a time where it took about 2 1/2 hours to get my food because the driver was multi hopping and at one point drove 20 miles in the wrong direction of my house. \n\nThen there’s grocery delivery. One didn’t buy paper bags so they sat all of my food on the dusty porch. Another put the groceries in the snow. A third left them in the pouring rain instead of less than 2 feet further, where it’s covered. \n\nThere’s been others, but does the ones that stood out with them why I don’t use these services much anymore. I always tip at least 20%, never bother the driver, leave clear, polite instructions, but they act like idiot fucking children. .", "label": 0}
{"text": "Just wanted to say thank you for being grateful", "label": 0}
{"text": "no he didnt", "label": 0}
{"text": "Because if we're seeing it, then the authorities or Doordash CS already has, and they're fucked.", "label": 0}
{"text": "The Australian definition of stopping at a stop sign  \n(NSFW) [Fat Pizza - A complete stop - YouTube](https://www.youtube.com/watch?v=E2vjvaIKnr8)", "label": 0}
{"text": "Man you just might have shit luck, I've used various delivery services countless times and have never once had an issue.", "label": 0}
{"text": "Yes it is", "label": 0}
{"text": "I was gonna say… I went to a private school for elementary (parents choice) and public school for high school (my choice) in an area that was pretty affluent. They both looked to be about the same level as these schools. Some parts were newer and nicer and some were clearly very old but still in use. That’s just pretty much most schools it seems.", "label": 0}
{"text": "We've become a nation where a large percentage of the population believes that spending anything socially is communism so they demonize and politicize everything the government does as socialism bad then underfund it and say see how bad this is?", "label": 0}
{"text": "As opposed to Oakland 20 years ago? What dude?", "label": 0}
{"text": "The state police and game wardens finally had to move in and arrest a bunch of people because some of them were literally feeding the bears their trash *on purpose*. \n\nThe rest of the county also got real tired of their shit, so they couldn’t really accomplish much beyond the town level. The rest of Grafton county includes such institutions as a couple large ski resorts, a state university, and most notably Dartmouth College. \n\nWhen the bears coked up on libertarian trash boldly started walking onto the Dartmouth campus, the state shut that shit down real quick.", "label": 0}
{"text": "The financial loss is the loss of time and mileage spent delivering the food, as well as the likely loss of his remaining doordash pay balance and one of the few employment opportunities available to him once this video gets sent to doordash's fraud prevention team", "label": 0}
{"text": "It's a suburb school now and unreal huge but when I went there it was just a farmer town outside the city. Real real small with our ag program being our biggest pride. Still it was nothing like this. We did have portable though but even those weren't bad. ", "label": 0}
{"text": "Yep it is I'm on mobile ", "label": 0}
{"text": "for real, hes saying this is aweful.. and im like ugh was my school that shit compared to most??", "label": 0}
{"text": "I actually worked in this building for years as well as other buildings in the same district. This video does not capture all of the problems, not even close. There’s mold. There are dangerous elements in the auditorium, including a light board that routinely smoked. There are bats. There are mice. There are roaches. The ceiling is falling apart. My classroom would be 85+ degrees on a warm day and 55 degrees in the winter. I can deal with that. Middle schoolers can’t. It was horrendous. And the worst part? Anything they do to “fix” it, either wont fix it all or would cost more than a new building. Please trust the people that work there and learn there. I wouldn’t send my children there (they do attend in this district) and that a pretty good marker of how terrible it is.", "label": 0}
{"text": "\"doordash fraud prevention team\" \n\n  \nsorry but if they cared they would have cut the workforce by 10% at least already. And banned a lot of customers who are still getting free pizzas every week. and found a workaround for the stolen credit card testing thing going around.", "label": 0}
{"text": "Jesus i don't even slur my speech this bad after 9 coronas", "label": 0}
{"text": "Depends entirely on where you are. \n\nI've been ordering out since uber/door dash/grub hub basically started. All my careers have been \"on the go\", some more than others. \n\nHandful of issues in Seattle or Portland. San Diego, I had five+ meals stolen over a three month period, one of which I have a vivid memory of looking out and seeing a guy just sprinting with a Buca Di Beppo (Italian place) bag across the parking lot of the hotel I was at. Dude ran like forest gump. Uber was super easy to deal with at the time and they kept comping me. I was worried they'd flag my account at one point but I assume they knew their drivers were not the most reliable. \n\nWhere I'm at now, I've only lost one meal in 3 years and the driver didn't even attempt to hide it. They drove in a circle at the restaurant and then marked as delivered. Its funny because that one was the most annoying to deal with when it came to complaining to grub hub. They fought me tooth and nail, eventually had to do a charge-back. It encouraged me to stop using the services entirely. \n\nNow I have the time to meal prep and part of my new years resolution was to cut down on eating out since I have the free time, so I don't get to play those games anymore.", "label": 0}
{"text": "I just saw him live in baltimore last weekend. Gotta say, hes still funny but clearly past his prime. He cracked a few times and felt like he was just slapping jokes together. \n\nThe warm up act Steven Rogers was a blast though.", "label": 0}
{"text": "“No choice”\n\nGo to a store and shop.", "label": 0}
{"text": "I love this look for you. Didn't plan ahead with better comments or have any friends, did you?", "label": 0}
{"text": "What better to raise generations us poorly educated children in!", "label": 0}
{"text": "Truck man got that weak ego energy.", "label": 0}
{"text": "It’s working on my phone just fine, so it’s not mobile in general, it’s specific to your phone model or something.", "label": 0}
{"text": "Love the one she did during that first year of COVID. It was so refreshing after what felt like forever in lockdown, even though it was still only 2020.", "label": 0}
{"text": "I went to high school in Tully, North Queensland, Australia in the 90's.  It'll easily get [30c+ almost every day in the summer](https://www.worldweatheronline.com/tully-weather-averages/queensland/au.aspx) and extremely humid.  The only rooms that had air-con were the computer rooms,  half the ceiling fans didn't work, our \"gym room\" was just a shed with a concrete floor and folding chairs, our soccer goals didn't have nets, not a ramp in sight.  This school would be luxurious to me.\n\nAlso that one cunt teacher that wouldn't turn on the air-con when we had computer class because She thought it would cause us to catch a cold.", "label": 0}
{"text": "Do you live at the restaurant? Because you can’t mark delivered if you’re not very close to the delivery address…", "label": 0}
{"text": "I don't. Figure out how to live in society or get out.", "label": 0}
{"text": "This was way more mid than I was expecting.", "label": 0}
{"text": "It's not just the delivery drivers -- most places seal the food in the bag with stickers or whatever. They literally pack them wrong. I would say probably a good 30-40% of the food I order on UberEats or whatever is wrong in one form or another. The other day my girlfriend and I ordered 7 items and only 3 of them were in the bag. (Not the delivery drivers fault.)", "label": 0}
{"text": "Bella ciao, bella ciao, bella ciao ciao ciao", "label": 0}
{"text": "> No government controlls it, they can't just print trillions out of thin devalauing that currency (it's why Bitcoin got made in 08 after the government printed trillions to bail out the banks).\n\nOkay, so this would be the 'Decentralization' idea. And, as with anonymity, I think there are two answers: First, crypto often doesn't even try to do this, and when it does, I'm not sure it succeeds. And second, I'm not sure if we actually want this.\n\n---\n\nFor the first part: There are plenty of crypto systems deliberately built to be controlled -- admittedly these are usually built on something like NFTs or smart contracts more generally, rather than the pure-currency of something like BTC. But even with something like BTC, there are several ways that decentralization falls apart in practice:\n\nFirst, the underlying software of the chain itself is still made by a relatively small team. *Someone* has push access to https://github.com/bitcoin/bitcoin. (At a minimum, Github itself does!) Forks are possible, as was demonstrated recently when ETH migrated off of PoW -- a number of people stayed behind on ETHW, but this made basically no difference. And that migration shows that whoever controls the software absolutely *could* decide to print trillions out of thin air.\n\nBeyond the software, the chain itself is set up so that no one person controls it, right? Except that time one BTC mining pool got so large that the pool owner accidentally controlled a majority of hashing power on the network. They voluntarily split up, or at least that's what we're told.\n\nThat doesn't look that much more decentralized than a democratically-elected government being able to set monetary policy.\n\n---\n\nFor the second part: BTC is a deflationary currency, by design. Economists generally agree that moderate inflation (on the order of 1-2%) is Good Actually. But not only is there a fixed amount of BTC ever, because some of it gets destroyed (people occasionally lose their wallets), the end state is actually a periodically-*decreasing* amount.\n\nThe econ-101 problem here is: It's a deflationary spiral. When this happens to currency, people are strongly discouraged from spending any money on anything, because anything you *could* buy will be cheaper (relative to your money) in the future. If nobody's buying anything, then companies end up laying people off, who will then have even less money to spend, and you end up with a depression.\n\nOf course, you could design a chain to have a set amount of inflation... but then you can't respond as the economy shifts. Should it be 1% inflation? 2%? If you guessed wrong, and if it really is decentralized, that means there's no one to change it if you get it wrong.\n\n---\n\nBut there's a more fundamental problem: It's not just monetary policy, it's also... *any* safety net around *anything* financial. If you buy things with a credit card, the credit card company is liable for fraud -- if anyone steals your card, you don't have to pay for anything they buy with it. Even with the money in your bank account, banks will often try to intercept fraud, or give you ways to stop or reverse fraudulent transactions when you find them. If you have your own crypto wallet, you have none of this protection. If I steal something from your wallet, it's mine now, the end.\n\nThis same principle applies to most of the other 'decentralized' applications you get into later. It turns out most people are better off having a central authority who can resolve issues like that. Of course you can do that with crypto -- maybe there's a crypto bank, and you keep most of your currency there -- but that defeats most of the purpose of crypto in the first place. I mean, now the bank *is* central control over crypto!\n\n---\n\n> The other reason it got made a currency is so it could be sent without tarrifs and fees for sending it overseas. I have family all over the world and for some of them it takes Soo long and is a massive headache to send them money through my bank to their bank. Crypto as a currency fixes this problem does it not?\n\nNot unless it's anonymous, which you just said is impossible.\n\nGovernments have *already* begun to regulate crypto. There is nothing stopping a government from imposing the same tariffs on that transaction. You are just hoping you won't get *caught.*\n\nFortunately, and possibly driven by competition with crypto, it seems to have gotten easier to transfer money electronically (using normal fiat currency) than it used to be. But you might know more than I do about how that actually plays out.\n\n---\n\n> It's why I think governments will put their currency's on a blockchain so they can track, trace and tax everything\n\nThis is the perfect example of a \"better done with a normal database\" problem. Blockchains are slow -- without some extra layer on top (that starts to look increasingly like a normal database), there is actually a hard limit on the throughput of the blockchain, because *every* transaction has to be federated to *every* node. And that's to say nothing of the extra energy waste, especially from PoW chains.\n\nFor comparison: EVE Online has its own currency. Plenty of games do, but EVE is famous for explicitly allowing real-money trading. In WoW, gold farming can get you banned; in EVE, it'd just be part of the game. [They aren't doing anything with blockchains](https://www.eveonline.com/news/view/blockchain-and-eve-online), at least not on the main game. And I guarantee they can track, trace, and tax everything in the game.\n\n---\n\n> NFTs are a super underated technology that will get utilized as medical records, real-estate deeds, birth cirtificates, passports, ID's etc\n\nThis is one of the dumber ideas crypto-bros have come up with. Let's break these down:\n\nMedical records are quite private. Blockchains are the exact opposite.\n\nNFTs for deeds don't solve any problem deeds have, and create new ones. Let's start with: Does possession of the NFT mean you own the thing it refers to? If I steal the NFT of your house, do I own your house?\n\nIn any reasonable society, the answer would be no. A deed can be used as *evidence* that you own something, but the government ultimately decides who owns what land, even if it has to go to court.\n\nIn other words: This is a centralized system, and as with currency, it's better for most people that it's centralized. And because it's centralized, the blockchain doesn't really add anything useful here. Why would an NFT be better than just a digitally-signed record from the local government? Or even just a paper deed that everyone physically signed? Just have the government keep all these records in a nice big transactional database, and give everyone enough evidence to be able to take it to court if that database ever has a mistake.\n\n---\n\n> the actual technology won't go anywhere and is the reason the industry is worth over 2 trillion\n\nIt's not clear it is, and that's not why it's worth that much.\n\nIt's not clear it is because of the sheer volume of fraud in that market. Wash trading is blatantly illegal, and absolutely rampant in crypto, and an easy way to make it *look* like there's absurdly more value than there actually is.\n\nAnd, the reason it's worth anything is speculation. It's not worth that much because everyone is hyped about the hot new *software patches* that are about to land. It's worth that much because of all the speculation, because everyone is hoping to be able to sell their crypto (currency or NFTs) for more than they bought them for. Same reason trading cards are worth as much as they are.", "label": 0}
{"text": "But you don’t lose income. You get paid for the ride even if customer reports it not received", "label": 0}
{"text": "No time for a stop sign but plenty of time to reverse and argue with the locals.", "label": 0}
{"text": "You're telling me that this isn't a job-ending circumstance if they were reported?", "label": 0}
{"text": "How stupid are you? The whole point is a set of inputs that would beat any possible seed of pokeom platinum no matter what. It does just that.", "label": 0}
{"text": "You've got the same vulnerability while performing the vehicle heist. And the additional vulnerability while you're driving around that vehicle.\n\nIt's not a simple thing to add that level of complexity.", "label": 0}
{"text": "That button got cooked too gang", "label": 0}
{"text": "It's astonishing that despite easily accessible info, people are STILL saying things like \"crime is down\" to hand wave away concerns about violent crime. First, how much is crime down? Down 1% and down 99% are both down. Second, where are we at compared to our goal? What is a reasonable violent crime level given our resources and quality of life and how do we rank compared to the rest of the world? Third, what constitutes violent?\n\n1. Violent crime is actually up in the last 10 years according to the FBI stats\n\n2. We have a 6.3 homicide rate compared to Canada at 2.3 UK at 1.2\n\n3. Kidnapping and Simple Assault are both up dramatically in the last 10 years yet they are not part of the FBI's violent crime numbers despite them being violent by their nature.\n\n4. Crimes like Property destruction/vandalism, intimidation, purse snatching, pocket picking identity theft, computer hacking and fondling are all up dramatically in the last 10 years. These are not considered violent offenses but if someone steals your identity, your purse or empties your bank account as part of a hack, these are all violent acts in terms of their impact on the victim, albeit not physically violent. \n\nTLDR: The USA is a resource abundant country and our violent crime rates are absurdly high compared to what they should be and violent crime is actually up over the last 10 years and is dramatically up if you count kidnapping, simple assault and fondling.", "label": 0}
{"text": "it's just a DASHstiny at this point.", "label": 0}
{"text": "As someone from Finland, rich peoples kids go to same schools as everyone else - kids shouldnt be punishes for their parents wealth or lack of.", "label": 0}
{"text": "Is that the best zoomers have to offer?", "label": 0}
{"text": "This is the worst, the driver app will literally tell you that a particular location has a history of getting orders wrong and remind you to check the order, but it's a double-sealed mcdonalds bag, how the hell am I supposed to verify that when I can barely get the staff's attention to even pick up the order?", "label": 0}
{"text": "I will never seize to be amazed by how gullible some people are in this world.\n\nYou think this was an act of desperation?  Really?", "label": 0}
{"text": "That’s a combination of nostalgia-goggles and shit luck my friend.", "label": 0}
{"text": "They still don’t exist here.", "label": 0}
{"text": "Someone pat these back up singers and band members on the back. They deserve that, and a free beer or two. Yeeesh", "label": 0}
{"text": "Niles St and Park Ave Oceanside NY", "label": 0}
{"text": "That wrestling room looked pretty rough, and the moldy hallway at 9:22 is crazy. Otherwise... not good, but not as crazy as I was expecting. I hope they get the funding they obviously need.", "label": 0}
{"text": "I was. \n\nI feel kinda bad how much the school just kinda looked like mine did. I din't think my school was terrible, it was safe and the teachers were motivated. The inside was just ugly is all.", "label": 0}
{"text": "With everything you listed you might as well just build a new school. It would probably be laid out better not to mention it would use less energy. There would be enough bathrooms on EVERY floor. The school looks like a prison for god sake.", "label": 0}
{"text": "Wow. This is so much more expensive than I would have assumed. What a shame cause I'd love to get into astrophotography", "label": 0}
{"text": "My average hourly rate over the course of a month is a little more than what the nearby factories are advertising their 3rd shift rates for. And has remained that way over the 12 months I've been doing it. \n\nSo for what the job is, I would consider it bank. No stress, super easy, work whenever I want, can **not** work whenever I want or end a shift whenever I feel like it.", "label": 0}
{"text": "A new school would be nice. But the factor not considered would be permits and various bureaucratic bullshit to build a school entirely from scratch instead of repairs.", "label": 0}
{"text": "Y'all need to stop using these services.", "label": 0}
{"text": "Leave the school open while they build the new school. It looks like they have plenty of land in the video.", "label": 0}
{"text": "Step 2: put your junk in that wall", "label": 0}
{"text": "sigh can't watch", "label": 0}
{"text": "I’ll take that over stepping on something sharp", "label": 0}
{"text": "Every single one of my cats growing up was a stray someone else found and somehow ended up at my parents. I feel like when you adopt a stray (if they let you) they have never ending love for you since they know what the world is like without shelter, food, water, etc.", "label": 0}
{"text": "So that's why they call it that.", "label": 0}
{"text": "Nope, anyone could have stole that food. They aren’t going to investigate once incident. Driver only gets fired if it becomes a pattern above the statistical noise.", "label": 0}
{"text": "Lol right", "label": 0}
{"text": "*We'll, we could give the schools lots of public money to fix or build new schools, but you know what we're going to do instead?\"*\n\n*\"That's right, we're going to give that money to wealthy private schools.\"*", "label": 0}
{"text": "Okay, I appreciate the passion and the CGI talent but this was an off putting and overly complicated and absurd way to communicate the scale of the universe. How many jelly beans will fit in an Elephant? How many Elephants will fit inside the sun? What about ten thousands suns? How many days will it take to fill all of the Elephants with jelly beans? Also, here is a kind of grating \"epic\" soundtrack mix playing the entire time to emphasis the wow-factor. \n\nMaybe others will find this to be good way to communicate the vastness of the Universe but it doesn't work for me.", "label": 0}
{"text": "This is more sad than anything. He’s not stealing that food to sell it. He’s just not making enough to eat regularly.", "label": 0}
{"text": "Hello /u/Far_Yogurtcloset1641,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "I instantly thought of [this video](https://www.youtube.com/watch?v=_W1j1_dxDSs) after reading this. You just seem like someone who watched Fight Club 20 years ago and it completely took over their life in the saddest way possible.", "label": 0}
{"text": "These are the same people that will continue voting for the people who don't give a fuck about them.\n\nAmerica is such a shit hole of a country and we need to do better.", "label": 0}
{"text": "Anyone else noticing that guy's back pack? Not many grown men sport a pink cat-themed pack with a bedazzled front pouch and a wig on top...", "label": 0}
{"text": "It’s Reddit dude. Some of these people don’t even get up from their gaming pcs to go to the bathroom.", "label": 0}
{"text": "Just reporting won't end a door dashers employment.  It has to be a series of reports from different people.  Or it has to be evidence submitted showing that the door dasher is obviously violating their work agreement, like this video.", "label": 0}
{"text": "Hello /u/Responsible-Aide2746,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "As a Californian, I take offense. That guy just blew through the stop sign. A good California stop requires you slowing down to about 20% before proceeding through the stop sign. You also can't be a huge douche bag.", "label": 0}
{"text": "Gas, wear and tear on car, his time spent is money he could have been making twice as much in another profession while learning a new skill.", "label": 0}
{"text": "Drivers think they own all public space and put everyone else in danger.", "label": 0}
{"text": "I had to interview him when working for a local paper when I was 18. \n\nI became apolitical that day and look bad to this as the day I realized most people are idiots paying half attention. Also I can't believe this guy is still relevant I'm 32.", "label": 0}
{"text": "I mean the kid was a punk obviously starting shit with a 46 year old little guy.", "label": 0}
{"text": "Why not *steal the van*?", "label": 0}
{"text": "That wasn't even a \"rolling stop\". It was a slower and goer.", "label": 0}
{"text": "Why not steal the van?  Drive it to where your car is waiting, transfer the cash, torch the van.", "label": 0}
{"text": "I don't remember that one. Is that Payday 2 or 3?", "label": 0}
{"text": "For someone outside of the us it is absolutely hilarious what kind of security system they need to have at american schools", "label": 0}
{"text": "Imagine getting downvoted for this... I have the same issue and everyone replying just saying \"Works for me, must just be a you problem\", like that makes any difference...", "label": 0}
{"text": "This is a horrible intersection. They should really look into getting that intersection reconfigured instead of arguing whether people did or did not stop.", "label": 0}
{"text": "Question; where , or rather WHO is all the money going to, instead of the school? What  politician or administrator is the money going to ?", "label": 0}
{"text": "Me hahaha i was like wtf who steals monkeys", "label": 0}
{"text": "Pretty sure she'd just steal the melody and call the song her own tho.", "label": 0}
{"text": "I thought it was crazy she didn’t close the door. Isn’t that the whole point of parking the money van in the garage? You separate the vulnerable money van from the outside world? Or else, you know, someone could just wander in…", "label": 0}
{"text": "We don’t even know if he’s crying. That just sounds like, and electronic…sound", "label": 0}
{"text": "1:10 is meme face", "label": 0}
{"text": "*Looks at video...* I see why.", "label": 0}
{"text": "Always has been.", "label": 0}
{"text": "I love this, but I also love Patti Harrison's impression as well:\n\n[YouTube Link](https://youtu.be/0JwgqnLA-Mk?si=R3ZilVoftTQH2_Q1)", "label": 0}
{"text": "First time listening to her. Underwhelming imo.", "label": 0}
{"text": "Hello /u/AdDifferent9673,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Be responsible for your own caloric intake", "label": 0}
{"text": "> i couldnt imagine taking a psychological L for $4-$20 in food.\n\nImagine you were hungry.", "label": 0}
{"text": "No kids, no interest in having them. \n\nWhen I get my itemized county tax bill every year, I basically skim through it to see if anything increased noticeably **other than** the schools.\n\nOne year my tax bill went up 10%, but virtually all of that went to one of the school districts to fund a remodel. Didn't bat an eye. \n\nAnyone who rants about money going to schools should be ashamed.", "label": 0}
{"text": "I like how this scene is literally a parody and was likely pushed by some exec who wanted a \"futuristic hacking scene\" as a lot of crime shows in the mid 2000s were pushing.\n\n  \nSo it was made absolutely ridiculous and the fix was simple lol.", "label": 0}
{"text": "i no longer use door dash. their drivers are morons. they dont have the common sense to confirm the address before  leaving food or knocking on doors. ive had multiple instances on 'contactless' delivery where its either at the wrong house and at my neighbors door, or its nowhere to be found. so i change to hand off. where 50/50 chance they call me asking me where i am, and i open the door and their, again, at my neighbors. my house number is on both my mail box, and near my door. i leave a description of my house, the only one of its color with respect to my neighbors, the front light on, and they STILL go to the wrong house. and thats if they dont forget my drink.\n\nthese dashers are bottom barrel and DD does nothing to course correct them. like, idk, put my gddamn comments on a pop up so they see it. give them a reminder to confirm house numbers- SOMETHING.", "label": 0}
{"text": "> Fantastic, what happens after they get out of college\n\n> Open a window and listen to the screaming\n\nFor the most part, people are doing very well. The screaming is certainly less than it's ever been. Real incomes and employment are better than they've ever been. \n\n> If you're looking at basically anything that's happening right now, how it's happening, why it's happening, and you think to yourself \"I'm pretty sure something's going right\"? You are not looking at anything that's happening right now.\n\nAll the evidence seems to suggest it's going pretty right. The US is the best positioned economy in the world right now for mid to long term success, everyone else is struggling pretty hard.", "label": 0}
{"text": "Source for what? Attainment?", "label": 0}
{"text": "They almost assuredly are not..", "label": 0}
{"text": "Yes.", "label": 0}
{"text": "Keep in mind, this is the richest country in the history of the world...\n\nIt's a choice. There is enough money in the United States to provide the best education in the world, make homelessness and poverty a rarity, provide great health care to all citizens and a host of other issues plaguing society. It's a choice.", "label": 0}
{"text": "So many questions, where they going, how did it get in, and why no seatbelt?", "label": 0}
{"text": "Because shit is warming up globally", "label": 0}
{"text": "Dua Lipa is the definition of mid.", "label": 0}
{"text": "I stopped ordering pizza delivered because of this.\n\nI refuse to use Uber eats or doordash. Their services have destroyed what used to work well.", "label": 0}
{"text": "Lost respect? She GAINED respect from that giddy lil goober outside.", "label": 0}
{"text": "He did try to poison some other kids, so I guess it's kind of true from that direction? A guy did hand out poisoned candy to kids. He just gave it to his own kid too.", "label": 0}
{"text": "Yeah for sure. I mean as a machinist we both know this guy was bullshitting.", "label": 0}
{"text": "https://www.fbi.gov/news/press-releases/fbi-releases-2023-crime-in-the-nation-statistics\n\nWe have homicides rates in the US because of guns.\n\nKidnapping cases aren't up, they're not included because it's extremely rare. The vast majority of cases are people who willingly disappeared. With kids, almost all of them are custodial kidnappings and \"my dumbass kid fell asleep playing hide-and-seek outside sorry for panicking officer.\" \n\nSimple Assault is not a violent crime because by definition no one is hurt.\n\nYou provided a source for none of this.", "label": 0}
{"text": "> The needing badges to unlock doors is like, standard everywhere now?\n\nNot here in Finland. Sure, in companies and lab facilities, but not schools.", "label": 0}
{"text": "yes  im sure  his  friend who was giggling  outside was also poor and can't eat regularly.", "label": 0}
{"text": "Hello /u/Mediocre_Security_27,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Hello /u/Upset-Society-7037,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Hello /u/Upset-Society-7037,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Hello /u/Upset-Society-7037,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "It’s a ‘T’ intersection and 3-way stop.  You can easily see everything from each side. (I’ve been there).", "label": 0}
{"text": "Hello /u/C_sm00th-269,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Not to mention they almost certainly do not have the proper car insurance.", "label": 0}
{"text": "also wonder if their insurance is on board with the whole commercial use of the vehicle", "label": 0}
{"text": "My HS had a PC room and a Mac room. None of the teachers really knew macs well so they let a student be the \"IT guy\" for that room. \n\nAt some point the district sent someone in to check on things and they found *massive* amounts of child porn on the mac server. Like terabytes. \n\nNever saw that student again and since he was a minor there was nothing with his name in the news but I hope he went to jail.", "label": 0}
{"text": "Should've just taken mUber", "label": 0}
{"text": "That’s me. I’m that person. I have to go with someone to pick up someone from the airport and I’m terrified. Haven’t left the house (like been outside) for longer than 5-10 minute’s in months.", "label": 0}
{"text": "Feminine step.", "label": 0}
{"text": "Do they have two downtowns? I legit don't know lol", "label": 0}
{"text": "Oh my god, this is my school district! I voted yes to getting new schools and a remodel. This was on the ballot this year. You know how there are signs to endorse candidates, well they do that for proposal too. Can you believe that there was a sign that said No to this proposal? It’s ridiculous. KCK is the poorest county in the state. We need this for the kids. My elementary got an new building about 13 years ago and a new playground a few years after that. It looks so much better now, but they built it a few  after I left. Wish I could’ve had it when I was still there. My middle school got a new cafeteria a few years back, it used to be up on the 3rd floor of the old building. Now it’s ground level. Slowly but surely, we are seeing the district improve. I wouldn’t mind if it gets taken out my taxes, but it does help that the proposal is tax free so more people would likely vote for it.", "label": 0}
{"text": "Seems legit", "label": 0}
{"text": "The most powerful nation in the world.", "label": 0}
{"text": "Yea that’s wild. I’m imagining a couple treble hooks?", "label": 0}
{"text": "That thing has been shitting non stop the whole ride, the whole back passenger side is covered!", "label": 0}
{"text": "…right, that’s my point. If you see someone stating the obvious like a 6 year old on a Reddit comment reply to a comedy sketch… how many 6 year olds do you know here?", "label": 0}
{"text": "At least the bull was not driving!", "label": 0}
{"text": "What a fucking evil behaviour. Makes me furious.", "label": 0}
{"text": "it's so weird tbh, what can you steal before getting banned? probably max 5 meals within a short period\n\nand if you steal 1 in every 20, assuming that wouldn't get you banned (which it probably would get you banned) then you might as well just keep it as a job and buy food from a fucking grocery store\n\nunless they can just whip up a new account after they get banned indefinitely and trick the companies I just don't get it", "label": 0}
{"text": "I think it's generally about 45% local taxes, 45% state taxes, and 10% federal taxes. I remember reading that state tax funding started explicitly to help with some local tax inequity. And federal is supposed to help with some other inequities.\n\nBut since it's still largely local tax funded, and the wealth gap is so high, there's still massive inequity between schools.", "label": 0}
{"text": "I am no longer sorry about going off. I both wish I had gone off harder and also wish I had not bothered.", "label": 0}
{"text": "Can anyone please tell me what the video is trying to promote? It looks like its saying to voters to choose no to increasing taxes - which you would think the schools need.   \n\nI think the USA needs to change its tax system and not have schools funded by property tax but instead by general income tax at least at a state level rather than a town or city level.   \nThen include a slight skew of funding spend based on student decile.   \n\nIt would mean individual school boards can still be in control of how they spend the money, but it would help remove much of the disparity between the rich neighborhood schools and the poor neighborhood schools.  \n\nHere in NZ, schools are funded out of the national income tax. Each school has a decile rating with schools in poorer areas getting slightly more funding based on census data and numbers of students.   \nIts then mostly up to the school board of trustees (made of parents) how it wants to spend its money which would be similar to a district school board in the USA.   \nA typical mid decile level high school or middle school gets about $8,500 (USD$5k) per student per year \n\nIt would be interesting to know how much a school in kansas gets per student per year.", "label": 0}
{"text": "A government run service??? But that’s socialism!!! Plus we all know the only thing the government can run well is a conspiracy coverup", "label": 0}
{"text": "Meanwhile, billions are going to defense, absolute joke and a broken system", "label": 0}
{"text": "It’s really not that bad. When doing inventory in supermarket I usually spent the whole day in there, but obviously not in a T-shirt. I also worked a few years at a storage facility doing 10-hour shifts at -21C", "label": 0}
{"text": "Then you’ve never had integrity. Congratulations.", "label": 0}
{"text": "Is mid a good or bad thing?", "label": 0}
{"text": "That was entertaining, thank you for sharing ", "label": 0}
{"text": "I am not familiar with her tunes and gave this a spin …boring, predictable, songwriting. Not to say it wasn’t done well", "label": 0}
{"text": "Of course not.", "label": 0}
{"text": "You messed up the humidex numbers pretty bad. In your link the record for Toronto is 48c and the record for the airport (which is still well inside \"Toronto\" is above 50.). I didn't bother to check the rest.", "label": 0}
{"text": "If they're exposed they should be in conduit, even if they're not a safety hazard.", "label": 0}
{"text": "I've done a few heist without getting caught.\n\nStarted in middle school stealing small stuff. Later in high school stealing bigger stuff. In university I went a little crazy before I called it quits. \n\nI never sold anything I stole and I only used some of the stuff I stole, which probably why I never got caught. The biggest heist was reported at over quarter million in damages (I thought the number was a bit inflated and I only stand to gain 50-100k if I actually tired to sell the stolen goods).", "label": 0}
{"text": "The worst thing that happened is you wasted 15k on lukewarm food", "label": 0}
{"text": "There were plenty of places where the bundles of cable were 3' off the ground. Its not hard to run conduit where the cable is exposed.", "label": 0}
{"text": "I think DoorDash is diff from Uber on that? Though maybe you need a business license, Idk. But at least you're not worrying about passengers.", "label": 0}
{"text": "/r/Catswhoyell", "label": 0}
{"text": "Tbh I still use some of these services, but never with delivery; always pick up. Because whenever I did delivery what should've been a quick grab and deliver could take literal hours.\n\nAt which point already mediocre food is just sad.", "label": 0}
{"text": "That is standard (and sad). I'd be more shocked to find a school without that style entrance. Even private schools are usually set up that way now.\n\nHuge change from where I went to high school- every outside door from common areas was unlocked. It was in the middle of a neighborhood so kids walked from all directions, you'd just go in the nearest door.\n\nJr High and grade school didn't have interior hallways. They were fenced off, but there was an open gate from every direction.", "label": 0}
{"text": "Dude's going fishing in international waters", "label": 0}
{"text": "Same here lol. This is every school in Ontario built in the 60s, which is like 90% of the schools in rural Ontario. Those schools have looked like this for at least 25 years.", "label": 0}
{"text": "They should be fired for that", "label": 0}
{"text": "Careful. You're going to start a new conspiracy theory that starts out as a joke, then the idiots take over", "label": 0}
{"text": "the actors are good, but the set designers and writers are lazy and cheap. There is even a Mexican version of Breaking Bad with Walter Blanco and Saul Bueno. Yes, that's their real names on the show. Talk about lazy writing.", "label": 0}
{"text": "Yeah I just looked it up with my car insurance. Nothing about door dashing only about ride sharing. \n\n\nLike I've never heard of pizza delivery people talk about paying more insurance. Why would this be different?", "label": 0}
{"text": "Since most Indians can speak English, why don't they just air the American version?", "label": 0}
{"text": "It was ahead of its time.", "label": 0}
{"text": "She’s a millennial. Zoomers listen to Billie Eilish and Benson Boone. Dua Lipa is what their moms listen to.", "label": 0}
{"text": "California schools weren't great either. Better than video, but certainly not great. My kids tiny district in VA has recently replaced or fully renovated all the schools, and they're considerably better. I wouldn't call them 'nice', but they're a major step up. The 100 year middle school was fully renovated and made ADA compliant, including the converted basement.\n\nThe 'poor kids' grade school was renovated last of course, it was on par/better than the video, but now its at the same level as the rest.\n\nOf course VA spends a lot on education, and they're above average. Although with Youngkin making it illegal to teach history and the continuing assaults from 'moms for liberty' thats probably changing for the worse.", "label": 0}
{"text": "why don't they just show the American or British version in Australia? it makes zero sense)))", "label": 0}
{"text": "Yes.", "label": 0}
{"text": "Hello /u/LoveIsOnlyAnEmotion\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Public schools are required to provide services that private schools don't. Its like comparing patient costs between a hospital and a nursing home.", "label": 0}
{"text": "can Aussies not understand American language? why don't they just show the American version ? whats the point of recasting everyone with locals?", "label": 0}
{"text": "It's getting better with how restaurants seal and package the contents.\n\n\nSketchy driver should not even be able to open the bag without breaking a seal.", "label": 0}
{"text": "I'm all about the \"FREE SNOW CONE!\"", "label": 0}
{"text": "But they just gotta…ya know since Gun control is impossible, something something, excuse excuse, bribe bribe, corruption….thoughts & prayers, metal detectors are unavoidable fact of life, safety first!", "label": 0}
{"text": "I drive a Prius, the cost of gas is negligible, and repairs non-existent. Including gas and general maintenance like oil changes, new tires, etc, plus insurance, self-tax(after accounting for deductions), and all other expenses- it comes out to about 16% of my monthly earnings. \n\nWhich is about the general tax rate of a regular job. So yeah, it's calculated and still better than any postings anywhere near me as mentioned previously. \n\nPlus the cost of life, with family time, no work stress, no sore body - that's not something that can be measured in dollars and makes this extremely worth it for me.", "label": 0}
{"text": ">James Seddon is the inventor behind Eggxactly, a gadget that can boil eggs without water. He told the Mail: 'My deal fell through after all the publicity for the programme was over. I believe it's quite a common experience. To viewers, it looks as though a deal is struck, and you get the money. Well, I can tell you, that's not how it works.'\n\n>The Dragons promised him £75,000 for 40% of the company, but made clear they required Seddon to put in £75,000 of his own money.\n\n>He explains: 'Gradually, the deal began to fall apart. I couldn't contact them. I wasn't a priority. No money changed hands, it is still in their bank accounts.' \n\n[Source](https://www.thisismoney.co.uk/money/news/article-1712239/Ex-hopefuls-reveal-dark-truths-behind-Dragons-Den.html)\n\nDoesn't look like the product even got to market, but there are video of YouTube of early testers.", "label": 0}
{"text": "That’s the oil slick feature", "label": 0}
{"text": "I dunno what the system is like in your country but here in the UK you need to specify what you're going to use the vehicle for when you're getting an insurance quote. Usually you can choose personal use only, personal use + commuting, or business use.\n\nUnder this system if pizza delivery drivers don't notify their insurer and pay a higher premium it's very likely they are not covered by their policy.", "label": 0}
{"text": "Well duh. Windows operates on log ins, not multilevel security that it matters. lol   Its not like it makes any difference.", "label": 0}
{"text": "It's not different, insurance companies will deny your claim if they find out you are driving commercially (delivering pizzas, doordashing)  during an accident. That's why DD has covers your liability (not your vehicle) if your insurance denies the claim.", "label": 0}
{"text": "I mean.. nobody was physically hurt and the money was recovered. If I'm gonna be honest I would have been fine with a hefty fine to cover her counseling and therapy bills along with the probation. What exactly is gained by having this dude in jail for 10 years? If anything it might create a hardened criminal for life.", "label": 0}
{"text": "It's turkey, the strays are all well taken care of", "label": 0}
{"text": "They mean it as “nothing special” or “average” as if your average person could put on a performance like that or be that beautiful. It’s incels spending too much time on the internet.", "label": 0}
{"text": "Doordash is like skip the dishes, they know they have drivers who steal meals but they turn a blind eye to it. I had to stop using skip the dishes entirely because I would get every other order stolen.", "label": 0}
{"text": "You'd think, but there's probably interference on this from customers who *did* get their food but call to say they didn't in an effort to get a refund, and shit like that.  I would imagine it's a nightmare just trying to figure out which complaints are legitimate, let alone who to blame for it.\n\nAlso, *does Door Dash really care that dashers are stealing food?*  They need boots on the ground to keep the deliveries flowing, so I would expect they have a specific limit on the amount of money they're willing to lose from a given dasher, in the form of refunds to customers and such, before they actually take action.  If they just ban everyone on first or second offence, they might end up hamstringing themselves by reducing their ability to service a given area.\n\nUntil a dasher gets caught on camera, *and that evidence is brought to them* by the customer, I doubt they're moving too quickly to stop it.  They aren't going to go through the rigmarole of requisitioning camera footage from security cameras around every customer who calls to complain, so it will need to be customer themselves who says \"Look, I have footage from by doorbell cam\" or whatever.", "label": 0}
{"text": "It's a lot of children.", "label": 0}
{"text": "Grape! Or cherry! Cherry is still favorite just not as much favorite!", "label": 0}
{"text": "Behind the Bastards just released a series on one of the principle founders, Steve Cartisano.\n\n\n\n\nVery recommended to get a background on what's essentially a grift.", "label": 0}
{"text": "Dua in Arabic means prayer but I understand it means something else in Albanian.", "label": 0}
{"text": "Sounds like a lady when he's walkin' in the room.", "label": 0}
{"text": "I'm glad things are fine for you. I'm sorry you won't see the collapse coming because of it.", "label": 0}
{"text": "I’m guess this ain’t the only video this dude has made iykwim.", "label": 0}
{"text": "That's true, they don't last very long, maybe a week or two - but there is a seemingly endless supply of teenage boys. \n\nThe problem is they get assigned the order, come in and say they're there for their order, take it, and then unassign from the order. So then I get assigned it - come in and there's no order. Some stores will eat the cost and remake the order, others refuse - which I understand food cost wise, DoorDash doesn't pay them to make it again. \n\nBut because they unassigned themselves, it's much harder to track other than reviewing security footage, and even then it doesn't tell you *who* they were.  Most places if they don't know you - will make you face the phone towards them and make sure you tap *confirm* for picking up the order, but most places run barebones - so the person expediting DoorDash is usually flooded with other tasks as well and just hands it out. \n\nThe one group was dumb and would take the order and deliver it, but eat like half of it and leave the half eaten food in the bag - with bites taken out.  That was amusing at how dumb they were.", "label": 0}
{"text": "I don't want them to die, I want them to be better. They serve a purpose. There's times where someone is sick, or inebriated, and shouldn't go out. DD is perfect for that.\n\nI'd be interested if there was a study on the effects DD has on drunk driving. Like I believe Uber cut down on Drunk Driving by making taxi's easy", "label": 0}
{"text": "Literally every town in the US that has an open mic at a coffee shop has probably 4 Dua Lipas.", "label": 0}
{"text": "Bad", "label": 0}
{"text": "I'm sorry things are not fine for you. On average for others, however, things have never been better. \n\nWhat do you think will cause the \"collapse\"?", "label": 0}
{"text": "80's anime literally looked like the best animation ever.", "label": 0}
{"text": "Being offended doesn't give you the right to stalk and harass people. I know that people often forget this but you really don't want it the other way.", "label": 0}
{"text": "Yes. Akira.\n\nNuff said.", "label": 0}
{"text": "Me too, he's like \"maybe an old gym\" and I'm like sweet lets go check it out. I would have been down there in the first week if i was that priciple.", "label": 0}
{"text": "> America's public schools are a monument to ~~deferred maintenance~~ capitalism.", "label": 0}
{"text": "But... There already was a ton of anime in the 80s. Dragonball and Fist of the North Star were huge hits.", "label": 0}
{"text": "This happens to me about once a month or so where a customer says they didn't get it. It shows up as a \"contract infraction\" and I am given the chance to explain my case where it gets put \"under review\".  And it comes with a warning that too many may result in account termination. \n\nThese contract infractions only stay on my account for 100 orders, where they are removed permanently. So usually for me, it's already removed from my account before it even gets reviewed by a human.  \n\nFor the ones that do get reviewed. Doordashing absolutely drains my phones battery, so I assume they're recording all sorts of metrics that they can tell by GPS/accelerometer and other factors whether or not after taking a picture of the order if I walked back over to pick it up and take it. \n\nFor this reason I always take my pictures as far away as possible, so it's very obvious I did not return to snatch food. \n\nSo far every \"infraction\" has ended in my favor(as it should), or disappeared due to me knocking out orders quickly. I also align my dashcam in a way, or at the very least walk in view of it when returning to my car so I can prove I did not return with the food. \n\nBut you're right. Most of DoorDash support is just overseas workers operating on a strict script - that they will not budge the slightest from - and they don't care in the least bit about who did what.  They just want to mark your call as resolved and keep their timer metric down.", "label": 0}
{"text": "Where were they going without ever knowing the way?\n\nanyone can see that the car they were driving had a bull in it. \n\nThey can go wherever they want.", "label": 0}
{"text": "I don’t think the driver was in on it. I think the co-conspirator was like a receptionist", "label": 0}
{"text": "bs they wanted him for sports. \"So much ahead of him\"... well so much behind too.", "label": 0}
{"text": "> no choice but to order delivery\n\nEveryone has a choice.", "label": 0}
{"text": "It did, but not for long. I went down the rabbit hole on this one, and this aired in roughly 2006. People didn't start getting units until 2013/2014. And that was only a select number of people who pre-ordered the product, so there's a whole bunch who just never recieved the product at all.\n\nOf those who got a unit, they broke down relatively quickly after getting them and any reports to the customer service went unanswered. On top of that, the area where Eggxactly were based suffered a massive fire that pretty much wiped out the entire industrial park.\n\nThe website still exists, but is just a landing page with a picture of the product.", "label": 0}
{"text": "Who in the world thought acoustic pop would work? \n\nHer last one was good cause her music is a fast up tempo disco style pop \n\nThis one, is, like the others said...mid at best. Fire whoever came up with the idea of this being unplugged. And double fire whoever said being a childs xylophone for the main melody lines.", "label": 0}
{"text": "Wow who cares", "label": 0}
{"text": "yeah. just trying to remind ourselves not to get caught up in all of that since we all value genuine experiences. the dolled up produced aspects take away that. it gives us great recordings. but it’s good to remind ourselves that it’s all a huge production. these humble videos are sometimes stark reminders.", "label": 0}
{"text": "These people don't want to work, they never intend to keep the job dashing for money. They sign up just to get as many free orders as possible.  \"I don't have money for food, let's hop on the app and see if we can steal something good\".  Rinse, repeat until they are banned", "label": 0}
{"text": "> I'm feeling pretty superior to you right now.\n\nI sure got that impression.", "label": 0}
{"text": "singer/song writer. \n\nand id like to add i’ve heard much better who aren’t famous. but that’s not the point. she has a team, an audience, and it’s successful.", "label": 0}
{"text": "\"Mom! Bathroom!\"\n\nhttps://www.youtube.com/watch?v=yd1DDKwJWw0", "label": 0}
{"text": "Dude the same shit was said about slaves. They are paying next to nothing for most areas and taking the profits for themselves. DoorDash and all these other companies need to hire them as employees.", "label": 0}
{"text": "It's this, many, many people see this exact thing as a stop. If you ask them if they come to a complete stop at stop signs, they will say and believe the answer is yes, when they are actually rolling them, badly.", "label": 0}
{"text": "i have a feeling the npr people have a code or a principle they sit on for this production. but it’s also probably a dua lipa team decision based on the glock. \n\nimagine playing huge venues and having to dial down the set to this. all while people agree with you even if it’s not good because you’re a star.", "label": 0}
{"text": "Well as usual, Reddit over exaggerates the problem. They act like people stealing food or orders taking 2 hours to arrive is normal and happens every time you order on DoorDash or UberEats or whatever, which obviously isn't true.\n\nThe reason you shouldn't have food delivered is because it's overpriced and they hit you with a bunch of made up fees.", "label": 0}
{"text": "I'm not a kook on the corner yelling about a doomsday, so I recognize that any discussion regarding this is more or less inherently seen as unhinged. And I have no interest in seeming crazier than I am. I assure you I'm only a little crazy.\n\nSo I don't need to publicly explain to someone (more than I already have) who thinks everything is okay why everything is not and will not be okay. I'm just vaguely gesturing to everything, and that's enough for me. It's not meant to convince you if that's not enough for you, it's meant to commiserate with the other people who are already there.", "label": 0}
{"text": "My favorite memory of that time.", "label": 0}
{"text": "I believe the address was given in the video.", "label": 0}
{"text": "While I don’t doubt these stories a bit, not every state has such awful schools. My state isn’t particularly wealthy but still has schools in full repair. They have their issues for sure but the buildings are pretty good. The midwest and the south probably have the worst conditions.", "label": 0}
{"text": "So you boomers still didn’t came up with better rage baits, huh?", "label": 0}
{"text": "[I'll create a GUI interface using visual basic and see if I can trace an IP address](https://youtu.be/hkDD03yeLnU?si=PtCfL4DiW85uJTUa)", "label": 0}
{"text": "I call later today. Still room for at least 10 more.", "label": 0}
{"text": "I'm illiterate.", "label": 0}
{"text": "Biiiiiiiiiiiitchhh", "label": 0}
{"text": "I agree with everything except comparing it to slavery.\n\nSlavery had people completely trapped and DoorDash doesn't do that. \n\nPeople who sign up for the lowest paying job and then complain that it should pay more are completely different than people who are bought, sold, whipped, raped, and shackled for literally zero pay.\n\nDoorDash should be a gap-filler while you find a better job.  Or supplemental income that has a completely flexible schedule...  Unless, of course, you can't be reliable enough or trustworthy enough to hold a position anywhere else.  Then you're stuck with terrible employment your entire life.", "label": 0}
{"text": "I don't understand what you are trying to say", "label": 0}
{"text": "You’re hired!", "label": 0}
{"text": "Fuck.  I'm so sorry you went through that, it sounds terrible.  Do you have any relationship with your mother/parents now?  If so, how do they respond when you tell them of what the place was really like, do they believe you, or did the place convince your folks that you are lying about everything, and to essentially never believe anything you say about the place?\n\nThank you for sharing this, I can't imagine what it was like for you to live through that, but I'm glad you made it through to the other side.", "label": 0}
{"text": "even worse than the CSI(?) where youths are being brainwashed by videogames to commit GTA-crimes", "label": 0}
{"text": "I haven't had food delivered in like 2 years. I can go to a bar get a meal and a beer and tip the server for less than it costs to get delivery.", "label": 0}
{"text": "If you had any idea how wrong you are about this, you’d be ashamed.  \n\nThey gave him everything. Just because they don’t know the inns and out of how online relationships work, doesn’t mean they didn’t have great interest and invested a lot so he could be able to play as his body broke down. \n\nYou genuinely couldn’t have better parents. \n\nI suggest you watch “the remarkable life of Ibelin” \nOr read this \n\nhttps://www.nrk.no/dokumentar/xl/forst-da-mats-var-dod_-forsto-foreldrene-verdien-av-gamingen-hans-1.14197198\n\nAnd maybe consider deleting or editing your comment afterwards.", "label": 0}
{"text": "Weird, am Canadian, only ever heard it called a rolling stop.", "label": 0}
{"text": "Him and Birbigs", "label": 0}
{"text": "My point is many states have massively reduced spending on educations and there isn’t enough money to go to kids. Saying that school districts should spend more wisely is the same as saying millennials can’t afford housing because they buy coffee and eat avocado toast.", "label": 0}
{"text": "ever get 1 competent trustworthy person? could just pay that guy the extra and text him every time instead of going through door dash app.", "label": 0}
{"text": "The one time I used DoorDash, the guy put it on the wrong porch. My address is clearly visible from the street, and so is everyone else's other block. I called him and said where's my food? So he came back, picked it up from where he left it, and brought it to me. By that time, of course, it was cold.", "label": 0}
{"text": "> What I was referring to is people acting like they are doing a service and helping these people. Door dash traps them with no growth or ways to learn better trades. \n\nWhen I said they employ the unemployable, that was not a compliment.  It was a statement about how lax their requirements are for accepting \"talent\".  But yes, DoorDash is absolutely terrible to work for from what I've seen people say and the money they make per hour.\n\n>You also say they can just get another job but when you aren’t making much the majority of your time is working. So just having free time to find a new job is pretty damn hard.\n\nThey make their own schedules on DoorDash...  If they have an interview then they can very, very easily schedule around it and use the flexible schedule to find more work during the day.\n\nSome people may be trapped working for them.  But 90% of the time it's because of poor decisions/laziness and the other 10% are the people I truly feel sorry for.  The single mother who is trying to make just enough so she doesn't lose access to her benefits without actually.  The person with some severe medical issue that forces them to not be able to work on a set schedule.\n\nThat's a failure on government, though.  DoorDash is simply just exploiting those people.", "label": 0}
{"text": "🤣\nSo clearly written by people who have no idea how hacking works!\n\nLike you’re gonna solve it with only 2 people on a keyboard. Countering a hacking takes WAY more typing per second than 2 people can muster. Like, minimum 3. And even then they need to all the be Liberace on the keys. Third guy just stands there like an idiot making the other 2 type.\n\nTake a fucking CompSci class ffs 🤣🤣", "label": 0}
{"text": "Bitcoin solves this.", "label": 0}
{"text": "we assumed opposite genders, I thought the OP/doordasher was a dude..cuz reddit/doordasher/slacker boast = dude, and spouse I presumed female GM", "label": 0}
{"text": "I’m obtuse? Why do you think they give a shit about money? Why isn’t honoring your son’s memory and letting the world know what type of person he was enough? \n\nDo you think they ever thought about money when they were making sure he could live the best life possible? \n\nYou’re not even obtuse, you’re just vile and cruel. How do you live like this?", "label": 0}
{"text": "This is what happens when massive amounts of voters are told to vote for guns and freeDUMBS and vote for republicans at state and federal levels. Republicans want to privatize/make charter schools. They strip funding for education or make stipulations so sex education can only teach abstinence. All the while, blue state’s federal tax revenue is flipping the bill for red states. You reap what you sow.", "label": 0}
{"text": "Less expensive, not free\n\nAI - Maintenance costs: The Prius costs about $4,157 for maintenance and repairs over its first 10 years, which is $1,573 less than the industry average for popular hatchback models.", "label": 0}
{"text": "Hello /u/Superb_Notice_6683,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "But global warming isn't real! /s", "label": 0}
{"text": "> No guns sticker is likely for parents with conceal carry.\n\n\"And if a person was conceal carrying correctly, how would they know?\" \n\nWord for word from my conceal carry instructor.", "label": 0}
{"text": "Christ I forget how often this show is just Boomer Bait.  \"Computers are like scary magic, thank god the wise old mentor man knows about practical unplugging.  That's what *I* would do!\"", "label": 0}
{"text": "Scuse me folx, I'm a Field Reddvestigator, and I'll ask that all three of you come to a hearing at the Office of the Mod Advocate General this Monday to determine what words, if any, were placed in mouths, and/or if the comment was indeed adding to the conversation.\n\nSo Say Me All!", "label": 0}
{"text": "Yep. People do this all the time and not realizing they're screwing themselves. Buying home/renters insurance and claiming you live alone and no pets? Uh oh, just got a small house fire and a claims adjuster comes over to see that you clearly have a second person living in the house, along with indicators that you own a dog. Sucks to suck, hope you were saving up that $10/mo on the policy by not claiming them because insurance is either going to partially cover you or deny.", "label": 0}
{"text": "> I drive a Prius, the cost of gas is negligible, and repairs non-existent.\n\nI agree, cheap way to go, some day when you need to replace that car a cheap used Leaf or even a Tesla will be cheaper per mile to operate.\n\nmy last few cars from the Prius on were\n\n* 2005 Prius (totaled)\n* 2012 Leaf (still have)\n* 2012 Leaf (totaled)\n* 2015 Leaf (still have)\n* 2018 Tesla Model 3 (still have)\n\nRepairs on the Prius were non existent but it had oil changes and filters. Repairs on the EVs have been non existent and they have less filters and the electricity has been cheaper than gas the whole time.\n\nThe key was waiting for a cheap used one after someone did a lease return so I got the Prius and Leafs under $10k each and the Tesla was $20k.", "label": 0}
{"text": "whats the incentive to work harder, follow laws, save and make good choices if not to live in an area with better schools for my children?", "label": 0}
{"text": "There are a few not far from this in south west sydney that were pretty close to this about 10-15 years ago. There was a huge spree where they went through and fixed a bunch of them up thank god. Miller for example had a bunch of flammable \"fire retardant\" materials, Busby highschool is completely made out of demountable temp buildings(that just have a facade over them to make them look good) cabramatta highschool had(may still) whole hallways that were sunken in due to the floors rotting away.", "label": 0}
{"text": "> it has nothing do with billionaires.\n\npeople love pointing the finger at someone other than themselves and when you're at the bottom, its really easy to paint a target at people above you.", "label": 0}
{"text": "It's worth it to me.  I'm on Eastern time, but everyone I work with is on Pacific time.  This means I'm in meetings from 11am-3pm every day, the meetings don't stop until it's lunch time on the west coast.  Sometimes I have enough time to make some lunch, sometimes I don't.  DoorDash can get food to me faster than I can go get it myself, so DoorDash comes in clutch, but at a price.  However, I get free DashPass from one of my credit cards so that lowers the per order cost by $4-$5, plus there's a $5 monthly credit.\n\nI also have not had the bad experiences most are complaining about.  Out of hundreds of orders, I've maybe had 2 deliveries go to the wrong address, and whenever a restaurant has messed something up it takes 30 seconds to get a refund from DD.  I stick to high volume DashPass restaurants and they're usually on the ball and most of my orders arrive within 20-25 minutes.", "label": 0}
{"text": "lol what?", "label": 0}
{"text": "Where are you that a GM of a fast food joint is making $100k?  Most in my area are lucky to crack $40k.", "label": 0}
{"text": "Take heart! When DD/Ubereats is sold off to a whatchamacallit, one of those companies that restructures things? Well, the component parts once sold off will ensure a nice big billion dollar payday for those at the verrrrrry very top. \n\nThey in turn will \"retire\" to a house in a super safe quiet beautiful town, have assistants to ensure the pantry is always stocked with the best foods, and on occasion will attend a gala for The Poors where they'll generously fork over $5000 printed on a giant cheque for all to see! Either that or fly in (private jet of course) to NY and sit on one of several boards every month that each pays them more for a 2 hour meeting to nod and smile than most people will earn in 4 years.", "label": 0}
{"text": "Darude, sandstorm", "label": 0}
{"text": "Not to mention prices. My wife and I were ordering three boxes of wings from a Korean fried chicken place last night. A pick-up order from the restaurant's website was around $40. Delivery with Doordash would've been *$82*. Needless to say, we did pick up. Boundless greed.", "label": 0}
{"text": "So we’re sure this wasn’t Jeremy Clarkson?", "label": 0}
{"text": "It's all about how comfortable you want to be.\n\n You're gonna be more comfortable at home rather than walking outside so of course you're gonna pay someone to deliver it to you. And now you no longer need to think about whether or not you should order xxx today again or not, because you just do the order from home and now it's in the driver's ahnds, what can you do at this point right?\n\nIt's just rationalizing comfort and pleasure when people order shit to be delivered (unless real issues). The less you think about the order you're gonna pick up, the less you're gonna feel guilty or bad about ordering things you don't need. Then when the driver arrives and it's cold, it's not your fault right? It's because the driver took too long, right?", "label": 0}
{"text": "noone is hacking one work station. I mean hacking isn't like this at all we all know that but it would be the network getting hacked into and the valuable assets within the network would be on prem servers, not a workstation. So dude unplugged the only resource they had defending against the \"hackers\".", "label": 0}
{"text": "[Conflict Theory](https://www.simplypsychology.org/conflict-theory.html)", "label": 0}
{"text": "Yeah, once you get to a certain level, the money isn't as much of an issue and if your time is worth more than the time to go get it... then the math just works in your favor. I'm retired (unemployed?) and legwork and elbow grease are pure value adds to my day. I'm not calling a plumber and I'm cooking at home etc. \n\nI did enjoy my last dev job where we had free lunch in the office. Definitely a fan of the large orders to cover multiple days. I've always gotten the largest possible pizza, every time. No sense wasting a trip.", "label": 0}
{"text": "Dude couldn’t even steal the food fast, let alone deliver it in a timely fashion", "label": 0}
{"text": "Start arresting and charging them, with all the accompanying charges.  wire fraud, theft, etc.", "label": 0}
{"text": "Hello /u/MadWorldEarth\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "exactly, a buddy of mine dashes and has had multiple large vehicle expenses that have probably wiped out any profit/savings, but he keeps on dashing...", "label": 0}
{"text": "It's extra wild to me that the tip goes entirely to the driver and 0% to the restaurant.", "label": 0}
{"text": "Thank you, Mister Edgy.", "label": 0}
{"text": "Who dismissed it?  The show was dangerously popular to the point that it was single-handedly the reason why Superbowl Halftime shows are what they are today.  ILC was enormous", "label": 0}
{"text": "And if it's kept that way, it's probably going to be fine. But if anything at all happens, especially if it involves the firearm, the place of business has a clear way to legally go after them. Even if they aren't waving it around and shooting it.\n\nBeing caught carrying a firearm, especially if it's loaded, around defenseless school children is a great way to have everyone against you.", "label": 0}
{"text": "yes I'm the one being edgy.\n\nI'm sorry for engaging with you, I didn't realize you were looking for a fight.\n\nHave a good day dude!", "label": 0}
{"text": "They're comment just said they counted both of those as zero lmao", "label": 0}
{"text": "Whether or not money is wasted is solely decided upon by the person spending it. If they deemed it worth it, then it isn't wasted.", "label": 0}
{"text": "I literally caught a dasher doing this yesterday. I was on the phone so I didnt answer. Got a text with a picture of my food. Less than a minute later I got to the door and he's halfway up the driveway with my food. I chased him down and said if he gave it to me I wouldn't report it. He tried to say \"oh I thought I had the wrong address\" and I asked why he sent the picture if it was the wrong address\" and then took the bag from his hand before he could answer. I reported it, and without any discussion, Doordash just refunded me. I didnt want a refund because I got the food - I wanted that dasher fired. Instead, I get my money back (credit on DD) and the driver gets documented as 'not delivered' instead of 'tried to steal food.'", "label": 0}
{"text": "I'm sorry about that. I'm sure it must be debilitating.", "label": 0}
{"text": "I don't know we also have...\n\nCookie, rabbit - somebody talk to me!!!", "label": 0}
{"text": "Nah, it's a difference in culture. Delivery companies in Europe also don't pay their drivers enough, yet those drivers still use thermal bags and don't steal the food.", "label": 0}
{"text": "this has to be fake, how does one not see cameras in the building ?", "label": 0}
{"text": "fuckin n00b its 1337 h4x0rz", "label": 0}
{"text": "Remember if people get rich you have to think they are amazing", "label": 0}
{"text": "Dude looks super chill and down to earth. Would grab a beer with him!", "label": 0}
{"text": "going to need to be a group hug in this video.", "label": 0}
{"text": "Not sure what \"records\" he set at Washington for catches or receiving yards.  \n\nHis career high was 42 receptions, while his career high for yards was 611 yards.", "label": 0}
{"text": "Don't hate the player, hate the game. i guess.", "label": 0}
{"text": "this is old", "label": 0}
{"text": "My sources: \nBurverville in the Pacific Northwest paid $150,000/yr. That was 20 years ago.\n\nRuth Chris and Applebees GMs after bonus cleared $100,000 per year and that is in marginal to failing areas. 5 Guys more than that. There was servers clearing 6 figures part time in a beach town I lived at. That was all 10 years ago. Remember how Tuesdays were \"Hospitality Nights\" for cheap drink specials? I went to all those for about a decade and dated many a \"GM\" all over. Ever hire a guy and he steals from your purse in the break-room the very next day? These are some of the stories I would hear. \n\nFranchise driven stores pay nothing. I would hazard the \"GM\" at subway clears $35,000. If you don't have a P&L with bonus targets, something Dominoes does, are you really a GM? Or are you a glorified supervisor entry level manager? Yum Brands referred to their organization as a staffing company. Not a restaurant.", "label": 0}
{"text": "i mean, i am sure this is very real https://i.imgur.com/cevscxd.png", "label": 0}
{"text": "Agree 100%. I never use the apps, if I order food it's either on the stores website or calling and ordering. Even then - my family of 3 ordered a few weeks ago, sandwich, burger, chicken fingers for the toddler, one drink and some fries was like, $55, before tip. I'm far from poor, but holy crap, I can make like, 5 meals with $55. And my burger was cold.", "label": 0}
{"text": "Hello /u/EstablishmentLate532\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "It's.... right there? In the title of the post and video?", "label": 0}
{"text": "I have a stop sign right in front of my house nobody stops at. We have a walking trail right next to it that we walk my dog with a bladder of a walnut, so its about 4 times a day.. i kid you not I'm nearly hit half those times. \n\nI've sent 2 emails to the police community outreach address. Each time I've gotten back messages saying a combination of since there aren't any records of recent accidents or injuries involving this street, its simply not worth their time. Mentioned it to a cop from my city in person and he laughed at me. \n\nShit, I've laughed at me! Nobody gives a fuck other than my little dog. \n\nLast week a girl on her cell phone took out my mailbox and my neighbors mail box as she speed down the street. Didn't stop, just kept going. We heard it, just went back into the house said, fuck it, we'll pick up the pieces in the morning. Cop bangs on my door at 6am and says \"sir did you know your mailbox is down the street?\". I said, yea, so dipshit crashed into it last night.. he says.. \"why didn't you call?\". because nobody gives a fuck.", "label": 0}
{"text": "Hello /u/Domestiicated-Batman\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "It is, but the unsaid judgement from other people hurts almost just as much, and I'm never quite sure if the unsaid piece is real or not.", "label": 0}
{"text": "Disturbingly, the worst answer. But the adults that support him are the ones that do damage.", "label": 0}
{"text": "Yeah, well said. Poor dude never had real support.", "label": 0}
{"text": "Not surprising, just sad.", "label": 0}
{"text": "Dude quoted Drake and said, \"This a Rollie, not a stop, shit don't ever stop\" -Nonstop.\n\nHe didn't say that... But I thought it", "label": 0}
{"text": "WHAT YEAR IS IT?", "label": 0}
{"text": "Ahhh, see, I'm in the Midwest.  Pacific NW, that absolutely makes a ton more sense.", "label": 0}
{"text": "I am perpetually happy that things like this and the movie [Hackers](https://youtu.be/Bmz67ErIRa4?si=3dBfhjRl2_lU6UwG) exist", "label": 0}
{"text": "Her name is Haliey Welch, she’s already has a reality tv show and podcast on top of her merch. She’s just starting and already above $12 million net worth.", "label": 0}
{"text": "The idea is a stripped-down vibe, though. No shade on Dua Lipa, it doesn't work for everyone", "label": 0}
{"text": "[Enhance](https://youtu.be/KiqkclCJsZs?si=5LofGp7wbMIsK4rK)", "label": 0}
{"text": "Hello /u/leftofhollywood,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Similar stop sign antics, but there is a nice little racial undertone, \"the officer who responded to the suspicious black male call\".. \n\nhttps://www.youtube.com/watch?v=R09B8Jnwj8Q", "label": 0}
{"text": "It's not just \"Don't bring a gun in here\". At least in Kansas, the sign is a legal ban on even conceal carry. So even if you're concealing it properly, you're breaking laws for your emotional support weapon. And at that point, what other gun laws are you willing to say don't apply to you?\n\nThe gun genie is so far out of the bottle in the US that it's never going back unless very drastic actions are taken and I don't think anyone is going to get that to happen. So hoping people at least follow some laws around their weapons is the best some places can hope for. And Kansas doesn't even require a conceal carry permit, you just have to be 21.", "label": 0}
{"text": "no.", "label": 0}
{"text": "Don’t forget “moxie” and “go get ‘em-ness”", "label": 0}
{"text": "Yeah but it's a TV show. It's got to be visually interesting as well as move a story along. \n\nYour average NCIS viewer isn't going to want to watch a bunch of nerds pounding on their keyboards at DEF CON, especially not in the 2000s when this show was on.", "label": 0}
{"text": "No? Celebrities aren't \"human\" enough until they make themselves human in front of our eyes - at least it can feel that way with regards to the human experience. Don't be a hater.", "label": 0}
{"text": "Class.", "label": 0}
{"text": "None of that means anything", "label": 0}
{"text": "Hello /u/Vivid_Debt_6188,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "That's a fun way of wording that question. \n\nAs a self employed individual, DoorDash doesn't *give* me any. Like any other self-employed person I rely entirely on proper budgeting and planning to account for missed days. \n\nMy spouse has what you'd probably consider a proper job, my income is purely supplemental to the family. I know what I need to bring in every two weeks - so as long as I've brought that amount in - sick days and personal days are any day I feel like. I don't need to bust my ass for the right to take a vacation or time off - only to have the request denied or made to feel guilty about taking time off, or worry about finding coverage if I'm sick - I can just not go out, stress free. \n\nAs the at-home parent to a highly special needs non-verbal child  - I cannot have a \"job\" as it were. As I need to be available in an instant for issues many times with no notice.  This allows me the freedom to bring income in, in a way that suits my own schedule needs.", "label": 0}
{"text": "Thanks for mentioning this. People don't realize there are probably a million deliveries a day and we see maybe a few bad ones every month but that's what sticks.", "label": 0}
{"text": "They kind of switched it after Mark Harmon left. Bill Lumbergh from Office Space (Gary Cole) is running the team now and he is a \"tech-guy\".\n\nI guess they realized than we are in the 2020s and even boomers now use smartphones and apps and group chat.", "label": 0}
{"text": "I've had many foods like subs and pizza (not just pepperoni which is alright cold) ruined because the drivers drove in complete opposite directions from the restaurant instead of picking it up for 30+ minutes. I get a lot of them multi-app but it definitely sucks when you're starving and already very excited for the meal. Some services will re-imburse if the food is cold a few times but it's never much.", "label": 0}
{"text": "Pop him right has he comes out of the womb. \n\n\nEasiest fight ever with the exception of the screaming lady. ", "label": 0}
{"text": "> calls someone Mr Edgy\n\n> Unironically says \"Look in the mirror'", "label": 0}
{"text": "Still need no reply.", "label": 0}
{"text": "is there anyway i can appeal this? i'm not a spammer if you'll take my word on it.", "label": 0}
{"text": "This could easily be remedied by getting off your fat ass and going to pick up your own food.\n\nDoucheDash and its shitty ilk exploit the customers, the restaurants, and the drivers, all in multiple ways. Stop supporting that garbage because you're too laaaaaaaaazy to pick up your 3,000 calorie crap.\n\nNote: This does not apply to you if you cannot reasonably be expected to go get your own food due to injury, disability, or illness. \"I don't feel like it,\" however, is not a valid excuse.", "label": 0}
{"text": "I love that he also refers to it as the \"dududu-sound\".", "label": 0}
{"text": "You didnt answer his question. His *extremely* serious question.", "label": 0}
{"text": "No, there are lots of flat earthers that genuinely believe the earth is flat. Sure, there's some grifters and plenty of trolls, but the core of the flat earth community are true believers.", "label": 0}
{"text": "Don’t sleep on [I Can Feel The Beat](https://m.youtube.com/watch?v=ilCtyT3g2iU&pp=ygUTaSBjYW4gZmVlbCB0aGUgYmVhdA%3D%3D)", "label": 0}
{"text": "Yeah, like usually if anything I'll order ahead and grab it myself.  The once a year I get something delivered, it's from a place that runs its own delivery like Dominos or something.\n\nLast time I did that it was pouring rain and I gave the lady a fat tip ahead of time to drop it off under the covered porch.  Was still cheaper than doordash.", "label": 0}
{"text": "Finding unique melodies in modern music is a fools errand. There is almost nothing you can do that hasn't been done in some fashion possibly decades before you thought of it. The chromatic scale is 12 notes and most singers have a 2 to 3 octave range. That doesn't give a lot of wiggle room for originality.", "label": 0}
{"text": "Someone showed up and started playing a trombone in my yard, I would probably be curious as well.", "label": 0}
{"text": "\"Hee hee hee! We're doing something that easily gets us caught!\"", "label": 0}
{"text": "The parents whose kids attend these schools know the conditions. It’s the fact that families with money, in these districts, form charter schools, go private, or outright move across town to the affluent school district once they have kids. Their argument is never, “we just need to band together and raise money”, it’s always “I have to do what’s best for my child”. \n\nThe other half of the population doesn’t have kids and either are oblivious or outright don’t think they should pay taxes for schools when they’re not using them. In urban areas, our current state is the culmination of 60 years of this rational, since school integration after Brown vs Board of Education.", "label": 0}
{"text": "Hello /u/Low_Squash_3005\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "A single compromised workstation can absolutely be the first entry point for a hacker to attack an entire network.", "label": 0}
{"text": "Hello /u/ComedianNo7200,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here. This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old. You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "Shit, I'm working on an Atari 2600 game myself. That thing is always getting new games", "label": 0}
{"text": "Animal husbandry is allowed in Texas.", "label": 0}
{"text": "\"my car does not cost anything to run\"\n\nYes Toyota will replace your Prius for free when it hits 300k", "label": 0}
{"text": "Well deserved. Get your own fucking food.", "label": 0}
{"text": "He's pretty amused as he goes to grab the camera to show the video haha", "label": 0}
{"text": "He's rockin it", "label": 0}
{"text": "\"It's got one view and was uploaded at 6am\"", "label": 0}
{"text": "yes. but there was a point in my life, due to being depressed, where i just didn't want to leave the house. and with a WFH job, i had fewer and fewer reasons to.", "label": 0}
{"text": "If you’re looking at bones on your computer and your computer catches on fire, the only logical conclusion is that the virus is *in* the bones.", "label": 0}
{"text": "Every zip code is a stark example of what money does for academic success. It’s no surprise that the most financially, housing and food secure zip codes also have the highest grades. \n\nYour argument is the same tired self-serving rationale that those with enough money to move across town have made since school integration put POC in white schools 60 years ago. “I just want what’s best for my kids. Those people don’t share my values. They need a stronger work ethic.” They’re escapist excuses to make community issues into other peoples problems.", "label": 0}
{"text": "In a former life I was a money courier. Hauling cash to and from banks and atms. Cash transfers are largely 20's. I could easily carry $200ish in 20s. But I had to have one hand free. Straight carry cash weight I feel like I could carry 500k.", "label": 0}
{"text": "I’ve never used DoorDash, never will. Even during Covid I went to the physical location to get my food and with the amount I saved I probably paid for a month’s rent. Plus, with the calories I burned walking I probably offset the garbage I ate.", "label": 0}
{"text": "Not gonna lie, I was waiting for a jumpscare where he'd just blast the ball at the camera.", "label": 0}
{"text": "get some help buddy ... remote therapy and mindfulness work until you are able to get back at it", "label": 0}
{"text": "Yeah but we need a few billion for fracking next year.", "label": 0}
{"text": "I mean, it’s the gub’ment… they can’t afford a keyboard for EVERYbody!", "label": 0}
{"text": "The story is leaning more and more towards the mother being the murderer here as the days go on, so now I must respond by telling you to absolutely STFU.", "label": 0}
{"text": "It is now, goofy.", "label": 0}
{"text": "lol I thought this was a family friend of mine at first. He had an almost identical setup for the same kind of bulls.", "label": 0}
{"text": "I still laugh at the one in Limitless where he says \"We got his hard drives\" while holding up a PSU.", "label": 0}
{"text": "\"they\" aren't. But romhackers are.\n\nThe way the nes worked, it could actually display any image at 60fps in 56 colors as long as the image data could be put on the PPU bus fast enough. So if you offload all the processing, to say, another computer, then a stock, unmodded, NES can \"run\" any software ever written, such as [doom](https://www.youtube.com/watch?v=FzVN9kIUNxw).\n\nThis is why the graphics of NES games got better as time went on, despite the hardware being the same. The cartridges had more memory and some gained coprocessors to handle the increased workload. As long as the cartridges could dump data to the ppu fast enough, they could make anygame they wanted.\n\nOf course at the time, it was not feasible to put an entire SBC in cartridge format, so they used the one provided in the base NES. hence why they all looked the same, even though there was no real hard requirement that NES games look a specific way due to how the PPU was implemented.", "label": 0}
{"text": "Hello /u/Hellakittehs\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "That’s fascinating. When you say you had have one hand free, is that a security thing so you can have access to a firearm?", "label": 0}
{"text": "Hello /u/BinomialInquiry,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "\"Just like any other school\".  Yeah no. Not at all.  Even being in MS, schools aren't this bad.  Geezus. I mean, goddam, the schools I went too look like fucking private schools in comparison.", "label": 0}
{"text": "> Most in my area are lucky to crack $40k.\n\nFor the GM? McDonald's by me is hiring at $18/hr, cash sign on bonus, and tuition assistance for the lowest level employees.", "label": 0}
{"text": "Insurance is quick to total a car that's only worth $5k. Since I was buying them cheap and keeping them as long as possible they were about 10-12 years old when they got totaled.", "label": 0}
{"text": "The next time I get hacked, I need to remember to get someone next to me at the keyboard to help with the typing.", "label": 0}
{"text": "[Foil](https://www.youtube.com/watch?v=urglg3WimHA)", "label": 0}
{"text": "80 billion Slava Ukraine", "label": 0}
{"text": "I suggest following him on twitch. Very cool streams eventho they are filled with commercial attitude.", "label": 0}
{"text": "Definitely got a little joyful surprise the first time he did it, and then said it again.  I guess that's really the best way to talk about it.", "label": 0}
{"text": "Yo, listen up here's a story", "label": 0}
{"text": "Yeah, they were well aware of their main audience age range and knowledge of modern technology.", "label": 0}
{"text": "Where did you get \"fashion contest\" from?\n\nLike I said, mold is an issue. Also, the asbestos wrapped pipes and probably floor tiles are less than ideal.\n\nNo one, however, is going to be electrocuted by fiber optic or low voltage cables.\n\nThough it's no doubt horrific that the children have to \"navigate\" doors and stairs, and then be exposed to, you know, weather. I'm aghast that each poor unfortunate child is not equipped with a servant to carry an umbrella and heater for them as they traverse the dangerous trek to the trailer 50 feet away.\n\nhttps://youtu.be/Qn7QrOFgqk0?t=599\n\nOr that the students, while they may be safely behind a damn fence, might be inadvertently exposed to (gasp) workers.\n\nhttps://youtu.be/Qn7QrOFgqk0?t=632\n\nThe sinks are secured by a purpose made metal bracket, so, you know, the children can climb all over them, but that bracket is, what, aesthetically unpleasing?\n\nhttps://youtu.be/Qn7QrOFgqk0?t=194\n\nOr, again, there's a tragic fence that \"could be scaled\". Terrifying. \n\nhttps://youtu.be/Qn7QrOFgqk0?t=329\n\nDo I need to link the part where the bathrooms are inconveniently down the hall?\n\nIn short, yea, a goodly portion of this seems like 'fashion contest\" crap.", "label": 0}
{"text": "Surprised it was 1080p...\n\nGuess not quite as old of a video as I thought it was.", "label": 0}
{"text": "Ocean Man", "label": 0}
{"text": "That's exactly what I expected lmao", "label": 0}
{"text": "Idk I just saw a Walmart employee video and it definitely looks like she couldn’t have done it to herself. Which would mean someone put her there right?", "label": 0}
{"text": "Hello /u/slayez06\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "https://www.youtube.com/watch?v=1YCOT5LasKc&ab_channel=ComedyCentral", "label": 0}
{"text": "[There's also a video about the making of that](https://www.youtube.com/watch?v=epnsRRPtoeU)", "label": 0}
{"text": ">Have you tried paying your contractor more like it. living up to your username\n\nThat's not really it, bud.  Uber eats should be paying their contractor.  *I'm* paying for *food*.  I'm then posting a company whose entire business model is facilitating delivery of said food.  If that company wants to then contact that task out to private citizens, it is between *them* to negotiate fair pay for the labor performed. \n\nThere is no employer-employee agreement between me and the Uber eats driver.", "label": 0}
{"text": "A small handful of companies promising to maybe one day produce 1% of their power via SMRs isn't the market choosing nuclear. \n\nEspecially when most of then will profit from a stock jump in the very SMR companies they'rs buying headlines for as they own them.\n\nIt does, however, distract from the massive emissions from their data centers burning gas to run.", "label": 0}
{"text": "If they don’t have your DNA on file, then it’s probably not a huge mistake to leave the gloves unless they suspect you for some other reason and get a court order to take a DNA sample after the fact (or do so surreptitiously).\n\nOnce you have the million, just stay out of trouble and they’re unlikely to be able to connect the DNA to you, unless you’re stupid and voluntarily submit your DNA somewhere. \n\nBut yeah, leaving the gloves was not a good idea since if they suspect you for any reason, the DNA would confirm it.", "label": 0}
{"text": "I feel like the success of this track couldn't have happened to a more grateful and kind man.\n\nI am ambivalent about the track, but I am over the moon that it gave you all of this my friend.", "label": 0}
{"text": "All about how my life got flip turned upside down so if you have a minute just sit right there and i'll tell you how i became prince of a town called bel-air", "label": 0}
{"text": "All of the countries far enough north for this to matter have massive hydro and wind resources.\n\nAnd even then, in many of them solar is still cheaper than coal for 10 months a year.\n\nSolving 100% of the problem for 95% of the population and 80% of the problem for the other 5% is 98% of a solution. Then existing wind and hydro solve 75% kf what remains\n\nDelaying 99.5% of the solutinlon because of some imaginary inability to find ways to deal with the 0.5% is insane.", "label": 0}
{"text": "Why does the thumb to this interview looks as if Mr. Darude \"Sandstorm\" has been the jungler for Fnatic last year.", "label": 0}
{"text": "I have a condition that means I can't drive; sometimes I didn't wanna spend almost 1.5 hours navigating public transit for my favorite Chinese place, and they don't deliver.", "label": 0}
{"text": "Hello /u/jayo,\n\nThank you for your submission. Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma. We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*", "label": 0}
{"text": "You do understand that he just explained that he's making *more* than what factory workers are (even accounting for costs of car stuff), *and* has a much-lower stress job, *and* sets his own hours, right?\n\nIt sounds like he's getting exactly what he wants.", "label": 0}
{"text": "I wonder how many takes that took. There must be some funny outtakes out there somewhere.", "label": 0}
{"text": "That lives in a blue world", "label": 0}
{"text": "Sure Skippy.  I'm going back to college at 65 after already having a degree and a career, and being retired for 12 years.", "label": 0}
{"text": "One mine in Australia smaller than a mid sized uranium mine like Rossing  produces enough lithium to produce batteries for 2.5TW of battery backed PV with an average output of over 400GW or 30% higher than the entire nuclear industry\n\nThis is before even starting to recycle the first generation of batteries.\n\nPearl clutching about lithium mining impact (or anything else in the renewable + battery supply chain) then trying to say uranium is better is nonsense.", "label": 0}
{"text": "https://i.imgur.com/lmyAbbZ.gif", "label": 0}
{"text": "Is your problem \"spacex is taking money from the government!!!\" \n\nYes that is how it works. The government pays private companies money to do something they cant\n\nAnd space industry is not that costly compared to other stuff. The new tech you make actually covers up the expenses i am pretty sure.\n\nSo your \"we taxpayers might be funding that is something worthless\" is also out of the window.\n\nAnd your other argument \"spacex is so behind schedule\" yes but that is the best you got. You either work with them or work with another company that is so behind spacex.\n\nThat is how space industry works it's nothing new.\n\nAnd you also said \"well if spacex was national instead of private then i wouldnt have so much issues\" \n\nWe already have that. Its called NASA. The government is not perfect. Sometimes private companies are better at their job than the government. If you went crazy and somehow nationalized spacex, then that is no longer spacex", "label": 0}
