{"text": "Kat is a fucking moron ***AND*** he knew a few funny things about Diddy, THATS FUCKING IT", "label": 1}
{"text": "Answer to thumbnail: We can only hope.", "label": 1}
{"text": "Please do.", "label": 1}
{"text": "Why are you wishing death on someone?", "label": 1}
{"text": "We? I don't wish death on this guy. Maybe you do, but not all of us have terrible thoughts like that.", "label": 1}
{"text": "Just made this the other day...", "label": 1}
{"text": "He clearly didn't stop but couldn't handle being wrong so then he changed the argument to something about being a man or coming to the window. Overall weird behavior.", "label": 1}
{"text": ">Overall weird behavior. \n\nInner city and in a truck. It would be weird if he wasn't an asshole.", "label": 1}
{"text": "If he thought he actually stopped he might be the dumbest little boy on the planet", "label": 1}
{"text": "Obviously a Trump supporter", "label": 1}
{"text": "Not defending stealing food for sure but there were many times while doing deliveries where the fees plus tips are barely covering gas and wear on my car. I won't lie, there were more than a few times where taking the food and dipping seemed more worth my time than actually completing the delivery.", "label": 1}
{"text": "Ok but why didn’t you just get your fast food yourself?", "label": 1}
{"text": "Because they have the disposable income to treat themselves?", "label": 1}
{"text": "it's a service that exists. That is like seeing a tax dude committing fraud and saying \"OK, but why didn't you do your taxes yourself?\" Convenience is a commodity. You should learn to blame victims less. Maybe stop beating your SO for talking back.", "label": 1}
{"text": ">Not defending stealing food for sure **but**\n\nOh boy, here we go...\n\n>there were many times while doing deliveries where the fees plus tips are barely covering gas and wear on my car. I won't lie, there were more than a few times where taking the food and dipping seemed more worth my time than actually completing the delivery. \n\nWhat the fuck are you talking about? Just don't take the order instead of defending theft, thief.", "label": 1}
{"text": "Inner city?", "label": 1}
{"text": "Why don't you just cook it yourself?\n\nWhy don't you just grow the ingredients yourself?\n\nWhy use a service that exists? Are they stupid???\n\n/s for anyone that needs it", "label": 1}
{"text": "How is that relevant?", "label": 1}
{"text": "Not getting paid enough is not justification for you to steal from someone else.", "label": 1}
{"text": "Holy shit. Touch grass dude. ", "label": 1}
{"text": "Touch it every day. Living joys, anguishes and more. your inability to see other people is not my problem.", "label": 1}
{"text": "I like how you refer to DoorDash customers as \"victims.\"", "label": 1}
{"text": "Not defending the behavior but that’s obviously a work truck there’s a headache rack and it’s scratched to shit. Some people drive trucks it ain’t that deep", "label": 1}
{"text": "OK turns out you are actually a different guy and you just echo the dumb shit the first guy said. You're still defending victim blaming, you get that, right? Tax fraud, fast food theft, it's still trusting that the service you pay for will be carried out.", "label": 1}
{"text": "I refer to theft victims as victims.", "label": 1}
{"text": "I am saying that the parallel is the same. It's the victim of a crime. whether it's tax fraud or or food delivery, the whole point was that you hired somebody to provide a service and they betrayed you. I am accusing you of victim blaming because you replied in support of a commenter who was directly victim blaming. I can understand that it was not your intention but given the context and timing, it seems that way.", "label": 1}
{"text": "How? https://ibb.co/cb12g86", "label": 1}
{"text": "What if I have an outie?", "label": 1}
{"text": "This comment is more pathetic than any of those people my dude.", "label": 1}
{"text": "I see dickheads like this literally every day blowing through stop signs at a library next to an elementary school. They will stop and verbally harass you just for giving them the finger.\n\nNo, they won’t get out of their 3-ton losermobiles.\n\nSuch tough guys.", "label": 1}
{"text": "That’s the problem with app delivery drivers, they’ll find any justification to steal. I drove a yellow cab for years before Uber killed my business and some days it was back to back to back bullshit five dollar jobs. Some weekdays I’d be out there for eight hours and just give up because I’m barely making minimum wage. I didn’t use that as an excuse to rip off my customers because I knew tomorrow would be better.", "label": 1}
{"text": "No sign of practical truck use? What a dumb thing to say. Everyone that wants to move something ever, their first thought is who do I know with a truck. Is he supposed to be driving around with lumber in the back to appease your judgement of his owning a truck? \n\nAlso the guy is a dick for sure, just the truck comment is so bizarre.", "label": 1}
{"text": "It's also a Ram 1500, [literally the worst drivers on the road.](https://www.autoblog.com/features/study-ram-has-the-worst-drivers-of-any-auto-brand) \n\n> A recent study from LendingTree found that drivers of some brands rack up more accidents, DUIs, and other citations at much higher rates than others.\n\n>Ram drivers were the worst of the 30 brands LendingTree analyzed, with 32.90 incidents per 1,000 drivers between November 2022 and 2023.", "label": 1}
{"text": "I think he meant \"in **her** city\" in reference to the woman in the video.", "label": 1}
{"text": ">obviously a work truck there’s a headache rack and it’s scratched to shit.\n\nThis implies that 1) you can't have a headache rack without being a work truck, 2) only work trucks get badly scratched, or 3) a combination of headache racks and scratches can only apply to work trucks \n\nAll these points (1, 2 & 3) are all false. This is most likely a guy who just happens to own a heavily scratched truck with a headache rack. I personally know half a dozen people who have such vehicles. A ***real*** indicator that a vehicle is probably a work truck would be a decal somewhere on the vehicle with the business he works for on it, and even that isn't 100%.\n\nThe only possible way you could have meant \"work truck\"  is in the colloquial sense that it's his personal truck that he drove to his place of work, which still wouldn't matter because people can drive whatever personal vehicle they want to work, regardless of what it looks like. So nothing in your comment holds any merit.", "label": 1}
{"text": "I can think of lots of things that \"can and have been done\", doesn't mean it's the best way to do it or the most logical way to do it. The fact you suggest bed extenders is just laughable.\n\nFirst off, a moving van is *absolutely* the first choice if you are moving things. An enclosed space means no chance of your load falling off and no damage from wind, rain or other staff that might fall onto your vehicle (there's a rendering plant just outside of Edmonton that I used to work at and we definitely had complaints about entrails falling off on the roadways). Also less likely someone will steal anything from your vehicle if you have to park because if they can't see what's inside it they probably won't bother going to the trouble of finding out, unlike the bed of a truck where it's easy to see and grab.\n\nSecondly, if for some reason you can't fit it in a van the next best option would be a trailer. Depending on your need this can be flat deck or with sides. Still way more room than your box and leaves your rear view less obstructive. And depending on the kind of trailer you might not even need a truck, just need to have the right hitch. \n\nI've moved plenty of times in my life, helped others move as well and my dad owns his own trucking company so I've seen a lot. Trucks generally aren't the best choice", "label": 1}
{"text": "LoL, I never officially knew this, but in my gut I knew this to be true. It's great to finally have actual stats to match my assertions.", "label": 1}
{"text": "\" it ain't that deep\" dude was right. \n\nGet over yourself. Plenty of assholes in trucks. Plenty of people drive trucks to work too. Plenty of assholes in BMW and on motorcycles. Only thing I know for sure is you are talking out your asshole.", "label": 1}
{"text": "Bro just admit you wanted to make the trendy \"hurr durr he drives a truck but doesn't use it\" comment when you don't have anything to back that up other than a 60 second video that gives you no information.", "label": 1}
{"text": "Sorry, It didn't register to me initially that you meant a moving van.  Usually the response to these kinds of threads is people suggesting regular street vans are better than a truck bed for any and all scenarios.\n\nWhat you say is all true.  But it also kind of applies to people who where moving shit is an few times a year event.  There are a lot of people that just on a whim may need to move things that they either don't want/need in an enclosed space.  Trucks are kind of great for that all purpose-anytime-anywhere kind of thing.  \n\nI occasionally do wood carving as a hobby.  I can't tell you how many times I wish I had a truck bed to throw some chopped logs in as i'm just driving around daily.  Not having to piss around finding a truck or van or trailer to rent or borrow every time I wanted to pick up something like a large appliance would be just a bonus.  \n\nSome people really do move things a lot.  Some people plow or tow occasionally.  Some people like being the guy everyone calls when they need to haul something.   \n\nThe truck is an all purpose jack of most trades vehicle.", "label": 1}
{"text": "So truck owners suck for owning a truck and you are smart because you will pay someone who owns a truck to move your stuff for you? Got it.", "label": 1}
{"text": "Pavement Princess, that’s what this is. They crave emasculation.", "label": 1}
{"text": "Nope, just pointing out there are options to your,\n\n\"**Everyone** that wants to move something **ever**, their **first thought** is who do I know with a truck\"\n\nstatement.", "label": 1}
{"text": "Yep, start an argument with the wrong meth addict and your game of life is over. Not worth it.", "label": 1}
{"text": "Squeaky wheel gets the grease. Complain to the police department and if they have nothing better to do they might camp out your intersection and see if they can catch anybody.", "label": 1}
{"text": "Oh, Minowaman... You silly sausage, fighting in Openweight fights against people almost twice as heavy as you...", "label": 1}
{"text": "Such a tranquil sound; it calms my soul.", "label": 1}
{"text": "Another fucking idiot who thinks capitalism invented everything…", "label": 1}
{"text": "I hope Buzz Aldrin finds you and punches you in the face", "label": 1}
{"text": "you are clearly over educated and under socialized, go talk to some people and get off Reddit, idiot", "label": 1}
{"text": "wow", "label": 1}
{"text": "Nice", "label": 1}
{"text": "Shoutout to eggdog! Check out their merch at [https://eggdog.shop/](https://eggdog.shop/)", "label": 1}
{"text": "Never understood the appeal of this.\nIt's so stupid.\n\nLike, unfathomably stupid.", "label": 1}
{"text": "My mother saw 2001 in the theater when it came out. She said “I was sitting there sobbing and I didn’t know why”", "label": 1}
{"text": "If what you're doing is mocking a group of people who do not have the population, the money, and the resources to equally defend themselves against you, then what you are is a fucking bully. You're the big bratty kid who runs around the schoolyard and picks on the smaller kid in order to feel better about themselves because you're a loser who has to cut other people down in order to feel like a winner.\n\nAnd of course, we're in a world where the small kid gets up and defends themselves, and the big bully runs off to his buddies and starts whining that he's the victim, and too many fucking people believe that bully because there are too many people nowadays who take the idea of common courtesy as a personal threat against them.", "label": 1}
{"text": "I'll answer like Heavy Weapons Guy from TF2: \"Maybe ... maybe.\"  But then, I'm old IT guy, and to quote Bullet Tooth Tony: \"Never underestimate the predictabillty of stupidity....\"", "label": 1}
{"text": "ahh poor little man child can't take off work", "label": 1}
{"text": "To be with his newborn daughter? Man some people just hate positive parenting.", "label": 1}
{"text": "A lot of people have bad things happen to them. A lot of people never develop empathy or compassion. With out these they cannot understand they were abused/neglected. So they further the cycle because the idea someone get better than they did devalues themselves in their own eyes. It's why the same people grow indignant rather than proud when their kids climb higher in life than they did. Also why they start saying things like \"my child hasn't spoken to me in 10 years.\".", "label": 1}
{"text": "I’d imagine this is similar to FMLA leave, which needs documents filed through work.", "label": 1}
{"text": "🔥For something more attractive, come to my exclusive corner🔥\nHot skinny girl with content updated daily!❤️\nExclusive videos every Friday - only for those who can appreciate😈low flow", "label": 1}
{"text": "What s shit response. Say you treat your employees well but tell a random redditor to fuck off. You sound like a peach to your employees", "label": 1}
{"text": "Halsey's voice in this performance gives me chills every time!", "label": 1}
{"text": "Okay? I never said they say it with any sort of regular basis or capacity. You make the blanket statement \"black people don't say that\" and then tell me I'm the one playing dumb. Lol get a grip.", "label": 1}
{"text": "hi", "label": 1}
{"text": "His apology explains that he's changed his views since then. It's been more than ten years. I'm sure you did stupid shit in your past that you would cringe to think about today.  Do you think people are cast in stone and incapable of growth and change?", "label": 1}
{"text": "500.....*nigger*? wtf", "label": 1}
{"text": "Do you know how fucking retarded you have to be to fuck up in these ways. Jesus fucking christ. Its fuckin insane", "label": 1}
{"text": "Really lame of you to be sending Reddit care messages to someone else just because they left a comment saying something you said was bullshit, when it was indeed bullshit. \n\nYou should know you can get in trouble for abusing that feature. I hope this other person reported you for it.", "label": 1}
{"text": "This guys is a true embodiment of everything that is bad about social media and \"Influencing\". \n\nHis shitty behaviours included:\n\n* Racist and obnoxious behavior: Making racist remarks towards Japanese people, refusing to pay for public transport, harassing women, and inciting conflict with others.\n* Exploiting the Israel-Palestine conflict: Using the conflict as content for his streams.\n* Harassing and silencing critics: Attempting to take down videos and silence critics who speak out against him.\n* Criminal activity: Illegally entering a construction site, getting arrested multiple times.\n* Lying and deceiving: Lying to authorities and his audience.\n* Sexually suggestive remarks: Making creepy comments about underage girls.\n* Other inappropriate behavior: Stealing an old lady's dog, entering private homes without permission, running on top of cars.\n\n(Disclosure: I got an AI to make this list from this video: [https://youtu.be/O6Nd0uf0jU4](https://youtu.be/O6Nd0uf0jU4) but the comment is mine.)", "label": 1}
{"text": "That's not much of a believer in FAFO to me bro. I don't care if he's not going to punch back. If he wants to go to other countries and stream himself disrespecting the people there, workers, women, culture, etc. And then CALL PEOPLE OUT TO FIND HIM, then good, I hope they DO FIND HIM. \n\n  \nPeople are doing the exact same thing as him and MORE? Okay, go ahead, link someone here. \n\nPeople take the time out of their day to go and knock the shit out of someone disrespecting their countrymen, their culture, and their homeland, from some dumb prick who wants to act like a fool. \n\nThe people who go out and find him are doing something productive with their time. They're standing up for their people against some foreign idiot coming and disrespecting them. \n\nThe fact you would even TRY to defend his actions in ANY WAY and try to say he \"Lives in yall heads rent free\", when someone is doing shit like that, just shows to me, in my own opinion, that you're kinda a sucker bro. If you think people are wrong to stand up to someone and check them for shit as disrespectful as he has been doing, then that's on you, but it's some bitch shit in my book. \n\n  \nI'm in the Philippines, please, let him choose to come here.", "label": 1}
{"text": "Much like the UK guns are restricted in Korea.. but knives are not.  It’s probably only a matter of time for him if they’ve restricted him from departure.", "label": 1}
{"text": "Bro americans in america do worse than this to other americans!!\n\nYou ahould switch those sentences around, as an american, you are deeply ashamed.  This guy is what the world thinks is a typical american, disgustingly racist /hateful and deserving of what they get.\n\n\nOuch that even hurt me to say.", "label": 1}
{"text": "Kind of hoped the Yakuza would deal with him when he was in Japan.", "label": 1}
{"text": "Why would you wish him on the Yakuza? What has organized crime ever done to deserve this asshole?", "label": 1}
{"text": "People just need to stop giving him attention and he will go away. There is no need to wish death on anyone.", "label": 1}
{"text": "hmmmmmmm \n\ni think you guys might be slightly retarded\n\nnext time someone powerful rapes a person, sorry, cant show them publicly!!!11111!1111!11", "label": 1}
{"text": "you are clearly retarded\n\nglad we could clear this up", "label": 1}
{"text": "Well traditionally most Somali fathers are absent so yeah probably.", "label": 1}
{"text": "His friend came out with a sword in one of the videos to protect him but it got taken away and he got his ass beat.", "label": 1}
{"text": "An ignorant Korean will avoid a black person, but they will scream at and harass an ethnic-Korean Chinese person (조선족) and will refuse to spend any money on products manufactured or distributed by a company with Japanese ownership.", "label": 1}
{"text": "Way too many  preteen edgelords for that.", "label": 1}
{"text": "They have forks and spoons as well. You could kill someone with a spoon if you’re patient.", "label": 1}
{"text": "Holy shit.   When I was there if he was doing all that around Itaewon and Suwon they would probably just beat him up and wait for KNP to come clean him off the street.", "label": 1}
{"text": "[it’s on sight!](https://www.reddit.com/r/Asmongold/s/gsUahA2fu0)", "label": 1}
{"text": "I’m going to need a link to that wtf", "label": 1}
{"text": "Fuckers bit me last month. Assholes.", "label": 1}
{"text": "Give him a ride to N. Korea", "label": 1}
{"text": "Relax, degenerate internet culture is not black American culture.", "label": 1}
{"text": "> Black American culture is considerably more disrespectful.\n\n. . .some of you just can't help yourselves.", "label": 1}
{"text": "I’m not being funny. I mean no disrespect. But you’re a cunt. You’re cunt now, you’ve always been a cunt. And the only thing that’s gonna change, is you’re gunna become an even bigger cunt.", "label": 1}
{"text": "In school we had to visit those prisons and watch video recordings of those caning, as a deterence to never fuck around here. It is brutal, seeing a grown ass man cry from getting his ass skin torn apart from the caning done by this huge dude with a huge ratan cane doing cane kata on his ass.", "label": 1}
{"text": "Korea should place a tracking device on the fella and make his location public knowledge.", "label": 1}
{"text": "Has he tried this shit is SE Asia?  If not he needs to go keep the same energy in Thailand.  Thais dont fuck around when it comes to foreigners disrespecting them.  Two thais can be mortal enemies but will gladly join forces to beat the snot out of a foreigner when they cross the line.  Theyll occasionally go too far and deaths occur but they will be out of jail in less than 5 years.  A 3rd of thai men get conscripted for military training for two years and many have muay thai training so dont discount them just because theyre little.", "label": 1}
{"text": "You’re spot on. As someone who was in a frat, this shit is so cringe. Guarantee that 75% of the frat made fun of special needs kids in high school, 50% still probably call people “retards”, etc.\n\nThis is unironically just virtue signaling. I’m sure there are some frat people who genuinely care about this but collectively as a whole? Nah, they don’t care, just another pick up line to hookup with some sorority girl.\n\nNo idea why people fall for this shit. It’s like massive corporations flying pride flags during June. Yes, that’s better than nothing and it can help but don’t excuse all the bullshit that corporations do (or in this case) Greek life and culture.", "label": 1}
{"text": "What, so he can go to the Klan rally with the rest of them? Fuck frats, they’re nothing but boot camps for the next generation of racist, rapist, knuckle dragging men. Particularly in the SEC", "label": 1}
{"text": "[This is who you’re defending lmao.](https://www.yahoo.com/news/clemson-puts-cripmas-party-fraternity-2-probation-142447647.html)\n\nFr every time I see videos of these confederate hick dipshits I realize that General Sherman didn’t go far enough.", "label": 1}
{"text": "the worst thing about living here is that you can only kill yourself once", "label": 1}
{"text": "Who cares? You do. If you didn’t, you wouldn’t have bothered to write all that crap. Read the comments. You gloss over the actual point of the video to pick at the technical side, the thing nobody else cares about. Everyone else is enjoying it for what it is. They like it, flaws and all. Except you. Which doesn’t make you special, just obtuse. It’s clear the emotional side of things is too much for you to handle, so you have to find something to be negative about.\n\nGo outside.", "label": 1}
{"text": "Fair enough, but you're still a dipshit.", "label": 1}
{"text": "that's devious 😭🙏 but man, he looks so fucking stupid, he's like a kid in a grown man body", "label": 1}
{"text": "😊", "label": 1}
{"text": "> UPDATE: she is a student having a psychotic break and has been hospitalized. \n\nWesterners were told you would be stoned to death if you do this in Iran. Everyone is just avoiding her like she is crazy. You were lied to.\n\nPro-regime change woke feminists in the west thought fit to exploit her.\n\nWe’ll… that’s certainly a take…", "label": 1}
{"text": "If I see or meet that cunt in person I won’t be afraid to bitchslap him and/or call him the n word with the hard r", "label": 1}
{"text": "And 'the best version of oneself' is the only goal worth setting up for yourself. \n\nRest is BS and will make you a BS (beta simp)", "label": 1}
{"text": "Women only want one thing...abd it's your wallet.", "label": 1}
{"text": "oh, sweetie... no...", "label": 1}
{"text": "What is your exact disagreement? Sorry can't follow?", "label": 1}
{"text": "The best advice for life isn’t to try changing yourself for others, but to focus on the things that truly make you happy. The more genuine you are with yourself, the more likely you are to attract people who appreciate you for who you are. Don’t try to be someone else; be the best version of yourself!\"", "label": 1}
{"text": "The best advice for life isn’t to try changing yourself for others, but to focus on the things that truly make you happy. The more genuine you are with yourself, the more likely you are to attract people who appreciate you for who you are. Don’t try to be someone else; be the best version of yourself!\"", "label": 1}
{"text": "I don't know what you are insinuating. I detest that racist snob. \n\nMy comment was just supporting the point that the gentleman made in the video- 'Level up and be a better version of yourself'. \n\nIf you have a problem with this, I have nothing to say.", "label": 1}
{"text": "you enjoy yourself at the bottom of your hole, the world is way bigger than that", "label": 1}
{"text": "Nah shit streamer", "label": 1}
{"text": "Porkchop sandwiches! HOLY SHIT, WHAT THE FUCK?! GET THE FUCK OUT OF HERE YA STUPID IDIOTS!", "label": 1}
{"text": "some cultures are inferior to others. It's just a fact.", "label": 1}
{"text": "The culture of living among trash and dead rats while judging others comes to mind", "label": 1}
{"text": "Stop making this fucking lower famous", "label": 1}
{"text": "You've convinced me, because whichever culture brought you up is a massive failing.", "label": 1}
{"text": "I would love to see what amazing contributions to culture you've made, I love when people who have accomplished nothing sit back and pretend like they did anything other than being born somewhere.", "label": 1}
{"text": "nice argument \n\nHow much do I need to accomplish so I can say that a culture where people are killed for their sexuality or women are treated as inferior beings is an inferior culture, without your holy judgement?", "label": 1}
{"text": "That's not really a culture though is it, that's systemic oppression by powerful governments.\n\n\nGovernments who became powerful because we the West wrote them a blank cheque for their oil, which they turned around and used to destroy the ACTUAL culture their countries had and enforced a Theocracy where religious law is THE law.\n\n\nSee what I did there? I used critical thinking instead of blind prejudice to see the many layers that leads to the oppression you are talking about.\n\n\nIt's so bizarre that you can see the oppression but you only empathize with a few groups living in it rather than seeing the whole picture.", "label": 1}
{"text": "Here's the chat gpt response. More of a choice looks like. \n\n\"\nPapuan tribes, particularly those from the highlands of Papua New Guinea, have historically developed unique combat practices, including varied use of shields or, in some cases, not using them at all. Whether or not Papuan tribes use shields in warfare depends on several cultural, environmental, and practical factors:\n\n1. Geographical and Environmental Considerations:\n\n\nDense Terrain: The dense rainforests and rugged mountains of Papua New Guinea make carrying large shields cumbersome. In areas where mobility and quick movement are crucial due to the terrain, tribes may prefer lighter weapons or rely on stealth and agility rather than cumbersome defensive gear.\n\n\nVisibility and Ambush: In heavily forested regions, ambushes and surprise attacks are common, making heavy shields less practical as they could slow down quick retreats or tactical movements.\n\n\n2. Cultural Practices and Combat Style:\n\n\nEmphasis on Offensive Tactics: Some Papuan tribes emphasize offensive tactics, focusing on projectile weapons like spears, bows, and arrows. The use of long-range weapons can reduce the perceived need for personal defensive equipment like shields.\n\n\nRitual and Display: In some cases, warfare in Papua New Guinea has a significant ritual component. The emphasis might be on demonstrating bravery or adhering to cultural combat traditions that don’t involve shields.\n\n\nCeremonial Use vs. Practical Use: Some tribes may have shields that are used in ceremonial contexts or as status symbols but are not necessarily employed in actual warfare.\n\n\n3. Material and Resource Availability:\n\n\nResource Scarcity: Constructing durable shields requires access to specific types of wood, plant fibers, or animal hides. Tribes in regions where such resources are scarce may have opted not to develop shield-making traditions.\nMaterial Strength: Some areas may have materials that are too heavy or fragile for effective shield-making, influencing a preference for lightweight combat strategies instead.\n\n\n4. Social and Historical Context:\n\n\nIntertribal Warfare Norms: The nature of conflict between tribes might have influenced their weapons and defensive tools. In some regions, warfare might have involved skirmishes where maneuverability was prioritized over prolonged defensive encounters.\n\n\nEvolution of Tactics: As warfare tactics evolved over time, some tribes may have shifted away from using shields due to changes in the weapons used or the influence of outside technologies and cultural exchanges.\n\n\n5. Specific Examples of Tribes and Practices:\n\n\nHighland Tribes: Tribes in the highlands, such as the Huli and Dani, have been known to engage in warfare that sometimes involves shields, but not always. Their shields might be small and used alongside spears or arrows but could be absent when warfare emphasizes speed and surprise.\n\n\nLowland Tribes: Some lowland tribes might not use shields because their warfare is more reliant on ambush tactics or quick raids, where a shield would hinder movement.\n\n\nIn summary, while some Papuan tribes do use shields, their use varies based on environmental factors, combat style, cultural traditions, and resource availability. The decision to use or not use shields is a result of strategic adaptations to the local context of warfare and survival.\"", "label": 1}
{"text": "no phones, living in the moment. how times have changed XD", "label": 1}
{"text": "You wonder why those whities came to certain conclusions", "label": 1}
{"text": "I'm not a bot but the response seems reasonable. Not sure why everybody downvoted.", "label": 1}
{"text": "Too long and untrustworthy.", "label": 1}
{"text": "It seems reasonable enough in this case. I realize it has limitations and a host of problems but it's not bad at simple little trivial stuff like this. I'm not trying to prove anything, just provide speculation on the comment. Speculation doesn't have to be \"trustworthy\", just reasonable.", "label": 1}
{"text": "Yeah, any other comment without a source would be worse off and more untrustworthy imo, people are just piling on because it seems like a lazy comment.", "label": 1}
{"text": "Because people come to reddit to learn from others and have a discussion as opposed to reading regurgitated, unsourced, generic, and generally useless blocks of text from chatgpt.", "label": 1}
{"text": "Have you looked at the comments in this thread?\n\nThe top comment:\n\"Its like a game of dodgeball but if you get hit you get a spear through the chest\"\n\nLol for real though. Get over yourself.", "label": 1}
{"text": "Here, let me put it in a way that might make sense to your sharp whit and critical mind:\n\n\nPeople generally prefer real human-generated Reddit comments over those generated by bots like ChatGPT because human comments bring a mix of authenticity, personal experience, and creativity that AI can struggle to fully replicate. Here are a few key reasons:\n\nAuthenticity and Emotion: Real people share comments based on their lived experiences, emotions, and personal insights. This makes their responses more relatable and genuine. In contrast, AI can generate insightful responses, but it often lacks that natural, nuanced human touch.\n\nDiverse Perspectives: Every person has unique perspectives shaped by their culture, background, and values. This diversity leads to a rich tapestry of viewpoints in Reddit threads that AI, despite being trained on a vast dataset, can't fully capture.\n\nHumor and Personality: The humor on Reddit, especially with niche or subcultural jokes, is often spontaneous and sometimes obscure. People enjoy the unpredictability and quirks that come from real individuals rather than a response that might feel polished but flat.\n\nReactions and Real-Time Relevance: Humans can respond to comments in real-time, referencing specific events, trending topics, or new developments. AI can do some of this, but without a live feed of current events, it sometimes misses subtle contextual references or timely responses.\n\nCredibility and Trust: Users often want to know that they’re conversing with a real person because it assures them the comment is an authentic opinion rather than a generated response. There's an implicit trust when you know someone is real, particularly if they’re offering advice or sharing a personal experience.\n\nCommunity Norms and Self-Moderation: Reddit communities often develop specific norms and insider knowledge that regular members understand and respect. Human commenters are more likely to adhere to these norms, while an AI might unintentionally breach them or seem out of place.\n\nWhile AI can be helpful and informative, it's usually most appreciated for structured, factual responses, not for the organic, community-driven conversations Reddit is known for.", "label": 1}
{"text": "I see, structured, factual responses, like the one you just made, are undesirable. Thank you for enlightening me.", "label": 1}
{"text": "whoosh", "label": 1}
{"text": "That's all valid. I just didn't think it was such a big deal. I also prefaced it by stating that it was an AI response, so people could take it with a grain of salt. You live, you learn, I guess.", "label": 1}
{"text": "Probably women. Papuan men are amongst most prolific rapists in the world.", "label": 1}
{"text": "The best part of your sketches are the camaraderie between you. The whole \"I'm trying to be a good friend\" vibe gives it such a nice appeal.", "label": 1}
{"text": "hjashd", "label": 1}
{"text": "💰O Topick, proveniente do Kwai, está oficialmente disponível! Convide seus amigos para se registrarem no Topick e você poderá ganhar 💰  \n\nVocê está interessado? Pedimos desculpas por qualquer incômodo!  ", "label": 1}
{"text": "Gypsies gonna gypsie", "label": 1}
{"text": "France needs to deport the third world", "label": 1}
{"text": "They are not Romanian, they are gypsy, completely different, they steal and do the same thing here in Romania, and they destroyed the Romanian reputation because people from the west think that they are Romanian", "label": 1}
{"text": "Yeah, unfortunately we cant ban Romanians from entering other EU countries...", "label": 1}
{"text": "Romani and Romanians are not the same thing, but so many Europeans express open bigotry against both.", "label": 1}
{"text": "Please, actual romanians are nothing like the gypsies... Romanians dislike them just as much as you do.", "label": 1}
{"text": "They are not the same, sure. But they still hold EU citizenship, thus cannot be denied entry.", "label": 1}
{"text": "Everyone dislikes gypsies, hell even gypsies dislike gypsies", "label": 1}
{"text": "Lol. Someone living in Romania, having a Romanian citizenship and being descendant from a people who's been there for hundreds of years is Romanian. That means **some** Romani are **also** Romainan while some Romani are also Bulgarian etc. You not liking them is fine but it doesn't change those fact...", "label": 1}
{"text": "Who gets to decide who are \"real\" Romanians... as opposed to Gypsy Romanians?", "label": 1}
{"text": "It’s always a Romanian, or Roma. Doesn’t matter what country in Europe, it’s always a Romanian, Moldavian, or Albanian doing these scams. They all claim they’re some other nationality as well but they’re not.", "label": 1}
{"text": "Reading this comment and then watching the video made it 1000% funnier. Never thought I would be saying this... but if he is not gay ... that's a tri fecta", "label": 1}
{"text": "just imagine the looks on their faces when you pulled that out", "label": 1}
{"text": "He's undoubtedly a musical genius. I also think he happens to be stark raving mad. Like a legitimate insane person. But hell, brilliant and crazy often gotta go hand in hand.", "label": 1}
{"text": "Big bird is yellow. ", "label": 1}
{"text": "A bit ironic that this film predicted a totalitarian right wing government capitalizing on a lab-created virus and the pretense of \"public safety\" to enact draconian measures on the population. \n\nThen covid happened and...", "label": 1}
{"text": "ty", "label": 1}
{"text": "What a dorkass fucking weirdo..", "label": 1}
{"text": "this is AI generated lol", "label": 1}
{"text": "Joe Rogan is so insanely triggered hahahaha what a loser.", "label": 1}
{"text": "There's a lot of dumb mother fuckers out there my man.", "label": 1}
{"text": "Maybe there was a time. Before the university of phoenix… where a PHD meant something. Now though. It usually just means you stayed in school because you couldn’t find a job that paid enough for you to both live and pay off the student loans.\n\nHigher education is not what you think it is.", "label": 1}
{"text": "you're AI generated", "label": 1}
{"text": "In Rogan's defense, in 2003 it was pretty commonly considered true.  Even National Geographic wrote on this.  Turns out they were just common chimps.\n\nSo Rogan may have been more knowledgable on the topic at that moment in time.  Of course, I can't tell as Rogan just yelled over her so we didn't get to hear what she had to say.", "label": 1}
{"text": "What a complete dumbass. Joe Rogan is all the way stupid. His brain isn't physically handicapped, he can talk like a normal person, but he's just truly so fucking stupid it's unbelievable. He doesn't understand logic so he gets lost with his head deeply up his own ass", "label": 1}
{"text": "He hears a woman laughing and becomes fully irate. So fucking angry that his producer seems to get nervous. How dare a woman laugh at *him*.\n\nHe literally just got done telling a dude he does nothing all day but smoke pounds of weed but oh when did you get your PhD in continuing your study of primates, stupid? Hurdurr.", "label": 1}
{"text": "Look up opie and Anthony. This is from a radio show", "label": 1}
{"text": "Here you go pussy.  [https://support.reddithelp.com/hc/en-us/articles/204579509-How-do-I-delete-my-account](https://support.reddithelp.com/hc/en-us/articles/204579509-How-do-I-delete-my-account)", "label": 1}
{"text": "doubling down while being shown to be wrong... clear signs of an absolute Idiot.", "label": 1}
{"text": "What a worthless sack of shit.\n\nAlways has been, still is, always will be. Not worth the electricity to run the computer that broadcasts his mental diarrhea.\n\nIf every mouthbreathing douchebro who listens to him religiously were to die this very moment, the world would be a better place.", "label": 1}
{"text": "Glad that traitor lost her life. Should have been closed casket. Glad the people who defended this country against her prevailed.", "label": 1}
{"text": "They really have you people brainwashed. Absolute sheep.", "label": 1}
{"text": "The same people who let them in?", "label": 1}
{"text": "Nyet comrade.", "label": 1}
{"text": "Yeah bro we deserve a convicted felon and rapist in charge because we tried to make it abundantly clear how terrible he is.\n\n\n7 year old account that just woke up to post again. Hello Mr. Bot.", "label": 1}
{"text": "Fuck yourself", "label": 1}
{"text": "and **you're not in it**", "label": 1}
{"text": "Russia played the long game, owned the GOP / MAGA cult, and won the Cold War.", "label": 1}
{"text": "Hell", "label": 1}
{"text": "HAHAHAHAHAHAHAHAHAHAHAHAHA SEEEEEEEEEEEEEEEEEETHE", "label": 1}
{"text": "Lol look at your posts what else would I assume? You magas are fucking weird.", "label": 1}
{"text": "I love seeing reddit cry", "label": 1}
{"text": "Another sub made into a leftist crying room.", "label": 1}
{"text": "Damn you got u/South_East_Gun_Safes to delete their astroturfing nice work friend", "label": 1}
{"text": "Democrats are the problem.", "label": 1}
{"text": "Just because Americans are dumb as shit doesn't mean everyone else is.", "label": 1}
{"text": "Oh, no: I was referring to the electoral result in the US, which will roundly screw us all for the foreseeable future.", "label": 1}
{"text": "There are concerns that Trump, especially if he wins both houses of congress too, will try to put things in place to make it harder for Dems to vote/win in the future. Gerrymandering, changing election laws, and installing sympathetic judges around the country over the next 4 years will help him. Plus he's probably going to get to install 2 more Supreme Court justices, so any legal challenges to what he is doing will almost certainly fall in his favor.  \n\nThis election seemed to really drive home the point that the economy is the single biggest issue people vote on. So in theory, if he really tanks the economy, yes, the GOP will be voted out in 2028, but I'm not sure same mechanisms will be in place to remove them in 4 years.", "label": 1}
{"text": "What's happening in Gaza is worse than everything you mentioned. Furthermore, whats happening in Gaza is already as bad as it can possibly get. The place is completely destroyed. Israel is now invading Lebanon and doing the same thing there. Destroying homes, hospitals and schools. They're also attack Iran, Yemen and Syria. Truly unimaginable horrors being livestreamed to the world.\n\nYour issue is that you're so insulated in your comfy first world life that you've deluded yourself into thinking those made up trivial things are more important than an actual genocide. How many Palestinian deaths are worth made up bullshit like \"Republican policies will lead to more trans suicides\"? [Trans suicide rates have increased every year under Biden](https://time.com/6173081/suicidal-thoughts-lgbtq-youth/):\n\n>The survey, published Wednesday, found that 45% of LGBTQ youth had seriously considered attempting suicide in the past year, and LGBTQ youth of color reported higher rates of considering suicide than their white peers. [That’s a five percentage point increase overall from three years ago](https://time.com/6173081/suicidal-thoughts-lgbtq-youth/) and a continuation of an alarming trend\n\nYou'd think if this issue was so important to you that you'd know this...", "label": 1}
{"text": "Made up trivial things? Fuck off!", "label": 1}
{"text": "yeah such as a presidential candidate and the citizens behind him", "label": 1}
{"text": "He wasn't under 16, hence, they missed.", "label": 1}
{"text": "Funny from a guy who can't get a girlfriend. \n\n[https://www.reddit.com/r/AskReddit/comments/1g8xxn3/comment/lt5r6gh/](https://www.reddit.com/r/AskReddit/comments/1g8xxn3/comment/lt5r6gh/)", "label": 1}
{"text": "Deplorable garbage proving the description accurate", "label": 1}
{"text": "Are you talking about this guy? Or Donald Trump? Unclear as the description fits both", "label": 1}
{"text": "It's an open forum, don't make idiotic comments and people won't engage with your stupidity", "label": 1}
{"text": "Cope and seethe cuck", "label": 1}
{"text": "Be mad 😠 at all the fake news and fake people who constantly lied to you and brainwashed 🧠 💧 🚿 you into thinking President Donald 🇺🇸 Trump was something he was not. It was Democratic propagandists, they have degrees in Psychology. The first step into recovery is to admit you were brainwashed. Avoid people who constantly use the words: \"racist\" \"dictator\" \"hitler\" \"bigot\" \"sexist\" \"felon\" \"fascist\" \"grapist\" and \"misogynist\" these are all trigger words to evoke an emotional response from you. Unplug TV/internet, go outside and touch the grass. 🌳 Get a bus ticket and move to the country if you have no grass. Choose to become Happy 😃", "label": 1}
{"text": "This is perfect for a treasure hunting soundtrack! Check out the $3000 treasure hunt with 11 days left! [Este’s Quest](https://youtube.com/@estesquest?si=Cq0wdGalnHURbRVB)", "label": 1}
{"text": "I think you're taking it too seriously. It's just a joke and a cope.\n\nAnd people saying Trump was quoting Hitler are correct but those who think he *is* Hitler are unhinged. But when someone starts using Hitler rhetoric, being given full immunity by the SCOTUS and promised to be \"dictator for a day\" with revenge against his political rivals, it's justifiably worrying.\n\nI'm guessing you just think Trump was joking.", "label": 1}
{"text": "That proves the point even further lol. That’s probably what sparked Osho to say this. He was an expert on manipulating people and he truly understood how prone to mass hysteria and mob behavior people are. After all, no one understands cult mentality better than a cult leader.", "label": 1}
{"text": "the planet", "label": 1}
{"text": "Haaaaaa ahh okay, a keyboard got it got it 😂. I gotta dock ya for lack of originality with the “libs” and the mask references man, c’mon hit me with that new material you cooking up in the clown kitchen. You gotta have something fresh. Get that cunty hate going baby 😂.", "label": 1}
{"text": "As funny as this is, please, for the love of ALL that is good in the world, NOBODY ASSASSINATE HIM!  Vance would actually be _worse_. =(", "label": 1}
{"text": "Of course he would be worse. So, ***Hypothetically***, an assassin would need to take them both out at one time, ***which would be wrong and highly illegal***, and who would even be able to do that? I mean, the only scenario I could think of where they might be together with enough security to feel safe would be, say, a state dinner congratulating them on their win. And you would need court approved immunity and/or be old enough to have lived a long enough life that you don't care; and, really, who could possibly fit all that criteria? Obviously, no one should murder anybody, and this was just a thought experiment and in no way is calling for any assassinations.", "label": 1}
{"text": "Is that skinny Chris Farley?", "label": 1}
{"text": "Land it!", "label": 1}
{"text": "Interesting", "label": 1}
{"text": "It is not illegal for telling the dems should do another Jan 6th to protect the democracy.", "label": 1}
{"text": "who doesn't wear a seatbelt?", "label": 1}
