{"text": "Thats just Jebadiah’s Death Ray. No need to worry.", "label": 1}
{"text": "Firstly, where did I even mention that this was an Elizabethan \"normal person\" travel writing cabinet?\n\nAnd thank you for explaining to me what I'm confusing things with, but let me assure you that I'm not. \n\nBesides that, you obviously have no clue to what the economics of the European courts were. Educate yourself, the royals werent bathing in riches and didn't have a golden toilet. \n\nStop your F-ing attitude.", "label": 1}
{"text": "How many peppermints equal a full banana?", "label": 1}
{"text": "New scale metric just dropped", "label": 1}
{"text": "Early prototype Laser weapon.", "label": 1}
{"text": "Put a cylindrical glass inside", "label": 1}
{"text": "It’s not a discrete part. It over shares with everybody .", "label": 1}
{"text": "Moisturize your hands please", "label": 1}
{"text": "This subreddit is wild haha good find.", "label": 1}
{"text": "Actually insane! Respect", "label": 1}
{"text": "That's right, it goes in the square hole", "label": 1}
{"text": "[For anyone who doesn’t get the reference](https://youtu.be/cUbIkNUFs-4)", "label": 1}
{"text": "It’s a pre-colonial alter for satanic worship.  I’m surprised it doesn’t seem to have any burns or wax build up. It also seems to have never been used for ritual sacrifice either as the wood is to bright and doesn’t seem to have any staining.  We would call this a virgin alter and consider it more powerful than the usual darkened used altars. Please use it to its full potential for the glorious hailing of the all powerful Satan.  The dark arts should be powerful if used properly. Darkest regards in thy  master name.", "label": 1}
{"text": "I read this entirely wrong", "label": 1}
{"text": "I'm not falling for that again.", "label": 1}
{"text": "Lol. Me too. Don't put your peni... oh, ok. Carry on.", "label": 1}
{"text": "That is totally a thingy!", "label": 1}
{"text": "Plug it in?", "label": 1}
{"text": "This! Also op I’ve lost mine if you want to send that my way", "label": 1}
{"text": "Not putting in that again.", "label": 1}
{"text": "It had its own base with legs", "label": 1}
{"text": "I read that wrong.", "label": 1}
{"text": "It's an advanced little pizza tray thing that you get in the middle of your pizza obviously.", "label": 1}
{"text": "It bothers me more than it should that you said “and” rather than “+”. Your sentence feels like the awkward love child of a physics lecture and a story problem.", "label": 1}
{"text": "Guess I was wrong", "label": 1}
{"text": "When can ∪ make an entrance?", "label": 1}
{"text": "I read this too fast and… woah", "label": 1}
{"text": "I was gonna say \"It is a thing that does the thing you are showing us\"", "label": 1}
{"text": "I would'nt put my ....oh,wait never mind. I read it too fast too", "label": 1}
{"text": "I've been looking for that!", "label": 1}
{"text": "It’s a little prick", "label": 1}
{"text": "You too?! LOL", "label": 1}
{"text": "You will rip your Bic off.", "label": 1}
{"text": "You never know till you try.", "label": 1}
{"text": "I absolutely love this sub, there's someone out there that knows what every damn thing is that exists. :D", "label": 1}
{"text": "Thank you for posting with us. \n \nIt looks like you're trying to identify something you got at a conference or similar event.\n\nIt's likely one (or a combination) of the following: phone stand (sometimes with speaker), screen cleaner, reusable drinking straw, holder for winding up earphones/charger/usb cord, laptop camera privacy tab, golf divot tool, or a USB charging adapter.\n\nIf it is please mark this as solved by replying to this comment with **Solved!**.\n \nIf that's not it, and you've received no other messages from me indicating otherwise, your post is still active and you can ignore this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": "Someone wants that back I bet", "label": 1}
{"text": "Though it doesn't look like the kind of vase you'd want to put water in.", "label": 1}
{"text": "Is it to open and close the vent?", "label": 1}
{"text": "It's a kitchen thermometer.", "label": 1}
{"text": "Yeah it looks like a thermometer when they were testing the air temperature. OP should be able to pull it out.", "label": 1}
{"text": "Free tool! Grab it!!", "label": 1}
{"text": "Missed my day to shine by 2 hours.", "label": 1}
{"text": "😂\n\nCould make it a team building exercise.", "label": 1}
{"text": "That's where I left it.", "label": 1}
{"text": "“Hey! I was looking for that!”\n\nYep. It’s an instant read thermometer", "label": 1}
{"text": "Easy peasy, rip it out of the ceiling and play dumb because you have a bug phobia. Just play dumb and innocent.", "label": 1}
{"text": "HA!!!!!! omg, this kills me!!", "label": 1}
{"text": "Maybe it captures money. And theres money inside. How many chainsaws do you have", "label": 1}
{"text": "damn, this is it. Nice find", "label": 1}
{"text": "I think I have something no one knows.. I need to take better pictures though and get it posted.", "label": 1}
{"text": "The more impressive part is knowing the proper name. I knew exactly what it was but couldn’t think of the name and didn’t want to answer  “it’s the pointy thing you use to mark the wood with your ruler square”.", "label": 1}
{"text": "LIGHTSABER!", "label": 1}
{"text": "I thought the same.", "label": 1}
{"text": "it’s just a Cool Thing that someone made", "label": 1}
{"text": "These are usually found while digging around for something in a desk drawer. When you feel a sharp pain and a drop of blood forms on the fingertip, you’ll know you found one.", "label": 1}
{"text": "That is a Merovingian Crutch Knuckle, medium/large.", "label": 1}
{"text": "It’s a “depression box” clip, for hanging your “XXXX days ‘till retirement sign”", "label": 1}
{"text": "I see what you did there", "label": 1}
{"text": "Czech hedgehog", "label": 1}
{"text": "Venomous plastic snakehead.  Be careful not to get bit.", "label": 1}
{"text": "Only office slave cubicle workers know what this is.", "label": 1}
{"text": "I saw one of those things on the ground and could NOT figure out what it was. Thank you for the help!", "label": 1}
{"text": "Misread that", "label": 1}
{"text": "It’s clearly a cool wooden thing that is at the mercy of your imagination", "label": 1}
{"text": "I think that’s how the Amish summon the Cenobites", "label": 1}
{"text": "Crypto mining", "label": 1}
{"text": "I'm so sorry for my thoughts", "label": 1}
{"text": "But is it a [vahs] or a [veys]? 🤔", "label": 1}
{"text": "I mean, i had these at school on the soundproofing walls", "label": 1}
{"text": "Thanks,  what a weird word.", "label": 1}
{"text": "Agreed. I kinda like it though.", "label": 1}
{"text": "Ok, are you asking for something or stating a fact no cares about? \n\nI've never touched or seen a Chinese jiao", "label": 1}
{"text": "Looks like it goes straight into someones peehole.", "label": 1}
{"text": "This is it OP.", "label": 1}
{"text": "It also *sounds* like it goes straight into someone's peehole.", "label": 1}
{"text": "In a rare moment of self-sacrifice I am foregoing 3 upvotes here in order to spare 1000 people from trauma.", "label": 1}
{"text": "Oh.. I read it wrong..", "label": 1}
{"text": "Naw it's a beer keg on wheels", "label": 1}
{"text": "If only there was a clue that could be googled.", "label": 1}
{"text": "Oh I've seen this! Holding steve-O's ass cheeks together", "label": 1}
{"text": "It's just a fancy thing to use. No better than a spoon in my opinion.", "label": 1}
{"text": "It sounded better lol", "label": 1}
{"text": "I guess you could do that, too, if you wanted.", "label": 1}
{"text": "It's an earring for Godzilla.", "label": 1}
{"text": "Aww man, I was gonna suggest that.", "label": 1}
{"text": "This is how people end up in the radiology subs with horrific images of things in places. Use pre-approved devices only folks, lest it… fall in.", "label": 1}
{"text": "You learn something new everyday on Reddit", "label": 1}
{"text": "Was hoping to come here to learn this", "label": 1}
{"text": "Heizenburgs trailer.", "label": 1}
{"text": "That's my uncles crack factory... You're not supposed to be here... you've seen too much....", "label": 1}
{"text": "That’s where the Bay Harbor Butcher is set up.", "label": 1}
{"text": "Everyone is just guessing...", "label": 1}
{"text": "Only if he was eating dirt", "label": 1}
{"text": "This is satire, right?\n\n…right?!", "label": 1}
{"text": "Wow, that is next level!", "label": 1}
{"text": "That's oddly specific 🤔", "label": 1}
{"text": "Still most of rural America lives on a high trust and high morale society….Drive around some of rural TN you will see people selling vegetables and fruit… eggs and wood endlessly at the end of their driveway. With nothing but a box to drop your money in.", "label": 1}
{"text": "Walter & Jesse are in there.", "label": 1}
{"text": "I really enjoyed the convo behind you three.", "label": 1}
{"text": "Uh oh... (spits out dirt)", "label": 1}
{"text": "Since it’s an industrial complex, it’s more likely addressing a volatile solvent release. In that case the indoor air would be the exposure route through vapor intrusion. As there is a treatment system that risk should theoretically be mitigated. OP could ask the property owner/manager what’s up (assuming OP is supposed to be there).", "label": 1}
{"text": "https://imgur.com/a/4Vv1WU4", "label": 1}
{"text": "Yes I have a fridgerator, but that basket is the intermediate area for when I no longer want to spend on energy to keep it cold.", "label": 1}
{"text": "Sorry jokes are not allowed, so I am at a loss.", "label": 1}
{"text": "Good cover up for breaking bad :)", "label": 1}
{"text": "Works with diapers too- spread it out a little and let it dry- then just scrape it into the trash and you can reuse it.", "label": 1}
{"text": "I really wish people would realize they can spend less time just finding the damn thing than it takes to come to this sub and make a post. Literally one Google search away.", "label": 1}
{"text": "Part of the value of this sub is for people to discover things like this exist", "label": 1}
{"text": "So this sub is for posting things just so other know about them?", "label": 1}
{"text": "Cooking meth", "label": 1}
{"text": "Yep, lost some blood due to these suckers, for sure!", "label": 1}
{"text": "Rural Western Washington checking in. I get my eggs from a road side honor stand every week. Can’t find duck eggs in store, and compared to retail prices nowadays, $5/18 ain’t bad.", "label": 1}
{"text": "Depending on where you're at, you could be holding a felony.", "label": 1}
{"text": "Nothing to see here. Carry on!", "label": 1}
{"text": "That was in the pocket? These aren’t my pants!", "label": 1}
{"text": "Hey, I lost that in 1997!", "label": 1}
{"text": "Wow flashback to late 90s", "label": 1}
{"text": "You forgot to say “man…”", "label": 1}
{"text": "Someone is going to be on restriction…", "label": 1}
{"text": "Most won’t get this, but it made me lol", "label": 1}
{"text": "Hiding candy from your kids", "label": 1}
{"text": "Nah it’s made out of metal", "label": 1}
{"text": "A bah tun dish is also called a rimshot", "label": 1}
{"text": "Tundish car around - I wan go home", "label": 1}
{"text": "Unplug it and you will find out soon I bet", "label": 1}
{"text": "Man, one i actually knew!", "label": 1}
{"text": "I am not sure what you would be trying to say but it definitely doesn't sound like you are trying to compliment someone", "label": 1}
{"text": "why did he get nuked on down votes?", "label": 1}
{"text": "Thought you said he was in intelligence?", "label": 1}
{"text": "Ha! Smart-ass. I chuckled so +1", "label": 1}
{"text": "I couldn't pass it up :D", "label": 1}
{"text": "Skateboard for a very naughty child?", "label": 1}
{"text": "I was thinking skateboard for a badass", "label": 1}
{"text": "What’s his name?", "label": 1}
{"text": "Unicorn poop.", "label": 1}
{"text": "Medieval War Skateboard", "label": 1}
{"text": "It's a BLACK METAL skateboard. Mayhem and Burzum rode these to work.", "label": 1}
{"text": "This! It originally had a bullet belt wrapped round it 🤘", "label": 1}
{"text": "Offroad skateboard", "label": 1}
{"text": "That's a death skateboard", "label": 1}
{"text": "Thank you for posting with us. \n\nIf what you've found is a little box attached to a door frame (with a scroll inside), it's a mezuzah.\nhttps://www.reddit.com/r/WITT_FAT/comments/8evidy/mezuzah/\n\nIf those look similar, please mark this as solved by replying to this comment with **Solved!**.\n\nIf that's not it, and you've received no other messages from me indicating otherwise, your post is still active and you can ignore this comment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": "The first skate board.", "label": 1}
{"text": "OG battlebot", "label": 1}
{"text": "Tony Hawk’s first board!", "label": 1}
{"text": "A badass skateboarding on ice.", "label": 1}
{"text": "I see valid answers so all I see are places for a cat to curl up in 🐱", "label": 1}
{"text": "I'd use it as a cat fort, cat bed bonanza.  ", "label": 1}
{"text": "I guess I jumped the gun with duct tape, eh?", "label": 1}
{"text": "Not a guy, but thanks.", "label": 1}
{"text": "Cloud holder….english.", "label": 1}
{"text": "I personally have no idea what this is but it kinda looks like a simplified shape of a V8 engine", "label": 1}
{"text": "aka grandma was a freak", "label": 1}
{"text": "You should treat your girlfriend to a nice manicure ☺️", "label": 1}
{"text": "lol will do asap", "label": 1}
{"text": "Blu tack for me.", "label": 1}
{"text": "Magnets, how do they work?", "label": 1}
{"text": "Don’t fucking look into the light!", "label": 1}
{"text": "Why you looking inside hotel aircraft vents like that?", "label": 1}
{"text": "\"Covid\"  🤣🤣🤣\nThat went extinct after the Ottawa protest\nTurns out large gatherings were the cause, AND cure", "label": 1}
{"text": "Probably because they could see the light and thought it may be a camera?  \n\nJust a wild guess, with some thought put into it", "label": 1}
{"text": "Don’t look at it, it’s evil (UVC-C)", "label": 1}
{"text": "That is every handyman's secret weapon.", "label": 1}
{"text": "Funny. That's all my cat sees...anywhere.", "label": 1}
{"text": "Dats one of dem dang thengs doe’s dastardly demoncrats are puttin roun the place to brainwash ya to vote for the she-devil chil’.", "label": 1}
{"text": "you didnt have any people in your life die did you?", "label": 1}
{"text": "Do people just immediately start ripping open hotel air vents now?", "label": 1}
{"text": "Are you working on the hotel or just digging through their hvac system?", "label": 1}
{"text": "Why are you looking in the AC vents of your hotel room? Are you Dexter?", "label": 1}
{"text": "Unless you want badass, tanned eyeballs", "label": 1}
{"text": "DON’T LOOK ETHEL", "label": 1}
{"text": "Too late, she done looked.", "label": 1}
{"text": "Wtf are you doing tearing into a hotel vent for?", "label": 1}
{"text": "And…what are you doing behind the hotel vent?", "label": 1}
{"text": "you 'd better get out of there fast.", "label": 1}
{"text": "Gotta use the tent poles I bought previously to push the bag further down the vent so that I can retrieve it from my second room, where I actually will be staying. Your move, Javier.", "label": 1}
{"text": "Don't know", "label": 1}
{"text": "But it was too late! She'd already been incensed!", "label": 1}
{"text": "I like to swing free", "label": 1}
{"text": "I was not expecting a Streak reference in the wild.\n...Boogity boogity.", "label": 1}
{"text": "Fucking Javier always trying to get one up on us... The strong dose of radiation is worth it.", "label": 1}
{"text": "If you could update us, that would be amazing, because this is one of those “Reddit is concerned, Reddit is never concerned.” moments.", "label": 1}
{"text": "Where other than this sub?", "label": 1}
{"text": ">You've offered no actual evidence of your argument.\n\nIt literally looks nothing like any other secretary.\n\nTo a person who isn't blind - that's the best evidence there is.\n\n>. You've offered no alternatives as to what it might be.\n\nPlenty of other people have already correctly identified what it is. Can't you read?\n\nhttps://www.reddit.com/r/whatisthisthing/s/7aN07cpnef\n\n>You've done nothing but run your mouth.\n\nLol. You mean I've disagreed with you. I always find this one funny - \"You're arguing with me!\". Well of course I am you moron - it takes two to argue.\n\n>Which is all it seems you do on here.\n\nLol. You got that from a couple of comments?\n\n>For someone who claims to work in science, you sure do seem to have the debate tactics of a child.\n\nOoh. You looking at my comment history? Lol. That's pretty sad, dude. Try getting a life of your own...", "label": 1}
{"text": "Knopkierie. Used to hit enemies in the head.", "label": 1}
{"text": "Here are some better images of the inscriptions. I had previously linked Google drive, but the bot deleted it l.\n\nhttps://imgur.com/a/0LcRr8q", "label": 1}
{"text": "If you turn up the speaker, you'll hear it saying \"Hello dave!\"", "label": 1}
{"text": "Whacking sticks. Semi professional models.", "label": 1}
{"text": "It's a newfangled IT thing called \"cloud storage\".", "label": 1}
{"text": "Cat Stacker", "label": 1}
{"text": "bottle opener. the video shows it being used backwards, duh.", "label": 1}
{"text": "Just don't go outside the ship and you should be fine.", "label": 1}
{"text": "Don't they sharpen their claws on the rattan sides?", "label": 1}
{"text": "Not if they have scratching posts and their nails are regularly trimmed", "label": 1}
{"text": "It is to create zigzag lines at events. My guess is that somewhere around there is a venue large enough to host a large crowd.", "label": 1}
{"text": "Looks like maybe a warning sign for the horrors to come? Not sure", "label": 1}
{"text": "I am sure that will work well 😄", "label": 1}
{"text": "Open the pod bay doors HAL", "label": 1}
{"text": "You are right. And indeed send like a weird location for this", "label": 1}
{"text": "It’s the torch from the Senior Olympics", "label": 1}
{"text": "I wouldn't have guessed that thank you", "label": 1}
{"text": "Do you happen to live in Vermilion City with Lt. Surge as a gym leader?", "label": 1}
{"text": "That’s amazing", "label": 1}
{"text": "No, that’s a maze.", "label": 1}
{"text": "It's definitely a off road skateboard from the 30s", "label": 1}
{"text": "ing. A maze ing", "label": 1}
{"text": "What an a-maze-ing idea.", "label": 1}
{"text": "I lost it on this comment", "label": 1}
{"text": "This is brilliant you can drop your kids off, close the entrance and exit and leave them there as long as you want!  Free daycare!", "label": 1}
{"text": "Air bender training.", "label": 1}
{"text": "That is actually pretty cool", "label": 1}
{"text": "So kids can’t skateboard I guess maybe", "label": 1}
{"text": "“The space is glass!”", "label": 1}
{"text": "Why would you want to keep cats out of your knitting projects? Their greatest joy in life is to destroy those things and Chase balls of yarn. You're being unnecessarily cruel to your cats!\n\n:)", "label": 1}
{"text": "I use them to stir and distribute my freshly ground espresso in the portafilter.", "label": 1}
{"text": "I bet you're a blast at parties.", "label": 1}
{"text": "That’s “safe” when playing tag.", "label": 1}
{"text": "Amazing 🤩", "label": 1}
{"text": "I wonder were they put there so kids could make a maze out of them.", "label": 1}
{"text": "OMG The Wooz!!! I have mentioned this to so many people over the years and no one remembers it. Thank you.", "label": 1}
{"text": "OP if that’s not a tattoo on your finger, have a dermatologist take a biopsy of it. \n\nI love you!", "label": 1}
{"text": "I remember the splinters well 🤣", "label": 1}
{"text": "Haha it is a tattoo!! But very sweet of you to check in. 💗", "label": 1}
{"text": "dont' touch medical things with your bare hands.", "label": 1}
{"text": "ew, that's a disease vector. call the health department", "label": 1}
{"text": "Likely dissolved", "label": 1}
{"text": "It's what shows up before a random staircase appears out of nowhere in the woods.", "label": 1}
{"text": "This was my first thought.", "label": 1}
{"text": "Given the people I see work at the place that processes recycling down the street from my old house, You should put it in other languages.", "label": 1}
{"text": "I see you’ve found the pipe stretcher!", "label": 1}
{"text": "Can you elaborate?", "label": 1}
{"text": "It’s a mythical tool apprentices are sometimes sent to find. Like the left handed hammer.\n\nMore seriously, something to put 90° bends in trim is the best I can think of", "label": 1}
{"text": "Where do you buy those left handed hammers anyways? lol", "label": 1}
{"text": "CIA mind control radio receiver", "label": 1}
{"text": "scilica gel", "label": 1}
{"text": "I’ve always said they’re pina colada flavored nerds.", "label": 1}
{"text": "They are usually between the metric and imperial crescent wrenches.", "label": 1}
{"text": "Ah! thanks ill look when I go to town! Im going to steal that and tell it to someone", "label": 1}
{"text": "Squirrel balls", "label": 1}
{"text": "Holy heck… I thought that was stuck in you finger.", "label": 1}
{"text": "I ate one of these as a kid", "label": 1}
{"text": "What is that on your thumb?", "label": 1}
{"text": "This is a primer punch. You used to have to add the percussion cap to the black powder cartridge. This is the origin of the phrase \"pop a cap.\" Clearly, you're not a rapper.", "label": 1}
{"text": "Why would they carry that on their belt?", "label": 1}
{"text": "I’m pretty sure this was probably used to beat minorities at some point……", "label": 1}
{"text": "A tattoo.", "label": 1}
{"text": "I drop them off at a drugstore that handles sharps containers, it takes a while for pen needles to fill one of those things. Also you can supposedly just throw them away in the garbage, but taking a jug to the local drug store once every few months when I'm going there anyway is no big deal.", "label": 1}
{"text": "Show it dug out. Looks like an old big-big rim.", "label": 1}
{"text": "That’s what I thought too lol", "label": 1}
{"text": "Same. I made my sister do it first.", "label": 1}
{"text": "Interesting, commenting to get updates.", "label": 1}
{"text": "Flush your toilet and see if water goes down the tube", "label": 1}
{"text": "I always thought they’d dry out my insides, lol", "label": 1}
{"text": "I’m still weary", "label": 1}
{"text": "Wary. Weary means tired", "label": 1}
{"text": "He's tired of his insides drying out?", "label": 1}
{"text": "I was worried it was melanoma! Whew!", "label": 1}
{"text": "Big phewf! 😅", "label": 1}
{"text": "Maybe leery.", "label": 1}
{"text": "So you mean I CAN eat them?)", "label": 1}
{"text": "There are some toxic variants, they have dyes that make them toxic. But they are rarer. \nI posted something with info a few comments up, or maybe as a reply to the same message as this one.", "label": 1}
{"text": "Black jacj?", "label": 1}
{"text": "That’s a Pepsi with no caffeine. They are vintage and they were spectacular.", "label": 1}
{"text": "My first thought as well!", "label": 1}
{"text": "Time to die stick.", "label": 1}
{"text": "Probably from eating too many silica packets", "label": 1}
{"text": "This is definitely the right answer.", "label": 1}
{"text": "Yeah that's what I think it is as well", "label": 1}
{"text": "Man if I had a dollar for every", "label": 1}
{"text": "That makes sense to me but I also don’t know much about these things.", "label": 1}
{"text": "I love that in our homes are incredible pieces of tech. Gaming consoles. Gaming PCs. Smart TVs. And yet these old chunky bois keep chugging along operating and confusing people. I love it.", "label": 1}
{"text": "My guy… That’s man made caviar.", "label": 1}
{"text": "Should post this on one those confusing perspective subs. Kind of looks like a 10’ drop and you found a sinkhole.", "label": 1}
{"text": "No silly, it will grow into a plastic tree inside of you!", "label": 1}
{"text": "They pair nicely with that loose foam packaging stuff.", "label": 1}
{"text": "What *was* this thing", "label": 1}
{"text": "Today I learnt that dogs have money.", "label": 1}
{"text": "Maybe it was meant for a larger gun or cannon but the owner liked it as a truncheon?", "label": 1}
{"text": "@mk937 looks like this guy found it. Solved!", "label": 1}
{"text": "Congratulations, not only do you get to dig up your whole yard to get that shit out, you also get to install a whole new septic system.", "label": 1}
{"text": "Looks like Andy Dufresne just escaped.", "label": 1}
{"text": "That's Ed Reardon's grandfather's Rectifier. (Prize to anyone who gets the reference) r/bbcradio", "label": 1}
{"text": "\nNo, it isn’t. Don’t be ridiculous.", "label": 1}
{"text": "It's not a primer punch, no such thing was ever used with revolvers and certainly not in the 20th century.", "label": 1}
{"text": "I think you’re overthinking the origin of the phrase “pop a cap.”", "label": 1}
{"text": "I just went through all the comments to make sure someone had told you this. Glad it’s a tat!", "label": 1}
{"text": "A time scoop. Yancy Talbot nearby.", "label": 1}
{"text": "Just pulling things out of your ass ehh?", "label": 1}
{"text": "You sound like the type of person who cuts through a whole neighbourhood’s internet connection or gets sprayed with poop for hitting a sewer line.", "label": 1}
{"text": "To be fair, I’m 30 and I only found out about this THIS YEAR and that’s because I started working at the Call center. \nFor context, I’ve never owned a home and certainly no one ever taught me this. So I don’t fault OP at all.", "label": 1}
{"text": "Stop trying to turn this into something. Was just a funny comment, and ur trying to be serious.", "label": 1}
{"text": "Based on downvotes, I would say that people didn’t find it funny.\n\nWhy did you find it funny? Cutting off water, power, electricity, and/or internet to one’s neighbours isn’t terribly amusing.\n\nImagine if you’d done so and turned off someone’s insulin pump that they rely upon as a diabetic? \n\nPlease explain how this is amusing for you?", "label": 1}
{"text": "I don't think this is a primer pouch. I think it's a powder flask.", "label": 1}
{"text": "This sub continues to be amazing!", "label": 1}
{"text": "The bottom plate of your framing in the corner is rotted to shit.", "label": 1}
{"text": "You are all wrong. The wall is diabetic, it is a glucose sensor.", "label": 1}
{"text": "I know it isn’t an unfinished IUD, but that’s where my mind went.", "label": 1}
{"text": "Well, when a tank and a baton reallllly like each other…", "label": 1}
{"text": "It’s termites. You can see the mud tube above it going horizontal along the 2x4", "label": 1}
{"text": "Micheal Scott hates these things!", "label": 1}
{"text": "Was saddam down there?", "label": 1}
{"text": "I’m having a Close Encounters of the Third Kind moment looking at this: “I know what this is… what is it?”\nJust call me Roy Neary…", "label": 1}
{"text": "Knock on their door and tell them you are finding them and it needs to stop", "label": 1}
{"text": "We do really need those radon detectors though", "label": 1}
{"text": "Why are you the way that you are?", "label": 1}
{"text": "Hunter Seeker", "label": 1}
{"text": "Fatberg, maybe?", "label": 1}
{"text": "How much did that cost?", "label": 1}
{"text": "Don't forget to save checkpoints frequently or you'll have to redo several levels", "label": 1}
{"text": "Was Sadam hiding in there?", "label": 1}
{"text": "My first thought also. For a second I thought that was a giant polishing wheel next to it.", "label": 1}
{"text": "Petrified shit!", "label": 1}
{"text": "I would not recommend standing downwind.", "label": 1}
{"text": "Yep I think it needs to be burned. Can’t see another way around it.", "label": 1}
{"text": "Rouge is essentially grease anyway so even of ots not, or's probably not far off haha", "label": 1}
{"text": "New pandemic outbreak in 3, 2, 1...", "label": 1}
{"text": "I’m following you two around Reddit I guess", "label": 1}
{"text": "Grease or fat turned to chunks from other chemicals.", "label": 1}
{"text": "Hell of a kidney stone", "label": 1}
{"text": "Definitely not, but good on you for knowing what a fatberg is.", "label": 1}
{"text": "That’s exactly what I thought it was.", "label": 1}
{"text": "It’s either mint chocolate chip or maybe old school pistachio.", "label": 1}
{"text": "Well it's not a meteor, I can tell you that much. It's never a meteor.", "label": 1}
{"text": "Probably by someone who doesn't know what it is. Looking at you OP", "label": 1}
{"text": "Nice try China.", "label": 1}
{"text": "This person is full of shit.", "label": 1}
{"text": "https://en.wikipedia.org/wiki/Frequency_illusion", "label": 1}
{"text": "Bosses who never spent a day in the field get what bosses want", "label": 1}
{"text": "Breathe deep", "label": 1}
{"text": "r/wordsIneverknew saponify", "label": 1}
{"text": "Toilet wine.\n\nI was thirsty… but not anymore.", "label": 1}
{"text": "No idea what it is, but you need bigger gloves my guy!", "label": 1}
{"text": "Toilet Wine Irish Spring is the next Dropkick Murphys album", "label": 1}
{"text": "Looks too homogeneous to me to be some random mix of cleaning products.", "label": 1}
{"text": "You know, the clay-like substance you found underground could just be clay.", "label": 1}
{"text": "Purse holder?", "label": 1}
{"text": "I just saw that one too. ", "label": 1}
{"text": "its like ambergris of the under city", "label": 1}
{"text": "I'm following you 4? 🙃🤪🥸", "label": 1}
{"text": "I too see no alternative.", "label": 1}
{"text": "Get the Oxy-Acetylene torch.", "label": 1}
{"text": "I’d have two nickels. Which isn’t a lot, but it’s weird that it happened twice.", "label": 1}
{"text": "Made a separate comment, but I think this is bentonite clay. Bentonite clay is used in some very popular clay masks, and packaging for these products often does not state that the clay should never ever be washed down your drains or else a blockage like this can occur. Bentonite clay was historically used as a natural cement and is the clumping agent in most clay clumping cat litters which is why you cannot flush cat litter down your drains. The color or this clay is the same color in OP’s photo", "label": 1}
{"text": "Congratulations BillyTwoTeef for Coming up with the best upcoming band name of 2024..Ambergris of under the city", "label": 1}
{"text": "Imagine the smell", "label": 1}
{"text": "I mean OP could first try showering with it and see how it lathers?", "label": 1}
{"text": "Indoors or outdoors?", "label": 1}
{"text": "Is it sh*t? I would be worried that it is petrified, oxidized sh*t.", "label": 1}
{"text": "We're doing science, you take a 5g chunk and shower with it, they'll take their 5g chunk and ~play with fire~ attempt to see if it combusts under normal laboratory conditions, while I take my 5g chunk and ~see what happens if I nuke it in the microwave~ see how it responds to different levels of light radiation in a controlled setting, and the other guys will ~lock it in a room and try torturing it to see if it has psychic powers~ keep it stable and non-reactive in a control setting.", "label": 1}
{"text": "I used to carry a .38 revolver at a previous job. It was the same make and model as the NYPD issued revolver. That was a solid gun to be fair. Easy to clean, low maintenance and accurate. The main gripe was reloading. In a stressful spot even with the speed loaders it was easy to screw up. \n\nWas talking to a retired NYPD officer about the old revolvers this weekend. He even said they were great guns, and cops liked them but as gun violence increased in the late 80s and early 90s they were out gunned and had to switch to the magazine fed Glock.", "label": 1}
{"text": "Ambergris. But from people.", "label": 1}
{"text": "C4 covered in a tint of poo", "label": 1}
{"text": "Do you like Terry Pratchett by any chance? A lot of his writing was like that.", "label": 1}
{"text": "That’s a meteorite", "label": 1}
{"text": "I would like to unlearn the phrase \"toilet wine version of Irish Spring\" please.", "label": 1}
{"text": "> By the color you may have made some toilet wine version of Irish Spring.\n\n/r/brandnewsentence\n\n[Walks away, whistling an Irish jig...]", "label": 1}
{"text": "Thanks for this, I use clay masks and didn't realize it shouldn't be washed down the sink! Will wipe and put it in a refuse bag in future.", "label": 1}
{"text": "I think I know, but I first need to know what it smell like.", "label": 1}
{"text": "They call em bowling bombs", "label": 1}
{"text": "They also use it to seal up old wells, so maybe the pipe was capped off at some point or something and OP undid it.", "label": 1}
{"text": "Solid chunk of herpes?", "label": 1}
{"text": "It looks exactly like “Blue Billy”.", "label": 1}
{"text": "Similar to my guess. I think it is “Blue Billy”", "label": 1}
{"text": "It's definitely not ambergris.", "label": 1}
{"text": "Orson Welles", "label": 1}
{"text": "The bentonite clay I’ve seen is not that color, but the only Bentonite clay I’ve seen is used for drilling fluid additives. Underground drilling companies use bentonite when drilling, and they drill next to sewers very often.", "label": 1}
{"text": "> you may have made some toilet wine version of Irish Spring.\n\nSo... Dial soap?", "label": 1}
{"text": "Don't put your lips on it!", "label": 1}
{"text": "Is that a Vactor vacuum truck?", "label": 1}
{"text": "Commenting to find out because I KNOW I know what that is, but I can't think of it", "label": 1}
{"text": "Thank you for posting with us. \n\nIf what you're asking about is a pole with a barrel shaped antenna on it, this is probably related to the 5G build out as part of the cellular network. \n\nhttps://www.reddit.com/r/WITT_FAT/comments/17oevu5/that_pole_you_saw_with_a_barrel_shaped_thing_on/\n\nIf those look similar, please mark this as solved by replying to this comment with **Solved!**.\n\nIf that's not it, and you've received no other messages from me indicating otherwise, your post is still active and you can ignore this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": ">toilet wine version of Irish Spring  \n\nr/BrandNewSentence", "label": 1}
{"text": "Precious ambergris?!!", "label": 1}
{"text": ">By the color you may have made some toilet wine version of Irish Spring.\n\nr/BrandNewSentence", "label": 1}
{"text": "> By the color you may have made some toilet wine version of Irish Spring.\n\nr/brandnewsentence", "label": 1}
{"text": "Toilet Wine Irish Spring... New band name! I call it!", "label": 1}
{"text": "I'd like you to know that the phrase \"toilet wine version of Irish Spring\" is my favorite thing I've read on the internet today.", "label": 1}
{"text": "Do a taste test", "label": 1}
{"text": "Y’all are too high rn", "label": 1}
{"text": "The tortoise from Moana", "label": 1}
{"text": "Shittin bricks", "label": 1}
{"text": "Isn't that a Cole Porter song?", "label": 1}
{"text": "Fatberg vibes", "label": 1}
{"text": "It looks like someone actually shit bricks", "label": 1}
{"text": "Bentonite is also, iirc, the type of clay used in clumping kitty litter...", "label": 1}
{"text": "Rearrange the words, Irish Spring Toilet Wine.  That has a better ring to it and easier to recall when the bands gets popular!!  😂", "label": 1}
{"text": "Bro I’ve been looking for that! Where’d you find it??", "label": 1}
{"text": "Damn! Some poor sub is gonna be in trouble.", "label": 1}
{"text": "IRISH UBLIET.....", "label": 1}
{"text": "[still somehow not the smallest](https://www.amazon.co.uk/Chastity-Inverted-Bondage-Negative-Couples/dp/B0CYXT1YHB?th=1)", "label": 1}
{"text": "Someone didn't make it to the end of Locktober 🤣🤣🤣", "label": 1}
{"text": "Some would say it’s a MASSIVE cage.", "label": 1}
{"text": "Plz don’t touch that and if you did wash immediately", "label": 1}
{"text": "Someone failed locktober 😆", "label": 1}
{"text": "Where'd you find it? Seeming like someone was having fun", "label": 1}
{"text": "Is that…..no……yes..yes it is.", "label": 1}
{"text": "Or he got lucky?", "label": 1}
{"text": "Someone is gunna get a spanking later 🏓🏓", "label": 1}
{"text": "Does it roll up like a tape measure? Actually never mind I don't want to know", "label": 1}
{"text": "Has anyone seen any news articles about wild bears with a taste for subs in that area by any chance?\n\ncop: Third one this week, this is all that's left.", "label": 1}
{"text": "Go free,little guy!", "label": 1}
{"text": "Seems like they were freed in public. Which might be the thing that made them lose it, who knows", "label": 1}
{"text": "Honestly, it’s WAY too big of a cage if you ask me or really anyone for that matter", "label": 1}
{"text": "Freed from the shackles of Amazonian Masterhood. No Ma'am! (Men Against Amazonian Masterhood)", "label": 1}
{"text": "And only 3 days left. Tsk.", "label": 1}
{"text": "Somebody freed Willy", "label": 1}
{"text": "you're not", "label": 1}
{"text": "Someone gave up on locktober 🤣", "label": 1}
{"text": "They probably got an invite to swalloween", "label": 1}
{"text": "Oh the “tsk” got me and I don’t even have what that cage is for", "label": 1}
{"text": "Oh sweet summer child...", "label": 1}
{"text": "So rare to see one in the wild. They’re usually only found in captivity", "label": 1}
{"text": "You've discovered a Dogging site. It's the human version of letting your pet off the leash.", "label": 1}
{"text": "Drink to get Uranium (235) Fever", "label": 1}
{"text": "A womb ferret cage", "label": 1}
{"text": "Can you take a picture from farther away?", "label": 1}
{"text": "Grab it (with a glove), and visit all the men in the kindgom like some kinky inversion of cinderella.", "label": 1}
{"text": "Someone’s locktober isn’t going well! That is a chastity cage!", "label": 1}
{"text": "Come on, you know what it is.", "label": 1}
{"text": "It's like a Cinderella story", "label": 1}
{"text": "There are smaller :3", "label": 1}
{"text": "If this in any way alters my amazon algorithm....", "label": 1}
{"text": "Cinderella....", "label": 1}
{"text": "Irish spring", "label": 1}
{"text": "bet someone is using clay face masks", "label": 1}
{"text": "Old medical clinic exam rooms often have a special catch on sink drains for plaster, back when plaster casts were a thing.  Without it the plaster settles to the bottom of the P trap and slowly builds up until the pipe is choked off.", "label": 1}
{"text": "Eau well, that’s sorted then", "label": 1}
{"text": "It’s a Large Virginian *bottom-vented* Furniture Square piece, they came in different colored sets which included a rhombus, a chunk of soap, and a firehose.\n\nThis was from Furniture Square’s *Dark Brown* series, and was slightly more popular than their *Checquer-board* or *Series M* sets, which contained automatic stools for *butter washing.*\n\nIt’s unfortunate how they only made several hundred models, with most ending up lost, stolen, or destroyed in the final hours of WWII, and with their means of cultivation being lost to oral history, it’s unlikely we will see so fine a specimen as this, should we catch the rare glimpse of one out yonder in the wild, harken.", "label": 1}
{"text": "This is what I imagined the chokey from Matilda looked like.", "label": 1}
{"text": "The proverbial fatburg", "label": 1}
{"text": "It could be [Woody Allen’s gub.](https://youtu.be/4VdMdboymT8?si=StQoQ_3xaqhymnLY). Apt natural.", "label": 1}
{"text": "Looks like a stone age tool of some sort, or the fake gun John Dillinger carved to break out of jail, no, that was soap. I’m thinking stone age tool", "label": 1}
{"text": "Glockenspiel", "label": 1}
{"text": "Dillinger's wooden gun.", "label": 1}
{"text": "that exactly what a government stooge would say", "label": 1}
{"text": "  New one on me. Just when you think there’s nothing you ain’t seen. Idk.", "label": 1}
{"text": "  If it’s a rental it may be done on purpose", "label": 1}
{"text": "Turdsickle!", "label": 1}
{"text": "Damn - did you just explain “large vinyl discs” AKA - records. Never realized that would need a description…bummer - Getting old!", "label": 1}
{"text": "I was being a bit facetious, but saw a post today about someone who had never seen a dial phone irl...", "label": 1}
{"text": "To be fair, vinyl is still being sold and has had a bit of a revival.\n\nI don't think rotary phones even work with modern VoIP infrastructure.", "label": 1}
{"text": "> I don't think rotary phones even work with modern VoIP infrastructure.\n\nIn most cases, they actually do.\n\nBut you won't be navigating your bank's phone tree with one.", "label": 1}
{"text": "An ancient Egyptian toy gun", "label": 1}
{"text": "John Dillinger was there between jail breaks", "label": 1}
{"text": "That’s so disappointing. I love me a vintage record player ❤️", "label": 1}
{"text": "That is one of those ghost guns I keep hearing about super dangerous assault weapon 94.", "label": 1}
{"text": "Pre-Historic pistol", "label": 1}
{"text": "A proper ATA implementation will actually do so.\n\nBut it's still slow and depending on the voice tree, some systems might time out when you're trying to dial a 9 or zero.", "label": 1}
{"text": "Kinda pistol, from Stone Age cowboys", "label": 1}
{"text": "That is beautiful!!", "label": 1}
{"text": "He's got A GUN!!", "label": 1}
{"text": "This sub never fails to amaze me lol", "label": 1}
{"text": "Looks like a glock", "label": 1}
{"text": "VOIP is surprisingly compatible with pulse dialing in my experience.", "label": 1}
{"text": "Some WW1 era pistol.", "label": 1}
{"text": "Ez. Its a \" fn browning m1910\"", "label": 1}
{"text": "Have you tried going down it yet?", "label": 1}
{"text": "That's just a Glock Rock, toss it back where ya found it...", "label": 1}
{"text": "All comments must be civil and helpful toward finding an answer.\n\n**Jokes and other unhelpful comments will earn you a ban**, even on the first instance and even if the item has been identified. If you see any comments that violate this rule, report them.\n\n[OP](/u/evenstarrrrrrr), when your item is identified, remember to reply **Solved!** or **Likely Solved!** to the comment that gave the answer.  Check your [inbox](https://www.reddit.com/message/inbox/) for a message on how to make your post visible to others.\n\n----\n\n[Click here to message RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/whatisthisthing/comments/1gezvrw/palmsized_bullet_shaped_copper_shell_hollow_and/]%0A%0ARemindMe!%202%20days)\n\n----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": "OP runs a Vactor.", "label": 1}
{"text": "It's clearly a pistol. Pew pew", "label": 1}
{"text": "Looks like an Iron Age toy used by Iron Age kids for playing “Cops and Robbers”", "label": 1}
{"text": "I didn't see that and didn't realize that it had an actual term. well you learn something new every day", "label": 1}
{"text": "I would advise against microwaving it", "label": 1}
{"text": "Practice mortar round", "label": 1}
{"text": "And how is his wife holding up?", "label": 1}
{"text": "Blip blam bicky", "label": 1}
{"text": "Please do a follow up! I’m so curious to know!", "label": 1}
{"text": "Idk, if there’s a chance it’s unexploded ordinance I wouldn’t be moving it. Just call the authorities to give it a check and confirm it’s safe. If it an old explosive moving it increases the chance it’ll go off suddenly", "label": 1}
{"text": "Do you live near any military bases that test artillery? Like within 25 miles.", "label": 1}
{"text": "I noticed that also.", "label": 1}
{"text": "Eanager On Duty", "label": 1}
{"text": "It's a stone age gun 😅", "label": 1}
{"text": "Welp we’re cooked.", "label": 1}
{"text": "FYI\nIf you use \"then\" it means you are sorry after you are safe.", "label": 1}
{"text": "It's only 3 eggs long... Perfect soda can size although I agree the opening seems a little large.", "label": 1}
{"text": "Could have been dumped a while ago, I suppose.", "label": 1}
{"text": "Was hoping i would see this response. Thats exactly what I thought as well.", "label": 1}
{"text": "Caveman gun.", "label": 1}
{"text": "But how many bananas wide is it?", "label": 1}
{"text": "https://en.m.wiktionary.org/wiki/p%C3%B3g_mo_th%C3%B3in?origin=serp_auto", "label": 1}
{"text": "If it feels heavy and flexible and has a dull thud when you tap it and scratches easily with a sharp object it could be a lead alloy, the shape means nothing to me “oh Vienna”", "label": 1}
{"text": "I'm going to go with UXO.  Contact the authorities, as that can be dangerous.", "label": 1}
{"text": "Sorry, this is a metric can dispenser… What is the plantain to Cavendish conversion rate?", "label": 1}
{"text": "It's a BIT large for that 😵", "label": 1}
{"text": "I swear you guys all work for the bomb squad and just want more overtime.", "label": 1}
{"text": "Any crows in the area? Reminds me of something they’d pull.", "label": 1}
{"text": "Looks like either a corroded pistol or one of a sailboat’s tie-off points.", "label": 1}
{"text": "Just shoot it from 100 m away. That's how we used to fix these kind of problems over seas", "label": 1}
{"text": "Careful it might belong to the same guy that put that antitank round in his ass!", "label": 1}
{"text": "Pruned * 😅", "label": 1}
{"text": "Some strong fucking crows 💀", "label": 1}
{"text": "It’s for Cans but don’t use it for that, it sucks lol", "label": 1}
{"text": "What is the airspeed velocity of an unladen crow?", "label": 1}
{"text": "African or European?", "label": 1}
{"text": "r/unexpectedmontypython", "label": 1}
{"text": "It's a tree-D printer.", "label": 1}
{"text": "Looks like a pew-pew to me?", "label": 1}
{"text": "Well, that’s completely random.", "label": 1}
{"text": "Probably an African Swallow could.", "label": 1}
{"text": "It doesn't matter where 'e grips it, it has to do with simple weight ratios", "label": 1}
{"text": "Everyone is thinking in the wrong direction. This thing clearly burrowed up from underground.", "label": 1}
{"text": "It’s a plumb, Bob.", "label": 1}
{"text": "F walnuts, get yourself some lobster", "label": 1}
{"text": "Scraping political stickers off of cars!!!", "label": 1}
{"text": "30-60 mph, 70 mph in a dive. (According to Google) \n\nI just had to know after you asked that question........(ツ)", "label": 1}
{"text": "Cool.. until they drop in where they dropped a \"pin\" and take my dog as an exemplary specimen of native species. I prefer a boring life, thank you! 😂", "label": 1}
{"text": "African, or European crows?", "label": 1}
{"text": "Looks like a part of a pistol grip/ handle from a gun.", "label": 1}
{"text": "That’s a raptor egg. They had lethal claws on all four limbs; a swipe of a forearm would disembowel a man, spilling his guts out.", "label": 1}
{"text": "Early American gun.", "label": 1}
{"text": "Nah, not in America, and OP didn't say they were black.", "label": 1}
{"text": "A submarine egg?", "label": 1}
{"text": "I live in the Seattle area, I’ve seen Crows fly away with huge rats", "label": 1}
{"text": "What if two crows, both African Crows, grabbed it by the tusks and flew it in?", "label": 1}
{"text": "Is German matter OK?", "label": 1}
{"text": "Wow, that’s a lot of down votes for something that looks really similar to an old mortar practice round.", "label": 1}
{"text": "People 10 thousand years from now are gonna be scratching their heads when they uncover this junk", "label": 1}
{"text": "If you want to torture yourself, crack open a fill plug and give a sniff. Don't know what vac pump oil is made from but the used stuff smells terrible.", "label": 1}
{"text": "Only when accompanied by crows.", "label": 1}
{"text": "At least your (possibly autocorrect) error made some interesting [pics](https://old.reddit.com/r/RenderedComment/comments/1gf9j44/i_poked_it_with_my_garden_shears_when_i_printed/)", "label": 1}
{"text": "Disgruntled villager must have lobbed it over my fence.", "label": 1}
{"text": "Does it go “Pew Pew-Pew…Pew Pew…Pew Pew Pew?”", "label": 1}
{"text": "Does it fit in your butt?", "label": 1}
{"text": "🤣 Exactly", "label": 1}
{"text": "Any little boy could tell you this is a gun", "label": 1}
{"text": "Heh. Boning.", "label": 1}
{"text": "Yup, beat me by 4 minutes.", "label": 1}
{"text": "“Music used to be played on large vinyl disks”\n\nThis is it. The moment I turned old.", "label": 1}
{"text": "super spy device. implant your own spy device and return to sender immediately. please report back!", "label": 1}
{"text": "Can't leave us hanging", "label": 1}
{"text": "I'm old and I never called it a radiogram lol.", "label": 1}
{"text": "The anticipation is tearing me apart", "label": 1}
{"text": "Oh my gah it’s an MMA fight! TWIST HIS TICK!!", "label": 1}
{"text": "Why did someone downvote OPs post lmao \n\nDoes your GF have a vuse vape? Looks like almost the right size for the magnets on the bottom that connect it to the charger", "label": 1}
{"text": "Care to share with the rest of the class lol", "label": 1}
{"text": "I like to hold milk bags", "label": 1}
{"text": "Amazing that they found such a tiny thing!", "label": 1}
{"text": "That's not how solid state storage works. Unless we're assuming their iPhone runs on a magnetic storage medium, such as a floppy disk, tape drive or hard disk drive like a microdrive. But that'd be some pretty heavy-duty modding and I feel like they'd know the risks at that point.", "label": 1}
{"text": "That’s awfully generous.", "label": 1}
{"text": "We got stone gun before GTA 6.", "label": 1}
{"text": "Exactly. Magnetic phone holders exist. Everywhere.", "label": 1}
{"text": "Looking at that Amazon link, what the hell is a California Pizza bowl and plant based pepperoni?", "label": 1}
{"text": "That's not Amazon, but it gets worse. It's a [*cauliflower* pizza bowl](https://www.kroger.com/p/tattooed-chef-plant-based-pepperoni-cauliflower-pizza-bowl/0085001598258) with fake pepperoni.", "label": 1}
{"text": "its a carving tool", "label": 1}
{"text": "Let it go and then follow it back to the lair of the evil scientist who is controlling it with his mind and manufacturing millions of identical magnetic nodes, with plans of using them to build a giant inter-dimensional gate, which will open up and swallow an entire building with zero regard for the hundreds of human lives in/around the building, as payback for one accidental death, bc it was his daughter.", "label": 1}
{"text": "That’s why I went with an 8-track-based phone.", "label": 1}
{"text": "Carving shit", "label": 1}
{"text": "Oh mah gawd dude this is a MMA fight!\n\n\n\n\nTWIST HIS TICk!!!", "label": 1}
{"text": "I've seen these as sauce decorating spoons... you can put coulis in then and \"draw\" lines on the plate.https://www.cakecraftcompany.com/tools-equipment-c165/silikomart-garnishing-decorative-spoon-set-of-2-p10605/s18675?utm_source=google&utm_medium=cpc&utm_term=silikomart-garnishing-decorative-spoon-set-of-2-cc-2309&utm_campaign=product%2Blisting%2Bads&cid=GBP&glCurrency=GBP&glCountry=GB&gad_source=1&gclid=Cj0KCQjwsoe5BhDiARIsAOXVoUvSlu-Q5OAzxL0CE3DTIRETRxgJrj2vma9MLDKAdFQJqUJ3he9HY74aAmmWEALw_wcB", "label": 1}
{"text": "I don't know what it's specifically for but I'd use it to core jalapenos for poppers", "label": 1}
{"text": "That’s the holy grail of prison spoons!", "label": 1}
{"text": "TIL there are special utensils for cutting the green tops off strawberries. Now i want one for Christmas", "label": 1}
{"text": "But I guess you need a bigger sized one to slip over their head?", "label": 1}
{"text": "\"That is the most intricate poo I've ever seen.\"", "label": 1}
{"text": "From what I can see, It appears to be a Very Good Boy who wants you to put the coconut scraper down and get back to the pets and scratches ASAP.", "label": 1}
{"text": "Looks like a gun", "label": 1}
{"text": "🤣My first thought too!", "label": 1}
{"text": "Old timey pogo stick, missing the spring.", "label": 1}
{"text": "Look at those lovely dogs.\nI think they need big hugs and belly rubs!", "label": 1}
{"text": "Yup, beat me by 12 hours.", "label": 1}
{"text": "Tractor eggs. This is how baby tractors are born.", "label": 1}
{"text": "When you’re too nosey for your own good. Lol. Prob hay or metal", "label": 1}
{"text": "Is this the missing cheese?????", "label": 1}
{"text": "There has been some controversy in the southwest US about Saudis doing this. They buy land with water rights, grow and export forage crops that they can't grow in the desert. So, in a way they are exporting water in the form of forage.", "label": 1}
{"text": "Some need to go see the country side", "label": 1}
{"text": "Not many people know this but these are actually Marshmallows in transit.  The fully grown ones (white) are being shipped with the immature (black) which get cut up and processed into the marshmallows we buy at the store.", "label": 1}
{"text": "Context is important on this one, y'all", "label": 1}
{"text": "Had one of those in prison, don’t ask where I kept it.", "label": 1}
{"text": "Isn’t that what Indy used in Raiders of the Lost Ark to show where he should dig?", "label": 1}
{"text": "Last time someone told me that I ended up trading our family’s cow.", "label": 1}
{"text": "Beat me to it\n\nP.S. Don't eat the dates", "label": 1}
{"text": "Do no twist ticks. That's a horrible advice. Gosh. Read the instruction!", "label": 1}
{"text": "Your Mission, If you choose to accept….", "label": 1}
{"text": "I thought it was a bear!", "label": 1}
{"text": "Does blue light work on human stress? Asking for me", "label": 1}
{"text": "Giant flute.", "label": 1}
{"text": "Ive seen that. Some dystopian shit", "label": 1}
{"text": "No, I think they mean gourmet pencils for chewing", "label": 1}
{"text": "It’s a rod for finding a lost temple where the ark is. Chrystal goes at the top.", "label": 1}
{"text": "That makes sense. \n\nYou make a good point", "label": 1}
{"text": "Pretty sure it’s a reverse power coupling.", "label": 1}
{"text": "I 100% thought Indiana Jones, obviously", "label": 1}
{"text": "LED collar \nSolved!", "label": 1}
{"text": "Could it be a nuclear powered aircraft carrier? ", "label": 1}
{"text": "oh yeah i agree. good call", "label": 1}
{"text": "Fun fact if you swallow one of these every few hours they will collect extra iron in your food resulting in a healthier you.", "label": 1}
{"text": "Tik tok is trash, can’t even play the video without downloading the malware that’ll pump all my data all the way to China", "label": 1}
{"text": "This is what I see too.", "label": 1}
{"text": "Oh yeah, you have a duende infestation. I'm sorry but you should just abandon the property.", "label": 1}
{"text": "A four dimensional nuclear powered aircraft carrier, absolutely.", "label": 1}
{"text": "Those are blue lights in a silver box truck.", "label": 1}
{"text": "wtf? who shares a link to a tiktok video?", "label": 1}
{"text": "Request desktop site if you’d like to bypass that.", "label": 1}
{"text": "It’s a Minion!", "label": 1}
{"text": "Master Tonberry", "label": 1}
{"text": "Most likely not, but possibly.", "label": 1}
{"text": "I think it might be a debunker wearing a truth illuminator?", "label": 1}
{"text": "ET.  Phone home.", "label": 1}
{"text": "Apparently, this is mouse get photo with flash)", "label": 1}
{"text": "I believe that was the one who was foretold in the scriptures.", "label": 1}
{"text": "That's Yoda", "label": 1}
{"text": "Something tells me if OP did that, then the karma farm would be shut down.", "label": 1}
{"text": "Yes it’s d set one one with a light on there head looking at there luggage or back pack!\nThat’s it!\nNext!", "label": 1}
{"text": "It kinda looks like ET", "label": 1}
{"text": "This is hilarious considering you're on Reddit, which is also pumping all of your data to everyone that will pay for it. While using a device that is also pumping all of your data to everyone that will pay for it…", "label": 1}
{"text": "Finally, some good ORB FOOTAGE", "label": 1}
{"text": "Its obviously Yoda", "label": 1}
{"text": "ET? Phone home...", "label": 1}
{"text": "That is a Tonberry. Don't let it touch you.", "label": 1}
{"text": "E.T. Phone Home…", "label": 1}
{"text": "LMAOOOOOOO", "label": 1}
{"text": "What an unreal world that a cat with a camera strapped to it is a thing", "label": 1}
{"text": "It's a motorcyclist looking into his backpack with his phone flashlight while waiting to pick up poop from his dog who is wearing an LED collar similar to the collar on the cat they folloed here.\nMy second guess: radioactove raccoon.", "label": 1}
{"text": "I love those tiktok videos of the cat running the streets with a camera on its collar.", "label": 1}
{"text": "Oh man, do I have a treat for you [then!](https://www.youtube.com/shorts/oe78JHgitWk?feature=share)", "label": 1}
{"text": "That could literally be anything. Jesus Christ", "label": 1}
{"text": "Yes bro! Max the cat 😍 love that cat", "label": 1}
{"text": "What’s to say they don’t have a big screen in their bathroom…. Living the dream!! 😝", "label": 1}
{"text": "Billy Ray Valentine at the beginning of Trading Places", "label": 1}
{"text": "Someone putting meshtastic nodes on your street posts.   :)", "label": 1}
{"text": "That cat runs the whole block !!", "label": 1}
{"text": "tiny guy on a tiny motorcycle whizzing by", "label": 1}
{"text": "Thank you for posting with us. However, your submission has been removed because it appears you already know what this is.\n\nIf you want more information about your item (or wish to find one to buy), please try /r/helpmefind.\n\nIf applicable, try searching \"[your thing] owner's manual\" in your favorite search engine.\n\nFor identification or assistance with a specific type of thing, please check the below list of helpful subreddits:\n\n* /r/findfurnitureID - If you are trying to identify a particular piece or style of furniture.\n* /r/findfashion - If you are trying to identify an item of clothing or an element of design on a piece of clothing.\n* /r/cableadvice - If you are trying to identify a cable or adapter.\n* /r/antennasporn - If you are curious about an antenna or aerial you have found.\n* /r/whatisthiscar or /r/namethatcar - If you are trying to identify a car or part of a car.\n* /r/namethatbike - If you are trying to identify a bike or trike.\n* /r/whatisthisplane or /r/namethatplane - If you are trying to identify an aeroplane or other aircraft.\n* /r/whatsthistool or /r/tools - If you are trying to identify a tool or tool like utensil.\n* /r/fasteners - If you want to identify a screw, bolt or other fastener.\n\nIf the above don't fit your needs, please see [this list of helpful subreddits](/r/whatisthisthing/wiki/otherreddits).\n\nOtherwise please try a subreddit specific to your item, /r/findareddit can assist with finding the right place.\n\nBefore posting to other subreddits, please make sure you understand their rules and posting guidelines.\n\nFor future posts here, be sure to read the [submission guidelines](/r/whatisthisthing/wiki/guidelines) and [FAQ](/r/whatisthisthing/wiki/faq).\n\nReplies to this comment, private messages, and chat requests will not be answered, please [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fwhatisthisthing) if you have questions.\n\nThanks.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": "ET phone home", "label": 1}
{"text": "Propane sprinkler of course!", "label": 1}
{"text": "Check out r/catpov", "label": 1}
{"text": "I see frogs", "label": 1}
{"text": "That's because I'm the Hank Hill of irrigation.....and irrigation accessories.", "label": 1}
{"text": "Perfect response", "label": 1}
{"text": "Orion’s Belt!", "label": 1}
{"text": "Mount it on a wood board, add some led lights and sell it as art hanging", "label": 1}
{"text": "Mee too. Thought I was going mad. That's two of us.", "label": 1}
{"text": "Looks like a Tonbarry to me", "label": 1}
{"text": "I guess cats are smarter than pigs.", "label": 1}
{"text": "To be fair, cats are far less corrupt. They are quite open about our disdain for us, and don't pretend with dog and pony shows to impress us to get funding... wait a minute... that sounds like the cute meowing at feeding time!! \n\nWell, my cat my be a cop.", "label": 1}
{"text": "**Hi, thanks for posting with us.  Your post was removed and your item needs to be resubmitted with a title that better describes the item.  Even if there are clear pictures, good descriptions make for easier searching in the future.**  \r\n\r\n**Please read this entire message**\r\n\r\n# Your title should provide a physical description of the object. \r\n\r\nPretend you are describing it over the phone to someone who cannot see the photo(s). We realize you may not know all of these, but include things like this in the title:\r\n\r\n* Size\r\n* Shape\r\n* Weight\r\n* Color\r\n* What it's made of \r\n* If anything is written on it\r\n* If anything moves\r\n* If it appears to be electronic, needs batteries, lights up\r\n* If it makes a noise\r\n\r\nYou may include where it was found, *if it's relevant*.  \"Found six inches underground on a farm in Kansas\" may be relevant. \"Found in my friend's new flat\" is probably not relevant. \r\n\r\n# Do **not** include things like this in the title:\r\n\r\n* Who used to own it\r\n* Speculation on what it is\r\n* A question like \"what is this\" or statement like \"I don't know what this is.\"  That is always assumed.\r\n* Adjectives that don't describe the item in a meaningful way, such as \"weird\", \"strange\", \"odd\" and similar.\r\n* Family member mentions (this is to avoid public disclosure of family activities/history people may not want public)\r\n\r\n# Finally: \r\n\r\nOnce you submit your thing, it is held for moderation, and you need to read and follow the private message you'll get from Automoderator regarding what you need to do for the submission to go live.\r\n\r\nThanks for understanding.", "label": 1}
{"text": "I was gonna say, paint the frogs green", "label": 1}
{"text": "That’s a fancy perogie pogie.", "label": 1}
{"text": "E.T. trying to phone home", "label": 1}
{"text": "I see weightlifters", "label": 1}
{"text": "Took me a min, but I can see it too", "label": 1}
{"text": "Go out there with a hair dryer and cause some chaos", "label": 1}
{"text": "We call it “vättar” in Sweden. It’s small mythological creatures running around at night fixing or ruining stuff depending on their mood. And their mood is dependent on how good the offerings are that you have given them on the porch before night time.", "label": 1}
{"text": "I see my father beating my mother", "label": 1}
{"text": "Or simply just a ghost with a shiny light", "label": 1}
{"text": "Chucky with a very very big knife", "label": 1}
{"text": "I second that intergalactic communication theory. It's E.T. Zoom in.", "label": 1}
{"text": "Pool noodle extruder?", "label": 1}
{"text": "Looks like a tomberry", "label": 1}
{"text": "so did my mom!", "label": 1}
{"text": "It’s this OP", "label": 1}
{"text": "I see a teddy bear holding a moltov cocktail. 🤷", "label": 1}
{"text": "TIL submersible pumps look like artillery shells.", "label": 1}
{"text": "A load from the tradies apprentice when he was tasked with cleaning said lumber to build your deck. JFK costabius beat me to it.", "label": 1}
{"text": "DING DING DING!", "label": 1}
{"text": "Great, now that's in my Amazon search history. Good find, by the way.", "label": 1}
{"text": "Skynet landing a Cyberdyne Systems T-850", "label": 1}
{"text": "Ours looks like a landmine.", "label": 1}
{"text": "Is it sad that I read that in Chills’ voice?", "label": 1}
{"text": "i guess he's a bit weird looking but there's no need to insult his intelligence ˙◠˙", "label": 1}
{"text": "The rebel alliance?", "label": 1}
{"text": "Giant piccolo", "label": 1}
{"text": "Right!? I was a bit concerned!!!", "label": 1}
{"text": "holds a TON of ink", "label": 1}
{"text": "But you still wiped it off???", "label": 1}
{"text": "aw come on now it’s way too early to tell if it’s gonna be a dummy.", "label": 1}
{"text": "They film adult movies in it. Look on any of the x sites and you’ll find them.", "label": 1}
{"text": "Yea but my post gets removed for not naming location size and some more bs", "label": 1}
{"text": "Primitive baby bell prototype.", "label": 1}
{"text": "Tracks, likely places that this person has gone to race at", "label": 1}
{"text": "I don’t know, but tell her to run far far away. It can see into your soul.", "label": 1}
{"text": "Baby egg scrambling pod.", "label": 1}
{"text": "It looks like a vessel my grandmother would transport communion home from church to give to her mom.", "label": 1}
{"text": "Looks like one of those super sized training props for a huge bullet like a .357 or something to me but yeah TIL lol", "label": 1}
{"text": "Reusable babybel holder", "label": 1}
{"text": "First one, then the other.", "label": 1}
{"text": "I really want that to be a fancy tortilla holder. \n\nStupid nail file.", "label": 1}
{"text": "Uncrustable holster", "label": 1}
{"text": "The remains of baby Alistair?", "label": 1}
{"text": "Vintage babybel", "label": 1}
{"text": "Emergency Ritz Cracker container", "label": 1}
{"text": "The size of half a giraffe.", "label": 1}
{"text": "Thats probably a nail file but ive seen something very similar that catholics would keep a jesus wafer in.", "label": 1}
{"text": "A potential weapon?", "label": 1}
{"text": "I think it’s an emergency case to carry one cracker, because you never know when it might come in handy", "label": 1}
{"text": "Lol, thought that too", "label": 1}
{"text": "Ijbol", "label": 1}
{"text": "Definitely ghosts. You need to spray for those.", "label": 1}
{"text": "I thought that too!", "label": 1}
{"text": "I do t think artillery shells have ID tags riveted on.", "label": 1}
{"text": "A really REALLY fancy communion wafer??", "label": 1}
{"text": "For sneaking booze into concerts.", "label": 1}
{"text": "Dried up Babybel cheese", "label": 1}
{"text": "Babybell cheese", "label": 1}
{"text": "When you need your communion on the go.", "label": 1}
{"text": "You’re thinking of a pyx. It holds the Eucharist for transport.", "label": 1}
{"text": "That’s ET phoning home", "label": 1}
{"text": "Ancient baby bel", "label": 1}
{"text": "My treasured POG carrier", "label": 1}
{"text": "Flaming bag of dog shit", "label": 1}
{"text": "What a cheesy reply 🧀 🤣", "label": 1}
{"text": "Oreo de-creamer", "label": 1}
{"text": "A case for taking your communion wafer to-go! Ha", "label": 1}
{"text": "I see this is solved, but my brain just kept saying \"it's one of them little cheeses with the fancy wax seals.\"", "label": 1}
{"text": "This is clutch!", "label": 1}
{"text": "All three of yas is nuts 🤣frogs?", "label": 1}
{"text": "That's why YOU, will be seeing ME tomorrow at breakfast. Had to get momma free and safe from paw, he's never going to hit momma again boy, look at me son....I promise, never again. Now go on and get some rest.", "label": 1}
{"text": "It’s where I keep my body-of-Christ cookies", "label": 1}
{"text": "Damn it Ricky…", "label": 1}
{"text": "You never know when you might need one!", "label": 1}
{"text": "I was going to guess a carrier for taking a communion wafer “to go”. I still prefer my answer", "label": 1}
{"text": "A raccoon eating someone’s solar pathway light.", "label": 1}
{"text": "Better buy some Reese's Pieces and make a trail to a tent with discarded electronics!", "label": 1}
{"text": "For when you want your hash puck to also be a coaster.", "label": 1}
{"text": "It's for those high-level cocktail snobs who bring their own coaster to the bar and claim it impacts the flavor and mouthfeel of the drink. The case is temperature and humidity controlled.", "label": 1}
{"text": "I think it is an accessory of something, might be a lamp", "label": 1}
{"text": "I have this too, a rastaclat keychain!", "label": 1}
{"text": "I have this as a toy with a lace when I was a kid", "label": 1}
{"text": "It looks like a nail file or a foam of a foundation", "label": 1}
{"text": "Looks like it comes from a battle or a war", "label": 1}
{"text": "It looks like a slime, my kid has it as a toy.", "label": 1}
{"text": "I think this is a solar panel or something", "label": 1}
{"text": "I'm not the only one that saw this!", "label": 1}
{"text": "First ton, then the other.", "label": 1}
{"text": "Or shit ton?", "label": 1}
{"text": "I know this isn’t it, but it looks like a babybel cheese lol", "label": 1}
{"text": "It's where Catholic's keep their Jesus cracker, I'm certain.", "label": 1}
{"text": "It’s a tortilla storage!", "label": 1}
{"text": "Nice frog art", "label": 1}
{"text": "Communion cracker holder \na.k.a. The body of Christ", "label": 1}
{"text": "Host2Go™ - Communion on your time.", "label": 1}
{"text": "the first thing i thought of was babybel cheese", "label": 1}
{"text": "Babybel soft mozzarella cheese", "label": 1}
{"text": "Ha, mot even close. Where the hell did you come up with that?", "label": 1}
{"text": "Uzumaki - Be Careful", "label": 1}
{"text": "An ancient prototype belonging to Mr. Moebius?", "label": 1}
{"text": "You have been fortunate enough to stumble upon hypno-disks final resting place.", "label": 1}
{"text": "How much is that in double-decker buses?", "label": 1}
{"text": "That's the last bastion of a stumped archaeologist \"Religious, or ceremonial purposes\"", "label": 1}
{"text": "No answers here but I’m following to find out too!", "label": 1}
{"text": "seems to be a gargoyle. You hang it by a locking hook. Does the groove go inside the head?", "label": 1}
{"text": "My question too.  If there is a hole leading from top of the groove into the head/mouth, I'd be guessing at a water feature for a small bowl (?)", "label": 1}
{"text": "I wonder if there are any belemnites in my area looking to connect", "label": 1}
{"text": "It's a heavy metal cd", "label": 1}
{"text": "We're going to candy~~cane~~ mountains, Charlie.", "label": 1}
{"text": "they are REAL", "label": 1}
{"text": "It's a Liopleurodon charlie.", "label": 1}
{"text": "But you for sure had it at 1,000,000,001!", "label": 1}
{"text": "Hot belemnites in your area", "label": 1}
{"text": "Aardvark penises", "label": 1}
{"text": "They're minerals, Marie!", "label": 1}
{"text": "So i found this while cleaning out a friends factory after he had people living there that up and left leaving some unwanted things behind. I was told by someone that this is used to tune the sub ghz something or other for boats that travel into a certain depth/body of water.\n\nIt had a sticker saying “Melbourne” on the back, and there is a white plastic top cover the same as the back, i have just misplaced it.\n\nAs you can see it plugs in via usb. On the cord that I found with it, it says: Front PC - Com 5, TR PC Com 8, GC PC - Com 9 (admin). “Must use these com parts as options E5”\n\nI have tried using google lens and usually can identify most computer and other IC’s or components on pcb’s and the like, but this little guy had me totally stumped.\n\nAny help would be much appreciated to put my mind at ease. I have OCD and it’s torture not being able to work it out.\n\nThanks in advance!\nLouis✌️", "label": 1}
{"text": "For like a necklace or?", "label": 1}
{"text": "Its candy mountain charlie! Candy mountain!", "label": 1}
{"text": "Belemnite centipede", "label": 1}
{"text": "[did someone say Candy Mountain?](https://youtu.be/CsGYh8AacgY?si=0ti_1zIcU7HBz4nd)", "label": 1}
{"text": "Candy Mountain Charlie! YAY!", "label": 1}
{"text": "Shun the non-believer! Shuuuuuuuuuunnn!", "label": 1}
{"text": "\"Charlie noo\"", "label": 1}
{"text": "I counter that evaluation with festive to marginally festive", "label": 1}
{"text": "OMG they stole my kidney!", "label": 1}
{"text": "chaaaaarlie…", "label": 1}
{"text": "I’m mildly disappointed that I had to scroll this far to find the candy mountain reference", "label": 1}
{"text": "Me too. But the world is made right again. And i I can sleep now. My day is fulfilled.", "label": 1}
{"text": "> obviously rounds from some large rifle. \n\nThe famous M1918A2 SAW (Squid Automatic Weapon).", "label": 1}
{"text": "Oh god it’s you guys! This better be pretty friggin important!", "label": 1}
{"text": "Pic 2 even looks like open tip match rounds. So crazy it’s a fossil!", "label": 1}
{"text": "And what would happen if I fell into it?", "label": 1}
{"text": "You'd take a spill and possibly get stuck on the way through.", "label": 1}
{"text": "No it’s fine", "label": 1}
{"text": "Out of the environment", "label": 1}
{"text": "Past the environment", "label": 1}
{"text": "That’s where the bodies are", "label": 1}
{"text": "A farm upstate.", "label": 1}
{"text": "State Farm", "label": 1}
{"text": "Like a good neighbor, State Farm is there", "label": 1}
{"text": "I can highly recommend post10 on youtube if you want to some chill videos anbout culverts.", "label": 1}
{"text": "Straight to Brazil", "label": 1}
{"text": "A wave, at sea? Chance in a million", "label": 1}
{"text": "Ask the person who gave them to you.", "label": 1}
{"text": "Oh . I'm sorry.  I thought I left those in my sex dungeon.", "label": 1}
{"text": "Cost of doing business.", "label": 1}
{"text": "Or the sun goes supernova and cooks the planet.\n\nGazebo isn't so smart now is it!", "label": 1}
{"text": "I suspect the sun will outlast that deck wood", "label": 1}
{"text": "Real wood?  No, that's plastic lumber, probably.", "label": 1}
{"text": "That seems less likely than having someone fall into an uncovered pit, if the gazebo weren't there.", "label": 1}
{"text": "Ahh but they might not even be there if there wasn’t an inviting gazebo drawing them in", "label": 1}
{"text": "And imagine jumping off of it, then turning around and seeing concrete surrounding a giant void.", "label": 1}
{"text": "There’s a metal grate over it, you can’t see it in the image", "label": 1}
{"text": "People in the gazebo would outlive people outside it slightly. How much would you pay for a few extra milliseconds before your immolation?", "label": 1}
{"text": "They say money cant buy happiness. But have you ever seen someone frowning standing in a gazebo as the world comes to an end?\n\nDidn't think so!", "label": 1}
{"text": "Bro. My toes actually curled reading this shit.", "label": 1}
{"text": "Reminds me of The Deer Hunter Russian roulette scene", "label": 1}
{"text": "Keep it, it’s yours, friend :)", "label": 1}
{"text": "It's a pretty consistent way to check operation, after 2 minutes the water should be boiling. And a cup of water is better than bringing a hungry man meal to each house, a man can only eat so much.", "label": 1}
{"text": "Nothing…. Until you turn it on", "label": 1}
{"text": "If it's for a hot beverage an Englishman somewhere dies of inexplicable rage", "label": 1}
{"text": "Same thing that happens to a frog when struck by lightning.", "label": 1}
{"text": "Everyone knows you're supposed to use sealant on the sun to prevent wood damage.", "label": 1}
{"text": "Inexplicable?!? How very dare you.", "label": 1}
{"text": ">  sealant on the sun\n\nIsn't that what the chlorofluorocarbons we've been pumping into the atmosphere is about?\n\nWait...The exact opposite?", "label": 1}
{"text": "Challenge accepted.", "label": 1}
{"text": "What? you mean you have to flirt with the cup of water?", "label": 1}
{"text": "I appreciate knowing this now", "label": 1}
{"text": "I just want to know what you were doing with your microwave before this...", "label": 1}
{"text": "Is t it dangerous to microwave a cup of water? Aren’t you supposed to put a rounded spoon in the cup", "label": 1}
{"text": "Err, I'd kinda recommend not putting metal stuff in your microwave.", "label": 1}
{"text": "Charging my cell phone..", "label": 1}
{"text": "I got that reference", "label": 1}
{"text": "In about 5 billion years the Sun will turn into a red giant and when it does its diameter will balloon out to right around 1 AU.  Don't believe scientists have yet fully estimated its diameter to a level of certainty where we know if Earth will be engulfed or not but it would be very close if it isn't.", "label": 1}
{"text": "Discreetly.", "label": 1}
{"text": "Nah, water makes **you** wet. Water isn't wet itself. ;)", "label": 1}
{"text": "Well that’s just hydrophobic isn’t it!", "label": 1}
{"text": "Good thing we don't have rabies!\n\nEmbrace the wetness!\n\n*Mmmm, feel it*", "label": 1}
{"text": "Imagine being aware of the existence of microwave ovens but not knowing wooden and plastic spoons are a thing.", "label": 1}
{"text": "I read this at first as \"so that you can have the grill on, with the oven door open and burn/melt the control knobs\", which struck me as funny for some reason.", "label": 1}
{"text": "I wanted to upvote this comment but it's at 69...so virtual high five", "label": 1}
{"text": "there is no war in ba sing se", "label": 1}
{"text": "Show me a pic of your cutlery drawer cos I don't for a second think you're using  plastic or wooden spoons.", "label": 1}
{"text": "Minor detail.", "label": 1}
{"text": "Kinda cool. Where can I get one?", "label": 1}
{"text": "Is this right? It sounds like it’s right but my brain won’t accept it.", "label": 1}
{"text": "But also, the comment directly above yours is more relevant. \n\nA metal spoon is less likely to cause a problem than you think.  \n\nMetal bowls and spoons have been A-okay in mine for years! I was taught that by a USCG cook in 1999 and have followed that guidance ever since without issue.", "label": 1}
{"text": "But it's touching water, therefore it's wet.", "label": 1}
{"text": "It gets wet", "label": 1}
{"text": "I mean it does kinda look like one.", "label": 1}
{"text": "Counterfeit Cheez-it.", "label": 1}
{"text": "You’re ignoring the cheezeit like hole in the middle.", "label": 1}
{"text": "You can make things \"wet\" with stuff other than water. Like gasoline.", "label": 1}
{"text": "For something to be wet must it first be dry? The water is doing the wetting, so I'm thinking only dry things can become wet, while water is simply a 'wet thing'.", "label": 1}
{"text": "The water is wet because the rest of the water is making it wet", "label": 1}
{"text": "Then it's not water it's ice", "label": 1}
{"text": "They said turn it on, not question it's own worth", "label": 1}
{"text": "https://www.cheezit.com/en-us/home.html shows the hole right on the site.", "label": 1}
{"text": "Place of power, gotta be.", "label": 1}
{"text": "You’re supposed to shoot an arrow through both of them for a shrine to pop up out of the ground.", "label": 1}
{"text": "Depends on the definition of \"wet\". By any normal definition, water is wet.", "label": 1}
{"text": "We've apparently got lots of Cheezit deniers in this thread.", "label": 1}
{"text": "Off brand cheezit lol", "label": 1}
{"text": "[Since always](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F7jacb27uoznc1.jpeg), as far as I remember.", "label": 1}
{"text": "this feels like A.I.", "label": 1}
{"text": "Medallion is humming", "label": 1}
{"text": "This is gonna be a conspiracy of massive proportion.", "label": 1}
{"text": "As a Cheez-It lover, I really don’t see it.", "label": 1}
{"text": "Idk. I just upvoted for the description of cheez-it like", "label": 1}
{"text": "There's a guy on YouTube who built a microwave that'll do it in two seconds! 20,000 watts!", "label": 1}
{"text": "Yeah, nothing about this makes me think “Whoah, Cheez-It.”", "label": 1}
{"text": "What accent is this that replaces R with W?  Like Bawbwa Waltews", "label": 1}
{"text": "The Macrowave", "label": 1}
{"text": "You went with Cheeze-it as a descriptor idly this?", "label": 1}
{"text": "Cheez-its are the only thing in their life that is square. Thats the only way this could make sense", "label": 1}
{"text": "this is exactly how they look after soaked in Coca-Cola for 3 days", "label": 1}
{"text": "Of course it was him.", "label": 1}
{"text": "Yeah doesn't this guy know that most residential microwaves are also high pressure vessels???", "label": 1}
{"text": "2cb is some crazy shit", "label": 1}
{"text": "All three of 'em!", "label": 1}
{"text": "I need this object.", "label": 1}
{"text": "It looks like the things that were inside of Dorothy in twister", "label": 1}
{"text": "good use of the banana scale, very understated", "label": 1}
{"text": "Blair Witch adjacent totem, check all the corners but don’t stand there too long", "label": 1}
{"text": "Looks like something from season one of Tru Detective...", "label": 1}
{"text": "I used to be a dishwasher in hs. We would get a really clean mug and fill it with the super clean treated rinse water and throw it in the microwave for a few mins. It would super heat and explode to steam. Like there was no water left at all it was all steam. The trick is to have a very very clean cup and super pure water. I don't know how hot it would get but definitely times it took like 5 mins to pop. Trying it at home was never as good as the restaurant.", "label": 1}
{"text": "You know Carcosa?", "label": 1}
{"text": "Definitely used in satanic rituals.", "label": 1}
{"text": "Apparently it deletes your recent Reddit comments...", "label": 1}
{"text": "I cannot rule this hypothesis out", "label": 1}
{"text": "🎵the groove is in the hearth🎵\n🎵I couldn't ask for another 🎵\n🎵No, I couldn't ask for another🎵\n🎵the groove is in the hearth🎵\n🎵Yeah!🎵", "label": 1}
{"text": "Maybe they’re swollen. 🤷‍♂️", "label": 1}
{"text": "Yep - Blair Witch! was the first thing that popped into my mind.", "label": 1}
{"text": "r/mallninjashit must be leaking...", "label": 1}
{"text": "Maybe they were very macho moths", "label": 1}
{"text": "I came back to this thread to say, bravo, that was brilliant. The Bootsy Collins bass groove lives rent free in my head...", "label": 1}
{"text": "It's for the gate that keeps the witches in.", "label": 1}
{"text": "Looks like some cracktivities were taking place in that house.", "label": 1}
{"text": "Hence the gloves", "label": 1}
{"text": "Have you ever smelled moth balls?", "label": 1}
{"text": "Missed a perfect opportunity for “crappling hook”", "label": 1}
{"text": "/r/mallninjashit", "label": 1}
{"text": "This likely has a home in r/mallninjashit", "label": 1}
{"text": "This gives me \"it's 1996 and you just walked into the shitty head-shop in the local mall\" vibes.", "label": 1}
{"text": "Not just good times, *great* times", "label": 1}
{"text": "Number one!", "label": 1}
{"text": "How did you get their little legs apart?", "label": 1}
{"text": "i agree. it looks like it came from the credenza in Mr Worf's quarters.", "label": 1}
{"text": "What was the point of that? Just because it's cool or did it have any other purpose?", "label": 1}
{"text": "Just a couple teenage guys fucking around at work, also scaring the waitresses", "label": 1}
{"text": "But will it Keeell….??", "label": 1}
{"text": "Yeah, or ordered it for $9.95 plus shipping and handling out of some catalog.", "label": 1}
{"text": "Does Godwin s law need to be updated to j6?", "label": 1}
{"text": "It's a crappy fantasy grappling hook. I got one from a gun and knife show when I was 18....30 years ago...\n\nMy story begins in nineteen-dickety-two. We had to say -dickety- because the Kaiser had stolen our word -twenty-. I chased that rascal to get it back, but gave up after dickety-six miles. What are you cackling at, fatty? Too much pie, that's your problem! Now, I'd like to digress from my prepared remarks to discuss how I invented the terlet....", "label": 1}
{"text": "I think a lot of laws need to be updated based on J6", "label": 1}
{"text": "R/mallninjashit", "label": 1}
{"text": "This is the solution.", "label": 1}
{"text": "This guy treks.", "label": 1}
{"text": "Bud K Special", "label": 1}
{"text": "I stupid giggled. Well done.", "label": 1}
{"text": "r/mallninjashit", "label": 1}
{"text": "Molag Bal ass weapon", "label": 1}
{"text": "I just shit my draws", "label": 1}
{"text": "I wanna be in the screenshot when someone posts this to r/clevercomebacks", "label": 1}
{"text": "Omg me too :D", "label": 1}
{"text": "Am I famous yet?", "label": 1}
{"text": "I hope so. I’m riding your coattails all the way to the top!", "label": 1}
{"text": "You and me, brother. Together, we RIDE!", "label": 1}
{"text": "Deee-Lite - Groove Is In The Hearth", "label": 1}
{"text": "AI took the handling jobs", "label": 1}
{"text": "Is that you Gimli", "label": 1}
{"text": "Looks like some /r/mallninjashit", "label": 1}
{"text": "how do you \"find\" something in your closet? If you didn't put it there you may have more to worry about then what it is. I'm super curious now. Have you asked people with access to your closet if they were in there?", "label": 1}
{"text": "How can you be sure it's _not_ a Kazakh Finger Stretcher? Ever seen one?", "label": 1}
{"text": "If renting probably belonged to the previous tenants.", "label": 1}
{"text": "Work in a better house... duhhh", "label": 1}
{"text": "Damn that’s 40k in my currency", "label": 1}
{"text": "Secret door. Check for candle holders and book levers", "label": 1}
{"text": "Yup. I found a plastic bedpan on a top shelf in the storage room of one apartment that I rented. ", "label": 1}
{"text": "Bud light ads are getting weird", "label": 1}
{"text": "That's a fun surprise", "label": 1}
{"text": "Immediately came to mind, I’m glad someone else is as unfocused as I am 😂", "label": 1}
{"text": "Hey me too - on the bathroom windowsill, an adult molar (human)", "label": 1}
{"text": "Holy shit a 9gag user", "label": 1}
{"text": "I've bought stuff before (or been gifted), put it away, completely forgot about it, then found it again and gone, \"What is this?\"\n\nIt happens.", "label": 1}
{"text": "Nice Thneed", "label": 1}
{"text": "That sounds gravely unhealthy and unnecessary", "label": 1}
{"text": "Humor ..\n\nThis is Samson's wife after consoling her pet kitty after Samson tried to give it some oral meds.\n\n(Bible reference - Samson fighting the lion)", "label": 1}
{"text": "Popps out when your done.", "label": 1}
{"text": "This is how I always had to move when I lived in New York, too. Everything has to happen on the same day. Whether it's healthy, necessary, or whatever, it happens to a lot of renters in markets defined by scarce supply.", "label": 1}
{"text": "I've done it.\nou see something and buy it, then forget about it or pieces get separated and forgotten.", "label": 1}
{"text": "Thank you for posting with us. However, your submission has been removed because it appears you already know what this is.\n\nIf you want more information about your item (or wish to find one to buy), please try /r/helpmefind.\n\nIf applicable, try searching \"[your thing] owner's manual\" in your favorite search engine.\n\nFor identification or assistance with a specific type of thing, please check the below list of helpful subreddits:\n\n* /r/findfurnitureID - If you are trying to identify a particular piece or style of furniture.\n* /r/findfashion - If you are trying to identify an item of clothing or an element of design on a piece of clothing.\n* /r/cableadvice - If you are trying to identify a cable or adapter.\n* /r/antennasporn - If you are curious about an antenna or aerial you have found.\n* /r/whatisthiscar or /r/namethatcar - If you are trying to identify a car or part of a car.\n* /r/namethatbike - If you are trying to identify a bike or trike.\n* /r/whatisthisplane or /r/namethatplane - If you are trying to identify an aeroplane or other aircraft.\n* /r/whatsthistool or /r/tools - If you are trying to identify a tool or tool like utensil.\n* /r/fasteners - If you want to identify a screw, bolt or other fastener.\n\nIf the above don't fit your needs, please see [this list of helpful subreddits](/r/whatisthisthing/wiki/otherreddits).\n\nOtherwise please try a subreddit specific to your item, /r/findareddit can assist with finding the right place.\n\nBefore posting to other subreddits, please make sure you understand their rules and posting guidelines.\n\nFor future posts here, be sure to read the [submission guidelines](/r/whatisthisthing/wiki/guidelines) and [FAQ](/r/whatisthisthing/wiki/faq).\n\nReplies to this comment, private messages, and chat requests will not be answered, please [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fwhatisthisthing) if you have questions.\n\nThanks.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": "groove is in the hearth!", "label": 1}
{"text": "If you use a laundromat, on rare occasion someone else's item might make it into your laundry. And this looks to me like it has shrunk from being washed and dried.", "label": 1}
{"text": "I once found a pair of denim shorts in my closet that I never did remember buying. \n\nI also found something weird in a closet of my partner's old house. He'd been living there a few years when I moved in & eventually reorganized it. Waaaaaaay in the back, rolled into a tiny scroll was some sort of felt banner with Christian religious symbols. It looked handmade & quite amateurish, probably some kid's Sunday school project. He's an atheist & the former owners were Hindu.", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Just being cheeky.", "label": 1}
{"text": "My daughter said it was Peppa Pig", "label": 1}
{"text": "Oh, well look at Mr I-don't-have-ADD over here. I forget what's in my closet 2 seconds after I close the door.", "label": 1}
{"text": "no way! that’s what they called me in high school", "label": 1}
{"text": "Yeah, not bad.", "label": 1}
{"text": "Oh, hell no. F flippers.", "label": 1}
{"text": "Biggest moon-phase converter I ever saw.", "label": 1}
{"text": "This was my first thought.", "label": 1}
{"text": "Masochists maybe?", "label": 1}
{"text": "It’s a cylindrical AT-AT from Empire Strikes Back.", "label": 1}
{"text": "r/pareiolia wpuld all vote that it's a pig", "label": 1}
{"text": "That’s definitely pepper pig", "label": 1}
{"text": "I love the fact that at some point an industrial designer said \"Yup, looks like a pig. Paint it pink!\"", "label": 1}
{"text": "And his name is Carl!", "label": 1}
{"text": "That is a Hello Kitty/Mecha Tardigrade.", "label": 1}
{"text": "I had to do this in Boston. We ended up with a blender and a Crock-Pot. When we bought this house I found jewelry, a picture of someone's kid and a bunch of other stuff.", "label": 1}
{"text": "My friends mom has one of these in her night stand", "label": 1}
{"text": "Cool motor. I bet someone can get that spinning again.", "label": 1}
{"text": "Wait, is your real name also John Jacob Jingleheimer-Schmidt?", "label": 1}
{"text": "Not the commenter but my name is also James Jackson Junglehammer-Sink.", "label": 1}
{"text": "Big metal pig?", "label": 1}
{"text": "It's a pocket pussy", "label": 1}
{"text": "It’s either an Autobot or a Decepticon, but I wouldn’t risk hanging around to find out which.", "label": 1}
{"text": "Just out of curiosity...\nWho is \"her\" and why are you and your wife pillaging through her private belongings?\n\n\nTo the topic:\n\nSome sort of wrist brace.", "label": 1}
{"text": "Peppa Pig in its ultimate Form!", "label": 1}
{"text": "I never advise ingesting any random food/drug item. You don't know where it's been or what it might have been contaminated with.", "label": 1}
{"text": "He’s a big pig!", "label": 1}
{"text": "Flippers serve a purpose. Bad flippers can go F themselves, but renovating a dilapidated house and putting it back on the market is just an arm of construction. It’s the people that have no business doing construction in the first place that hide problems and door bad quality work that ruins it. Nothing wrong with a quality flip though!", "label": 1}
{"text": "I promise officer, the jacket is not mine. I just got it today.", "label": 1}
{"text": "Makes you think. I bought the jacket a few weeks ago but I only checked the pockets today. How can you even prove you bought the jacket from a random dude? Would an Instagram convo be sufficient evidence?", "label": 1}
{"text": "Survival 101", "label": 1}
{"text": "I have no idea but that won't stop me from guessing they are rain protection for Little People sex workers. But I'm probably 100% wrong.", "label": 1}
{"text": "I'm pretty sure the most important part is possession at the time of the search.", "label": 1}
{"text": "Me too, until I saw your comment 😱", "label": 1}
{"text": "That might not be their intended use, but I'm sure that's what they are used for.", "label": 1}
{"text": "How old is that smint it looks degraded", "label": 1}
{"text": "Lots of minerals.", "label": 1}
{"text": "That's the ugliest repair job I've ever seen.", "label": 1}
{"text": "That's sick. Cool idea, looks like whacky modern art too.", "label": 1}
{"text": "My first thought", "label": 1}
{"text": "That's exactly what it's for.", "label": 1}
{"text": "As someone who owns a row home in Baltimore that was certified CHAP remodel in a historic district I would never be caught living in that monstrosity.", "label": 1}
{"text": "A brace  is mostly used in shooting.\nAs in 2 of anything you managed to shoot.", "label": 1}
{"text": "Please be a time capsule!", "label": 1}
{"text": "Lol, it's just full of radiation", "label": 1}
{"text": "I told my boss to keep it away from me until he gets a Geiger counter", "label": 1}
{"text": "Whatever you do, DO NOT tap the top 3 times and make a wish…", "label": 1}
{"text": "i feel like i’m missing a reference 😭🤣", "label": 1}
{"text": "It’s Ballimer, hun.", "label": 1}
{"text": "Lamps for dogs.", "label": 1}
{"text": "Pocket pussy", "label": 1}
{"text": "Naw there capitalists", "label": 1}
{"text": "Probably factory seconds.", "label": 1}
{"text": "Seats for australiano turists.", "label": 1}
{"text": "That is so F-ed up!  And true!!!", "label": 1}
{"text": "For the stuff that went past the 5 second rule.", "label": 1}
{"text": "Yeah, it's a pain in the ass", "label": 1}
{"text": "Hershey's for politicians", "label": 1}
{"text": "That would be hallow, lol", "label": 1}
{"text": "Whatever it is, it's a neat one", "label": 1}
{"text": "Human trafficking system", "label": 1}
{"text": "Or, maybe, the gooch sweat black market is more profitable than I \noriginally thought.", "label": 1}
{"text": "Yeah, it's a rare find, and might be worth something to someone.  I'd sell it to the highest bidder.", "label": 1}
{"text": "As with the majority of tape used in production it lets the operator know to change the roll as it's about to run out.", "label": 1}
{"text": "I thought you were talking about the candy and subsequently having a stroke", "label": 1}
{"text": "Hallowed ground box.", "label": 1}
{"text": "Seems too pretty and not heavy enough for a lead lining.\n\nBut still, getting out the Geiger counter seems like a really good precaution to take.", "label": 1}
{"text": "Of course we do!  geesch; get with the program.  lol", "label": 1}
{"text": "I’m almost sure it’s pantyhose", "label": 1}
{"text": "yeah i looked at the picture and was like that's definitely a bike stand therefore the only thing the cover would be for would be to protect the seat.", "label": 1}
{"text": "Bears, beets, battle star gallactica", "label": 1}
{"text": "It being Hershey's would be enough for me to toss it, regardless of its wrapping.", "label": 1}
{"text": "I'll give you my mounds bar for it", "label": 1}
{"text": "Blame it on the al al alcohol.", "label": 1}
{"text": "Really wanna know what's inside.", "label": 1}
{"text": "If I had to guess it’s bc this particular sell is seemingly “new in box” and almost mint condition.  But I’m not expert here.", "label": 1}
{"text": "Because sellers on eBay can set any price. Look for sold or completed listings to see what things are worth.", "label": 1}
{"text": "I lurk here all the time, waiting for my chance to shine. Today was yours,  well done. Thanks for contributing with your experience, I hope I get much chance someday!", "label": 1}
{"text": "Would fishnets pantyhose work? \nSorry I couldn’t help myself…", "label": 1}
{"text": "Collector’s  item !!!! \n\nSave it for 100 years and it’ll be worth like 6 bucks", "label": 1}
{"text": "Ah the old Ohio sausage trick...", "label": 1}
{"text": "Social club? He’s gotta go!", "label": 1}
{"text": "I preferred Soda Ball Z.", "label": 1}
{"text": "It appears to be from space.", "label": 1}
{"text": "It's so you can have a nice cold bowl of Pepsi.", "label": 1}
{"text": "For trash bikes?", "label": 1}
{"text": "Fake a lake", "label": 1}
{"text": "For a bit  couldn't tell if y'all were talking about a real game or if I was in a sub like r/explainlikeimcalvin.\n\nSkittles seems fun!", "label": 1}
{"text": "They had one job to do…", "label": 1}
{"text": "There are also some specific ass jobs out there, but I think that industry is a little more niche.", "label": 1}
{"text": "Reach out to Sarco, they should have any parts you may need.", "label": 1}
{"text": "So much going on in the third photo… but I’m curious myself what you get when you break the center", "label": 1}
{"text": "They all stink, anyways.", "label": 1}
{"text": "It’s a novelty cookie jar.", "label": 1}
{"text": "A Geiger counter wouldn’t do any good if it was lead-lined anyway.", "label": 1}
{"text": "I know right?!", "label": 1}
{"text": "Depends what you’re cycling past I guess.", "label": 1}
{"text": "This guy sherlocks", "label": 1}
{"text": "That is an Enfield 303. I used to have one.", "label": 1}
{"text": "It’s a nice object !", "label": 1}
{"text": "If its thick enough that is 😁", "label": 1}
{"text": "Rifle, Short Magazine Lee Enfield, model No1 Mk3* to give it its full name.  The SMLE was the British and Commonwealth rifle of WW1.  However the No1 Mk3* was a modified version that was produced in peacetime in the 1920s up to WW2.  They’re usually a good rifle.  The trigger on the Mk4 is often a bit rough.  The Mk1 is much sought after, easily identified by the volley sights and magazine cut-off.  \n\nThis one has been sporterised, which happened to a lot of them.  I had a Parker-Hale sporter for years that shot like a dream.  Definitely minute-of-deer capable, and the .303 is a great round for medium sized game.  \n\n.303br round has been around for a long time, since 1889.  The tapered case and rim make it incredibly reliable, even when hot or dirty.  It’s very easy to hand load if you can’t find ammunition.", "label": 1}
{"text": "Yes.", "label": 1}
{"text": "Secretly, two men twice a year, turn the gear which tilts the earth between winter and summer.", "label": 1}
{"text": "I don't know what's going on with the moderation in /r/Edinburgh but I'd look into it.", "label": 1}
{"text": "My brother has an all original mark 3 complete with the gigantic 1907 pattern bayonet. I am still in awe every time I see the thing lol", "label": 1}
{"text": "But… why?", "label": 1}
{"text": "I'll do a King Size Snickers— the world's favorite candy bar. heh", "label": 1}
{"text": "So why were they made with the additional wood, if it was never actually needed? Sorry clueless about guns, just interested.", "label": 1}
{"text": "A loophole? Religion can make people silly.\nThanks for the explanation.", "label": 1}
{"text": "Hopefully someone with more knowledge than me gives you a definitive answer but I’d imagine that in battle protecting the barrel to some extent was important but also that having weight toward the muzzle would reduce recoil.", "label": 1}
{"text": "As others have said, a sporterised SMLE (short magazine lee enfield) No. mkIII missing its distinctive magazine. A large number of commonwealth countries used (and manufactured) this rifle beyond the Lee Enfield factory. Even a few US factories made these. Given the korean war, and that the UK and Canada has already largely moved over to the No.4 mk1 (though the No.1 Mk III was still in use to some extent), my guess would be this is likely an Australian or New Zealand rifle. If this is the case it should have a Lithgow Arms makers mark under the bolt handle. If not it might be a Belgian, Dutch or Luxembourg rifle as they also served in Korea, and got a bunch of these post WW2 from the UK.", "label": 1}
{"text": "Steampunk mushroom.", "label": 1}
{"text": "It prob isn't. But i thought it looked like a ravioli decoration and thought. Hell yeah thats ridiculous but yee. Apparently i was wrong though.", "label": 1}
{"text": "It can also act as a heat guard to protect your hand from a hot barrel.  British soldiers were trained in the \"mad minute\", basically just firing as fast as possible.  Interestingly the rifle magazine held 10 rounds, compared to a standard 5 of other nations.", "label": 1}
{"text": "Wow this is cool.", "label": 1}
{"text": "House with tbar/ceiling tiles and a \"shop\"?  Think you bought an office.", "label": 1}
{"text": "You got a treasure there", "label": 1}
{"text": "Movie projection screen for block parties", "label": 1}
{"text": "That is not a filthy one it's a super cute one, like wtf? Where can I find stuff like that?", "label": 1}
{"text": "https://enfield-stuff.com/Pages/2-codes_marks/2-1_codes_marks_govt.html  \nYou didn't include the good stuff (stamps) so we could tell you where it was made, who used it etc.", "label": 1}
{"text": "In this case it is, littlerally, a looppole.", "label": 1}
{"text": "Nicely done", "label": 1}
{"text": "Fine... Here's my up vote. 😝", "label": 1}
{"text": "I think this persons brain was broken long before seeing this image", "label": 1}
{"text": "Thank you for posting with us. \n\nIf what you've found is a little box attached to a door frame (with a scroll inside), it's a mezuzah.\nhttps://www.reddit.com/r/WITT_FAT/comments/8evidy/mezuzah/\n\nIf those look similar, please mark this as solved by replying to this comment with **Solved!**.\n\nIf that's not it, and you've received no other messages from me indicating otherwise, your post is still active and you can ignore this comment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": "Some bike seat sniffer installed them and lives in that building.", "label": 1}
{"text": "My thoughts exactly", "label": 1}
{"text": "It Really ties the table together, does it not?", "label": 1}
{"text": "That's just like,your opinion,man! ( uttered with love to a fellow Dude)", "label": 1}
{"text": "....and me without my glasses on thought someone had chucked a pie 🥧 crust on a ceiling 🙄 #oldgit", "label": 1}
{"text": "Obviously not made to be cleaned.", "label": 1}
{"text": "Petrified coffee filter. Location used to be a cafe.", "label": 1}
{"text": "Why say something rude about someone you don’t know because you don’t like their comment?  It says more about you ….remember that.", "label": 1}
{"text": "you would be surprised what I have found hanging on these things.\n\nto add to all of that there are several different versions of this type of ceiling. some even looking similar but with widely different amount of strength.\n\nand going by all of this, what I described up there did happen to me. how all of that stuff held up, idk. Just happy it never fell on my head while being there to disassemble.", "label": 1}
{"text": "Just put it in the bin. Unmarked ziplock, gifted, why bother.", "label": 1}
{"text": "Nano-razorblades", "label": 1}
{"text": "I can’t understand why this is being downvoted", "label": 1}
{"text": "Count the green flags: There's zero instances of children ever being given poison or hazardous materials, ever. (There's a couple instances, but they were found to be the parent or someone close trying to get a settlement or attention)", "label": 1}
{"text": "Toss it. Buy your own", "label": 1}
{"text": "“I’m going to throw away a fun toy for my child. Pumping them full of processed sugar is more important!!”", "label": 1}
{"text": "Ironing board for little people.", "label": 1}
{"text": "Ironing board for midget.", "label": 1}
{"text": "Looks like basic C4", "label": 1}
{"text": "Or do throw it away, but like literally, throw it.", "label": 1}
{"text": "Or do throw it away, if you wish. You can't be entirely sure it's safe in the end. SO many choices, OP!", "label": 1}
{"text": "Or, throw it away! You really want to be offered clay-cookies? Because that will inevitably happen if you give children clay, and they taste nothing like real cookies trust me", "label": 1}
{"text": "Looks to be about 50g of Composite C-4 to me.", "label": 1}
{"text": "Same, except the odd jekyll and Hyde episode of scooby doo", "label": 1}
{"text": "Ah the olde re-gift", "label": 1}
{"text": "Or toss it away", "label": 1}
{"text": "Right. Our house has a built in ironing board (don’t know if it works)", "label": 1}
{"text": "Knull is coming.", "label": 1}
{"text": "Homophobic sand", "label": 1}
{"text": "said no one ever.", "label": 1}
{"text": "New Year's is right around the corner! Send 2024 out with a bang!", "label": 1}
{"text": "If you don’t know what it is, just throw it out.", "label": 1}
{"text": "Dont take chances.....Toss it", "label": 1}
{"text": "I prefer the term. *Serious Putty*", "label": 1}
{"text": "I just did", "label": 1}
{"text": "Thank god... \n\nNever knew my real ladder", "label": 1}
{"text": "You mean edging. ", "label": 1}
{"text": "What's in the box??", "label": 1}
{"text": "Perhaps we'll only know if we wear our LongLegs.", "label": 1}
{"text": "I'm going with an inside joke involving scalping a minecraft character.", "label": 1}
{"text": "Garbage fuel. Toss it and never look back.", "label": 1}
{"text": "Box of hair.  As in, “she’s dumber than a box of hair”……?????", "label": 1}
{"text": "Paegan Terrorism Tactics is an album lmao", "label": 1}
{"text": "That’s the kink!\n\nSeriously though, Al Capony! 😂", "label": 1}
{"text": "No kidding I've learned that lesson", "label": 1}
{"text": "I can't believe you touched it.", "label": 1}
{"text": "Definitely some creepy black magic satanic shit.", "label": 1}
{"text": "\"Do not, Do not, open that\"", "label": 1}
{"text": "The children *yearn* for the mines.", "label": 1}
{"text": "This guy smokes toenails.", "label": 1}
{"text": "If I could find that Heina, And that Sancho that she’s found… Well, I’d pop a cap in Sancho and I’d SLAP HER  DOOOOWWNNHHUHhuhhhhumm", "label": 1}
{"text": "Do NOT read any inscriptions on it out loud!", "label": 1}
{"text": "That's where all the crunchy bits are stored!", "label": 1}
{"text": "Kanda barratu nict-uh- what", "label": 1}
{"text": "oh, you sweet young things-it's an ironing board!- this was in the dark ages before perma press.", "label": 1}
{"text": "You found it! \nIt’s my dreidel. I made it out of clay! 🎶", "label": 1}
{"text": "Shits haunted bro.", "label": 1}
{"text": "What I really wanna know.  Ah, baby, mhmm\nWhat I really wanna say, I can't define. Well, it's love. That I need, oh", "label": 1}
{"text": "If only they could make real money while playing that game we'd all be rich $", "label": 1}
{"text": "horse girls are weird as hell", "label": 1}
{"text": "Na, go ahead and crack it open. When you find a bunch of random Latin words inside, definitely read them out loud for no reason", "label": 1}
{"text": "Maybe play around with the hair while you’re doing it. Light a little bit of it on fire.", "label": 1}
{"text": "This is so marvelously fucked up.", "label": 1}
{"text": "That water heater has a woody", "label": 1}
{"text": "I trust this username", "label": 1}
{"text": "☺ I needed to hear something light-hearted. I'm suffering from anxiety over this dawned election.", "label": 1}
{"text": "The removed post was long and very AI-like, and thought it was a candle holder or oil lamp (I think), without explaining how they could fit the details in the photos. The later door bell answer is much more plausible, and with the ebay link, it's even more convincing.", "label": 1}
{"text": "Definitions from Oxford Languages · Learn more\nnoun\nnoun: pagan; plural noun: pagans\n(especially in historical contexts) a person holding religious beliefs other than those of the main or recognized religions.\n\"the incoming Germanic peoples were pagans\"\n\nBut people will downvote because reddit doesn't always care about facts.", "label": 1}
{"text": "Omg if you find out please tell us wjat ot is", "label": 1}
{"text": "Upvoted, because that's the definition.", "label": 1}
{"text": "98% certain this is related to a tormented eternal soul.", "label": 1}
{"text": "Is there an actual answer for this?", "label": 1}
{"text": "I keep looking for the aisle at Home Depot with \"cold water heaters\"...", "label": 1}
{"text": " Put it in a Lowe’s bucket and pour concrete over it then dump in a river. I’ve seen this movie before. Ha ha ha.", "label": 1}
{"text": "The \"CURSE\" only goes into effect if it's moved from where it was placed", "label": 1}
{"text": " GET OUT OF THAT HOUSE IMMEDIATELY!", "label": 1}
{"text": "A really big hamper lol", "label": 1}
{"text": "Is your new house in Amytyville?  Or do people refer to it as the “old Gein residence?”", "label": 1}
{"text": "It’s used by Kalahari bushmen to boil ostrich eggs.", "label": 1}
{"text": "A very stable answer. Tbh I was a bit hooved up about it at first.", "label": 1}
{"text": "Did Jeffrey Dahmer live there previously?", "label": 1}
{"text": "Thats an IUD from Lego", "label": 1}
{"text": "This is some Ren and Stimpy level shit", "label": 1}
{"text": "It's a motion activated light for your toilet bowl.", "label": 1}
{"text": "That's the Necronomicon. Paperback edition.", "label": 1}
{"text": "Almost spit out my drink laughing at the first bit before I realized you were serious", "label": 1}
{"text": "They've got about 12hrs until the curse kicks in", "label": 1}
{"text": "Voo Doo. Voo Doo. Voo Doo. Voo Dooooooo", "label": 1}
{"text": "If you open that a camera team will arrive to film the next horror movie at your house...", "label": 1}
{"text": "I know what this is! It's r/oddlyterrifying !!", "label": 1}
{"text": "You're not real, man.", "label": 1}
{"text": "Is that fucking hair?\n\nWtf", "label": 1}
{"text": "Should've knowny.", "label": 1}
{"text": "Looks like they scalped Frankenstein", "label": 1}
{"text": "I don’t practice Santeria, I ain’t got no crystal ball……", "label": 1}
{"text": "Bet you were glad you touched it! 😂", "label": 1}
{"text": "Voodoo. Use fire.", "label": 1}
{"text": "Well I guess now I have to join the sub.", "label": 1}
{"text": "Making note to never ask anyone for creative doorstop ideas...", "label": 1}
{"text": "Lexus something", "label": 1}
{"text": "Put it back", "label": 1}
{"text": "Disco potty", "label": 1}
{"text": "Well, I had a million dollars\nBut I, I’d spend it all", "label": 1}
{"text": "Leave and burn the house down", "label": 1}
{"text": "Don’t listen to the naysayers", "label": 1}
{"text": "It's the Uzumaki Rasenjin.", "label": 1}
{"text": "sometimes a basket is just a basket.", "label": 1}
{"text": "This is the kind of thing I don’t want to know.", "label": 1}
{"text": "What is this thing? Evidence.", "label": 1}
{"text": "That ... that is a victim.  It had parents.", "label": 1}
{"text": "is it cake?", "label": 1}
{"text": "That Capt James T Kirk's log book from the Star ⭐ ship Enterprise", "label": 1}
{"text": "I don’t like it.", "label": 1}
{"text": "Birthday cake", "label": 1}
{"text": "If I could find that heina", "label": 1}
{"text": "It works. Any board can be an ironing board if you try hard enough.", "label": 1}
{"text": "I’m still chomping at the bit for an answer.", "label": 1}
{"text": "Did you try describing it or do a reverse image search?", "label": 1}
{"text": "If op doesn't come clean, this will leave me with night mares.", "label": 1}
{"text": "I'd pop a cap in Sancho, and I'd slap her down", "label": 1}
{"text": "It’s a birthday weave", "label": 1}
{"text": "Put. It. Back.", "label": 1}
{"text": "I think it’s baloney", "label": 1}
{"text": "Let the hauntings... Begin!", "label": 1}
{"text": "It’s coming back agaiiiiin. \n\nBuh dadulum, buh dudulum duh", "label": 1}
{"text": "This is how horror movies start,DONT TRY ND OPEN IT!", "label": 1}
{"text": "I’d put it back, looks like some sort of spiritual sacrifice or voodoo.. but congratulations. This is the beginning of a horror movie for you.", "label": 1}
{"text": "Looks up the TikTok lady that yells PUT IT BACK!! I feel like she’s needed here.", "label": 1}
{"text": "They're eating the dogs and cats", "label": 1}
{"text": "The Cake is a Lie", "label": 1}
{"text": "Put it back", "label": 1}
{"text": "Yep, that is definitely a „burn it“ item", "label": 1}
{"text": "Hair candle. They smell great when burned", "label": 1}
{"text": "Someone’s art project of a Plurbis", "label": 1}
{"text": "Bojack Horseman rides on", "label": 1}
{"text": "What i really wanna know", "label": 1}
{"text": "And the grey smaller one is for cleaning backing trays in the dishwasher. Seems to be from a Bosch or Siemens appliance.", "label": 1}
{"text": "I'd tell my wife to open it cause I sure wouldn't!", "label": 1}
{"text": "I'm not the one who's so far away\nWhen I feel the snakebite enter my veins", "label": 1}
{"text": "Solved!", "label": 1}
{"text": "Scammell is a very unfortunate name for an auction house.", "label": 1}
{"text": "What, you've never seen a Naruto Nipple before?  Classic playground equipment.", "label": 1}
{"text": "Thank you Sigmund Freud. ;-)", "label": 1}
{"text": "When I worked for Lowes as a \"plumbing specialist\" (aka anyone why worked in plumbing), I realized it was time to find another job when people would call on the phone and ask for a \"hot\" water heater and my response was we don't carry \"hot\" water heaters. The scary part of this was not a single person called me out on it! I quit after about 2 months!", "label": 1}
{"text": "You must be a lot of fun at parties\n\nIt's a heater for making hot water, a \"hot\" water heater. \n\nThey know what they mean, you know what they mean, everyone knows what they mean. Do you drop people as friends who say ATM machine?", "label": 1}
{"text": "It's a candy basket Ned, ninety dollars!", "label": 1}
{"text": "Freud couldn’t have said it better", "label": 1}
{"text": "I see a statue of a woman with two hands on the ground, face uplifted towards the sun, with oddly long legs as she is on all fours\n\nOr maybe a lion\n\nMaybe a sexy lion costumed woman", "label": 1}
{"text": "ROFL. I love this one thank you. Bit the same as a turn signal on a Audi or BMW.", "label": 1}
{"text": "Are you on mars?", "label": 1}
{"text": "Mars has much cooler stuff than that.", "label": 1}
{"text": "For the admirals tipple.", "label": 1}
{"text": "Important to include the garment or valet in the search term", "label": 1}
{"text": "Hah. Took me a minute.", "label": 1}
{"text": "Or……starboard and port?", "label": 1}
{"text": "Nah. The interior would need to be green and red!", "label": 1}
{"text": "All the keys were lost though?", "label": 1}
{"text": "Pricing for the ball sack", "label": 1}
{"text": "Haha. That’s garbage without a name.", "label": 1}
{"text": "r/mildlyvagina", "label": 1}
{"text": "Reddit is a global community. Where is \"Ky\"?", "label": 1}
{"text": "Kentucky, USA (probably)", "label": 1}
{"text": "I’m curious what type of heater this could be and why it would be emitting heat even though it is turned off. It seems pretty old (house was built in the 1950s) and we have a desk above it. Is it somehow connected to the baseboard heaters in the rest of the house? Thanks for your help. ", "label": 1}
{"text": "I was going to buy this bookshelf but then I realized it was empty so it must have been badly designed if all the books had fallen out and been lost", "label": 1}
{"text": "Looks like the claw of a velociraptor", "label": 1}
{"text": "On the lubricants aisle.", "label": 1}
{"text": "Back then, many tools doubled as weapons … great find!", "label": 1}
{"text": "USA is correct, thank you and apologies", "label": 1}
{"text": "Thank you", "label": 1}
{"text": "Just cause I was curious. \n\n48.33% American \n7.33% UK\n6.97% Canadian\nEtc. decreasing as they go.", "label": 1}
{"text": "Nyuck nyuck nyuck", "label": 1}
{"text": "It was used to open giant cans", "label": 1}
{"text": "reaper for cutting wheat, I think. or possibly felling trees.", "label": 1}
{"text": "We don't have millimeters in ky", "label": 1}
{"text": "If your books fall out, you only have yourshelf to blame.", "label": 1}
{"text": "Clothes pin for drying your Trojans before re-use,", "label": 1}
{"text": "Leave!\n\n\nUpvote", "label": 1}
{"text": "You have no 9mm, 7mm or 10mm ammunition?", "label": 1}
{"text": "https://instantrimshot.com/audio/rimshot.mp3", "label": 1}
{"text": "Key chain or a Hood ring for some big lips. Lol", "label": 1}
{"text": "That's a spanking.", "label": 1}
{"text": "Wtf does ky mean.", "label": 1}
{"text": "Fucking bastard!", "label": 1}
{"text": "This might be a hall of famer!", "label": 1}
{"text": "Mnnnnhmmmnnn", "label": 1}
{"text": "You do. You just choose to complicated them.", "label": 1}
{"text": "That’s how you know OP is a bot", "label": 1}
{"text": "I like mustard in my sausage biscuits mmmmmmmhhhhhhhmmmm", "label": 1}
{"text": "I’ve been to enough adult store to know what those are lol.", "label": 1}
{"text": "Razor claw, use it to evolve Sneasle", "label": 1}
{"text": "I like dem French fried p-taters, mmmhhhmmm.", "label": 1}
{"text": "It's an oxen shoe", "label": 1}
{"text": "looks kinky", "label": 1}
{"text": "Had one of these stuck in my car door", "label": 1}
{"text": "Welcome to reddit Sean Connerys ghost", "label": 1}
{"text": "Goes well with them french fried pertaters.", "label": 1}
{"text": "You sound like geralt", "label": 1}
{"text": "You had no reason not to publish my post. Your subreddit is fucking dumb. Fuck you idiots.", "label": 1}
{"text": "But why is all the rum gone?", "label": 1}
{"text": "Oh!! This is that thing from Tibet! It makes boulders levitate! Egyptians built their pyramids with it!", "label": 1}
{"text": "What’s a ky?", "label": 1}
{"text": "Toillet Paper holder i am certain...", "label": 1}
{"text": "Some sort of cylinder?", "label": 1}
{"text": "One of my cats claws!", "label": 1}
{"text": "Not the cylinder again 😭", "label": 1}
{"text": "That my friend is fuzzimusmageoueslintonomous(aka FUZZ/LINT)", "label": 1}
{"text": "with mustard, hmmmm", "label": 1}
{"text": "Extra kinky", "label": 1}
{"text": "There's a subreddit which tells you not to do that", "label": 1}
{"text": "It was a cylinder!", "label": 1}
{"text": "Looks like the neck rest for a guillotine", "label": 1}
{"text": "You said babbitt, I saw Bobbit and thought “it’s a Bobbit guillotine”!", "label": 1}
{"text": "Did you buy the house off the blue man group?", "label": 1}
{"text": "I know what I’d use it for 👀", "label": 1}
{"text": "What kinda fuckin' skinny-ass pencil necks would fit in this?", "label": 1}
{"text": "Gen X drink nozzle", "label": 1}
{"text": "Yeh I was thinking the same.", "label": 1}
{"text": "Thank you for posting with us. \n\nIf what you're asking about is a pole with a barrel shaped antenna on it, this is probably related to the 5G build out as part of the cellular network. \n\nhttps://www.reddit.com/r/WITT_FAT/comments/17oevu5/that_pole_you_saw_with_a_barrel_shaped_thing_on/\n\nIf those look similar, please mark this as solved by replying to this comment with **Solved!**.\n\nIf that's not it, and you've received no other messages from me indicating otherwise, your post is still active and you can ignore this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": "For farm Birds. Chickens, ducks, ect..", "label": 1}
{"text": "Put it back in the stone if you don't want to accept being king of England", "label": 1}
{"text": "Looks like some junk.", "label": 1}
{"text": "But there's no law saying you can't play with it like a sword", "label": 1}
{"text": "That is my guess too", "label": 1}
{"text": "my first instinct when someone say they found something \"fiberglass like from the 60s\" is its asbestos. \n\nthe shits was in everything. its a shame it kills you cause the stuff is amazing.", "label": 1}
{"text": "I love this sub.", "label": 1}
{"text": "dude what are you doin scrounging around an old base. you crazy", "label": 1}
{"text": "Every substance that is great at doing many things always ends up to cause Super Cancer. See: carbon tet, arsenic, lead, MEK, asbestos, etc", "label": 1}
{"text": "Can you not make chaff out of asbestos?", "label": 1}
{"text": "[https://media3.giphy.com/media/l0HlRuiaKgiJGfd3a/giphy.gif?cid=9b38fe91dtrt77l0cp0b57wr9m4tx43zpx3npzt5kxsdta8m&ep=v1_gifs_search&rid=giphy.gif&ct=g](https://media3.giphy.com/media/l0HlRuiaKgiJGfd3a/giphy.gif?cid=9b38fe91dtrt77l0cp0b57wr9m4tx43zpx3npzt5kxsdta8m&ep=v1_gifs_search&rid=giphy.gif&ct=g)", "label": 1}
{"text": "We are doing asbestos we can to get it out of our lives.", "label": 1}
{"text": "Ba-dump-tssss!", "label": 1}
{"text": "It is for holding artificial flowers.", "label": 1}
{"text": "Flower frog", "label": 1}
{"text": "As-best-ossss!", "label": 1}
{"text": "Try burning a few strands. Cordite was used mostly as a propellant, it burns fiercely: you'd need a detonator to cause it to explode.", "label": 1}
{"text": "No.  Steel is not flammable.  Small strands is irrevelant.  As a machinist, I can assure you steel is not flammable.\n\nYou may be thinking of Magnesium which is very flammable Especially if it is in \" small strands\" as you say.", "label": 1}
{"text": "So why does steel wool burn away Mr. Machinist?", "label": 1}
{"text": "https://youtu.be/xsK-I6cuWbI", "label": 1}
{"text": "Go touch a 9V battery to a bundle of steel wool and report back to us.", "label": 1}
{"text": "People are so fucking stupid man", "label": 1}
{"text": "You can burn steel wool. Take 0000 steel wool and touch a 9v battery to it, it will catch fire. I would bet you both of my kidneys. \n\nSteel isn't \"Flammable\" by itself in most cases. But thin strands create an extremely quick \"short\" across the strands and catch fire. It's essentially a quick start for an extremely rapid oxidation reaction. \n\nIt's precisely why steel wool and 9v batteries are my back up fire starting materials in my hurricane supplies.\n\nI've never heard a machinist be so confidently wrong about something they should 100% be aware of.", "label": 1}
{"text": "I say, you’ve chanced across a stash of ‘window’ there old chap.", "label": 1}
{"text": "My gf would think otherwise. Sick freak", "label": 1}
{"text": "Pro tip: don't light substances you suspect might be explosives on fire.  Cordite won't explode, but other kinds of explosives will.", "label": 1}
{"text": "Buzzkill. What I'm *not* hearing is that I can't do it.", "label": 1}
{"text": "Which ones? \n\nDeflagration is not the same as detonation. A few strands won't be dangerous.", "label": 1}
{"text": "Be careful! Looks like part of the box thing from HellRaiser.", "label": 1}
{"text": "Background: I still have all of my fingers.", "label": 1}
{"text": "Blood letting tool", "label": 1}
{"text": "Why does it weigh more after it burns Mr. Machinist?", "label": 1}
{"text": "By 'pro-tip', you mean you have no idea what you're talking about.", "label": 1}
{"text": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fimages.squarespace-cdn.com%2Fcontent%2Fv1%2F54694fa6e4b0eaec4530f99d%2F1594316924427-CKVQIOCYMZBB9OVRJ1GB%2FBras%2Bscarification%2Bpicture.jpg&tbnid=P3xjAHO9hKOqYM&vet=1&imgrefurl=https%3A%2F%2Fwww.talmudology.com%2Fjeremybrownmdgmailcom%2F2015%2F3%2F23%2Fketuvot-52-blood-letting-zyp2e&docid=JiiemlIVvN1XeM&w=1465&h=1350&source=sh%2Fx%2Fim%2Fm4%2F2&kgs=ac053f30c3eef902&shem=abme%2Ctrie", "label": 1}
{"text": "Asbestos? If it’s BLUE, back away briskly", "label": 1}
{"text": "That stochastic texture has me scrambling for Substance Designer. Very cool. I wonder what they used in the cast to do that.", "label": 1}
{"text": "You have to wonder what a neet is and why they have such oily feet.", "label": 1}
{"text": "It sure chaffes the shit out of your lungs", "label": 1}
{"text": "\"Wanna know how I got these scars??\"", "label": 1}
{"text": "Ha...Clean. Who needs clean?", "label": 1}
{"text": "Back shaver!", "label": 1}
{"text": "That is so cool!", "label": 1}
{"text": "how did you find out? and how many showers are you taking now?", "label": 1}
{"text": "Herman MO? It's for stomping grapes!", "label": 1}
{"text": "That's right, it goes in the square hole", "label": 1}
{"text": "My mind says it's a still", "label": 1}
{"text": "Kalamata specifically.", "label": 1}
{"text": "For Popeye and Olive?", "label": 1}
{"text": "Part of a guillotine for geese.", "label": 1}
{"text": "Looks like a fossilized… olive.", "label": 1}
{"text": "I love how they commented this 3 hours *after* someone already posted the actual solution with an example picture of an identical fence. Even better, they think it's more likely that OP just happens to have what's *obviously* an ancient sword laying on the ground next to his house over a broken piece of fencing.", "label": 1}
{"text": "Petrified olive", "label": 1}
{"text": "Thank you for posting with us. \n\nIf what you're asking about is a pole with a barrel shaped antenna on it, this is probably related to the 5G build out as part of the cellular network. \n\nhttps://www.reddit.com/r/WITT_FAT/comments/17oevu5/that_pole_you_saw_with_a_barrel_shaped_thing_on/\n\nIf those look similar, please mark this as solved by replying to this comment with **Solved!**.\n\nIf that's not it, and you've received no other messages from me indicating otherwise, your post is still active and you can ignore this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*", "label": 1}
{"text": "> # one suck a ride\n\nhttps://i.imgur.com/avN6jHJ.png", "label": 1}
{"text": "thought this was an olive at first", "label": 1}
{"text": "Unrelated, but I love your u/ and pfp!", "label": 1}
{"text": "Always has been", "label": 1}
{"text": "No didn’t you hear? They don’t have those there.", "label": 1}
{"text": "“How did this plant bead end up on my plant?”", "label": 1}
{"text": "They cease to exist when you cross international borders.", "label": 1}
{"text": "Cracked orb tear, has a chance of revealing the Ultra Secret Room on the map, but other than that, no other mapping items — over all pretty useful item.", "label": 1}
{"text": "Don't know why you're being downvoted and everyone being so sure of themselves. \n\nI've NEVER seen them in the UK in 40 years. Not saying they aren't sold in some places here, but I've never seen them. \n\nSo your comment \"This toy is not common around here\" is probably factual where you live.", "label": 1}
{"text": "Early iphone.", "label": 1}
{"text": "Damnit I thought I was gonna finally get one!", "label": 1}
{"text": "I've heard something similar: I don't pay them for sex, I pay them to leave after.", "label": 1}
{"text": "Haha me too! I immediately thought \"sharps container\" when I saw it", "label": 1}
{"text": "Sorry to interrupt , I just want the hundred dollar bill sitting on the table", "label": 1}
{"text": "Came here to make this exact joke and can’t believe it was literally the first comment I looked at lmao", "label": 1}
{"text": "More than anything I think you need to have a discussion with your wife as to why she insists you are not allowed to utilize her two very specific holes.... syntax matters.  Lol", "label": 1}
{"text": "\"The whole city is my sharps container\"", "label": 1}
{"text": "Even more amazing is that they made more than just the one in the OP's picture.  They've probably made at least 10 of them.  Perhaps Google Maps can help you find the closest one?  There might even be one in your state or close by in East Virginia.", "label": 1}
{"text": "Google lens tells me", "label": 1}
{"text": "My guess too", "label": 1}
{"text": "It doesn't matter, we all have hepatitis now anyway. Good news is, if you walk around long enough, you'll eventually step on the vaccine", "label": 1}
{"text": "East Virginia? The Hermit Kingdom? Good luck. They are mostly focused on developing inter-county-nental ballistic missiles and training raccoons to steal lottery tickets.", "label": 1}
{"text": "Thank you! It’s making me mad I never heard of this game until this post! I started playing pool at like 10 years old and also played that old bowling arcade game with the disc when I was a kid too (at a bar next to my grandmas house). This pool game brought back so many memories of that!", "label": 1}
{"text": "Grew up in Portland Oregon, as a kid, I noticed people who smoked used the world as their ashtray. Now it seems iv drug users have filled that niche. For cred, we have a sharps container in the house. I am a responsible user.", "label": 1}
{"text": "Hell yeah, someone threw a Bullard at my face in church camp playing these.", "label": 1}
{"text": "Haha Ebay-ers must get really excited when their stuff suddenly gets several thousand views...", "label": 1}
{"text": "Looks like a metal plate... On your ceiling.", "label": 1}
