{"text": "They weren't thinking about that because they didn't care about that, they got their marching orders from corporate interests who wanted more cheap easily exploitable labor from countries with low workplace standards and even lower expectations.", "label": 0}
{"text": "The US spends a lot on the military and is undoubtedly way more advanced than any other military as you pointed out. I wouldn't label that as a problem as long as you believe in Western ideals though. Pax Americana is impossible without that military advantage. It's the whole premise of \"peace through strength.\"\n\nA few stoic quotes come to mind: \"You cannot be peaceful unless you're capable of great violence\" and  \"It is better to be a warrior in a garden than a gardener in a war\"", "label": 0}
{"text": "Claiming that the tripling of the intake under Trudeau is somehow Harpers fault is certainly a thing.", "label": 0}
{"text": "The dick pics drawn with craters on IDF airfields probably has at least something to do with it.", "label": 0}
{"text": "He said he wanted nazi generals just yesterday.", "label": 0}
{"text": "we don't have \"too many people\" in the west. I genuinely don't understand why you people can't understand that", "label": 0}
{"text": "Depends. \n\nTechnically the Constitution say Congress can declare war, but they haven't done that since WWII. All others have been authorized military force by Congress. \n\nBut some will and have argued that Congress authorizing the use of military force to invade another country, is enough to be considered a declaration of war.\n\nMe personally, I don't see how you can send hundreds of thousands of troops to invade a country on the other side of the world, completely destroy their military, bombing every base they have, killing enemy combatant, dismantle their government, then occupy this country for two decades while you try to form a government of your making/will, and not be at war with this country/people. \n\nThere was a court case on this Doe V Bush which basically says that the AUMF against Iraq was Congress authorizing a war. \n\nYou can't do everything but use the actual word \"war\". Congress passed a law that both authorizes and legally compels a President to initiate military action against a sovereign nation, that is war. \n\nWe had multiple Presidents across multiple Congress's, with all of them calling them a War. \n\nThey all for the most part referenced it as a War, they even said the 2001 AUMF was consistent with the \"War Powers Resolution\".", "label": 0}
{"text": "Do we know what notable companies are still advertising there?", "label": 0}
{"text": "that commenter is regarded. Indians don’t speak russian, we speak English.", "label": 0}
{"text": "Western intelligence agencies should unleash covert ops on Russia and just credit Ukrainian special forces.", "label": 0}
{"text": "I love Pierre!!!", "label": 0}
{"text": "They didn't need to create some propaganda for justification. Having jets where you think in American and it just does stuff is awesome, and that's all the justification I need.", "label": 0}
{"text": "Because we all know the bulk were in high skill professions and certainly not working as near slaves for big box stores.", "label": 0}
{"text": "I don't get why that's wrong (or racist). Their culture is quite different from Anglo-Canadians.", "label": 0}
{"text": "RuZZia sucks at gaining air superiority. They simply cannot take out Ukraine's air defenses. That's why their aviation is limited to dropping stand-off munitions from many kilometers away from the front lines.", "label": 0}
{"text": "Well ain't that a bitch.", "label": 0}
{"text": "Really?  Are you talking about the 3 wheeled bike ones that has one dude cooking dogs or a trailer with 3+ staff, because 300k is a lot of dogs", "label": 0}
{"text": "I work at a 200 person company that had a profit of $60k last year.\n\nWe can't all be winners.", "label": 0}
{"text": "A character based on Elon Musk manipulated his company's valuation by inflating his subscriber numbers in India. It became a secondary plot point.", "label": 0}
{"text": "> this is entirely on Canadians voting ourselves off the cliff, then voting again to keep the foot on the pedal\n\nMind you that's been the M.O. of the average Canadian voter since around 1984, seemingly.", "label": 0}
{"text": "I really want the name \"dipshit\" to stick to him from now on.  It's ridiculous and fun and I hadn't heard it said aloud in a long time; it was due for a comeback.", "label": 0}
{"text": "They probably want a move before election where Isreal probably has two plans depending on outcome.", "label": 0}
{"text": "> Their guy is actively telling his advertisers to go fuck themselves.\n\nOh and don't forget ALSO suing them because they decided, as a group, to not advertise on Twitter.\n\nThey didn't tell others not to advertise there, they just chose to take their toys elsewhere, and Musk predictably had a tantrum over it.", "label": 0}
{"text": "(These backlashes are funded)", "label": 0}
{"text": "Safe to say, Ukraine have probably become the world's most advanced drone manufacturers and indeed operators since they began to use drone warfare so effectively against Russia.\n\n\nDrones are the stuff nightmares are made of. ", "label": 0}
{"text": "No.  X is a public-opinion molding machine for its billionaire owner.", "label": 0}
{"text": "Glad Clint Eastwood can think in Russian!", "label": 0}
{"text": "Hey Biden!!!! How about take care of home first. I’m sick of yall in the White House. 🗣️What are you doing for the working class?!?!", "label": 0}
{"text": "Just a clarification, the SM-6 is a frag warhead for endo atmospheric operations.  The SM-3 is the kenetic only for exo.", "label": 0}
{"text": "A character based on Elon Musk manipulated his company's valuation by inflating his subscriber numbers in India. It became a secondary plot point in the final seasons.", "label": 0}
{"text": "And yet they really haven't. They make a few select people poorer, sure.", "label": 0}
{"text": "Wow, they're just flying into patriots?  Or is the article not very accurate?  I want to say unbelievable, but it IS Russia...", "label": 0}
{"text": "Ten percent luck, twenty percent skill, fifteen percent concentrated power of will?\n\n(Realistically the man is just 100% pain though.)", "label": 0}
{"text": "Thanks", "label": 0}
{"text": "Agreed.", "label": 0}
{"text": "Thanks. It's already begun. We are the proverbial frog in the pot upon the stove. It will probably accelerate with cumulative effects. \n\nAnecdotally, from personal experience, max temperatures in some inhabited places have risen 6 celcius over the last decade.", "label": 0}
{"text": "Carbon Tax and Dividend now! (Better late than now).", "label": 0}
{"text": "It's good to keep your eyes out on sketchy comments. Most Canada subreddits are heavily botted for Conservative bs.", "label": 0}
{"text": "What will power the ships that transport nearly everything around the world and how do products get from the factory to the grocery store genius?", "label": 0}
{"text": "\"The most wasteful cost to a country is having the 2nd-best military in the world.\"", "label": 0}
{"text": "I feel like their comment is a snapshot in time that maybe isn’t true anymore.\n\nThere was close to a decade where all the competitor EV’s absolutely sucked, alongside their tech.\n\nI don’t think that’s true anymore, but it’s very recent.", "label": 0}
{"text": "Scarborough is no joke", "label": 0}
{"text": "I don’t think developing technology to shoot down ICBM’s is being paranoid.", "label": 0}
{"text": "Antinatalist movements are going to rise even more as humanity continues to march to abyss.\n\nIf fascists take over countries they are going to wage war against childless people.", "label": 0}
{"text": "Insert “shame” gif while racking the shotgun in hot fuzz", "label": 0}
{"text": "It’s not even training, it’s men. Ukraine has been holding their own but they’re unable to just keep “grinding the meat” (as people like to say for some reason,) they need more men. NK sending troops does not simply mean “oh well, that means there will now be dead North Koreans there.” It’s such an ignorant stance and it’s surprising on how Reddit as a whole is incapable of criticize thinking.", "label": 0}
{"text": "I live in Ohio and it's very common to say it this way.", "label": 0}
{"text": "Companies don’t just *run* the world, asset managers basically ensured that each and every company that succeeded to be big enough can profit off each other at the expense of consumers and employees and anyone in general beneath them. There is currently no danger for any big company to fail, not even their competitors can topple them cause they have basically hedged their bets on propping each other up in the stocks. You cannot tell them that the world is burning because that can only harm those beneath them - they are all equals in their bunkers and their towers and their gated communities and security details.", "label": 0}
{"text": "They can quite literally slap a \"Foreign Legion\" on half of their man and act like they know nothing about it and nobody would have the authority to say zitsch.", "label": 0}
{"text": "There you go you illiterate fool. Now go back to your gutter and grovel. https://timesofindia.indiatimes.com/world/europe/europe-bought-russian-oil-via-india-at-record-rates-in-2023-despite-ukraine-war/amp_articleshow/106777423.cms", "label": 0}
{"text": "Didn’t exclude other countries", "label": 0}
{"text": "His net worth went up more than half of what he paid for twitter today. I can care less about elon but I don’t think he cares.", "label": 0}
{"text": "Sounds like a US policy", "label": 0}
{"text": "Sure was! Thanks for confirming on your own", "label": 0}
{"text": "I would worry about the real intent", "label": 0}
{"text": "What policies of his do you not like/want?", "label": 0}
{"text": "[Almost makes you wonder...](https://www.readthemaple.com/nearly-40-of-mps-invested-in-real-estate-during-housing-crisis/). \n\n>    Green = 1/2 (50 per cent)\n\n>    Conservative = 54/118 (46 per cent)\n\n>    Liberal = 62/157 (39 per cent)\n\n>    Bloc Québécois = 6/32 (19 per cent)\n\n>    NDP = 4/25 (16 per cent)\n\n>    Independent = 1", "label": 0}
{"text": "That's my buoy!", "label": 0}
{"text": "Then we are doomed, Hail Marys are all we have left at this point.", "label": 0}
{"text": "Wind, solar, nuclear power,", "label": 0}
{"text": "He made 25 billion dollars yesterday alone just on Tesla stocks, not to mention his shares in SpaceX, neuralink and other companies he holds. His entire lineage is never going broke.", "label": 0}
{"text": "Hold up.  It was an arbitrary decision in the 1970s to tie market valuation to quarterly earnings growth as the primary means to evaluate companies.  It's time to change how we evaluate companies, accounting for the externalities on the environment.  There, done.", "label": 0}
{"text": "Indeed, the UNHCR is global which makes it easier to shuffle personnel around to avoid these kinds of situations. They also wouldn’t seize to exist if they ACTUALLY helped solve this conflict.", "label": 0}
{"text": "What a shit AI written article", "label": 0}
{"text": "New here? ", "label": 0}
{"text": "It rates a lot higher than Al-Jazeera:\n\nhttps://mediabiasfactcheck.com/al-jazeera/", "label": 0}
{"text": "I can respect someone who admits their mistake…", "label": 0}
{"text": "Instead of this existential crisis being tackled in international effort, we're warring over land, religious ideals, interfering with governments in other countries digitally and domestically, *still* arguing over basic rights and *some* countries are threatening nuclear annihilation for petty reasons. \n\nAs much as id like to say we deserve our fate, there are many of us (myself included) who would like to start fixing this now so that by the end of the century our kids and their kids can not being experiencing the horrors itll bring. The problem is is that most countries leaders and CEOs around the world at the moment are short sighted and greedy, and we'll all pay for their inaction.", "label": 0}
{"text": "Oh, I remember that clip, literally said they can, \"go fuck themselves.\"\n\n\nThen he had a lawsuit with the boycotters causing an even worse exodus of advertisers. \n\n\nSo, yeah, his bitch ass actually *did* care, it turns out. ", "label": 0}
{"text": "No no, less bodies is less mouths to feed! North Korea finally solved their food problem!", "label": 0}
{"text": "These energy sources are all not viable to power vehicles", "label": 0}
{"text": "RIght. \n\nSource:  Top Gun 2", "label": 0}
{"text": "Tbf Burkina Faso isn't alone, the Sahel is quite literally the failed state belt of the world.", "label": 0}
{"text": "It’s here to stay. Leon Dipshit Smuk", "label": 0}
{"text": "several?", "label": 0}
{"text": "No politician would survive that and 90% of the population would riot. Half the population wouldn't even wear masks for a few months, can you imagine trying to get them to drastically cut back on meat or flying less or doing a single environmentally conscious action as a group?", "label": 0}
{"text": "So workers that produce these boxes are out of jobs. Just one example of side effects of fertility rates falling.  Not saying falling population growth is bad, but there will be knock on effects.  Are we prepared?", "label": 0}
{"text": "They are viable to power most vehicles right now, and in time with investment they could power more", "label": 0}
{"text": "The purpose of a carbon tax is not to \"make things better for the average Canadian\" it's to reduce the pollution that causes climate change.\n\nIf a gallon of milk costs one dollar to produce and creates nine dollars of pollution, then it absolutely should cost ten dollars.", "label": 0}
{"text": "Need some proofs here.", "label": 0}
{"text": "Pierre is a failsafe in the same way simply not attending an exam you know you're gonna fail is a failsafe.\n\nI don't necessarily blame people for feeling this way, but screwing everyone over on purpose is a bad solution to being tired of everyone being screwed over. \n\n\"I'm tired of this government that often does things that are bad, so I'm electing a government that will only do things that are bad\" is.. yeah. Well anyway.\n\nAt least people know what they're getting. (Nothing)", "label": 0}
{"text": "Hi satanicholas. Your submission from wsj.com was removed for being behind a paywall. Articles posted to /r/worldnews must be accessible to the common redditor. Please use another source.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/worldnews) if you have any questions or concerns.*", "label": 0}
{"text": "In what sense? We will survive as species it's just a case of how many will suffer overall.", "label": 0}
{"text": "The problems associated with that scenario seem a lot more preferable than the problems associated with the current scenario.", "label": 0}
{"text": "Pretty sure this is just accounting for the official stated emissions targets of each country. Which obviously won’t matter if everyone just starts using renewables because they’re better and cheaper.", "label": 0}
{"text": "Shooting for 5 baby", "label": 0}
{"text": "Good it's about time.", "label": 0}
{"text": "I'd argue pur filter was using space travel as a Cold War dick measuring contest then abandoning it after reaching an arbitrary milestone like getting to the moon.\n\n\nThen instead of using the collective wealth of the world to focus on space travel and colonization we focused on spending trillions of dollars ballooning third world populations, that live in areas of the world most effected by climate change, as well as cheap bullshit luxury goods nobody needs.", "label": 0}
{"text": "Well yeah, you want shareholders to make slightly few millions?! For what, to save some random planet we live on? Come on!", "label": 0}
{"text": "LMAO what are they meant to do exactly?", "label": 0}
{"text": "If there are no peace talks then how long do we expect the Ukrainian army to push back into Moscow?\n\nRhetoric is useless. [Ukraine is recruiting mercenaries and all you Russia haters are welcome to join.](https://ildu.com.ua/#candidate-requirements)", "label": 0}
{"text": "Iran is separated from Israel by two countries minimum, if we assume they can’t transport large armies over the Persian Gulf. Saudi Arabia will likely kill Iranian troops if they started marching across their land. Jordan won’t let them either. So the only viable land route is Iran -> Iraq -> Syria/Lebanon -> Israel. If they started marching though, we’ll likely see a repeat of the Iraq Highway of death. ", "label": 0}
{"text": "As an outsider I find American \"platforms\" rather ambiguous and more of a small set of vague ideas than what you get in most other western democracies. Usually in a Westminster style election we get 50+ page manifestos with detailed plans for every part of the government. \n\nI understand that is due to the difference in the style of the government, parliamentary democracies in practice have no separation of executive and legislative branches so it is easier to actually follow through with your platform. American you have separate executive and legislative branches and need to deal with the Senate.", "label": 0}
{"text": "IMO, geo-engineering solutions are our only hope.", "label": 0}
{"text": "I love how pointing out hypocrisy has become whataboutism on reddit. Whatever I write is 100% logical but whatever you type is whataboutism, hence rejected.\n\nRules for thee but not for me. \n\nUSA can buy nuclear materials from Russia during the war but if anyone else buys something? That's supporting war genocide of the Ukraine. That's just last year, not the past. \n\nEuropean countries were buying energy resources from India which were bought from Russia to avoid bad PR. This is also last year. \n\nWestern values go against Russia and China but same western values are sponsoring genocide and landgrabs in middle east. That's happening right now.\n\nChoose who you deal with? Yes, Saudi Arabia is a bastion for Western values. Seemingly, Israel as well. That's also now.\n\nPointing out Hypocrisy isn't whataboutism, that's not a magical word that just deletes someone's argument. \n\nYou can surely argue that aligning with Russia or China on any aspect is wrong but citing western values is laughable at best.", "label": 0}
{"text": "Unfortunately the rise of renewable energy is nowhere near enough to have any sizeable impact on the total global emissions in time to stop 3c", "label": 0}
{"text": "You didn't offer a refutation. Try again.", "label": 0}
{"text": ">  we are going to eliminate all fossil fuel electrical generation within a matter of years.\n\nIn the entire world? X", "label": 0}
{"text": "1.26 birth rate is far below replacement", "label": 0}
{"text": "Cool, now imagine being able to fund your own retirement because your labor is actually valued.", "label": 0}
{"text": "Sounds pointless. Instead let's finally let Ukraine use Western weapons inside of Russia to hit vital military targets.", "label": 0}
{"text": "I doubt they can even get all the parts at this point given the sanctions.", "label": 0}
{"text": "Still not enough.", "label": 0}
{"text": "I remember when the Patriot was the best ADA missile ever. How times have changed.", "label": 0}
{"text": "Mostly because they are bad and awful.", "label": 0}
{"text": "I feel like this guys has been in office for 30 years", "label": 0}
{"text": "It's mostly the patriot missile systems.", "label": 0}
{"text": "Hey now when the aliens come and you need our war machines keep walking. /s", "label": 0}
{"text": "First rule of engagement: know your enemy.", "label": 0}
{"text": "If you lay off the DMT and LSD you may see less clowns around, just saying", "label": 0}
{"text": "We can literally do anything, our entire society and economy is just something we made up as we went. But we won't, because people get comfortable with the status quo and the billionaire class will never give up their stranglehold on our capitalist systems.", "label": 0}
{"text": "Good god that’s obscure.  🫡", "label": 0}
{"text": "Dude has the mierdas touch. Love my car, hate the douche. Can't spell felon without elon.", "label": 0}
{"text": "And we have helped Ukraine destroy about half of Russia’s military for like 5% of the Pentagon budget.", "label": 0}
{"text": "It doesn't \"officially\" have kinetic kill, but it does have the choice of radar or contact fuzing.", "label": 0}
{"text": "3.6 mil sounds like a ridiculously low number for a corporation of that size. They must have been running on rediculously low profit margins for a while.", "label": 0}
{"text": "We need an ADFX-01 and we need it now", "label": 0}
{"text": "They make $380k profit in a corner store? What am I doing here?", "label": 0}
{"text": "Meanwhile you'll get the most brutal winters you've ever seen, depending where you are", "label": 0}
{"text": "Always?  I mean, we kinda fucked up our space ship...  The economic jargon and theory won't mean shit when people can't grow food.", "label": 0}
{"text": "He made more on Teslas surge today than he could ever lose on Twitter", "label": 0}
{"text": "It's also just India. For comparison Facebook's India profit is like $40 million?", "label": 0}
{"text": "Most don't believe we can mitigate catastrophic warming: \n\n> Almost 80% of the respondents, all from the authoritative Intergovernmental Panel on Climate Change (IPCC), foresee at least 2.5C of global heating, while almost half anticipate at least 3C (5.4F). Only 6% thought the internationally agreed 1.5C (2.7F) limit would be met.\n\nhttps://www.theguardian.com/environment/article/2024/may/08/world-scientists-climate-failure-survey-global-temperature", "label": 0}
{"text": "Wait, that’s not Canada that’s Australia.\nPlease tell me your resource companies at least pay tax.\nWe one of the highest gas exporters in the world and have a domestic gas shortage…", "label": 0}
{"text": "I hope you're joking, because if you saw a picture and believed that, you're lost.", "label": 0}
{"text": "It’s the league of nations all over again", "label": 0}
{"text": "Which is funny (depressing), because the conservatives aren't liable to do much of substance about any of those issues either. Take housing for instance, [almost half the conservative MPs \\(including Poilievre\\) have a financial reason to keep housing prices high:](https://www.readthemaple.com/nearly-40-of-mps-invested-in-real-estate-during-housing-crisis/)\n\n> **Federal MPs invested in real estate:** \n\n>    Green = 1/2 (50 per cent)\n\n>    Conservative = 54/118 (46 per cent)\n\n>    Liberal = 62/157 (39 per cent)\n\n>    Bloc Québécois = 6/32 (19 per cent)\n\n>    NDP = 4/25 (16 per cent)\n\n>    Independent = 1 \n\nGen Z is fucked if the Liberals win and they're fucked if the Conservatives win.", "label": 0}
{"text": "Even I ,myself, have been sending threatening emails to Putin for funzies.", "label": 0}
{"text": "Some do for sure.  Varies widely in either direction from there lol", "label": 0}
{"text": "Did he ever get around to “naming and shaming” the companies that stopped advertising after the platform became a cesspool? How dare they not want their ads shown alongside Russian bots and American nazis!", "label": 0}
{"text": "Truth be told, I assumed the major parties published a sort of platform that could be found for those who want to read them, but I’ve never felt the need to do so. Any major issue it’s fairly apparent where each party and candidate stand. Those sorts of things are probably more useful in local elections here, although I’ve always been rural enough that I’ve generally met and interacted with the candidates and in a lot of cases knew them before politics and knew the kind of person they were. Like a “I went to high school with his son and he was a total fuckstick just like his dad” or “hey that guys a pretty good guy he’d be good for the town/county”. Not a lot of importance to me if there’s a D or an R in front of their name then.", "label": 0}
{"text": "Even if 3 percent of India was on Twitter, that's like the population equivalent to Argentina or Canada.", "label": 0}
{"text": "It doesn't need to be rebuilt - the humanitarian duties can go to the existing UNHCR. The Palestinians are the only ones who have their own separate refugee agency, which has been an absolute failure since its inception.", "label": 0}
{"text": "It's okay. As long as we agree to send undesirables, I'm sure they will be fully onboard with sending meatwaves at Russia. No equipment or funding for them, of course.", "label": 0}
{"text": "A slow death is still dying.", "label": 0}
{"text": "Don't forget Africa. Massive bots available in multiple countries.", "label": 0}
{"text": "It's okay, very surprising to be honest", "label": 0}
{"text": "It’s a left and right issue in the sense that right acknowledges it’s an issue. While the left screams racist to anyone that dares to criticize. They both don’t have a solution. People like the right because they can at least voice their concerns", "label": 0}
{"text": "I don't understand what you want people to say? If any of the NATO countries actively join the war it has many implications that could expand this conflict. Where do you expect there people to come from?", "label": 0}
{"text": ">x's usage is at it's highest level ever \n\nIt's not at it's highest usage level ever. From the Financial Times. It claims it's at its biggest user level ever but it's actual daily user numbers are declining massively. \n\n>“Data from Similarweb shows active daily users in the UK have dropped from 8mn a year ago to only around 5.6mn now, with more than a third of that fall coming since the summer riots. The same thing is happening elsewhere, and not just in places where the platform has been banned, such as Brazil. Over the same 16-month period, X’s active users in the US have fallen by about a fifth.”\n\nThis is without mentioning the fact that as revenue is less than half what it was when he bought Twitter, which is the websites main source of income by a long way \n\n>as is Musk's wealth. that is not failure.\n\nMusk's wealth has dropped almost 20% since 2021. How is he at his highest wealth ever?", "label": 0}
{"text": "Maybe, but keeping some immigration so that we're declining but near zero is better than a steeper decline. No one wants a recession and deflation.", "label": 0}
{"text": "Frankly I'm hoping telsas crash too.", "label": 0}
{"text": "Wikipedia is quickly losing it's own generally reliable status", "label": 0}
{"text": "I mean Tesla will never even be on my radar ... the cybertruck is a joke.", "label": 0}
{"text": "Although to be fair Canada is not operating under a two party political system, and at any point the average Canadian voter during a federal election could decide to *try literally anything else for just one goddamned time*.", "label": 0}
{"text": "Ukraine needs to develop nuclear weapons.", "label": 0}
{"text": "Your last statement is a bit understating US’ role. US is supplying a lot of financial/supply aid to Ukraine and Israel.", "label": 0}
{"text": "Plus, I’ll take the same salary as the current CEO, but I’ll donate at least half of it to fund STEM programs at underfunded schools.", "label": 0}
{"text": "Reality setting in. Grab a lawn chair and come sit down with us pleebs and mull it over. ", "label": 0}
{"text": "🥇", "label": 0}
{"text": "If anything, it would expose the \"we don't want NATO on our borders\" excuse as being bullshit", "label": 0}
{"text": "Hey, hey now; it’s only mostly for that, but also for the Mideast.", "label": 0}
{"text": "how the fuck did you see it the first time\n\nit was treason then, its treason now", "label": 0}
{"text": "Based, it was about time, Out of Shape Villain Guterres a his clique of Dictators need a couple of punches to the face.", "label": 0}
{"text": "Elon needs to understand that National Security is different from tax evasion. If he can't even have an honest conversation with the law? I don't see that ending well for him.", "label": 0}
{"text": "https://www.politico.com/news/2024/10/25/musk-putin-conversations-investigated-00185543\n\nHmmm now the head of NASA disagrees with you. Stop being a boot licker for a billionaire. This is bad. Bad. Like I don’t think you comprehend how bad this actually is.", "label": 0}
{"text": "> I couldn't believe how many anti-government people made their living working for the government there.\n\nI live in SW Washington and have had the same experience.  I work with people who have been government employees since the day they graduated, and constantly complain, while having no clue what civilian jobs are like.", "label": 0}
{"text": "Every? country in NATO is allowed to declare war on Russia. But it doesn't seem fair that the decision should be made for them.", "label": 0}
{"text": "Used to do drone flying, fpv racing.\n\nWe would often attach little transmitters to them so if they went down in a grassy field we'd just use the locator to find them. The little fobs were dirt cheap. I'm sure the military could come up with something similar.", "label": 0}
{"text": "He probably told him to go all in on Trump as well.", "label": 0}
{"text": "Ukraine should have the same limitations that Israel has on their US weapons.\n\nAlthough if that were the case Moscow would be smoking right about now.", "label": 0}
{"text": "I’m getting the impression that the billionaires think their time to strike is now. With tech progress where it is, we are right on the threshold of the common worker being obsolete, no thanks on small pay to Elon. I think they are their move.", "label": 0}
{"text": "Ooh a messy break up Im here for it", "label": 0}
{"text": "SEIZE THE ASSETS OF EVERY ASSHOLE I DON'T LIKE!", "label": 0}
{"text": "And the North Koreans have just entered battlefield ohhhhhh boy", "label": 0}
{"text": "Honestly, just because it sounded funny. Ómós d’Éirinn 🇮🇪", "label": 0}
{"text": "Attempts? I thought it was clear Luk's been getting hand puppeted by Putin for years, that forearm deep fist for all the world to see.", "label": 0}
{"text": "Community is antithetical to capitalism. The capitalist system requires an atomized populace to operate at peak efficiency.\n\nLoneliness is a byproduct.", "label": 0}
{"text": "Himars time", "label": 0}
{"text": "This is different. The assessment in Israel is that Iran will 100% retaliate after Israel strikes Iran, which means that the military will need to enforce strict Homefront command guidelines, such as closing down public places and instructing people to remain near shelters. They will not do something so massive on Shabbat unless it's absolutely necessary.", "label": 0}
{"text": "True", "label": 0}
{"text": "Lollll", "label": 0}
{"text": "DYs man in gold clothes sitting on a gold throne in a room painted in gold. Whilst he rapes little boys.", "label": 0}
{"text": "Why is it that these modern day equivalents of James Bond villains all seem so dorky?", "label": 0}
{"text": "The story was horse shit from the get-go. But there was a hungry mob of anti-elon bots that it pays to feed.", "label": 0}
{"text": "> Elon Musk's wealth and companies give him so much power for not being any sort of government official. \n\nhttps://tvtropes.org/pmwiki/pmwiki.php/Main/NGOSuperpower", "label": 0}
{"text": "The US gov can ITAR SpaceX and Starlink as a last resort. Musk knows this.", "label": 0}
{"text": "He is messaging to sway people back towards voting Harris, under the reasoning that not voting for her will cause Trump to win and be much worse for the situation. I don't understand what is confusing here, what are you looking for that *would* relate to those statement", "label": 0}
{"text": "Fair enough, but def enough a few months in.", "label": 0}
{"text": "Russia, NK, Iran, and these allies are at war with the entire world.", "label": 0}
{"text": "There goes the siren that warns of the air raid\n\nThen comes the sound of the guns sending flak", "label": 0}
{"text": "That is for the entire planet. Taiwan is 36,197 sq kms, 1.8 billion contract was for a global constellation covering 510,000,000 square kilometers, including data centers, many other contractors \"loud architecture, big data analytics, edge computing, artificial intelligence, and machine learning\" isn't all provided by SpaceX and not really relevant to what Tawian contract would imply as a undersea cable back up. \n\nThe $70 million bid is appropriate because it was roughly the amount needed for 100% coverage, and doesn't include multiple suppliers in addition to Space X.", "label": 0}
{"text": "Good luck.", "label": 0}
{"text": "Okay, you first, Roman Catholic Church.", "label": 0}
{"text": "NASA is part of the Democrats now? ", "label": 0}
{"text": "Says the richest church on the planet…. Hmmm", "label": 0}
{"text": "Bold of you to assume these corpses are ever flying back home.", "label": 0}
{"text": "Scholtz can eat some Holz.", "label": 0}
{"text": "Yeah but maybe carrying around something that transmits it’s location might be a bad idea in war.", "label": 0}
{"text": ">Entered Kursk as a person, returned to Pyongyang as a corpse.\n\nKim: \"Huh? Returned?....\"", "label": 0}
{"text": "Corporate welfare", "label": 0}
{"text": "The oligarchs of the gilded age held a very similar position in our politics we just have the hindsight of that era to know it ebbed and flowed who was in the most control, the state or private industry. \n\nThe explosion of oil, steel, and railroad for them is pretty similar to the massive explosion of launch capacity SpaceX represents and with that the controlling interest in that capacity has grown extremely powerful. It'll probably take some pretty heavy handed regulation and possibly trust busting to keep in check eventually.\n\nWe've been here before, the scale may change but don't underestimate how much power those men of industry had in the gilded age.", "label": 0}
{"text": "So now Team Russia is in charge of the American space program.", "label": 0}
{"text": "This dude's entire comment history is just defending Elon. \n\nI'd do your own research on this one.", "label": 0}
{"text": "It isn't. Their worth is difficult to calculate though, because whilst the factories represent the potential for incredible worth (easy hundreds of billions) but the engineers are also an incredibly valuable resource. The factories do still have value without them though, so it's in their best interest that if the US cannot have access to them, that China can't either. So much military equipment nowawadays needs computer chips that without them you aren't even a serious threat.", "label": 0}
{"text": "Have they even seen drones before? \nI think this might end badly.", "label": 0}
{"text": "Serious tigers ate my face material here", "label": 0}
{"text": "You're right.  You do have to work to find the time as you get older.  The question then becomes, are people getting the same return?  \n\nPeople not having kids could result in more free time, but then things like increased expectations of doing work outside of work could result in less.", "label": 0}
{"text": "Because it would literally be against the law??? What insanely stupid logic is this.", "label": 0}
{"text": "Sure, but the idea is to have a common place for discussion, not a paywalled forum. Poorest (or greediest) can pay little to nothing so it makes sense for someone else to pay their share.", "label": 0}
{"text": "https://www.space.com/spacex-starlink-satellite-collision-alerts-on-the-rise\n\nI know I've read a lot about close calls of Starlink and Chinese satellites", "label": 0}
{"text": "Because Hamas has shown itself in the West Bank as well, and we all know how the UNRWA works with them.", "label": 0}
{"text": "I'd imagine they'd have their own units and one translator per unit.", "label": 0}
{"text": "Elon's personal success came from funding PayPal's start up in college with his roommate or something. The rest similar to Trump is just him buying the company and changing the name in some cases. I think PayPal is the only thing Elon is an actual founder of with him just being the CEO of everything else.", "label": 0}
{"text": "Not necessarily forced, we know that Hezbollah paid them in some cases to store munitions.", "label": 0}
{"text": "Give them a warm welcome, Ukraine.", "label": 0}
{"text": "Its also a very volatile time politically.  Plus, older politicians unfamiliar with technology are slowly dying off and being replaced.  Younger ones like AOC would know how to deal with emerging tech like AI so the loophole for some industries is rapidly closing.", "label": 0}
{"text": "Net worth is not just cash.", "label": 0}
{"text": "They’ll go up again next month. The Russian economy is running on fumes.", "label": 0}
{"text": "Kursk is in Russia…", "label": 0}
{"text": "Because they blame USA/EU/NATO/Soros/... and not Putin or the war. I know how they think because I live near Russia.", "label": 0}
{"text": ">\"There were exercises going on involving several thousand Russian soldiers. Putin started withdrawing these troops from where they were in southern Belarus, down a road, along the border with Ukraine.\n\n>At one point he redirected some of these troops to Kyiv. I’m sure they’d been provoked. It’s up to Putin how he withdraws his troops. Via Kyiv. Or he could have gone through Minsk.\"\n\n>Rosenberg asked whether Lukashenko had called Putin to clarify what was happening.\n\n>In response, the self-proclaimed president of Belarus said: \"No. He didn’t call me. And I didn’t call him. These are his troops and he has the right to move them out whichever way he likes.\"\n\nITT: A bunch of people that didn't read the article", "label": 0}
{"text": "Not to mention they actually are fucking crazy enough to think it wise to use those nuclear weapons.", "label": 0}
{"text": "Putin asking a favour is irrelevant, he can ask anyone for a favour. Whether Musk gave him the favour does matter and that's impossible to determine because Taiwan wouldn't allow it anyway.", "label": 0}
{"text": "I'm fine with that.  I'm not asking Malaysia to pitch in 30%.  But China, the EU?  They've got money and absolutely benefit from it as much as anyone else.", "label": 0}
{"text": "yesh. there is already russians talking about it. they dont understand what they going to do.", "label": 0}
{"text": "Simply cannot at all be a coincidence when Ukraine's starlink shuts down in favor of Russian strategies. What we have in Elon is another rich, proud Putin pawn.", "label": 0}
{"text": "I'm sure he will have a tottally different tune if South Korea deploys advanced tech troops on the opposite border!", "label": 0}
{"text": "Of course its more nuanced than this. Hezbollah has massive popular support of the Shi'a population in Lebanon - but are detested by most Sunnis and Christians, and have an up-and-down relationship with the Druze.", "label": 0}
{"text": "Putin is winning.", "label": 0}
{"text": "People really still spread these lies?\n\nNo, it was never turned off in Ukraine. They just tried to use it in Russian territory for offensive weapons where it was never enabled to begin with.", "label": 0}
{"text": "Arrest him. No bail. Seize his companies. Yesterday", "label": 0}
{"text": "Don't let this asshole send more garbage to space ffs.", "label": 0}
{"text": "Reddit is hysterical.", "label": 0}
{"text": "The evidence from Al Jazeera. A totally unbiased news source. Also TikTok", "label": 0}
{"text": "Lol .. I see I have found the personification of a left-wing \"fact check\"\n\n> GUILTY AS CHARGED", "label": 0}
{"text": "Russians are going to use them as meat waves, they barely value Russian lives let alone Korean.", "label": 0}
{"text": "Proof? My *highly confidential* source says it will definitely be before today", "label": 0}
{"text": "Right, like nationwide fiber networks", "label": 0}
{"text": "I feel like the US millitary would just build their own starlink, like they do GPS.", "label": 0}
{"text": "They are there purely to soak up bullets, kamikaze drones and artillery shells", "label": 0}
{"text": "China is getting ready to start a war.", "label": 0}
{"text": "Lol straight to the front lines they go. Meat shields for Russia.", "label": 0}
{"text": "3,000km² in the past 365 days", "label": 0}
{"text": "Isn't it still annexed?", "label": 0}
{"text": "According to justice lords in their cozy suburbs? Commit economic suicide and deny him while they cut off their oil pipes.", "label": 0}
{"text": "Taiwan has lived under an existential threat from a big bully nextdoor for a very long time - I can see why felt this was necessary. \n\nThe countries you list tend to score very low to medium on democracy score cards, unlike Taiwan.\n\nSee e.g.: https://ourworldindata.org/grapher/democracy-index-eiu?tab=chart&country=PHL~IDN~VNM~TWN~SAU~QAT", "label": 0}
{"text": "Unbelievably obvious...yet many idiots still say Ukraine can join while at war. Funny how these nations don't unilaterally decide to send soldiers into Ukraine....really they want America to join", "label": 0}
{"text": "You look like the kinda who would fuck a guy in the ass and not have the God damned common decency to give him a reach around.", "label": 0}
{"text": "Maximum APR on a credit card here almost lol", "label": 0}
{"text": "Still in a combat zone.", "label": 0}
{"text": "I don’t see how Palestinians can not be considered refugees if they have no state; a unique situation in comparison to the rest of the world", "label": 0}
{"text": "I see the context now. Obviously, Kamala is a better choice than Trump despite her soft stance in the conflict. I guess I didn't realize what a mess your election climate it. Good luck.", "label": 0}
{"text": "No they’re there to help Russia retake the Kursk territory back from Ukrainian control, and by help I mean be the human meat that Putin is more than likely now realizing he’s running low on in his undesirable non ethnic Russian population", "label": 0}
{"text": "Yup, people like vp007clips like to pretend the reason they dislike the tax is because it \"doesn't work\" but the truth is they just don't give a crap about global warming and would prefer if we left them alone with their stupid oversized pickup. \n\n\nThe carbon tax is a great litmus test, it allows you to spot the idiots instantly", "label": 0}
{"text": "I'd look into the Standard Oil break up and eventually the ATT breakup. We have done it in the past, and I am sure people were asking the same questions back then.", "label": 0}
{"text": "Who says South Korea doesnr give them a pass.", "label": 0}
{"text": "That's the thing I'm surprised so many people seem to forget. Putin demanded he disabled starlink over Ukraine to prevent an attack and he did with no issues.\n\nThat screams it's not very secure and he's too cheap to replace the satellites that would have potentially been shot down or he's also in Putin's pocket.", "label": 0}
{"text": "Dang, cant a guy just work two jobs in peace? /s", "label": 0}
{"text": "Luka is differentiating himself from the Putin regime. Writing can be seen on the walls and others see it better.", "label": 0}
{"text": "It is utterly insane to me that this dunce didn't get arrested for being a foreign agent when he decided to start taking it upon himself to personally fuck with Ukraine's war effort.\n\nImagine a nation allowing someone to wield the power to directly fuck around with it and its allies' foreign policy out of personal preference and they recieve absolutely no repercussions for it.", "label": 0}
{"text": "It's not a staggering amount of territory lost, but marginal movements on the front line matter.", "label": 0}
{"text": "If there's one thing you should never underestimate, it's how much of a mess the American election system is", "label": 0}
{"text": "They use Nvidia chips but are not compute constrained at this point, doesn't make any sense why Nvidia would stop selling to them anyways, Jensen likes Elon and has shown him a lot of praise.\n\nThey also have Dojo in the works, so if Nvidia blocked them from buying they would just double down on their own systems for simulations.", "label": 0}
{"text": "\"How did that get there?\" - UNRWA when Hamas had tunnels and an internet server under their building.\n\n\"No idea how that he got there.\" - UNRWA when a Hamas commander was a UNRWA staff member.\n\n\"You don't understand - these supplies are critical to get to the terror- I mean the people of Gaza.\" - UNRWA when Israel says that they've been supplying terrorists with the supplies.", "label": 0}
{"text": "Hell of a sovereignty you have I guess.", "label": 0}
{"text": "Why do they still have windows in Russia?!", "label": 0}
{"text": "lol that’s why you deleted it", "label": 0}
{"text": "Man, the quality of Sci-Fi writing has gone off a cliff.", "label": 0}
{"text": "[The DPRK's alliance with Russia is also a defensive alliance.](https://kcnawatch.org/newstream/1718870859-459880358/dprk-russia-treaty-on-comprehensive-strategic-partnership/)\\\n\n>The two sides shall exchange views on the issues of bilateral relations and international issues of mutual concern through dialogue and negotiations, including summit talks, and intensify concerted action and cooperation in the international arenas.\n\n>The two sides shall aspire to global strategic stability and establishment of a new fair and equal international order, maintain close mutual communication and strengthen strategic and tactical cooperation.\n\n>In case a direct threat of armed invasion is created against any one of the two sides, the two sides shall immediately operate the channel of bilateral negotiations for the purpose of adjusting their stands at the request of any one side and discussing feasible practical measures to ensure mutual assistance for removing the prevailing threat.\n\n>In case any one of the two sides is put in a state of war by an armed invasion from an individual state or several states, the other side shall provide military and other assistance with all means in its possession without delay in accordance with Article 51 of the UN Charter and the laws of the DPRK and the Russian Federation.", "label": 0}
{"text": "Ofc they tap Elon's communication devices. Do you know how much a security risk it would be for Putin to have these conversations? Putin has to know this would be a potential foreign asset. There would be nothing of value Elon would get from Putin. It's a one-way conversation.", "label": 0}
{"text": "Finger wagging is a red line", "label": 0}
{"text": "You’re talking about a very old version of Musk. It sucks to say but money and power went to his head and he aligns much closer with an oligarch or spy  (or even a terrorist for that matter) than he does with the free thinking, electric car for everyone we were promised. \n\nA man realized he’s completely unstoppable and has more money than anyone on earth. Why would he continue to be good? I’m genuinely asking by the way", "label": 0}
{"text": "Oh what lovely hats!", "label": 0}
{"text": "Too hot", "label": 0}
{"text": "Didn't Putin just purge a bunch of military leaders", "label": 0}
{"text": "Am I missing something here? I thought the entire point of satellite was that it worked regardless of your location provided it had a clear line of sight. So how could anyone try and prevent it being deployed inside a country?", "label": 0}
{"text": "It's no different than \"plata o plomo\".  They still threaten them with violence if they refuse.", "label": 0}
{"text": "Just send weapons and little green men. Call it a day", "label": 0}
{"text": "Gripen's would make absolutely no difference over an F-16 in this situation.", "label": 0}
{"text": "I thought Belarus was Russias puppet? Surprised ti see them saying this tbh", "label": 0}
{"text": "Yea. The implication is \"Harris will imprison her enemies!!\". But Reddit gotta be dramatic.", "label": 0}
{"text": "They plot from beginning of Iron Man hits different now. No one man should have that power.", "label": 0}
{"text": ">The phrasing is a bit confusing... But overall it looks like worse news than we had from previous data :/\n\nEither you or me are misunderstanding what he did, because for me he simply showed how many T80s were in storage in the 2010s, and how that fits with the claim of 3k T80s in total. The 3k were always a guesstimate of the upper limit of available T80s, and that is basically just confirming it.", "label": 0}
{"text": "Americans blind to what Trump is about to do to your country", "label": 0}
{"text": "On paper.", "label": 0}
{"text": "How do you explain the views of UNRWA students depicted in [this video](https://vimeo.com/995955490)? These are UNRWA schools in the West Bank and East Jerusalem, not Gaza, but they are brainwashing students nonethelezs.", "label": 0}
{"text": "Antonio Guterres will criticize his fellow UN council but not say a word to Putin or Lukashenko.", "label": 0}
{"text": "It wasn't the people who changed. Musk's public persona was that of an awkward engineer entrepreneur. Remember him smoking weed on Joe Rogan? He was hesitant at first because he didn't feel invincible. Since then, he has gotten away with everything besides some fines here and there.", "label": 0}
{"text": "I thought its really JD Vance that Musk and Thiel want? \n\nYa'll gotta get your conspiracy theories straight.", "label": 0}
{"text": "They are going to be soooo confused when they see that first drone.", "label": 0}
{"text": "Genuinely curious. Can you give some examples? I'm not very educated on what we import from Germany, but it sounds like you are.", "label": 0}
{"text": "Mainstream media must be worried that trump is going to win again. Here we go with the Russian collusion shit again. What a joke", "label": 0}
{"text": ">I only say this because I believe Putin is at heart a pragmatist, and someone who values his own life.\n\nI absolutely do not agree with that, if he becomes sufficiently shamed by a failed military operation and risks being hanged by his own people anyway. I absolutely hope you are right, though.", "label": 0}
{"text": "He himself talks about Mars all the time.\n\nWhat's the point then?", "label": 0}
{"text": "No, this is not Beirut\n\nhttps://x.com/theocharoush/status/1849357000880148556?s=46&t=NXPU_VZjwJupA3UfNDGPDg", "label": 0}
{"text": "“… please” he said in tears, while sitting in his LITERAL GOLD THRONE.", "label": 0}
{"text": "So Russia is the reason why half the people I work with think China can manufacture hurricanes at will? Can we propagandize/hack them back? What are the laws about that in the US?", "label": 0}
{"text": "And from there, sadly, most of them will never leave.", "label": 0}
{"text": "its imminency all the way down", "label": 0}
{"text": "No no no they dont get it- I'm alone on purpose. I dont have a life worth sharing with anyone.", "label": 0}
{"text": "not with f15s\n\nand loaner us fuel tankers", "label": 0}
{"text": "Toeing the line of formal war to bankrupt his country and demoralize his leadership is going pretty well, so \"appeasement\" has nothing to do with what we are doing or what we would do.", "label": 0}
{"text": "It's funny to imagine anyone actually doing so in modern times. There's so much to gain from not doing so and just doing it anyway", "label": 0}
{"text": "Take out Hilary, I mean Harris.", "label": 0}
{"text": "Training doesn’t really matter when the tactic is human waves", "label": 0}
{"text": "Let’s be honest they’ve been banking on Merica the entire time", "label": 0}
{"text": "I’ve been boycotting Twitter since 2006 and Tesla since 2008 👍🏻👍🏻", "label": 0}
{"text": "Works well for Hearts of Iron 4, but not in real life.", "label": 0}
{"text": "In like a lion out like a sunflower", "label": 0}
{"text": "Ukraine has already been publishing videos of the POW camps they have prepared for them. Warm beds, private rooms, 3 meals a day with meat, dedicated chefs, LOL", "label": 0}
{"text": "At first they came for Ukraine and I did not speak because I am not Ukrainian.  Then they came for me and I was shocked pikachu", "label": 0}
{"text": "Which is exactly what makes the UN into nothing more than a despot circus.\n\nUseless.", "label": 0}
{"text": "the bottom line is there was a bipartisan bill ready to go that Trump torpedoed so that he could use it as cudgel at election time.", "label": 0}
{"text": "Nukes it is.", "label": 0}
{"text": "Those windows man.", "label": 0}
{"text": "It’s about moving humans to another planet and abandoning earth. It’s about moving a few humans/species to another planet to safeguard/backup humanity. It’s a major difference.\n\nAlso about the science itself. That’s like saying what was the point of going to the moon. If everyone thought like that mankind would still be stick and stones.", "label": 0}
{"text": "Putin directly threatened him and he folded like a weak bitch. World's richest man is afraid of the world's ugliest dictator.", "label": 0}
{"text": "Eli Copter or accident?", "label": 0}
{"text": "\"The problem is Orthodox Islam which thrives in poor parts of the UK due to social services failing to provide essential services.\"\n\nNo, you were replying to a part of a comment someone made that did not reference the article, orthodox muslims are not mentioned once in the article (yes i read the article). Conversations in a forum can move on past what the initial post was about, in this case, the conversation moved from the article to orthodox Islam, and you were responding to that, not a comment about the article.", "label": 0}
{"text": "Not that anyone will see it. I visited X the other day and my feed was literally 90% posts from Musk. It's such a joke I don't understand why anybody other than right wing fascists are still there.", "label": 0}
{"text": "Permanent refugees … 10th generation Canadian = refugee!", "label": 0}
{"text": "This is not new. He teaming up with Trump is already sus,", "label": 0}
{"text": "They don't need many funds to have diplomacy offices open. Most of the programs are basically extra middlemen getting their hands in the till.", "label": 0}
{"text": "[Visualized](https://youtu.be/FqJwD35wWhY?si=2pBT6msm9fZ5IguA)", "label": 0}
{"text": "The whole article is poorly written and heavily biased towards Taiwan though (as I pointed out with the title). According to the article the talks began as early as 2019, and in 2022 \"the tone of the negotiation suddenly changed\".\n\nIf the negotiation took place over more than 3 years, then they obviously didn't go very well.", "label": 0}
{"text": "/s But it’s ok to annex Ukraine because that is different", "label": 0}
{"text": "You’re allowed to have an opinion, but it couldn’t be more wrong and it’s just disappointing that you can be so brainwashed…guess it’s cultural.", "label": 0}
{"text": "Kursk isn't in Russia, Russia doesn't exist\n\n\nYou must mean northern Ukraine ", "label": 0}
{"text": "21 day old account, -61 karma. Ignore the bots, people.", "label": 0}
{"text": "It’s a war of attrition now until a massive collapse", "label": 0}
{"text": "I can see the factories being rigged to be disabled in some way but just very surprised they would actually explode.", "label": 0}
{"text": "Droppin' drones", "label": 0}
{"text": "When is this asshole going to start doing the pope thing he was elected to do? Did he skip the \"render unto caesar\" part of the bible?", "label": 0}
{"text": "You have a valid point.  However, please note that UN is in New York, so where do you think that money we give them is going to be spent?  And if we are the host for the UN, which country are the diplomats going to always be aware of and unconsciously perceive as a center of civilization?  Also, if we aren't voting with our cash, how are we to wield influence in an organization that otherwise gives 1 vote to each government, regardless of size (interesting to note that the EU, by being a little less united than the United States, gets 27 votes) ?", "label": 0}
{"text": "Check out \"seems to have no understanding of current US strategy\" over here.\n\nEnjoy your Call of Duty.", "label": 0}
{"text": "They claim to want a country of their own.\n\nLet them learn to given themselves on their own.\n\nThey don't need unrwa for that, especially not in the west bank which is pa controlled.", "label": 0}
{"text": "Remind me, what does America do when other countries nationalize things?", "label": 0}
{"text": "They should sanction xAI from TSMC semis.", "label": 0}
{"text": "Exactly, which is why you can't let a new country join while they are engaged in a defensive war but members can join the defensive or aggressive war of a non member.", "label": 0}
{"text": "Lost generations cease to be an issue after 2-3 generations. Otherwise we'd still be struggling from ww2", "label": 0}
{"text": "Time for the government to take over the company in the name of national security.", "label": 0}
{"text": "I’m slightly above average for income for the US.  The difference in income between me and an average Russian is about $60,000.  The difference between a North Korean and a Russian is about $59,964.  I made about as much typing this message as a North Korean makes in a month.  Not really trying to be a braggart, but goddamn.", "label": 0}
{"text": "But not too hard, to not cross any \"Red lines\"", "label": 0}
{"text": "I think it’s been proven that his initial stewardship of PayPal, Tesla and SpaceX led to their greatness. Now, I also believe that the thing inside him that pushes him to be great is also destroying his public persona and encouraging him to feel drawn to strongman political types like Trump. It’s well known that he had a hands on approach to his projects but it’s also a detriment as he micro manages. At least with SpaceX he proven that if you have the $ and are willing to hire and listen to the best people in the industry you can upset an industry that is normally only government funded.", "label": 0}
{"text": "I hate to use emojis on Reddit but 😂", "label": 0}
{"text": ">Yup. When the *only* thing the secret service(supposedly the best body guard entity in the world) managed to do was kill an already disarmed assassin preventing his capture and questioning, the only rational conclusion is collusion. \n\nOkay, I'll bite. First, he was killed by a sniper *as* he was still firing, not while disarmed. There are multiple videos of this.\n\nSecond, the second guy is still alive.. so if there is some big conspiracy to keep them from talking, why's he here?", "label": 0}
{"text": "How does that stop them from getting citizenship in the countries they live in, for those outside of the Palestinian Authority ?", "label": 0}
{"text": "No one said that.", "label": 0}
{"text": "People on the right are so stupid, they think it’s the left who want a one world government/new world order, it’s right leaning politicians and billionaire’s who want it, that way they have a giant world population to subjugate. Back to serfs and nobles!", "label": 0}
{"text": "So what’s going to happen if Russia can’t take the area back and NK loses many of their troops?", "label": 0}
{"text": "Gunnery Sergeant Hartman!", "label": 0}
{"text": "he did violate them.  pretty sure they have built in resolutions for violations too.", "label": 0}
{"text": "The GRU officers might ask the same thing of Lukashenko after hauling him out of a first floor window.", "label": 0}
{"text": "It's like arguing which dwarf is the tallest.", "label": 0}
{"text": "I feel like the misogyny in Korea isn’t helping. Women in Korea are deciding they’d rather be alone than date. Address crimes against women and address men’s attitudes towards women and then maybe they will be open to dating. (On top of all the other stuff too obviously.)", "label": 0}
{"text": "Because Germany has \\*not\\* been an ally recently? Between propping up NS2 before the Russian escalation n Ukraine, and the Scholz cheering for \"multipolarity\" you have to ask how long you tolerate this. \n\n  \nIt's like France, regularly insulting NATO and the US, demanding a lot from us, then when we passed the IRA they wanted money. \n\n  \nIt's hard to argue that our allies are our allies when they do shit like that.", "label": 0}
{"text": "The UN is basically just a diplomatic forum to talk. Its not really meant to actually do anything and has no capacity to do so.\n\nAll the power is in the security council and comes from the countries that make up the council.", "label": 0}
{"text": "There is no chance in hell anyone is going through the effort of repatriating a bunch of North Korean fodder.", "label": 0}
{"text": "Does this count as a leopards ate my face situation?", "label": 0}
{"text": "I get the feeling that I should visit Taiwan sooner than later. And that's sad. I like Taiwanese people I've met locally (there are a fair number of them here).", "label": 0}
{"text": "But Elon can flip it off at any time he wants. He did it to Ukraine and the US Government made him turn it back on.", "label": 0}
{"text": "Belarus and Ukraine gonna be friends after all? Make it make sense", "label": 0}
{"text": "I miss Pre-GM Saab so much those cars were fun to drive tanks. ", "label": 0}
{"text": ">Dude, starlink was going to be THE backup Internet in case China turned it off.\n\nThen maybe it would be a good idea to not force Starlink to sell 51% of its (potential) taiwanese subsidary?", "label": 0}
{"text": "If SpaceX isn't ahead of the game then who is their near peer? Who else is at the point of launching 100+ rockets a year (~30 of which were for outside customers based on a quick count on Wikipedia)?", "label": 0}
{"text": "just pay enough money, thats how it has been working so for in russia", "label": 0}
{"text": "They're probably wondering why they're fighting for white people ", "label": 0}
{"text": "Cut his govt subsidies", "label": 0}
{"text": "His source of wealth - Tesla is total BS. The company has conned ppl into thinking it’s a tech company. \n\nIt’s not. It’s also losing market share.  \n\nUnless Trump via government regulation steps in and saves him he’s fuckes", "label": 0}
{"text": "So Indo Pacific is gonna heat up for sure in the near future????", "label": 0}
{"text": "Very OJ, not very demure", "label": 0}
{"text": "Ya but a lot of statements that came from NATO on the matter were along the lines of \"if NK troops enter Ukraine...\"\n\nGives them an out to make their grandstanding statements without actually doing anything.", "label": 0}
{"text": "🤌", "label": 0}
{"text": "The discontent was there before. Take for example the big miners strike of 1977, when, I think, it was for the first time that Ceausescu came close to be overthrown. Or the one in Brasov in 1987. I think what differentiated the one in '89 was the fact that the communism regimes have been falling allover in Eastern Europe and securitatea knew that even if they manage to keep the power through force, the beginning of the 90's would not be easier, and more revolts would follow. It is sad though that so many people had to die, only for the ideals that they've died for to be stolen a few weeks and months later by the same old communists.", "label": 0}
{"text": "So greet them with the same warm welcome that was given to the Russians.", "label": 0}
{"text": "Putin: \"Let's make this facebook official.\"", "label": 0}
{"text": "I've been talking to a highly placed source that says Bibi is an alien and his farts smell like gasoline, and Santa's real name is Eli Copter.", "label": 0}
{"text": "you're literally who he's talking about", "label": 0}
{"text": "Nah just the treasonous, fair election undermining ones.", "label": 0}
{"text": "I am glade they are keeping these 3k t-80s I'm storage and fielding the t-64/65s. /s", "label": 0}
{"text": "Most of the things you mentioned are \"not rocket science\". Only NASA and the Space Force have the capabilities to run something at the SpaceX level. Nationalizing Starlink would require breaking it out from SpaceX (unless we're saying nationalize SpaceX) as it quite literally cannot exist without the launch cadence currently only provided by SpaceX.\n\nI don't know a ton about nationalizing, but in a theoretical situation where Starlink is broken out and nationalized, would they now need to bid other launch providers for their launches?", "label": 0}
{"text": "I, too, hope for no active war on the Korean Peninsula, but better to have them and not need them, than to need them and not have them.", "label": 0}
{"text": "The US military is so far behind in technology it's not even funny. That's why we use contractors. Our military directly building a starlink-like system is just not gonna happen any time soon.", "label": 0}
{"text": "Sort of, except for that GPS was buoyant paid for, by the government beforehand. It wasn't stolen from someone who funded that themselves. If the government wants to own something, it can buy it from a willing seller, or fund it from the beginning. Look what happened to the government that nationalized a United Fruit", "label": 0}
{"text": "Ukraine is already losing a war in Ukraine. Striking antique military assets in North Korea will do nothing to stop North Korea helping Russia send human waves", "label": 0}
{"text": "I'm fine with that.", "label": 0}
{"text": "Why not both", "label": 0}
{"text": "Get a special forces to attach the Russian North Korea border guys.", "label": 0}
{"text": "\"Violence is the ultimate authority\" - a satire about fascism", "label": 0}
{"text": "Nah, those dragon-drones work even better.", "label": 0}
{"text": "Still in russia not ukraine.  So what.", "label": 0}
{"text": "It also would have never been allowed by anyone if it was officially a US Gov owned system instead of a regular ISP.", "label": 0}
{"text": "Place your bets people: How long until 22%? or 25%?\n\nC'mon don't be shy!", "label": 0}
{"text": "The same thing that’s happening now, send more meat waves at the problem and hope it eventually works.", "label": 0}
{"text": "You’re not gona get a response from that guy. There is a reason the dude has 88 in his name.", "label": 0}
{"text": "Revoke his defense contracts is such a better option. Stop forcing him to be a good person or businessman. Let. Him. Fail.", "label": 0}
{"text": "Not for long…", "label": 0}
{"text": "Putin is already looking weak. Do you really think he would approve Lukashenko putting out a statement challenging his authority at a time when his authority is already vulnerable at home?", "label": 0}
{"text": "How come the NSA is not paying this guy a visit?", "label": 0}
{"text": "Ukraine needs the KF-21 in huge numbers", "label": 0}
{"text": "And the look when they see how far ahead western weaponry is compared to their 50’s era gear.", "label": 0}
{"text": "Society has been an experiment and its not looking too promising.", "label": 0}
{"text": "You really should be thinking about the \"up until recently\" part of your comment. What changed?", "label": 0}
{"text": "Right?! They should be using South Korea as a launching pad like Russia uses Belarus ", "label": 0}
{"text": "52 million people in a country the size of Indiana. They definitely need the space.", "label": 0}
{"text": "One man's terrorist is another's rebel. In general, the word terrorist is used by governments to deligitimize movements and make it so they cannot from a legal standpoint engage in \"legitimate\" combat or conflict. This is not to say terrorists aren't horrible people, most of them undoubtedly are, but the term is diluted quite a bit.", "label": 0}
{"text": "UAV might just mean recon drone so they expect to get it back", "label": 0}
{"text": "Russia needs more war meat bags", "label": 0}
{"text": "How is this not a massive sanction violation?", "label": 0}
{"text": "It isn't against the law... Starlink and Starsheild are completely different services.\n\n\nStarlink would only need a license from the NCC to sell their Starlink service to businesses or consumers; it is not required for the US military to operate their private form of communication.", "label": 0}
{"text": "Blah blah nuclear threats mean when defending oneself against a fascist aggressor ", "label": 0}
{"text": "What the fuck did they think was going to happen when the government privatized its space program and military satellite systems to one fucking guy. Who isn’t even American. This dude gives ZERO fucks about anyone but him and his bank account.", "label": 0}
{"text": "One court case could remove him from his wealth if it's found his companies are engaged in a criminal conspiracy.\n\nNot so easy taking the possessions away from a country.", "label": 0}
{"text": "Yes and no same as how we have the rudimentary tech to get to other planets. The problem is cost and infrastructure. Developed countries will fair better because they have the resources, infrastructure and capital to do so but what about areas where deserts are expanding, fresh water sources are drying up for example the middle east and northern Africa. It's not just political will power. It's also complex geopolitics. How to you set up the energy resources needed to let's say maximize crop yield with diminishing arable land and lack of fresh water. How do you then make those systems weather proof against increasingly severe environmental phenomena. It would take decades to develop the infrastructure to make more trivial iterations of the technology needed viable. That's time we don't have to prepare vulnerable populations for the worsening effects of climate change where as we could invest in making robust systems with increased portability that can suit both goals unil the necessary infrastructure can be developed. Going to another planet presents similar problems with how do we establish similar systems without conventional infrastructure.", "label": 0}
{"text": "They have in whole, hit more international ships than Russian or Israeli ships.\n\nSo the fuck what.\n\nThe fact that they even think they can do this, and do it, is enough to have them erased of the planet.", "label": 0}
{"text": "In the words of a wise man named \"snowflakes4trump\"\n\n\n\"You assume a lot. You know very little.\"", "label": 0}
{"text": "I hope that is true.   The ultimate troll and being the good guys.", "label": 0}
{"text": "Why is Russia not scared of actual war with the West?", "label": 0}
{"text": "I have not commented on anything relating to Elon Musks talks with Putin. The article in the comment I responded to doesn't mention Putin or anything with Russia. Read the whole comment chain!", "label": 0}
{"text": "That is mediocre condemnation.  Next time condemn stronger.", "label": 0}
{"text": "Isn't that exactly what you just did lol.\n\nWhat I'm saying is just literally true. Just go to liveuamap.com and see yourself lol. Moron", "label": 0}
{"text": "Arest this guy!", "label": 0}
{"text": "Seems Lukasenko unhappy with Brics promises", "label": 0}
{"text": "The amount of disingenuous clowns who don't understand rules of war vs terrorist tactics is tragic, you could fill an internet with them.", "label": 0}
{"text": "Are there any other sources for this?", "label": 0}
{"text": "How short-term is short?", "label": 0}
{"text": "They can’t outgun Americans, but *my god* have they got a lot of American stupidity and gullibility to play with. It’s been disappointingly easy for them to get many Americans to shout, “Hold muh beer!” and willingly tear apart their own democracy.", "label": 0}
{"text": "Probably also confused when a white person gives them orders to fight when they've been taught all their life they're the big baddies", "label": 0}
{"text": "Not really.    You can hang out at your friend’s house for free.   You can pregame before going out and drink cheap beer at the bar.  College kids drink and party more than anyone and a vast majority of them are broke.", "label": 0}
{"text": "The only thing hurt here is my brain, trying to make sense of your ignorance.", "label": 0}
{"text": "Youre defending a billionaire that is in charge of spacex(which holds US contracts).  Why would he ever need to talk to Putin?  Doesn't that at all throw any red flags?  Other people have been thrown in jail for sending parts.", "label": 0}
{"text": "Yet. Wait till Luka stops being convenient for Moscow.", "label": 0}
{"text": "Putin Trump and Musk rotten apples in a barrel", "label": 0}
{"text": "everbody knows the Gripen woud be perfect for ukraine, but f16 is very much avaiable, gripen is not", "label": 0}
{"text": "While I understand that the IMF’s annual meeting is taking place now, and not two weeks from now when these remarks might be more relevant, I think discussing  a hypothetical trade war between the US and EU is slightly premature, especially when the people who actually need to receive that message might not be in the room at this time.", "label": 0}
{"text": "What are you smoking man she’s worth $250mm on a 6 figure salary ", "label": 0}
{"text": "I think Germany has mainly considered its military a showroom and demo team for the arms exports business for decades now.  They'd be shocked and outraged if somebody in the German military was accused of trying to hurt somebody.", "label": 0}
{"text": "Remember colonization?", "label": 0}
{"text": "I need this anti tank javelin for deer hunting", "label": 0}
{"text": "You really don’t understand how a Palestinian who holds Canadian or US or British citizenship isn’t a refugee? \n\nWhat do you think happens when refugees - from anywhere - permanently immigrate to and gain residence/citizenship from another country? They *were* refugees of X, and they now *are* permanent residents/citizens of Y.\n\nRefugees are only refugees - in a legal sense - until they have a new, permanent home. Then they are just normal people with a unique family history. Unless they’re Palestinian, in which case they magically are victims forever no matter how established and permanent a home they have.", "label": 0}
{"text": "And they still are in large part depending on the government, so it would be very easy to destroy his wealth. \n\nThe US Government coming out tomorrow saying driverless cars are not allowed would absolutely tank his net worth since tesla is still held up by the belief that 'robo taxis will be here next year'.", "label": 0}
{"text": "You're right. Billionaires are a national security risk in and of themselves. They will sell anything to anyone if they stand to gain from it", "label": 0}
{"text": "Thank you! Appreciate you taking time saying this:D", "label": 0}
{"text": "wasn't long ago he also said he was staying out of politics and was for free speech.  Now he sucks off trump and blocks non-maga groups on twitter lol.", "label": 0}
{"text": "while true, i'd also wonder how much confirmation bias they are going to get about white people being evil when they have to deal with russian racism on the battlefield?", "label": 0}
{"text": "Because the scary thing about war for nations is your people dying. Most western powers leaders, if they suffer a lot of casualties in war, will get replaced. Putin doesn't care about the dead bodies and his people don't care either, not that they could vote him out if they wanted to.", "label": 0}
{"text": "A lying piece of shit, like always.", "label": 0}
{"text": "Your argument about his businesses being hurt is wrong on its face and implicitly admits that Musk violated the Hatch Act.\n\n1. War is good for business. War allows businesses to produce goods and services for Governments that will pay through the nose for them because of the conflict. Example: Star link for Ukraine is paid for by the US after Musk initially offered it for free.\n\n2. Russia taking NK troops has no bearing on Musk's actions here. In order for that to be true, he would need to know those troops were coming. There's no evidence of that, and I'm not speculating about it. As to the notion that it's a waste of his time, we don't know enough about what was discussed or the time scale of any planning that may have happened to know if that's accurate.\n\n3. If he was negotiating a cease fire, then that's a blatant violation of the Hatch Act. He should be charged and prosecuted accordingly.", "label": 0}
{"text": "All US presidents have had only British and/or French bloodlines. 13 and 33 are master numbers, and hold significant importance in the West; especially relevant for you if you live under their systems. The most skilled stone masons built most, if not all, of the temples in our Western World, from Acropolis in Greece to churches all around the West. 13 is the amount of York Rite degrees, 33 is for Scottish Rite degrees. York and Scotland is what most would recognize as \"Great Britain\", which is where the elites' bloodlines come from. Before Freemasonry, you'd have Knights of Malta, O.T.O., Rosicrucianism, etc. I'm sure you've heard of the Rothschild also. Roth means \"Red\", and Schild means \"Shield\". The bloodlines and families run hundreds of years old. Do you even see the red shield? [Here's a video](https://youtu.be/rpbNGXDHVc4). \n\nPerhaps you understand this is no joke now", "label": 0}
{"text": "Can the English take some lessons from the French Revolution?", "label": 0}
{"text": "And help you pals to vote too!", "label": 0}
{"text": "They just take adderall now instead of meth. Same difference.", "label": 0}
{"text": "Quite obviously, basic survival is not what he’s talking about out.", "label": 0}
{"text": "easy rebuttal, \"it is Ukraine's affair if Ukraine uses NATO troops\"", "label": 0}
{"text": "They were also just taking babies regardless. Thousands of children and if I remember correctly one of the heads of Russian propaganda \"adopted\" one. They already had/have a population problem and they know it, so they take children to fill the void.", "label": 0}
{"text": "Their thousands of bots are making those comments", "label": 0}
{"text": "Ah, now I get your point. Yes, that would be indeed worse if not only the T80s numbers are considered.", "label": 0}
{"text": "Fuckin A", "label": 0}
{"text": "The coalition is starting to crack!", "label": 0}
{"text": "Until this news comes through a vetted source with context, I think we can take this with a grain of salt. The only sourcing on these comments I see is from Ukrainian publications and content mills.", "label": 0}
{"text": "And the countries that are part of NATO can simply reject it. This is such a pointless discussion.", "label": 0}
{"text": "No one will do anything about it because there is no justice in the world", "label": 0}
{"text": "They need UNRWA's money.  This seems like a bad time to quibble over corruption within either organization given the alternative.", "label": 0}
{"text": "Might be over by 2027ish honestly even 2025 if we are to belive the most pessismistic UA accounts where there are tens of thousands of deserters and severe manpower shortages", "label": 0}
{"text": "Will we stop accepting all these \"oops\"es, defund it and shut it down already...", "label": 0}
{"text": "There are almost no conscripts fighting in Ukraine and even if there was, i wish them the same fate. No pity for invaders", "label": 0}
{"text": "Was 9/11 a conventional war? I'm genuinely curious.", "label": 0}
{"text": "It really is. You can dislike the enemy without needing to make stupid shit up.", "label": 0}
{"text": "I don't have any opinions on the transaction; I am not involved. However, starting a negotiation in good faith requires adherence to existing laws. Suddenly turning around after months of negotiation and taking a position that you won't proceed until laws change is a bad faith tactic.", "label": 0}
{"text": "Man If I had a nickel for every time someone tried to boil down a complex issue with multiple contributing factors down to one cause. You're exactly right, it's a mixture of things that interact in a dynamic way to exacerbate the problem. The internet, especially social media, how social media has been utilized, the cost of living and inflation, the loss of third spaces for young people (both a cause and a symptom), political tension at an all time high, misogyny and misandry both seeing a rise (although one is definitely a bigger issue than the other). All of these factors and more contribute to the issue.", "label": 0}
{"text": "You pretty much proved my point. This has beem going on for centuries, and its never going to end.", "label": 0}
{"text": "Do you really want your son or daughter  fighting for tyrannical power where rule of law is trumped by the feels?", "label": 0}
{"text": "This makes zero sense.", "label": 0}
{"text": "Pardon? The laws existed in the books, Taiwan is not making any demands other to conform with existing laws.", "label": 0}
{"text": "Starlink wouldn't even be legal to operate in Taiwan yet because of Taiwanese laws. This is not Putin's doing or Elon co-operating with him, he simply has no say.", "label": 0}
{"text": "My acc is almost lvl 1200 in league...", "label": 0}
{"text": "We build 200-250k units of housing per year, that’s what the industry is capable of most. Most of them are one bedrooms and bachelors.\n\nThe Feds brought in 1.2 million people last year knowing this - that’s 5 new people for every unit of housing built, not including any existing demand for housing from the people already here.\n\nCities and provinces cannot triple the amount of housing getting constructed, no one can.\n\nTriple the architects, engineers, plumbers, building inspectors are not going to appear overnight because the feds went crazy on immigration.\n\nThe concrete factory does not have the money to go from having 100 trucks to 300 concrete trucks because Trudeau wanted to give Tim Hortons as many cheap workers as he possibly could.\n\nThe local drywall plant can’t suddenly triple production without serious investment in its factory to deal with such a massive increase in demand.\n\nThis is entirely on the Feds for believing you can just magically scale the construction industry by 300%. The reality is you need billions, if not trillions of dollars of investment into the construction industry plus a miraculous appearance of millions of trained professionals to keep up with the liberals levels of immigration.", "label": 0}
{"text": "I mean, I didn't ask for a long rant, just asked where you got the info from.", "label": 0}
{"text": "Yup, everyone in the comments keeps blaming work culture and high cost of living while ignoring how dangerously misogynistic most korean men are, that the women now prefer to be single rather than put up with them", "label": 0}
{"text": "Economy and wages? Sure, because Russians in buttfuck nowhere can still actually use a car with gasoline and actually buy stuff (mostly booze...but...stuff)\n\nInfrastructure? Thats a Stretch. Like 2/3s of rural Russia doesn't even have indoor plumbing, and if you google \"Russian roads\" they're far from well maintained. \n\nCalling Russia a civilized country is like calling a rusted out Pinto with a fresh coat of paint a great car. Sure it looks like it is, but underneath its a rotten pile of shit.", "label": 0}
{"text": "We are two weeks away from the elections. Do you expect there to be no Russian disinformation at this time?", "label": 0}
{"text": "Yeah no, but if an asshile billionaire is walking the line of treason and his company provides national security services and he's basically trying to be some shadow senator, it does not sound that crazy at all anymore.\n\nHe's making his own bed. He build his empire and power, but the US should protect its interests.", "label": 0}
{"text": "Well this sounds cool... kind of like tapping the aim button on CoD.", "label": 0}
{"text": "Private individual (rich) acting against the interest of US government.", "label": 0}
{"text": "Russia is far too weak to fight a war by itself.", "label": 0}
{"text": "Dating apps always devolve to looks over anything else... people that can be attractive outside of a camera will always never be able to find matches.", "label": 0}
{"text": "> he was killed by a sniper as he was still firing\n\nThere were 2 snipers - a local police sniper and a secret service sniper. \n\nThe local sniper shot the gun from the assassin's hands. The Secret Service member fired after the man was disarmed, killing him. \n\nhttps://www.bbc.com/news/articles/c4gl2jqem0eo\n\nhttps://www.washingtonpost.com/investigations/2024/07/30/trump-rally-local-officer-shot/\n\n>Second, the second guy is still alive\n\nHe was supposed to get away. Once again, local cops caught him after the secret service failed to outrun a 60 year old man.", "label": 0}
{"text": "Billionaires should NOT exist. What's the issue with this statement?", "label": 0}
{"text": "Global terrorist Elongated Musty Rat needs to be arrested and tried.", "label": 0}
{"text": "NATO admitting Ukraine mid conflict would automatically and immediately trigger article 5, which would mean any such invitation could only be made as a declaration of war as well, essentially.  I’m not evaluating the right/wrong of such an action, merely acknowledging the practical reality of it.", "label": 0}
{"text": "I think people who protected Lukashenko in 2020 are not the people who will fight on his side in war with Russia", "label": 0}
{"text": "We are so blessed to that he was cast for that role.", "label": 0}
{"text": "That would make some sense.\n\nBut under UNRWA's definition, a person who was born in USA, lived their whole life in USA and has US citizenship would be considered a refugee if even one of their grandparents were once Palestinian refugees.", "label": 0}
{"text": "I can only imagine the depth of Russian intelligence operatives in Belarus. Say what we will, the Russians are nearly americas peers at destabilizing governments worldwide. (Or at least the were, everything I currently I’m quuestion obv) \n\n\nI don’t think it’s far fetched to imagine that a coup, or several, could be in the forecast for Belarus, and there is only so much cracking down you can do when half your country’s elites and politicians are willingly working against your efforts. Stay tuned for a ‘democratic revolution’ incoming for Belarus, with the full backing of Russian nationalsx", "label": 0}
{"text": "We should use Oneweb, which is Starlinks main competitor, that is also owned by the British and French governments. NATO should have control of anything this important. ", "label": 0}
{"text": "First, we should freeze up and seize all of Musk's assets until we figure out what's going on", "label": 0}
{"text": "[With this new batch of Hezbollah fatalities, the 1,000-threshold is symbolically reached.](https://x.com/QalaatM/status/1849887720585245057)", "label": 0}
{"text": "People in those countries do not want to have a direct war with Russia, it's simple as that. You can still volunteer.\n\nYou saying \"But in both **World Wars**\" is not the argument you think it is. Regardless, any country can choose to join Ukraine in fighting Russia without NATO, but again, it's clearly something people do not want. Arguing about Ukraine's ascension to NATO, even if it's agreed that the country is unable to article 5, while at war is pointless, it's not happening and it wouldn't change anything,", "label": 0}
{"text": "> Like 2/3s of rural Russia doesn't even have indoor plumbing, and if you google \"Russian roads\" they're far from well maintained.\n\nThey're very well maintained in places where people actually live.\n\nOf course there are places where there is no indoor plumbing, no asphalt roads but let's not pretend it's anywhere in its european part. And nobody actually cares what happens in villages where nobody lives.\n\nIt's okay-ish where it matters and it certainly miles better than N Korea.", "label": 0}
{"text": "Funny that their propaganda for years has been pushing fear of a new world order deep state oligarchy ", "label": 0}
{"text": "I'd really like to read the CIA dossier on how much of a blow this actually is to putins ego.  The degree of humiliation it has to be to beg NK, it's like going to the guy on the corner and asking him for change.  Doesn't putin wonder what that makes him look like to China?  I don't know, I'm just thinking they've got to be doing a double take because it shows how weak Russia actually is now.", "label": 0}
{"text": "Security Clearance should be revoked immediately! Its wild that he still has it when he's so open about doing K and smoking weed. Our government should seize Space X", "label": 0}
{"text": "Read the article for yourself. This commenter is a huge Space X stan and is minimizing the full story.", "label": 0}
{"text": "Seems like you’re from Quebec. Maybe ask some of the people whose land you’re living on?", "label": 0}
{"text": "They've removed almost all of them for refurbishment and deployment.\n\nThe worst case from his numbers is that Russia actually started with more tanks in storage than suggested by previous data - I get 300-500 more than previously known. That would suck.\n\nOtoh, perhaps there have been far more scrapped. Afaik  we really don't know how many were actually inside the garages at many of the bases.", "label": 0}
{"text": "War. Rumors of war.", "label": 0}
{"text": "NATO _moves goalposts_", "label": 0}
{"text": "That means that Russia also couldn't use it. \n\nHe turned it off in Russia occupied territories.", "label": 0}
{"text": "Anyone else that shouldn't exist herr fuhrer?", "label": 0}
{"text": "It’s Reddit, the average news poster is clueless at the minimum", "label": 0}
{"text": "Uh yea we were part of it.", "label": 0}
{"text": "The problem for that is downstream impacts. Are the impacts of that geoengineering the act of a hostile nation? Could another nation, nuclear armed, consider it an existential attack on them by India and retaliate? We're playing, and losing, a very dangerous game.", "label": 0}
{"text": "Then it’s Ukraine’s affair if the weight of the entire Western Hemisphere’s military capabilities comes knocking on Putin’s door", "label": 0}
{"text": "Gigi Hadid is considered refugee. Tell me that's not dumb.", "label": 0}
{"text": "Sun Tzu wrote \"When you surround an army, leave an outlet free.\"\n\nIf we're not going to destroy Putin, we need to give him some token way to save face and stay in power at home. I can imagine a deal to end the war where Russia keeps only Crimea, and Ukraine joins NATO, and Putin spins it to his own people that this was the point all along. To maintain Russia's access to the Black Sea and get international recognition that Crimea has always been part of Russia.\n\nI don't like it though, because he will realize the only way to rebuild Russia's power is to undermine democracy and go all-in on cyberwarfare against the West.", "label": 0}
{"text": "Clearly he's less in the bag for Putin than we all thought, as he didn't in fact invade alongside Russia, but he's trying to thread the needle without making them an enemy.", "label": 0}
{"text": "Leon Muskrat the enemy within.", "label": 0}
{"text": "Or maybe it's not as expensive as you think it is?  The money that is paid through them by members goes into that pile as well as the tax exempt status around the world for the real estate?  Nobody said it wasn't expensive to keep artwork - but the point of the article was they should not have a 'mad pursuit' of money when they have never had money problems.  \n\nYou don't see them selling artwork for 'upkeep of ancient architecture' because there's no way to spend it all when a lot of the 'upkeep' is donated or partially listed as grants by Universities that send students to do it for free (actually they pay schools that pay the Vatican for access).   They own all the property that these ancient structures are on - so really it's the price of keeping all these buildings (that don't seem to be fully of needy and homeless) - even the latest $770k restoration of St. Peters Basilica was funding by an outside organization as a donation to the church - as an art major its great to see it displayed but as a religious organization - they're like the Dwarves of Khazad-Dum.", "label": 0}
{"text": "Or stands near a window", "label": 0}
{"text": "I'm not saying they're necessarily going to accept, just that that will be the offer.", "label": 0}
{"text": "There is no choice now. Ww3 is here. Back during ww2 even innocent Chinese American citizens had to be locked up, just to protect American soldiers against the risk of extortion. Same thing will be happening here soon. Treasonous sth Africans included.", "label": 0}
{"text": "Much like historically the Democratic party is a diverse coalition that includes a range from environmentalists and Union steel workers - The Republican party also has a diverse coalition of interest.  \n\nWarhawks. Libertarians. The rich elite. Evangelicals. Whatever MAGA is - seems that the die hard tends to be low information low education voters. \n\nPlenty of Republicans would love nothing more than the downfall of Russia. I'm sure they feel that Reagan would be extremely happy to see the struggles Russia will be experiencing in the future as a result of the western world coalescing. \n\nThe current standard bearer of the party speaks out of both sides of his mouth on the issue. Genuinely I believe 1) there is no Russian blackmail on Trump. 2) Trump rambles and says whatever get some reaction from the more low information voters. 3) he is an extreme narcissist and will smile and suck up to anyone that plays his game (think North Korea, China, Russia).  Trump is in it for Trump.", "label": 0}
{"text": "We all care to be clear. But that doesn’t mean the right people will do their jobs and investigate him. That isn’t our fault. Its theirs.", "label": 0}
{"text": "Unless Russia change their way of doing fighting (never) having high casualties are just normal cost of doing business.", "label": 0}
{"text": "Those sunflowers they are fertilizing will be beautiful in the spring", "label": 0}
{"text": "No private citizen should be allowed to have this much power.", "label": 0}
{"text": "Fuck this guy. Life would be lovely if karma existed for realz.", "label": 0}
{"text": "s/NATO/FVEY. Fixed that for you.", "label": 0}
{"text": "They are merely a participant in beyond-LEO; they do not dominate there.", "label": 0}
{"text": "At least they don't write love letters to Kim and worship Xi's dictatorial powers while swooning over how confederate fanboys and neonazis are good people ", "label": 0}
{"text": "Starlink should be banned from all military applications, ultimately it can’t be trusted. We should use Oneweb for these applications, which is partly owned by the British and French governments. ", "label": 0}
{"text": "My Lebanese friends love it when they see people defending terrorist group that has ravaged their country.", "label": 0}
{"text": "Didn’t Biden give the thumbs up to Ukraine to fire missile at Russian military bases across the border last month?", "label": 0}
{"text": "I can't speak to Ukraine's condition, but Russia pulling troops from North Korea is very telling of theirs.", "label": 0}
{"text": "Is that why they're there? They don't have the bodies to defend their own country while maintaining front line progress?", "label": 0}
{"text": "What are you on? Most Allied countries only entered the Allies *after* they got invaded by the Axis, before that they all claimed neutrality. It’s like you don’t have the first idea about our history.", "label": 0}
{"text": "oof!", "label": 0}
{"text": "Wasn’t there a patriot act for? Just nationalize starlink and kick the hell out of this freak.", "label": 0}
{"text": "It’s an autocracy where anyone who dares to challenge their leader l, even electorally ends jailed or mysteriously poisoned or fallen from a window.\n\nTheir male life expectancy is comically low, because of their violence and alcohol drinking habits.\n\nTheir infrastructure is a joke.\n\nThey’re the largest country in the entire planet and their GDP is smaller than Italy’s, and don’t get me started about per capita GDP, it’s like, a third of Italy’s.\n\nTheir per capita GDP is lower than Uruguay or Mexico’s.\n\nYeah they’re a 3rd world country with nukes, that’s it ", "label": 0}
{"text": "He hasn't gone anywhere yet with the use of North Korean soldiers, so you're jumping the gun, which is all I'm saying. The US is going to bolster support one way or another, and there are ways to do that without direct US troop action or new \"classes\" of interaction.", "label": 0}
{"text": "This article is coverage of the wsj article which has more information, which is the summary I've provided. \n\nPlease tell me where this summary is incorrect - I'll edit it if I'm wrong.", "label": 0}
{"text": "Ukraine hates russia more than poland, brother", "label": 0}
{"text": "I could fix this tomorrow. Just turn off the internet.", "label": 0}
{"text": "Have a source?\n\nRussia claims no conscripts are fighting in Ukraine, they obviously wouldn't lie about that or literally anything else... /s\n\nAgain, look up the word conscript. Yes, there are absolutely volunteers there, and I wish them harm; but, not everyone has a choice in being there.", "label": 0}
{"text": "Well, UNRWA's day of freely aiding Hamas is about to end and they brought this upon themselves by their action.", "label": 0}
{"text": "Let's again be fair, Australia's issues are nothing compared to China, which is actively committing genocide and brutally oppressing over a billion people while supporting some of the most evil authoritarian dictatorships across the globe.", "label": 0}
{"text": "Moscow and St. Petersburg are civilized...but outside of that you are basically in a 3rd world country...", "label": 0}
{"text": "Exactly, also, chip shortage means more profit. Remember, silicone is just carbon. The conflict is the tech.", "label": 0}
{"text": "It's just moms and kids in Gaza, and they only congregate in large groups, holding explosives.  That's why the numbers are so high.  Hamas wouldn't lie!", "label": 0}
{"text": "No P countries near Ireland, but there is a B", "label": 0}
{"text": "Dope then stop investing in housing", "label": 0}
{"text": "I'm curious what you think the Chinese response to Ukraine sending fighter jets over their territory would be, even if such a sortie were feasible.", "label": 0}
{"text": "Do you think the kursk attack made him scared? I don't believe it. I feel like it might be the result of a weakening grip of Russia over Belarus ", "label": 0}
{"text": "That seems not that bad. There used to be much higher figures than that.", "label": 0}
{"text": ">Remember him smoking weed on Joe Rogan? \n\nAnd doing that caused problems at SpaceX at the time.  He was basically forced to sit out all conversations regarding national security payloads.", "label": 0}
{"text": "I think it is opening a Windows in Belarus.", "label": 0}
{"text": "This", "label": 0}
{"text": "Gosh, wouldn’t that be a shame….anyway….", "label": 0}
{"text": "You ever play Battlefield?\n\nSometimes it just takes some careful flying, and suddenly anything is anti-ground", "label": 0}
{"text": "Do you agree that the indigenous people of Canada should be able to kill you and take your land, and that you are a terrorist?", "label": 0}
{"text": ">Let's again be fair, Australia's issues are nothing compared to China\n\nI absolutely agree with your comment.", "label": 0}
{"text": "I mean some still try it at the border, now imagine being half a world away. Im sure its very tempting even for the most loyal/fearful of soldiers", "label": 0}
{"text": "Housing supply will get to meet demand if you let it do it.", "label": 0}
{"text": "Why is it a bad idea? Because it looks like it's worth $10B+/year in high margin revenue.", "label": 0}
{"text": "Oh your guys are so annoying. No clue what NATO is but keeps posting about it. Pick up a book and read a out Nato (or Google it), but please stfu ", "label": 0}
{"text": "Aren't Ukraine's civilians AND government using starlink?", "label": 0}
{"text": "As an Israeli, this blanket demonisation is always hilarious to read. It's also why we don't give a fuck about opinions like these. What kind of discourse do you except to have when you vilify us to this extent?", "label": 0}
{"text": "Quite obviously, we can’t survive on a basic blue collar wage anymore (even more-so as a single parent family in Canada etc). So the illusion of some kind of “mad pursuit” of money by our out of touch leaders is what I was getting at.", "label": 0}
{"text": "It’s not like they’re forced into it they’re just able to apply if they’re a Palestinian born into naturalized citizenship from a country their family took refuge in. Holding citizenship isn’t even a disqualifier normally for refugees the only unique aspect is the inheritance to children", "label": 0}
{"text": "I mean that's true even without Putin's meddlings.", "label": 0}
{"text": "UNRWA and the UN are shit stains on society, and I'll back it up with source:\n\n[UN Teachers Call To Murder Jews, Reveals New Report - UN Watch](https://unwatch.org/un-teachers-call-to-murder-jews-reveals-new-report/)", "label": 0}
{"text": "Putin also rapes boys and courts neonazis ", "label": 0}
{"text": "All military applications would be encrypted.  It wouldn't matter if they were intercepted the russians aren't going to break that encryption.", "label": 0}
{"text": "And live in a Disney Princess fantasy world, ignorant of the fact that our military is recklessly endangering the entire world, thinking instead I am in some slick spy movie with awesome gizmos that will save us at the brink of destruction? Ignore the reality that one tiny mistake or glitch could end human civilization? I personally got a glimpse of that this month, after Hurricane Helene leveled my town. It isn't pretty. Here is what it looks like. No power or water. All major transportation routes destroyed. Complete loss of communications. No access to medical or emergency services. Fuel, medicine, basic cleaning supplies, food, and potable water all suddenly cut off. The threat of looting and violence by those taking advantage of the chaos. Sorry, but this experience has deeply affected my outlook going forward.", "label": 0}
{"text": "Sure do. Still assuming most of it is true since it wasn’t debunked.  Makes sense that Trump likes to get pissed on. He is a piece of human excrement.", "label": 0}
{"text": "Stalin said that \"quantity has a quality of its own\".", "label": 0}
{"text": "I agree, and just to put it in persepctive:\n\nThe various Smithsonians report that they collectively have [154 million](https://siarchives.si.edu/blog/how-many-objects-does-smithsonian-have) items. \n\nTo pick an art museum, the Art Institute in Chicago has [300K pieces](https://www.artic.edu/collection-information).  \n\nThe Houston Museum of Fine Arts has [80K objects](https://houmuse.org/institution/the-museum-of-fine-arts-houston/#:~:text=The%20MFAH%20permanent%20collection%20spans,of%20art%20from%20six%20continents.&text=On%20Thursday%2C%20admission%20to%20the,mfah.org%20for%20more%20information.), meaning that even Houston has more items than the Vatican. \n\nSo 70K items is actually a pretty small collection in the grand scheme of things. Which totally makes sense, because Rome has been sacked, pillaged, or conquered several times between the days of St Peter and the present.", "label": 0}
{"text": "NASA is relying exclusively on musk for their moon lander… and is planning on expanding its reliance on the private sector for much of its future\nCapabilities.", "label": 0}
{"text": "> Their infrastructure is a joke.\n> \n> \n\nWell, it depends. The quality of railways for example is still better than DB (German railways), been to both Russia and Germany and know it. Roads are worse than Germany of course.\n\nIt's an okay country. It's just a very large one and therefore there is a big difference between highest and lowest. But as long as you stick to not just Moscow but let's say major cities like Kazan, Samara or Yekaterinburg, it's not worse than Hungary/Slovakia at the worst. And these are EU countries.", "label": 0}
{"text": "It's definitely odd. I'll never fully understand it. I chalk it up to just how captured right wing brains have become in the age of social media. Up is down, black is white, New York real estate tycoons are working class good ol boys, and some people would vote for Putin if they could. Welcome to the 21st century.", "label": 0}
{"text": "Typical Republicans bend at the waste for their top Vlad.", "label": 0}
{"text": "Yup, haven't gone out in years.  Doing your own thing is kinda stress-free though.", "label": 0}
{"text": "We don’t another Hungary. Send them all to BRICS", "label": 0}
{"text": "Yes yes because in America we only care about how many dollars something is worth. Not how it effects literally everything else.", "label": 0}
{"text": "I don’t think you fully understand the charter of NATO.\n\n> …the Alliance’s creation was part of a broader effort to serve three purposes: deterring Soviet expansionism, forbidding the revival of nationalist militarism in Europe through a strong North American presence on the continent, and encouraging European political integration.\n\nhttps://www.nato.int/cps/en/natohq/declassified_139339.htm\n\nAllowing Ukraine into NATO satisfies all of these criteria perfectly.", "label": 0}
{"text": "Which military satellite systems were privatized to Space X?", "label": 0}
{"text": "I expect none of those North Koreans are supposed to make it home.\n\nThey're either killed by Ukraine in front or Russians behind.", "label": 0}
{"text": "It's not a position. Stop making it sound like Nato decided that just about now. It's an integral part of the alliance to not approve countries in active war. That has always been the case. ", "label": 0}
{"text": "Her husband is a Venture Capitalist.", "label": 0}
{"text": "Software and Hardware, the missiles patriot uses have been upgraded often.", "label": 0}
{"text": "France aint in five eyes", "label": 0}
{"text": "Lukashenko could be saying this just to ramp up the \"ww3\" narrative before the election", "label": 0}
{"text": "The gaming version of “is Pepsi ok?”", "label": 0}
{"text": "Not sure if this some ploy but it’s weird how vocal he’s been this week", "label": 0}
{"text": "Seems like this shouldn’t be permitted but it is because of his wealth, power, government contracts etc.", "label": 0}
{"text": "Fight, fight, fight, fight, kiss, kiss, kiss.", "label": 0}
{"text": "He was probably more focused on the violence kosovo saw from serbia", "label": 0}
{"text": "You're absolutely right but that not Musks fault and its most certainly not indictive of him trying to *hamper* the Twinesse from having access to Star Link.", "label": 0}
{"text": "That's probably the best answer in under 10,000 pages. ha, thanks.", "label": 0}
{"text": "Bélarus has more balls than the rest of Europe, who is obsessed with appeasing Putain.", "label": 0}
{"text": "I mean, he's NOT posting it on Warthunder. So that's already miles ahead of the OpSec shown by most kids in the military these days....", "label": 0}
{"text": "Isn't Belarus already a Russian puppet state?", "label": 0}
{"text": "https://www.reuters.com/technology/space/musks-spacex-is-building-spy-satellite-network-us-intelligence-agency-sources-2024-03-16/\n\n\nhttps://spacenews.com/pentagon-embracing-spacexs-starshield-for-future-military-satcom/", "label": 0}
{"text": "Guess he and Vlad broke up", "label": 0}
{"text": "Did you mean authoritarian?", "label": 0}
{"text": "It makes $10B/year because consumers want high speed internet in places they couldn't get it previously. \n\nStill haven't heard a reason on why it's a bad idea.", "label": 0}
{"text": "I don’t think you alone understand how it works, considering you pulled up a text as if that alone granted Ukraine immediate ascension today.\n\nIt’s such a shallow and bad faith argument that completely ignores reality.", "label": 0}
{"text": "Starlink covers the globe, but is not allowed to operate in all countries. Each country gets to decide whether or not they give permission for Starlink terminals and satellites to connect within their territory. \n\nStarlink, as a foreign owned satellite operator, is not legally allowed to operate within Taiwan. Russia asked that Starlink not be turned on over Taiwan, as a favour to China, although this is redundant because it's illegal for Starlink to be turned on, per Taiwanese law.\n\nIf, however, China attacked and tried to jam communications etc, Starlink would likely be the network of choice to provide connection, coverage and support Taiwan responding to the invasion. In this situation, the US DOD would take over control, in a similar manner to how they're administering the Ukrainian Territory instead of SpaceX proper.", "label": 0}
{"text": "That's the Putin / Xi quid pro quo", "label": 0}
{"text": "Well, I have traveled to a lot of places in both EU and Russia and you're wrong. It's not a 3rd world country in basically every large European city and Novosibirsk, Tyumen, Khabarovsk & Vladivostok in Asia. At the same time it's a 3rd world country if you look at rural Dagestan, or dare I say it, Tuva. It has a lot of different places, but all the big cities are mostly on the more or less good european level. I'd rather live in let's say Ekaterinburg than Marseille even considering the climate.", "label": 0}
{"text": "1630 dead russians.", "label": 0}
{"text": "Those satellites need to come down.", "label": 0}
{"text": "Really good analogy. Thanks for the perspective ", "label": 0}
{"text": "Says the billionaire ", "label": 0}
{"text": "Aljazeera is also taking IDF to ICC for this, should be interesting what plays out", "label": 0}
{"text": "Simple\n\nThey are jobs that often have to be done and have sets of rules and regulations. Plus are often carried out by skilled people and have pension plans etc.\n\nPregnency not something society needs (it happens anyway) and can be misused.", "label": 0}
{"text": "This made my day \n\n#self regulating problems", "label": 0}
{"text": "win-win for north korea\n- those that die: less mouths to feed\n- survivors: much needed combat veterans in an army that hasn't fought a war in a while\n- they build rep with brics", "label": 0}
{"text": "victim blamer", "label": 0}
{"text": "Even the freaking Queen of Jordan qualifies as a Palestine refugee. (Note: UNRWA also helped Jewish refugees of the 1948 war, but once they became Israeli citizens, they ceased being refugees. the non-Israeli Palestinian Arabs who are now citizens of Palestine \\[per claims\\], Jordan, or Syria should not be refugees, and would not be anywhere else. )", "label": 0}
{"text": "BRICS will never work. The true alliances in today's world is dominated by the sole global superpower, that is USA. While on paper NATO/G7 are alliances, it's US that carries the momentum and power of those groups. No player in BRICS today is as strong as US. Until that happens, the alliance isn't going anywhere. Best India can and will do, is stay out of this alliance game and do business with everyone. Sort of like Switzerland during WW2.", "label": 0}
{"text": "War is expensive.", "label": 0}
{"text": "Thank you for this info, I was wondering how all of that played out.", "label": 0}
{"text": "It is troubling hearing the reports that Elon is not entirely above board with starlink contracts. There may be more finesse being applied here than foreign influence but it's a poor apperance to many.", "label": 0}
{"text": "Sweden was asked to postpone giving JAS-39 Gripen planes to Ukraine. Though it was ready to give them to Ukraine before any other country.", "label": 0}
{"text": "Yes, after Ukraine asked Musk to turn on coverage to Crimea and he declined stating that Starlink should not be used offensively, the DOD signed a contract with SpaceX. This contract covers the costs of operation, 500+ terminals a month to Ukraine and the control over where in Ukraine Starlink operates.\n\nHaving a US Citizen decide whether or not an attack takes place in a conflict of national interest has the potential to pose significant risk to the individual citizen, their family, their company etc. They also have no authority over the citizen due to them being excluded from the chain of command. By instead incorporating the control of Starlink in Ukraine, SpaceX has plausible deniability because they cannot refuse the command due to contract.", "label": 0}
{"text": "False", "label": 0}
{"text": "I didn't say anything about putting US troops in Ukraine. I said there's only so far Putin can go with his nuclear threats before the US is going to allow Ukraine to escalate as much as they want to.  How am I jumping the gun? What are North Korean troops being sent to Russia for? That's adding more foreign troops onto Ukranian lands when they're done training.", "label": 0}
{"text": "Dictators cannot live in peace. Your average human would give people like putin the finger", "label": 0}
{"text": "If you want to read his teachings, just go read Ivan Ilyin instead,  Dugin plagarised most of his ideas from Ilyin", "label": 0}
{"text": "Hamas was well prepared and armed, so Putin is likely the prime beneficiary of the Hamas attack on Israel. He wanted to take the world attention away from Ukraine and also exhaust America. I hope we go full throttle after the election and allow Ukraine to hit inside Russia. This Russian evil must be removed.", "label": 0}
{"text": "Why now? What compelled you to post this truly original thought? ", "label": 0}
{"text": "We are the wardens to our own prison", "label": 0}
{"text": "\"We are too hierarchical and rigid, people need more freedom\"\n\n\"Let's order them to be more free, surely that will work\".", "label": 0}
{"text": "Right, so you’re just going to ignore the trillions of dollars required. And you think you can just pop out triple the engineers and architects in uh 3 years? Not like an undergrad and grad are 6 years total on top of a few years of on the work experience to get licensed. 😂\n\nClearly you are irrational like the liberal party.\n\nA sensible thing would have been to grow the construction industry by 5-10% a year, and increase immigration alongside it. You know - small, incremental growth that is rational.\n\nInstead the liberals were irrational, assumed you could produce 300% the amount of housing - and now that that did not work, as predicted - they are getting kicked out of office. They are likely the most incompetent government this county has had.", "label": 0}
{"text": "There is little room in Lukashenco's heart for anyone but Lukashenko.", "label": 0}
{"text": "I have travelled to a lot of European countries and Easter European...I stand by my statement sorry", "label": 0}
{"text": "Agreed. America was literally “America first” until Pearl Harbor. If Japan hadn’t done that, we may have never entered the war — it was happening in Europe, and America has enough resources at the time that intercontinental trade was helpful but not required.", "label": 0}
{"text": "Politics will find a way to praise this while condemning Israel for the same thing.", "label": 0}
{"text": "To play devil's advocate.\n\n\nI'm not sure I'd wanna give 51% stake in a region away as well.", "label": 0}
{"text": "Have you traveled to Russian cities though?", "label": 0}
{"text": "Someone tell me how Trump will somehow be \"tough\" on China imwhen his dom is telling his dipshit buddy to not provide Starlink to Taiwan", "label": 0}
{"text": "WeStErn ImpEriaLiSts\n\n\nMeanwhile NK troops fight for white imperialists ", "label": 0}
{"text": "Was that a reply to my point? Because it doesn't look that way. ", "label": 0}
{"text": "Imagine that; Musk going to prison or not is on the ballot", "label": 0}
{"text": "They had 90% taxes back in the day.   It's why so many of the robber barons built libraries, opera houses etc.   They would rather get the tax deductions than give it to the government.   Plus the ego boost.", "label": 0}
{"text": "He is pretty much the buffalo bill of russia.", "label": 0}
{"text": "Basically, they will return to NK in neat rows. Except they will be inside neatly lined up boxes.", "label": 0}
{"text": "Talk is cheap. Excommunicate all billionares who claim to be catholic.", "label": 0}
{"text": "I'm curious why you think SpaceX isn't ahead of the game currently and/or wasn't in the past decade?", "label": 0}
{"text": "This is pretty much to drag the rest of the world in it. NK troops die or get captured and they’ll treat it as their nation is attacked.", "label": 0}
{"text": "It's probably not the people, but rather the bots that changed.", "label": 0}
{"text": "The same Musk responsible for ending reliance on Russian rockets? The Musk who donated masses of Starlink terminals to Ukraine at the onset of the war?\n\nThat man may be many bad things, but suggesting he's some kind of Russian puppet is ridiculous given his track record", "label": 0}
{"text": "I' pretty sure he's already signed an agreement with Putin for eventual integration with Russia.\n\nBasically becoming part of Russia in all but name.", "label": 0}
{"text": "We will see where the investigation takes us, especially since musk seems awfully afraid of going to prison if Kamala is elected....\n\nhttps://www.pbs.org/newshour/politics/what-to-know-about-elon-musks-reported-phone-calls-with-putin-and-why-it-matters\n\nAlso, supporting a candidate that tried to coup the government is more than just a \"candidate you don't like\".\n\nHe's a fascist.", "label": 0}
{"text": "Yes considering that German foreign politics is always coordinated within the EU. This will be expensive for Europeans and Americans alike.", "label": 0}
{"text": "https://www.reddit.com/r/worldnews/comments/1gc0x7l/north_korean_troops_have_entered_kursk_combat/\n\n\nLazy child. ", "label": 0}
{"text": "Russia isn't Christian,  It just pretends to be. Its just a flag to rally behind, for them to say that they're just, that they're right.\n\nits the same reason they label everyone who is at odds with them as Nazis.\n\n  \nIts a national victim complex stretching hundreds of years,  Imperialist, Warmongering, Genocidal nation can't fathom that half of Eurasia hates them for the crimes against humanity they've inflicted on tens of millions of people.\n\nEasier to say everyone is a Nazi / Fascist / Satanist / Homosexual Globalist.\n\nOh and lets make this clear, Russia is Fascist, no two ways about it.\n\nAnd if I'm thinking of Satanists, the first people Im thinking about is people like the Russian Army, people who have nothing but contempt for human life.  Torturing and murdering people just like the SS did.", "label": 0}
{"text": "Sycophantic fuck", "label": 0}
{"text": "Was it an anti-tank missile that killed them?", "label": 0}
{"text": "This mofo would sell his own mother for a few dollars.", "label": 0}
{"text": "Sounds like Russia needs to learn from the Austria-Hungary empire then", "label": 0}
{"text": "lol why not just assert that Russia is creating the hurricanes to destroy America", "label": 0}
{"text": "I mean you say that like he is in some sort of a defensible position, Russia is already there with their troops and the nukes give them an absolute excuse to take over whenever they want. He is going to be killed by Russia when they want him replaced and either it will be peacefully in his sleep or \"the west murdered him\" and either way Belarus will be annexed. The best that can be said is that he managed to hold onto power by sacrificing an entire country.", "label": 0}
{"text": "It might be, but it's still concerning to say the least. \n\nNo doubt however, the three letter agencies are on top of this and tackling the issue.", "label": 0}
{"text": "> NASA is relying exclusively on musk for their moon lander\n\nSure. And this won't work. This is a stupid decision dictated by NASA budgetary constraints.\n\n> and is planning on expanding its reliance on the private sector for much of its future Capabilities.\n\nSure, but it is not exclusive to SpaceX. If only boeing wouldn't fuck up Starliner so much…", "label": 0}
{"text": "So they are allowed to have private meetings with foreign governments as long as they say no confidential information was shared?\n\nHe could literally walk up to China, tell them everything in a private meeting, and as long as there is no spy in the room, the government would just say meh whatever?  Probably just discussing bird law?", "label": 0}
{"text": "Yes, when you enter into negotiations it is most certainly with the assumption that both parties will be obeying the law. Suggesting what you are is insane really.", "label": 0}
{"text": "I feel better already 🤣", "label": 0}
{"text": "I'm also for allowing Ukraine to do that, but I'd like to argue why the west is against it and It's not without merit.\n\nWhen NATO was attacking Serbia, they had complete air superiority and destroyed 10000 targets. When US attacked Iraq they destroyed 40000 targets and still had to use personell on the ground to defeat them.\n\nThe reason west might be against using long range weapons is because it won't achieve anything. Ukraine received what, 200 storm shadows? How many more long range missiles they have? They could attack deep in Russia but the damage they could do would be far too low to change anything.\n\nStill, I'd like them to be able to do that, but unfortunately even if they did, I don't think it would change much for them.\n\nMaybe there will be some new development on that front due to presence of North Korean troops.", "label": 0}
{"text": "True", "label": 0}
{"text": "I don’t like Trump or Elon but people are insane acting like they are “traitors.”  Really tired of this election season bullshit.  \n\nElon has cited a lot of reasons as to why he’s changed parties… the transgender issue has been a huge one, his increasingly negative view on California progressivism and anti-business hostility is another big one.  \n\nNo one has to agree with him on either of these.  \n\nI’m certainly waiting eagerly for Trump to be gone so we can see a new version of the Republican Party.", "label": 0}
{"text": "I mean where do you think this story came from? They literally cite government officials as the source, and if Elon isn’t broadcasting these conversations then there’s only one other way they’d be aware of them. \n\nWhich is obvious. I’m sure every call between top Russian officials and anyone, including American citizens thanks to the Patriot act, is automatically spied on. \n\nHonestly it makes it feel a bit like a non story. If there were anything actually nefarious talked about then they would take away his clearance. They even say in the article he hasn’t discussed anything he shouldn’t but the US government officials “don’t love it”. Similar to Reddit it would seem.", "label": 0}
{"text": "> North Korea asks population for donations to war-ravaged Kursk\n\nAnalogous enough.", "label": 0}
{"text": "Dipshit’s gonna dipshit", "label": 0}
{"text": "\"Pandering Marionette\"... I love this phrase!", "label": 0}
{"text": "Thanks for that! I just summarised the original wsj article per what it mentions and only added the tiny bit of opinion at the bottom, to avoid diluting what is reported.", "label": 0}
{"text": "Oh, it’s hella naïve. Occasionally I like to pretend like world leaders have the conflict resolution skills  and naïvety of 5-8 year old children when I read the news, to see if it passes the underdeveloped brain check: does their actions make sense if framed as the actions of a 6 year old who knew what the world leaders knew and had those resources. \n\nUsually, it’s been passing. That is to say, our world leaders choices do seem like the choices adolescent children would make.", "label": 0}
{"text": "Law is written to protect the wealthy. That never changed and nothing will really change, unless we decide one day that it would be good to have fair law for everyone. Money should not decide about who's going to jail, but in reality it doesn't work like that, because there are ways in which money gives advantage.", "label": 0}
{"text": "They still do meth it's just called Adavan now iirc", "label": 0}
{"text": "Yes, the story is that was agreed to avoid Russia using nuclear weapons when they were getting caned.  Now it is tied up with the election looming.", "label": 0}
{"text": "I'm just saying your right about having to work to make the time because I do agree with you on that.  We have common ground there, and I wanted  to acknowledge that.", "label": 0}
{"text": "It would if I find a trustworthy source.", "label": 0}
{"text": "Kimchi.", "label": 0}
{"text": "I'm sure Garland will take a peek outside his turtle shell, look around, say everything is fine, and then get mad at whoever woke him.", "label": 0}
{"text": "No-one is _very high_ and *likely* is _unlikely_...", "label": 0}
{"text": "Now *that’s * someone I want to vote as president!!! /s", "label": 0}
{"text": "They’re just being clowns at this point", "label": 0}
{"text": "Yeah, OK machine!", "label": 0}
{"text": ">The medical organization Doctors Without Borders said that one of its staff members had been killed in the Israeli attack on Khan Younis. It said that 41-year-old Hassan Sobh, a father of seven, was its eighth worker to be killed in the past year of the Israel-Hamas war.", "label": 0}
{"text": ">Musk reportedly wants Taiwan to change its laws to allow SpaceX to have 100% ownership of the Starlink operations in Taiwan.\n\n>Taiwan's regulations require telecommunications joint ventures with foreign companies to provide local firms with a 51% majority ownership of the venture.\n\nYeah, no shit he is refusing that deal.\n\nIf he starts selling parts of Starlink to foreign countries the entire business model with Starshield likely will fall apart.", "label": 0}
{"text": "Not so secret now", "label": 0}
{"text": "Taiwan law prevents spaceX from operating in the country because they require 51% ownership of Starlink. The idea that Elon is getting his marching orders from Putin is a disgrace on journalism and clearly an attack by the Democratic Party.", "label": 0}
{"text": "He also mentioned how partisan the Biden Administration has been against him and his companies. When they held the EV summit and Biden praised Mary Barra for leading the way on electrification - which Tesla was not invited to - is fucking wild. \n\nTalk about partisanship. \n\nDefinitely believe this is Musk angling to be a megadonor, influencer over the future of the Republican party. If this is true, and Musk stays true to his previous endeavours, we could see a Republican party that supports EV transition, climate change and space exploration. While also maintaining it's more core principles of small government and less regulations. \n\nIf I was American, I'd be a democrat, but even to me, that sounds mildly appealing, depending on who is running from the left.", "label": 0}
{"text": "Tomorrows headline: “Lukashenko falls out of window”", "label": 0}
{"text": "Trying to attack the messenger is a poor argument.", "label": 0}
{"text": "We are at war. Simple as that. Might not be bullets flying at us, but campaigns of misinformation should be considered acts of war. Especially if it affects the entirety of a nation. The people are affected...the people will come shoot you now. Congrats Russia, you sealed your fate,your end is near. \n\nThis should be the understanding.", "label": 0}
{"text": "it's a rethorical question for pashazz.....", "label": 0}
{"text": "Merrick the Meek", "label": 0}
{"text": "I don't think the US resistance wouldn't be there. The US economy relies on the region for Semiconductors and more. A regional war would decimate the global economy, which would be under Trump's/Republican's administration. Then you'd have the \"Weak America\" theories which would also hurt the Republican image. \n\nHonestly, I think the US would get involved even with Trump. Not because he wants to, but because he has to. Still hoping Harris wins.", "label": 0}
{"text": "That is a weird take.  Why are you being weird?", "label": 0}
{"text": "That's good\n\n\nWhen a fascist complains about puppet governments it means whatever leader they're complaining about isn't a fascist or at least uncooperative with them", "label": 0}
{"text": "Good for him.", "label": 0}
{"text": "No kidding.  They say Musk would be put in charge of the regulatory agencies somehow.", "label": 0}
{"text": "Problem is without space x the us space industry is pretty weak right now. Boeing can’t get a crewed capsule to the space station and back without a problem. ULA is for sale because it unprofitable and behind. Blue origin, Bezos toy, is years behind schedule. Space x neutered Russian space power and made the hill near impossible to climb for China. ", "label": 0}
{"text": "he's going to fucking jail", "label": 0}
{"text": "SK might be concerned about the military hardware Russia provides to NK in exchange for its “services”, though.", "label": 0}
{"text": "Puddeern? Hmm...", "label": 0}
{"text": "What are you talking about, NS2 was canceled and Germany just recently got 200 billion passed for military spending. What exactly is Germany doing that’s pissing off Americans?", "label": 0}
{"text": "He would basically be my favorite president ever if he did that, but there's a near 0% chance it happens.", "label": 0}
{"text": "Do you think the three letter agencies aren't good at their jobs? The concept that Musk is somehow this foreign spy/agent/operator/supporter of foreign governments and the US just hasn't caught on requires so many negative assumptions about the government that it becomes improbable very quickly.", "label": 0}
{"text": "There is, especially in the far eastern regions. And varied sauerkraut is abundant pretty much everywhere.\n\nSo lack of kimchee is the least of their problems.", "label": 0}
{"text": "Why isn't he fucked \\_now\\_?", "label": 0}
{"text": "Only if we get lithium in return =)", "label": 0}
{"text": "Examine what actually happened in the past 5 years and why.\n\nThe UAW started a smear campaign around 2015... and Biden is heavily in bed with the UAW.\n\nLook through Biden's actions and how that is caused big problems for the US solar installation industry.\n\nLook at the lies spread by prominent democrats like Sen. Warren and Sanders.\n\nAnd then look at what Musk is trying to accomplish and has been doing... this isn't that hard to untangle if one actually wants to follow the actions and remove the inflammatory political rhetoric.", "label": 0}
{"text": ">The US military is so far behind in technology it's not even funny\n\nYeah, it's also plain false.\n\nUsing contractors **is** the point. The US military had **always** relied on contractors for tech, to the extent that they are effectively a part of our defense. The US military **is not supposed** to develop its on tech **unless** there's no other alternative available.\n\nContractors, historically, have been seen as a **good thing**: the government isn't \"mismanaging\" the money by doing its own thing, instead, the money \"trickles down\" through defense contractors to the population, creates jobs, etc.\n\nYeah I know it's a load of BS. But F-35 and F-22 aren't developed by the US military. None of US's warplanes are, or have ever been. US contractor tech **is** US military tech, by design of our fucked-up system.\n\nElon Musk is throwing a wrench in that, because *somehow*, we can't deal with a contractor acting as a foreign agent.\n\n>Our military directly building a starlink-like system is just not gonna happen any time soon.\n\nIt was supposed to happen **never**. The entire trend of space programs in the US was: let the private contractors do the work, the government's job is to *govern*, and that means selecting the right contractor. \n\nYes I know it's a libertarian fantasy that is very clearly being proven wrong by means of a shiny eXample. \n\nWhich is why I am thankful for Musk, in a way. He remains a manageable problem, and is sociopathic enough to have **everyone** understand that he **is** a problem.\n\nA smarter Musk that maintained the benevolent-tech-genius appearance would not be raising any flags, while causing more harm. \n\nAn actually **smart** Musk would realize that if the people he props up succeed, a wealthy and powerful billionaire would be the last thing they want next to them. There's no Musk in Russia. There used to be oligarchs (like Berezovsky) with science background, and they are dead now, and their assets \"redistributed\".", "label": 0}
{"text": "Tell that to Trump", "label": 0}
{"text": "They aren't going to know what the hell to do. They are going to be told but stulk their instincts just aren't going to be battle hardened and they are going to be thrown straight into the front line.\n\nThe question it whether Russia is conscious of protecting as much as possible under strict orders to not hurt their NK relationship or whether they will use them as fodder.", "label": 0}
{"text": "We have to wait for someone to commit a crime before we arrest them? Yes that's how that works. \n\nYou realize you just said that right?", "label": 0}
{"text": "Why so sensitive to a mistake?", "label": 0}
{"text": "I find it ironic how Meloni criticizes Soros for allegedly engaging in shady deals to control everything, while she's best friends with Musk, who’s openly doing exactly what she accuses Soros of.", "label": 0}
{"text": "> \"They're going to be working on this,\" he said of Brussels in a radio interview on Friday. \"They need a puppet government. Let's speak plainly, every empire is like that. The Soviets were like that, weren't they?\n\nSeems like he's trying to thread a needle of bashing the EU & Russia at the same time; a super niche position to take. I wonder what he thinks of China.", "label": 0}
{"text": "Whatever makes you feel better at the end of the day", "label": 0}
{"text": "Nah. There is another way. Realistically, it's the **ONLY** solution. Unfortunately, we're going to enact it in the worst, most heinous way imaginable.  \n\nAnd that way is to reduce the *quantity* of life. We could have fewer kids but it would crater the economy, among other things, so it's about as realistic as reducing quality of life.  \n\nThat just leaves war, famine, and all other manner of grave routes to reach that destination. My only hope is we'll reach that point before it starts to truly runaway, independent of human activity.  ", "label": 0}
{"text": "What day is imminent?", "label": 0}
{"text": "EU exists", "label": 0}
{"text": "Kimchi Hu?", "label": 0}
{"text": "With Guterres at the helm, these guys are more likely being hired purposefully…", "label": 0}
{"text": "What? No, that would also be unreasonable", "label": 0}
{"text": "I'm not saying he's a puppet. I'm saying he's a dupe. Like I said, Russia can figure out Starlink after Trump gives them Ukraine.", "label": 0}
{"text": "why would anyone ever believe Putin?", "label": 0}
{"text": "You're missing two thirds of the CIA concept.", "label": 0}
{"text": "Poland must be getting to Putin's nerve.", "label": 0}
{"text": "What’s that have to do with NVDA selling chips to TSLA?  Maybe you replied to the wrong comment?", "label": 0}
{"text": "Social democracy. Use capitalism as the engine but keep government strong as the breaks. They will keep balancing each other if you do it well, and everyone benefits. It’s only a problem if you have too much of either and the whole system becomes dangerously imbalanced.\n\nCapitalism is *absolutely* bad all on its own. It’s literally a pyramid scheme that ultimately funnels all money to the very top. If not for taxes and laws (”socialist government”), no money would ever go any other direction than into the pockets of business owners. Capitalism unchecked is every bit as horrible as communism. It just has better PR.", "label": 0}
{"text": "You posted, \"What Russian disinformation is calling Musk a traitor?\"\n\nThat would be you.", "label": 0}
{"text": "Bollocks, never gunnna happen", "label": 0}
{"text": "or 2 years who knows", "label": 0}
{"text": "If you have anything related to the message and can argue the points, then please go ahead.\n\nOtherwise, your attacking the messenger is nothing but trolling.", "label": 0}
{"text": "the companies definitely should be inspected, but currenty i not for a seizure of them. give them the ultimatum of losing all contracts or removing musk. if there are more links to foreign agents other than him or corruption. sure, begin the process.", "label": 0}
{"text": "I don't think starlink is really cutting edge tech though is it? It's more of a logistical problem than anything else.\n\nAnd if there is one thing the US military does well, it's logistics.", "label": 0}
{"text": "You cant reason with these people, IDF is the most moral army in the world and the only reason they kill, torture and rape their enemies, use human shields, commit countless war crimes, is because of Hamas and Hezbollah or it was actually Hamas and Hezbollah who did it", "label": 0}
{"text": "Vice President doesn't have any power. They break ties in the senate.", "label": 0}
{"text": "trump's best mate", "label": 0}
{"text": "Uh the Americans backed the Chinese in WW2? Wtf are you on about?", "label": 0}
{"text": "What a stupid edit.", "label": 0}
{"text": "It’s shit thought lmao. You think starlinks importance and growth is because of marketing…. It’s a world class product that is miles ahead of anything else.", "label": 0}
{"text": "Hezbollah has popular support in the Shi’a southern region of Lebanon. They even represent the confession in Lebanon’s parliament. \n\nThey are a minority in the whole country, but they are quite powerful and present in their base region.", "label": 0}
{"text": "Embargo on Musk!", "label": 0}
{"text": "Can’t wait for Elon to say this was his master plan for space x and get an insane amount of funding and then it always being ready in “the next couple years” until the world burns.", "label": 0}
{"text": "You might hope. Or he just playing a game Putin told him", "label": 0}
{"text": "Huh? It's an honest question. I don's see Russians calling Musk a traitor. It doens't make sense.", "label": 0}
{"text": "Wtf? I thought they were holding hands", "label": 0}
{"text": "There is no ethnic cleansing going on.", "label": 0}
{"text": "I think the simplest move is just to openly say Ukraine can/will join, which means NATO is formally supporting Ukraine.\n\nJust be clear that Article 5 will not be invoked as hostilities began beforehand.\n\nIt's a half measure, but I'm not sure what other option there is. Putin specifically invaded Ukraine when they were seeking EU/NATO entry, and by NATO refusing to accept Ukraine, it sends a signal to Putin and others to make their moves now.\n\nOn the flip side, it did convince Finland and Sweden to join NATO, because they both realized they could be next.", "label": 0}
{"text": "Not fighting?  You mean can't fight against dollar.  :P", "label": 0}
{"text": "I don't what's better...how great he was in that role, or that he wrote all the lines himself.", "label": 0}
{"text": "When did the church become OK with banks and lending money? Kings and Queens used to have Court Jew do deal with that kind of thing?", "label": 0}
{"text": "Maybe not destroy it. Plus theoretically he could be pushed out and shotwell could lead, but it would be kind of dicey precedent. ", "label": 0}
{"text": "Musk received DOD contracts, clearance and so forth well after that meeting, which should have uncovered anything of the sort. US three letter agencies are very good at their jobs, somehow implying that Musk has slipped under their radar for the last 22 years requires a lot of things to go right/wrong that quickly become mathematically improbable, bordering on impossible.", "label": 0}
{"text": "I only know about \"Finger pinching conspiracy theory\" from Korean video games", "label": 0}
{"text": "True, but there's also a lot of imbeciles supporting russia. \nFor example, eastern Germany is basically split 50-50 between pro russian and pro European voters.", "label": 0}
{"text": "Funny how military takes my honing pigeons and refusing to can criminalized me heavily, any homing pigeon with set skills will and is military US property and they can take it and or I have to use it for their needs or I am criminalized, but Elon can do w.e he wants with his satellites and nothing happens...", "label": 0}
{"text": "The Day That Never Comes", "label": 0}
{"text": "Lol\n\nReminds me of that funny fight scene from 21 Jump Street 2", "label": 0}
{"text": "Musk has absolutely no obligation to oblige to Taiwanese law saying he must be forced to give up a majority stake in his company in order to operate in Taiwan.  \n \nYou're so desperate to try and paint this as Musk having some ulterior motive to try and prevent Taiwan from having access to Star Link when in reality it's just a business decision, a smart one at that.  \n\nInsanity is you actually believing that 200 billion dollar company like SpaceX should give up majority ownership to a foreign country because said foreign country says so.\n\nI get it ,you don't like Musk but no matter how hard you try to push this towards some bullshit anti Musk rediorct it's just not going to work, deal with it.", "label": 0}
{"text": "For those who are unaware - the day that Yahya Sinwar was eliminated, UNRWA put the black ribbon back up on their Facebook page, as a symbol of mourning.\n\nThey also are trying to imply taking credit for the polio vaccine being given to Gazan children, which is laughable because they had absolutely nothing to do with that.", "label": 0}
{"text": "Actually, Taiwan have been building low orbit satellite infrastructure and have linking/working with SES and OneWeb. They don't require control over all of Starlink and its satellite. They just want control over the parts in Taiwan. They're fine with OneWeb owning and controlling their satellite. Just as long as the control stations in Taiwan are ran by local.\n\nI think around 700+ stations for SES and OneWeb were built in Taiwan, all operated by Taiwan.", "label": 0}
{"text": "I kinda was under the impression that they already had annexed Belarus and installed Lukashenko as a stooge president.\n\nDid I completely misunderstand that situation?", "label": 0}
{"text": "> That ~~headline~~ comment is so misleading it’s bordering on incorrect.", "label": 0}
{"text": "Can you explain how he is the government? I'm not sure how leading a car/robot company, a space company and social media suddenly equates to the government.", "label": 0}
{"text": "You think the US government gives contracts as charity? SpaceX is 10x more efficient than NASA ever has been…", "label": 0}
{"text": ">Today() + 6 months away.\n\nFTFY", "label": 0}
{"text": "The US needs to stop being the primary funder of this sham organization ", "label": 0}
{"text": "There goes being a colonel in the russian army i guess", "label": 0}
{"text": "Elon probably has more security clearances than most heads of these federal agencies. To assume every single call and text he makes isn't being read by the NSA or whatever is ignorant beyond belief. As usually the anti-Elon stuff is just political gesturing wasting everyone's time.", "label": 0}
{"text": "I mean it's stupid (who wants to get paid in gold instead of dollars?) but the US didn't invade Iraq because of his stupid goldbug ideas", "label": 0}
{"text": "The Govt needs to figure this shit out and fast. Musk has his hands in national security issues.", "label": 0}
{"text": "That's why he and Trump are best friends.", "label": 0}
{"text": "No, if u stop the idf then the killing of jews resumes.", "label": 0}
{"text": "So, in short, even if the problem (lack of a state) has been resolved, you still get the status.", "label": 0}
{"text": "can we finally cancel musk, please?", "label": 0}
{"text": "It was only a courtesy one.", "label": 0}
{"text": "Jeez EU… can’t you just get rid of this sack of shit? I mean, C’mon!", "label": 0}
{"text": "Not really. It is a matter of political will. Given that all the countries have to agree that political will needs to be widely shared. Or put another way they are so threatened by events that they decide this is the way to go. Of course that is one way to do it. If NATO felt threatened they could just enter the war if they all agreed as well. Before someone starts the \"they haven't attacked NATO yada yada bit\", an attack is in part a political decision. Drones hitting NATO can be used as justification if the countries desired to do so. Or they can not be used that way. But at the present time the perceived threat to NATO appears to be such that neither of these options is desirable at the moment. That could change, but I am not saying it will or is even likely that will change. But if somehow things aligned in the minds of each NATO member that a course of action should be taken they do have these options. But admittedly that would need to be a remarkable political alignment of minds so practically speaking you are right. I mention this last point because I don't want to appear argumentative, not my intent.\n\nBut I can think of scenarios where one of the two options above results in NATO action. A nuclear strike in Ukraine with radiation wafting into NATO territory is one that has been openly mentioned by NATO states as justification for action. Although in that case option 2 would happen, military intervention. Following that Ukraine would end up in NATO most certainly.", "label": 0}
{"text": "I did read it what am I missing? I read that they are threatening him. Of course they are. Hard to bribe the richest guy in the world, right? They are using both bribes and threats and other means to control various republicans depending on their willingness and situation. \n\nRussia, has bought most if not all of the Republican party. Purchased, threatened, manipulated cuz dumb. But put under their control. This is Russias LAST CHANCE. If Trump loses, they are done.", "label": 0}
{"text": "Iran is hiding something, the government is really unpopular and maybe they have bigger issues to deal with internally. Something that isn't public yet.", "label": 0}
{"text": "It should be nationalized and his ass deported at the least.", "label": 0}
{"text": "People like you is what enabled Hitler as well. Stop watching all the propaganda and start asking the people involved in the conflict.", "label": 0}
{"text": "Matters fuck all when a Musky turd can turn off the satellites because he got triggered.", "label": 0}
{"text": "It's promoted on Reddit. It's a given 😂", "label": 0}
{"text": "Does it matter? Is it more or less lawful than invading a sovereign nation? I feel like these reports are so meaningless.", "label": 0}
{"text": "I believe he's confused about the Japanese American internment camps.\n\nWhich is widely believed to have been a terrible and inhuman thing to do.", "label": 0}
{"text": "1, they're already paying a huge amount for the cost of recall. 2, this obviously wasn't done intentionally. 3, if you put a severe punishment on mistakes, then companies will focus on hiding them instead of doing a recall.", "label": 0}
{"text": "Because Elon is Putins useful idiot", "label": 0}
{"text": "Musk, did what NASA could never do. They’re jealous and butt hurt.", "label": 0}
{"text": "I didn’t know about this lol", "label": 0}
{"text": "Not parts of Starlink. Just a local taiwanese company that operates the ground station in taiwan. Satellites can 100% be own and ran by non-local company, as seen with deal with OneWeb.", "label": 0}
{"text": "But if they rely upon Starlink, and then Musk decides to turn it off, that's a bad situation to put oneself in. So:\n\n>Starlink should be banned from all military applications, ultimately it can’t be trusted.", "label": 0}
{"text": "poles + lgbt+?  sounds like a nice combo :)))", "label": 0}
{"text": "I don't understand, why would they need to vote on a new bill to handle people who are already breaking existing laws? Shouldn't law enforcement agencies just enforce the law? If the agencies won't do it, than what's the point of making laws at all?", "label": 0}
{"text": "Greece and Turkey had disputes on eachother even", "label": 0}
{"text": "[Contradiction is Truth!](https://www.youtube.com/watch?v=paqaBT6PWlA)", "label": 0}
{"text": "They should have been dissolved a long time ago.  My understanding is that UNRWA was supposed to be a temporary project, it was supposed to help Palestinians get back on their feet.  This was not supposed to be a fixture for 70+ years", "label": 0}
{"text": "Yeah I read it. I’m skeptical that if space x is designing, building, launching them, and assuming maintaining/servicing/supporting them, then do they really own them? Look at tesla cars.", "label": 0}
{"text": "The way he's trying to distance himself makes me more nervous about what Russia is planning in the near future.", "label": 0}
{"text": "The US doesn't really work like that. The NSA probably considers the conversations between Musk and Putin so incredibly valuable that they let them continue. Once the conversations dry up anything he said that was against the law would end up in front of the FBI. Since someone leaked this info to the Wall St Times you can bet your ass the government is getting ready to prosecute. I'd run to a non extradition country if I was Musk. That said SpaceX will be fine he doesn't run it. The FBI will see if he or anyone else gave information to our enemies and if they did its prison time.", "label": 0}
{"text": "DB is low bar. Nothing works.", "label": 0}
{"text": "he just says whatever people tell him, he has no fucking idea and his only guide is whether a person kisses his ass or is an enemy", "label": 0}
{"text": "You know the next gen weaponized quantum computer race between the US, China, Russia and the EU is going to fundamentally change the nature of information warfare and cryptographym? \n\n\nWhoever reaches that quantum computing threshold first is going to have the entire data of everyone else. It would be akin to developing atomic bombs for the first time while your opponents still use conventional ordnance. ", "label": 0}
{"text": "Yeah because the men women are around are incredible. Women are the best judge of character and just autosort. Men should be morally judged on how alone they are. They failed everybody and should be hated", "label": 0}
{"text": "Wasn’t this dude supporting Russia earlier on?  Unbelievable….", "label": 0}
{"text": "The U.S. was not invaded by Germany yet entered the war.", "label": 0}
{"text": "I think PKK is a terrorist organization, but there are still countries that don't recognize it as such", "label": 0}
{"text": "Which terrorist group, Israel or Hezbollah? Because they are both to blame. As I said, I do not support Hezbollah at all. They ruined Lebanon economically and politically. But it is quite obvious and clear how and why they formed. What they have done from their founding until now, has made life horrible for everyone in Lebanon and Israel. As I stated, my response was to why they were founded and to explain why they hold the position they hold. If your neighbor used your house against your will for 22 years, you wouldn't just pretend that they were a fantastic neighbor after they announce that they will stop using your house against your will. Nor would you just ignore them and pretend that they won't do that again. It is human nature to then live in fear of that and prepare accordingly. The problem is that Hezbollah used that fear  on the Shia Lebanese who lived near the southern border to garner control of their vote and to continue to rise to power, and use that power to become the political party running Lebanon, directly and indirectly, and causing a multitude of issues in Lebanon domestically (how can you have an army when there is a political party who is the militia?, or how can you invest in the economy, when a political party controls the access to ports, airport, and some of the neighboring countries.  \n\nMy Lebanese friends love when they see people defending Israel who has been the only foreign entity to enter and attack Lebanese soil over the last 2 decades.", "label": 0}
{"text": "Yea my bad wrong tab.   I'll fix it. Thanks", "label": 0}
{"text": "ever since they changed to Syfy", "label": 0}
{"text": "Problem is, I abandon it but everyone else keeps on keeping on and i get fucked.  My honesty has actually cost me a fuck ton of money and ain’t nobody being like “good on you for being honest”.  Nope money is our new god. \n\nBeing a rich scumbag is better than being a poor honest person", "label": 0}
{"text": "Uje, the only news about Putin that interests me is when he falls out of the window. Thanks.", "label": 0}
{"text": "The puppet has spoken", "label": 0}
{"text": "Bros criticized and condemned Putin literally dozens of times. \n\nYou don't need to make up stuff against him lol", "label": 0}
{"text": "Of course because Elon is Putins useful idiot", "label": 0}
{"text": "Not only is 1,000 verified fighters being killed wild, but the 1,000 includes almost all their top leadership and their elite forces. \n\nNot only that, there are another estimated 1000 killed, not including the thousands severely injured in the pager attack. That also doesn’t include the likely thousands that have been captured or fled. Beyond the casualty count, the IDF has obliterated Hezbollahs infrastructure both at the border and near Beirut. \n\nAnd STILL, Hezbollah is firing on Israel. And still, the Lebanese Army has not been able to (willing?) to take control of the country. The IRGC has no incentive to make things any easier for Israel by allowing Hezbollah to surrender. They don’t care in the slightest that a million Lebanese are displaced due to a war in which the Lebanese never stood to gain anything. \n\nThe greatest cause for hope lately has been the Lebanese Christian leader that called for disarming Hezbollah. It’s going to take some political and physical courage for Lebanon to get their country back.", "label": 0}
{"text": "And he'll have a president again soon", "label": 0}
{"text": "*Ativan** is a benzo, which couldn’t be further from meth, you’re likely thinking of *Adderall*. \n\nBut what they really don’t want you to know is that everyone has already moved on to Vyvanse, which is the **tits.**", "label": 0}
{"text": "They’re already serious with their concerns, let’s not push it too far. ", "label": 0}
{"text": "Agree 💯.  An audit of funds received should also be conducted.", "label": 0}
{"text": "Yes. So if it’s fine to send NK troops to Russia to help take back Russian territory…", "label": 0}
{"text": "Not if they lose a few nuclear weapons in the chaos", "label": 0}
{"text": "The space program was never public. Rockets were built by private companies from the start.", "label": 0}
{"text": "His biographer originally wrote that it was turned off and later corrected it https://www.politico.eu/article/elon-musk-biographer-walter-isaacson-clarify-details-starlink-war-russia-ukraine-outcry/", "label": 0}
{"text": "It's important to take any potential communication between influential figures seriously, especially when it involves national security. An investigation could help clarify the situation and ensure transparency.", "label": 0}
{"text": "Yeah we definitely aren’t passing that.", "label": 0}
{"text": "The point is that this is not a measure of readiness.", "label": 0}
{"text": "Ya well better get ready!", "label": 0}
{"text": ">Articles like this exist so that you're kept informed\n\nTo what end? What life choices are **you**, as a civilian citizen, going to do with information on **Putin's** opinions? On a civilian article?\n\nWhat track record leads you to want to develop **your** opinions using his publicized information?\n\n>so that you understand the choices being made and actions being taken by the US government. It's so that when the US government says they're going to send the resources they're going to send, or whatever else, you understand the reasoning.\n\nI don't go to a **dictator's** opinion, to understand actions from the U.S. government.\n\nTLDR:  Information projected to users in articles is for a reason. Any media pumping Putin's opinions into the title is just a guise to make him feel more legitimate on the global scale. In truth, no one should be enabling attention to his words, only watching the countries actions.", "label": 0}
{"text": "As a Pole, even if that were the case (which it isn’t), EU is actually good and cool, you fucking imbecile. Actually, you’re aware of the fact that you’re part of it, right?", "label": 0}
{"text": "Lad just went full Call it Doody!", "label": 0}
{"text": "It’s complicated. For example, the FBI took over a phone business that modified phones for criminals. Stuff like removing the gps, microphone, a hidden encrypted chat app, etc. The guys selling the phones didn’t know they were working for the FBI. All the data was actually gobbled up, not encrypted. Because the FBI doesn’t have authority to do stuff internationally, an allied intelligence agency “collected” the data and forwarded it on to the FBI. \n\n\nhttps://www.justice.gov/usao-sdca/pr/fbi-s-encrypted-phone-platform-infiltrated-hundreds-criminal-syndicates-result-massive", "label": 0}
{"text": "Ofc they are blind, they are not the ones overworking, it's not the government that's overworking us, it's the corporate culture", "label": 0}
{"text": "He needs his security clearance pulled and an investigation done on if he broke any terms in his government contracts.", "label": 0}
{"text": "Our tax dollars —-> Musk/SpaceX—->Russian Dictator. If you want to put a stop to this; Vote against every MAGAt GOP bootlicker. Start with voting Convicted Felon Donald J. Trump into oblivion and vote every GOzP out. Now is the time.", "label": 0}
{"text": "> They aren't going to know what the hell to do.\n\nThis is part of the equation for NK. Not only does Kim get paid for this, and possibly some trade favors from the Russians, but NK troops will get first-hand experience in an actual, brutal modern war. The kinda experience that exercises and simulations can't replicate.\n\nAny troops who survive and return to NK will be invaluable to the military.", "label": 0}
{"text": "Russia, North Korea.... Potato, Potato, it's all the same and fair game imho.", "label": 0}
{"text": "3 years ago, I saw Kamala Harris have sex with a pig.\n\nSee, anyone can allege anything, nobody cares anymore.", "label": 0}
{"text": "Sounds like something someone who knows how to break the encryption would say .... 🤔", "label": 0}
{"text": "Europeans are choosing to buy cars made by European car makers. Elon is actively alienating the majority of people that chose to buy electric cars in America, and elsewhere around the world the market is flooded with cheap Chinese EVs.\n\nFSD has been 2 years away for 10 years and counting, Cybertruck novelty has wore off, and the Robot is a total gimmick at this point.\n\nWhat is there to justify 70x TIMES EARNING?\n\nElon’s promise to “work on AI”?", "label": 0}
{"text": "Good for him", "label": 0}
{"text": "Taiwan refused to sign a contract for Starlink and picked a European company instead. \n\n> The forthcoming service is via a contract between Taiwan’s main telecoms company, Chunghwa, and a UK-European company, Eutelsat OneWeb, signed last year, and marks a new milestone in Taiwan’s efforts to address technological vulnerabilities, particularly its internet access, after attempts to get access to Elon Musk’s Starlink service collapsed.\n\n> Taipei has been exploring ways to acquire satellite internet technology since 2018, including in talks with SpaceX. But Mr. Musk balked at a requirement that any foreign entity involved in communications infrastructure be a joint venture with a local partner that would hold a majority stake.", "label": 0}
{"text": "1/4 registered Republicans say Trump should do “whatever it takes” to regain power. That’s about 9 million people.   I’d argue about that much of the GOP are enemies from within or at least support the ones who are.", "label": 0}
{"text": "I’m guessing some politicians aren’t happy about the major funds to the IRGC and its proxies, it’s gotten really insane, and some hardliners wanting the current president out", "label": 0}
{"text": "Can the US arrest him for spying yet?", "label": 0}
{"text": "Who would willingly put Trump at the head of a conspiracy? The guy would tell everyone. I could see him as a patsy though.", "label": 0}
{"text": "Wonder if Russia will ask Cuba 🇨🇺  for assistance to?", "label": 0}
{"text": "Yeah I don't buy it... he supported Clinton and Biden. He knew the democratic platform and priorities. You don't just... FLIP overnight the way he did over a couple of regulatory roadblocks. And all his comments about how he's going to jail if Trump loses? There's more there... ", "label": 0}
{"text": "Good.  My maids should be content with their lot in life.", "label": 0}
{"text": "This was schizoposting.  Go outside.", "label": 0}
{"text": "Hasn’t their response mostly just been try to force folks into dating and not looking at maybe work life balance cost of living etc?", "label": 0}
{"text": "Model Y is the best selling car in the world. \n\nAlso Cybertruck novelty has NOT worn off. It’s the third best selling EV in the USA after Model Y and Model 3.", "label": 0}
{"text": "Last I checked there are several landmarks in the Middle East that the US hasn’t replicated yet", "label": 0}
{"text": "> StarShield\n\nIf you think the US government will allow musk to retain an iota of control over infrastructure like this if/when shit hits the fan then you must have missed a few chapters. Billionaire or no, if shit gets real he's getting all his toys taken away in a heartbeat.", "label": 0}
{"text": "All laws are made up.", "label": 0}
{"text": "You can look at his political contributions. More money to Democrats until recently.\n\nHis recent comments have to do with the way Biden, and then by extension Harris, have them abusing their power in office.", "label": 0}
{"text": "Couldn't the North also do that if South Korea sends troops?", "label": 0}
{"text": "Well, Taiwan know communication black out is part of their plan. Not really a secret, considering how many times China's ships visit certain parts of the ocean and the internet cable there just happen to get damaged 'mysteriously'.", "label": 0}
{"text": "silicon (Si) is not carbon.", "label": 0}
{"text": "Sure, for example sensors for your nuclear power plants or optics from Zeiss for NASA or Tons of Equipment to operate the electrical grid from Siemens. I could go on for hours. We make tons of money building them for you guys, that is why it baffles me when the US acts like the dependency is only from our side.", "label": 0}
{"text": "Imagine trusting the government with your life (ability to communicate and coordinate in the event of a disaster or war), after reading any history at all. Do you work for the military or \"intelligence\" agency or something? Who cares? Did you forget that FEMA/local law enforcement wasn't allowing supplies in to help US Citizens for the recent hurricanes already?\n\nWhy would you trust the 'overseers'?", "label": 0}
{"text": "You do know that the frontline in Kursk is collapsing for the Ukranians?", "label": 0}
{"text": "\"Sources say\" without links or references? Also, he runs multiple giant tech companies, so im not surprised he would be in communication with leaders across the world, especially when they want his tech.", "label": 0}
{"text": "/s I’m sorry that our politics cause other nations citizens anxiety. We’re trying to be better, I promise.", "label": 0}
{"text": "Its all projection and lies.  I don't think for a second she's serious, she just knows accusing the other side of doing what she's doing would set the narrative early.", "label": 0}
{"text": "🤝", "label": 0}
{"text": "they can donate it", "label": 0}
{"text": "Russia has been retaking large swathes of Kursk.", "label": 0}
{"text": "Confidential: ✅ availability: ❌, integrity: ❌", "label": 0}
{"text": "NS2 was never canceled, it was finished and later destroyed by someone", "label": 0}
{"text": "The problem is Capitalism; caring more about money than people", "label": 0}
{"text": "Don't count on surrender. They likely have been shown videos that Russia claims is Ukraine killing pows, but is infact Russia. It might be why there has been a large increase in the last few weeks. They needed footage.", "label": 0}
{"text": "Some proxy diplomacy. \n\nRussia don’t care, I bet China asked.", "label": 0}
{"text": "Is it surprising, though, in this context?  Because I wasn't in the least bit surprised and neither, I suspect, was the IDF.", "label": 0}
{"text": "Wtf? This can't be a serious comment... you are not a serious person. \n\nLaws exist in different jurisdictions, any foreign company that decides to enter a foreign market does so with the understanding they will adhere to local laws. If a company does not want to do business in a jurisdiction because they do not want to adhere to the law, then they do not have to do so. Starling has no obligation at all to enter the Tawainese market. \n\nHowever, when they approach Taiwan and ask to do business there, and enter into negotiations with local government, they have chosen to adhere to existing laws. If they suddenly demand an exception then that are acting in bad faith and have wasted everyone's time and hampered or ended the negotiation.\n\nTrying to defend bad faith behavior by saying I, or anyone else, doesn't like the CEO of the company is delusional and wildly ignorant. Starling was acting in bad faith entering into negotiations it turned around halfway through and changed the goal posts.\n\nWhat is weird is how you are defending obviously bad faith actions by throwing out weird straw man accusations.\n\nWhat a fan boy...", "label": 0}
{"text": "project drawdown", "label": 0}
{"text": "Some people use Reddit for more than arguing.", "label": 0}
{"text": "you could enlighten them instead of hinting at vague notions", "label": 0}
{"text": "Why's he think he's gonna go to jail if Harris wins though?", "label": 0}
{"text": "It doesn't say that. It says they built bases in the area. Still not great though.\n>In 2019, FSG signed contracts to support China's Belt and Road Initiative, including building a series of bases in China's Xinjiang, where the internment camps of ethnic Uyghurs attracted widespread allegations of human rights abuse.", "label": 0}
{"text": ">assumed that most modern industrialized countries had moved to having ACs. \n\nNope, it's pretty much just the US.", "label": 0}
{"text": "Charge him under the Logan act:  \n  \n Any citizen of the United States, wherever he may be, who, without authority of the United States, directly or indirectly commences or carries on any correspondence or intercourse with any foreign government or any officer or agent thereof, with intent to influence the measures or conduct of any foreign government or of any officer or agent thereof, in relation to any disputes or controversies with the United States, or to defeat the measures of the United States, shall be fined under this title or imprisoned not more than three years, or both.", "label": 0}
{"text": "Four hours from now ", "label": 0}
{"text": "That would be a dream.  Still a lot of things about Musk I don’t like including the egomania and instability and the “terminally online” disease but he has some pluses too.", "label": 0}
{"text": "Not being an american puppet will piss off the americans. This war eliminated the EU as an economic opponent to the usa, the already shitty demographics of EU and social safety nets work like a ponzi depending on the young to feed the old especially in germany, the invasion started an arms race, all nations will arm themselves to the teeth. 2d chess by putin and 4d chess by americans.", "label": 0}
{"text": "Imagine if it was the US navy (instead of Ukraine) using Starlink about to attack Russia, then Musk turned it off because “he doesn’t want escalation”\n\nHe’d vanish with one witness saying they thought they saw a helicopter that night", "label": 0}
{"text": "\"Everyone knows that.\" Funny how we haven't heard this at all during the discussions of Ukraine joining NATO for the past two years.", "label": 0}
{"text": "And without congress, legislation won’t happen either.", "label": 0}
{"text": "For those who need further clarification, this means that a Palestinian refugee can be the child, grandchild, great grandchild, and so on and so forth, no matter where they were born in the world.\n\nSo if a Palestinian refugee left the middle east, and had children and grandchildren in the US, or in Europe, or anywhere in the world - those children are considered refugees.  Even if they have never step foot into the Palestinian Territories.\n\nIn other words, Bella Hadid is a refugee. \n\nIf you applied the refugee status of Palestinians to Jews, practically all Jews would be refugees.", "label": 0}
{"text": "Quantum computing doesn't let you get someone else's data like that, it does (among other things) enable encryption with a robust anti-eavesdropping ability, and potentially quantum teleportation, which is not actually teleportation at all, but rather instantaneous data transfer (faster than the speed of light)", "label": 0}
{"text": "Sure - So the Thai thing is interesting. He was asked on twitter if they could help from a Thai based user - no authority to actually ask for help or anything, but he decided to go for it because he has a need to be a hero.\n\nSmall team from SpaceX and the Boring Company worked on it, created a prototype within a few days and tested it. During this Musk emailed the head of the rescue operation and asked if it was needed or not - he was told to keep working on it as it might be needed.\n\nWhen they delivered the little submarine, the Prime Minister welcomed them and they had it on hand, should they need it. They did not need it in the end. That's where the story should have ended.\n\nInstead, Vernon Unsworth, one of the cave divers said that the sub was a PR stunt, would never work and that Musk should stick it where it hurts. Musk responded like a fucking idiot, and then later made comments based on false information he was fed from a Thai conman. They went to trial in Los Angeles and Unsworth lost. \n\nSo yeah, wasn't asked to build it, but asked to continue building it. Delivered it and then lashed out like a child when someone said something mean to him. Total dickhead move by Musk, but he was asked by the Rescue lead to continue building the sub.", "label": 0}
{"text": "Say it louder for the redtards in the back!", "label": 0}
{"text": "That's a fair point. They have limited access to the outside world, likely including news about Ukraine or adequate information on human rights or Geneva convention protocols.\n\n\nWe have no idea who these soldiers think they're fighting, or why. They could very well be heavily indoctrinated in the false idea that Ukrainians are vicious or will torture them to death if they surrender. \n\n\nThey have zero frame of reference with respect to the civilized world, and to be honest that might actually make them more dangerous and more effective on the battle field... if they're properly trained.", "label": 0}
{"text": "\"No, really, could you please keep them switched off so we can have a good go at this? Missiles are expensive!\" /irgc probably.", "label": 0}
{"text": "I think the treason comment probably is related to this post about him talking with Putin.\n\nI assume the election underlying comment is about him literally buying votes for Trump.", "label": 0}
{"text": "Which friends?", "label": 0}
{"text": "The construction was finished but the project was canceled when Russia attacked Ukraine.", "label": 0}
{"text": "Okay but just because you got a little wet doesn't mean you need to lash out at me because I made a joke.", "label": 0}
{"text": "Yep, so what would this mean if Musk has been doing this since 2022? That either he disclosed it, or the three letter agencies are shockingly bad at their jobs - which is unlikely.", "label": 0}
{"text": "Can't imagine that number remains as large after the AI bubble inevitable bursts. \n\nSooner or later it will be apparent our current Ai is nowhere near where we are pretending it is.", "label": 0}
{"text": "Its because they cant say anything good about anything Elon has had his hand in.  He could cure cancer tomorrow and they would complain that he should have cured it today.", "label": 0}
{"text": "Was this an airstrike?", "label": 0}
{"text": "Because he owns it lol. Well, he owns most of the shares in the parent company anyways.", "label": 0}
{"text": "Literally their one job.", "label": 0}
{"text": "lots o cope.", "label": 0}
{"text": "What a prick, Zelensky did the right thing.", "label": 0}
{"text": "Not so much corrupt, as just useless.\n\nRussia has a permenant seat on the Security Council for being on the winning alliance of WW2. With the no mechanic for changing the permenant seats, eventually, it is doomed to fail. Should be a reassement of the Security Council at least every 100 years. 'For all time' is just silly, unrealistic and ya, doomed to fail.", "label": 0}
{"text": "They can have the rockets and starlink without Musk. Musk is the CEO/CTO sure, but Shotwell is the balancing force. There are incredible leaders at SpaceX who execute incredibly well. Musk is not essential for existing services.", "label": 0}
{"text": "I'm actually very curious what sort of profesionanal, non conscript corp North Korea has. Because contrary to popular beliefs, most Russians on the front lines are contractors. Will they have penal division like Russia? Maybe some are volunteer contractors since they would still earn money for Kim.", "label": 0}
{"text": "Reducing food waste following eating a plant-based diet are on top of the list\nhttps://drawdown.org/solutions/table-of-solutions", "label": 0}
{"text": "They deserve it. I can't wait to see Russia lose this war.", "label": 0}
{"text": "I don't think they understand that to overthrow the Western hegemony they need to have a system that is much more robust  and stable than the Western system. Nothing about Brics or its members even remotely resembles of robustness or stability.", "label": 0}
{"text": "Anyone else would have their clearance suspended pending the investigation", "label": 0}
{"text": "Ah yes. Because there sure aren't capitalist countries who don't have these issues. Capitalism is only the Boogeyman for people too lazy to actually use their brain to find solutions.", "label": 0}
{"text": "Whole of Europe geopolitically is scuffed if he does, Russia/belarus will be able to get a stable us lifeline  for another four years", "label": 0}
{"text": "*international", "label": 0}
{"text": "I don't see why Ukraine would attack Belarus. They're already struggling to defend their country", "label": 0}
{"text": "So long, and thanks for all the fish", "label": 0}
{"text": "True, I’m asking which ines", "label": 0}
{"text": ">i disagree. i think its cost of living thats making us lonely\n\nif people just embraced a simple minimalist life and sought out others with the the same mindset, i doubt they'd be very lonely. \n\nThe problem is people don't want to do that, and a consumerist society also doesn't want them to.", "label": 0}
{"text": "The main difference compared to the first half of the 20th century: nukes. We live in the nuclear era. Wars will never be fought like during the 1st and 2nd world wars again.", "label": 0}
{"text": "Actually that is not so. If you look at polls taken of the American public prior to Pearl Harbor, by late 1940 the majority supported intervention:\n\n\"In January of that year(1940), one poll found that 88% of Americans opposed the idea of declaring war against the Axis powers in Europe. As late as June, only 35% of Americans believed their government should risk war to help the British. Soon after, however, France fell, and in August the German **Luftwaffe** began an all-out bombing campaign against Great Britain. The British Royal Air Force valiantly repelled the German onslaught, showing that Hitler was not invincible. A September 1940 poll found that 52% of Americans now believed the United States ought to risk war to help the British. That number only increased as Britain continued its standoff with the Germans; by April 1941 polls showed that 68% of Americans favored war against the Axis powers if that was the only way to defeat them.\"\n\n[https://www.nationalww2museum.org/war/articles/great-debate](https://www.nationalww2museum.org/war/articles/great-debate)\n\nThe public had moved away from isolationism before Pearl Harbor.", "label": 0}
{"text": "Starlink and SpaceX would BOTH need to be nationalized in one swift move. Then the government would need ALL OF THE LAWYERS to defend against his.", "label": 0}
{"text": "Uh huh. Did you think similarly when they attacked Kursk", "label": 0}
{"text": "Utilitarianism maximizes overall well being and minimizes overall suffering. Its does not at all fit a holy state that cannibalizes its people.", "label": 0}
{"text": "We should do it in Hungary too then. What an idiot.", "label": 0}
{"text": "Hmm, let me think, make some people half the world away mad for a bit or make sure that the people don't freeze to death next winter because a majority of their energy comes from Russia?\n\nDo i have to also outline that the only railway going trough the country is also owned by Russia?\n\nThe answer is obvious.", "label": 0}
{"text": "Instead money and possessions should be sent to \n\nHis Holiness Pope Francis\nApostolic Palace\nVATICAN CITY, 00120", "label": 0}
{"text": "Tiktok comes from China, where US tech companies are also forced to be owned by China (foreign ownership was capped at 50%). I'm not sure why you think it's such a big deal that the US reciprocates. This should be done to all Chinese companies wanting to enter the US market. \n\nTaiwan wants Starlink, so it has to come into agreement with Spacex, which it failed to do. They've instead come into an agreement with a EU company. \n\n> The forthcoming service is via a contract between Taiwan’s main telecoms company, Chunghwa, and a UK-European company, Eutelsat OneWeb, signed last year, and marks a new milestone in Taiwan’s efforts to address technological vulnerabilities, particularly its internet access, after attempts to get access to Elon Musk’s Starlink service collapsed.", "label": 0}
{"text": "Paying for votes while having regular conversations with a foreign head of state. Paying for votes while spreading misinformation that damages our democracy. Paying for votes while having defense contracts that are national security concerns. \nMight not meet the definition of treason but it's extremely un-American", "label": 0}
{"text": "I have heard that.  I don’t think the push in the north was the right thing to do.  But I’ve also heard Ukraine had gains in the south.  So I’m confused.  I assume even in a collapse, the Russians pay dearly for their assaults.", "label": 0}
{"text": "Time to give Ukraine long range strike capabilities and the green light to target North Korea, they'll be doing the world a solid.", "label": 0}
{"text": "Zelenski should start handing out citizenship in exchange for military service to for people from non nato countries ", "label": 0}
{"text": "He’s famous for faking sales figures", "label": 0}
{"text": "Israel doesn't allow any international press into Gaza.", "label": 0}
{"text": "90% tax threats were an incentive to: Have higher wages, re-invest in the company, community, and expand without outsourcing.  Nobody ever paid 90%.", "label": 0}
{"text": "Not so at all. See my post above on polls of the American public before Pearl Harbor. Here is a snippet of above:\n\n\"A September 1940 poll found that 52% of Americans now believed the United States ought to risk war to help the British. That number only increased as Britain continued its standoff with the Germans; by April 1941 polls showed that 68% of Americans favored war against the Axis powers if that was the only way to defeat them.\"\n\n[https://www.nationalww2museum.org/war/articles/great-debate](https://www.nationalww2museum.org/war/articles/great-debate)", "label": 0}
{"text": "Good luck with that", "label": 0}
{"text": "Yeah but Russia couldn't defend their border because they were busy in the Dombas. Belarus is well defended and Ukraine certainly doesn't want to have another enemy", "label": 0}
{"text": "For a man with his wealth, a fine IS getting away with it.", "label": 0}
{"text": ".... the same? Because the contracts exist because of the services offered, not the person. I mean... how they look right now under Biden.", "label": 0}
{"text": "It's almost as bad as sending putin ventilators while Americans died due to a lack of them.", "label": 0}
{"text": "Careful Flying | Russian\n\n  \nPick one", "label": 0}
{"text": "Not if they also traded their only copy of a luxury resource and then happen to build a fort on it later. That would cancel the deal", "label": 0}
{"text": "He's a shit father, an overreactive tweeter and can absolutely be an asshole. \n\nA bad guy against the USA? Not sure I buy that. Historically, his actions have only supported the USA in regards to business. The idea that he's bad would require incredible underperformance by the three letter agencies and those around Musk, and over performance of Musk himself.", "label": 0}
{"text": "100% this is a wild headline.", "label": 0}
{"text": "Legit question, does this make strikes on North Korea to degrade the ability to wage war feasible?", "label": 0}
{"text": "I finally just watched “Leave the World Behind” and yeah….. this seems about right. One day everything is just gonna stop working. Internet, electricity, all utilities - no clean water delivered to the tap anymore. No government or law enforcement. Just renegade militias and psychopaths running wild. It’s gonna descend into chaos pretty quickly.", "label": 0}
{"text": "You want the corrupt guy to stomp out corruption?", "label": 0}
{"text": "I suppose in this case they can always take the Imperial Japanese route", "label": 0}
{"text": "Exactly. That is how it works for everyone else - if it happened. So why do we think this didn't happen?", "label": 0}
{"text": "Interception isn't the issue at hand here, the issue is more of connectivity.  It is simple enough to block connectivity to a region resulting in your military applications that rely on a Starlink connection no longer working.  We have even seen this in action with Starlink blocking connectivity in the Crimea region.  \n\nWorse yet would be if the locations of Starlink uplinks were to be given to the enemy in realtime resulting in targeting of those locations with munitions (IDK if Starlink has that capability though).", "label": 0}
{"text": "Well you’re not in the effin club.", "label": 0}
{"text": "Putin's entire wealth and political power has been by extorting rich people and making them his working girls with Kompromat. \n\nTrump, Elmo and likely Bezos are under Putins thumb. Putin's an expert as this and none of them are smart enough to avoid the trap.", "label": 0}
{"text": "Under which imaginary law is aiding a illegal invasion lawful?", "label": 0}
{"text": "So is Russia starting to report that Belarusians are trying to vote for referendums now?", "label": 0}
{"text": "If this is true, it means just one thing: putin has been grossly lying about his casualties and he's is in dire need of more soldiers.", "label": 0}
{"text": "Actually loled. Need to ensure we can find the Palestinian extermination engine.", "label": 0}
{"text": "uh oh someones having feelings", "label": 0}
{"text": "Should Israel have the right to justify any collateral damage since it’s not their fault that terrorists and enemy combatants are indistinguishable from protected civilians?", "label": 0}
{"text": "Yeah for all of the other things one can say about France that is a legitimate gripe, they have been pretty dang good as far as 1st world countries in getting a grip on things.\n\nSECAM is still a bit of a joke, but frankly the fact they're willing to do things 'their own way' does provide a third option that often has advantages, in this case their focus on nuclear and better focus on EV (i.e. Renault) than other groups.", "label": 0}
{"text": "I would contribute money to an organization that only bought billboard space with this slogan on it.", "label": 0}
{"text": "It's close enough that it might as well be Putin. The clickbait value of Musk's name is wild though", "label": 0}
{"text": "Maybe for some countries, but the US will probably pivot in 5-10 years.", "label": 0}
{"text": "It's in the WSJ article that this article is covering.", "label": 0}
{"text": "Oh yeah. Russian science fiction does (or did) have a little obsession with people being able to control the weather. I should've spotted that.", "label": 0}
{"text": "Well it does highlight how easy it is to slip into a fascist mentality.  \n\n\nAll that really needs to happen is to turn off the tit of federal money/subsidies.", "label": 0}
{"text": "Why would Musk admire Putin?", "label": 0}
{"text": "Scholz with a dumb comment\n\nRussia then has zero incentives to stop fighting", "label": 0}
{"text": "The clone wars have begun", "label": 0}
{"text": "What's in bad faith, why even negotiate in the first place.  \nClearly there was a willingness to allow Taiwan access to starlink in the first place.  \nWhat's ironic is you actually agree with me but ultimately are the one pushing this bullshit  straw man with you desperately trying to make Musk out to be something he's most certainly not in this situation, dumb or pushing some ulterior motive.  \n\nSo please explain to me where in any situation  it makes  perfect business sense for a 200 billion dollar company to give up majority ownership to a foreign country.", "label": 0}
{"text": "I think SK citizens know the truth already.", "label": 0}
{"text": "1. Why is Putin making demands on what technology Taiwan gets access to? Is he just acting as Xi's proxy to get access to Chinese military products?\n\n2. Given Musk's habit of impetuously changing his mind and/or punishing those he doesn't like, I think it's about time the government exercise eminent domain and take control of Starlink.", "label": 0}
{"text": "He’s not a politician. I’ll take it.", "label": 0}
{"text": "There's always a lot of Shoulding and not a lot of Doing...", "label": 0}
{"text": "Stating a verifiable fact : wild headline.\n\nWhatever is your take on it it's as good a headline as it gets", "label": 0}
{"text": "The national polls are tied, but national polls dont mean anything. The swing states, are unfortunately, being lead by Trump.", "label": 0}
{"text": "Not sure what they'd do, but if he broke the law, he would be prosecuted. \n\nI'm not sure why people are believing that he's breaking laws etc and that he's magically immune during an administration that has been openly hostile against him.", "label": 0}
{"text": "About 3 years too late Luka...🤫", "label": 0}
{"text": "Yep, I also agree.\n\nBut queue Apple fanboys having strokes about this.", "label": 0}
{"text": "Absolutely bankrupt.\n\nThat stupid mofo sunked his country for generations just because he felt like losing a war", "label": 0}
{"text": "But a very good thing if you're trying to assassinate Musk's character.", "label": 0}
{"text": "The exact moment I started despising him. That whole incident borked his entire image imo.", "label": 0}
{"text": "Stealing info from ASML has nothing to do with anything, they literally don't have the brain capital to keep up with global semiconductor research (which is by far the fastest moving field in the planet and there isn't even a remotely close second) or establish the supply chain themselves. ASML isn't a black box that eats money and spits out EUV scanners. They use optics from Zeiss, different cutting edge lasers from a half dozen western companies, another half a dozen research partners for solving particular problems etc.", "label": 0}
{"text": "He's a piece of shit, but it's fundamentally a private company he owns the controlling interest in. The US could have funded their own R&D, and even has an entire organization dedicated to doing so, but chose not to continue funding it to the levels desired.\n\nWe made our bed here.", "label": 0}
{"text": "Still just being rude lmao, you edited your comment to include a link now and to add the word \"child\" in. Why are you in such a bad mood? Also i never asked for the source,  i just asked why you were being an ass and why you refused to provide one", "label": 0}
{"text": "It's like VAT, but for loans.", "label": 0}
{"text": "Kind of like the US demanding Tiktok sell their US assets but I bet that is somehow considered reasonable for national security or whatever.", "label": 0}
{"text": "THE VATICAN is one of THE RICHEST, MOST CORRUPT ENTITIES ON OUR PLANET.", "label": 0}
{"text": "The issue isn't whether the Palestinians were refugees, the issue is that their kids, grandkids, great-grandkids, *inherit* refugee status.  No matter where they are in the world, when they are born, where they reside.\n\nIn other words, if you were a Palestinian refugee in 1967, and you escape and move to France, and you have children *in* France, those children have refugee status.\n\nThis refugee criteria does not apply to any other refugee on earth.", "label": 0}
{"text": "Exactly. That would not allow him to maintain it. \n\nSo if he has it, it would mean one of two things:\n\n1. He's a special boy and nobody gets to touch him. Unlikely due to the 'smoking pot' on Joe Rogan required him to submit to random drug testing for 12 months.\n\n2. He hasn't actually broken the law, isn't constantly on drugs as the rumours suggest.", "label": 0}
{"text": "Magically it's also conservative values.  \n\nFuck the poor, subsidize the rich.", "label": 0}
{"text": "Gorgeous beasts", "label": 0}
{"text": "It’s just the most effective way. A software lockdown could be bypassed, trying to flood the machines just wouldn’t do enough permanent damage, fire wouldn’t be able to spread and destroy without a proper accelerant, which turns it into an explosive basically anyway, so they have the facilities rigged with explosives. It destroys the machines and storage media of software, plus buries it all under rubble.", "label": 0}
{"text": "Not only is Elon Musk a grifter, but hes also a treasonous pig.  I cant wait for his downfall coming shortly.", "label": 0}
{"text": "Lmao, and you reckon trying to use this useless, treacherous clown as some form of puppet now he’s exposed is a good one? Musk needs to be locked up and the system brought under national control at least until a reliable owner can step forward.", "label": 0}
{"text": "How restricted is the media in Belarus? Can the population see international media?", "label": 0}
{"text": "Who do you want for a president: McDonalds Trump or the one who has more balls than him?", "label": 0}
{"text": "Wanna know why China cracks down on theirs so hard? Because they know how easy it is to buy out ours.", "label": 0}
{"text": ">Bloomberg reported that although talks began as early as 2019 with SpaceX on implementing its Starlink network in Taiwan, in 2022 the tone of the negotiations suddenly changed\n\nSo literally same year he started communicating with Putin", "label": 0}
{"text": "I guess they have to go out in public and talk to people.", "label": 0}
{"text": "Ewww, you’re defending a piece of shit lol", "label": 0}
