{"text": "Just look at the laundry list of rogue bugs, dark ranger bugs, etc. It's insane. If you play casually, yea, you probably won't even notice your spells aren't doing what they're supposed to.\n\nAlso, major data loss is a \"mistake\"? No, that wasn't just a mistake, it was a totally unacceptable blunder of epic proportions. How would you like it if your brutosaurus got deleted from the game and no matter what you did you couldn't get blizz to restore it? How would you feel if I then went up to you and said it was just a mistake that only affected a few players?", "label": 1}
{"text": "Why is it always the people blatantly ignoring the facts and telling someone about their opinion saying to speak less from the heart and work in facts? Someone's too addicted to WoW to stop sucking Blizzard's dick and admit WoW is in a worse state now cause the game is scuffed.", "label": 1}
{"text": "It must be nice to have all the free time.  Don't get used to it.  When you grow up, you'll have these things called \"responsibilities\" which make it hard to play a lot and you'll start understanding the value of time.", "label": 1}
{"text": "I don't think I said anywhere that the guild bank issue which is what I'm assuming you are referencing was a mistake or not bad.   That is probably the worst thing to have happened in this game since it's inception which I've been playing since.  That is also not the current bug in the current patch which is what the overwhelming majority are crying about.\n\nIf I had been subject to losing everything and being told there was nothing that could be done... I would have quit the game.  I wouldn't have an opinion on this mount because I would have quit and never played again.  When I don't get what I expect at any business I don't go back.  I'm not making excuses for them, I'm simply saying that if people lost everything and continued to subscribe they were apparently less bothered by it than they claimed.\n\nThe current bugs aren't that insane.  Yes Rogue has issues, Does that mean nothing can be played? No.  Do I think they will fix the game busting issues quickly? Yes I do.   Do I think it'll be quickly enough for people to not scream about it? Not even if they found a time machine and went back and fixed it before it happened would that satisfy some people.  This game and most mmos are always a cycle of new content, bugs, fixes, new content.  At any point that someone feels like it's too much they can easily remove themselves from the content. I'm not pro or anti blizzard, I understand why some people are frustrated.  But this is far from the most busted or buggy version this game has ever gone through which is the comment I was responding to.", "label": 1}
{"text": "Spending 75 Euro on a mount is your idea of responsibility? I was taught it meant standing behind your values despite having the choice to do otherwise. Nice try though.", "label": 1}
{"text": "I'm sorry, where do I put my cash into my PC? I tried the CD tray but then remembered none of my computers have had those since like 2014... Of course people used credit cards to buy this you know, that doesn't mean that they don't have $90 cash on hand. 🙄", "label": 1}
{"text": "Are you dense or something? The person insinuated that credit cards... you know the cards that are lines of CREDIT meaning they are not funded by money you already have, are what was used.   Their insinuation is that people can't just have that kind of money they have to use credit cards.  Again not debit cards, say it with me now... C-R-E-D-I-T cards.  Do you need me to get some crayons to help explain it further?", "label": 1}
{"text": "You do realize that people use credit cards for online purchases, right? Like, you'd be kind of an idiot for NOT using a credit card for most of your day-to-day expenses, since most credit cards have reward incentives... Saying the word credit card in no way insinuates that someone needs to use credit to buy this mount. I really don't think I'm being the dense one here. Lol.", "label": 1}
{"text": "In their defense, responsible people use credit cards when they do have the money as it is generally safer and easier to get your money back if something goes wrong.", "label": 1}
{"text": "No. They just said credit card because that's the most popular way to pay for things online. You're reading into it way too far and kinda making yourself look silly.", "label": 1}
{"text": "I enjoy when the names aren't blurred out so I can go harass this player on your behalf.", "label": 1}
{"text": "Yes. I'm sure that's the group the original comment was taking aim at...", "label": 1}
{"text": "Oh no... I wouldn't wanna look silly in a sub full of people full on shitting themselves about a mount lol.", "label": 1}
{"text": "Really hope you are joking cause that's a guaranteed way to get yourself and the OP suspended", "label": 1}
{"text": "That's right we had worse patches with worse bugs in the past, I dont get why everyone is so triggered.\n\nIts a 20 years old engine and the game code must look like a nightmare for every developer, it does also not help that all(?) of the founding developer are gone now. Bugs exist and will be fixed hopefully in a timely manner.\n\nIf you want to rage and critique, the customer support is atrocious. GMs, Tickets etc.", "label": 1}
{"text": "Those are people who shouldn't be allowed to handle amounts over allowance level because they don't understand the most basic concepts about money.", "label": 1}
{"text": "Being judgemental is fun do they not get that?", "label": 1}
{"text": "lol look at them down voting me. It’s pathetic people can’t understand how this stuff is harmful to the game. At this point I’m sure they could go full pay to win and it would be fully support because “ I’m mArRiEd WiTh KiDs aNd WoUlD rAThER BuY tHiNgS tHeN aCtUalLy PlAY the GaMe I pAy FoR”\n\nWhat a joke", "label": 1}
{"text": "Honestly - on top of all the morally good reasons to judge people for buying the mount - yes, it's fun!", "label": 1}
{"text": "I couldn't care less", "label": 1}
{"text": "We should generally care how people spend their money - most of the time the result would be that it doesn't matter.\n\nBut hell, wtf, especially the WoW community has learned NOTHING. Goldfish level of memory.\n\nWe literally do not get a new Warcraft game because a single mount makes more revenue.", "label": 1}
{"text": "Mask off.", "label": 1}
{"text": "you're not the audience they care about though", "label": 1}
{"text": "I can tell you rage typed this with tears in your eyes by all the misplaced words and errors.\n\n\nYou're seething over literally nothing. Grow up. Play the video game or don't, who cares.", "label": 1}
{"text": "\"You shouldn't spend money because you don't understand how it works\"\n\nPeople can spend money on what they like, you clown. It's a video game studio, not a terrorist group.", "label": 1}
{"text": "How other people spend their money affects everyone in a way though. It creates trends and the market is worse for other people even if the masses don't care", "label": 1}
{"text": "Weird, long and offensive way to admit you don't understand a thing.\n\nWe literally didn't get Warcraft 4 because a single mount made more money than Frozen Throne.", "label": 1}
{"text": "Thank you for your submission Rude-Visit-8821. It has been removed from /r/wow because:\r\n\r\nNo generic memes. All memes must contain WoW imagery (icons, faces, anything in-game).\r\n\r\n\r\n\r\n\r\n---\r\n\r\nThis is not an automated removal. Please read the entire removal reason before contacting us via modmail or here if you need clarification.\r\n\r\nRead the full [rules for this subreddit here.](https://www.reddit.com/r/wow/wiki/rules)  If you feel this post was removed in error, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fwow).", "label": 1}
{"text": "Eh, it's a bunch of people shouting at clouds, imo. It's people paying Blizzard monthly for a subscription yelling at people for paying Blizzard a bit more money for a mount. lmao\n\nIf these people really cared to rally against bad business practices they'd move on to another game and stop supporting it.", "label": 1}
{"text": "Rob my wallet? Is blizzard ripping cash from your checking account?\n\nDon't buy it if you don't want it. Are you incapable of making financial decisions? Are you a child?", "label": 1}
{"text": "Exactly. Ironically it happened before.\n\nCelestial Steed 2.0 this is.", "label": 1}
{"text": "Someone just needs to make a weak aura that auto blocks/auto declines anyone who bought this mount from group content. Then we can show the paypigs whatfor by completely ostracized them like they deserve.", "label": 1}
{"text": "All the people making arguments for why I/we are wrong - it's proven we are right, you guys just forgot.\n\nGood thing - the combination of Blizz peeing in our faces and the community opening their mouthes and loling about me for not swallowing like they do made me quit after starting again with TWW.", "label": 1}
{"text": ">We literally do not get a new Warcraft game because a single mount makes more revenue.\n\nWeird take. that's like saying we don't get new star wars content because the merch makes more money. Not to mention, a new expac literally just came out, and they're releasing new content faster than ever.", "label": 1}
{"text": "I've been trying to voice that on a few posts and yeah...it's not received well. It's like a vacuum chamber.\n\nBut not ALL hope is lost, someone actually reminded me of the atrocity that was d4 and jogged my memory on the overwatch loot box fiasco that...needed GENUINE legislation to protect the consumers.\n\nIt's sad how many people struggle with addiction. It's definitely an addictive gameplay loop which they're free to capitalize on, but lacing predatory market practices on top of the sub model...they're already raking in plenty from their players it's tragic they're looking to become genuine cash vampires\n\nBut I think majority rules here...the people voted with their wallets though. this will definitely open the floodgates", "label": 1}
{"text": "Yeah, just that we KNOW that this is the case for Warcraft and we don't know about for Star Wars.\n\nThis is not a debate. We KNOW this is the case. I am not making that up.", "label": 1}
{"text": "Yeah, leave while you can. I will sit this one out due to my RP realm and friends here. But I likely will stop with Last Titan. Same way I did with Destiny 2 with Final Shape.", "label": 1}
{"text": "To be honest, this stuff sadly ain't a trend anymore, it's already become the norm. And in general it's becoming harder and harder to fight against it as more and more people grow up with and accepting it.\n\nBest you can do nowadays is just hope the monetization of a game isn't absolute shit. Praise it for that. And celebrate if it doesn't have any at all.\n\nIn a week, all this talk is forgotten. In a year, there's gonna be a new 90$ mount.", "label": 1}
{"text": "True enough. I've been meaning to go for more indie games, been trying to get my brother away from this one but the sunken cost fallacy is REAL.\n\nNothing like letting go of something you've invested 20 years into....it's a damn shame.", "label": 1}
{"text": "Okay they should start charging more than 50$ for the expansion and more than 15$ a month for the subscription instead of the optional mount. Better?", "label": 1}
{"text": "I mean we don't get a new Warcraft game because RTS games are essentially dead.", "label": 1}
{"text": "yeah you brokies are salty you ain't us ballers", "label": 1}
{"text": "That's not true, lol.\n\nEspecially this and next year shows that is false.", "label": 1}
{"text": "What kind of argument is that, lol?", "label": 1}
{"text": "\"RTS is essentially dead\" \"What RTS is absolutely killing it right now?\"\n\n  \nAh yes, the only two options.\n\nI don't engage in dishonest arguments", "label": 1}
{"text": "So...you expect them to make a game to do lukewarm numbers? Why the hell would a company invest millions in that?", "label": 1}
{"text": "I have a hard time grasping how much of a hard time you have grasping things", "label": 1}
{"text": "Gotta fund the extra content somehow.", "label": 1}
{"text": "What extra content? HAHAHA.\n\nThere isn't even customer support anymore.\n\nDude that's hilarious.", "label": 1}
{"text": "Well, we also know the people pitching warcraft 4 went on to found frost giant/make stormgate. It's basically a commercial flop. So we KNOW the executives were somewhat justified in the decision to not make the game.\n\nRTS just isn't what the market wants - it's not that deep.", "label": 1}
{"text": "Because Stormgate flopped (which is a bad SC2 clone) WC4 would have flopped  as well - can't argue with that logic....\n\n  \nBruh.", "label": 1}
{"text": "So we aren’t getting the next expansion in half the time? We haven’t been getting content patches faster since the start of dragonflight? Weird.", "label": 1}
{"text": "A game made by two blizz employees that brought us frozen throne and legacy of the void. If there was really as much potential as you're saying, blizz would have made the game. \n\nMoney talks - if you believe so strongly in the idea, stop complaining about the people NOT doing it, and go support the people that are.", "label": 1}
{"text": "None of them, you're right. Even the one made by the previous SC devs is going to be a flop.", "label": 1}
{"text": "What the F are you on about? hahahahaha bruh.\n\nThis conversation makes no sense, we KNOW I'm right because I only retold what we know from Blizz themselves.", "label": 1}
{"text": "You didn't get WC4 because RTS is a small market and they won't be able to make money on it. WC is the best it's been in a decade. They're running a business, not a charity.", "label": 1}
{"text": "It's something to keep an eye on, but if someone wants to pay $90 for a cosmetic that funds a game enjoy, more power to them.", "label": 1}
{"text": "Go play stormgate", "label": 1}
{"text": "Yeah and thats why I think its useless to go around shaming people individually for buying these things because they shouldnt exist in the first place. I think there should be some sort of regulation that says a company cant release a mount that costs 90 freaking dollars for a game that already asks players from subscription fees. Sadly thats the most unrealistic scenario so Im basically shouting into the void by saying it. If a small percentage of players buy this mount Blizzard have already succeeded and they will be emboldened to do more of this kind of thing, they're clearly not going to self police.", "label": 1}
{"text": "They don't fund the game bruh, you really believe that? For real? Lol... just lol.", "label": 1}
{"text": "Yeah, these games companies can go wild with monetization. MMOs will always have whales. My opinion on how game monetization should be regulated is probably pretty unpopular and more importantly unrealistic, so its pointless for me to expect much actual action.", "label": 1}
{"text": "> Thats silly, players are allowed to voice their opinions on the monetization of the game they play.\n\nI never said they weren't, but it's still hypocritical. End of the day, you're giving them money either way. To stand on a soapbox and claim that the way you give them money verses the way someone else does is what is silly. \"I can give them money because I'm buying this but you can't give them money because you're buying that\" is not a great argument.", "label": 1}
{"text": "Who are you replying to?  Me?  Did you intend to reply with your ignorant statement to someone else?", "label": 1}
{"text": "Faerin was a DEI inclusion. Terribly written character designed to check boxes.", "label": 1}
{"text": "Hard disagree. Faerin is a DEI checklist character.", "label": 1}
{"text": "I just watched that documentary. rip bozo", "label": 1}
{"text": "A lot of it isn't really relevant to the posts I keep seeing. I tried to post general points on r/Blizzard but it got blocked.\n\nI also want to write about everything I read. Because it was a great read. But it ends up being a post that's a mile long.", "label": 1}
{"text": "China fuckin sucks", "label": 1}
{"text": "100% elemental shamans are over-reacting as usual. The fucking specc was doing 26million Aoe burst (there is a video about it posted few days ago).\n\nYour AOE will still be fine, guaran-fucking-teed. Not sure about your single target but i doubt it will be gutter tier either. So many fucking over-whining comments both on reddit and on wowhead whenever a well deserved nerf happens.", "label": 1}
{"text": "it's not \"someone else\" but a person who actually knows what they are talking about unlike malding redditors. \n\nI would fucking bet you real life money that the specc will still be fine overall. The main nerfs are just ascendance and echo chamber which are well deserved. Guaranteed a week from now it will still be top ~8. I mean downvoting and disagreeing is fine but when you neckbeards start to get personal immediately I just block you lmao.", "label": 1}
{"text": "Music to my ears", "label": 1}
{"text": "Coming from an American, it’s tough being #1 all the time. Sometimes I would like to slow it down and be Norwegian for a day or whichever country is fighting for the #2 spot nowadays. But then suddenly freebird comes on the Spotify playlist and I’m tearing my shirt in half to reveal my American flag bald eagle back piece and come back to the realization that I’m a god fearing red blooded AMERICAN BAAAAAABY AINT NO OTHER COUNTRY WANT THE SMOKE, AINT NO OTHER COUNTRY LIKE AMERICA!!!!🇺🇸 THEY HATE US CAUSE THEY ANUS!!!", "label": 1}
{"text": "Lmao. I would think is /s, but have read so many similar bs that I don´t know what to think.", "label": 1}
{"text": "Name 1 Single thing that Americans are #1 ?\nIt’s really true that you are that manipulated by your own media?\nYou have the highest crime rate. Highest poverty. Child poverty. School shootings. Wars. Highest debts. Etc etc etc of all in the western world.\n\nThe western world looks every day and can’t believe what’s going on in the US.", "label": 1}
{"text": "/s to them is just top down view of murica flag", "label": 1}
{"text": ">Name 1 Single thing that Americans are #1 ?\n\nUnderstanding jokes", "label": 1}
{"text": "> Name 1 Single thing that Americans are #1\n\nI dunno buddy you just named 6 things we are #1 in, I recommend you sit down.\n\n*Team America: World Police theme begins playing*", "label": 1}
{"text": "Guns per capita", "label": 1}
{"text": "You just rattled off five things were the best at. 🇺🇸 baby!", "label": 1}
{"text": "You ask him 1 single thing they are #1 and proceed to list 6 things.. are you in need of a 7th or does he win by listing one of yours?", "label": 1}
{"text": "You’re #1 at being dense", "label": 1}
{"text": "Aircraft carriers?", "label": 1}
{"text": "Didn’t know Americans did sarcasm", "label": 1}
{"text": "This comment reeks of russian bot", "label": 1}
{"text": "My dumb ass can make nearly 200,000 a year while people in other countries couldn’t dream of that.", "label": 1}
{"text": "Average delusional american.", "label": 1}
{"text": "I'm increasingly convinced we mostly do sarcasm but most of us aren't very good at it", "label": 1}
{"text": "Apparently, according to some Americans, they have more people per capita than most places!", "label": 1}
{"text": "We don’t get sun here so we conquered the world to go places where there is sun.", "label": 1}
{"text": "WTF IS A KILOMETER 🦅🇺🇸", "label": 1}
{"text": "r/ShitAmericansSay", "label": 1}
{"text": "They absolutely do. They control inflation. They won’t let token prices sit over 300k for long. Couldn’t have players be too wealthy. They artificially value tokens around 250k, especially this early in an expansion", "label": 1}
{"text": "Ok and how much of that is in your bank account atm", "label": 1}
{"text": "#1 at preventing your country from speaking Russian, Chinese, or Farsi probably", "label": 1}
{"text": "No way you read that post that ended in the word anus and took it seriously enough to go off on that jealous little rant.", "label": 1}
{"text": "Jealous 🤣 \n\nOnly Americans will react to this statement, it's just factual.\n\nI know truth hurts.\n\nAnd no I don't take any of the statement seriously.", "label": 1}
{"text": "to the normies downvoting me (for being right): whatever makes you feel better when you're sleeping in your car between jobs LUL", "label": 1}
{"text": "you have to be a special kind of stupid to think that this is going to devs", "label": 1}
{"text": "Yes cause asking people to buy 5 million in Chinese gold to purchase the original one is much healthier for the game…\n\nJesus", "label": 1}
{"text": "Tell your gf not to quit her day job.", "label": 1}
{"text": "🤡", "label": 1}
{"text": "🤡", "label": 1}
{"text": "I assume based on your room temperature IQ that you're probably American, but a weeks worth of groceries for one person is double the price it costs in New Zealand. Meaning the problem is with blizzard and not the government that runs a far nicer place to live, ignorant fuck", "label": 1}
{"text": "🤡", "label": 1}
{"text": "🤡", "label": 1}
{"text": "🤡", "label": 1}
{"text": "This is how racism starts If anyone of you ever wondered. \n\n\nOP Had Two Bad experiences and IS of course a little dumb", "label": 1}
{"text": "Bro I’m not even reading all this go outsideeeee on godddddddd", "label": 1}
{"text": "Bruh what?", "label": 1}
{"text": "You people are schizos, literally inventing new reasons to be mad.", "label": 1}
{"text": ">It used to be with sub to get high quality content and great in game rewards for lot activities\n\n\nAm I going crazy? This anniversary patch has comparable content to a major patch like call of the crusade, and it's a x.5 patch....\n\n\nThis sub is going insane, you people will never be happy, they could literally give you everything the second you login in game and you would still find a way to blame the 90$ mount.", "label": 1}
{"text": "Hey, don't put my tiny dick in the same bag as Activision.", "label": 1}
{"text": "Ok, lets be clear, its China, gold farmers etc. But! I presume they will release it lets say month from now for Eu/Usa .... And guess what?! People gonna buy it! For sure. Dont lie on reddit, be nice.", "label": 1}
{"text": "people downvoting you because your right lol blizz fanboys are something", "label": 1}
{"text": "web racism lmao", "label": 1}
{"text": "Once again, you're completely missing the point that you're playing with other humans. When you're constantly doing stuff incorrectly and wiping the group, or standing in the same spot for several minutes, due to your issue, you're wasting other people's time.\n\nIf you find a group you let know beforehand \"hey I've got some issues\" and they agree that's one thing, but you don't. Turns out, MOST people have issues, me included! Biggest thing is that you want people to treat you like everyone else, but with special kid gloves? \n\nYou are lost in the sauce, i would take the post down and stop asking the internet for advice.", "label": 1}
{"text": "I try to be. But if you’re in my group doing nothing you’re getting a kick out of", "label": 1}
{"text": "I haven’t wiped the group and never said I did. I don’t stand for several minutes. ", "label": 1}
{"text": "Stop this already the cry about this mount has gone to far, go to China or countries like that if your don’t agree with our economic system.", "label": 1}
{"text": "I'm glad to hear some people do this, because my server seems to be full of people TRYING to stop others from tagging before it dies.", "label": 1}
{"text": "I mean, they aren't stupid, they're just dicks. Stealing the kill to make sure you get credit doesn't make you STUPID, because it doesn't hurt the person doing it.", "label": 1}
{"text": "Technically rping as a racist is someone enjoying the game in their own way and I kind of accept it.", "label": 1}
{"text": "Change that second a to a d ya depressing fuck", "label": 1}
{"text": "Nah, this is what getting old and believing the right wingers feels like.", "label": 1}
{"text": "I suspect your downvote means you actually do understand the meaning. Right-wingers tend to focus on hate.", "label": 1}
{"text": "BRD has more boss fights with less reused assets than Trial of the crusader, every single boss of toc is reused.\n\nThe \"raid\" and \"dungeon\" are a one room instance, truly so much work went into that, I guess I can call chromie's codex a raid.\n\n\nThe anniversary has 13 tier sets, a major wrath patch has 6 sets that look like leveling gear.\n\nMost of the argent tournament cosmetics were locked behind daily chores, the anniversary is one hour of weekly activities.\n\nBut thank god for isle of conquest, barely saving a major wrath patch from getting mogged by a x.5 modern patch, oh and all those features, so many features you couldn't even name one lmao\n\n12 million subs and a major wrath patch barely beating a x.5 patch but I'm the one that should delete the post, delusional.", "label": 1}
{"text": "HAHAHA is this small indie company? No right? We expect something from them since we are paying to play their game. \n\nIm asking not complaining. If theres a dick sucking contest for blizzard im sure you'd win.", "label": 1}
{"text": "So you concede my points and instead fallback to insulting me and a typical thought terminating cliche of 'it is what it is\" and \"thats capitalism\". Thats the level of discourse I am used to from the average wow sub.", "label": 1}
{"text": "Smells like poor in this post", "label": 1}
{"text": "Truly. Not to make WoW players out as saints but they could be gacha players. People who’s spend hundreds or even thousands of dollars for animated jpgs or 3d models that just look different. There was no need beyond the consumers desire to own it. There is no service provided that they didn’t not already have access to. \n\nSure, $90 is a lot for this mount. At least you get something out of it. The ship had sailed on MtX. I mean, you can go spend $265 on a. Chinese sever for just a flying mount or $450 to Riot for an Ahri skin. The consumers have spoken.", "label": 1}
{"text": "🤦", "label": 1}
{"text": "Report for racism\n\n/s", "label": 1}
{"text": "i mean it was kind of weird that he was e-dating girls and lying about himself and not revealing his disability to get them to fall romantically for him", "label": 1}
{"text": "Why are people giving him advice he's just going to forget it", "label": 1}
{"text": "Why bother trying to change your mind when you don't grasp basic finance. Money for company = good. If people no like game they no give money, game is bad.", "label": 1}
{"text": "that’s literally racist", "label": 1}
{"text": "I’m not a he and that’s not how my brain injury works", "label": 1}
{"text": "So other people but mounts, my sub price stays low. They stop making profit my sub price goes up. 0:", "label": 1}
{"text": "It sounds like you played WoW during the 'golden era'. Unfortunately, over the years the game community has gone way downhill. You can't just join a random group and play and have fun anymore. For example, there is an addon called raiderio, it basically tracks your performance in dungeons & raids (something like that, I have never used it, someone else can explain it better). But basically, if you don't have a HIGH IO score, teams will not even let you in. So all the mythic & raid teams in the dungeon finder that you request to join will see that you either a) don't have an IO score (Like me, cuz I refuse to use the stupid addon), or b) you have an IO score that is not in the top 10% percentile, and they will ignore all your requests to join the team. You might also be refused admittance to a team if your ilevel is too low, in their opinion. If you just join a random normal dungeon team, people will kick you for any reason, including: a) they don't like your name, b) you're character is a void elf c) you make a single mistake like aggro something d) they fucked up, but they blame it on you and call a kick vote for you. Everyone automatically votes yes for all kick votes btw, whether you did anything or not, especially if you are dps. \n\nIf you want to do the highest level endgame raiding and mythics, you'll quickly hate life. If you just truly casual though, the game can be perfectly enjoyable to play solo. You'll just never get the highest ilevel possible. I haven't done a mythic or raid since Legion, and I don't miss it. The game is actually way better since I stopped chasing ilevel.", "label": 1}
{"text": "Sounding pretty impoverished", "label": 1}
{"text": "That's a vagina, not a brain injury.", "label": 1}
{"text": "no one cares about your dumb coomer drawing", "label": 1}
{"text": "I got in a similar flamewar, and conclude just as most players aren't theory crafters, most players have zero prerequisite understanding of economic and social issues needed to understand why this is a problem.", "label": 1}
{"text": ">we are not required to stay in a key to carry your friend who doesn’t want to grind like the rest of us\n\nYou are far better off looking at everyone in the group before starting the key rather than being a dick and leaving after the key has started.  This way you don't waste anyone's time including your own along with depleting someone's key in the process...", "label": 1}
{"text": "Fuck yerself and fuck blizzard for releasing the mount and fucking players who have played for awhile.", "label": 1}
{"text": "Instructions unclear, dick stuck in Shadowlands.", "label": 1}
{"text": "Your attitude smells worse than my kids breath in the morning, and it stinks like garbage.", "label": 1}
{"text": "Batman couldn't even drag that embarrassing shit out of me if he tried, corporate financial domination must be your kink.", "label": 1}
{"text": "I’ve seen people vote kick people from groups, for loot or just being trolls(calling for vote). Reasons(fake ofc) where: Racist(with no chat,other than hellos at start),auto attacking(and people where first or second in DPS),etc.  So basically not at fault, and still got kicked, because most are sheeps, clicking without thinking, and trolls got their way. So it could be nothing, some morons enjoy hurting people, even just emotionally.", "label": 1}
{"text": "You can do what you want. But I can also think you are a sucker for it.", "label": 1}
{"text": ">You are far better off looking at everyone in the group before starting the key rather than being a dick and leaving after the key has started.\n\nIf you want to carry your friend tell the pug and dont act offended once they find out after you tried to hide it.", "label": 1}
{"text": "My main is a black night elf and has been for the past 20 years and I never experienced this but I have always been on a low population RP server .\nI have however experienced racism and even sexism on a higher population PVP realm where I played a blood elf holy paladin. I think this kind of rudeness happens more on pvp realms which is why I stopped playing there.", "label": 1}
{"text": "Or the fat kid wobble when they run. I'm not sure why it bothers me, but I find it hard to watch", "label": 1}
{"text": "Ok so I'm going to annoy everyone I know into playing wow so they can support a company? \n\nI'm not buying the mount but I'm happy it exist so everyone keeps my sub price low.", "label": 1}
{"text": "No one has to treat you with kid gloves and tell you what a good boy you are either", "label": 1}
{"text": "???? are you all drunk", "label": 1}
{"text": "No if I was it might make reading departure announcement threads more bearable", "label": 1}
{"text": "I don't act toxic, but most players are only pushing rating. People have limited time and blame others for wasting 30-40 minutes. Same shit happens in MMOs etc then only reward is more numbers", "label": 1}
{"text": "\"Heh, nothing personal guys, just trying to sell this vanilla belt, heh. Totally didn't know it was the mount. Heh.\"\n\n- someone in dire need of validation from random people off the internet, 2024", "label": 1}
{"text": "The irony isn’t lost. It’s clearly meant to be a flex. \n\n“Pitiful plebs.”", "label": 1}
{"text": "Why? You can just buy the new mount with gold too.", "label": 1}
{"text": "I've done it three times now.\n\nThe first time I did it, it was very fast and I had to do nothing.\n\nThe second time was very slow, I had to fuck off.\n\nThe third time was also slow, but I heard running around the basket instead of going in is faster so I did that. Took maybe 8 mins. Was able to get the buff before my dps que popped.\n\nIdunno what I did the first time that made it so wonderful but that was the best one.", "label": 1}
{"text": "Tasteless comment. Disgusting", "label": 1}
{"text": "Only if you buy tokens. And remind me, what do people have to do to be able to sell you those tokens? Is it spend $20 per token? For every token you buy, you're reinforcing buying gold for real money. Why do you think blizz only made it available  with a real money purchase, instead of an in-game vendor?\n\nAt least with the OG bruto, it was buyable with straight gold, no token middle man.", "label": 1}
{"text": "Bro tokens existed when the OG bruto was out, and it took 40 tokens instead of 6. And why do you hate it if Blizzard makes money? You hate WoW? Shit like this is okay, Blizzard makes money, I get a mount I like, and some other person gets to save grinding gold for 5 hours and instead actually play the game. There are zero losers.", "label": 1}
{"text": "And yet we could put a stop to this by voting with our wallets, but the whales are gonna whale and shills are going to keep defending these disgusting cash grabs.", "label": 1}
{"text": "Then blame the people selling tokens because they need gold. But no then all the mouthbreathers come out and cry that they don't have time to farm gold the convertionel way.  \n\nThe wow token itself is the problem.", "label": 1}
{"text": "Use this mog when you want to signal to the world you're attracted to minors.", "label": 1}
{"text": "Others would argue the wow token is motivation.", "label": 1}
{"text": "Look I've had enough of your logic and reason ok.", "label": 1}
{"text": "It’s a step beyond pay to compete. Which is a step below p2w it’s between pay to compete and pay to win. So you being a dick doesn’t further the conversation. He does have a point you just don’t both agree exactly where it’s at.", "label": 1}
{"text": "If you mean they are paying because they spent time farming gold, and time is money, then oh boy, that is such a low IQ take.\n\nWoW is a hobby. You spend time in it as a hobby. Assuming you're not some Chinese gold seller or something, and you're making gold in the game, then making gold is merely a part of that hobby. You do it because it's enjoyable. You can spend that gold in WoW things if you wish. You already have the gold as a byproduct of your hobby, why not use it? It all feeds into itself and you're not actually spending any real money.\n\nThe idea that \"time is money, therefore when you spend gold you're REALLY spending money at the end of the day! I'm so smart!\" would imply that literally every single second you're not at work you're actually losing money. It implies you are incapable of seeing the value in activities that are not related to money so you just turn them into some sort of abomination in your mind that is reduced to just \"spending time so spending money\". Assuming you truly do think this way and you're just being an internet sour person saying silly things they don't really mean because they are sour, then I would urge you to seek mental assistance.", "label": 1}
{"text": "Because they are stupid. Like legit sub 10 IQ people.", "label": 1}
{"text": "christ, i even unfollowed this reddit to avoid clueless dog shit posts like this. OP, please, stop talking. you are absolutely clueless.", "label": 1}
{"text": "I think it's most surprising that people think this works. Most voter made up their mind months ago", "label": 1}
{"text": "test?", "label": 1}
{"text": "You’d be surprised at how many empaths there are in this world that care about literally every single stranger in the entire world they’ve never met.  Children dying of cancer, people getting shot, people getting killed in war zones, it’s hard to care about one person when the entire world is pretty fucked up. People die horrendous deaths every single day.", "label": 1}
{"text": "Congrats on the PC! My tip is take your time finding a class you find most enjoyable to play.", "label": 1}
{"text": "Legion is one of my favorites.", "label": 1}
{"text": "Bellular on YouTube is pretty great.", "label": 1}
{"text": "Keep using curse forge. This is an addon for inside wow to manage addons from there.", "label": 1}
{"text": "This is so reductionist lol. People don't mind playing the game to get stuff. It's when you have to play the game too much to get stuff it becomes a pain point.", "label": 1}
{"text": "How deep down your throat have you shoved blizzards long boi?", "label": 1}
{"text": "Who gives a shit about low dps for non-M+ dungeon. Fucking troll.", "label": 1}
{"text": "Make an actual point first, dipshit, instead of regurgitating words and concepts which you clearly do not understand, and maybe I will be able to respond in a way that is palatable to your sensibilities.\n\n”It will look bad! YOUR GPU WILL MELT!!! COLoR tHEoRY!!!!!” — words of a deranged lunatic", "label": 1}
{"text": "Fucking.\n\nCommunities.\n\nJoin them.", "label": 1}
{"text": ">It's when you have to play the game **too much to get stuff it becomes a pain point** that people start minding.\n\nBolding the part because the_trollanzo can't read ;).", "label": 1}
{"text": "LOL you looked through my post history. Of course you did. What a fucking reddit brained thing to do. I don't give a fuck about karma. People can downvote me for being right all they want.", "label": 1}
{"text": "Beats main character syndrome and crying on reddit about nobody recognizing your main character status.", "label": 1}
{"text": "Pretty rude behaviour to be condescending to this fellow who's actually trying to help and give advice, but I suppose you proof his point, which is quite ironic.", "label": 1}
{"text": "Hey, at least I'm not complaining on reddit how other people aren't recognizing my position as the main character.", "label": 1}
{"text": "He says, after complaining about people not recognizing him as the main character on reddit.", "label": 1}
{"text": "Stop using someone else's death as a way to \"fit in\" or get attention.", "label": 1}
{"text": "Exactly. That's life. People like this use the death of others to like \"fit in\" or something, get a digital pat on the back or a virtual hug by other lonely people. I just don't understand it.", "label": 1}
{"text": "10/10 would smash", "label": 1}
{"text": "Home... It is a home and always will be the home. Anyone from WoW LC is here? :)", "label": 1}
{"text": "Na", "label": 1}
{"text": "Dude.. you’re kind of a piece of shit.", "label": 1}
{"text": "Omg so based, P2W content in World of Warcraft, the buy 2 play, subscription based MMO with a huge MTX shop! So based and epic! \n\nI can't imagine being so cucked as to defend this insane shit.", "label": 1}
{"text": "How can you be so fucking dense to not only typing this comment, but also not stop you from posting it.", "label": 1}
{"text": "What's p2w about it ?", "label": 1}
{"text": "The fact that you're paying for a mount that has utility not found anywhere else in the game :)", "label": 1}
{"text": "Mailboxes exist, and auction house exists.", "label": 1}
{"text": "P2W isn't just about DPS or combat. It's about selling convenience at the endgame.\n\nMuch like how P2W in Black Desert Online is a 45$ tent that offers you the ability to repair during your grind, the P2W here is the ability to have a mailbox/auctionhouse wherever you are. \n\nNow you can diminish this by going, 'ERM, ACKSHUALLY, THEY AREN'T SELLING GEAR SO...', but considering this is the first step into P2W content, I won't doubt they'll start selling faster mounts on the MTX Store in thee next few years as well.", "label": 1}
{"text": "By this logic, nothing can ever be P2W because it all exists. \"Oh, are you selling BiS gear on the Cash shop? That's not P2W because it exists.\" \n\nNo one engages in P2W conversations like this.\n\nP2W is essentially about making endgame routines a lot more convenient through the granting of a FORM of player power, not just DPS, but also convenience and speed.", "label": 1}
{"text": ">  What does buying the best in slot gear in the game let you \"win\"?\n\n\nPlayer power?\n\n\n>What does buying gold let you \"win\"?\n\n\nDepends on what you spend it on, could be mounts which lacks player power element, could be gear which could increase player power.\n\n\n>Saving time is one of the most important elements of accomplishing quite literally ANYTHING in the game\n\n\nSo technically portable crafting tables and portable mailboxes are p2w? New Bear mount is pay to win since you can repair instantly saving you time?", "label": 1}
{"text": ">Player power?\n\nDo you think player power is just when number go up? Or do you recognize that there can be other elements that influence this?\n\nFor example, if they right now released a 100$ boost to the bronze currency used in the cosmetic T2 anniversary event that earns you double the currency, that would be P2W. Because the win condition is buying the cosmetic, and you can achieve that twice as fast if you were to buy into it. \n\n>Depends on what you spend it on, could be mounts which lacks player power element, could be gear which could increase player power.\n\nNo, it doesn't. \n\n>So technically portable crafting tables and portable mailboxes are p2w? New Bear mount is pay to win since you can repair instantly saving you time?\n\nAre these things all buyable on the MTX store? If yes, then yes. If no, then no. \n\nRegardless of the cope you want to engage in or not, the reality is, paying for any form of endgame convenience, whether it be expedited progression or convenience, is a form of pay 2 win, and it has never been more blatant in this. And seeing people like you bend over backward to excuse it is exactly why I, alongside all my friends, quit this game.", "label": 1}
{"text": "Convenience is not p2w", "label": 1}
{"text": "P2W to you is just buying player power? So blizzard could sell professions boosts, flying mounts that are 2x as fast as base game ones, special portals you can use to teleport ANYWHERE at ANYTIME, and all of that to you would be perfectly okay?", "label": 1}
{"text": "It won't take 3 fucking months you dong. Takes 3 weeks to get the 100 bronze achievement and then you can grind out the rest either by playing the game normally or by going hard tilt into grinding.", "label": 1}
{"text": "Next time, Blizzard should just auto add all the quests to you quest log. I wonder if thats enough babying for you people", "label": 1}
{"text": "\"P2W to you is just buying player power?\"\n\nLiterally yes, it is.", "label": 1}
{"text": "Yep you heard it here first boys, transmog beacon is infact pay2win", "label": 1}
{"text": "Right? I'm so sick of this dogshit model where they tricklefeed a time limited currency, and if you don't spend hours researching what to do and planning out your optimal chore list, then you're just fucked.\n\nI actually made this exact complaint last week and the community basically said fuck off if you don't like it. Must be hard work riding blizzards dick 24/7 lol", "label": 1}
{"text": "Oh, so you don´t play the game; just are here to shout random rants. Ok.", "label": 1}
{"text": "The OG bruto still is available in game with in game currency via the BMAH. And there are a handful of in game items and racial abilities that give you mail access anywhere. \n\nSo how is the utility not found anywhere else?", "label": 1}
{"text": ">So how is the utility not found anywhere else?\n\nBecause it doesn't have a mailbox. \n\n>The OG bruto still is available in game with in game currency via the BMAH. And there are a handful of in game items and racial abilities that give you mail access anywhere.\n\nYou know full well this is not even remotely equivalent here. \"Just change race,\" is quite literally another MTX operation, lol. \n\nNo other mount, in the game, offers this convenience. Period.", "label": 1}
{"text": "[Same vibes](https://preview.redd.it/carlene-was-not-a-model-she-was-the-blueprint-v0-gz0al5qbg6ub1.png?width=640&crop=smart&auto=webp&s=7bf4679582902a94f01063af0b44adbb974af66d)", "label": 1}
{"text": "You're the dumb one for taking a tax analogy as literal", "label": 1}
{"text": "Uppies or Roofies is the question eh?", "label": 1}
{"text": "Ah lol i was looking under legacy raids and had PGF on for TWW tab, thanks!", "label": 1}
{"text": "...why?", "label": 1}
{"text": "Insanely addicted fanboys. They're still in this thread.", "label": 1}
{"text": "DICK RIDAAAAAA", "label": 1}
{"text": "I’ve felt the same way when grinding for rewards that don’t quite match the effort. Having a way to earn tokens through more varied activities like timewalking dungeons or random BGs could keep things fresh and engaging. Have you tried tools like Buff and GameJolt? Pulse for Reddit also offers great engagement strategies.", "label": 1}
{"text": "Really wonder why folks who say stuff like that even play the game.", "label": 1}
{"text": "I'm confused, you're the one that said it? Did you forget to switch accounts?", "label": 1}
{"text": "I was referring to what *you* said.", "label": 1}
{"text": "That doesn't make any sense?\n\nSo you're saying that people should quit playing a game any time there is a massive bug? Like, what are you even talking about?", "label": 1}
{"text": "Hm. Guess I need to be *really* specific here. Here, take my hand, I'll walk you through it:\n\nI was referring to the totality of your comment. You took a dig at me and the game's devs, by commenting that I must be one of the devs. You based this dig on my comment that I don't think a bug limited to PvP is a \"spec-defining\" bug, and you took that dig at the active exclusion of engaging in actual conversation regarding the point.\n\nSo I wonder why, if you think so little of the devs that you would make that comment - and, indeed, so little of the devs that you immediately forgot you made that comment - you even bother playing this game.", "label": 1}
{"text": "anni patch was absolutely undercooked, but HAD to be pushed out, breaking fucking everything in the game\n\nhope they learned and wont do this shit again (lmao)", "label": 1}
{"text": "The Virgin to rule them all!", "label": 1}
{"text": "Well, this was exactly what the players told everyone in BfA and Shadowlands. In the end, you guys cried a lot because you were left alone. Hey, be my guest and be the special snowflake among the leftover players.\n\nIt seems people like you never learn, just cry at the end and act surprised. This tells me that this is shadowlands all over again.", "label": 1}
{"text": "\"Mind your Tender— with the upcoming November Trading Post we’ll be bringing back last year’s armor sets and transmog weapon sets. Each armor set comes with three pieces: helm, shoulder, and belt, and each weapon set comes with 3 weapons.\nClass Restrictions Lifted\nPlayers will now be able to purchase these items with any class character to add to your transmog collection and any class that can wear or use that item transmog can. So, if you have a mail user, they will be able to wear any mail armor set transmog and if your class can use one-hand maces, you’ll be able to use any of the mace transmogs, etc.\"\n\nAtleast quote the right blue Post you insuffarable moron", "label": 1}
{"text": "oh its alright, just cant stand stupid people like you :)", "label": 1}
{"text": "Oh my God.\n\nI didn't need you to write all that to defend your concerns about PvP. I was asking: If you believe the devs care so little, why do you play the game at all?", "label": 1}
{"text": "Good job doubling down on a ridiculous question that makes less than zero sense.\n\nAgain, since you didn't seem to pick up on it the first time, I don't believe they care so little, I am stating a fact.\n\nI play the game for the same reason anyone plays any game? Because I enjoy it? What an absolutely moronic question.", "label": 1}
{"text": "If you say so, kiddo.", "label": 1}
{"text": "boobies", "label": 1}
{"text": "hope your apple TV still bricked", "label": 1}
{"text": "there's a reason she ghosted u soy boy", "label": 1}
{"text": "Are you schizophrenic or why did you have troubles recognizing the part where your comment was quoted?", "label": 1}
{"text": "lol you edited your comment after my reply and i'm the schizo?\n\npoint stands. try not being a hysterical woman for 5 seconds.", "label": 1}
{"text": "Bro I saw a cutscene of xalanath or whatever her name is with bare feet and this xpac we can remove pants mogs entirely. So I've come to the conclusion this Xpac should've been named The Simp Within.", "label": 1}
{"text": "Oh great a ff14 circlejerk cat boy.\n\nHaving 10 characters at max level and expecting equal progression is insane for any rpg game. Nobody is forcing you to do 8 delves a week for every character, if you enjoy sucking Yoshida's dick so much please stay there.", "label": 1}
{"text": "I'm not gonna read past the first idiot sentence. Go find somewhere else to spew out your toxic waste.", "label": 1}
{"text": "Holy its not a big deal grow up", "label": 1}
{"text": "My bad for expecting reading comprehension from randoms on the internet", "label": 1}
{"text": "Hiya, RestaurantIll6138.  \nThis thread has been removed from r/wow because the title is in all caps. You can still see it, but nobody else can.  \nText in all caps [is harder to read and people pay less attention to it](https://www.mity.com.au/blog/writing-readable-content-and-why-all-caps-is-so-hard-to-read).\nFeel free to resubmit your post with a different title.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wow) if you have any questions or concerns.*", "label": 1}
{"text": "In addition to that some generally brain dead takes for other subs.", "label": 1}
{"text": "Snowflake generation 💀", "label": 1}
{"text": "sNoWFlAkE GeNeRatIon \n\nShut up dude. \n\nThey are using someone’s likeness who is literally dead to promote the community they operate. \n\nToxic ass holes like you is the reason WOW has become a cesspool of hate and division.", "label": 1}
{"text": "> People like you who go into keys blind and expect the group to pick up your slack or to do bricked keys \n\nLiterally not me lmao.\n\nStop projecting your own ineptitude onto me. Plenty of people are capable of using their brains in the middle of a run and having good reactions.", "label": 1}
{"text": "Weak men who are used to feeling insecure and powerless will cling to positions of power whenever they are allowed to grasp it.", "label": 1}
{"text": "Oh my god he literally is a gooner with a yoga pants fetish", "label": 1}
{"text": "You know your post history is public right?", "label": 1}
{"text": "Oh okay yeah for your girlfriend\n\nNot for your \"cum on clothes\" fetish (so that's a sub Reddit huh)\n\nPlease stay banned ya degen", "label": 1}
{"text": "I’ll sum up all these other paragraph answers with : \n\nMental Illness.\n\nSelf Medication.\n\nA purposeless, sad life.", "label": 1}
{"text": "Its almost like corporations have way too much power and can just rip off their customers without us having any power to fight back. \n\n  \nReally wish the west wasnt this spineless.", "label": 1}
{"text": "I hope your shirt fall below your butt when you wipe.", "label": 1}
{"text": "Ban u/Lost_Log4035 what a piece of shit", "label": 1}
{"text": "What a huge nothingburger. It's a harmless mention of the film.", "label": 1}
{"text": "I had a brief look at your comment history, take a look in the mirror.\n\n> Aww the wittle suicidal bitch is twiggered. Do the world a favor and end it early you pathetic little fuck", "label": 1}
{"text": "Thank you for your submission HolgerDK. It has been removed from /r/wow because:\r\n\r\nTransmog posts require an item list. Warband pictures are considered transmog and are also subject to these rules.\r\n\r\nItem lists should be top level comments (i.e. not a reply to some other comment) and actually in list form (i.e. do not write \"it's mostly t6, but t8 shoulders and pvp tabard\"). \r\n\r\nIncluding the item list in the image alone is not sufficient for accessibility reasons. You will still need to provide a top level comment. \r\n\r\nIf you provide the list and respond to this removal message to let us know, we will reinstate your post. \r\n\r\n\r\n\r\n---\r\n\r\nThis is not an automated removal. Please read the entire removal reason before contacting us via modmail or here if you need clarification.\r\n\r\nRead the full [rules for this subreddit here.](https://www.reddit.com/r/wow/wiki/rules)  If you feel this post was removed in error, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fwow).", "label": 1}
{"text": "You can't have \"empathy\" for the dead lol. It's physically impossible.", "label": 1}
{"text": "My post does have en item list - look at the picture.....", "label": 1}
{"text": "Snowflake allert.", "label": 1}
{"text": "Thank you for your submission JT99-FirstBallot. It has been removed from /r/wow because:\r\n\r\nTransmog posts require an item list. Warband pictures are considered transmog and are also subject to these rules.\r\n\r\nItem lists should be top level comments (i.e. not a reply to some other comment) and actually in list form (i.e. do not write \"it's mostly t6, but t8 shoulders and pvp tabard\"). \r\n\r\nIncluding the item list in the image alone is not sufficient for accessibility reasons. You will still need to provide a top level comment. \r\n\r\nIf you provide the list and respond to this removal message to let us know, we will reinstate your post. \r\n\r\n\r\n\r\n---\r\n\r\nThis is not an automated removal. Please read the entire removal reason before contacting us via modmail or here if you need clarification.\r\n\r\nRead the full [rules for this subreddit here.](https://www.reddit.com/r/wow/wiki/rules)  If you feel this post was removed in error, please [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fwow).", "label": 1}
{"text": "We get it Boomeroo, your ego is fragile", "label": 1}
{"text": "We get it Boomeroo, your ego is fragile enough to astro turf", "label": 1}
{"text": "what?", "label": 1}
{"text": "yo no tengo ninguna misión y me pasa igual, pero si me he fijado que en el portal oscuro están los NPC como dispuestos para ir a draenor e mirado en cromi y muchas cosas pero no tengo ninguna mision de warlord of draenor y no se que hacer", "label": 1}
{"text": "We do not allow or facilitate call outs, witch-hunts, or smear campaigns of any kind.\n\n- Do not address individuals.\n\n- Do not rile up the community to boycott or support a specific person or organization.\n\nIf posting a screenshot of your game, please block out all character and guild names unless the post is not negative and the names are required to understand your submission, such as puns or coincidental names.", "label": 1}
{"text": "I see that Blizz is treating the Alliance like China treats its garbage. Coincidence? I think not...", "label": 1}
{"text": "You're not actually.\n\nCheckers, bitch.", "label": 1}
{"text": "Nah, I'll pass on engaging with racist bait. You know what you're doing.", "label": 1}
{"text": "\"I'm above you because I'll pass on commenting even though this is a comment, just to let you know I'm not commenting.  That means I win.\"\n\nIn case anyone needs a translation.", "label": 1}
{"text": "Wash, dry, and powder your ass.  You don't want to get a rash, sweetheart.", "label": 1}
{"text": "Dude, what the hell is wrong with you?\n\nHow dense does someone have to be to call a person who was born with a fatal disease \"someone who off himself\"?", "label": 1}
{"text": "!remindme 30 days", "label": 1}
{"text": "Imagine someone was ruining your game irl, say a cop. Now imagine that cop cockblocks you from your Grindr date.\n\nThat’s why kicks exist", "label": 1}
{"text": "I want to grind my shadow priest so bad but I gotta work tomorrow 🤪", "label": 1}
{"text": "Found the shill", "label": 1}
{"text": "4gy 4th is good right 3 6th 581 03444262we4 u54å6w545576540å50323g4", "label": 1}
{"text": "this will be a huge shock to you, so if your chair has armrests, you may want to hold onto them. if you have a trusted human near you, ask them to hold you while reading this. here is the answer, you have been warned: some people play the game to enjoy it, not to run through empty rooms with dead mobs. whoaaaaaaa.", "label": 1}
{"text": "That would be beyond epic!", "label": 1}
{"text": "My dude or dudette, you've got to step back and not think of this as an attack. Please rethink how you take in feddback/comments", "label": 1}
{"text": "Again, I didn't ask.\n\nWhen someone barges in on what you're doing and starts saying things like: \"You shouldn't be doing that!\" when there's frankly nothing wrong with what they're doing, that's rude.\n\nLike, imagine if you were say, painting warhammer miniatures, you said that a wash you like to use that doesn't mesh well with a certain paint tone people like and some random shmuck gets in your face and says: \"Well you shouldn't use that wash anyway, so stop using it.\"\n\nThe way I was taught growing up is that you don't do that.\n\nThe polite way to give feedback is to ask the question first: \"May I ask why you're using that wash?\" then when/if you respond with a reason, reply with. \"Well I think that wash doesn't really work well with most paints of that tone, so you might want to consider using \\[x\\] wash instead, where \\[x\\] is the wash they prefer to use.\"\n\nThen you can say: \"Thanks, I'll keep that in mind.\" or you can not respond at all. But since I've been polite and there's been dialogue up to that point, if you get aggressive and act like an asshole, then you're in the wrong.\n\nTo move back to what happened here though? That's not what I got. I got told \"Shouldn't use pawn anyway.\" even though I didn't ask for feedback or imply it was welcome. Then while you did explain it, it didn't really fix the problem, which is that I never asked for comments on my addon choice in the first place.\n\nSo don't get all precious when I don't tolerate any bullshit.", "label": 1}
{"text": "Except nobody told you specifically not to use it, they said it's fine not to use it (if you wanted to ditch it) the irony of you getting triggered by what you perceive as someone TELLING you what to do, while at the same time trying to tell them how they should be providing feedback because \"that's how I was taught\" is priceless. \n\nPeople are free to say and advice what they want, as you are to not follow up on any of it, I recommend thinking more before commenting and spewing nonsense.", "label": 1}
{"text": "Interesting concept...i don't see where you asked if op wanted to know what critiques you had for this addon.", "label": 1}
{"text": "Ahh yes, doing the exact same content TWW released with is clearly my issue and my inability to enjoy the same content I've already been doing for months. It's not that.. ya know... it's the same content or anything.\n\nWhat a smooth-brained comment.", "label": 1}
{"text": "u/f1refly17 you can buy here! Piggy Cards [https://piggy.cards](https://piggy.cards/) might be a good option. Their fees are way lower than CoinsBee", "label": 1}
{"text": "Try to pug a new father.", "label": 1}
{"text": "A side note, only YOU can hold yourself accountable to therapy. Be a man, take care of yourself. This includes therapy.", "label": 1}
{"text": "Hey there! OPs wife here!\nI decided to snoop cos I saw a glimpse of him being on this post.\nHow about you “be a man” and fuck off 😁\nMy husband was raised in a family that wasn’t about therapy. He is doing a big thing by making this game plan.\nAs much as I truly loved my father-in-law, I’d get so upset each time he made the excuse that he needed to work on his physical health before his mental health.\n\nThis is a hard time for all of us. Show some respect.", "label": 1}
{"text": "If you comment on a public forum, expect people to comment whatever they want. No need to be a snowflake about it.", "label": 1}
{"text": "He's too old for you. Age gap issue. Wait... this isn't/r/relationship_advice", "label": 1}
{"text": "Wahhh wahhh I want everything handed to me without having to work for it.", "label": 1}
{"text": "Why even post this it’s literally nothing", "label": 1}
{"text": "Grats! What a pro! *swoons*", "label": 1}
{"text": "its a 3 day suspension. Don't be a snowflake. Take some personal responsibility and pull yourself up by your boot straps.", "label": 1}
{"text": "Hmm named your character after a person guilty of rape, fraud etc. well deserved, think before naming your toons for diabolical human monsters", "label": 1}
{"text": "Report me", "label": 1}
{"text": "Do you not have any feet pics?", "label": 1}
{"text": "LFM FEET", "label": 1}
{"text": "Feet, queen?", "label": 1}
{"text": "Show feet", "label": 1}
{"text": "Where feet?", "label": 1}
{"text": "Show feet", "label": 1}
{"text": "This isn't about power, this is about DEI.", "label": 1}
{"text": "Grow up neckbeard", "label": 1}
{"text": "No, he went to Romania to have a beer with Andrew Tate then decided to become a monk and moved to china in the mountains.", "label": 1}
{"text": "I'm a gnome, but I identify as a dracthyr.  Where's my racial?", "label": 1}
{"text": "They should bring that back", "label": 1}
{"text": "This guy is a total clown, ignore him lmao", "label": 1}
{"text": "Is this… DEI? In my world.. of Warcraft? 🫨", "label": 1}
{"text": "Now what", "label": 1}
{"text": "Your names Claude atfu", "label": 1}
{"text": "Not here unfortunately. I got perma banned and had to appeal because I openly criticized them. This entire sub is comprised 90% of casuals who suck blizzard's dick for every decision they make and think fishing is a good use of your time and money.", "label": 1}
{"text": "Yeah, and what's next? Breathe less?! Grow up.", "label": 1}
{"text": "Think you should grow up to be honest.", "label": 1}
{"text": "Its ma'am!", "label": 1}
{"text": "I don't see any swastika back but ok", "label": 1}
{"text": "Grow up", "label": 1}
{"text": "Keep your mouth shut.", "label": 1}
{"text": "Whatever loser.", "label": 1}
{"text": "The 3rd highest rated comment here is asking for feet. It was a joke. For some reason you decided to seek me out and start insulting me. Please leave me alone. I did nothing to you. You’re a bully.", "label": 1}
{"text": "Yet they rolled need not tmog. The tmog roll button exists for a reason, for the community members to be good to eachother, to say, if nobody rolls need then whoever wins the tmog roll gets it. Trying to justify rolling need for a fucking tmog when people actually will use an item as an upgrade is a dick move and then some and you should be ashamed for supporting this mentality. Take that shit out of our community. People used to get blacklisted for behaving like this.", "label": 1}
{"text": "> Take that shit out of our community.\n\n no", "label": 1}
{"text": "CoA has done a really good job with the Tinker class. I especially like you sending out little robots that heal. I could do without the \"reload your weapon\" mechanic.", "label": 1}
{"text": "Because I get to roll IF no one needs the upgrade. If you want to run raids where you reserve certain items for transmog that's fine, but you don't get to go into raids and just take stuff from other players. That's why the system has a \"need\" roll, a \"greed\" roll and a \"transmog\" roll.", "label": 1}
{"text": "God this community is going to shit. Such worthless filth polluting it for the rest of us.", "label": 1}
{"text": "I'm sure I know the name already but it's avoiding my little brain at the moment, what's CoA stand for?", "label": 1}
{"text": "Private server, Conquest of Azeroth", "label": 1}
{"text": "Eat shit stupid bot", "label": 1}
{"text": "Your point is dumb as hell. Pandaren ears are short and small. There is little clipping about them. And besides, are you blind? It is impossible for their ears to make any clipping on the photos I have posted XD", "label": 1}
{"text": "Getting rep to 24, you say that like it can be done in a day…\n\nAnd woooooow 1 whole enchanted runed crests… \n\nGet a life you greedy loser", "label": 1}
{"text": "Tinker would be monk level popular at best. Awful name and would suck to go years with no new class except a glorified engineer", "label": 1}
{"text": "The prestige in having those sets is literally doing well in times passed. The irony...\n\nYou aren't entitled to every appearance set they've made as a reward for achieving something when it was current content.\n\nGrow up.", "label": 1}
{"text": "You’re making a lot of assumptions on me based on two words. Just move on with your life. Stop trying so hard to be offended on behalf of other people.", "label": 1}
{"text": "Did wittle man calm down yet? You don't get to watch TV until you finish your lunch sweetheart", "label": 1}
{"text": "It's crazy to me how quickly this conversation turns to \"You just want Blizzard to give you rewards/you just want participation trophies for everything/Do you have a problem with prestige and good players having nice things\" whenever this topic comes up.  \n\n\nLet's be real for a moment: It's a digital commodity, and FOMO tactics aren't put in place to make you the player feel rewarded for your hard work. It has nothing to do with the game's philosophy and how players feel they should be rewarded, because at the end of the day:  \n\n\n**LIMITED TIME CONTENT IS NEVER ABOUT SKILL AND IS ALL ABOUT PRESSURING YOU TO PLAY MORE AND PLAY NOW.**\n\nThe developers are totally happy for taking recolors away, because it's bait. Bait to make you play more. Bait to keep you subbed and engaged. It's never been about prestige, and if we're being honest with ourselves, we'd be more frank about it.\n\nLet's talk about the pandaren phoenixes since that was being discussed fairly frequently during remix. People wanted these to come back because they didn't have the opportunity, while a vocal group came out and spoke widely against it. Even some people who didn't have the phoenixes started talking about how their prestige would be lost if they were added to MoP Remix.\n\nAs someone who has the panda phoenixes, I have to ask: **What prestige are we talking about????** \n\nGetting the **SILVER RANK TIMES** across the board wasn't really all that bad. Hell, taking harder CMs into account (Stormstout Brewery, uhg, even getting all *GOLD* wasn't that bad. The only thing that ever made it rough was if you were playing one of the few specs that got absolutely RAILED by the scaling (Boomies were pretty low performing in CM due to haste scaling), and even then, that was easily circumvented if you wanted the armor set. But we're talking about **the silver rank.** Not even the best of the best. Silver could be accomplished fairly damn easily if you knew a basic rotation and how to play WoW.\n\nBut oh my god, Billy's going to have a stroke if he sees another player outside of he and I riding a Crimson Pandaren Phoenix.\n\nMy 'prestigious' reward right now just feels the same as a promo T-Shirt I got for showing up, and yet someone is way too defensive over theirs. \n\nI don't think it's weird that other people like your cool T-Shirt or my cool T-shirt and maybe want to also wear the cool T-shirt. I DO think it's weird that other people have to go on this long-winded diatribe about how 'your generation' just wants everything just handed to them or have everything reduced to a participation trophy' while getting weirdly defensive about my T-shirt. \n\nI will never think it's weird to want something.  \nI will think it's weird as shit to get mad at the thought of others having an opportunity to show skill and earn something you feel should stay 'exclusive'. \n\nYou're not special for being \"good at WoW.\" No one is. If you get bitchy at people like OP, touch grass.", "label": 1}
{"text": "so what?\n\nidiot", "label": 1}
{"text": "Okay, which of the 10 guardians (excluding china, I'm assuming) with a timed 15 this season is you then?", "label": 1}
{"text": "Nope, I am getting cucked as well", "label": 1}
{"text": "yeah before I saw that I deleted the launcher, tried to redownload (before the warning notice appeared) and it wont download now.  super cucked myself over here.  I guess ill go outside", "label": 1}
{"text": "Its a blood dk and everyone upvoting you (and you yourself) needs some electrical chair", "label": 1}
{"text": "Your \"identity\" is *Asshole who does pointlessly awful things, then cries about being called out on it*\n\nYou are the kid at school who uses their diagnosis as an excuse then cries to the teacher when you get punched.", "label": 1}
{"text": "It's nice when the racists and incels out themselves.", "label": 1}
{"text": "Please put an NSFW tag on this. I was on the train and when I saw this I had to start furiously masturbating. I dropped my phone and everyone around me saw this. Now there is a whole train of men masterbating together at this one image. This is all your fault.", "label": 1}
{"text": "you need to pay $50 to go to war within areas all quests for tokens are there. it's a pay to win event.", "label": 1}
{"text": "Flooded with downvotes, but up a thousand? Okay kid.", "label": 1}
{"text": "qq more, please, we're all ears", "label": 1}
{"text": "getting benched then getting forced to buy a boost is the most cucked behavior bro come on", "label": 1}
{"text": "I feel bad for anyone who knows you personally, having the acquaintanceship of such a dullard with no imagination must be such a chore.", "label": 1}
{"text": "wanker comment, its public forum and people are allowed to share stories. go talk to a aany person outside of your computer, try fall in love, have or adopt children and raise them, find some satisfaction in your trade, attend some regular therapy and come back when you developed a sense of empathy and kindness.  Otherwise stop being a prat and a major reason why everyone else hates playing wow.", "label": 1}
{"text": "Seek help.", "label": 1}
{"text": "ure just salty ure ass at pvp and probably ass at anything in real life that involves competition, it’s okay i’d be mad too if i was a loser", "label": 1}
{"text": "Then take your time dumbfuck. You can easily choose to not fly. \"Uhm ackshually i like to go slow as fuck therefore so should everyone else with no freedom of choice\"", "label": 1}
{"text": "Ah Americans", "label": 1}
{"text": "The only shit here is you", "label": 1}
{"text": "The UK are the only fuckasses saying “kerb”. Even Canadians say “curb. I’m Canadian.", "label": 1}
{"text": "Australian English is kerb.", "label": 1}
{"text": "Imagine getting this angry when you find out you were ignorant", "label": 1}
{"text": "Yeah make it sound negative and weird. You force yourself to play with random players by doing random que. You also force youraelf to play with lower levels lower levels by joining a timewalking dungeon. then also make yourself to be susceptible to being in a group with someone that also wants to do quests whereas the dungeon starts with quest givers.  Dumbass.", "label": 1}
{"text": "Uff bitched out, so embarrassing lol, talks big but can't back it up.   \nThe ultimate back seat gamer.", "label": 1}
{"text": "Dont want to sound like a dick, but what do you do then?", "label": 1}
{"text": "Of course it had to be a chinese account", "label": 1}
{"text": "Idk, doesn't Blizzard not have direct control over the Chinese servers and ban decisions and whatnot?", "label": 1}
{"text": "Arcane professor x ass", "label": 1}
{"text": "Whoa at least buy them a drink first ( i kid)", "label": 1}
{"text": "That doesn't make it less disgusting, problematic or disrespectul", "label": 1}
{"text": ">Draenor realm\n\nYeah sounds about right, haven't met a single mentally stable person from that realm lol", "label": 1}
{"text": "Clearly for \"representation.\" Expect him to come out of the Transmog closet next.", "label": 1}
{"text": "Learn to post more than one image in a single post fucking Hell.", "label": 1}
{"text": "Fuck avenyla-draenor", "label": 1}
{"text": "2.39 rio as assa is hilariously bad if this is how he behaves", "label": 1}
{"text": "K bye", "label": 1}
{"text": "that guys palm creases are a single line. I cant believe you even gave him that much attention.", "label": 1}
{"text": "genuine ape behavior you think its acceptable to leave at 5 minutes because of a possibility your time could be wasted. explains the all caps too. are you fat in real life?", "label": 1}
{"text": "ITT: Americans think anyone knows what the original meaning of 'gussy' is like it's commonly used by anyone under 45.", "label": 1}
{"text": "Wrong Country then, bro. No Internet-Rambo, but Disrespecting others will get your Teeth knocked out here. Did it many times. Especially disrespecting elderly People and then being rude about the confrontation. Fck them all.", "label": 1}
{"text": "I like how you edited your comment to be “Ahh Canadians” from “Ah Americans” because you are such a little uppity flippant vagina. Can’t afford to look like you jumped the gun and made a random fuckball assumption about someone’s nationality on Reddit. \n\nBtw, I am American. Get fucked, edit it x2.", "label": 1}
{"text": "That mount is worth every second of the grind, congrats! Looks epic!", "label": 1}
{"text": "It wasn’t deleted.", "label": 1}
{"text": "It wasn’t removed", "label": 1}
{"text": "I literally edited my post and commented the info you’re giving me, so you really are a troll", "label": 1}
{"text": "Yes, this is the same epic edition you paid 100$ for.", "label": 1}
{"text": "I was referring to the fact that you seem to be tying the high price of the game expansion at launch to the 3-day early access, and not the half dozen other rewards that came with the epic edition", "label": 1}
{"text": "Voljin.  He was the correct choice to lead the horde but blizzard caved to fan boys wanting their Waifu to lead them so they quickly killed him to make Sylv their leader.  Man if blizzard would have kept Voljin the horde would be in such a better place not just some patchwork they made to hold it together so they could advance the over story.", "label": 1}
{"text": "ya crazy how people would do that /s", "label": 1}
{"text": "How about don’t be a scumbag and steal the codes. It would really suck to buy some bags and one of you assholes stole the code already", "label": 1}
{"text": "Enjoy his real voice: https://youtu.be/VjUun6owSCE?t=21", "label": 1}
{"text": "Important note for EU players: the final code is **not** region locked and can be redeemed", "label": 1}
{"text": "How do you get it in EU?", "label": 1}
{"text": "Would like to know as well. Habe you tried? Need a VPN to access the promo site.", "label": 1}
{"text": "have someone in the US buy the items, redeem the points and generate a code to enter into Bnet. This code can be used worldwide.", "label": 1}
{"text": "No idea, hoping someone can tell me lol", "label": 1}
{"text": "wow did u redeem the code emailed to you to your eu account and worked???", "label": 1}
{"text": "Any American friends that want to help a EU player?", "label": 1}
{"text": "yes, that works", "label": 1}
{"text": "Please consider me (EU sad girlie 🙇‍♀️)", "label": 1}
{"text": "\"(I'm a girl btw)\"", "label": 1}
{"text": "I would be happy if you can help me out if possible but i dont want to bother you", "label": 1}
{"text": "I'm also a Guy In Real Life \n\nSend codes", "label": 1}
{"text": "If it's a product you normally consume, I'd also like to be kept in mind...", "label": 1}
{"text": "I'd like to hop on the train of EU Members needing a little help with this one. Will trade code for Xal'atath feet pics.", "label": 1}
{"text": "I'm down to help some folks out for this. I'm heading to the grocery store today to stock up.", "label": 1}
{"text": "Can't wait for this to pop up during Mount Mania on EU servers.", "label": 1}
{"text": "can we be friends?", "label": 1}
{"text": "From NZ, looking for a US player to help me out with a code plz!", "label": 1}
{"text": "i think someone said its like 5 submissions per day per product so they have various amounts of different things that give points", "label": 1}
{"text": "If any US can help me please dm 🙏🏼", "label": 1}
{"text": "I may not be your home, but i can be your homie <3", "label": 1}
{"text": "Might i be one of those folks? <3", "label": 1}
{"text": "Hi bro, I'm down to get in on this ! DM me if you got a spare code", "label": 1}
{"text": "You do realize you linked a video from 7 years ago right? \n\nHere is one from 3 months ago: https://youtu.be/-rqLZkmhM7A?t=1174&si=4hbJDQZjm-bHwzTr\n\nBut umm thanks for proving me right?", "label": 1}
{"text": "Would also love a spare code! Regards from Denmark 🇩🇰", "label": 1}
{"text": "I’d absolutely appreciate it if you do end up with some spare codes.", "label": 1}
{"text": "Would really appreciate one of these please! Thank you", "label": 1}
{"text": "I'd do naughty things to you (also happy to cover the cost via paypal or w/e)", "label": 1}
{"text": "I'll bite. Anyone with a spare code DM me :D", "label": 1}
{"text": "I'd love a code if any US folks are buying the stuff anyway and don't need it", "label": 1}
{"text": "Hopefully its not a bother but but if you got something you like and consume normally shoot me a DM", "label": 1}
{"text": "Did you already reach your maximum of test subjects? If not I'd love to join in!", "label": 1}
{"text": "I want that ride! Willing to Pay an US bro for it", "label": 1}
{"text": "Thanks man, if you have a spare code then please lmk!", "label": 1}
{"text": "Anyone here able to hook up a poor eu player with a code, please dm😅", "label": 1}
{"text": "If a fellow wow player from around the globe can help me i too would like a code 😀😇", "label": 1}
{"text": "> and his voice dropped at\n\nAHahahhaa Imagine believing this. Congrats you fell for his lies. Not even reading anything else you wrote. Get blocked. LMAO", "label": 1}
{"text": "Do you know if you could theoretically buy a second code for the bike? Or only 1 per account?", "label": 1}
{"text": "Hi there, it would be awesome if you still have a code to spare. \nMy rocking warlock will be sick with this beauty 🤘", "label": 1}
{"text": "I redeemed it on an EU account and have yet to receive it?", "label": 1}
{"text": "Id love to if you could help me out", "label": 1}
{"text": "Would love a code!", "label": 1}
{"text": "Get in Losers, we are going to go yell SKULLS FOR THE SKULL THRONE", "label": 1}
{"text": "If you can spare a code for a guy in thee UK. Much appreciated.", "label": 1}
{"text": "/yawn I already debunked your other video. Let's do this quick too.\n\nHey man sounds like you believe the earth is flat. He sounds completely different here than his bass boosted setup. You're making it easy for me to disprove. Actually you disprove yourself. It's so funny. \"NOOOOO MY STREAMER WOULD NEVER LIE\" Ahahahahahaha. Man you're beyond gone. Ahahahahaha.\n\n\"His Voice dropped\" Ahahaha iamgine believing your voice drops with a second time with 29. AHAHAHAHAHAHAHA. Dude the earth isn't flat. And the Moonlanding wasn't faked. Mind Blowing for your brain right?\n\nBy the way, let's assume for a second it's true that his voice dropped a second time (which it didn't) why did he suddenly at the same time pronounce words completely different?\n\nI can tell you what happened. He fakes it by using Speech training and trying to sound deeper. Which was already mentioned multiple times.\n\n\nLOL. Thanks for the entertainment btw. I love owning people like you with facts.\n\nBut now I'm turning the inbox off, ergo I will not see your replies. So Keep crying here or on his shoulder. You can choose. Buh-Bye :)", "label": 1}
{"text": "The base expac is $50. Store mounts are $25. Store battle pets are $10 each (x4). The two toys are $15 total. A character boost is $60. 30 days of game time is $15. Store xmog sets are $20 each (x8).\n\nI paid $100 for a bundle of items valued at over $365, and they gave me a month's worth of trader's tenders and 3-day early access for free.", "label": 1}
{"text": "A majority of the people singing up for your m+ keys probably don’t speak English very well. There’s tons of Chinese and Mexicans players that play m+ and you probably get into their keys or invite them into your keys without knowing.", "label": 1}
{"text": "If anyone can get me a codes i can use on EU server i'd really appreciate it", "label": 1}
{"text": "The color scheme is on point 👌", "label": 1}
{"text": "Nah, this isn't really bannable, hell people will probs end up selling these codes for real money and nothing will be done to them. It ONLY becomes a problem when you are selling services or rare items like purely in game for real money. Selling carries and such for in game gold and only gold is a-okay", "label": 1}
{"text": "Wow made easy on discord. Make a group, make friends, and network.", "label": 1}
{"text": "> Is reading difficult?\n\nAd Hominem attacks all because you're struggling to use your words?\n\n&nbsp;\n\nNo, you're trying to backtrack now they're trying to fix the obvious bug. You even said there in plain text where you qualified your statement with meaning, \"*it's trendy to be mad at bugs that aren't bugs*\". You were clear enough in your meaning.\n\n> but can you just read what I said\n\nI did, I quoted it verbatim.\n\n&nbsp;\n\n> I said the solution was intentional.\n\nYou literally didn't until a post or 2 later. The quoted one was on the original statement about the portal bug.\n\n&nbsp;\n\n>  Whether out of laziness, humour, or both who knows, but that spirit healer WAS FUCKING PUT THERE BY SOMEONE they DID NOT MAKE THEIR WAY THERE THEMSELVES.\n\nI can't comment on the spirit healer as I think it was added back in Shadowlands, however I really don't care. Your original comment was merely about the portal bug, you qualified that yourself. I am fairly certain that the spirit healer was put there due to obviously people dying during the questing and not being able to get back, probably during the quest to restore the Undercity in case you get hit by the plague, but ***that was never my issue with what you said***.\n\n&nbsp;\n\n> I could not be clearer if I tried babes.\n\nYou're extremely unclear and your thoughts are all over the shop.", "label": 1}
{"text": "Get ready for such hot takes as:\n\n* Skyriding takes up a HOTBAR; you know, the thing you don’t really interact with when you’re fucking traveling on a mount. \n\nOr\n\n* I don’t want to fly, I want to see the scenery. Except nothing is stopping you from doing that anyway, and Blizzard is no stranger to taking flying away for a set amount of time. \n\nFor the mouth breathers that found their way in here:\n\n#THERE SHOULD BE NO MOUNTS THAT CAN’T FLY IN 2024.", "label": 1}
{"text": "The character assassination was taking her from \"woman who will do anything to kill her rapist\" to \"hah I'm war crime McGee I love war crimes yay crimes against humanity\" for no reason other than the writing room was full of misogynists. She should have been the most compelling character in warcraft, especially after her suicide at the end of wotlk and the realization that her and her people are damned to hell for something that they had absolutely no control over. \n\nImagine if post wotlk the forsaken were focused on research combining with the blood elves and forming a horde aligned equivalent of the kirin tor, but focused on understanding the magic of death and undeath to try and find a way to free the forsaken from the hellish fate awaiting them", "label": 1}
{"text": ">Ad Hominem attacks all because you're struggling to use your words?\n\nOh internet debate buzzwords activated.\n\nIt's mostly to do with the fact I've repeated the same thing 6 times and you're still having real difficulty. That isn't ad hominen that's an actual observation of what's happened. Nice try though.\n\n>No, you're trying to backtrack now \n\nCan you point to where EXACTLY I said anything but the spirit healer was intentional? Like can you point that out for me? I FULLY believe you misunderstood me, but that isn't the same as me backtracking.\n\n>they're trying to fix the obvious bug. You even said there in plain text where you qualified your statement with meaning, \"it's trendy to be mad at bugs that aren't bugs\". You were clear enough in your meaning.\n\nI've been nothing but completely explicit babes. That's the issue I've now explained it in plain black and white for about 4-5 posts and your comeback is basically \"nuh uh!\".\n\nI said, that being ressed by the spirit healer in Brill, was an intentional thing. Whether it's a temporary workaround, or laziness I don't know (nor does anyone) however that behaviour is entirely intentional. We know that because the BG spirit healer **was placed there by a fucking human**.\n\n>I can't comment on the spirit healer as I think it was added back in Shadowlands, however I really don't care\n\nYes you only care about your little mouthpiece soapbox moment. I've been pretty clear about that. That's a shame because **that is exactly what I've been talking about the entire fucking time**. Again I'm sorry you misunderstood plain English.\n\n> but that was never my issue with what you said.\n\nYour issue, and I cannot overstate this enough is that you think that I said \"OH YOU DYING IN UNDERCITY HAS ALWAYS BEEN INTENTIONAL\" and again, I didn[t say that. I said you ressing in Brill was intentional. I also said it is more convenient. Which on both counts is completely accurate.\n\n>You're extremely unclear and your thoughts are all over the shop.\n\nCan you point to literally anywhere I have said anything other than the spirit healer in this entire post top to bottom?", "label": 1}
{"text": "i'll pay for a 12 pack", "label": 1}
{"text": "Does the code redemption work in EU servers..", "label": 1}
{"text": "I dont think so…", "label": 1}
{"text": "I am giving out codes to people who cover the cost of the soda i purchase. all out of codes right now though. Will be checking the store tomorrow to see if restocked", "label": 1}
{"text": "I know but if I want to use the points myself on my own account ;-)", "label": 1}
{"text": "I don't know if they can be claimed on your mnt dew account since it is region locked. if you can, I hope you can get all the codes you need ❤️", "label": 1}
{"text": "cucked.", "label": 1}
{"text": "Punching someone and stabbing someone with a knife are both bad, why do people get more upset when I stab someone then when others punch people? \n\nIt is 100% a dick move to do a 7 as a DPS if you have never played that spec before, but you can carry a bad DPS. If you tank or healer is clueless then there is almost no chance at succeeding. Of course people are going to be more upset at a tank/healer doing this.", "label": 1}
{"text": "Too bad us EU people can't get the codes. You kind of need a friend from the states and most of us probably don't :/ I don't. This mount is siiiiiick.", "label": 1}
{"text": "Im going to the US soon, maybe I could help", "label": 1}
{"text": "Preach, it sucks being US only. I'm glad the code works for apparently any [battle.net](http://battle.net) account but it still sucked a lot having to worry about how to get the code. I had some plans to get a code but glad I didn't have to go through with them.", "label": 1}
{"text": "I’m not sure how early you’re looking to get these codes but I can check tomorrow after I get off work to see if the store has them. It’s late here now so I’ll have to get back to you in my the morning.", "label": 1}
{"text": "everything is fine, we have no time pressure, we are happy if we find someone in NA to help us :)   \njust get in touch if you know more", "label": 1}
{"text": "Hey if you’re able to get a spare mount code let me know!", "label": 1}
{"text": "I would also be willing to pay with PayPal for the code, and you get the sodas for free 😉", "label": 1}
{"text": "i would like a code if you have any spares...", "label": 1}
{"text": "Ya I can get whatever you need. Just the mount? I think that’s 600 points. So a 12pack and a 20oz of Mountain Dew.", "label": 1}
{"text": "Yeah literally just the mount please dude! I’ll private message you :D", "label": 1}
{"text": "I think it would be a great idea, that everyone around the world is allowed to vote at the nation that calls it self the world peace keeper", "label": 1}
{"text": "I need one too! gaelzz on discord", "label": 1}
{"text": "Got any codes?", "label": 1}
{"text": "I'm offering the same deal! Pretty sad we don't get the promotion in EU", "label": 1}
{"text": "What is the method to get the rewards? U can use the codes simply like on NA accounts or u have to do something before that?", "label": 1}
{"text": "If only there was anything other than stupid choices. We are living the south park vote episode.", "label": 1}
{"text": "Hey mate, do you know if you could grab also a code for me ? I don't know how expensive or bothersome it can be, don't hesitate to pm me if you want something in return", "label": 1}
{"text": "I would also love a code if you have any, thank you <3", "label": 1}
{"text": "DM sent", "label": 1}
{"text": "Helloooo :3 a good Warrior Gnomess over here in EU is also looking for a promotion code. I will pay via paypal for the dew. Let me now if someones interested. Unfortunately Blizz jsut dont want us from EU to grab some awesome stuff :(", "label": 1}
{"text": "Hi! I'm interested in a code too. Would be forever grateful", "label": 1}
{"text": "Warlock from EU wanting that cool bike too, if you have a code or would like go give or collab for providing one do tell!", "label": 1}
{"text": "Would also love a code if you have any spare ones", "label": 1}
{"text": "If anybody is willing to help me to get it on EU, i will pay you the drink.", "label": 1}
{"text": "I would also really like to be able to get a code for in EU!", "label": 1}
{"text": "Hii i'm interested too for a mount code, i can pay with paypal, even with a little extra as a thanks for the effort ☺️", "label": 1}
{"text": "Pay some taxes then.", "label": 1}
{"text": "If there are chances to a code I will just leave this message here also. Best regards.", "label": 1}
{"text": "Also from EU, German here. Would also like to get the code to use it in battle net for the bike :-) Can also pay in PayPal", "label": 1}
{"text": "Any codes left? :)", "label": 1}
{"text": "Yeah cos they really give a shit what tax payers think that's why all their money goes into the military budget.", "label": 1}
{"text": "Already going for 70 dollars on Ebay", "label": 1}
{"text": "I’m getting ready to go to Walmart when it opens in 30 min, gonna try to get back to everyone", "label": 1}
{"text": "Live in Asia and play on US servers.\n\nHelp a brother out.", "label": 1}
{"text": "I'd be so grateful for a code if you happen to have any spares! Thank you so much. 😊", "label": 1}
{"text": "Would also love a code if you have enough! Much appreciated", "label": 1}
{"text": "I would also like a code if possible", "label": 1}
{"text": "If you got a spare code it would be nice if I could get one", "label": 1}
{"text": "Same here, would be really grateful if someone addicted could share one. 🙏", "label": 1}
{"text": "Same here, would be really grateful if someone addicted could share one. 🙏", "label": 1}
{"text": "If you have any to spare :)", "label": 1}
{"text": "Thanks for helping EU out, I would also appreciate a spare code if there's one", "label": 1}
{"text": "Would love one too, please ❤️", "label": 1}
{"text": "Hey man I'm willing to comp if you're able to get me a code please, thanks a lot", "label": 1}
{"text": "Hey would love to get a code if you have any spares left!", "label": 1}
{"text": "Would love to have a code too, if possible :)", "label": 1}
{"text": "If you manage to snag one for me that would be great mate :)", "label": 1}
{"text": "you got a dm :)", "label": 1}
{"text": "I'd love to get one as well, pleaaaaase 🥹", "label": 1}
{"text": "Hi, if you have any spare codes I'd be happy to send you the cost of the bottles and a tip.", "label": 1}
{"text": "Thanks for your service! Send u a dm ❤️", "label": 1}
{"text": "Hey mate, please let me know if you are not yet overwhelmed with people xD I’d like to try my chances as well:D", "label": 1}
{"text": "There's plenty of countries that have paid US taxes in blood, but they still don't get a choice in US politics...", "label": 1}
{"text": "Bolvar and the maldraxxus guy by far. Bolvar was great in legion and then it all went south with the DEI hires and the infiltration of the wokies in the industry.  He was the damned lich king for years and didnt do one thing. Even when the time came for him to lead and guide us into the land of the dead, a realm he knew better than anyone else on azeroth, he just decided to sit in oribos and whine constantly. What a disaster", "label": 1}
{"text": "Would love to have one as well! <3", "label": 1}
{"text": "I'd love a code if you've got extra!", "label": 1}
{"text": "If there are any left, I would love one", "label": 1}
{"text": "Wooo ill take one too haha", "label": 1}
{"text": "Hey, would be super grateful if you can get a code for me as well, ready to PayPal you the money, thanks!", "label": 1}
{"text": "If you happen to have a spare code once you go through everyone else, I’d be more than grateful for a code!", "label": 1}
{"text": "I'll pay for a code", "label": 1}
{"text": "I'd love one too", "label": 1}
{"text": "Would love one code and thanks 😄", "label": 1}
{"text": "If you happen to have any extra. I'd gladly grab one. Thanks! Can paypal you for the box of sodas.", "label": 1}
{"text": "Hey! Also interested in getting a code for the mount, will PayPal etc and don’t mind throwing in some extra for the service :)", "label": 1}
{"text": "You are a solid one m8!", "label": 1}
{"text": "RIP your inbox, but I applaude your generousity.", "label": 1}
{"text": "In the EU here, if any kind US friend could hook me up with a code or two I'd be happy to PayPal. Thanks", "label": 1}
{"text": "i need american brothers as well :/", "label": 1}
{"text": "I know I'm a but late, but you got yet another code for a struggling eu pleb? <3", "label": 1}
{"text": "Look… someone dont want to grow up 🤣🤣🤣🤣", "label": 1}
{"text": "I would love having a code for the mount because it looks awesome but I'm in EU :(", "label": 1}
{"text": "Can I have one too pls", "label": 1}
{"text": "Who can give me codes", "label": 1}
{"text": "You still got any codes left? i would love to get my hands on one :D", "label": 1}
{"text": "Yo mate, do you happen to have more spare codes? Would love one\n\nAnd respect for even doing it in the first place.", "label": 1}
{"text": "Please also interested!", "label": 1}
{"text": "Heyy if you still have any codes, could you send me one too pls? Would really apreciate it.", "label": 1}
{"text": "If you have more spare codes, hit me up please 🥹🙏", "label": 1}
{"text": "hi boss  \nif there is any spare code i could have it  \nunfortunately discord is banned in here so i can't check there", "label": 1}
{"text": "Dang dude, doing lords work! I'd love a code if you happen to have any left! Can compensate for the trouble", "label": 1}
{"text": "If some codes left... can i have one, pretty please?", "label": 1}
{"text": "If you still have a code I’d love to have one. The fomo is killing me. If it doesn’t work it’s still fine. Thanks for giving it out to some people.", "label": 1}
{"text": "Would love one if possible ! Thanks", "label": 1}
{"text": "Would love to have a key please", "label": 1}
{"text": "Oh man a lot of people asking, but I will add myself to the list. Would very much appreciate it!", "label": 1}
{"text": "Hey mon, a troll warlock here needs a bike code. <3", "label": 1}
{"text": "Dm me", "label": 1}
{"text": "I'll take a seat here in the waiting room for a spare code. Godsped to you.", "label": 1}
{"text": "I'd love one as well if possible, please!", "label": 1}
{"text": "I'd love to have one too if possible", "label": 1}
{"text": "My hero", "label": 1}
{"text": "Same. Would love a code for my wife too. I know this is a longshot", "label": 1}
{"text": "Even if you sell for 0 profit you are getting the drinks for free at the end", "label": 1}
{"text": "Me too. Thanks in advance", "label": 1}
{"text": "Would, your brother like another brother? I am in need of a US Dweller as well D:", "label": 1}
{"text": "Hi i'm ideally looking for two codes for the mount happy to pay for the products and include some extra for people's time", "label": 1}
{"text": "If you have a code left I’d love one.", "label": 1}
{"text": "Have you got an codes spare? Ty", "label": 1}
{"text": "I'd appreciate if you can send some, please. Thank you!", "label": 1}
{"text": "Ah. I would love a code. 😭", "label": 1}
{"text": "Do you have a code for me?", "label": 1}
{"text": "Would appreciate a code brother.", "label": 1}
{"text": "We do have pure kindness, though.  His name is A'dal.  The rest of the Naaru may suck, but he will always be the greatest snowflake bro.", "label": 1}
{"text": "You are our hero, if possible I would like to have the code", "label": 1}
{"text": "Would be insanely grateful for a code, thanks man", "label": 1}
{"text": "I'd love one if you can, but fine if not :) Thanks for doing this for people!", "label": 1}
{"text": "Any US brothers out there with a spare code? dm me for business lol", "label": 1}
{"text": "Do you need to be us resident or is it fine if you're just there? You need to give mtndew your residents card or something? Seems strange", "label": 1}
{"text": "I would love a code too, hope im not late for the party ❤️☺️", "label": 1}
{"text": "I know a ton of people are asking, but would love one as well, thanks regardless!", "label": 1}
{"text": "Please please would really appreciate if someone can grab a code for me, will pay the cost of the drinks", "label": 1}
{"text": "I would be absolutely thrilled if you could lend me one.", "label": 1}
{"text": "as a complete foreigner, it seems choosing to be Canadian rather than American is an objectively smarter choice to me", "label": 1}
{"text": "Would love one if you have it spare. Just hit my 150th mount the other day as I got the NW ones.", "label": 1}
{"text": "What is your discord?", "label": 1}
{"text": "Bro im begging you <3", "label": 1}
{"text": "Get fucked", "label": 1}
{"text": "Would love to have a code if you can sort one x", "label": 1}
{"text": "Would love to get a code as well.", "label": 1}
{"text": "Anyone in US willing to DM me and help get this Mount without those \\*\\*\\*\\*\\* scalping Prices?", "label": 1}
{"text": "Didn't ask + don't care.", "label": 1}
{"text": "would appreciate a code too :)", "label": 1}
{"text": "Yooo holla at me pleasee", "label": 1}
{"text": "A guy from the EU here who would like to support the home less people. And would like to get a bike in return. How can we arrange this?", "label": 1}
{"text": "Joining here as well as an EU player, if someone can help out with a code and we arrange via PayPal\n\nMy t2 rogue needs the red badass Blazecycle 😎", "label": 1}
{"text": "Great to have American friends not do lucky here 😞", "label": 1}
{"text": "If you have one left. IT would be very nice to geht it.", "label": 1}
{"text": "You still down for trade ? No problem covering costs via PayPal :)", "label": 1}
{"text": "anyone in US willing to help to get a code without scalping prices? Pls DM me\\^\\^", "label": 1}
{"text": "Would love one too", "label": 1}
{"text": "Then there is the chance of one or two codes you would be a hero.", "label": 1}
{"text": "EU here, would love a code. Thanks.", "label": 1}
{"text": "Not sure if still available but got any codes left?", "label": 1}
{"text": "Me2 please", "label": 1}
{"text": "Hello EU player here! would be super grafeul if you can get a code. Could pay for the code. Thanks <3", "label": 1}
{"text": "Hit me up if you got a code!", "label": 1}
{"text": "Lol", "label": 1}
{"text": "Would love one too mate!", "label": 1}
{"text": "How do americans get the code?", "label": 1}
{"text": "I’ll add my hat into the ring in the hopes of one if that’s okay?", "label": 1}
{"text": "I'd happily give a paypal if anyone can get a code for this mount. Love.", "label": 1}
{"text": "Plenty of time to get all of the goodies. After I'm done I'll keep buying the bags and hand out codes specifically to other countries.", "label": 1}
{"text": "You are trying and succeeding in being a dick, lmao.", "label": 1}
{"text": "If anyone wants to help a Canadian brother out it’d be greatly greatly appreciated, please and thank you!", "label": 1}
{"text": "God I wish this was for everyone and not just US only", "label": 1}
{"text": "I am also looking for an american brother who can hook my eu ass up with some codes for the mount.", "label": 1}
{"text": "DM me. I got some points left over for a few extra motorcycles.", "label": 1}
{"text": "can someone get me a code i would pay for it", "label": 1}
{"text": "can someone get me a code pls ?", "label": 1}
{"text": "If anyone would like to help a brother out from EU, please let me know. :)  \nWould very much appreciate it", "label": 1}
{"text": "Oh man, I'm so desperate to get one of these, they look awesome!", "label": 1}
{"text": "DM'ed you.", "label": 1}
{"text": "Step by step guide on how to get it for people outside US (but playing on US realm)? Pretty please?", "label": 1}
{"text": "I have 7100 points left for the bikes if anyone needs it for paypal F&F. Not looking to get rich here or anything, just asking to cover for the price of the drinks. I'm in california so the price of the single mountain dews are $2.49 each. Haven't seen the 12/24 packs of cans, chips, rockstar or the special 200 points a bottle gamefuel mountain dews anywhere i'm at yet so far.", "label": 1}
{"text": "Hey sending you a DM!", "label": 1}
{"text": "Dm sent!", "label": 1}
{"text": "Doing good work", "label": 1}
{"text": "DM incoming. Doing the honest work.", "label": 1}
{"text": "DM you. ☺️", "label": 1}
{"text": "Got mine with jax, serious trader :)", "label": 1}
{"text": "Sending you a dm, and thank you!", "label": 1}
{"text": "Would love one! Sending DM!", "label": 1}
{"text": "DM sent!", "label": 1}
{"text": "Man that would be dope, i hope you dont get overwhelmed! Would love the bike aswell if its possible for you :)", "label": 1}
{"text": "Sent a dm! Huge thanks for doing this for the community", "label": 1}
{"text": "DM bro 🫶🏼", "label": 1}
{"text": "Hi, sent you a DM!", "label": 1}
{"text": "Howdy y’all! Getting an insane level of response already, so it may take me a while to get to your DMs, but I’ll get to them! Looks like we’ll be buying out LAs entire supply of Doritos and Dew 😂", "label": 1}
{"text": "I vould be very thankful for help! DM incoming!", "label": 1}
{"text": "Dm sent! <3", "label": 1}
{"text": "DMing, ty for the help!", "label": 1}
{"text": "Sending a DM as well", "label": 1}
{"text": "You're a great person! DM incoming.", "label": 1}
{"text": "Glad to see this support! Let’s keep it fair and help each other out instead of feeding scalpers.", "label": 1}
{"text": "Thanks a lot m8! We need more people in the world like you. Thanks for helping out! DM send", "label": 1}
{"text": "You about to own ungodly amount of mountain dew brother.", "label": 1}
{"text": "I shoot you a DM, thank you so much!", "label": 1}
{"text": "Gonna drop you a dm.", "label": 1}
{"text": "You're doing the good work. May the light bless you!", "label": 1}
{"text": "I'm too broke to help anyone else right now, but I just wanna say you're flipping awesome. You're the kind of person I love to see in this community!", "label": 1}
{"text": "Can vouch for this dude right here. Sent me the code the second I paypal'd!", "label": 1}
{"text": "Getting diabetes for the sake of his fellow man", "label": 1}
{"text": "Send DM", "label": 1}
{"text": "DM me, I got you!", "label": 1}
{"text": "Shooting a dm! Doin Gods work!", "label": 1}
{"text": "Dm incoming!", "label": 1}
{"text": "My guys pls 🫣", "label": 1}
{"text": "Afaik the codes only work on US american bnet accounts", "label": 1}
{"text": "Like Mountain Dew packs and stuff? What country are you located in? If you’re on a base the Mountain Dew at the PX still works I think", "label": 1}
{"text": "Yeah. Exactly that. \nI am located in Germany/EU\nNeed 1k points, I could use a VPN to access the mtndew site", "label": 1}
{"text": "I read that you can redeem them in EU bnet accounts, but you need a VPN to access the mtndew Page and redeem the codes there. I'll be a guinea pig and willing to try it out anyways lol", "label": 1}
{"text": "I have extra mount codes available!", "label": 1}
{"text": "Well, I’d love some assistance getting some codes for my partner and I. The mount looks cool but we’re in Australia. 😭", "label": 1}
{"text": "Bro you do lfr, quest and delve you have literally no understanding of what it's like for most people yet you have so many comments in this thread it's kind of a piss take. Not everyone wants to do the boring shit you do.", "label": 1}
{"text": "Hey I'll buy 1 code please!", "label": 1}
{"text": "Has anyone found out if non us realms can get it? I know the sweepstakes is us only but once a code is generated can it be used anywhere?", "label": 1}
{"text": "There just happened to be a WoWhead posted just before. As long as the code is generated, anyone can use it. https://www.wowhead.com/news/mountain-dew-promotional-rewards-available-outside-us-349643?utm_source=discord-webhook", "label": 1}
{"text": "Several people outside of the US already redeemed a code. Without the us battle net", "label": 1}
{"text": "Australia is still NA, it’s just unable to access mtndew.com since cloudflare. The code just has to be generated from someone in the US and then it be sent to whoever", "label": 1}
{"text": "Looks great!  \nIf anyone has a code for an EU player I would be very happy.\n\nOf course I will cover the costs to get the points + a tip.", "label": 1}
{"text": "I second that. Please help out an eu bro.", "label": 1}
{"text": "Oh, agreed, the best response by the people who care enough to do something will be flood the market with reasonably priced codes. Unless then similar to the wow auction house behavior, they gouger buys them up too.\n\nI think you and i are both looking at it similar, just with various opinions on the seller. \n\nThe practice in the original post while not a shining example of humanity, also isn't worth getting all riled up and SJW over. In short, the post is like saying TiL water is wet.", "label": 1}
{"text": "You'll have to not mention the US at all then, because the whole country is a joke! (I kid, I kid, I'll see myself out now before the angry mob lynches me.)", "label": 1}
{"text": "If anyone feeling generous i won’t be mad for one code for EU too 🥲", "label": 1}
{"text": "I second that too... people are putting absurd prices", "label": 1}
{"text": "Fingers crossed 🤞", "label": 1}
{"text": "you too man!", "label": 1}
{"text": "Hello NA fellas! If you have a spare mount code laying around i would highly appreciate one aswell! Thanks you!:)", "label": 1}
{"text": "If anyone has a code for an EU player I would be very happy.\n\nOf course I will cover the costs to get the points + a tip.", "label": 1}
{"text": "I also support this, please help out us EU players", "label": 1}
{"text": "Same here, eu player wanting that cool motorbike :(", "label": 1}
{"text": "You don’t need help you need…\n\n📡 STARLINK  🛰️\n\na satellite internet service developed by SpaceX that provides high-speed, low-latency broadband internet globally, especially in remote and underserved areas. It uses a constellation of low Earth orbit (LEO) satellites to deliver coverage, aiming to bridge the digital divide and offer reliable internet access worldwide.\n\nTHANK YOU ELON MUSK 🫡", "label": 1}
{"text": "Anyone got a code please?", "label": 1}
{"text": "BFA Dick arround in 70 toons ilvl 400+ :(", "label": 1}
{"text": "Wheelchair classes rejoice!", "label": 1}
{"text": "Same here, also a fellow EU player. I will pay the costs for the products and give a small tip for the hassle. If someone is willing to help please DM me.", "label": 1}
{"text": "I too would appreciate some codes, of course for the product value and a big tip!", "label": 1}
{"text": "Nobody asked for your opinion either. Take some of your own medicine.", "label": 1}
{"text": "Homies on wowtcgloot need to eat too", "label": 1}
{"text": "I second that too, we need an Azeroth hero over here!", "label": 1}
{"text": "If anyone is willing to acquire those things for me i can reward him!!! Dm me im european", "label": 1}
{"text": "same", "label": 1}
{"text": "If any fellow US player is willing to help me get those stuff please Dm me!!!", "label": 1}
{"text": "This sounds like something a child would say. Do you understand how unique codes work?", "label": 1}
{"text": "Same guys i'm also an EU player and i really love this promotion....so sad we don't get it :(\n\nIf anyone help help me acquire i'll be the happiest mf alive (ofc i will cover everything same as my brother u/Dry-Adhesiveness3081 ) Feel Free to DM Me!!!! <3 <3 <3", "label": 1}
{"text": "Dude are you a child? If you use those codes, the random person that buys the product will not be able to use the code. You are NOT fucking over a company, you are fucking over people just like you. Gtfo of here kid.", "label": 1}
{"text": "........... so, a child. Your critical-thinking skills need some serious work dude.", "label": 1}
{"text": "Hey! It's my long-lost, good friend, NoahDavidATL! It's been so long, and you look so handsome! Now, about these codes.....", "label": 1}
{"text": "I'd honestly buy some of these and send them to people for gold if they wanted. All the stores around me still have like 20 boxes of them each and I don't think they are going away any time soon", "label": 1}
{"text": "i have some codes, gan\\_d\\_rodri on discord", "label": 1}
{"text": "I will absolutely buy the codes off you for gold :)", "label": 1}
{"text": "You got any more of those codes friend? :)", "label": 1}
{"text": "Who’s getting clapped?\nThe orcs are conquerors for sure but I’d still say they conquered indiscriminately battling with other clans as much as other races.\nWhile the alliance were openly racist and discriminatory not only to the horde races but to other races within the alliance.\nSo if the question is who is more racist the answer is obviously the alliance.", "label": 1}
{"text": "Cause you touch yourself at night", "label": 1}
{"text": "Mother Azeroth is dying to pieces of shit like you - Malfurion", "label": 1}
{"text": "Weren’t they part of the alliance until some humans were so racist they left them to die?", "label": 1}
{"text": "My man, I don't care if she is a man or a woman, I'm just trying to sell some codes", "label": 1}
{"text": "I did it regularly on my priest for that sweet sweet mythic antorus transmog. Its wasnt that bad once you learned it.", "label": 1}
{"text": "Racist even within their faction there is racism which is why I don’t think it’s factionism", "label": 1}
{"text": "The problem is I don't have time to dick around doing world quests and delves every day to farm valorstones. I can barely make 2 raid nights and one M+ night work. I can't think of something I'd rather do less than carve time out of other things to \"do my dailies.\" What a garbage system to artificially inflate player engagement numbers.", "label": 1}
{"text": "I'm in Australia with no way to get this, sucks because it looks so cool.", "label": 1}
{"text": "Lol!\n\nhttps://discord.gg/wqK8qZme\n\nThis discord has a few of us finding cans to get codes, with a small tip welcome ofc for the trouble of finding them. Feel free to DM me on here or discord I’ve gotten 5-10 ppl their motorcycle today. acoustik420 on discord.", "label": 1}
{"text": "It's your key so your choice. Dick move? Yes. But you'll both get over it. I bet both of you have forgotten each other's names already.", "label": 1}
{"text": "Lmfao you really made an alt just to troll, and that was the best comment you could come up with? Get a job, kid.", "label": 1}
{"text": "Hahaha. Viva la Death Knight! 😝", "label": 1}
{"text": "Name them", "label": 1}
{"text": "Custom Campaigns\nPlayer Profiles\nCross-region play for Custom Games\nClans\nLadder\nTournament Mode\nOriginal Battle.net Chat System", "label": 1}
{"text": "So the gameplay is identical meaning the game itself is the same.", "label": 1}
{"text": "the gameplay is a former shell of it's original release. You say it's the same, but it really can't be the same if a whole lot of features on the original game is missing on the remastered edition.", "label": 1}
{"text": "I concur", "label": 1}
{"text": "And what about W3 Reforged huge update, all leaks about it, eventually it will be w2 remaster and not W3 Reforged huge update ? Or w2 remaster is standelone thing ?", "label": 1}
{"text": "https://discord.gg/wqK8qZme\n\nThis discord has a few of us finding cans to get codes, with a small tip welcome ofc for the trouble of finding them. Feel free to DM me on here or discord I’ve gotten 5-10 ppl their motorcycle today. acoustik420 on discord.", "label": 1}
{"text": "https://discord.gg/wqK8qZme\n\nThis discord has a few of us finding cans to get codes, with a small tip welcome ofc for the trouble of finding them. Feel free to DM me on here or discord I’ve gotten 5-10 ppl their motorcycle today. acoustik420 on discord.", "label": 1}
{"text": "https://discord.gg/wqK8qZme\n\nThis discord has a few of us finding cans to get codes, with a small tip welcome ofc for the trouble of finding them. Feel free to DM me on here or discord I’ve gotten 5-10 ppl their motorcycle today. acoustik420 on discord.", "label": 1}
{"text": "https://discord.gg/wqK8qZme\n\nThis discord has a few of us finding cans to get codes, with a small tip welcome ofc for the trouble of finding them. Feel free to DM me on here or discord I’ve gotten 5-10 ppl their motorcycle today. acoustik420 on discord.", "label": 1}
{"text": "I bought the codes on this website, they have best market prices [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I bought the codes on this website, they have best market prices [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I bought all of the codes from this website, seems they have a best prices on the market  [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I have bought all the codes from this website, they have best market prices and it was instant delivery [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I have bought all the codes from this website, they have the best market prices[https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I have bought all the codes from this website, they have the best market prices and it was instant delivery [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "Is there any way I can get the bike mount if I'm playing on EU?", "label": 1}
{"text": "Also bind on pickup black market item ilvl 43 only my lvl 70 can buy lol  what a joke", "label": 1}
{"text": "Kill La kill anyone", "label": 1}
{"text": "Wow that was it. I had a \"T-shirt enthusiast\" buff somehow. Thank you", "label": 1}
{"text": "Bm hunter is kinda annnoying to deal with as a dk\n\nbut (ex glad here with DK) And I main MM hunter PVE, here's a few tips;\n\nDeath strike the pet if you can't connect to the BM hunter\n\nBlinding sleet when he uses offensive(bestial wrath or that whole cluster of animals) and his damgur will be cucked bc how can he do damage when his pets are cc'd?\n\nif you can(very rare) co-ordinate killing the BM pet with your team mate and DO NOT LET HIM REZ IT He'll be a free kill\n\n  \nyou can grabby hands after he uses cheetah escape to easily keep him in your bouncy ball (chillstreak) pillar window \n\n  \n:)", "label": 1}
{"text": "Best thing you can do here. The gaming landscape has changed esp in wow if ppl are just being a dick block them and move on", "label": 1}
{"text": "I have bought all codes from this website, they have the best market prices and it was instant delivery [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I have bought all codes from this website, they have the best market prices and it was instant delivery [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I have bought all the codes from this website, they have the best market prices and it was instant delivery [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I have bought all the codes from this website, they have the best market prices and it was instant delivery [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "Hey everyone , I have the ability to get 6 gate forge codes. I was trying to get the epic edition but they sold out . So I’m trying to get funds for the base edition of the expansion . Will take gold on us realm to convert to wow token for bnet balance", "label": 1}
{"text": "How about eu players? We could set something up?", "label": 1}
{"text": "I'm afraid that won't really work with people from EU or other region, which kind of the point of this post 😅", "label": 1}
{"text": "I’ve heard the opposite, not too sure how true it is but I think you could use a vpn and get around the region lock", "label": 1}
{"text": "I bought my codes from this website, I can confirm I got them instant from them [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I bought my codes from this website, I can confirm I got them instant from them [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "I bought my codes from this website, I can confirm I got them instant from them [https://instant-carry.com/product/buy-hateforged-blazecycle-code/](https://instant-carry.com/product/buy-hateforged-blazecycle-code/)", "label": 1}
{"text": "Oh no, I meant that EU players cant trade you gold. But if you can provide codes for us we could paypal you for the money you spent on them.", "label": 1}
{"text": "Go play Chinese server", "label": 1}
{"text": "i went through the exact same experience yesterday. I normally play a Fury Warrior and i was gonna try to learn to tank but pugging timewalking dungeons as a Prot Warrior. I got kicked probably 5 or 10 minutes into like 3 different dungeons in a row. How am i supposed to learn if i cant even get into the content", "label": 1}
{"text": "i have some spare codes, im mateop\\_1 on disc", "label": 1}
{"text": "i have some codes, add me on disc: mateop\\_1", "label": 1}
{"text": "i have some codes, add me on disc: mateop\\_1", "label": 1}
{"text": "i have some codes, add me on disc: mateop\\_1", "label": 1}
{"text": "i have some codes, add me on disc: mateop\\_1", "label": 1}
{"text": "i have some codes, add me on disc: mateop\\_1", "label": 1}
{"text": "i have some codes, add me on disc: mateop\\_1", "label": 1}
{"text": "I have a few I would sell", "label": 1}
{"text": "price?", "label": 1}
{"text": "$30", "label": 1}
{"text": "I love that everyone is going on and on about the underwater but ignoring the OP. The underwater is challenging, but it is a livable mechanic. Those stupid little clouds that interrupt you cleansing the mushrooms serve no purpose but to just irritate the shit out of you. 100% a case of mistaking annoying for fun. This is not interesting game play, this isn't clever. There is no way to defeat them, They are 100% there as a non consensual dick in your ass. If I meet the person responsible for this, I might go to jail.", "label": 1}
{"text": "12 pack game fuel gives 1000 points and goes for $8-$10 where im at", "label": 1}
{"text": "its still up, i havent closed it yet", "label": 1}
{"text": "Yeah they get mad when you call them out on it. They downvoting my comment haha snowflakes.", "label": 1}
{"text": "Blizzard confirmed in a blue post that it will be returning. I’ll go look for it and edit this comment with the link.", "label": 1}
{"text": "Hello, i have many codes, feel free to reach me on dc: matthu36", "label": 1}
{"text": "PM me, I can help you cheaper than these scalpers that are probably stealing Doritos codes.", "label": 1}
{"text": "Will venmo for codes, Just went to the store and bought two 12 packs with the wrong codes will venmo $100", "label": 1}
{"text": "The furries will not rest until they have taken everything from us 🥺", "label": 1}
{"text": "Have sold 20 12 pk ( i bought for $7 each ) codes for 100 euros each so ya my $140 turned into 2k heading to more stores for inventory tomorrow.", "label": 1}
{"text": "Well, you set us back 10 years by using an image of a Vulpera for this.", "label": 1}
{"text": "Paladins are DEI class. Though they get very offended for pointing this out,but being pinky and bubbly comes with a heartstone.", "label": 1}
{"text": "Share a link?", "label": 1}
{"text": "DM sent", "label": 1}
{"text": "Just saw this, if you need codes still I have some, DM me.", "label": 1}
{"text": "I will never get over how immensely toxic the \"anti-FOMO\" crowd gets whenever they're told no.\n\nThey said no in an interview.  \nNobody gave a shit about the Fel Drake even back when it was first released. People have cared about the tiger since it came out. It's iconic. \n\nGrow up.", "label": 1}
{"text": "I have some codes, matthu36 on disc", "label": 1}
{"text": "i have some codes , matthu36 on disc :D", "label": 1}
{"text": "i have some codes , matthu36 on disc :D", "label": 1}
{"text": "i have some codes , matthu36 on disc :D", "label": 1}
{"text": "i have some codes , matthu36 on disc :D", "label": 1}
{"text": "i have some codes , matthu36 on disc :D", "label": 1}
{"text": "i have some codes , matthu36 on disc :D", "label": 1}
{"text": "i have some codes , matthu36 on disc :D", "label": 1}
{"text": "i have some codes , matthu36 on disc :D", "label": 1}
