{"text": "Lol.", "label": 0}
{"text": "I was saying to my friend a week ago \"Blizzard could make a shitload if they sold this mount for real money.\" we had a good laugh at how stupid blizzard is.\n\nBut now that blizzard has this I may need to buy it..", "label": 0}
{"text": "What is that like 5 tokens seems like a steal", "label": 0}
{"text": "You tried.. that's all that matters.", "label": 0}
{"text": "Do you need to be max level to get all the weekly tokens? I'm currently lvl 75 and I've done everything I can find but I'm only at 31 tokens.", "label": 0}
{"text": "There's a pretty common opinion right now that this is probably the most active WoW has been since it's peak during wrath.\n\n\nNobody is quite sure because China doing China things but there's a pretty solid reason to believe it.", "label": 0}
{"text": "I will complain if I want I'm not buying the mount. I don't think theres much overlap of people who buy the mount and people who complain about the mount being overpriced pixels.", "label": 0}
{"text": "TWW is doing so fine that people can only cry about some bugs and try to spin it as the worst patch ever.\n\nJust miserable people, like look at them wasting hours debating about some pixels online for a game they allegedly haven't played in years.", "label": 0}
{"text": "A couple thoughts on this\n\n\\- $90 sounds like a lot, but you can buy WoW tokens for gold and convert them to $15 of bnet balance you can buy the mount with. Six tokens is about 1.5 million gold. Is it a lot for a casual player? Sure, but it's also a LOT cheaper than the other Brutosaur. And gives you a way to work towards it in game.\n\n\\- The mailbox with the AH is incredibly useful,  it's absolutely worth 1.5 million gold, especially if you're the type of person to drop 2 million on a spider or 1.2 million on a gold scarab.", "label": 0}
{"text": "I mean, I also like the game. I don't play free/buy-to-play MMOs but that doesn't mean I'll automatically play anything with a subscription, I don't play FFXIV for example.", "label": 0}
{"text": "And dude is still paying his sub to whisper you that garbage. I bought it on sight. Enjoy", "label": 0}
{"text": "A deleted guild bank that I can't get back has nothing to do with buggy patches being forced through because Blizzard doesn't care when they can release a goofy mount and make millions?", "label": 0}
{"text": "I'd pay another 1.2m for a mount with a warband bank, or a gbank, or a generic crafting table, or a pocket mage, or a forge, or a flying five seater, or anything I haven't thought of that would make the game more convient.", "label": 0}
{"text": "Nobody cares about how you spend your money, it’s about the fact that giving more money for a game that already costs money AND a subscription will just end up. You are literally giving  them a reason to not make the game better or attract more players.\n\n\nBlizzard is no longer driven by passion, it’s just money now. The only way to make this game better for everyone is to force Improving the game itself to be the main source of income.", "label": 0}
{"text": "But you don’t need a mount with an ah/mailbox there everywhere in game.", "label": 0}
{"text": "Yeah that's fair. A couple hours of irl work, or tens of hours of farming the same shit in WoW.", "label": 0}
{"text": "Are you so brainrotted that you think that the only reason people post to reddit is to get fake points that are worth nothing? Not that someone might be passionately angry about the thing they are posting about?", "label": 0}
{"text": "Gonna set up shop outside the goldshire inn and sell items for use in the inn", "label": 0}
{"text": "Again missing the point. They didn't intentionally fuck up. They're just incompetent. Like most.", "label": 0}
{"text": "I know man I’ve never had more than 200k and that was from a random token I sold on AH to buy enchants for raids and shit. I legitimately don’t care enough to farm for the money", "label": 0}
{"text": "All these people are a problem.", "label": 0}
{"text": "Couldn’t think of a better way to waste $90", "label": 0}
{"text": "Would someone please think about the shareholders?", "label": 0}
{"text": "Summoning stone for sure.", "label": 0}
{"text": "So.. you’re telling me a business that is in money making business with some content on the side made loads of money with some side content? \n\nLook I’m all about voting with my wallet, but honestly I’d sell all my other store mounts if I could just have one and that one will be the longboi because he is simply convenient. Let me enjoy my piece of toast without thinking about all the forests that are being razed to make way for more wheat farmlands.", "label": 0}
{"text": "I don’t care what they do with the store, the whole “Fire all their support staff and replace them with the world’s worst ai” bullshit is the only crime we should be focused on.  They can sell whatever they want imo if they would just hire actual support staff.", "label": 0}
{"text": "This mount is still better value than the Diablo 4 expansion tbh", "label": 0}
{"text": "Oof at least in eu proce looks better only 78 euro xD same price at the end but still looks better than 90 dollar\n\"Visually better\"", "label": 0}
{"text": "The rogue is a literal exploit? Most of the raid bugs are exploits that players have to go out of their way to trigger, you know exploits have been in the game since launch? But now they are the biggest problem ever...these people abusing exploits are getting banned...\nSome of you just love to complain.", "label": 0}
{"text": "so what youre saying is that RMT is basically murder?", "label": 0}
{"text": "I agree. It's a matter of time before they increase sub cost to 20$", "label": 0}
{"text": "And this is how you justify Blizzard charging money for things that *should* be included in this game that we pay $15/month for. It's only going to get worse from here.", "label": 0}
{"text": "Real its just a matter of time before other rare mounts get sold or given out easier like in remix or trading post.", "label": 0}
{"text": "Oh yeah, for blizzard. I thought they were talking about the cost to the in game economy.", "label": 0}
{"text": "oh ok well, the credibility guy just said its possible", "label": 0}
{"text": "love yourself more", "label": 0}
{"text": "I mean, if it was in-game for gold, would you have the same complaint?  Since then people would just buy tokens to sell for gold to buy the mount.", "label": 0}
{"text": "Check the front page before trying to hop on the karma train next time", "label": 0}
{"text": "The original mount was 5 million gold. Id call 1.5 a god damn steal. Hence why its so popular.", "label": 0}
{"text": "Yup, this was my 7 year old and now he’s trying to find Roblox hacks and exploits all day lol", "label": 0}
{"text": "I switched to Prot Pally today, same ITL as my BDK and it feels 100x better in raid at least. HP spikes are nowhere near as bad.", "label": 0}
{"text": "So... how's the WoW economy?", "label": 0}
{"text": "> The hunters who were using the dogshit hero talent were blatant and should be banned so anyone thinking it's okay to do it in the future would likely not\n\nSo were they just not meant to play their class because Blizzard fucked up? What does it matter that someone got to be op for a couple of days and climb the arena ladder? Is a few more people getting the Glad mount this season really a problem?", "label": 0}
{"text": "I think you're giving them too much credit. It's negligence more than incompetence. They have the money, they have the resources, they simply don't have the motivation to allocate any of that properly when they can *drum roll* not do any of that and release a mount that honestly might've made them more money than the expac itself if they didn't have Ultimate editions.", "label": 0}
{"text": "Love this style. Background is amazing as well.", "label": 0}
{"text": "I'll wait till its on sale", "label": 0}
{"text": "No dud you don't understand that's like blizzard making even more money, we can't have that, we want wow to die.", "label": 0}
{"text": "With bought wow tokens :b", "label": 0}
{"text": "*laughs in lvl 50 time walking raid*\n\n I been doin 90%+ in all the new lfr raids on my alts. \n\nMy disc priest hit 2.16mil dps with 98.8% damage done overall at level 52. \n\nMy druid tanks each lfr in less than 5 minutes. \n\n- Vetamine", "label": 0}
{"text": "\"Despite inflation everywhere else? Despite increases to employee wages, operational costs, utilities, etc.? That $15/m in 2004 *should* be \\~$24-25/m now.\"\n\nNo, no.\n\nIt shouldn't have been $15/m in 2004 and it shouldn't be now. \n\nIt's okay to pay it if it is worth it to you, but the price is nowhere near being justified now and it wasn't back then.", "label": 0}
{"text": "I love my Credit Cardasaur! That’s such a cute name for it", "label": 0}
{"text": "Bought 6 tokens for this with the quickness.\n\nBargain", "label": 0}
{"text": "> Not only was it the far inferior talent option in PvP, it was borderline useless\n\nClearly it wasn't the far inferior option because it allowed you to do big damage.", "label": 0}
{"text": "Lol, removed for being too op.  Which youtuber told you that one?", "label": 0}
{"text": "Yes 6. 15*4 is only 60. Sorry.", "label": 0}
{"text": "I really want to see the dinosaur on there that'll be so funny", "label": 0}
{"text": "You're full of it lol. I beat ?? At 612 as a mage with a 47 brann. I also beat ? On 7 toons at like 585 ish ilevel for vault spam. It doesn't take 5-6 potions to heal u with a 50 brann 🤣🤣. Skill issue homie. Use healer brann and work on awareness and mechanics....also not embellishing", "label": 0}
{"text": "Karma train left hours ago lol. Better luck next time.", "label": 0}
{"text": "It's cuz of the gold - bnet balance cost that it is $90US, they are trying to soften the blow to original brutosaur owners.", "label": 0}
{"text": "Phil Spencer right now: Oh shit, we can deliver terrible quality patches and sell a mount for more than an AAA game costs? FIRE THE LAST 3 QA GUYS AND CALL THE INTERN TO SHIT MORE MICROTRANSACTIONS!", "label": 0}
{"text": "This one comes with a mailbox.\n\n“I am the mailbox”", "label": 0}
{"text": "resto shaman will be buffed until morale improves", "label": 0}
{"text": "This reminds me of TBC.  I had a buddy that gave me his account information so that I could run dailies for him while he was in the hospital.  I did that, but I also flew him straight up to the highest point above Shattrath.  I then dismounted and logged out while falling.  His reaction was the funniest I've ever seen.", "label": 0}
{"text": "Bruh... they create an inconvenience and sell you the solution and you don't see the problem?\n\nLook at charakter boosts. They literally created the game this way and now sell you a way around this game.\n\nThat's just as clever as people thanking god for curing cancer.", "label": 0}
{"text": "It's quite literally on the cash shop.\n\nWhether they remove it from there and add it back into the base game in several years time is entirely irrelevant to my point.", "label": 0}
{"text": "Imagine the manager that ends up taking credit for this idea", "label": 0}
{"text": "Oh it was a genius play by Blizzard.", "label": 0}
{"text": "It also happens to be factually correct.  \n\nThe token would need to hit a price of 833,333.33 (repeating, of course) gold before the new mount becomes more expensive than the old mount.", "label": 0}
{"text": "Yet you feel the need to tell people that you're getting use out of your $90 mount? Can't just enjoy it and let other people have a different opinion than you?", "label": 0}
{"text": "And it’s expensive as f for a mount.  The most expensive ever?", "label": 0}
{"text": "I’d buy this. No shame", "label": 0}
{"text": "Lots of new $90 mounts", "label": 0}
{"text": "Thats 2 grand plus in that screenshot", "label": 0}
{"text": "Ok and? You would be fine with people buying gold from a third party? What's the problem here blizzard making more money because people want gold and bnet balance? \nSome of you are just losing your minds over a stupid mount.\n\nI swear next time they should put it in game for the gold cap.", "label": 0}
{"text": "Might want to focus on why Blizzard doesn't think you have a WoW license on your account and then worry about the rest.", "label": 0}
{"text": "Yeah I get downvoted to oblivion every time I mention my disposable income perk. 🤣", "label": 0}
{"text": "HOW?\n\nyou dont need to keep DF herbs and rep token in your bag anymore.", "label": 0}
{"text": "So now can we get the original added back? There's literally no reason not to at this point.", "label": 0}
{"text": "But it’s not outrageous… \n\nWould putting it in the game for 2 million gold be outrageous?", "label": 0}
{"text": "In a year they will be like “why did they remove the mount ! I didn’t know it was temporary”", "label": 0}
{"text": "And this is exactly why 90% of players won't even see the issue.\n\nThe issue isn't going to be a \"pay to win\" scheme or the blatant shilling of everything on the store\n\n...it's going to be all the manpower and quality control that will now MOVE EXCLUSIVELY to the store since there's more money in this stupid fucking mount than there is in fixing bugs or balancing a competitive product\n\nIt must be intentional theyd put this out knowing DAMN WELL they didn't quality control this patch. It is the MOST egregiously broken and buggy patch in a long time and because of this I'll bet it was even more profitable than an expansion launch. \n\nAbsolutely insane. But money speaks and people are paying with their wallets.", "label": 0}
{"text": "I don’t want to browse a gold buying site on my phone if someone else already knows the cost", "label": 0}
{"text": "Lmao!", "label": 0}
{"text": "Always remember that all those riding the mount are those who have ruined modern gaming", "label": 0}
{"text": "And you contributed to us never getting another gold-available bruto ever again, thanks 👍🏻🫡", "label": 0}
{"text": "It's OK, you've made it clear that reading is hard.", "label": 0}
{"text": "For those wondering, this is now fixed.", "label": 0}
{"text": "I did exactly this. Cost me 1.8 mill 🤷‍♂️", "label": 0}
{"text": "My point is it doesn't have to be pay to win to be obnoxious, and I find it frustrating when people act like you can't criticize stuff unless it's literal, straight up \"this is a massive power/gameplay advantage totally unobtainable through other means.\"\n\nI know it's not giving a massive advantage. It does give a fair amount of convenience, it shows they're willing to monetize convenience/QoL, and games that monetize convenience can get pretty annoying.", "label": 0}
{"text": "Cheaper than a night at the bar and will get more use if your a wow no lifer like me.", "label": 0}
{"text": "Sorry, making a mount doesn't cost 100k.", "label": 0}
{"text": "we get what we fucking deserve 🤦", "label": 0}
{"text": "okay hear me out\nthe old brutosaur the wow token during bfa was like 175-185k most of bfa\nthis means it cost like $570 to buy\nso technically if you buy it now you save $480\nand if you want the other bruto now you are spending like $1000 on wow tokens\nand when time travel is patched in irl that will cost like at least $500 right\nso that loops back to $1000 if you try to get the bfa one\nso if you really stop to think about it\nyou are wasting money not buying this brutosaur", "label": 0}
{"text": "Well I've searched the entire support page and the closest topic I can find on the matter is \"recover email\"\nI have had this account for 12+ years on my b net, on the subscription page still shows my account active, it's just an error screen on the item restoration page that says no wow account.", "label": 0}
{"text": "You won't be able to buy tokens because the demand skyrocketed after the announcement.  It'll be a bit more than 1.2m gold by the time tokens become reasonably available again, but probably still less than the 5m that the old one cost.", "label": 0}
{"text": "wtf, i can buy a long boi with money, thanks for posting this", "label": 0}
{"text": "Do the token to gold conversion. None of the stuff in the store seems overpriced compared to vendor cosmetics and I will never understand why people complain. \n\nNow subscription to quality control on these recent patches is a fair complaint. ", "label": 0}
{"text": "When people have an issue with how other spend their money :)", "label": 0}
{"text": "They will add it back to the shop with the ability to actually finish the quest for $100", "label": 0}
{"text": "Get over it", "label": 0}
{"text": "Add a banker and barber to it", "label": 0}
{"text": "Blizzard's developer and designer salaries are literally higher than industry standard, what are you even talking about? It was non-tech jobs that they skimp out on pay with.\n\nRaking in six digits a year isn't \"fighting for survival\" or paid \"a bit over minimum wage\".", "label": 0}
{"text": "Yep could’ve spent hours and hours farming a million gold instead of working less than 30 minutes IRL to earn the $ needed for this mount.", "label": 0}
{"text": "As the saying goes, \"Ignorance is Bliss\". And because of that mentality the world is going downhill ever since.", "label": 0}
{"text": "You don’t get to tell me what my rights are", "label": 0}
{"text": "If your choice of fun money spending is encouraging atrocious money grab and game design, expect hate from people who care about having less money grabs and atrocious game designs in their game (that you chose to endorse with your 'fun money'", "label": 0}
{"text": "QA is just the scapegoat to not blame on the good old executives", "label": 0}
{"text": "postal\n\nAlso check the option in interface settings \"block all trades\"", "label": 0}
{"text": "Don't know for sure, but it is definitely between Monk, Druid, or Havoc DH. All have so much mobility and base move speed", "label": 0}
{"text": "I don't even care about the mount but making people pay for launch weekend was criminally douchebag behaviour to fans", "label": 0}
{"text": "I mean it's still easily doable for the value, it's just that it was extremely easy with the expac launch doing basically anything.", "label": 0}
{"text": "Thank you, someone needed to say it", "label": 0}
{"text": "They got me with the cat too. Smh. Love the cat tho ngl lol.", "label": 0}
{"text": "On EU its already 350K from 280K 3 days ago.", "label": 0}
{"text": "I hate this this fucking worked for me but it did LOL, thanks friend", "label": 0}
{"text": "you're not a dragon though, you're a dracthyr", "label": 0}
{"text": "It comes with a feat of strength. Totally worth it.", "label": 0}
{"text": "Lmao. How mad are all the IRL money buyers from BFA with their faux outrage and elitism? Or the streamer/semi pro people who feel the same? \n\nTBH, this was a good deal lol. Way cheaper than the people who bought it in BFA and cheaper/easier than BMAH now. \n\nWho’s the real sucker…?", "label": 0}
{"text": "It'd save a few minutes across the course of a day from using booty bay AH or shrine AH.  Barely an enormous advantage.", "label": 0}
{"text": "I mean it kind of did. When’s the last time you were in stormwind or org? Nobody is there.", "label": 0}
{"text": "If they get banned they might not buy the brontosaur", "label": 0}
{"text": "I really wanted to, checked the Canadian price. With tax, it comes to $150...", "label": 0}
{"text": "Not when they can sell it to you for \"limited time\" for 90 bucks.", "label": 0}
{"text": "Portable teleport chamber mount would be awesome", "label": 0}
{"text": "350K 15min ago", "label": 0}
{"text": "Is this account wide? If so, how? My Brann is 2 delves away from 60 as well, but it's split over 6 characters.", "label": 0}
{"text": "We'll get a mount that holds everyone in the guild before we get guild halls.\n\nCan you imagine how sick guild halls could be? Trophy rooms, giant meeting areas, some places for crafting guild specific things... Make it like Draenor Garrisons meets RuneScape and the Sims.\n\nAdd in a Texas Hold em mini game at the meeting table for people to bet gold.", "label": 0}
{"text": "Rather spend it on other shit. $90 is a lot of fishing tackle. Out of your motherfucking minds paying that much for pixels.", "label": 0}
{"text": "I’d buy 2 if that’s the case", "label": 0}
{"text": "Combined with the Halloween mount, the brutosaur, and the 12 month sub mount, it really feels like they're using the timegating of the anniversary to get people to stick around long enough to buy something. If it wasn't timegated, some people would blitz through it in a week and quit.", "label": 0}
{"text": "My only regret is that I couldn't give more.", "label": 0}
{"text": "what whas un wod and legion that makes then so rich ? just curious", "label": 0}
{"text": "🔥just purchased fellas🔥", "label": 0}
{"text": "Don't forget about the average everyday bugs:\n\n* Disconnects on skyriding\n* Warbank sorting filters resetting after logout\n* Some achievements that require you to relog to count\n* A massive amount of phasing bugs, especially involving NPCs (like the siege of boralus quest)\n* If you are using steady flight, the 'summon favorite mounts' button will often summon only ground mounts", "label": 0}
{"text": "People just have them parked outside the Auction House to show everyone they spent $90.", "label": 0}
{"text": "$140 NZD lmfao", "label": 0}
{"text": "So... you're not paying it? Then why are you participating in this discussion? Or you are, but you lack the personal agency to stop willingly giving money to a company you hate for a product you don't think is worth the cost of entry?", "label": 0}
{"text": "No it grow", "label": 0}
{"text": "What about this mount bothers you?", "label": 0}
{"text": "I remember an addon from Cata (the original release of it) that would track how people died and flag when someone died to avoidable damage. You could press a button and report that death to chat (or it would automatically do it when someone died). I remember thinking that it felt vital as a healer in Cata's launch heroics which were much harder than Wrath's. \n\nI wonder if one exists for nowadays. I can't imagine it would be hard to also track how people use (or don't use) their personals.", "label": 0}
{"text": "So gross", "label": 0}
{"text": "They waited Asmongold to get banned to release this mount.", "label": 0}
{"text": "Idk, in a couple of the bigger threads the sentiment is very much \"Lol you're poor, too bad so sad.\"", "label": 0}
{"text": "I can't hear you from the top of my sweet ass bronco.", "label": 0}
{"text": "Could they fund a fucking QA dept?", "label": 0}
{"text": "The original was also bullshit, but at the very least it was in the game itself rather than the store so they could at least pretend. Also being in the game means that the money used is gone rather than being transfered to credit card owners.", "label": 0}
{"text": "bank told me and confirmed it cleared and is on their end. \\[ppl whp bought this already had it. the bank even did a fraud check to make sure that wasnt the issue. i will wait it out however long it takes, but if i receive nothing, then hopefully the money returns to my bank.", "label": 0}
{"text": "There is a mailbox toy fro  DF. Cant remember ots name, but its easy to get, not a rare drop I believe.", "label": 0}
{"text": "Right but in the 20 or so games of mount mania I’ve played, I’ve never seen any other profession mounts except the flying machine.", "label": 0}
{"text": "\"It's on sale so basically I'm making money by buying it!\"", "label": 0}
{"text": "Where's your issue either way? How does it change the argument if I'm not paying it?\n\nWhy couldn't I pay it while being fully aware that the price is not justified?\n\nWhy do you think I -hate- the company?\n\nAll of that reply was completely intellectually dishonest.", "label": 0}
{"text": "i am never going to make enough gold to buy the ah mount. but $100, that's easy.", "label": 0}
{"text": "Yeah the people spending 20$ for gold were tricked by blizzard, you don't understand, you're not paying for it but you're actually paying way more for it, you should just give your gold to gold sellers next time.", "label": 0}
{"text": "FF", "label": 0}
{"text": "If you spend time just to make gold to pay for stuff then yes. But if you’re like me and raid with a bunch of alts. I’ve made over a million selling raid boe’s so I have gold just sitting there", "label": 0}
{"text": "Source: trust me bro", "label": 0}
{"text": "Honestly one of the worst communities I've ever interacted with, for this reason.", "label": 0}
{"text": "How do you mute bigwigs in dungeons? Also, how do you make this WA louder?", "label": 0}
{"text": "And they'll keep doing that if I stop complaining. So I might as well keep trying! Don't give up hope brother!", "label": 0}
{"text": "A couple rogue streamers have commented tonight that supercharger seems to have stopped working on eviscerate.  It was working yesterday after the patch but stopped working last night / today.", "label": 0}
{"text": "Do as the lemmings do.", "label": 0}
{"text": "This worked for me when i was using divine steed on my pala!", "label": 0}
{"text": "I just press F5 for my trusty ol Loot-a-rang", "label": 0}
{"text": "Rob kotsitch got a boat today?", "label": 0}
{"text": "Why are there so many brontos? Has something changed making them easier to acquire?", "label": 0}
{"text": "I would feel like such a piece of shit if I bought that.\n\nIm an adult with a great job. 90$ makes no difference in my life. But if I bought a game cosmetic with it I will feel like I lost my kids college fund at the craps table. \n\nLike it’s cool and people should do things that make them happy. Not for me though", "label": 0}
{"text": "A few years ago the brutosaur was 5m gold and people bought like $500 in tokens to get their hands on it. \n\nI spent 2m gold to get this thing now. 🤷‍♂️", "label": 0}
{"text": "They used to not have any tax on digital until 2019ish, and sadly no, you don’t see the tax until checkout. Roughly 10%", "label": 0}
{"text": "Any idea how many of these you’re gonna have to buy to get it?", "label": 0}
{"text": "Spectral Tiger will be a Twitch drop I swear to god I will bet $500 on this", "label": 0}
{"text": "Barber shop mount would probably get me caving. But they’ll have to figure out how to get that working on a technical side.", "label": 0}
{"text": "\"Why run something with people when it's easier and convenient to just do it alone?\"\n\nEver heard that sentence before? I have. A lot. And seen the behavior in action too.\n\nAnd I know from 10 years experience with Destiny 1 and 2 how much downhill a game can get in the social aspect if everything gets matchmaking and doesn't require groups anymore.\n\nDestiny 1 (still is) used to be the game where I had 100 friends in my Xbox FL (the limit at that time) which 40 of those regularly wanting to play with me, the other 60 occasionally asking for help at times.\n\nThat friend list basically dissolved over the first year launch experience of Destiny 2, because everything except endgame PvP 3v3 and Raids had matchmaking. Alongside other issues. And my online social life in that game never really recovered ever again from that blow.\n\nAgain, I know from experience how fast people rather stick to themselves instead of socializing if they have no need to anymore. There is an entire topic of science about this behavior, based on human evolution history.\n\n[Tribalism - Wikipedia](https://en.wikipedia.org/wiki/Tribalism)\n\nAll you have to do is looking at the guild/LFG history compared between classic 2004 and todays retail. Back then **you had to be social** and in most cases it was good and rewarding to be social in the game. Today? You barely get a \"Hello\" from other people in Dungeon Finder.\n\n[Half of the games population behaves like bots that have 0 instructions how to interact with each other.](https://youtu.be/E7pnseIm5mY?si=8U7QN7kQkPuwcfFv)", "label": 0}
{"text": "Tons of work is also maybe an overestimate. It certainly isn't 90 dollars each of dev time. 300-500 hours might be closer but we can't ever truly know, of course. There's too many variables, only blizzard knows exactly how much it cost to develop.", "label": 0}
{"text": "You mean 3rd party broadcasting Software. That has been banned in BfA. Multiboxing, or having multiple clients open simultaneously is allowed", "label": 0}
{"text": "I mean, a mount made more money than the base game of StarCraft 2. Wings of liberty is the base game. \n\nThat’s absolutely insane.", "label": 0}
{"text": "Mission tables. I had like 8 alts running them constantly and made a couple million without optimizing. Some people had accounts full of max level chars and optimized for gold income. They likely made billions.", "label": 0}
{"text": "I've been suffering through outlaw and nothing else since SL \n\nIt makes me genuinely sad to see the \"buff\" that gets us out of mediocrity is a fucking exploit. \n\nAnd surely now they're going to double down on it and banish us back to 0 damage hell just like in Df s3 where they couldn't balance crackshot builds so they just rolled out nerf after nerf until the only value for outlaw was as a stunbot.\n\nWe were just starting to get some damage in things like KS so it actually KILLs instead of being a fucking defensive", "label": 0}
{"text": "Not like you can buy tokens right now", "label": 0}
{"text": "Hey there, welcome (back) to WoW!\n\n> Per the suggestion of a friend I boosted my character and started fresh in the War Within.\n\nThis is usually bad advice for anyone completely new to the game, but if you still have some (however minor) experience from when you last played, then it's probably fine.\n\n> It took me awhile however to realize that the dungeons were just available whenever and not tied to the story. I went through each of them roughly where I thought they might fit into the story but honestly I wish they had some more direct narrative tie in. \n\nFWIW, they used to tie into each zone's story more. They would often be the capstone for a zone's story. Other times, they would be out of the way and not be involved in the story at all, and you might stumble up on a random NPC somewhere who sends you to the dungeon because they have beef with one of the bosses. I personally like both approaches because I always like exploration in games, and there was an era when a dungeon that was out of the way and didn't connect to any major story had an aura of mystery to it.\n\nNowadays, while there are still a few examples in older expansions of long zone stories leading to a dungeon, Blizzard's recent approach is to stick NPCs in the entrance of a dungeon who have the quests for said dungeon. \n\n> [...] or if dungeons need ilvl synching like FFXIV has or what.\n\nNot taking into account ilvl, there is some level scaling that happens in normal dungeons because you can get grouped with players well below or above your level. In these cases, the scaling was always a bit weird because lower level characters would do exponentially more damage than high level characters. That said, Blizzard changed how scaling works this week (everything used to scale down to the content's original level. Now, everything scales up to max level I think), and I don't know how it has affected relative player power in scaled situations.\n\nHowever, more recently, scaling has been viewed a bit more negative in terms of content scaling up to your level. As you level up, your stats give less benefit per point. If you're fighting a monster, and you level up, but the monster scales up to your level, you're suddenly doing less damage and taking more damage before. No one wants to feel like they're getting weaker as they level up. I leveled my prot warrior from 70 to 80 this week. I went from feeling unstoppable at 70 to feeling much squishier at 79 in the same dungeon content.\n\nObviously, things are different with ilvl scaling vs level scaling, but the point still stands that people don't want to feel weaker over time doing the same content.\n\n> I would get queued in a dungeon where it seemed I was so underheated/leveled compared to the rest of the party that I couldn't actually contribute and I actually apologized and left several of these parties because it just didn't feel like I was actually helping.\n\nI mainly play healers. In my plethora of alts that I've leveled through dungeon spam, I don't think I've *ever* had a situation where I felt like my heals were not contributing. Weaker? Yes, as they got closer to max level and the scaling was kicking in, but never ineffective. For groups that were roflstomping the content, I was doing great damage because of (once again) weird scaling, but I never felt like my heals weren't doing anything. Your experience is interesting, to say the least.", "label": 0}
{"text": "F", "label": 0}
{"text": "You're right but that said, large amounts of gold moving around is more likely to cause some of those people to spend it on actual gold sinks.  People who had millions of gold sitting were clearly not buying any of the currently available gold sinks either because they already did or because they don't care for them.  \n\nBut a bunch of that gold being shifted to players who haven't had this much gold before might get them to buy big ticket items.  \n\nAnd since this mount doesn't actually create any gold that wasn't in the system already, all the gold that might be spent because of increased circulation ends up being a net gold sink.", "label": 0}
{"text": "Mission tables used to give out shitloads of gold. Get an assload of alts and run those for 4 years and presto you have the reason the economy is a shitshow.", "label": 0}
{"text": "90$ for a mount?", "label": 0}
{"text": "The bug required multiple applications of black arrow on different targets. You would not encounter this through normal play on Mark's and would only encounter it through normal play the entire enemy team stacked up. The fact that you would even try to argue  MM Hunters using kill shot/black arrow proccs on multiple targets rather than just using it on the kill target is fucking absurd and you know it.\n\n\nEverything is Blizzards fuck up, you could argue this dumb ass argument on critter abuse last expansion that players went unpunished for and the rogue exploit that players are now getting punished for. You think rogues hitting a critter and swapping talents was some insane sequence of events? Or Demonhunters hitting immolatikn aura on a critter then exploding a boss? It's the fact that these people know there is a bug and they are going out of there way to purposely abuse it.\n\n\nYou wanna know what I queued in to ob multiple occasions? Double hunter Hpal where two hunters were abusing the Phantom Pain exploit while the Hpal was abusing the no cooldown sacrifice bug. Guess they were just playing normally though and that's a normal comp.", "label": 0}
{"text": "Not a thing as far as I can tell. I’ve won repeatedly and didn’t even get style tokens. TOTAL BS", "label": 0}
{"text": "The last 6 months of TBC classic I went every week. We saw it drop once. Went to a Tauren warrior that I never saw again.", "label": 0}
{"text": "no freaking way 🫢 this is probably last thing i'd thought of lmao", "label": 0}
{"text": "a goblin", "label": 0}
{"text": "Holy shit. Thank you mon!", "label": 0}
{"text": "I've been playing wow since 2005 only quitting for 3 years\n\nThe game and every MMO releases is like that. Whether it's gear, mounts, achievments...", "label": 0}
{"text": "It's called segmentation, after the first people spend real cash on the item to get their reward dopamine, you give it away as a free reward to people who did not want to pay for it.\n\nThat way you can use the same mechanic twice and reap maximum cost efficiency and revenue. \n\nOf course some of the players who paid will be upset, but then the white knights will come and say the game shouldn't have exclusives and bla bla. So they will reskin it slightly.\n\nThis is a true and tried mechanic. No matter what people want to tell themselves here.", "label": 0}
{"text": "I think you can do @target too no?", "label": 0}
{"text": "There’s no mythic difficulty so I am pleased that heroic is a little on the challenging side", "label": 0}
{"text": "They added a saddle in dragonflight for a Halloween customization though iirc drops from this too", "label": 0}
{"text": "We we go by both our anecdotes, yes it seems to be a skill issue. Cheers", "label": 0}
{"text": "The most effective gold sink is banning botters.", "label": 0}
{"text": "I cant ubsub in protest. I unsub in BfA after the cloak dropped. Time gate after time gate in every patch. I had to spend most of my play time each night after work grinding to unlock the new content. Most of that was travel time because the content zones were on opposite ends of the game. \n\n  \nAlso level scaling sucks when it also scales to your ilevel. Theres no point in getting better gear if trash mobs keep up with epic gear.", "label": 0}
{"text": "I have been playing for two days. Had several quests where progress was not counted/was resetting. Had quest where reward was not granted. Been trying to do worldquests and had one where mobs did not spawn and after relog appeared and did not grand progress. Had queue bug where I could not get into Chromie scenario. Had bug where I got kicked out of scenario in the middle of doing it. Had bug when doing old content for transmog . shadowlands bugged for new character for a while because the threads of fate change where my character could not do anything either take up quests or fly to any zone. Still did not receive most transmog from completing past quests (which was supposed to be a feature this patch). Had been unable to login to characters sometimes with error \"character not found\" and stuck for few minutes. Almost everything is bugged this patch. You can see other people listing multiple other worse things in many threads in reddit and forums, since almost all content is buggy right now. I am not sure what are you even asking.", "label": 0}
{"text": "Lmao, I was doing this too 🤣 stood in front of the auction house \"reminiscing\" with other Bruto riders", "label": 0}
{"text": "It’s a charity item", "label": 0}
{"text": "To my knowledge no EU states have additional tax after the 78 EUR.", "label": 0}
{"text": "But it didn't need 1/4 nerfs. Those specs needs buffs that's what I'm saying lol", "label": 0}
{"text": "6, I believe.", "label": 0}
{"text": "i am not saying people are lying about getting stuck in the dawnbreaker. what i really read is people don't know how to fly and get themselves stuck.", "label": 0}
{"text": "Can you make it listen for mount calls in mount mania and show a button to attempt to /cast that mount?", "label": 0}
{"text": "Childless cat lady here, I buy what I want. 🦕", "label": 0}
{"text": "I think in entire EU, The price is 78 EUR with taxes already included, so it's 6 tokens", "label": 0}
{"text": "It just seems like…. The people complaining about out monetization at this point, should probably look for another game if it’s unbearable.  This was a test, and it worked fantastically for Blizzard.  There’s no changing it.  It’s gonna get worse too.  Complaining is going to do nothing, because there’s more money on the game than just you.", "label": 0}
{"text": "Same thing as Intel. They hired thousands over the past couple of years and now are laying all of them off.", "label": 0}
{"text": "> If you remove the latter people, the whales will lose interest as well.\n\nThis. You get it.\n\nDear Reader. If you think you matter because you're \"Voting with your Wallet\" you don't understand microtransactions. They make these knowing a small percentage of players will buy it. They accounted for you when they made it, and they don't care that you aren't buying. It's expensive, and the buyers dollars outvote you 1000 to 1.\n\nThe only impactful move you can have is to not play at all. Of course that has a cost. You lose the game you're playing.\n\nBut that's the cost. Whale-hunting never goes away and only gets worse with time. Courting whales means they're developing for the rich now, and not for the average player, except enough to make a 'good enough' product to keep you engaged. \n\n\nIf you're unwilling to quit, that's totally fine. But that means you're still supporting this business model by keeping the game's playerbase healthy, period.", "label": 0}
{"text": "\n\nYou probably wont invite me since I am disc priest with no interrupts. ", "label": 0}
{"text": "are you playing 420p?", "label": 0}
{"text": "nope", "label": 0}
{"text": "FF14 travel is what it is because the world is zoned and you can not just fly over some mountains to get into the next zone at any odd angle. I would love to be able to soar over the deserts into the Gold Saucer but the ways in and out are teleport links. Blizzard tried forcing people to the ground like this for six years in MOP-BFA and it just made people annoyed that flying was learned over and over again.\n\nNow granted, you'd want FF14's travel system if you completely threw out being able to travel across the world without loading screens, but it's one of the engine's best strengths so why on earth would you ever want to do that? *\\[glares at Shadowlands\\]*", "label": 0}
{"text": "did you even watch the video", "label": 0}
{"text": "The FCC or other government organs in other countries should have done something about the merger in the form it happened.", "label": 0}
{"text": "that’s just so stupid. M+ is infinitely scaling. at some point you won’t be able to do the key level. why does it matter if it’s at a 12 or a 24 or a 32? either prog and struggle, or play at a lower level….. if you can’t achieve 3k rating it means you’re not good enough. also, 3k rating this season is incredibly difficult so don’t feel bad if you can’t get there.", "label": 0}
{"text": "I’m not sure if you’re aware, but you are able to get this mount via in-game means.", "label": 0}
{"text": "Can you explain it to me? Maybe I misused it, English is not my first language.\n\nWhat I'm trying to say is: You claim you can't get the best gear because of your inability to get into keys. But I'm doing just that, and been doing so for the entire last expansion.\n\nSo if I can do it and you are not able to do so, what issue do we have at hand?", "label": 0}
{"text": "What if the 5th leg between his back legs was a way for blizzard to somehow insert new ideas and ways intoyou, so that you give them more money?", "label": 0}
{"text": "What about the guy who pitched the longboi 2.0? He single handedly created 10 million in a day probably", "label": 0}
{"text": "At least it's not guild achievement spam, I guess.", "label": 0}
{"text": "Instead of spending $180 a year on WoW, you could give that to your local animal shelter too 🤷‍♂️", "label": 0}
{"text": "I think with context clues it's evident they just forgot a 0 on $6000, as you mentioned, it would be equal to $60000 which is a relatively normal salary.", "label": 0}
{"text": "Resurrection", "label": 0}
{"text": "I did heroic with like 10-12 guildies last night from 620 to 630 ilvl (625 average). The mechanics were fine, healable for a good pair of healers. The health on the bosses is a bit high for a 10 man group in my opinion. The fights lasted about 4-5 minutes, which is fine, but it's super boring because it's the same few mechanics every time. Argelmach was 7 minutes and nothing changes in those 7 minutes of fight time.\n\nFlamelash was really fun. 4 minute fight, have to deal with the intermission adds correctly, good healing check. The rest of them were really boring.", "label": 0}
{"text": "Probably more like $200k in costs per employee.  And they still grew by 5000 employees overall, they just reduced some of the gaming studiosz", "label": 0}
{"text": "How do I join a group for the world boss? Do I need to coordinate with a guild or is their a lfg fuctionality", "label": 0}
{"text": "Easy, buy a Brutosaur, name, and realm change.", "label": 0}
{"text": "Man this is the same circle jerk people post every single xpac. We know WoW has bugs with lots of its updates blizzard usually fixes them quick but holy shit is it exhausting seeing the same complaints every year. Just stop playing the game.", "label": 0}
{"text": "I want a mount that can solo M+10s", "label": 0}
{"text": "Hehe thanks :)", "label": 0}
{"text": "Human beings like this deserve to be told they’re going to hell in their death bed", "label": 0}
{"text": "Search in custom for the boss you wanna fight", "label": 0}
{"text": "That mount is going to cost $100 and it will have the great vault.", "label": 0}
{"text": "what a whack take. if somebody makes $50 an hour you think buying a once in a lifetime mount purchase is that outrageous? lol", "label": 0}
{"text": "Does not affect me so don't care.", "label": 0}
{"text": "I would expect nothing less whenever Big Broom is involved.", "label": 0}
{"text": "It sucks as someone who simultaneously likes retail but also likes the immersive, RPG aspect of things.\n\nGive players a Classic-like server where people still take boats and go to major cities for their banking needs with all the content from the new xpac.", "label": 0}
{"text": "Meanwhile WoW players, playing a game drowning in bugs and clear signs of zero balance testing: YOU DON'T HAVE TO BUY THE MOUNT!!!", "label": 0}
{"text": "Lol, I definitely saw it as the new riders being \"new money\" and the green riders being that old world money - that generational wealth. They definitely think we're uncultured swine 😂", "label": 0}
{"text": "It is what itcis", "label": 0}
{"text": "🐒", "label": 0}
{"text": "Yes. What has that to do with the fact that they could have made the AH mount a charity sale as well, except that likely many more buy an AH mount than a fox pet. ", "label": 0}
{"text": "I do have my own group, but the content we do is still mostly a 'waste' of time. In the absolute best case scenario, each failed attempt is followed by 1 hour of leveling the bricked key again. I just fail to see what the upside on this that makes blizzard think its worth it", "label": 0}
{"text": "No, they fixed it. I still have to get the retroactive appearances, which are still not working.", "label": 0}
{"text": "Hit 250k one time and immediately bought the Grand Yak boy.", "label": 0}
{"text": "For your first run of the day you have a greatly increased drop rate for the mounts. This applies to account only, so doing it on alts will still have the chance to drop the mount but at the normal rate. It was changed a year-2 years ago.", "label": 0}
{"text": "I saw doomwalker drop the mammoth for someone this morning so it’s untelling", "label": 0}
{"text": "That’s a good point, the cost per employee is *way* more than their salary.", "label": 0}
{"text": "No wonder my 606 ilvl char gets no acceptance from any listed pugs.\nI felt extremely disheartened and it made me log off for the day, because I thought 606 was high enough for the heroic version based on the loot from both modes.", "label": 0}
{"text": "Hi /u/Add_Iroha_to_GBVSR, thanks for your art submission!\n\nPlease make sure you've included the artist's name in the title of your post if you are not the OC, or your post may be removed. If you would like, you can also make a top-level comment or reply to this sticky with further details regarding where to find the artist; for example, their social media links or Etsy shop.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wow) if you have any questions or concerns.*", "label": 0}
{"text": "It shouldn't surprise us that all companies eventually become this. I am surprised at how many people are aggressively defending the mount.", "label": 0}
{"text": "At first I was bummed that the new one has a mailbox, but then I realized that the new one doesn’t have a vendor at all, and I love vendoring things on my Bruto. So it didn’t feel that bad anymore. 😭", "label": 0}
{"text": "Going to strongly disagree with that, and push back with the fact that people don't unsub en mass over the issues you've mentioned.\n\n\nWhat's happening right now with the latest expansion is proof of that, game mechanics/bugs gone wrong don't cause people to quit, it just causes them to complain. And people weren't complaining about the lack of content until later in that expansion.\n\n\n\nPeople were pissed about Blizzard taking flying away. I was there, and I was one of the people who unsubbed because of it. The forums were on fire about it at the time.", "label": 0}
{"text": "I don’t even think about it", "label": 0}
{"text": "I mean, i dont even care much about that, ppl do what they want. What i would love is just being able to try and learn what is relevant to me, and not being walled from it for no obvious good reason", "label": 0}
{"text": "Are you honestly saying the issue is the fact its a social game, and not the fact they've released a mount at a higher price point that then expansion pack it features in?\n\nHey, I don't really care how people spend their money, but there's no way you can convince me this is a good move for the gaming industry overall.", "label": 0}
{"text": "How about donate 100% of your paycheck and your next paycheck to charity? It would be for the best, right. giving money to those who truly need? :)", "label": 0}
{"text": "I've been slowly chiseling away at this for years. ive had long breaks away from WoW, but I feel like this Fall I'm going to finally get my mount. Thanks for this guide! These achieves are something else . . .", "label": 0}
{"text": "Probably an hour or two with a max level character, maybe a little longer to get carried otherwise.", "label": 0}
{"text": "yah i experienced the exact same thing in SL from brew to DH\n\nand again this expac going from hpal to rsham\n\nnight and day", "label": 0}
{"text": "Guess they will add mogs for mounts next ...", "label": 0}
{"text": "I have been playing this game since launch and I have never once bought anything from the in game store.  \n\nSo, if you are confused here, the bottom line is that you are desperately wrong.", "label": 0}
{"text": "LF1M, only apply if you have the $300 summon mount!!!!", "label": 0}
{"text": "If only they unsubbed 17 years ago when this first was going on ...", "label": 0}
{"text": "How about you donate 100% of your salary, and all of your personal possession to people who truly need?  Oh wait - thats now out of bounds, and an insane concept?  Do you think people work at Blizzard for free?", "label": 0}
{"text": "SoloQ M+ needs to happen yesterday.", "label": 0}
{"text": "Every bot farm will buy multiple because its efficient when playing the auction house lol", "label": 0}
{"text": "I'm actually thinking of getting the bear because I'm tired of those two everytime I dismount.", "label": 0}
{"text": "My mothers credit card havent never been this ready. Bring it on Blizzard!", "label": 0}
{"text": "Because this is a subscription based game, not a free game. That's why. The only \"free\" version is a trial version where you can only get up to level 20(80 is max)", "label": 0}
{"text": ">at least half of my raid team has the old ones\n\nyes, raiders are on average going to have more gold than casual players", "label": 0}
{"text": "If this is a roundabout way of asking keys to not brick, that has negative trade offs which imo aren’t really worth it. \n\nMaybe this is simply the maximum skill level your group can achieve. Other players are pushing higher keys, so they must be doing something right.", "label": 0}
{"text": "I agree with what you said, and I think part of the problem is that the key level for getting the best gear and the key level for prestige being too close. I’m not saying make the keys easier, but to make a smaller difference between each key level and make more key levels so people can have a sense of progression and people won’t feel forced to run meta comps at lower key levels. This would allow people to see the skill levels better for pushing the content and not be flooded with people that can do 10s but not 11s.", "label": 0}
{"text": "I still feel like the price point was based on the assumption that a lot of us would be using gold > tokens > Blizz cash.\n\nI won't pretend I know how many people paid cash outright, but the AH being out of tokens I think says a lot about most of us bought when given the option. I looked at it as a 1.2m gold mount with a good ROI.", "label": 0}
{"text": "I love how much people are trying to hate on people who have it. Why so pressed? Nothing better to do with your life?", "label": 0}
{"text": "@ player and @ target are diffrent macro's, you cant use @ target it is prohibited years ago by sins of pvp players.", "label": 0}
{"text": ">When did I say anything about what anyone else thinks?\n\nYou’ve made general statements this entire time. \n\n>Please explain how being able to buy store things with gold means it’s not a bad that those things are even in the store in the first place. It just means there’s technically a workaround which may or may not work or be beneficial for some. The fact that time spent in the game and real life money are interchangeable is a bad thing in itself.\n\nThere you go, deciding for other people. Why is having options bad? If someone wants to spend 90$ to skip having to grind for 2 months, they should be able to. \n\n>Yes, the slope which has already been sloping since people have been talking about it, but which you choose to ignore and instead live in the fantasy land where they will stop at an arbitrary point.\n\nIt hasn’t slipped at all. This is a mount that was already in the game and people had 2 years to buy. This one is also way cheaper too. \n\n>It’s not an imaginary argument, it’s an hypothetical scenario. It may or may not happen, but the fact that they have been setting wider and wider precedents for what is reasonable to sell in the store, added to the fact that people are not only complacent about it but even go to the extent of defending it, means that the only reason to believe it will not happen sooner or later is that you trust in the multi-million dollar corporation to not extend its greed beyond what you personally think is acceptable.\n\nWhat if in 30 years wow gold is the worlds currency and in order to get a hear operation to save your life you have to grind gold but the only way to get gold fast enough to save ur life is to use the dinosaur mount but you can’t afford it so you have to steal copper from children in order to buy the mount in order to save your life. What then?!", "label": 0}
{"text": "How do you think that will turn out?\n\nWould the people who are currently pushing high keys make use of it, therefore lowering their chances of success? (Given that your reply is made on a post about not being able to get into higher keys)\n\nNo they wouldn't, obviously. So how would a m+ soloq help here?", "label": 0}
{"text": "It does sometimes, yes.", "label": 0}
{"text": "He gets paid more cause he's using AI more to lay people off and collect more for money saved...", "label": 0}
{"text": "Wife's boyfriend..... My son I have something to tell you...", "label": 0}
{"text": "Alright cool, that’s all I needed to know tyvm!", "label": 0}
{"text": "That’s the one I play ya", "label": 0}
{"text": "I got the serpent from the sha for myself last night. Audibly gasped 😂", "label": 0}
{"text": "Yes, the vast majority of the playerbase will go to soloQ and it will greatly broaden spec diversity. Same with SoloQ arena and BGs.", "label": 0}
{"text": "I asked in a thread once what the purpose of having keys is. Seems like if I want to test myself in a higher dungeon I should be able to do that and not be at the mercy of all these uncontrollable variables. I was downvoted into oblivion for asking a question.", "label": 0}
{"text": "No, for you to afford bruto with bnet balance someone has to pay for the token in the first place. Wow tokens being sold for gold so you can convert to bnet balance don’t magically appear, someone paid 20 bucks for them.", "label": 0}
{"text": "I think you need to start living for yourself and not through others.", "label": 0}
{"text": "Thanks mate <3", "label": 0}
{"text": "Imagine how unfathomably strong, skilled, and cunning you would have to be, to survive in a world like Warcraft with no magic at all.\n\nJust your grit, your wits, and your weapon.\n\nWarriors are the pinnacle of *fucking badass* in this game's lore.\n\nSigned, a caster main.", "label": 0}
{"text": "I am assuming the botter got banned after buying the mount, so they wanted to recoup their costs.", "label": 0}
{"text": "They’ll definitely do it then", "label": 0}
{"text": "90$ ???? LMAOOOOOO", "label": 0}
{"text": "True that would be op as fuck", "label": 0}
{"text": "Only people coping are the swipers. You pulled out your credit card to buy them one way or another you’re a piggy. Bfa or new", "label": 0}
{"text": "Wtf yeah, why do we not have Trex mounts yet?!", "label": 0}
{"text": "I guess so. But if you queue up and get into a group with overlapping buffs, or no combat rez, or without some profession that would be required for a skip...", "label": 0}
{"text": "I don't care enough to be bothered by it, but if an irl friend did that I would definitely make fun of them. it also indicates that these players are too bad to ever get AOTC themselves unless someone carries them hard, so if it's guildies I would probably not expect to get AOTC with them, except maybe at the very end of the season.", "label": 0}
{"text": "Haven't needed to store anything soulbound?", "label": 0}
{"text": "Wild man. I know there are bugs, there always are. Was just curious. \n\nHaven't had a single issue with anything you just listed other than the transmog stuff. I play cata classic too and the transmog shit there was bugged in the exact same way. \n\nHaven't had a single issue with quests, mobs, log in, dungeons, raids or bosses in the 2 months I've been playing. Not a one lol\n\nNone of my friends/guild members have had any of those issues either,  though the guild I run with sometimes was effected by the gbank fiasco I think. \n\nAnecdotal account on my end vs Anecdotal account on your end of course, just interesting to me!", "label": 0}
{"text": "YES! LOVE TO SEE IT MAN!", "label": 0}
{"text": "Ret isn't braindead if you actually open your spellbook. \n\nIt's actually probably *necessary* their DPS rotation is simplistic, on account of how many goddamn buttons they get to make crazy plays for their team.\n\nRet fucks. Put some respect on my pink homies' name.", "label": 0}
{"text": "That's some funny stuff right there! lol", "label": 0}
{"text": "I didn't even buy the mount but man how can you be so salty. It's a mailbox for which a toy exists, and the AH, for which you can just log out and send stuff to your character at zero delay using the mailbox toy.", "label": 0}
{"text": "Lmao", "label": 0}
{"text": "I’m just wondering how I’m supposed to get TW 15,000 tokens to get all 3 mounts", "label": 0}
{"text": "Do you?", "label": 0}
{"text": ">Why can't we just play what we wanna play?\n\nRight now keys are finite and we are incentivized to run alternate dungeons. Even LFG is going to run out at some point. If blizzard let people choose their key you would quickly run into issues of some dungeons basically never being run. This wouldn't only be a massive waste of dev time but imagine your BiS Trinket drops in one of those. Thats just KR all over again. \n\nSince the majority of players engages with that side of the system over pushing beyond 10s i dont see why they would allow us to choose. But maybe they can be convinced to treat post reward keys (11s+ as of now) differently in the future. At that point you want to do all of them anyway due to score being the main focus.", "label": 0}
{"text": "insert anakin padme meme.", "label": 0}
{"text": "\"That's just what we called the ladle\" bro 💀💀💀", "label": 0}
{"text": "I was hoping if I got the rating that season on my main I could buy the sets on alts. That’s what the tooltip suggests. But it’s only letting me buy sets I already earned which is pointless", "label": 0}
{"text": "Yes, I’m sure you’d rather load into a +10 GB with 3 shadow priests than take any amount of time to find a group.", "label": 0}
{"text": "Theres a couple quests to do where she takes you to main palace they she sets bade and then portals to Capital cities. Follow main quest", "label": 0}
{"text": "I was laid off last month from them and now I see this. Great.", "label": 0}
{"text": "Resto shaman or holy priest are probably the best/easiest entry points. Disc is totally different than other healers. \n\nMake sure to have mouse over macros for your healing spells and dispel, this is a must. \n\nOtherwise, I’d recommend watching guides and do some low stakes heroics or delves to get used to it. Good luck!", "label": 0}
{"text": "Exactly! 😆", "label": 0}
{"text": "there's a bit of shit in your upper lip", "label": 0}
{"text": "Lol only if you consider Blizzard company scrip to be \"money\" with which you \"afford\" things \n\nThe original was only more expensive if you bought the insane number of token it would have cost to own it. For the vast majority of the people that own it, it cost $0.", "label": 0}
{"text": "It can fly, just only in steady flight. If you want to instant cast fly you gotta pay $25 to papa blizz for the store broom.", "label": 0}
{"text": "The amount of blizzard nut huggers in this thread is insane", "label": 0}
{"text": "garrison and pruning were EXTREMELY unpopular with the community when WoD launched. what we have today is not even in the same realm of how much everyone shit on them over garrisons.\n\ni was there too.", "label": 0}
{"text": "Is this a limited time mount? Or can I wait 6 months for one of those 50% off sales?", "label": 0}
{"text": "Point proven.", "label": 0}
{"text": "Professions aren't required for skips except in rare circumstances. Blizzard can easily set a formula that will discourage class overlapping, and they'd want to include buffs to drums to make it only 5% worse than true lust. \n\nIt'd be like arena soloQ where it rarely puts you up against a healer of the same class unless the queue is super long. They can put tons of guardrails in place.", "label": 0}
{"text": "To add on the other comments here. If you ignore anyone in game, and they go out of their way to evade the ignore and contact you, whether it be mail or whispers, it's now considered harassment. Keep reporting and he'll be dealt with", "label": 0}
{"text": "That would be really cool if it could pause a fight or something.", "label": 0}
{"text": "I got mine yesterday! And it’s cheap too.", "label": 0}
{"text": "Totally swept under the rug", "label": 0}
{"text": "Absolute gigachad who pulled the boss there. I feel bad for Lorewalker Cho though.", "label": 0}
{"text": "My bad I wanted a mount", "label": 0}
{"text": "Yeah, and the average Microsoft employee makes way more than $60k", "label": 0}
{"text": "I did this with a friend for Ashes of A’lar. 10 years later, I’m still bitter about it. Never dropped again and I ran it weekly.", "label": 0}
{"text": "Cmon man, as if thats not already on the mind of the bli$$ard moneybags :P", "label": 0}
{"text": "Do I think adding this mount to the shop was a mistake?  Yes.\n\nAm I going to buy this mount?  Also Yes.\n\nThe previous mount was 5 million gold.  Even with the inflated prices of the wow token right now, I can get this for HALF the gold cost.  This is where they screwed up in terms of the implementation.  At the same time, they are going to make a lot of money on this.", "label": 0}
{"text": "Are you a dwarf? If you're a dwarf, I've got just the guild for you. And no, this isn't a troll. Only dwarves allowed, no trolls.", "label": 0}
{"text": "I got the blue one dropped from Doomwalker, it's really nice too tbh, almost as good as the original.", "label": 0}
{"text": "Well, actually this is one I want[hot rod.](https://wowpedia.fandom.com/wiki/Hot_rod)", "label": 0}
{"text": "Your post contains a link to the old Warcraft Wiki and that wiki is out of date. The Warcraft Wiki community is now using [Warcraft Wiki at wiki.gg](https://warcraft.wiki.gg/). Please update your bookmarks or [download the wiki.gg redirect extension](https://wiki.gg/redirect/) to redirect old links.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wow) if you have any questions or concerns.*", "label": 0}
{"text": "speaking of, the horseman’s reigns dropped for a pug I was in last night classic time walking dungeon, for someone else, I was happy for them but extremely irritated lol \n\nI’ve cleared that thing hundreds of times (including during its main period days) and never even seen it drop in a group period 🙄", "label": 0}
{"text": "Seriously, you're in the middle of an aggro and you level up and have new talents and freeze to add them so you can use in that aggro. I can't tell you how many times that drove me nuts that I couldn't stop for a second to do just that or even to see if I've met my quest goals lol", "label": 0}
{"text": "Your first and last statements are wrong.  If you can only do X amount of activities which will in total give you 49 tokens (according to the icy veins link someone else provided), that is equivalent to saying you can't earn more than 49 tokens.  Also, if they are at 40 tokens, they did not run out of stuff to do that gives tokens because you can get more this week.", "label": 0}
{"text": "No cuz it's always the same", "label": 0}
{"text": "The Heads of the company probably building a whole ass cosby mansion right now.\n\nThis whole thing is so fucked up", "label": 0}
{"text": "Sorry, funko pop pet?", "label": 0}
{"text": "Of course but the picture is of Microsoft’s CEO and MS is what everyone keeps bringing up", "label": 0}
{"text": "That sucks. I got it on my second try. Haven't gotten any other rare mounts, though, so i guess I used up my RNG luck on that.", "label": 0}
{"text": "We replaced passion with consumerism years ago in gaming. This is not a shock to me.", "label": 0}
{"text": "300 euros", "label": 0}
{"text": "I gave him a dollar.", "label": 0}
{"text": "The documentary ‘The Remarkable Life of Ibelin’ went up on Netflix today. It’s the story of a guy who had Duchenne’s that played WoW, he died when he was 25, and his family was unaware of his online presence.", "label": 0}
{"text": "I cleared heroic with my guild (625 - 630 ilvl). It's much harder than I would expect for a raid that drops hero track gear. We have no intention of going back there again.", "label": 0}
{"text": "Get Plumber. It does that.", "label": 0}
{"text": "Boy are you people going to be upset when you see how much people spend on phones, watches, cars.", "label": 0}
{"text": "Fix it now Blizz!", "label": 0}
{"text": "This game literally costs $200 per year *just to log in*. It has from the start. There is nowhere for this to be \"going,\" it has been this way since the start.", "label": 0}
{"text": "It's honestly kinda nuts how...rabid folks are for the new mount. How much they'll defend blizz for selling them basically an overpriced add-on. \n\nIf you bought it with in-game gold, no shame on you though. If you're playin' the auction game and buyin' up tokens to trade for blizz balance that's one thing - but even so it's...not a decision folks should support, this mount. \n\n$15 was already way too much for a mount. A mount is worth $2. Less. It's nothing. It should be included in your sub for gods' sakes. 90$ is insane and I can't understand how someone could let themselves be so brainwashed as to think this is justifiable in any way.", "label": 0}
{"text": "Also it was during BfA, the first expac that made me quit. So I am happy to see it return.", "label": 0}
{"text": "It's really sad that 9 hours ago you raged at someone, remembering that this meme exists while writing your rage, and the hate has been living in your head rent free the entire time to the point you're posting this now.\n\nIt's time to sit back and think about why this affects you so much.", "label": 0}
{"text": "Why would I be upset that stupid people exist?", "label": 0}
{"text": "Because changing to static flying is soooo hard.", "label": 0}
{"text": "Did they make you buy it", "label": 0}
{"text": "If you believes it amount to any kind of worth-it profit then boy do I have a bridge to sell you.", "label": 0}
{"text": "I bought 3 brutos. 1 for me and 2 for my sister and her new husband.  I am very much the problem lol", "label": 0}
{"text": "2019? Adventure era ended in Wrath. By the end of Wrath, you could be teleported to dungeons with people you'll never see again. Cata extended that to raids. That era was more extreme faction partisanship that only got rolled back occasionally when the game population declined so much as to not support splitting the audience.", "label": 0}
{"text": "it isn't that deep bro\n\nI just found the pic and posted it here because it fits like a glove for nuwow players", "label": 0}
{"text": "it is, report em", "label": 0}
{"text": "It's an item only available during a small part of the year. After this event is over that item gets deleted from your inventory. \n\nThey most likely didn't want to bother making it compatible with skyriding. Since it's an item and not an actual mount it could be that the code for skyriding doesn't work properly with it and why waste time fixing a time limited for fun item?", "label": 0}
{"text": "I do not agree with this at all. Even if some of you do not mind the bruto it is clear this is upsetting for a significant chunk of the player base. Holding Blizzard accountable for making divisive choices would serve to make the game better for all parties involved.", "label": 0}
{"text": "Honestly, this just re-highlights the problem they introduced when they added the switch flight style button. It was *really nice* in Dragonflight to be able to have a Dynamic flight mount *and* static flight mount both hot keyed and being able to choose which one you wanted at any given time.\n\nThe switch flight style button was a huge L, imo. I would have much rather been able to set which mounts were which flight style.", "label": 0}
{"text": "Damn the peer pressure is almost unbearable.", "label": 0}
{"text": "“Find a divorce lawyer” I’m dead 🤣", "label": 0}
{"text": "Look at all those chickens", "label": 0}
{"text": "Mounts scale to the size of your character, so some races make mounts look bigger than others. Such as a tauren riding one vs a dwarf.", "label": 0}
{"text": "It would be stupid of blizzard NOT to take advantage of these suckers. How can you blame them? They can slap a vendor or mailbox on a piece of dog shit and idiots will line up to buy it.", "label": 0}
{"text": "Fuck yeah! And the repair anvil and transmog bag like in the bear mount.  Also if you could get a small percentage if someone else posts something in the AH via your pet. Also if it could fly.", "label": 0}
{"text": "Item upgrade mount too", "label": 0}
{"text": "The fomo was starting to get to me, so I gave my wife this link. Thank you.", "label": 0}
{"text": "This is how I feel about Valve/Steam and their refusal to make Half-life 3.", "label": 0}
{"text": "Nothing", "label": 0}
{"text": "Make your own groups, thats what ive been doing, they fill quickly once you get like 4-5 people in.", "label": 0}
{"text": "Blasphemy", "label": 0}
{"text": "That just increases the queue times even more", "label": 0}
{"text": "Yeah they are adding a ton of cooldowns for ele this exp, one thing that helped me was create a macro to cast all buffs and help clear space on the action bar, so earth and lightning shield, the thunder shield buff and skyfury I use only one button. I see you have primal strike I believe its called on your bar, you can remove that its just for flavor and you wont use it on the rotation", "label": 0}
{"text": "You're just proving my point even harder by no other MMOs matching up to WoW's greediness and even if they are a smaller player base (also lol, I think FF14 is more than 1/4 of WoW) that they would need to make up more from MTX to stay afloat since they aren't getting guarantee money from subs every month. \n\nEven if other F2P games like genshin etc have higher priced MTX they also don't get that guaranteed money on top of MTX which is the whole point of proving why Blizz is so greedy. You could look at it another way and say their sub model is like a guaranteed microtransaction from every user that plays their game which isn't true for all these other f2p games, majority of their users do not engage in MTX and if they do it's much more rarely.", "label": 0}
{"text": "TRAVESTY!", "label": 0}
{"text": "Microsoft CEO's pay rises 63% to $73m, ~~despite~~ **because of** devastating year for layoffs\n\n  \nFixed it for you.", "label": 0}
{"text": "I’m not that cruel to beat a man already down. Leting them a way out ! (And I actualy can’t know the exact source)", "label": 0}
{"text": "I have no interest in getting AOTC myself, I'm not big on pve progression. But I will say I still think it's dumb that people are paying for an achievement that they can't get themselves. You don't get anything for it so why go through the trouble of buying it to act like you perform well enough to get it? It confuses me more than anything to be honest.", "label": 0}
{"text": "The people buying this stuff are going to end up with the game they deserve.", "label": 0}
{"text": "I was hoping if I got the rating that season on my main I could buy the sets on alts. That’s what the tooltip suggests. But it’s only letting me buy sets I already earned which is pointless", "label": 0}
{"text": "I just had a level 12 Priest be top DPS and Heal in Stratholme timewalking", "label": 0}
{"text": "Gee, you don't believe me. How will I sleep at night?", "label": 0}
{"text": "Pretty happy this didn't happen a few weeks ago or I wouldn't have been able to buy the D4 expansion for gold lol", "label": 0}
{"text": "That'll be another $90 in December.", "label": 0}
{"text": "These should. Make it five hundred bucks. Morons en masse will show up to buy it. \n\nYou know what? Fuck it. Just sell raid gear on the shop. Sure people will get mad, but the whales will be happy and blizzard will make money. This is what it’s all leading to anyways.", "label": 0}
{"text": "2.5% is an insanely liberal estimate. If 20% of /r/wow buys it it wouldn't even crack .5% of the total playerbase.", "label": 0}
{"text": "We mount it during Dawnbreaker mid combat during the first boss to buy jumper cables because the tank just died again.", "label": 0}
{"text": "you wanna blizzard rich my bro", "label": 0}
{"text": " If I was the CEO, I would feel a moral obligation not to accept a bonus after huge layoffs. The optics are terrible. My company had layoffs this year, as so many did, and we canceled all parties and bonuses with the understanding that this saved our coworkers' jobs.", "label": 0}
{"text": "How is being a dwarf mage a convenience? That kind of thing should just be standard.", "label": 0}
{"text": "> Mining nodes phasing out when you arrive at them, even being able to start mining and then getting an error (looking forward to the responses that explain to me this isn't actually a bug lol)\n\nSo what is keeping you from accepting that it isn't a bug?", "label": 0}
{"text": "there's this one too \n\nhttps://files.catbox.moe/uhphvy.png", "label": 0}
{"text": "I'll get it for sure.", "label": 0}
{"text": "Yeah, that's not a healthy relationship. A healthy relationship would give both partners discretionary money they can do what they want with so long as all other financial obligations are met.\n\nThis is just as bad as the trope of women having to hide designer purses from their husbands because they'll get in trouble for it.", "label": 0}
{"text": "All the non-skyriding flying mounts should just be static flight by default.", "label": 0}
{"text": "Nobody owns the company genius. Google \"stock market\"", "label": 0}
{"text": "Don't you get a cat mount for subbing for a year? That's way cooler than an auction house.", "label": 0}
{"text": "Some people are stuck as forever 14 edgelords who constantly seek the attention their parents never gave them.", "label": 0}
{"text": "Not gonna lie the raid is hard havent gotten past the 3rd boss on heroic bad damm are those fights fun its the good kinda hard well done blizz", "label": 0}
{"text": "There are many valid reasons to cancel a sub. This mount is definitely a money grab and doesnt add any actual value to the consumer, which blizzard is often at fault for. This, and any other instance of this in the past, seems like a decent enough reason for the straw to break the metaphorical camel’s back. Plus blizzard itself is a dumpster fire that mistreats its employees. Honestly its hard to justify subbing sometimes myself when i love the game :/", "label": 0}
{"text": "Is there a way to see what needs to be done in the travelers log without having a sub.\n\nWould like to get the depthstalker mount before its gone but first wanna see how possible it is before subbing for it specifically", "label": 0}
{"text": "This is the thing that bugged me about where rogue class design went. It's much more magic flavored than it was originally.", "label": 0}
{"text": "Magic the gathering did a similar thing for their 30 year anniversary, these companies are all the same lmao", "label": 0}
{"text": "20 years of WoW, and I've never gotten that. I tend not to argue with people very much in the game, though. I kind of regret it.", "label": 0}
{"text": "This was also before Activision bought Blizzard", "label": 0}
{"text": "Class action lawsuit incoming!", "label": 0}
{"text": "The game is not a lobby. The game was a lobby in Cata. I was there. We all hung out at Stormwind/Orgrimmar all day long queueing for dungeons and only leaving town at one of a number of designated convenient teleports to beeline for raid portals.\n\nThere were no world quests. The world felt dead after you finished questing it, because the whole world existed for nothing but quests and all endgame was in instances. FFXIV copied this era of WoW, and so it has a nautical themed Storm/Org but is also about standing around in a city all day queueing for dungeons and PVP and even raids.", "label": 0}
{"text": "In order to enter major cities you will now have to pay a monthly fee", "label": 0}
{"text": "OMEGA PI OHHHMEGAAAA!", "label": 0}
{"text": "Just make your own post", "label": 0}
{"text": "It feels counterintuitive to me... if my group fails to time a +12, we need to practice by running another +12 again not by being forced to run an 11 we don't want to be running and *then* run a +12.\n\nNow that we're looking at 300g for a repair, 500g for flasks, 20 minutes to get into a group or fill your own party, and another 20-40 minutes running the dungeon before the key gets bricked, I feel like the punishments for failing to time a run are already more than enough (and all for no reward if the run gets killed because someone drops group and you never complete the dungeon).", "label": 0}
{"text": "Actually I'm not really sure that's true though lol.  Yes raiding can... and I specify can because I've gone entire seasons without a BOE drop, make a good amount of money.  But they also have insanely high repair bills.  When progressing in a raid I can spend as much as 5000 gold on repairs in one night, not to mention the pots that are a few hundred each, the runes, the mana oil, the health pots, etc... But it's mostly the casuals that don't even play the end game pillars that are ballin.  They are perfectly happy to pick daisies and farm rep and do every profession than the raiders or other midcore players and they have the potential to gold cap exceedingly fast.  If you have the patience to just sit and farm ore or herbs for hours, which I do not lol, you can make a ton of money. Heck I was just watching some youtuber doing a 0-gold cap challenge.  I think it took him like 2 or 3 months.  Either way I didn't set out to argue with you but I was surprised to see your statement because from my perspective it feels like even with what I have, people have way more than me and it feels pretty common.  Maybe it's a server difference too who knows.", "label": 0}
{"text": "Two hundred dollars you say? Wow what a steal! That would have cost so much gold!", "label": 0}
{"text": "What about the undercity bat from the darkshore warzone or the bat from BfA wpvp quest currency (were they called incursions?) \n\nBoth of these might be horde only.", "label": 0}
{"text": "See you next patch lol", "label": 0}
{"text": "Should be more imo.  Just one angular import has a code base the size of windows", "label": 0}
{"text": "Thanks for actually answering. I genuinely was curious since I see so much talk about bugs.", "label": 0}
{"text": "It’s an mmo from 2004 living in a world of esports and action games. \n\nA lot of the “mmo friction” has been removed in service of “rewarding” the players. Eventually players may feel that unique class utility is an “outdated and un-fun game feature”. \n\nThey still say they want every class to be uniquely valuable in a Raid, but they’ve changed their minds before. \n\nPersonally I think unique class abilities are what make the game fun. When you try a new class for the first time it should feel like you have super powers.", "label": 0}
{"text": "Considering I didn't think the gold it costs was a lot and you're crying about the price... I think I'll pass on your investment advice. Good luck with your bridge tho little buddy.", "label": 0}
{"text": "Not usable outside Moonkin Form. Does not come *with* Moonkin Form.", "label": 0}
{"text": "They can be a little short sighted.", "label": 0}
{"text": "Warrior tank here. I've levelled 10-24 over four dungeons, and I've been doing more than half of my party's damage every time. \n\nScaling is bad.", "label": 0}
{"text": "Yeah, you’re all horrified at the unfairness of this. And yet, you have a subscription and probably a dinosaur mount.", "label": 0}
{"text": "lol why should 3k be easy? that’s supposed to be hard as heck", "label": 0}
{"text": "So stick with the quest to get a portal back to Orgrimmar and go about the token collecting from there. Got it 👍", "label": 0}
{"text": "The F stands for FUK DIS, FML, I'M OUTTA HERE. Deepest prayers for the guy.", "label": 0}
{"text": "While I understand and respect your decision, the argument FOR buying it is that you will, for the duration of all time you play wow, never have to walk to an AH, or go find a mailbox. When doing crafting orders, you don't have to move between. In 3 xpacs, when herb and mining are at a premium again, you can list your tier 8 herbs (/s, blizz don't fucking do it) and undercut the 8 bots trying to counter the market. \n\nIt is a limited use case right now, but if it ever isn't, it's still yours. That's why I bought one.", "label": 0}
{"text": "Right that's how the markets designed to work. Right now it's the middle of the work day and people are buying tokens and putting them on the market and because more tokens are hitting the market because the price was high the gold price of a token has dropped. As that supply starts to get depleted the price will rise again.", "label": 0}
{"text": "[All I know is my gut says: maybe ](https://tenor.com/zPXe.gif)", "label": 0}
{"text": "The mount costs more than the Game and XPAC itself COMBINED! the state of players integrity is at an all time low. this is the same company that laid off 400 people and these players raged about it just to now throw money at a MOUNT", "label": 0}
{"text": "It's probably KY way too difficult to create a toggle per mount. Probably a mountain if tech debt they'd have to dig through. I'm surprised they were even able to get a toggle.", "label": 0}
{"text": "Pretty sure my husband doesn't even know my character name. Nice try snitch website.", "label": 0}
{"text": "Are you kidding me xD", "label": 0}
{"text": "Miserable, like every night, since you are a guy making crythreads on reddit", "label": 0}
{"text": "As long as they're not acting like it's a flex, makes no difference to me.\n\nI've got some friends who did it because they wanted whatever the AOTC reward mount was and they'd rather buy a token or farm gold than gear up and spend hours (if not days) trying to PUG it out.", "label": 0}
{"text": "🤜 🤛", "label": 0}
{"text": "This is a case of the vocal minority crying out about an in-game item that CLEARLY the majority of people either want, don't care about, or realize that they don't have to buy it if they don't want to. \n\nSimply put, it's $90 because that's what people will pay. If they'd only pay $50, that's what it would cost. If Blizzard thought it would make more money to list at $150, that's what they'd charge. \n\nThis isn't and never has been rocket science. \n\nYour post can be summed up with, \"I want this thing, but I can't justify that amount of money for it and now I'm angry about it.\"\n\nIt's really not that difficult to understand.", "label": 0}
{"text": "Or instead of making the flight type switch a spell, it could’ve been a toggle (or just an off the global cooldown ability) that you could use with a macro.\n\nAt least that way you could choose to summon your mount with one version of flying or the other.", "label": 0}
{"text": "bobby punching the air as we speak", "label": 0}
{"text": "M+ is fundamentally broken as a game mode and is severely outdated. \n\nIt has multiple critical design flaws that will never be addressed due to blizzard’s complete inability to attract skilled designers, not just code monkeys that will (barefoot functionally) script up new patches and move assets around. \n\nThey have very little design talent. They clearly possess enough engineering talent to keep the servers online and the art talent is their strongest dept by far. They just have absolutely fucking dogshit designers, who by all measures of their output, seem to have absolutely no concept of what good design even means or looks like. \n\nThe existence of design as a skill and not a random outcome of uncontrollable processes is a foreign concept to them and it shows ", "label": 0}
{"text": "Who remembers guild mass summon", "label": 0}
{"text": "The explanation people have given me is it has to do with phasing. You're entering a different phase and in that phase the node does not exist. As someone who works for a software company, that is not a valid explanation to write something off as not a bug. \n\nIf I'm using Google Maps, and my destination disappears, but that's caused by an issue with a different Google service that Google Maps interacts with and not Google Maps itself, doesn't make it not a bug. \n\n\"I'm a player and sometimes when I arrive at a mining node, it disappears\" is 100% full-fledged bug.", "label": 0}
{"text": "Ice murloc", "label": 0}
{"text": "“I’m just dehydrated”", "label": 0}
{"text": "Yes 👍", "label": 0}
{"text": "He'll get 50k a year and be grateful for it", "label": 0}
{"text": "[\"Have group will travel\" be like](https://wowpedia.fandom.com/wiki/Have_Group,_Will_Travel)", "label": 0}
{"text": "Your post contains a link to the old Warcraft Wiki and that wiki is out of date. The Warcraft Wiki community is now using [Warcraft Wiki at wiki.gg](https://warcraft.wiki.gg/). Please update your bookmarks or [download the wiki.gg redirect extension](https://wiki.gg/redirect/) to redirect old links.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wow) if you have any questions or concerns.*", "label": 0}
{"text": "Please dont attempt to speak for and project your experience onto others. This is just chalk full of generalizations dripping with your personal bias. Present it as that and not as a matter-of-fact that you did so here.", "label": 0}
{"text": "facts if i want that 90$ mount after working all week im damn well getting it 😂😂😂", "label": 0}
{"text": "I wrote a long reply and deleted it. it’s easier to join the hate bandwagon than to try to make any sense of the shituation.", "label": 0}
{"text": "and then they release a 150 mount with all these effect + it can fly", "label": 0}
{"text": "Because OP was talking about bans, not people being kicked from groups.", "label": 0}
{"text": "Yes, it will sell at 422k. In fact it probably already sold, but the UI hasnt updated properly yet.", "label": 0}
{"text": "If you wipe in the first two pulls of eights, you are not bound for 3k (nor are most people, I should add)", "label": 0}
{"text": "My wife wants to buy one lol I was like alright if you can get good value out of it go ahead", "label": 0}
{"text": "AFAIK you should get what you put it up for. No idea how that works when the price as reduced so much tho.", "label": 0}
{"text": "Living bomb", "label": 0}
{"text": "Which players were giving feedback that the death penalty needed to be harsher? I'd like to have a word with them.", "label": 0}
{"text": "For the nodes could it be a matter of War mode Vs non-Warmode? Aimce they can't see eachother but the same node exist maybe that's it??? I really don't know but they owe me like 50 nodes", "label": 0}
{"text": "I cam back to play for the first time in 13 years I’m not suprised", "label": 0}
{"text": "Thank you heaps.", "label": 0}
{"text": "His logic makes partial sense. Just because *your* bank account didn't go down to buy it, *someone's* somewhere did, it's mandatory that it happened, there's no if, and or buts about it. What they seem to be forgetting is that a large amount of people just simply bought tokens for the og bruto gold requirement too.", "label": 0}
{"text": "yeah but you’re probably not playing LS in high push keys bc you need the throughput from herald", "label": 0}
{"text": "I tried researching the achievement and found info on previous years, but nothing yet for 2024. Seems some of the world bosses only spawn on certain days of the week (Mon, Tues, Weds, etc.) so maybe that's the case again this year. I've yet to find Taerar or Ysondre.", "label": 0}
{"text": "Lol he'll be laid off within a couple years", "label": 0}
{"text": "Thank you heaps.", "label": 0}
{"text": "so nothing bad actually happened to you and no one was upset at all. you were lvl 13. brother you have like 3 buttons at that level. of course you can't keep up lmao, but it sounds like everything went okay? the player base has a bad reputation because it's perpetuated by bad faith posts exactly like this", "label": 0}
{"text": "me with my trading post broom zooming past everyone", "label": 0}
{"text": "I cannot begin to describe how funny a trainwreck that would be", "label": 0}
{"text": "It’s very clear from this that you’ve grown some serious cognitive dissonance between your assumptions and reality.", "label": 0}
{"text": "The illidary doomhawk is a 100% chance or was anyway last time.", "label": 0}
{"text": "Don’t buy that dumb dinosaur!", "label": 0}
{"text": "# WE STILL HAVE ALL YOUR FUCKIN MONEEEEEYYY", "label": 0}
{"text": "Today you learned that the players who bought the mount, may not have been the ones that cared about the layoffs.", "label": 0}
{"text": "> but God forbid i dare to be critical of factual information\n\nYou can criticize without making dumb as hell claims. \n\nI dont know which definition of factual information you use but that statement was straight up insane for anyone who played through classic, tbc, wotlk, cata and wod.", "label": 0}
{"text": "It’s been significantly more bumpy than DF so far", "label": 0}
{"text": "Meanwhile Blizzard pockets 25% of the real money involved in the transaction.", "label": 0}
{"text": "Ohh, yes, I remember those days from when I used to heal...", "label": 0}
{"text": "Literal whole point of reddit is to voice thoughts on topics. Not sure how long it might take you to learn that but here we are :P", "label": 0}
{"text": "It dropped for me on the first kill the other day, so yes!", "label": 0}
{"text": "Well I feel personally attacked.", "label": 0}
{"text": "\"How tf they get so much gold ????\"", "label": 0}
{"text": "It's a joke", "label": 0}
{"text": "I do have a group, the problem doesnt go away at all. We still have to level broken keys", "label": 0}
{"text": "This has been happening a lot the last couple of weeks", "label": 0}
{"text": "I've been playing my mage for some time who is enchanting/ tailoring. I got the node bug in past expansions but haven't gathered in a couple of years. Playing my warrior this expansion, it seems like I'm getting it 1-2 times out of ten nodes. \n\nI just honestly can't believe people would argue that kind of experience not only isn't a big deal, but isn't even a bug.", "label": 0}
{"text": "In this case, \"brain dead\" and \"selfish\" go hand in hand.", "label": 0}
{"text": "I have no doubt they spent very little time on the reskin and that its a cash grab - but its optional so who cares.  You aren't forced to buy it, you dont need it, so why complain about it?  Who cares?\n\nI hope you can sell your 430 euro water bottles.  I wont complain about the price because I know its optional and I dont have to buy them unless I want to.", "label": 0}
{"text": "Why so miserable ?", "label": 0}
{"text": "Do you know how much energy is required to keep Dalaran floating, even when it’s not being used as a base against our enemies? It’s massive. They are huge carbon polluters. No one talks about this. Knife lady did the world a favor.", "label": 0}
{"text": "The Dunning-Krueger effect is hitting folks REAL hard in this new system. \n\nFolks bricking all their keys and still thinking they arent the constant in this equation are a sight to behold.", "label": 0}
{"text": "It's available in Valdraken at the PvP vendors now :)", "label": 0}
{"text": "I thought these were jokes but I think people are actually believing this. A WoW mount, and even all of blizzard combined, is a drop in comparison to cloud services. So no, the mount had nothing to do with it.", "label": 0}
{"text": "It's available at the PvP vendors in Valdraken now :)", "label": 0}
{"text": "Players have complained for a “real” challenge for so long. They shouldn’t have listened to them for the general public", "label": 0}
{"text": "Please use the loot flair, it helps filter them out for those of us that don't want to see them.", "label": 0}
{"text": "I just watched the documentary and did my first ever shop purchase. Money for research is never wasted.", "label": 0}
{"text": "You need a new wife if she won't let you buy this item. Mine told me straight up to buy it after i explained what it is.  I even asked if she understood that it was 90$", "label": 0}
{"text": "48 in the first week\n\n35 from weeklys\n\n13 from the accountwide granted tokens gor the intro quests", "label": 0}
{"text": "Exactly, I’m an adult and can spend my wife’s boyfriend’s money he gives me as an allowance however I want!", "label": 0}
{"text": "weird to assume they were being assholes? it even happened when it was an accident. i'm glad the deserter debuff doesn't matter to you when you grief! thanks for your input and proving my point workertroll, keep bricking runs!!", "label": 0}
{"text": "Yep, it’s 5000 badges", "label": 0}
{"text": "Well at leasy it's not $50 billion like Musk\n\nMeanwhile the majority of us live pay cheque to pay cheque", "label": 0}
{"text": "So is mine.", "label": 0}
{"text": "Alternatively, people in a position to buy a $90 mount on a whim will not spend hours agonising over whether or not to buy this one.\n\nAnd the ones that can't afford the mount may be able to afford this.\n\nIf you're going to be as condescending as you were here, then make your comment worth reading.", "label": 0}
{"text": "Could be a thruple", "label": 0}
{"text": "If I made 75m and got fired a few months later, I would dance my way out of the office. Hell, I would throw my own going away party haha", "label": 0}
{"text": "MOUNT EQUIPMENT. ITS IN THE GAME THEY JUST NEED TO IMPLEMENT IT", "label": 0}
{"text": "Tim Bu Dong.", "label": 0}
{"text": "It’s probably going straight to boosters who will RMT it or vault it as well ", "label": 0}
{"text": "Let’s get a mount with the great vault in it, catalyst, and an upgrade NPC. I would pay for that one also lmao", "label": 0}
{"text": "There’s almost no shot it has paid itself off unless you’ve made an obscene amount of money. I made around 150mil in Shadowlands and 110ish mil in DF profits, and there’s almost no shot my mount has paid itself off. It really doesn’t save that much time vs Pandaria engineer AH/Garrison AH. \n\n5mil is a ton of money to make up when it’s saving you seconds per hour at best average.", "label": 0}
{"text": "Probably have better luck /who warlock and whispering someone", "label": 0}
{"text": "Seeing the comments under this posts just show the sorry state of the entire community.  \nIm really glad i didnt get TWW because shit will just get worse from now on.", "label": 0}
{"text": "Nightborne racial in shambles", "label": 0}
{"text": "Unfortunately companies have figured out that exploiting wales apparently makes more money than anything ever so we get to deal with problems held up by a minority of players.", "label": 0}
{"text": "Allowing gold to be bought for money and allowing gold to buy boosts has rendered this game terminal", "label": 0}
{"text": ">and try to argue that this expansion hasn't been full of issues is ridiculous.\n\nWhich is a completely different statement than the first one you made if you haven't noticed yet.", "label": 0}
{"text": "Nope. I just get what I need to get done then I play for however long I want. It makes me happy and doesn’t hurt anyone so who cares how long I play lol", "label": 0}
{"text": "They dont deny anything in regards to penalities. The blues are constantly telling people its gonna stack the more they get.", "label": 0}
{"text": "I figured out an exploit using the LFG tab where it would save the progress of the dungeon to you, but when you added someone to your group it would reset the boss if you left the dungeon soon enough or something like that, so we could just kill the last boss over and over. I haven’t played wow in maybe 4 years, but sometimes I think about logging in again just to look at all my rare gear and mounts. I heard that you can tmog legendary weapons now? My warrior has every legendary up to WotLK, I would love to use them!", "label": 0}
{"text": "Paladin: bless you good sir. Warrior: ROAAARR MOTHERFUCKER", "label": 0}
{"text": "lol on my rogue, I don’t even stealth anymore. If the tank won’t let me do a proper opening sequence, I’m already screwed on damage anyway. To those that say “JuSt UsE vAnIsH,” just no. I shouldn’t have to use my cooldown that’s for my second/third wave of damage just to open an encounter, so I won’t. Does my dps suck? Yep. But, I squarely blame the impatient tanks. If they do their job right, I’ll do mine right.", "label": 0}
{"text": "7 tokens unless you aren't taxed on digital goods or you paid with a card.", "label": 0}
{"text": "I was referring to the hypothetical guy who only makes 50-100k that decided to add the mount", "label": 0}
{"text": "Just make it the reward for 36 or 60 months of completing the monthly travelers log.", "label": 0}
{"text": "The phrase \"desperately wrong\" doesn't even make sense.", "label": 0}
{"text": "But its relevant again", "label": 0}
{"text": "I did as soon as I could. Don’t care about what the internet thinks about it. Made me happy and that’s why I play WoW.", "label": 0}
{"text": "Already had t2 on my favorite character's and won't be paying 90 bucks for a mount lol my hearthstone gets me to a auction just fine", "label": 0}
{"text": "I'm not lol it's just wild", "label": 0}
{"text": "As a Holy Oracle Priest, that’s the best part - you don’t.", "label": 0}
{"text": "\"Dad, can we go to the movies?\"\n\n\n\n\"sorry kiddo.... pop has to sell ore as soon as he mines it\"", "label": 0}
{"text": "Don't Goblins also have a bank racial?", "label": 0}
{"text": "I did that fight yesterday and no angels spawned. I think they took them out.", "label": 0}
{"text": "So they laid off 3 more people? They don’t have shit for CS anyways 🤣", "label": 0}
{"text": "Just out of curiosity does the store broom have cast time like any other mount or it's instant? 😊 I have no hope, but I'm ready to be pleasantly surprised. 😊", "label": 0}
{"text": "I think they’re on a bit of a bot-banning spree at the moment. I reported some newly created druid bots at the starting spot in Teldrassil a few weeks ago. Got a mail from Blizz today in-game saying my report of “exploiting” led to them taking action and banning acounts.", "label": 0}
{"text": "Fair enough, but I really prefer the look of the Bruto. So being able to vendor items on my Bruto is a big +1 for me.", "label": 0}
{"text": "*Sent from my Gilded Brutosaur*", "label": 0}
{"text": "My wife limits my play time a lot! I just get it in where I can fit it in", "label": 0}
{"text": "It's brooms all the way down", "label": 0}
{"text": "No bro just fly to where the world boss is on your map before you join group, your group and the boss will be there. \n\nDon’t fly to bloodmyst, ask me how I know haha", "label": 0}
{"text": "if we are starting this bullshit AGAIN (reddit as #1 news outlet for shit thats got nothing to do with wow) IM OUT OF HERE", "label": 0}
{"text": "Definitely worth a try", "label": 0}
{"text": "Thats a good point that I havent tought off, and an even better solution. Just like portals, would be nice to unlock something like a custom difficulty at 10+", "label": 0}
{"text": "I mean you're not wrong in saying there's of course always greater context. But at the same time I can't think of a better connection than existing in the same game. Neither of these things exist in isolation. And brushing off serious problems with their QA I think does a disservice to the many problems that do get through. And then seeing greater monitisation while these issues persist is rather a slap in the face. To say nothing of their bad AI customer support. Issue with mass reports. Item deletion. It's a long list. Though no doubt some would still be unhappy even if the rest was perfect. But it isn't so I can't really make the case for that. \n\nI think also it's not a great comparrison. This is something that costs them nothing to reproduce. Having worse ways to spend money isn't really much of an argument. But at least alcohol you consume something that has to be served to you and delivered to location. Likely don't pay membership at whatever pub or any old store you buy from. But you know.\n\nCan understand not wanting to grind but it didn't have to be a grind. There's an almost endless list possibilities. This could have been an incredible gift to the community in response to the frustration being felt quite widely. It's an incredibly desired item. But they went with greed.", "label": 0}
{"text": "Bro, i just checked your comment history, Like there is actually no way you are going around looking up 2 month old comments to try get a gotcha moment on people... do something more important with your life.", "label": 0}
{"text": "Yea, I didn't check old flying because the shop broom worked fine.", "label": 0}
{"text": "I mean, AH & mail on a mount sure as hell speeds up their process for generating gold.", "label": 0}
{"text": "Is your wife Cate Blanchett?", "label": 0}
{"text": "I did it too, as long as it makes you happy !", "label": 0}
{"text": "I've played plenty of F2P over the years, the only issue was pay to win features, but that only affected PvP, and they had stupid expensive mounts, or so I thought as they were $50, but considering it's $90 now that was a bargain.\n\nNo F2P I have played charges you for dungeons or quests.", "label": 0}
{"text": "WeakAuras as an addon is not designed for click functionality so no get plumber as it got suggested already", "label": 0}
{"text": "Thanks for the advice. You are nice 👍", "label": 0}
{"text": "Definitely. If you want it, that's great.\n\nAs a mage with dragonriding, I do anticipate that this mount would save me probably on average 1-2 seconds per play session, which I don't think is worth it for me", "label": 0}
{"text": "Ngl I thought the title said \"Meatmaster\"", "label": 0}
{"text": "His pay rises and people lost their jobs. Should be illegal. His pay should be illegal to begin with. Could have provided more value to shareholders by not taking a 63% raise then laying off all those people.", "label": 0}
{"text": "Wow players deeply struggle with understanding basic economics lmao", "label": 0}
{"text": "WeakAuras as an addon is not designed for click functionality so no get the addon plumber as it got suggested by a bunch of other peeps", "label": 0}
{"text": "I was just called a shit healer for being unable to heal 7 ticks of Skamorak after no one picking up the orbs, doing absolutely joke damage to the boss. I pinged them over and over", "label": 0}
{"text": "Ive found that harder keys are actually easier to a point, specifically 10+s have more people hitting defensives when they need to. Additionally, tanking is still probably the hardest role and the most impactful; I wouldnt be surprised if it was the lowest represented. The better DPS are at hitting their defensives, the more the healer can heal tank or dps, the better the healer is at preparing for high dmg (even reactive only healers) the smoother it is for everyone. Ive got a 2500+ Holy priest and a 2500+ bear druid; I found that far more keys get burnt due to DPS and healers not appropriately handling incoming damage than because the tank dies.", "label": 0}
{"text": "People who don't expect Blizzard to nickle and dime their consumer base is delusional. There's no ethical line Blizzard will not cross.", "label": 0}
{"text": "Rich wife's bfs are the best type of wife's bfs!", "label": 0}
{"text": "The best part of the event mount is being able to mount while moving, which is not possible on the shop broom.", "label": 0}
{"text": "No no no no you can't have fun this mount is bad and you should feel bad. ^^Am ^^I ^^doing ^^this ^^right?", "label": 0}
{"text": "ooooooooooookie dokie pal", "label": 0}
{"text": "Sorry was venting a bit. I really liked your site and the idea made me laugh 😊", "label": 0}
{"text": "I mean my perspective is not that I'm trying to optimize my mining time. It's a lack of polish and one bug among many. If your phone drops 1 out of 10 calls, you wouldn't say \"whatever, I'm not trying to be the worlds best caller.\"\n\nI'm not trying to be rude but if Blizzard created ChatGPT bots to just downplay everything wrong with the game across social media, this is the kind of response I would expect.", "label": 0}
{"text": "Great...", "label": 0}
{"text": "> they only ban the account not the ip or email used to make the account.\n\nThose things are about as easy to change as making a new account.", "label": 0}
{"text": "It was about 1.7 million to purchase 6 tokens", "label": 0}
{"text": "yeah the only difference is they actual fix things now instead of leaving it broken for 4 months", "label": 0}
{"text": "Additionally, disruptions and interrupts are a massive deal. SO many players fail to use cap totem, blinding light, leg sweep, interrupts, etc. and the amount of damage that could actually be stopped from those abilities is far higher than I think a lot of players realize.", "label": 0}
{"text": "Omg I could hear it in their voices singing it hahaha", "label": 0}
{"text": "I was in discord with my guildies and I was like “OMG ITS SO CUTE- holy shit that’s expensive!” And then bam, one of my guildies bought it for me and he said “now you can’t ever tell me you don’t have flasks or food” 😂", "label": 0}
{"text": "What is going on here? I’ve been sleeping on it too much", "label": 0}
{"text": "Personal inn, so you can go rested on the movie", "label": 0}
{"text": "But again, it can still run out :) whereas a mount on the store cannot.", "label": 0}
{"text": "for #1, you can stop XP gains by talking to be behsten in stormwind keep or slahtz in the orgrimmar barracks. that way you'll never outlevel chromie time, so all the zones will remain scaled to your level. this can be done at level 69 or lower and costs 10 gold\n\nas for #2, if old game design styles are a dealbreaker for your friend, you might try just finding a good summary video or two for the story up till WotLK or cata, then start with either cata or MoP\n\ni do think the older parts of the game are worth experiencing at some point, but imo wow's quest and story design first *really* hit its stride in MoP. cataclysm was reasonably close to modern quest design, but imo it often struggles to find its footing for tone and pacing. really varies by zone", "label": 0}
{"text": "Or just change flight styles. It's not that deep.", "label": 0}
{"text": "I watched someone get kicked in a timewalking dungeon for being \"lost af\" without anyone ever even saying a single word in dungeon chat about helping find them. \n\nReally made me re-consider why I was playing the game at that point.", "label": 0}
{"text": "I sadly started this game over 15 years ago, but I don’t have the account anymore to prove it 🥲", "label": 0}
{"text": "Because it takes less than 30 seconds to fly there.", "label": 0}
{"text": "I couldn't get a single token yesterday, just error every time. :(", "label": 0}
{"text": "Jokes on you I had my wife log on and buy tokens for me.", "label": 0}
{"text": "Yep. Transmogging is miles better than it used to be. You can collect any type on one character, even if can't wear it. Demon Hunters/rogues can tmog Illidan glaives after they drop for you and kill him during timewalking. Ton of QoL improvements that help collectors", "label": 0}
{"text": "Because shareholders get some sweet money as well. Fire thousands of people and give the money to the CEO and shareholders and everyone's happy. The costumers are happy too, I just don't know how but they are.", "label": 0}
{"text": "Put it in your cart, pay with however much balance you have, you're prompted to pay for whatever is left the same way you would buy anything else.", "label": 0}
{"text": "They were just trying to sweep this one under the rug.", "label": 0}
{"text": "Summon your mount to defeat the next raid boss.", "label": 0}
{"text": "Or just buy the AH mount and save yourself 10 minutes every time you do this.", "label": 0}
{"text": "Still waiting for you to show me =]", "label": 0}
{"text": "Hey, we EU players have a right to complain. 90% of these promotions never came to us. Ever.", "label": 0}
{"text": "This individual knows how to pun.\n\nWell played.", "label": 0}
{"text": "Must just be some weirdness with Renown, since these are all Renown titles.", "label": 0}
{"text": "Ah yee, principled gamers", "label": 0}
{"text": "Is Arms really that bad?", "label": 0}
{"text": "Got flamed for \"not healing enough\" in a +7 dawnbreaker. Wasn't people dying over sustained fights, the prot warrior would just instadie on pull sometimes. Looked at the buff uptimes. 2 casts of shield block in the whole instance. To me that's somehow worse than not using it at all.", "label": 0}
{"text": "Oh it 100% is meant to get buyed for real money", "label": 0}
{"text": "make this a macro and press it until it says you can buy, then pray the purchase goes through. If it didn't the money will be in your mailbox. Don't bother clicking the error message.\n\n/script C_WowTokenPublic.BuyToken()\n\nrepeat until you have 6", "label": 0}
{"text": "Disagree, lots of people missed leveling with friends and guildies because of the premium cost weekend paywall. It's not about bring behind now it's about missing out playing with friends", "label": 0}
{"text": "I literally bought it after seeing this because it's hilarious.", "label": 0}
{"text": "Delusion at its finest", "label": 0}
{"text": "Pretty sure they can’t do that actually. That’s like when you are asked to donate at a grocery store - you can only get a tax break by donating your money, not someone else’s.", "label": 0}
{"text": "Imo. This has been happening for years. And people never gave a fuck.\n\n I still remember totalbiscuits' video on the celestial steed coming out. Outside of a small minority we didn't care enough then because it was cosmetics. But then the wow token got added. And we didn't fight back then? The whole game was gone. You either are okay with real money making this game pay to win, selling the integrity of the game to blizzard. Or you arnt. \n\nThis is not a 90 dollar mount. This is a 90 dollar OR a 3 mil gold mount. And 3 million gold is extremely reasonable for this. If you want to earn it in game. You can. The only issue is the impact on token economy (which like.... who cares because fuck the \"token economy\" its pay to win bullshit too. For reference im a player who benefits massively by the token existing as I havnt payed for the game in years (boosting for gold). And im still against it. \n\nTldr. If you blame the brutosaur and not the wow token, that's part of the issue. Pandora's box was opened forever ago. And no one cared when the old brutosaur was in the game but you could token your way to it for even more money lol. Blaming the bruto and not the token is the issue.", "label": 0}
{"text": "Here, [this](https://us.shop.battle.net/en-us/product/world-of-warcraft-traders-gilded-brutosaur?p=1850779) will help make you feel better", "label": 0}
{"text": "As someone who did MRT in the past, yes, gold in WoW is definitely money", "label": 0}
{"text": "Look at his history. He’s been posting almost nonstop for 24h about this point. Didn’t even sleep. The guy is fucking seething that other people are spending their money on a way he doesn’t like, lol.", "label": 0}
{"text": "Honestly this is so satisfying", "label": 0}
{"text": "Somehow this reads like very typical mundane wow thing for some reason.", "label": 0}
{"text": "This. Hard to imagine how petty one has to be to give even a passing crap about such a non-issue.", "label": 0}
{"text": "Despite what you might think after reading the many \"got kicked for no reason!\" posts on here (it's happened to me too, once, in about 15 years of playing on and off), I'd be willing to be the vast majority of kicks from a group are for a legitimate reason. I've initiated and consented to many vote kicks for a toxic player, an intentionally AFKing player (as in just isn't participating for the spite of it, not genuinely called away for a moment), etc., and I'm quite glad they got a 30 minute time out.", "label": 0}
{"text": "The commenter is literally the posted meme. It’s hilarious.", "label": 0}
{"text": "It’s subjective, ret is brain dead when compared to something like arcane mage. OP was asking for a simple spec to play rotationally and Ret has like 5 buttons right now? Definitely on the easier side", "label": 0}
{"text": "Except the fossil ones lol", "label": 0}
{"text": "Give it a couple of years and $200.", "label": 0}
{"text": "I lost 10% damage mythic broodtwister prog due a bug with fury they fixed Thursday. Blood dk's were getting insta disconnected with bone storm. Almost every class had talents not working whatsoever, or previously applied fixes just missing. And that's just the class-based issues...\n\nWhere do you get off saying majority of players are experiencing no significant issues?", "label": 0}
{"text": "Theres non engineering ones?", "label": 0}
{"text": "Do you know what the original costed?  Do you belive people didn't buy it with tokens?", "label": 0}
{"text": "All this just for me to tell you that you can switch to steady flight", "label": 0}
{"text": "Man I wish I knew that sooner. You know how long I've been trying to get this lol", "label": 0}
{"text": "It’s obviously greater pyroblast…", "label": 0}
{"text": "The store mount is Instacast for the duration of Hallow's End.", "label": 0}
{"text": "Great addition I'll be buying it! Would be cool to add a mount for summons or other quality of life things. Maybe bring back some of the older mounts that aren't really obtainable. I think something like this and the monthly trading post have been great additions to the game. FYI for anybody asking I do have a lot of what you guys would consider \"premium mounts\" including the OG Brutosaur. I think its great that some of my friends can buy this now too and honestly gatekeeping some of that older stuff just to try and flex it is wild to me. I cant tell you how many TCG mounts I have that I just didnt even use cause some of the newer ones were cooler in my opinion. I'm all for stuff like this!", "label": 0}
{"text": "You have to get out of the range of the area around the boss, going to the outer ring.", "label": 0}
{"text": "What is the dawn of the infinites?", "label": 0}
{"text": "Mistakes were made.", "label": 0}
{"text": "Just tape a warlock to the side", "label": 0}
{"text": "It's instant only during the Holiday. Still cant cast it while moving tho.", "label": 0}
{"text": "[from WOWHead page](https://imgur.com/Ujq6Mj3)", "label": 0}
{"text": "well, if you are in a party, you are not always 30 seconds from there, but i get what you are saying", "label": 0}
{"text": "Unless it turns invisible at super low graphical settings, you should be able to see a large dark transparent ring appear around Bloodbound when the cast begins. \n\nAll you need to do it get out of the range of it, which is the out beyond the last of the Black Blood (water).", "label": 0}
{"text": "Someone else spent money for you to buy those tokens. 🙂", "label": 0}
{"text": "Play Archon - It's the better hero tree anyways :p", "label": 0}
{"text": "All The Things", "label": 0}
{"text": "I feel you bro lmao.  \n  \nThe only meaningful thing I can think of (and actually a very valid one) are keys being an artificial way to make seasons lasting longer and spreading the feeling of progression across many weeks/months. I can see this + crest caps + loot rng filling that role and making the player feel like he can keep going. I just think its frustrating and i wonder if there's a better way to do it", "label": 0}
{"text": "this is bc they want you to purchase the new broom mount on the store", "label": 0}
{"text": "Extremely sad… Unfortunately, there is never an end to some people’s greed.", "label": 0}
{"text": "Yep. There is nothing like saving a dying team member with Lay on Hands at the last second. Ret is relatively easy to pick up and nice to play, but it feels even better when you actually use all your abilities and benefit your group greatly :)", "label": 0}
{"text": "Man. It's almost like Activision is a complete bag of dicks.", "label": 0}
{"text": "If the 75m is something publicly displayed, you can bet he has 10-20-XXX times that in many other forms.\n\n\nI remember numbers showing how multiple french ceos from big companies somehow had a very similar \"salary\", set around 500k. Of course.", "label": 0}
{"text": "i'm not even sure why the hate. don't buy it if you don't like the idea. let people spend their money how they want. a lot of people are just buying it with ingame gold anyway.", "label": 0}
{"text": "I was kicked on the last (!) boss (tank) for no reasons. The chat was silent ...", "label": 0}
{"text": "Had a port paladin do the same in a mists 9. Ran in grouped first room 3 sets died left. His key too, all dps did 2-3m before he popped. Coulda timed if he had either pulled less or cool downed more. Was a fun 30 seconds", "label": 0}
{"text": "Nope, I don't hoard and thus my bags were pretty much empty. I have \\~3 gear sets in my main's inventory, raid consumes etc. and still plenty space to spare.", "label": 0}
{"text": "Best answer. literally no reason to.", "label": 0}
{"text": "I want them to bring the Atiesh questline back…I want the staff 🤣", "label": 0}
{"text": "Head's up, if you do the daily quests enough times you'll be able to have that theme year round. I also believe other people can visit your garrison to tame the pets, if they need them.", "label": 0}
{"text": "This is what makes me so frustrated. I cannot count how many times I've had some groups with friends that all logged in hyped to play the game, then some silly shit happens, we learn what we did wrong but now we cant even see how doing the right thing looks like, and now we are looking into all that work ahead of us and just thinking like... \"yeahh... I dont wanna do that, lets call it, good night y'all\"", "label": 0}
{"text": "There is a button in your spell book that opens a bank connected to all you characters and you can craft without taking said items out.", "label": 0}
{"text": "Worse. They'll actively defend it. \n\nLate stage capitalism is nuts.", "label": 0}
{"text": "HODL! (I bought 5 at peak)", "label": 0}
{"text": "Oh he's definitely heard of World of Warcraft. \n\nI'm 100% before he approved the CFO to give Phil 80 billion dollars to buy Activision that the best and worst monetary return potential of this purchase was laid out for him. He may not know shit about how to play the game but he knows the sub numbers, the regions, the retention, and that Warcraft is a significant source of Activision's value.", "label": 0}
{"text": "Is there still a way to get flightstones? I see complaints that people can’t get them now and it’s putting me off trying to get this.", "label": 0}
{"text": "I don't really mind being nickel and dimed, esp because it's all optional to the game. I've bought a pet or mount here and there. But a $90 mount? No thanks. I might if playing the AH was central to my gaming I suppose. But $90 for a mount is not nickel and dime stuff.", "label": 0}
{"text": "Thralls moving castle?", "label": 0}
{"text": "That's...just not what that means? It doesn't necessarily suggest that there are no other possibilities, just that something is a relatively poor choice by comparing it to an extreme alternative, i.e., having literally nothing.", "label": 0}
{"text": "Yeah well that's another reason to leave this game. This \"community\" is so bad most of the time, you can't even bring topics other than memes. They don't even want to try and see a little bit further than their own nose.", "label": 0}
{"text": "Not exactly true. You can sometimes loot a small letter on the floor close to the mailboxes in Legion's Dalaran. It starts the postman quest that gives that toy AND gives an extra letter that can be shared to start the quest on another character.", "label": 0}
{"text": "Well, I bought this, and I have to say, even tough the little foxy itself isn´t (at least I think, maybe somebody will prove me wrong) great for pet battles, it IS definitely cute and adorable. And the backpack is simply amazing, with little Reven snoring there contendly. Altough it looks a little funny on my menacing Unholy DK or Forsaken Warlock, but hey, who´s to say those characters don´t have soft spot for foxes, right?\n\nGiven that all the profits go to charity, I had no problems with buying this. This is my second charity pet, the other being Sunny.", "label": 0}
{"text": "I think ceos need a raise.", "label": 0}
{"text": "We make on average the same number of dollars as you, just with the letters CAD after them. This is why people always point to this.", "label": 0}
{"text": "You say, \"of course\".   Why? 😀", "label": 0}
{"text": "or just... don't buy the brutosaur?", "label": 0}
{"text": "The charity item came out today because the documentary came out today. You don’t have to get so angry over this. I highly doubt anyone who is dropping 90 for a mount is less likely to spend 20 for charity. If they have the money to just be like hey yeah sure mount, they have another 20 for this. It comes down to whether or not they want the pet and backpack,  not if they have the money cause I’d bet a vast majority of people don’t help out with charities often unless incentivized.", "label": 0}
{"text": "WHY IS THIS RAID FUCKING MATCHMAKING GROUPS\n\nTHAT SYSTEM IS SO FUCKING BAD FOR ACTUAL CONTENT", "label": 0}
{"text": "It's $120 CAD :(", "label": 0}
{"text": "The other commenters weren't helpful. This happens when you are phased into a different zone.  You can look for the NPC's that change the timeline or sometimes being on specific quests (heritage armors were a specific one I ran into) will cause you to be phased differently.", "label": 0}
{"text": "It's not a bug that nodes disappear. They aren't \"phasing out\" they are despawning. After somebody mines them, they stand for about 30 seconds and then despawn, so if you get to them when that happens, it's just bad luck.\n\nIt's the same reason treasure's disappear off the map after somebody opens them (Like arathi chests), watch next time, the box won't dissapear immediately after somebody opens it, but the icon will.", "label": 0}
{"text": "Past year maybe. But they had those late 2022, early 2023 layoffs with Amazon/Meta/Google because they all over hired thinking the COVID internet economy was gonna continue", "label": 0}
{"text": "ofc blizzards will have subs and tons of cash, look how many ppl buy assasins, cods, fifa. They will never extinct", "label": 0}
{"text": "Blizz makes $120 regardless of how the bnet balance is spent. The tokens are only available because someone already paid blizzard real money", "label": 0}
{"text": "Part of me is against any $90 mount. But snagging some cash off these scumbags is cool with me", "label": 0}
{"text": "We had this, it was called ‘Have Group, Will Travel’ and they stole it from us because warlocks", "label": 0}
{"text": "If this is true that’s epic and I love it", "label": 0}
{"text": "What percentage of the increase in value to the company should he be paid? What is fair here?", "label": 0}
{"text": "I’m glad to see m$ changing the culture of blizzard. Thank god for the merger", "label": 0}
{"text": "Can you explain what you wanna get rid of? \nThe option window? \nNormally you should be able to cancel it with a left click on the ground or sth", "label": 0}
{"text": "free > paying $130 for a mount", "label": 0}
{"text": "Not necessarily, sometimes people still code things as 32 bit integers", "label": 0}
{"text": "Just need a murlock playable race now", "label": 0}
{"text": "These two statements in the same post are comical.\n\n> This enterprise WILL make moves to improves its profit.\n> Better selling a mount than making paywalls or pay-to-wins.\n\nPeople buying $90 mounts will not stop Blizzard from doing any of those other things a \"move to improve profit\". Buying one only sends the message that they can sell more super expensive mounts and people will buy them. \n\nAt the end of the day, I don't care what people spend their money on. If they can afford it and it makes them happy, cool. But people who do buy them are just encouraging Blizzard to sell more of the same kind of thing", "label": 0}
{"text": "When did they drop it to 15? They had a 10-25 split and it was very much not a disaster.", "label": 0}
{"text": "First of the day always gets rewards", "label": 0}
{"text": "Expansion so boring looking i didn't even pick it up and let my sub run out before release 🙏", "label": 0}
{"text": "Can we talk about the ragged golem transmog? Thats a ripoff", "label": 0}
{"text": "Also, no. Most of the staff do not see the money from the microtransaction profit. The majority of Blizzard staff are paid around 50% less than the same jobs at other companies in Irvine, and a lot opt to rent small apartments with 4-5 roommates.", "label": 0}
{"text": "Shouldve been clearer sorry. What i wanna get rid of is my whole character display. Why is it even there? Shouldnt that be up on the top left corner", "label": 0}
{"text": "Hi /u/8Yaron8, thanks for your art submission!\n\nPlease make sure you've included the artist's name in the title of your post if you are not the OC, or your post may be removed. If you would like, you can also make a top-level comment or reply to this sticky with further details regarding where to find the artist; for example, their social media links or Etsy shop.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wow) if you have any questions or concerns.*", "label": 0}
{"text": "Just use flying form like everyone else does.", "label": 0}
{"text": "The last few days of the month usually have bonus objectives to help people finish the log.  You should be able to earn it pretty easily if you resub.", "label": 0}
{"text": "Leveling alts to use as concentration crafters.", "label": 0}
{"text": "> What they seem to be forgetting is that a large amount of people just simply bought tokens for the og bruto gold requirement too.\n\ncitation needed.  Highly doubt any appreciable percentage of people who bought the mount did so with tokens.", "label": 0}
{"text": "I was waiting for this one especially to pop up 🤣", "label": 0}
{"text": "[Warcraft Wiki](https://warcraft.wiki.gg/wiki/Traveler%27s_Log) updates them every month\n\nWowhead also did, but I can't seem to find recent ones", "label": 0}
{"text": "Ah had no idea, really puts a damper on cracking a joke about blizzard and the store mount. To be fair, the causes where they do a sale like this have often been good causes.", "label": 0}
{"text": "Do you want to know the actual issue or do you want to bury your head in the sand?", "label": 0}
{"text": "Sounds like Tencent at work!", "label": 0}
{"text": "People don't understand that this is how capitalism works now. LONG gone are the days where the company is even remotely interested in giving the customers a quality product. \n\nManagers and directors will literally GET SUED by shareholders if they do something for the customers instead of for profit.", "label": 0}
{"text": "Im pretty sure blizzard is just testing out the limits of how much they can rip off their playerbase.  \nAnd the playerbase showed there is still plenty to rip off.  \nSo yeah it will get worse, either a second sup for some benefits or real P2W stuff, nothing is off the table after they made SO much money with this recolor.", "label": 0}
{"text": "A toy that functioned as a summoning stone that you could use one per day or even per week would be awesome", "label": 0}
{"text": ">Wait, so... Blizz had a list of botters and hackers.\n\n**Yes absolutely.**  It's long been publicly disclosed policy that they have a list of botters and hackers that they build up over time, and then ban in waves after the list reaches a certain size.  They do this for a number of reasons but the main one is it makes it far more difficult for cheaters to identify exactly how they got caught.", "label": 0}
{"text": "Oh dang, glad to hear it, and that they get to stay!", "label": 0}
{"text": "Yep. I follow Microsoft very closely and work with many of their top IR / threat intelligent talent. People absolutely love Satya, and the leadership for most of their divisions is incredible.", "label": 0}
{"text": "I bought it only because of all of you who may need it at some point. Wink wink.", "label": 0}
{"text": "press windows key, type \"snip\", use snip tool, save picture.", "label": 0}
{"text": "The 'shop broom' is instant cast with no channel time during the event.", "label": 0}
{"text": "Hi. This is a wife. Is this real?", "label": 0}
{"text": "So the portrait of my character i guess you could call it", "label": 0}
{"text": "Nope, Eve's Ghastly Rider is instant cast during the Hallows End event.", "label": 0}
{"text": "I truly hate these people.", "label": 0}
{"text": "Still doesn't mean everyone used cash. I used gold to buy  the mount and don't see any money withdrawn from my bank account?", "label": 0}
{"text": "Ah right, let’s not forget the bug let loose that literally impacted the global economy….like let’s tone down the hyperbole here when you are parroting, sounds more legit.", "label": 0}
{"text": "Oh yes sorry, m+ bad no invite ever! Buuh", "label": 0}
{"text": "If they really gave a shit, they could have made the £60 dino mount the charity one. At least people would feel better about buying it knowing some of the money is going to a good cause.", "label": 0}
{"text": "No way. That's crazy.", "label": 0}
{"text": "Why would they bother when people are throwing more money than they sell an entire expansion for for a single reskinned mount?", "label": 0}
{"text": "Summonable Trebuchet to launch it.", "label": 0}
{"text": "I'd probably just quit anyway and live a happy life lol", "label": 0}
{"text": "And its cheaper gold wise too.", "label": 0}
{"text": "I definitely did, as fast as I could. \n\nI should add that I have not been trying to snipe it every night at 2330, but at least 3-4 times a week, with the occasional few months off due to summer or other things.", "label": 0}
{"text": "Windows key + Shift + S", "label": 0}
{"text": "Stay poor", "label": 0}
{"text": "Thank goodness for change. Hate repetition.", "label": 0}
{"text": "I too, am making the best of a terrible situation.", "label": 0}
{"text": "But this one doesn't have an auc and mail..", "label": 0}
{"text": "What a joyous day but anyway...", "label": 0}
{"text": "I'm a warlock and I don't understand this picture at all.", "label": 0}
{"text": "Private servers dweeb.", "label": 0}
{"text": "Yes, also Archavon drops the Mammoth too", "label": 0}
{"text": "There's nothing wrong with your decision but you still have reason to be laughed at for buying a 100% fortnite skin", "label": 0}
{"text": "that's literally the first thing I'm talking about, and toys are account wide bro", "label": 0}
{"text": "Got mine for 1.2mil and tokens are now 350k last time I checked so a pretty sizeable amount of people are buying it with gold. Tokens went from 197k to 350k in less than a day.", "label": 0}
{"text": "Everyone keeps forgetting Elon got a 46 BILLION dollar pay package at Tesla approved…. \n\nThis is the fucked up world we live in.", "label": 0}
{"text": "I assume that it is a sort insurance fund:\n\nIf tokens are put in at a lower price, lets say 100k and the price is now 150k, the 50k they go into the insurance fund.\n\nThen when someone puts a token up for sale at 150k and the price drops down to 125k in the meanwhile, you can pay the difference through the fund.\n\nThis is one way to do it, without creating gold out of thin air, or feeling cheated because you pay the token at 300k even though the price dropped down to 200k", "label": 0}
{"text": "Bellular whores for clicks, nobody is surprised.", "label": 0}
{"text": "I guess I can see it being used when crafting if you don't want to move back and forth the short run to the AH, yeah. Fair enough.", "label": 0}
{"text": "Sorry if we are talking mount crime - why the ever loving shit is the only flying-but-not-sky-riding mount in the game the one you get for 500 mounts? I worked my ass off for that mount and it is almost entirely irrelevant and - as far as I can tell - it’s the only ‘Steady Flying Only’ flying mount in the entire game. Seemingly because they couldn’t be arsed to rig a skyriding skeleton and animations for it.", "label": 0}
{"text": "You can't move and mount with the shop broom, but you can with the event broom. They are both instant cast.", "label": 0}
{"text": "You can't move and mount with the shop broom, but you can with the event broom. They are both instant cast.", "label": 0}
{"text": "You can't move and mount with the shop broom, but you can with the event broom. They are both instant cast.", "label": 0}
{"text": "Convenience = pay2win. It's convenient to have a level boost. It's convenient to have a gear boost. It's convenient to save 30-60 seconds at a time a few hundred times per month.\n\nIf this was available via only in-game means, I wouldn't say pay2win, but this is a specifically costed item for real world money.\n\nPay. To. Win.", "label": 0}
{"text": "Sure, we have to swim in shallow water in M+ dungeons, but at least we can go through pipes!", "label": 0}
{"text": "Did you change your UI mode to modern under Edit Mode?", "label": 0}
{"text": "YOU DONT WANT NONE OF THIS SHIT", "label": 0}
{"text": "> Blizzard *did* disclose the mechanism that operates the token\n\nHow many tokkens are in circulation?", "label": 0}
{"text": "The warlock union would not let this stand", "label": 0}
{"text": "Every tank in every dungeon. Even when leveling,\n if I have dmf buff and that mf starts pulling 80 mobs I just run out, they inevitably die within 10 seconds along with the rest of the party and I zone back in. Usually they settle down but if they do it again I'll dip.\n\nI understand grabbing a big pack and testing your limits right away but for some reason tanks don't even try to put out threat when gathering anymore. Mobs peel off or start casting while they are still running around gathering and its a total shit show and like I said its damn near every tank these days.", "label": 0}
{"text": "That's when I post their logs.", "label": 0}
{"text": "Rather sexist to assume there aren't a bunch of wives buying this stupid mount too.", "label": 0}
{"text": "“But babe it was on sale”", "label": 0}
{"text": "Its annoying how unusable this sub becomes when the \"fans\" get their next thing to be mad at Blizzard over.", "label": 0}
{"text": "TW regio peaked at 560, so it's definitely possible", "label": 0}
{"text": "does that mean we have a short window to take him out and have a chance to mount him?", "label": 0}
{"text": "Most of us are just /laughing, not seething.", "label": 0}
{"text": "Not exactly prot warrior but my maghar stole some mage stuff cloak and magic hat and now bash everyone with the stick, peak fantasy", "label": 0}
{"text": "No, sandboxing is what makes it challenging.", "label": 0}
{"text": "I quit years ago when dungeons felt like special ed class “everyone is a winner!” Once they made everyone get a beat in slot item or whatever it sucked all the joy out of the game for me. Aside from max level raids it really is just a stupid collection game", "label": 0}
{"text": "Mine didn't lie, he said he'd certainly buy it. Which is fine with me. It means I won't have to 😅", "label": 0}
{"text": "Wasn't aware they're personal, so that's definitely good to know. I only heard it's recommended to activate them if you want to have the best chance to get the \"good stuff\" from the bag.", "label": 0}
{"text": "Dear lord I thought maybe about trading in some gold for some tokens for it but hell naw", "label": 0}
{"text": "> If I'm using Google Maps, and my destination disappears while I'm driving to it, but that's caused by an issue with a different Google service that Google Maps interacts with and not Google Maps itself, doesn't make it not a bug.\n\n\nYou're using an example of a fixed location in physical space vs a video game with layered instances running on top of each other lol \n\n\nLike when you can start renting space in different realities I'll accept this as a viable counter point.", "label": 0}
{"text": "Shu-halo is the same.", "label": 0}
{"text": "It is , it’s pretty much a lvl every dungeon, skip the quests and side bosses, complete the dungeon asap, full lvl", "label": 0}
{"text": "Same size too, mount up and Aggro the entire zone", "label": 0}
{"text": "Oh are we 9 weeks into the expansion again?", "label": 0}
{"text": "Jeez. All I got was a rock.", "label": 0}
{"text": "That is one strange-looking warlock.", "label": 0}
{"text": "Can’t wait to see how this world soul saga pans out", "label": 0}
{"text": "We have $90 mounts because people are willing to pay $90 for a large digital dinosaur in their online videogame.", "label": 0}
{"text": "I think it implies our husbands will buy us Bruto. It still says mine hasn't yet, but Christmas is only two months away! 😆", "label": 0}
{"text": "new bruto is absolutely an upgrade (mail) and is absolutely cheaper (\\~4 WoW tokens?) than the original. Banker alt headed for the nearest mountain top.", "label": 0}
{"text": "Lmao I always have my boat/raft toys in my action bars for this reason. Oh no, a puddle! Time to set sail", "label": 0}
{"text": "??? This post has literally nothing critical about Blizzard. All of the issues are specific to Activision's C-suite executives.\n\nBlizzard executives have a long history **against** these microtransactions.", "label": 0}
{"text": "No i don't think so. I Just want it to be on the top left corner but ive tried and searched on Google but found nothing yet.", "label": 0}
{"text": "That only works with actual statements. Making random shit up is not the same thing.", "label": 0}
{"text": "His podcast/livestream is pretty good, though Matt does a lot to elevate the quality of the discussion.", "label": 0}
{"text": "Holy freakin shit that’s genius", "label": 0}
{"text": "If there are no extra taxes or fees then you only need six tokens.  If you only bought six tokens and were assessed taxes or fees, then you need to pay the remaining balance with a card. \n\nIf you paid with a card, then you don't need any tokens, let alone 7.", "label": 0}
{"text": "Much prefer that style. Smooth is fast, test your limits but be smart about it. Sometimes theres just too many spell casts and not enough interrupts, 1 fear or silence on the healer when theres 30 mobs on the tank is all it takes to wipe.", "label": 0}
{"text": "half of the layoffs were expected from blizzard due to acquisition", "label": 0}
{"text": "The option edit is grey for me and can't be selected", "label": 0}
{"text": "It’s not", "label": 0}
{"text": "That mount's name? Stony Pony", "label": 0}
{"text": "Guilty too...", "label": 0}
{"text": "Yeah. This should be top comment imo. If $90 is the type of money you need to discuss spending. Then you ked to discuss spending it. Isipisi. If you gotta start some Magnum PI Shit over any amount of money, you're in an unhealthy relationship. Whether it's you, or them, or the both of you.\nDo something about it, or be a part of the problem. Sorry if that sounds harsh bit it is what it is.", "label": 0}
{"text": "both are in your pocket all the time and summonable with no cooldown as long as you're outside, on every alt. Methinks the gamer doth protest too much.", "label": 0}
{"text": "There was a point where blizz was trying to recruit QA from top us raiding guilds, including mine. I talked to one guy who ended up taking the job, this was back late wod early legion time frame. \n\nHe was paid 14.50/hr, and he said there were boards up where people would coordinate living together upwards of 6-8 people to be able to afford working that job.\n\nStill kinda sad I missed the opportunity if nothing but for the experience of working there... though that likely woulda been awful, but not like I enjoy my current job anyway.", "label": 0}
{"text": "Same i was able to buy a few this morning when it peaked and felt pretty good about myself.", "label": 0}
{"text": "The game became too complicated, too many things you have to learn, affixes change every week, so many different routes. I mean, as a game is phenomenal, but it just takes too much time if you really want to play at a high level, it is insane. And if you play the game casually, lets be honest, the casual part of WoW is just really bad, no exploration, heroic dungeons are mind numbingly boring, leveling sucks. It just is a really bad game from a casual perspective, much better to play a single player RPG.", "label": 0}
{"text": "Meerah's interaction with Katie & the undead mage whose name I always forget while you help them escape always makes me giggle.", "label": 0}
{"text": "What am I protesting about?", "label": 0}
{"text": "Go back to where depleting the key gives a “depleted” item version of the same level that gives *no loot* but still grants score when completed.\n\nThen allow players to turn their depleted key into a regular key *one level lower* by talking to that panda lady.  \n\nBest of both worlds.  It allows push/learning groups to repeatedly practice specific dungeons (without loot which they don’t care about anyway) while leaving the gameplay for the average player effectively unchanged.", "label": 0}
{"text": "Please send your children to a good school so they have a chance.", "label": 0}
{"text": "Voting with your wallet never works because whales have bigger pocketbooks. Money isn't democracy, it's an oligarchy.", "label": 0}
{"text": "still happening", "label": 0}
{"text": "Tauren sneak is peak.   TAUREN ROGUE WHEN???", "label": 0}
{"text": "Bitching about spending 90$, while u usually get payed for 150-200$ per day. Imagine if you were payed 40$ like so many countries in the \"west\" do.\n\nThe irony!", "label": 0}
{"text": "We don't talk about Bruto!!", "label": 0}
{"text": "I mean look at the stock in the ballmer years vs his tenure", "label": 0}
{"text": "Hate to tell you but this is a popular spell in parts of the world...", "label": 0}
{"text": "Why only husband? My wife nearly bought one today...", "label": 0}
{"text": "Why on earth would you invite a bot to your group? I mean come on kkrtssj", "label": 0}
{"text": "You can buy this with WoW tokens??? Please explain", "label": 0}
{"text": "Pocket ‘Lock", "label": 0}
{"text": "this changes everything !", "label": 0}
{"text": "https://us.battle.net/support/en/article/49217#:\\~:text=Mining%20and%20herbalism%20nodes%20may,report%20it%20as%20a%20bug.", "label": 0}
{"text": "It's on Netflix.", "label": 0}
{"text": "I mean, I do care? But WoW is unique in that you can convert gold into blizzbucks, so for me it was \"free.\" \n\nI think it's a terrible trend for the industry, but struggling against it for years was pointless. It's a lost battle at this point.", "label": 0}
{"text": "If it's not capitalism, then you're wrong.", "label": 0}
{"text": "Feed your boy beans and crop dust the peasants.", "label": 0}
{"text": "Take my upvote and leave, sir", "label": 0}
{"text": "I want a golden retriever mount that extradimensionally chases down the groups lazy Warlock and drags them to the instance.", "label": 0}
{"text": "I don't know man, I don't get the issue. It's just a mount-... if someone wants to spend 90 bucks on their hobby, let them.", "label": 0}
{"text": "15 years the shop has been out and yet people like you claim that every time the release a mount.", "label": 0}
{"text": "What's terrible?", "label": 0}
{"text": "What sick bastard made this? OP if it was you, shame on you.", "label": 0}
{"text": "I don't consider gold to be the same as cash, personally.", "label": 0}
{"text": "My first raid of dragonflight I got one of those alchemist librams to make the cauldron I think? and sold it for 1.5m since it was early in the xpac. It’s all been downhill since then.", "label": 0}
{"text": "Why do people buy glamours? I crafted a bunch for first craft and put them on the AH, and people actually bought them for close to crafting price, which was a huge surprise. Why? Is looking like another race for a few minutes really worth buying a consumable? Or is there some other use for them that I'm not aware of?", "label": 0}
{"text": "The nightborne racial also summons a mailbox. It's not great.", "label": 0}
{"text": "It’s been funny seeing people post in trade chat that the shiny long boi is tied only to one character. Watching people panic log.", "label": 0}
{"text": "Argh. I don't dislike him, but I abhor any clickbait titles.", "label": 0}
{"text": "Ohhhh no. You're not baiting a dinosaur joke out of me. I refuse to live under your tyrannosaury.", "label": 0}
{"text": "Or just buy it for 1/3 of the gold the original Dino cost back in BfA.", "label": 0}
{"text": "I agree with you that it sucks, because the spectral otter was my permanent go-to mount as soon as it was added to the game. But if I had to guess, they purposely chose to exclude it from sky riding because it also has a swim speed boost. If it had the swim speed bonus, sky riding, and regular flying, it would absolutely be the most OP mount (excluding vendor mounts) in the game.\n\nNot saying I agree with their choice, because I wanted to sky ride with my spectral otter so bad, but that is likely why they made the decision.", "label": 0}
{"text": "At this point? This battle was lost with the Celestial Horse. This battle was history by the time Diablo Immortals came out.", "label": 0}
{"text": "Yeah, I mean you really dont NEED the mount tbh. I dont have it, but between the transmog toy and reeves… covers most of the needs lol", "label": 0}
{"text": "They wound up providing much of the better parts of Destiny, after Bungie left things got worse.\n\nHonestly I read the OP and I remember this is a Chief Financial Officer. Completely ignoring the artistic merit and focusing on dollars and cents is what they're supposed to do.", "label": 0}
{"text": "It's Bellular. The Mr. I am done with wow I will focus on other shit, oh shit nobody watches me now better crawl back tow wow.", "label": 0}
{"text": "But it doesn’t have an AH!", "label": 0}
{"text": "Yep! But I didn't. :D", "label": 0}
{"text": "Maybe I just avoid the obvious garbage.", "label": 0}
{"text": "...And here I am, wishing I could boot the chest off so a party member can ride there.", "label": 0}
{"text": "At this point does anyone think it *won't* be coming as a mount sale for a future expansion for a cash infusion?\n\nI'm also expecting a future cash mount that will be not just portable banks (like an expanded warband bank) but also give you several extra bank tabs.  That one will sell like hotcakes.\n\nAfter that we'll probably get ones that offers what are normally service requests, like allowing charcater re-naming or character/item restoration. or race changes.  Or additional portal options and capability.\n\nThe community has shown that this stuff is lucrative and so it would be pretty naive to not think a lot more is coming.", "label": 0}
{"text": "Yes, but people had that gold already. You know the gold sellers are the ones making out.", "label": 0}
{"text": "It do be like that", "label": 0}
{"text": "I’ve been playing since Vanilla and I really don’t understand why people will complain so much over a price pointed mount, 1000’s of other people are gonna buy it, it’s why I never bothered to get a yak in MoP I just use other people’s", "label": 0}
{"text": "This absolutely", "label": 0}
{"text": "How to get this mount?", "label": 0}
{"text": "Looks like meat is back on the menu, boys!", "label": 0}
{"text": "When you buy the token it’s a physical item in your inventory. When you click on it to use it, it adds $15 to your battle.net account.", "label": 0}
{"text": "You can invite your whole family if you want :)", "label": 0}
{"text": "This is amazing.\n\nNever thought I'd see an MMORPG self-serve snitch line.", "label": 0}
{"text": "Either to test before race changing or just for fun", "label": 0}
{"text": "$132 CAD yeah no thank you 😂", "label": 0}
{"text": "No one is defending the salary. \n\nThey're attacking the stupid ass player logic that the layoffs in gaming or Warcraft's performance are somehow significant factors in this guy's salary. Those millions aren't on the backs of layoffs, this is the company with the largest stake in OpenAI and the second most successful cloud.\n\nYou could maybe make the argument if this was a Phil Spencer story, but it's not.", "label": 0}
{"text": "Why would you have an addon that tracks declines and delists, that just sounds like you're torturing yourself and want to be mad.", "label": 0}
{"text": "Warlocks would go on strike.", "label": 0}
{"text": "Imagine finding out a recent acquaintance or a long time friend acts like this lmao. People are unhinged these days in America.", "label": 0}
{"text": "It's not how capitalism works. It's how publicly traded companies work.\n\nThe solution? Don't make your company publicly traded. As a customer don't do business with one that is. Even private companies aren't really safe. But there are options. Take Epic games and Valve for example... One has nearly half their shares owned by Tencent the other doesn't, guess which one is the shittier store of the two?", "label": 0}
{"text": "You can sell it for real money on a number of marketplaces like people do all the time. Ive personally sold and bought expensive cs skins with no issues for real money.", "label": 0}
{"text": "Do you play on EU, have a lot of characters and want a bit of Gold for a 5m job? (Sulfuron Hammer Plans)", "label": 0}
{"text": "Warlocks on suicide watch", "label": 0}
{"text": "You sir and or madam are my saviour. I miss my garrison lol I’m going to go chill with the boys", "label": 0}
{"text": "Yeeee! I know now :D thank you!", "label": 0}
{"text": "Fair, I didn’t think of that. I don’t know the ins & outs of how they operate, just made a bad assumption, I guess?", "label": 0}
{"text": "Oh 6.1 never forget.", "label": 0}
{"text": "I got the Doomhawk from DW at a time I was barely playing. Walked right into the boss fight at the end, still don't know why he was out there. World quest?", "label": 0}
{"text": "did you mean “ to me it looks fine “ ?! * genuine question *", "label": 0}
{"text": "I ain't got shit. \n\nOnly mounts I'm matching at the celebration is a velocidrake!", "label": 0}
{"text": "1/4 is an exaggeration, it's probably closer to a half.\n\nBut regardless, the point is players love wow so whether or not you like it, they doing a really good job at keeping the game alive for 20 years. And the numbers prove that.", "label": 0}
{"text": "Stop rushing and crying for new content, problems will be solved", "label": 0}
{"text": "That's literally the objective of every content creator because of how the algorithm works.", "label": 0}
{"text": "This entire expansion has been that way.", "label": 0}
{"text": "> where pugging a key is a guaranteed chill and timed run.\n\nIn pugging there is no guarantee the run will go well. If anything the risk of the run going poorly can be quite high.\n\n> instead of learning the new info, and just go again but with improved gameplay, I'm now punished with hopefully hours (and not days) of frustration just to get another chance.\n\nHere's the website (https://not-even-close.com/)\n\n> All of that was just to say that this gameplay loop makes no sense to me\n\nPerhaps you would get more enjoyment out of M+ with an established group/team instead of relying on PuGs. Yeah I get that PuGs are convenient to your schedule but it also means there's a giant black hole of unknowns with PuGs. Are these players any good? Do they have relevant experience? Etc etc", "label": 0}
{"text": "> I wouldn't say notches, rather several flights of stairs.\n\nBlizzard, to the QA team: \"I TOLD YOU ABOUT STAIRS, BRO!\"", "label": 0}
{"text": "The fact that this man can make a living from what he does is a complete joke", "label": 0}
{"text": "Believe whatever conspiracy you want, I'm telling you why it's happening.\n\nGo mine a node, and then sit there for a minute. It will disappear. Go watch somebody mine a node, and then wait a minute and it will disappear. Have a friend stand outside of your group, or drop a toy on the ground, you'll notice that no phasing takes place.\n\nWithout phasing, without moving, just stare at it and the node will still disappear, it's not a bug.", "label": 0}
{"text": "Is this supposed to make sense?", "label": 0}
{"text": "Comical because you might don't know how finantial market works. Investors want ROI at a good margin comparing to the industry benchmarkings. Or do you thing they want to know if the cash come from a vanity item such mounts or content paywalls? My dude, they don't even know that WoW is a thing inside ATVI quaterly reports.   \n  \nContrary to what some anti-capitalists might say, enterprises are not pursuing infinite revenues. Market is predatory but it also plays with some rules because costumers have needs and opinions. You might rush for profit as a small company but it will crash in the big run. \n\nYour opinion is valid, people not buying this mount might be a signal. But if it's a sucess, doesn't imply that Blizzard then will start to make pay-to-wins and paywalls movements. If you understand how marketing and costumer developmet works, it's actually a sign that they could invest more in vanity items such mounts and mogs, instead of payed content, paywalls, etc.\n\nToo much crying for a mount. Just stay vigilant for paywalls and pay-to-wins and other things that will actually depredate the game, focus your complaning in other things that the game already need to improve. Selling mount is not the main thing. Fixing patches before release is. Did you take a look at how many bugs we have? Or too busy with the brutossaur?", "label": 0}
{"text": "good news is that the token price looks like it might be dropping already. good luck in your farming!", "label": 0}
{"text": "You got me, I would by that 😹", "label": 0}
{"text": "How many are in your group? Let's say you have a team of 5. That's 5 keys right there. And if someone has a bad one, re-roll them at the end of a timed dungeon.", "label": 0}
{"text": "Meh, idk about permaban. People mature and learn. Definitely at LEAST a year ban though.", "label": 0}
{"text": "You could read the book yourself and it'll verify literally everything I've said in this post.\n\nI recommend it regardless, since it's an amazing book.\n\nOther highlights from the book include\n- Rob Parso and Chris Metzen HATED each other\n- Chris Metzen was almost fired for a drunken brawl in the office\n- Blizzard were banned from an Anaheim hotel for an employee throwing up, knocking on every guest's door, and passing out drunk in the hallway\n- Starcraft sold 1 copy for every 10 citizens in South Korea\n- Starcraft's success in South Korea was a ripple effect from the financial collapse of Thailand\n- Hearthstone was in development for 4 years without ever being greenlit\n\n>It's nothing unique, you only posted it because of this mount, and you probably have not even read the book.\n\nIs it disrupting the cadence of your post history of being a miserable, trolling bastard?", "label": 0}
{"text": "The next mount will have transmog, bank, AH, and mail, and will fly. \n\nIt will sell for $125. Blizzard will sell 1.8 million of them", "label": 0}
{"text": "Sell them to me", "label": 0}
{"text": "Hi /u/Sonotmethen, thanks for your art submission!\n\nPlease make sure you've included the artist's name in the title of your post if you are not the OC, or your post may be removed. If you would like, you can also make a top-level comment or reply to this sticky with further details regarding where to find the artist; for example, their social media links or Etsy shop.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wow) if you have any questions or concerns.*", "label": 0}
{"text": "There is a \"Shoulder\" as 8th piece to finish the collection. The Set showed up in my Collection Tab, but now, no matter what I tried, cannot retrieve it to show ... Delog relog, exiting the game; none of this works. And like you, 7 runs, 7 drops, then nothing with other character and from that moment it stopped to loot, the Set from the Tab Collection disappeared ...", "label": 0}
{"text": "It's kinda \"funny\" to see wow players react to this yet it rings so familiar for people who have played recent mobile or korean-grinder-like games.", "label": 0}
{"text": "You can have mine, I'm not using it. LOL", "label": 0}
{"text": "my bad, I should have just looked for and linked this \n\n  \n[https://us.battle.net/support/en/article/49217#:\\~:text=Mining%20and%20herbalism%20nodes%20may,report%20it%20as%20a%20bug](https://us.battle.net/support/en/article/49217#:~:text=Mining%20and%20herbalism%20nodes%20may,report%20it%20as%20a%20bug)", "label": 0}
{"text": "a brutosaur is just a cat with a long neck, right? so you were just adopting a new kitty is all!", "label": 0}
{"text": "That should not be possible. There is a hardcap for 48 bronze coins per ACCOUNT in place for week 1.", "label": 0}
{"text": "It is how CEO salary works.\n\nYou wouldn't argue that Satya shouldn't be paid a bonus if the company as a whole did great but Mixer was a bust, because Mixer never was a significant portion of Microsoft's overall performance.\n\nLikewise, Warcraft doesn't mean dick in terms of the company's overall performance.", "label": 0}
{"text": "So a mobile Garrison?", "label": 0}
{"text": "Not a bot, unfortunately. That's a DBZ reference. Kkrt = Kakarot, SSJ = Super Saiyan.\n\nI need a life.", "label": 0}
{"text": "can just farm 1.2 mil gold and buy it you have a few months.", "label": 0}
{"text": "Why would you ever look in the top left corner? And if you do keep your player frame in the top left corner how do you ever know when you are low on health or took a huge hit of damage and need to pop a cool down or potion? \n\nImportant information should be in the center of your screen where your eyes tend to be", "label": 0}
{"text": "Shield gets in the way of holding a 2nd weapon.", "label": 0}
{"text": "Snitch.", "label": 0}
{"text": "You’re very welcome. Healing is a lot of fun—wish the community wasn’t so toxic to healers.", "label": 0}
{"text": "I don't. The only way to limit myself to not play too much is my 11:30 pm bed time cuz i gotta get up at 7 for work LOL", "label": 0}
{"text": "its not a bot, its supposed to be \"kakarot super saiyajin\" from Dragon Ball Z", "label": 0}
{"text": "His opinions shift about as often as his hairline lol", "label": 0}
{"text": "wait, how do you do that? what gets shared?", "label": 0}
{"text": "The cope.", "label": 0}
{"text": "My point is that the only source of a banwave is the title of this post. According to the screenshot this user could have been banned before buying the mount.\n\nSo poster jumped to conclusions, everyone on this reddit thread decided to follow him and take the same leap.", "label": 0}
{"text": "Wait there is an AoTC reward mount?\n\nI earned that achievement by sitting through 6 hours of derp-ass pugs standing in web blades and I didn’t even realize there was a mount… I did it for the dopamine hit of seeing a stupid little gold icon flash across my screen.  \n\nThis thing better be less ugly than the mount she drops.", "label": 0}
{"text": "No offense, but I think you just demonstrated why Blizzard feels it doesn't have to pay it's employees fair compensation.", "label": 0}
{"text": "I'm glad I'm not the only one scarred by those fucking WQ's", "label": 0}
{"text": "It was for a limited time, big fomo as it was hyped as \"limited\" if you didn't get it back in D3, so people went to buy it in droves, only for them to release it on the trading post a few months later.\n\n[Store Announcement](https://www.reddit.com/r/wow/s/eT2ZT3wLWz)", "label": 0}
{"text": "Yes, if you want a normal vault slot you need to kill 5 or less heroic bosses and then fill the rest up with normal kills. You can only get Queen gear from normal vault spots as you’ve only killed her on normal.", "label": 0}
{"text": "They can still break some barriers and design auto buy mounts even after the gilded brute. 3 seats, flying, etc.", "label": 0}
{"text": "And just like the dracthyr when your wearing clothes you can’t see it😂😂\n\nOnly joking\n\nsome nice fine line work there", "label": 0}
{"text": "Mine is called Beefshank", "label": 0}
{"text": "So they just make anything ugly with a disproportionately large head and eyes and sell it as ‘cute’ now…?", "label": 0}
{"text": "Yeah it's \"The Blizzard Tax\".\n\nWhen Riot games kicked off, they poached a LOT of Blizzard staff. Their QA makes double Blizzard's QA salary.", "label": 0}
{"text": "Exactly my point, it was free at the trading post, but they had sold it and created FOMO in the community months before in the in-game shop, causing people to buy it, only to give it for free a few months later.", "label": 0}
{"text": "Blizzard had an executive board the entire time they had top flight QA and customer service and were paying out large revenue sharing bonuses with members of the WoW team. \n\n  \nNone of those things violate their fiduciary responsibility. That's why they had them for decades with no legal issues.", "label": 0}
{"text": "Blizzard thinks a bronto mount would make them money? I’d literally race change all my toons. I had about 25 70s at the end of dragonflight.", "label": 0}
{"text": "I stopped reading at \"outdated\" and \"Classic Player\" lmao", "label": 0}
{"text": "Nothing like barely struggling to make it through a Dawnbreaker with an RSham that is neck and neck with me as tank for HPS, then get to the end and they've 0 casts of Ascendance, SLT and AG.", "label": 0}
{"text": "would you say they are outlawed? lol", "label": 0}
{"text": "Party trick turns party of 10 to a party of one. 😂😂", "label": 0}
{"text": "If anything this post is an indication of em being bought with gold. No one who's buying it with money would interact with a token.", "label": 0}
{"text": "I’m not buying the mount until next month when my paycheck comes in, and until then I’ve just been mooching off everyone else’s brutos bc there’s always one a stone’s throw away from my crafting table lol", "label": 0}
{"text": "Try hitting escape and clicking the “edit mode” button. Should be able to click and drag it to wherever you please from there", "label": 0}
{"text": "On peut finalement dès aujourd'hui! Je l'attendais aussi de pied ferme", "label": 0}
{"text": "Normally I use it as a cutoff point \"hey lets try X groups for Y time, if I am unlucky then i'll just try some other day\"", "label": 0}
{"text": "Auto attack", "label": 0}
{"text": "Yeah but how am I supposed to do that from the terlit??", "label": 0}
{"text": "and he sleeps in the backpack! i love him so much <3", "label": 0}
{"text": "I’m sure that’s a devastating blow to their self-confidence", "label": 0}
{"text": "True that. I'm sticking with this for now xD", "label": 0}
{"text": "Yeah, who cares about you know, making honest content as long as the algorith pays!", "label": 0}
{"text": "All of this is valid criticism, maybe except content too hard - you don't need to do +10.", "label": 0}
{"text": "I was all \"ya! Why don't we have them, that's ridiculous blizz wtf.\"\n\nBut you know, you are right. Just fly there.  30 seconds is nothing. The zone layouts are very accessible from flight points.", "label": 0}
{"text": "this is fucking idiotic, jfc how has heroic remained untouched", "label": 0}
{"text": "You can also buy gold from 3rd parties too. So what?", "label": 0}
{"text": "Doesn't any number end up even if you multiply it by 100?", "label": 0}
{"text": "We've been trying to reach you about your auction house's extended warranty.", "label": 0}
{"text": "[Here you go.](https://raider.io/characters/eu/tarren-mill/Ellys) Just to note, the dungeons I want to join to increase my score are also hard to get into (though outside of score I have no bussiness doing them, drops wise and so on).", "label": 0}
{"text": "Incredible luck. Yes. Go get a lottery ticket.", "label": 0}
{"text": "It also might being going on sale within the next few weeks. Lots of holiday sales coming up", "label": 0}
{"text": "The loot pool is based entirely on which bosses you've cleared, not their difficulty.\n\nSince you are at 8/8N, you have access to the entire pool.\n\nTie tier of the reward however, ilvl, is based on the vault tiles and bosses cleared.\n\nYes, having 6+ H kills will cannibalize the chance to get a Normal queen drop, since the Heroic drops can only tap from 7/8.", "label": 0}
{"text": "How about we add \"in\" in front of finite growth, make it happen at any cost. \n\nThis is where we are today, every man hour is seen as having to produce their salary back 400 times over. Blizzard will never ever make a product again that pays its staff a good salary, execs a good profit and covers the production it just needs to be 20 times that. Quality is irrelevant in this equation.", "label": 0}
{"text": "Bragging? It's only $90. It's easy to waste that on a single night out.", "label": 0}
{"text": "Usually fine with the store mounts but this one is too much. They could have easily brought back pronto for the 20th or this new mount. Not a 90 dollar screw fest. That's just too much.", "label": 0}
{"text": "Sure cope! Cause spending our in game gold is a crime for ms Karen over here.", "label": 0}
{"text": "No, we have a $90 mount because they know countless people will buy it, especially since it's apparently a limited time thing.", "label": 0}
{"text": "Arguable at best. If elves both night, blood and void then ALWAYS female bc male looks horrendous.\n\nWith that said plate armor looks super bad on female elves due to how skinny they are.. casters looks great though", "label": 0}
{"text": "Only cost me like 1.6m. Knew I should've stacked tokens at 180k", "label": 0}
{"text": "> I understand grabbing a big pack and testing your limits right away but for some reason tanks don't even try to put out threat when gathering anymore. Mobs peel off or start casting while they are still running around gathering and its a total shit show and like I said its damn near every tank these days.\n\nI mean that doesn't happen unless DPS are randomly wailing on them, in which case do I even need to say it?\n\n> These tanks also never allow combat to drop so re-stealth (massive damage buff for assassination) and healer drinking go out the window.\n\nThis depends entirely on your composition, some classes like SPriest or BM you want to chain pull because of how their kit works, assass sure you can go for small breaks. Healer drinking isn't an issue at all if people are playing well, there's far less damage going out in higher keys ironically, because people are actually interupting/stunning the packs and using defensives which means healer mana usually stays pretty healthy throughout.", "label": 0}
{"text": "At the og release it was.", "label": 0}
{"text": "Well yea, he shifts were the community goes to get views like most gaming youtubers lol", "label": 0}
{"text": "What.", "label": 0}
{"text": "> A location marker on google maps is not a fixed location in physical space.\n\n\nThe mining node isn't a location marker. It's the visual representation of the physical place you're trying to get to. Again, there is no real world analogy of seeing a restaurant, going to it and being unable to enter because it \"doesn't exist\" on your shard. \n\n\n\n> You could theoretically download google maps and make up all fake locations and it would treat them the same. \n\n\nYou're unironically making my point lol. This is because you have a fixed physical point that doesn't change. Your GPS coordinates do not have to account for being in new york shard 1 or new york shard 2. \n\n\n\n> This is not that different from how WoW tracks your location relative to the mapped grid.\n\n\nThe mapped grid is multiple copies of the same map placed on top of each other, so it's extremely different. \n\n\n\n> I don't know why I typed that.\n\n\nI don't either.", "label": 0}
{"text": "It was a super interesting book. I highly recommend it to anyone remotely interested in the history of blizzard or want to understand why the blizzard today is what it is. Regardless of what your opinion of what blizzard today is.\n\nI have not read Schriers two other books, but they are on my \"to read\" list after how great this one was.", "label": 0}
{"text": "For 90 dollars? Pass. If it was 20 dollars, maybe. I just wish all wow player could just band together and boycott this overpriced might.", "label": 0}
{"text": "So…… who else bought the bruto?", "label": 0}
{"text": "Same. The trailer for the documentary put me to tears and so did this video.", "label": 0}
{"text": "Lets do a lil math here, it took me 1.5hrs of work to buy big boi and I enjoy farming and playing the AH. I get roughly 40-90min per day playtime of which 20-40 min are spent on AH and then 5min just to travel back and resume my farm. The whining from players because of this mount is unreal. I'm sorry not sorry that you live paycheck to paycheck but that's really not my problem bruh stop trying to dictate how I spend my money. Hell I could buy 6 more of these just for the full work day", "label": 0}
{"text": "Mount's been around for like 17 years now, I wouldn't mind if they just gave it away for free at this point", "label": 0}
{"text": "Ha! This is no tailoring bug. OP is obviously just using my PC... takes half an hour to phase everything in every time I change zone :-(\n\n\\[Serious point - this is a real thing, people. I'm a healer I often only get to see the dungeon once the tank's already pulled 10 trash packs and everyone's on 10% HP. Tanks! Listen up! Don't start the instance until you see your healer move!!\\]", "label": 0}
{"text": "And most importantly: ***DO NOT RESPOND, EVEN TO SAY 'STOP CONTACTING ME'.***\n\nOtherwise, the GM's view it as a two-way conversation and jam their thumb up their ass.", "label": 0}
{"text": "Sadly that's a large portion of youtube these days lol", "label": 0}
{"text": "I play 1 hour a day if at all and made 7m this xpac so far.", "label": 0}
{"text": "Idk i was just happy that there was something i could sink some of my steadily increasing 11x gold cap into.", "label": 0}
{"text": "that’s kinda what people don’t get about the price. it’s that high specifically because the people who benefit from this are the same people who have millions of gold stored away from professions and sit at their crafting table to take orders in trade chat. not only did those people probably get this for free with wow tokens, but they have probably already made that gold back and will get even more faster *because* this mount cuts out the time they otherwise spend moving between AH, mailbox, and crafting table.\n\nfor the average player or people who focus more on dungeons/raids/pvp/etc., this mount is mostly worthless and not worth the cost. for the profession goblins, this mount is probably the best thing they can buy in this game.", "label": 0}
{"text": "I doubt those people harbor the self awareness to feel shame, so I don't really care. I am just entertaining myself", "label": 0}
{"text": "I give the devs a lot of grief and sometimes rightfully so and many times unrightfully. These book highlights do make sense though in blizzard’s decision making ability as of late. So sad.  Why must everything get worse as one gets older.", "label": 0}
{"text": "Welcome to the game! Have fun! Btw, you character’s health bars and target health bars are called “unit frames”. More specifically, player frame and target frames!", "label": 0}
{"text": "Ya I notices this too when I did firelands today.", "label": 0}
{"text": "Broken clock works twice a day.", "label": 0}
{"text": "Sorry.  Youre wrong.  You probably play a Tauren, which the makes you doubly wrong.  \n\n(This whole thread is in jest)", "label": 0}
{"text": "It’s not up to us to get blizzard to give money to charity.", "label": 0}
{"text": "it will probably stabilize pretty soon, i dont see it spiking again, or going below what the price was before the announcement", "label": 0}
{"text": "People need money sinks to combat the inflation! >!/s!<", "label": 0}
{"text": "Women. ☕️", "label": 0}
{"text": "no you have a $90 mount because OW2 proved blizzard fans will buy anything then when they continue to get milked with  MTX crap and no actual content the best they do is surprise pikachu.", "label": 0}
{"text": "Other games are able to do more with less. Let’s be real, most of the money is going to fatten one or two guys wallets. Everyone else is getting paid less than market value wages, or entire departments (like customer service) and getting scrapped and replaced with ai. \n\nYes costs to increase, but these companies have gotten much more efficient at scalping people’s wages since 04, and I’d reckon they are probably pulling more profits now than they were then by percentage.", "label": 0}
{"text": "I had it since BFAZ I do it sometimes as a joke but I’ll remount for whoever I interrupted using it. People use to wig out in oribos lol", "label": 0}
{"text": "Just not buying the stupid thing is a lost concept for some people it seems", "label": 0}
{"text": "I get what you're saying but that solution will never happen on a grand scale. The companies that dominate a space will always bet the public ones", "label": 0}
{"text": "well I mean everyone who followed the Activision Blizzard merge knew were the problems came from.\n\nWotLK was the last expansion that was developed without the Activision influence. Despite some more \"casual\" mechanics that some didn't like the expansion as a whole was what many call \"the last old school WoW expansion\". Despite the success of WotLK it was the first time they introduced a shop mount (what a surprise shortly after the merge).\n\nActivision is what kills creative game design. Take a look at CoD. Activision doesn't want good games, they want a lot of profit.\n\nThe whole gaming industry is (hopefully) before a crash. The moment good game design wasn't the best way to make money anymore, the game quality dropped", "label": 0}
{"text": "what problem does this mount existing cause for you? whales have the money to afford it if they want it, and you don’t *have* to buy this to use the AH or the mailbox. it doesn’t intefere with your gameplay at all if you don’t buy it.", "label": 0}
{"text": "You should see the things people do to play iracing, a subscription based game. xD", "label": 0}
{"text": "Should have used the proceeds of the $90 mount and donate to this charity. Would probably meet the donation goal. Blizzard knew what they were doing.", "label": 0}
{"text": "Then openly mock their whale status", "label": 0}
{"text": "I know what some of those words mean.", "label": 0}
{"text": "Havnt changed my dracthyrs look in two years, why start now? ;p \n\nthe artist is amazing, she doodled this in 18 minutes based on a screenshot before applying it to me! My first tattoo, but Im now def gonna get more.", "label": 0}
{"text": "Imagine getting aggro over a joke website", "label": 0}
{"text": "I mean, obviously no one can but I seen people saying what will probably happen in regards to how it went the last expansions.. I'm not asking you to predict it.", "label": 0}
{"text": "Stand by the crafting table and realize \"oh shit i need 1 more item\".\n\nInstead of flying to AH, just mount up and get it.\n\nAnd a lot of other stuff.", "label": 0}
